{"id": "c67caac2e64c8d97fabb24d72f9cb91a", "url": "https://www.bonappetit.com/recipe/tandoori-chicken-wings", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "Tandoori Chicken Wings Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTandoori Chicken WingsBy Molly BazJuly 31, 20183.8(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Judy ManciniEmailPinterestPrintEmailPinterestPrintThese spicy, tangy wings benefit from just 2 hours in the marinade, but if you’ve got the time and the determination, a full 8 hours will make magic happen. The yogurt tenderizes the chicken as it sits, so the further in advance you make this recipe, the better!Ingredients4–6 servings3lb. chicken wings, drumettes and flats separatedKosher salt4medium Fresno chiles, stems removed, coarsely chopped13\" piece ginger, peeled, finely grated4garlic cloves2Tbsp. garam masala1Tbsp. plus 1½ tsp. smoked paprika2¼cups cilantro leaves with tender stems, divided¾cup plain whole-milk yogurt¼cup fresh lemon juiceVegetable oil (for grill)Lemon wedges (for serving)PreparationStep 1Season chicken wings generously with salt and place in a one-gallon resealable plastic bag.Step 2Pulse chiles, ginger, garlic, garam masala, paprika, and 2 cups cilantro in a food processor until finely chopped. Add yogurt and lemon juice and pulse, scraping down sides as necessary, until smooth and well combined. Pour marinade into bag with chicken. Seal bag and turn to evenly coat chicken with marinade. Chill at least 2 hours and up to 8.Step 3Let chicken sit at room temperature 1 hour before grilling.Step 4Prepare a grill for medium heat; oil grate. Remove chicken from marinade, letting excess drip back into bag, and grill, turning every 3–4 minutes, until charred in spots and cooked through, 10–12 minutes total. Transfer to a platter and let rest 5 minutes.Step 5Chop remaining ¼ cup cilantro and sprinkle over wings. Serve with lemon wedges alongside.How would you rate Tandoori Chicken Wings?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleFantastic recipe! And so easy. Carolina RosadoHamburg, Germany7/26/2021Love this recipe! Made these for my family the other night and was a huge hit. Super simple and tasty. I really like the move with the yogurt... I never would have thought about that!\nThanks Molly and BA for this delicious Indian treat! Keep em coming!AnonymousBoston8/9/2018What the ?\nGet Off Your High Horse - tandoor is a type of oven and not a specific mix.\nThe term tandoor /tɑːnˈdʊər/ refers to a variety of ovens, the most commonly known is a cylindrical clay or metal oven used in cooking and baking. The tandoor is used for cooking in Southern, Central and Western Asia, as well as in the South Caucasus. The heat for a tandoor was traditionally generated by a charcoal or wood fire, burning within the tandoor itself, thus exposing the food to live-fire, radiant heat cooking, and hot-air, convection cooking, and smoking by the fat and food...AnonymousTexas8/8/2018\"up to 24 hours\"? What?! Any informed recipe-writer or Indian cook knows that a citrus marinade denatures proteins in chicken past about 8 hours, to a point of mush. It becomes ceviche chicken at 24 hours in a citrus bath. Overnight acidic soaking has been debunked over and over. And where's the kasoori methi or Kashmiri red chili or chaat masala or cumin or coriander? You mention garam masala but that alone doesn't constitute a tandoori mix, despite having elements of one. Sure there are variations, but this isn't one. The writer and editor of this recipe are under-informed and discrediting BA's otherwise tempting recipes. Indian dishes and adaptations of them should make BA more often, but please know what you're talking about first.What the?8/1/2018Explore Bon AppétitIndianSouth AsianAsianChicken WingChickenPoultryFresno ChileChileVegetableYogurtOther IngredientsEasyStarterMainGluten-FreeNut-FreeKetoGrillingSuper BowlFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-31", "author": ["Condé Nast", "Molly Baz"]}