{"id": "c67ea10a96091c31827157e720849f89", "url": "https://www.bonappetit.com/recipe/simple-carbonara", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "Simple Carbonara Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueSimple CarbonaraBy Claire SaffitzFebruary 5, 20184.5(464)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Styling by Molly BazEmailPinterestPrintEmailPinterestPrintHumble ingredients—eggs, noodles, cheese, and pork—combine to create glossy, glorious pasta carbonara. It's the no-food-in-the-house dinner of our dreams.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonTongs$13 At AmazonChef's Knife$34.53 At AmazonHeatproof Measuring Cup$18 At AmazonBox Grater$13 At AmazonWhisk$10 At AmazonMeasuring Spoons$10 At Bon Appétit MarketLarge Pot$55 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonWooden Spoon$6 At AmazonColander$11 At AmazonIngredients4 servings3Tbsp. kosher salt, plus more4oz. guanciale (salt-cured pork jowl), pancetta (Italian bacon), or bacon2oz. Parmesan4large egg yolks2large eggsFreshly ground black pepper2Tbsp. extra-virgin olive oil1lb. spaghetti, bucatini, or rigatoniPreparationStep 1Heat 6 qt. water in a large pot over high. When water starts to steam, add 3 Tbsp. salt and cover pot with a lid (this will bring water to a boil faster).Step 2While you are waiting on the water, do a little prep. Remove 4 oz. guanciale from packaging and cut into about 1x¼\" strips. Finely grate 2 oz. cheese and set aside one-quarter of cheese for later.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Whisk 4 egg yolks and 2 whole eggs in a medium bowl until no streaks remain, then stir in remaining grated cheese. Add several cranks of pepper and set aside.Step 4Working next to pot, heat 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium. Add guanciale and cook, stirring occasionally, until crisp around the edges, 7–10 minutes.Step 5Remove pot from heat. Using a wooden spoon, fish out guanciale and transfer to a small bowl. Pour fat into a heatproof measuring cup, then add back about 3 Tbsp. to pot. Discard any remaining fat.Step 6Cook 1 lb. pasta in boiling water, stirring occasionally, 2 minutes shy of package instructions. Just before pasta is finished, scoop out 1¾ cups pasta cooking liquid with same heatproof measuring cup.Step 7Add 1 cup reserved pasta cooking liquid to Dutch oven and bring to a boil over medium-high. Drain pasta in a colander, then transfer to Dutch oven.Step 8Cook pasta, stirring constantly and vigorously, until al dente and water is reduced by about half, about 2 minutes. Remove pot from heat.Step 9Whisk ¼ cup pasta cooking liquid into reserved egg mixture, then very slowly stream into Dutch oven, stirring constantly, until cheese is melted and egg is thickened to form a glossy sauce. Season with salt, if needed. Thin sauce with remaining ½ cup pasta cooking liquid, adding a tablespoonful at a time, until it's the consistency of heavy cream (you most likely won’t use all of it).Step 10Mix in guanciale and divide pasta among bowls. Top with pepper and reserved cheese.How would you rate Simple Carbonara?Leave a ReviewTell us what you thinkReviews (95)Back to TopTriangleI’ve been hesitant to make this since I thought I’d scramble the eggs, but this recipe was easy to follow and came out perfectly. We needed to make something when we really needed to do a grocery run, and all we had for pasta in the pantry was campanelle, and it still came out great. I added in some frozen peas just because we had half a bag, and it was pretty tasty. Anonymous3/17/2022I followed the recipe and the result was absolutely perfect carbonara. Tasted better than some of the restaurants we’ve eaten in. No cream! That is the key. Too many of the recipes turn it into Alfredo. This is the best!jkuhnMankato MN3/13/2022Too salty, will used less salt in the pasta water next time. PariSouth Florida 3/6/2022looks easy enough and fast.  Thx.  I'll try it this weekend.Peri KirosMelbourne, FL3/3/2022I will never make packaged bacon carbonara again! This is by far the best recipe I've tried and will never use another! Lori LynnWrentham, AB2/20/2022Does anyone know if 4 egg yolks and 2 whole eggs means 6 eggs total or just 4 eggs with 2 of them being whole. Sorry if that's confusing and thank you in advance!AnonymousBoulder, CO1/27/2022@Michelle. I've never seen anyone so riled up over the word 'noodles'. Lol \n\nRecipe is great btw. Added some lemon zest & juice for balance.AnonymousOttawa, Ontario1/27/2022Fantastic recipe.  1st time I have successfully done the eggs without cooking them.  I added the juice of one lemon for an extra layer of flavor. I added all of the pasta water and we used lightly toasted Ciabatta slices to sop us the extra sauce.  Ken RauAtlanta, Ga1/25/2022The amounts in the recipes don't make sense and don't correlate with the short clips. Step 7 asks you to put a full cup of pasta water in the dutch oven along with the 3 tablespoons of fat, yet it seems there is a lot less in the clip. \n\nStep 8 asks you to boil until the amount of water is halved, yet in the clip we see that the bottom is completely dry!\n\nI will try again, halving the amounts of water and I'm pretty sure I'll find success there.JF LQuebec, Canada1/3/2022Great, easy recipe. Definitely didn’t use as much salt in the boiling water as they recommend. Turned out excellent. Added in cherry tomatoes at the end to add some color and goodness. Will be adding this to my list of go to Bon Appetit recipes. Richard StarkeyThe Tetons, Wydaho12/29/2021Quick and easy carbonara.  I don't understand why some people use cream in this dish.  If you follow the easy instructions you end up with a succulent dish that is pleasing to eat and share.MBGreenville, SC11/27/2021Sorry but this came out like pasta with cheesy scrambled eggs. I halved the recipe because the amounts in this recipe were just too big. I used bacon, cut back on the salt, electing to add some later a little at a time as the bacon has salt in it. I also used freshly grated parmesan, so no excuses with ingredients. It's missing something huge but I don't know what. I tried to salvage it with a pinch of garlic powder and a table spoon or two of heavy cream but it still ended up in the garbage.AnonymousToronto, Canada11/18/2021Great carbonara recipe. Using the dutch oven to finish cooking the pasta is a good way of making sure to get all the flavour into it. I didn't put as much salt as that into the pasta water though because that just seems crazy.JimbaliLondon, UK11/15/2021WAY TOO SALTY.  Using the pasta water made the dish too salty, my wife couldn’t eat it.John CanfieldWilliamsburg, Virginia 10/28/2021Absolutely delicious, and so easy. The boyfriend was meeting the boys for dinner, I whipped this up for myself, but the boyfriend couldn’t stop eating before he left for dinner with the boys! 🤣🤣 \nLoved it and will definitely make again.AnonymousChicago 9/25/2021Explore Bon AppétitPastaItalianEuropeanGuancialeCured MeatMeatPancettaBaconSpaghettiPasta & NoodlesRigatoniBucatiniEasyWeeknight MealsQuick5 Ingredients or FewerMainNut-FreeSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-05", "author": ["Condé Nast", "Claire Saffitz"]}