{"id": "c69b08ed0107205f64d4e35215c04aae", "url": "https://www.bonappetit.com/recipe/soy-saucemarinated-grilled-flank-steak-and-scallions", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Grilled Flank Steak and Scallions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueSoy Sauce–Marinated Grilled Flank Steak and ScallionsBy Claire SaffitzMay 21, 20194.8(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintWe're flipping the script and marinating after grilling. Inspired by the technique called escabèche, where cooked fish and meat are preserved in an acidic mixture, we're cooking first, marinating second—in this case, it's in a spicy-sweet soy sauce-brown sugar-Sriracha mixture. Because flank steak is flavorful but quite lean, take care not to overcook it (medium-rare is best) and be absolutely certain you’re slicing against the grain.Ingredients4 servings3Tbsp. extra-virgin olive oil, divided, plus more for grill1½lb. flank steakKosher salt, freshly ground pepper1bunch scallions, trimmed¼cup mirin (sweet Japanese rice wine)¼cup soy sauce2Tbsp. light brown sugar1Tbsp. distilled white vinegar1Tbsp. Sriracha2tsp. toasted sesame oilToasted sesame seeds (for serving)PreparationStep 1Prepare a grill for medium-high heat; lightly oil grate. Pat steak dry and place on a rimmed baking sheet. Lightly score both sides of steak with the tip of a paring knife, making shallow parallel cuts (no deeper than an ⅛\") about 1\" apart and running across the grain of the meat (this will prevent the steak from curling as it cooks). Season generously all over with salt and pepper; let sit at room temperature at least 30 minutes and up to 1 hour.Step 2Meanwhile, toss scallions on another baking sheet with 2 Tbsp. olive oil to coat; season with salt and pepper.Step 3Whisk mirin, soy sauce, brown sugar, vinegar, Sriracha, and sesame oil in a medium bowl until sugar is dissolved; set marinade aside.Step 4Pat steak dry again (the salt will have drawn out more moisture) and rub with remaining 1 Tbsp. olive oil. Grill scallions, turning often, until tender and charred in spots, about 1 minute. Return to baking sheet. Grill steak, turning every 2 minutes or so, until medium-rare, 6–8 minutes. Transfer to a cutting board and let rest 10–15 minutes.Step 5Thinly slice steak crosswise and arrange on a rimmed platter; drizzle all of the juices that have collected on the cutting board over. Arrange grilled scallions on top of the steak, then pour reserved marinade over. Let sit at least 15 minutes and up to 1 hour before serving. To serve, sprinkle with sesame seeds as desired.How would you rate Soy Sauce–Marinated Grilled Flank Steak and Scallions?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleDelicious and easy!! I reduced the amount of Sriracha because my husband doesn't like things too spicy. I was worried the flaver of the marinade wouldn't get into the meat at the end but it was absolutely delicious!!Mardy MRolling Hills Estates, CA8/30/2021Does this recipe use liquid sriracha chili sauce or dry Sriracha seasoning?  I used dry, and loved it, but wondering what the original recipe calls for. AnonymousSouth Carolina9/25/2020This was delicious. The flavor was bold and tangy. Really easy summer meal.mmoriciJersey City, NJ7/27/2020Made this recipe last night and it was fantastic! I had never cooked flank steak before, and now I can't wait to cook it again. I ended up marinating the steak overnight with this marinade, and then made the marinade again to pour on top of everything after it was cooked. lutangclan91Raleigh, NC6/1/2020I had never cooked flank steak before but this recipe sounded too good to pass up. It was kinda cool proof. Quick cook, simple marinade with ingredients I already had on hand and the after marinade made the steak so flavorful! Highly recommend KyartzCalifornia 9/12/2019Delicious! Don't knock the post-marinade 'til you try it. The flavor packs a punch. EagleM16Denver, CO7/28/2019So marinate after cooking and serve cold? Hmm.Anonymous6/8/2019its marinated after it is cooked. thats the theme for a number of dishes in last months mag. johnny_d_b_searsDC6/7/2019Marinade steps please. I would love to make it this weekend. AnonymousAtlanta5/30/2019Marinade or sauce???  I’m confused!jacquiebdp6398Toronto5/30/2019Question-is the steak actually marinated before grilling or is the marinade just drizzled over after cooking?  The recipe doesn’t have a step where the meat is actually marinated. AnonymousMaine5/29/2019Explore Bon AppétitBeefMeatSteakScallionOnionVegetableSummerMainDairy-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Claire Saffitz"]}