{"id": "c6a36b8674a01fa238fe99e6eee5647c", "url": "https://www.bonappetit.com/recipe/garlic-and-parmesan-braised-greens", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Garlic-and-Parmesan-Braised Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueGarlic-and-Parmesan-Braised GreensBy Chris MoroccoAugust 10, 20214.8(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintQuickly sautéed hardy greens are a staple side dish for busy nights. But when you have 20 more minutes to spare, cook down piles of greens with well-browned onions, LOTS of garlic, and a handful of Parm to render them into something special. Don’t even think about skimping on the garlic; using a halved head adds a lot to the dish, but because the cloves mostly stay contained, it won’t be overwhelming. Promise.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonMicroplane Grater$16 At AmazonCutting Board$10 At IKEAIngredients4 Servings⅓cup extra-virgin olive oil, plus more for serving1head of garlic, halved crosswise1large onion, thinly slicedKosher salt, freshly ground pepper2bunches Tuscan kale or collard greens, ribs and stems removed, leaves torn2oz. Parmesan, finely gratedPreparationStep 1Heat ⅓ cup oil in a medium Dutch oven over medium. Arrange garlic halves, cut side down, in pot and scatter onion around; season with salt and pepper. Cook, stirring onion occasionally but keeping garlic cut side down, until onion is deep golden, 6–8 minutes.Step 2Add kale to pot by the handful, stirring and letting it wilt slightly before adding more; season generously with salt. Cook, stirring often, until all of the kale is deep green and just wilted, about 3 minutes. Add 1½ cups water, cover pot partially with a lid, and cook until liquid is reduced by half and kale is tender, 12–15 minutes.Step 3Add Parmesan to braised kale and cook, stirring, until cheese is melted and incorporated (sauce will thicken slightly), about 5 minutes. Taste and season with more salt and pepper if needed.How would you rate Garlic-and-Parmesan-Braised Greens?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleI loved the flavor of this recipe. I too, like other reviewers, found the top of the garlic cloves messy and they did not stay together in the pan, so I lifted the peels off of those pieces and just cooked them with the onions after they had softened in the oil. I used 1/2 bacon drippings for the cooking oil and added 2 tablespoons of balsamic dressing when I added the kale to give more liquid to the whole thing. Super good. Laura PNC1/31/2022I love this recipe so much. I have used it to braise kale, chard and even purple cabbage as well as green cabbage. I agree with some of the other commenters that the garlic head gets messy and I have found it easier to  just throw in some peeled garlic cloves with the onion (I've also added shallots). I also use broth in place of water for a little extra flavor kick.SnicklefritzLouisville, CO12/2/2021I went over the recipe and was confused with the garlic bulbs. So, before I started cooking, I cut the garlic bulb in half and put them in “foil cups”, cut side up. Drizzle with EVOO and a bit smoked paprika. I baked it for 45 minutes at 450*. Let cool enough to handle them squeeze into a bowl. Remove any skin than may fall in. Then put in instead of bulbs. It’ll add a bit of smokiness to the dish. My 9 yr old loved this meal! 👍🏽👍🏽SSG Jessica Texas10/16/2021I found this recipe to be a great idea but poorly written, unfortunately.  The main problem was that the top half of my garlic bulb didn’t hold together so at the end of the cooking time I ended up having to squeeze each individual garlic clove out to remove the peels.  I tend to reduce the oil in my cooking but I still couldn’t see any reason for 1/3 cup of oil in this recipe; I reduced it to 2 tablespoons.  I did enjoy the final product.AnonymousPacific Grove, CA10/7/2021I liked this recipe a lot, but it took way longer than 15 minutes to cook down the liquid into a flavorful broth. The parmesan didn't do a lot to thicken the broth, either. Ended up simmering for about an hour and a half, and the kale was overcooked for my taste but still tasty. I would use collards next time since they take to braising much better. As others said, squeeze the garlic out of the skins and mash them into the greens—key to the recipe! Also recommend adding a splash of wine before the water for some acid, or squeezing lemon at the end.lasagnaqueenPortland, Oregon9/15/2021As some of the other reviewers noted, it isn’t clear what to do with the garlic… before adding the parm, I pulled out the two garlic halves, then popped about half of the cloves back in and gave em a little smooshing. Other than the confusion about the garlic, I’d give this recipe an 11/10. It was so tasty, so easy, and I can’t begin to describe what a relief it is that this recipe has such a short ingredients list! Thanks, Chris :)LeighBaltimore, MD9/9/2021Maybe a silly question but what do I do with the garlic?  Leave it in peel and all?  Do I squeeze it out like roasted garlic or just take the two halves out??SteveOregon 9/2/2021I want to love this recipe and Im sure I would have if I had not followed the directions to salt every time you put a handful in (or mayve I read that wrong). It is so salty I almost can't eat it and there goes my kale. rebeccaNYC9/1/2021Loved this recipe. Really a great way to use up hardy greens from my vegetable garden and the CSA. The garlic is key! I served the dish with vegan sausage to make it into a complete dinner.Erin RiesTelluride, CO8/26/2021Fantastic departure from my usual fast collard greens--sautéed in red peppers and onions, with cajun seasoning and dash of vinegar--subbed parmesan for nutritional yeast and water for chicken broth, will definitely be part of my weekly rotation! JD LaurenSan Diego, CA8/24/2021Omg these were SO good. My husband and I ate them all in one sitting. We’ll definitely make it again.Anonymous8/15/2021Explore Bon AppétitGarlicVegetableParmesanCheeseKaleLeafy GreensCollard GreensEasySideGluten-FreeNut-FreeVegetarianKetoBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Chris Morocco"]}