{"id": "c6b3d0b71f5878c2ed6022da79014561", "url": "https://www.bonappetit.com/recipe/chicken-schnitzel-with-crunchy-salad", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "Chicken Schnitzel with Crunchy Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken Schnitzel with Crunchy SaladBy Kat BoytsovaFebruary 3, 20194.7(35)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Jennifer OphirEmailPinterestPrintEmailPinterestPrintConsider this your intro to frying at home. Shallow-frying breaded chicken cutlets in a large Dutch oven—instead of a lower-profile skillet—significantly cuts down on messy splattering oil. The most important thing to remember when frying is to lower the food into the hot fat slowly, carefully, and away from you; as freaky as it might be to get close to the oil, it's way more dangerous to toss something in from a distance and end up getting splashed. Fortune favors the brave: After one bite of crunchy, juicy chicken with a good swipe of spicy Dijon, and we guarantee this won't be your last time frying at home.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketLarge Bowl$18 At AmazonWhisk$10 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEADutch Oven$80 At AmazonInstant-Read Thermometer$35 At ThermoworksMedium Bowl$17 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketPlate$55 At Bon Appétit MarketTongs$13 At AmazonPaper Towels$13.45 At AmazonWire Rack$23 At BA MarketIngredients4 servings2lemons1Tbsp. honey1large shallotKosher salt3Tbsp. neutral oil, plus more for frying (4–6 cups)½cup all-purpose flour2large eggs5tsp. Dijon mustard, divided, plus more for serving8chicken cutlets (about 1½ lb. total)2cups plain breadcrumbsFreshly ground black pepper10stalks celery with leaves8radishesPreparationStep 1Squeeze juice of 1 lemon into a large bowl and pick out any seeds.Step 2Whisk 1 Tbsp. honey into lemon juice.Step 3Peel and thinly slice 1 large shallot into rings. Add to bowl with lemon juice mixture, season with 1 tsp. salt, and let sit, stirring occasionally with a spoon, at least 15 minutes and up to 1 hour.Step 4Meanwhile, pour neutral oil into a large Dutch oven to a depth of about 1\" (4–6 cups oil) and heat over medium-high. If you have a deep fry thermometer (also known as a candy thermometer), clip it on to the side of the pot and keep an eye on it; if not, use an instant-read thermometer to check the oil temperature every few minutes. You want it right around 350° (this will take about 10 minutes total). As it surpasses the 300° mark, reduce heat to low so you get to your target temperature gradually. Maintaining the oil temperature requires some finesse, but it gets easier with practice! It's always okay to stop, adjust the heat, and wait for it to get to where you want it.Step 5While you're waiting for the oil to heat up, prep your chicken for frying: Whisk ½ cup all-purpose flour, 2 large eggs, 3 tsp. mustard, 2 tsp. salt, and 2 Tbsp. water in a medium bowl.Step 6Working in batches, add 8 chicken cutlets to bowl and toss until coated.Step 7Pour 2 cups plain breadcrumbs onto a rimmed baking sheet. (You can use panko here if you want, but you'll want to grind them in a food processor first—we want fine crumbs here for maximum coverage.) Dredge cutlets one at a time, pressing down so an even layer of crumbs adheres to each one. Transfer chicken to a plate as you go; set aside.Step 8Whisk remaining 2 tsp. mustard into bowl with pickled shallots. Whisking constantly, slowly stream in 3 Tbsp. neutral oil to create an emulsified vinaigrette. Season with salt and lots of pepper.Step 9Thinly slice 10 celery stalks with leaves on a bias and add to bowl with vinaigrette.Step 10Trim and thinly slice 8 radishes. Add to salad bowl and give everything a good toss.Step 11Check oil and adjust temperature so thermometer registers around 350°. Working with 2 cutlets at a time and using tongs, carefully slide chicken into hot oil and cook, turning once, until crispy and browned, 1–2 minutes per side. Keep an eye on the oil temperature, which will drop when you add the chicken; increase heat if needed to maintain 350°. Transfer chicken to a paper towel-lined plate or wire rack. Season with a little bit of salt and repeat with remaining cutlets.Step 12Slice 1 lemon into wedges for servingStep 13Divide salad and schnitzel among plates. Top with a few grinds of pepper and serve with mustard and lemon wedges for squeezing over.How would you rate Chicken Schnitzel with Crunchy Salad?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleEasy to make. The salad in particular is delicious. Chicken needs to be thinly sliced to cook well in 1-2 minutes. MichaelLiberty Lake, WA2/6/2022My girlfriend is very picky.. I followed this recipe and it was a hit!!  Honey, radish work really well. The chicken was the star, with everything else creating the tail!!  She, thinks I'm a chef!! LarAmarillo, TX8/31/2021This recipe was a great inspiration for me.  I am alone so have to cook dinners for one.  I was able to adjust the recipe to suit my situation so I only used one chicken breast.  I used a brine on the chicken before hand. I sliced it so I had 2 1/2 nice pieces.  As I did not have honey on hand I used a good quality maple syrup.  I also was using up an egg white so that worked just fine with the batter.  I also used the Panko crumbs and they made for a really nice crisp coating that was soft and juicy inside.  I also loved the salad. It was a nice addition to the chicken.  Although I did not have any radish on hand and I used a small onion instead.  I will do this again as I loved the flavors.  Thanks for the indpiration!\n\nLGOntario, Canada3/25/2021In our family we love pork schnitzel; it is one of our favorite dishes ever. This chicken schnitzel recipe was definitely good, but it’s not quite as tasty as the pork version. I really like the salad, though! Normally we serve schnitzel with plain rice and a simple arugula salad. This salad was very flavorful and went very nicely with the chicken. Allison HamffTexas1/25/2021Best Schnitzel I've been able to make yet! I think it came down to the egg / flour / mustard mixture that allowed a super robust and even coating but regardless it came out perfectly!Ralph6065712/13/2020This chicken was so delicious!!  The coating was crispy and flavorful and the chicken was moist.  I had some leftover in the fridge and cut it up and added to salad the next day.  It really takes nothing to put this together and is a nice recipe to add to your arsenal of weeknight meals.  I may try it next with truffle mustard to see how that tastes.  Haha...as for the salad my husband is a ranch purist so I went that route instead.  Kmask1964Washington State6/25/2020I didn't make the salad part of the recipe (I ate mashed potatoes instead) but I liked the chicken schnitzel very much. I did end up pounding the chicken flat, and I think that was the right choice. You can leave the chicken cutlet as is, but a thinner chicken cutlet just enhances the crispiness of the whole experience. It cooked quickly and the coating was wonderfully crunchy. The mustard in the egg wash definitely added flavor. I will definitely make this recipe again. It has a few steps but they're all simple and easy. AnonymousLos Angeles5/15/2020Really good. A hit with the whole family! I loved the mix of crunchy chicken goodness with the acidity of the salad. Sarah HunterRaleigh, NC4/16/2020As a husband that's home during the pandemic and my wife is working healthcare, I've decided to step it up and show my appreciation. I took out frozen boneless chicken breasts this morning and started looking for a recipe. Well, this Schnitzel recipe hit it out of the park and the salad was the absolute perfect side for it, although I was skeptical during the prep. The videos allowed me to roll things out comfortably without the stress (remember I'm usually at work everyday!). My advice - roll with it, don't change a thing and you'll be a hero....thanks Bon Apetit!Eastcoast PaddyNewfoundland3/31/2020This is a great schnitzel and salad meal. I really enjoyed the salad, and the dressing gets even better 24hrs later. My grandmother taught me to make schnitzel, and I thought this method of combining the dry and wet coating was a great idea. The addition of the mustard is delicious and the coating was nice and crunchy. Sorry grandma, but this recipe tops yours!heather eatsMontreal10/31/2019I prefer any salad other than a bowl of celery ….that being said - this was a pretty good chicken dish!\nMy biggest problem is the issue that Bon Apetite just hasn't seemed to be able to tackle and that's the ability to print a simple recipe, minus all the pictures and junk...thus making it print out 3 pages instead of one...which means that I have to clip and paste to make it small and concise enough to save!Anonymousstlouis3/10/2019Loved it, combined some parmesan with the breadcrumbs as well. So good for a quick meal and loved the salad. I shallow fried it in peanut oil because that's all I had left and it worked well. DeliciouslibrarianeAustralia2/27/2019Okay I shallow fry schnitzel made with panko fairly regularly so with that being said: the 2 step dredge was great but I ended up needing to increase the wet dredge by 1/2. I normally pound store bought chicken cutlets thinner when making schnitzel and regretted not doing so when making this recipe. I highly recommend a clip on deep fry/candy thermometer because oil temperature can change drastically. I only fried one cutlet at a time. \nAs for the salad I doubled the vinaigrette and used arugula/spring mix, shredded carrot, avocado, and toasted pepitas. I found it much easier to thinly slice the shallot by slicing it length wise and then slicing it into half moons. \nI normally hate people that don’t follow the recipe but the haters won’t be able to reply to this and a salad of celery and radishes just doesn’t tickle my taste buds. Happy Valentine’s Day y’all ♡ Texas 2/18/2019So, I chose this as my first bon appetit recipe to make, and prepared as instructions and videos called for with only a sub if sugar for honey all I can say is WOW! I've made it twice already and as a single middle aged man, I'm beginning to think there is something to all this \"cook quality at home versus eating junk out\" concept. Now... What to choose as my 2nd recipe???teavidgossettOhio2/10/2019Loved it! So easy and so delicious! Will definitely add it to my repertoire. Yuri1982Southern California 2/9/2019Explore Bon AppétitCeleryVegetableRadishChicken BreastChickenPoultryMainDairy-FreeDeep-fryDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-03", "author": ["Condé Nast", "Kat Boytsova"]}