{"id": "c6d85a9f79a97e40deb165b1f382b5d5", "url": "https://www.bonappetit.com/story/johnnys-seasoning-salt", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "Johnny’s Seasoning Salt Goes With Everything. EVERYTHING. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Use Johnny’s Seasoning Salt on Everything. EVERYTHING.There is no salt. There is only Johnny’s.By Melissa Miranda, as told to MacKenzie Chung FeganMay 6, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.When I was growing up in Tacoma, Washington, I thought my lola was the best cook in the world. In Tagalog, “lola” means grandmother, but my lola is actually my grandmother’s sister. She was a military wife—my lolo was stationed at Fort Lewis, just outside of Tacoma—and because of her, my whole family was able to come over to the United States. Everything Lola cooked tasted better. She would serve us all these American foods that we didn’t eat at home like roast beef, lasagna. But even Filipino dishes like lumpia were different at Lola’s house. I remember thinking, “Why does everything taste better when Lola makes it?” Only when I was older and started cooking myself did I learn her secret: Johnny’s Seasoning Salt.Johnny’s Seasoning Salt is a blend of sea salt, MSG, paprika, garlic salt, onion powder, and other spices, and it’s absolutely magic in a bottle. It’s similar to Lawry’s, but unlike Lawry’s, it doesn’t contain sugar. These days Johnny’s makes a non-MSG version, but the original recipe is where it’s at. I use it in everything, and there is nothing that it doesn’t improve. At my restaurant, Musang, you won’t find actual salt on the line—you’ll find Johnny’s.For the home cook, Johnny’s is all about convenience and versatility. Why have five bottles of spices and seasonings when you can have one? I call for it in my recipes for chicken adobo, winter greens laing, sarciadong isda, and garlic fried rice, but it’ll give any meat, seafood, or veggie remarkable depth. It’s also life-changing on popcorn or salted peanuts with fried garlic. Just use a light hand at first—it’s so flavorful that you might need less seasoning than you’re used to.Who is this mysterious Johnny? John Meaker, who passed away in 2001 at the age of 96, was a Tacoma restaurateur who launched his line of seasonings in the ‘50s. Johnny’s Fine Foods is still independently owned and manufactured in Washington state, which is quite a feat in an industry dominated by major spice and seasoning corporations. I’ve tried to get in touch with the company—I’ve sent emails, I’ve tagged them on Instagram—because I need them to know how much this yellow bottle means to me. If anyone from Johnny’s Fine Foods is reading this, thank you for cherished childhood memories and for bringing my family together. Johnny’s tastes like home. When my cousins and I visit each other, if someone says, “This needs more salt,” we all know they don’t mean actual salt. They mean Johnny’s.Photo by Emma FishmanJohnny's Seasoning Salt$7 at AmazonExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-06", "author": ["Condé Nast", "Melissa Miranda", "As Told To Mackenzie Chung Fegan"]}