{"id": "c6d8d3542241ad725481eeb1bee16e0c", "url": "https://www.bonappetit.com/story/im-not-vegan-i-love-cashew-cream", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "I'm Not Even Vegan and I Love This Vegan Cashew Cream | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI'm Not Even Vegan and I Love This Vegan Cashew CreamI was suspicious of this vegan cashew situation. Turned out I was wrong.By Alex DelanyApril 26, 2018FacebookTwitterEmailFacebookTwitterEmailI am not vegan. I am a human being that eats so much meat. And cheese. I love cheese on meat and meat on cheese. I also love dairy-based dips, and if you told me I was going to love something called “vegan cashew cream,” I’d call you a dirty liar. Cashews are great. And I generally enjoy creamy stuff. But when you throw the V word in there...I don’t know. My excitement fades. But guess what. Joke’s on me, because it’s actually messed up how much I like this new Put-It-On-Everything Cashew Sauce. WHAT IS HAPPENING? WHO WOULD HAVE THOUGHT? WHAT AM I BECOMING? VEGAN STUFF! AND ME! LOOKING LIKE WE LOVE EACH OTHER! A MIRACLE.There are three things that make this stuff amazing. If you’re the kind of person who likes when things are explained in numbered, easily digestible lists, today is a great day for you. If you’re not that kind of person, too bad. I’m still going to do that. The merits of this sauce are as follows:1. It’s Easier Than Something That’s Super EasyYeah. It’s that easy. Easier than tying your shoes. Easier than holding the door open for someone. (Be nice! Do it!) And definitely easier than paying off your credit card. Vegan cashew cream only uses four ingredients, and takes about five minutes to make (plus 10 minutes of letting nuts soak).First, you let the cashews soak in some boiling water for about 10 minutes. You then take the strained cashews and dump them in a blender with some kosher salt, tender herbs (cilantro, basil, parsley, and chives all work), rice or white vinegar, and a bit of the water that you soaked those cashews in. And then...yeah, you guessed it. You hit the button that turns on the blender and watch the contents turn into a green spread-ish thing. The texture is perfect: dip-able, spreadable, and scoop-able. Not too firm and not too runny. If you’re thinking, “I don’t know. That sounds pretty difficult.” I’d like to invite you over for a chat about what “difficult” actually means.You could definitely swap in some herby cashew cream for the miso dressing under those sweet potatoes.\n2. It Can Play Any PositionYes, that subhead was a sports reference! Doesn’t even matter what sport! The reference is versatile, just like this cashew cream! You can use this stuff for just about anything. I wouldn’t put it in my coffee, but the other options are limitless. You can use it as a dip for pita or focaccia or crudites. You can use it as a dressing for an endive or kale salad. You can schmear it on toast. You can plate roasted vegetables on top of it. You can even drizzle a little of it over some roasted chicken, and that stuff will tasty really damn good. I honestly don’t even know what to really call this stuff. It is everything—sauce, dip, dressing, spread, and cream—simultaneously. It does it all.Whoa, a picture of meat in a vegan article? Whatever, the cream tastes good on roast chicken. Deal with it.\n3. It Tastes Like Something That’s Not VeganThis vegan dip tastes...good. Really good. I’m not a vegan food-hater, but I am a vegan food-skeptic. I always feel like I’m missing out on a better experience when someone tells me to try something that’s vegan. I would like to go on record in saying that I do not feel like I am missing out on anything when I eat this cashew cream.Soaking those cashews before blending them softens them, giving you a dip that isn’t chalky and pasty, but creamy and pleasantly nutty. It tastes like there’s dairy in there. And the herbs and vinegar brighten the whole thing up, rolling waves of leafy, vegetal flavor and acid over whatever the cream ends up on. It tastes like, well, like maybe I wouldn’t be missing anything by going vegan. I don’t know if I’ll ever find out for sure though. Because right now I’m thinking about spreading vegan cashew cream all over a ham and cheese sandwich.Get. The. Recipe:Put-It-On-Everything Cashew SauceRich, creamy, AND vegan—meet your new all-purpose condiment.View RecipeExplore Bon AppétitCashewBasicallyVeganDipSauceCondiment/SpreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-26", "author": ["Condé Nast", "Alex Delany"]}