{"id": "c6ded0a329e893064f66ca1dadc4e7aa", "url": "https://www.bonappetit.com/story/tandem-bakery-fully-loaded-biscuit", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "The Loaded Biscuit from Tandem Bakery in Portland, ME Tells Me It’s Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsForget the Solstice, Only Tandem Bakery’s Loaded Biscuit Tells Me It’s SummerFlaky, buttery pastry slathered in jam is my bathing suit season.By Alex DelanyJune 21, 2019FacebookTwitterEmailPhoto by Greta RybusFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.There’s not one thing that tells me it’s summer more than my first bite of a fully loaded biscuit at Tandem Coffee + Bakery. Not the deep longing to eject myself from the swampy streets of Manhattan. Not the drastic rise in my electric bill. Not the spike in personal soft serve consumption. No, it’s only once that buttery pastry hits my open hands during my annual getaway to Maine that I know the season has truly arrived.Now, if you’ve read Bon Appétit at any point over the past four years, you’ll probably recognize the Tandem name. It was one of our 50 Best New Restaurants in 2015, and its continued excellence was one of the reasons that the bakery’s hometown of Portland, Maine, was named our 2018 Food City of the Year. Everything behind baker Briana Holt’s pastry case is exquisite, but it’s her loaded biscuit (paired with an espresso) that really gets me. The layers of flaky, buttery dough; the deeply browned exterior; the crispy nooks and crunchy crannies; the fluffy interior; the not-so-modest swipe of grassy butter; the lava flow of whatever housemade jam they’ve got that day—always the right balance of bright, sweet, and faintly tart in the way that the best blueberries, raspberries, and strawberries are.So if you happen to see me at Tandem this summer, please, I beg you, don’t say a thing. You are witnessing the single most anticipated moment of my year. Let me enjoy myself, uninterrupted. Then—after only crumbs and butter marks remain on my plate—you can tell me that I need to move to the back of the line, behind the other patient customers, to get myself another biscuit.Go there: Tandem Coffee + BakeryExplore Bon AppétitRestaurantsPortland MaineHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-21", "author": ["Condé Nast", "Alex Delany"]}