{"id": "c6e898639a136cfc955080503c892d49", "url": "https://www.bonappetit.com/recipe/all-purpose-coconut-curry", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "All-Purpose Coconut Curry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAll-Purpose Coconut CurryBy Meherwan IraniSeptember 20, 20214.3(50)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintThe chef Meherwan Irani is a prolific chef-restaurateur (and the founder of his own small-batch spice shop, Spicewalla), but at home, he cooks just like everyone else. He loves making freezer-friendly, big-batch recipes like this aromatic coconut-milk curry, which he repurposes in a variety of easy dinners throughout the week. This recipe makes about six cups curry, which is enough to make one batch each of Irani’s Yellow Curry Chicken With Vegetables, Fish Curry, and Butternut Squash and Green Bean Stew (each recipe uses two cups). Irani suggests freezing the curry in two-cup portions so you can easily defrost only what you need.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonDutch Oven$80 At AmazonReusable Storage Bags$48 At AmazonMicroplane Grater$16 At AmazonIngredientsMakes about 6 cups16\" piece ginger, peeled, coarsely chopped10garlic cloves, coarsely chopped6Tbsp. (or more) grapeseed oil or vegetable oil2tsp. brown mustard seeds6–8fresh or dried curry leaves (optional)1tsp. asafetida (optional)2large red onions, finely choppedKosher salt2tsp. ground turmeric128-oz. can crushed tomatoes213.5-oz. cans unsweetened coconut milk (not low-fat)2cups low-sodium vegetable or chicken brothPreparationStep 1Pulse ginger and garlic in a food processor, adding a few drops of oil if needed to help blend smoothly, until a coarse paste forms. (Alternatively, you can finely grate ginger and garlic with a Microplane.)Step 2Heat oil in a medium Dutch oven or other heavy pot over medium-high. Add a few mustard seeds to the pot. When seeds start to wiggle and pop, reduce heat to medium and add curry leaves (if using), asafetida (if using), and remaining mustard seeds. Cover pot and cook spices, swirling, until mustard seeds start popping more gradually, about 30 seconds. Uncover pot and return heat to medium-high. Add ginger-and-garlic paste and cook, stirring constantly, until beginning to brown, about 1 minute. Add red onions and a big pinch of salt and cook, stirring often and reducing heat if needed to prevent burning, until onions are golden brown and jammy, 10–12 minutes.Step 3Stir in turmeric, then tomatoes and bring to a simmer. Reduce heat to medium and cook, stirring often, until tomatoes are glossy and darkened in color and oil starts to separate around edges of pot, 7–9 minutes.Step 4Add coconut milk and broth and stir to combine; season with salt. Bring curry to a simmer, then reduce heat to medium-low. Cover and cook another 10 minutes, stirring every couple of minutes to prevent sticking and burning. Taste curry and season with more salt if needed.Do ahead: Curry can be made 5 days ahead. Let cool, then transfer to an airtight container and chill, or freeze up to 3 months. If frozen, thaw in the refrigerator before using.How would you rate All-Purpose Coconut Curry?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleI cut the tomato and broth quantities in half because I wanted it thicker and I'm not supposed to be eating tomatoes at all.  /;)  This was perfect for my main purpose, which was to have something delicious to add to a light pantry soup made with packaged broth and leftover chicken.  It gives a very simple, even boring, dish some zip and wonderful flavor.  All told, about 10 minutes prep time.  Also great stirred into a lentil soup!beejayCalifornia1/22/2022Like many others, I found this sauce to be too thin, too tomato-y and a bit bland, and I did use the curry leaves and asafetida.  I would suggest leaving out the chicken broth and using half the crushed tomatoes.  I added a couple tablespoons of Indian curry paste and a couple teaspoons of garam masala which helped amp up the flavors.  This is a good recipe to start from and once you get it where you like it, it’s invaluable as a go-to sauce for chicken, fish and shrimp.  Serve with jasmine rice and a veg for a complete meal.Patrice12/16/2021THIS is the kind of recipe I get excited about: 1) batchable for weeknight meals, 2) full of flavor, 2) no capsaicin, so I can feed it to the littles and adjust the heat at serving for the grownups. After trying this last night with both chicken and fish (cooked separately), this will become a weeknight staple.\n\nI didn't have curry leaves or asafetida, which turned out fine, but I wouldn't try this if your mustard seeds or tumeric are dull or stale (order those good, good Spicewalla spices!). Also, instead of chicken broth, I just used a scoop of Minor's chicken base.Kate ZNJ10/15/2021Womp womp. Not sure if it was the choice and amount of red onions and crushed tomato, but this tasted bland and just bad and I loveee curry. Try BA's Curry Vegetables recipe instead – added in ingredients from that recipe to fix this one.TaylaAlexandria, VA10/7/2021I take it back.  I forgot that curries are served with rice and/or breads.  This is a good solid recipe.  I will make again.  To the person who asked why to freeze in two cup portions...I freeze almost everything in one cup portions.  Do what works for your kitchen.Gail DVancouver10/1/2021I wanted to love this recipe, but I think, like some on here, it contains too much liquid to get a good, thickened base to make a curry with. Personally I used only 1 tin of coconut milk, plus the cream from the other one and no broth. Thinking about it next time I would follow the basic recipe but just use 1 regular sized canned tomatoes (instead of a large one), 1 can of coconut milk, no broth and all the same everything else. I also removed the lid for the last step to let the sauce reduce slightly. carolineDurham NC9/29/2021First, this sauce is AMAZING!  So, so delicious.  However I do have a question:  freezing this in two cup portions as described, but when I look at the associated curry recipes they all use up to six cups of sauce ingredients.  Why then freeze them in two cup portions? Any thoughts?AnonymousWisconsin9/28/2021awesome base, great for freezing and using two - three few meals. \nPeople asking for TIPS. here are a few of mine....Tip #1- make ahead tip: Freezing coconut milk in curry like this may cause the sauce  to split and texture will get gritty potentially upon reheating. Best to make this base up to the part where it calls for the tomatoes and when you thaw and reheat- add the coconut milk at the time of final preparation which will also perk it up nicely.  It seems the chef uses a equal portion of tomato to coconut milk-  1 14 oz can of coconut milk for 1/2 the amount of fully seasoned tomato gravy would work well. same goes for cooking ahead and keeping in fridge for eating a few days later.  I always add coconut milk prior to eating the dish, not before otherwise it solidifies in the oil (think leftover Thai curry in your fridge...). Sure when you reheat it works out but if you have no intention of eating this right away, add your coconut milk at the time you intend to reheat to eat for maximum creamy luxury of coco milk and let it simmer until oil pools on top or swirls thru the coconut milk \nTip 2: the order of the ginger garlic paste is wrong- add onion first, let them get jammy- THEN add your ginger garlic paste and continue to cook until raw smell of garlic goes away- caution when you add the ginger if it's been blended with a bit of water it will splutter in the pan, so keep a lid handy so you don't get hot oily ginger flying out in your face. adding garlic first will burn the garlic bc it will be cooking too long and will turn curry base possibly bitter...\nthird: if you are pulling your food processor out for the ginger garlic paste you can blend up your onion too. note this blended onion will cook much faster...so watch them carefully when you put into pot. as they get golden and lightly brown- add your ginger garlic paste...let that all live together in pot for like 2 mins until adding more guests to the curry party in your pot. \nTip 4:this is an Indian dish- making it the day before (up to tomato gravy and even adding your protein) then cooling and putting in fridge overnight and eating next day will be WAY better of an experience than eating immediately. \ntip 5: someone asked about what proteins to put in: cod, shrimp, chicken, lamb and pork would all work well in this. I can't speak to tofu but potatoes and /or chickpeas would be my veg go to version\ntip 6:  take curry leaves out before you serve to eat itDesiStyleCharlotte NC9/28/2021I worked hard on this...to the point where I did not have canned crushed tomatoes..so I crushed and and reduced.  Onions turned jamny but never browned.  I carried on.  I now have a lovely HUGE pot (yay)  of very soup like sauce.  I wait to see how it is when it cools.  But. needing tips and suggestions Gail Vancouver Canada9/26/2021You could try blending a few curry leaves with Tomatoes, Garlic Ginger Chillies and coriander leaves as added just tantalizing flavor to your curry dish made with Onions or if making veggy dishes with only tomatoes. The result is simply amazing to your taste buds.\nAnil Jagtiani Indonesia 9/24/2021I thought using coconut milk was for Thai sauces.  \n\nIs it traditional to use in Indian dishes?Anonymous9/23/2021Response to anonymous comment:\nA small cheese grater can be used as a microplane (a microplane is just a super fine grater). \nAlso you can use a blender in replacement of a food processor. \nHope that helps! 😊EmmaMichigan 9/21/2021This was fantastic.  I wasn't expecting it as the curry seemed a little runny, but I added stir fried prawns to it, and it was soo good.Shereen AnisDubai,9/20/2021I don't have a food processor and have never heard of a Microplane, but surely there's a way of getting the right consistency for people who have only the ordinary equipment. This sounds like a sauce I'd love to make and have on hand, so help, please!AnonymousBerkeley, CA9/20/2021This recipe turned out amazing! I used it tonight to make  his curry chicken without any veg. Delicious. Will try with cod later this week. What a find! Anonymous9/20/2021Explore Bon AppétitCoconutFruitCurryIndianSouth AsianAsianMeal PrepDinnerVegetarianVeganHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-19", "author": ["Condé Nast", "Meherwan Irani"]}