{"id": "c7047b2fbecac98e4196ba8293c3e77f", "url": "https://www.bonappetit.com/recipe/chopped-salad", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Chopped Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueChopped SaladBy Che Fico, San Francisco, CAAugust 14, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThe dressing and assembled ingredients alone make this salad a star. But the extra effort of cooking the vegetables is worth it we promise! This recipe is from Che Fico in San Francisco, CA, our No. 7 Best New Restaurant 2018.Ingredients4 servingsVegetables1small kabocha or acorn squash (2–3 lb.)2Tbsp. fresh lemon juice4tsp. honey3Tbsp. extra-virgin olive oil, dividedKosher salt, freshly ground pepper8oz. brussels sprouts, trimmed, halved2Tbsp. unsalted butter2sprigs thyme1sprig rosemary1garlic clove, lightly crushed2Tbsp. white balsamic vinegarVinaigrette¼cup red wine vinegar1Tbsp. Dijon mustard1tsp. fresh lemon juiceKosher salt1small garlic clove1½tsp. crushed red pepper flakes1½tsp. dried oregano¼cup plus ⅔ cup extra-virgin olive oilAssembly115.5-oz. can chickpeas, rinsedKosher salt2scallions, thinly sliced2½oz. fennel salami, sliced ⅛\" thick, slices cut into quarters (about ½ cup)1cup chopped caciocavallo cheese1cup Castelvetrano olives, pitted¼cup chopped dill4cups torn mixed radicchio leaves4cups torn Little Gem or romaine lettuce½cup finely grated ricotta salata¼cup pomegranate seedsPreparationVegetablesStep 1Place a rack in the middle of oven and preheat to 350°. Cut squash into quarters and scoop out seeds. Place skin side down on a foil-lined rimmed baking sheet. Whisk lemon juice, honey, and 2 Tbsp. oil in a small bowl and rub all over cut sides of squash; season with salt and pepper. Roast until very tender, about 1½ hours. Let cool.Step 2Heat remaining 1 Tbsp. oil in a large skillet over medium-high. Arrange brussels sprouts cut side down in skillet and cook, undisturbed, until well browned, about 4 minutes. Toss and continue to cook, tossing occasionally and reducing heat as needed, until browned all over, about 5 minutes longer. Reduce heat to medium; add butter, thyme, rosemary, and garlic. Tip skillet toward you so butter pools on one side and cook, spooning butter over brussels sprouts, until butter smells nutty, about 4 minutes; season with salt. Add vinegar and toss to coat. Cook just until vinegar and butter form a glaze over sprouts. Let cool; discard herbs.Step 3Do Ahead: Squash and brussels sprouts can be cooked 3 days ahead. Cover and chill separately. Spoon pan juices for each on top.VinaigretteStep 4Combine vinegar, mustard, lemon juice, and a big pinch of salt in a medium bowl. Finely grate in garlic and whisk to combine. Let sit 15 minutes.Step 5Meanwhile, heat red pepper flakes, oregano, and ¼ cup oil in a small saucepan over medium until oil is warm but not yet sizzling. Add remaining ⅔ cup oil to cool down infused oil.Step 6Pour infused oil into vinegar mixture; whisk until smooth. Season vinaigrette with salt.Step 7Do Ahead: Vinaigrette can be made 3 days ahead. Cover and chill.AssemblyStep 8Toss chickpeas in a medium bowl with ¼ cup vinaigrette; season with salt. Let sit, tossing occasionally, until chickpeas taste like they’ve absorbed some vinaigrette, at least 10 minutes.Step 9Toss scallions, salami, caciocavallo, olives, and dill into chickpeas. Scoop out bite-size pieces of roasted squash until you have 2 cups; save remaining squash for another use. Add to chickpea mixture along with brussels sprouts and glaze. Add radicchio and lettuce and toss to combine. Add more vinaigrette to taste; season with salt.Step 10Serve salad topped with ricotta salata and pomegranate seeds.How would you rate Chopped Salad?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis is a delicious salad!  We skipped the sausage to make it vegetarian and it was still full of flavor.  We couldn't find caciocavallo cheese so used a combo of regular and aged provolone.  \n\nThe recipe is definitely time consuming, with pricey ingredients, so I would only make it as-written for a special occasion.  That being said, I think you can definitely take some shortcuts and the salad would still be delicious.  The salata was pretty unnoticable, and I think you could use a less costly cheese in place of the caciocavallo and still get a lot of flavor out of it.  Perhaps subbing another kind of olive, or replacing with something else would also be another option. I think artichokes would be really good here...overall, super flavorful and fun to try.AnonymousChicago, IL11/13/2018Explore Bon AppétitSaladItalianEuropeanKabocha SquashSquashVegetableAcorn SquashBrussels SproutRadicchioChicoryLeafy GreensRicotta SalataRicottaCheeseSalamiCured MeatMeatMainSideHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Che Fico", "San Francisco"]}