{"id": "c70fea97684fce0b4ab733da2f1f286c", "url": "https://www.bonappetit.com/recipe/fresh-mint-and-chocolate-ice-cream", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Fresh Mint and Chocolate Ice Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueFresh Mint and Chocolate Ice CreamBy Sarah JampelJune 2, 20203.8(17)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis take on mint chip opts for fresh mint instead of extract, which can verge on toothpaste-y; fresh mint is subtler. No one would be mad if you skipped the streaks of chocolate and folded in crushed-up Thin Mints or chopped Andes Mints instead...IngredientsMakes about 2 quarts¾cup (15 g) coarsely chopped mint2cups (or more) heavy cream, divided4oz. bittersweet chocolate (65%–75% cacao), coarsely chopped114-oz. can sweetened condensed milk1tsp. kosher salt½cup (40 g) Dutch-process cocoa powderPreparationStep 1Heat mint and 1 cup cream until just steaming in a small saucepan over medium heat. Remove from heat, cover, and let sit 30 minutes. Strain through a fine-mesh sieve into a measuring glass, pressing on solids; discard solids. Chill cream until very cold, about 30 minutes.Step 2Just before cream is ready, heat chocolate in a heatproof bowl set over a saucepan of simmering water (do not let bowl touch water), stirring occasionally, until melted and smooth. (Alternatively, heat in 20-second increments in a microwave, stirring between bursts.) Mix together sweetened condensed milk and salt in a medium bowl.Step 3Pour remaining 1 cup cream into infused cream in measuring glass. (You should have 2 cups; add more if needed.) Transfer to a medium bowl. Using an electric mixer, beat cream, starting on low speed and gradually increasing to medium-high as it thickens, until billowy and stiff peaks form, about 4 minutes.Step 4Add a dollop of whipped cream to condensed milk mixture and mix in with a rubber spatula (this is just to lighten it so that the next stage—folding—is easier). Add remaining whipped cream, then sift in cocoa powder. Fold in, running spatula down sides and along bottom of bowl, then lifting up through center and over top while rotating bowl to integrate without deflating, until very few streaks of condensed milk mixture remain and cocoa powder is combined. (The cocoa powder won’t want to dissolve at first, but keep going. It will eventually!)Step 5Scrape about one quarter of ice cream base into a loaf pan that’s at least 8½x4½\". Using a fork, drizzle about one third of melted chocolate over. Repeat layering process, finishing with a layer of ice cream base, to create 4 layers of ice cream base total and 3 layers of drizzled chocolate. Cover with plastic wrap or an airtight silicone lid and freeze until solid, at least 8 hours.Step 6To serve, transfer loaf pan to refrigerator and let ice cream soften 10 minutes before scooping into bowls.Step 7Do ahead: Ice cream can be made 1 week ahead. Keep frozen.How would you rate Fresh Mint and Chocolate Ice Cream?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleMade this last summer 2020 with chocolate mint from the garden.  Followed the simple directions exactly and was rewarded with a rich and delicious treat scooped straight from the loaf pan. My family loved it! I look forward to making it again this summer when the mint fills out in the garden. This is a keeper. CharlotteAlexandria, VA4/14/2021I wasn’t able to modify my previous review so I’ll write a second one.\nThe amount of salt is in fact way too much for the recipe.\nI ended up re-making the recipe, this time with my own modifications:\nThe 2 cups of whipped cream were just whipped up plain, no mint steeping - I don’t see how you can every get stiff peaks that way\nI only used 1/8tsp of salt \nAnd I stirred in some chopped up frozen cookie dough and some mini semi-sweet chocolate chips instead of the melted dark chocolate swirled in.\nTurned out amazing that way! \nUnfortunately the actual original recipe did require some changes to taste good so I can’t really recommend someone make it as is written. I’m putting a 4 star to balance the 1 star for my review since the general idea of the recipe is good so it deserves an average of about 3 stars.Sweettooth08Winnipeg7/12/2020The process of making the cream warm up and then steeping the mint somehow destroyed something in the cream because it barely ever reaches soft peak. I tried twice with the mint method, wasting about 1L of cream and multiple hours out of my day to end up with a liquid, barely whipped cream. Took it further to be sure I wasn’t throwing it out for nothing and it became over-whipped. There’s no way to achieve the necessary stiff peaks with the mint process. I thought maybe the first try I’d warmed it up too much and hadn’t cooled it enough so the second time I took extra care with it.\n Now with the third try and third trip to the store, I’m going to make regular whipped cream and use mint extract. 1tsp of salt? People seem to be complaining it’s too salty. I hope they’re wrong since I already combined that part of the recipe and don’t want to waste a can of condensed milk on top of everything else.\nI’ve been to culinary school and worked in the industry for 8 years, I know what I’m doing in the kitchen so the issue in the recipe is not my lack of experience or cooking skills. My mistake was trusting the recipe 100% without following my instincts - which you shouldn’t have to do because this is written so anybody can make it (I’m assuming)\n\n I was really hoping for a successful recipe, considering this is a test kitchen and it looks like you guys test the crap out of every recipe. I hadn’t had a single bad recipe from you guys until now. Bit of a let down. Maybe revise this recipe so no one else wastes money and ingredients on a recipe doomed to fail...Sweettooth08Winnipeg7/8/2020This is an decent ice cream, not my favorite. The cream was not whipping right - you probably need to chill it for longer. But the ice cream has a nice texture. I think the ice cream was way to minty, maybe even pesticide minty. And I only used 1/4 of a cup of mint. I simmered it a bit too long, so maybe that's why it has the minty flavor? The salt was fine though.mintyoverloadSan Diego, CA7/6/2020Husband LOVED it! Definitely the best choc-mint I.C. we’ve ever had. I found it too salty to eat more than a few bites at a time, not necessarily a bad thing.  As it was, I used only half a tsp of salt. I skipped the mix-in (never understood frozen chocolate bits, like chewing on crayons) and added a couple extra Tbsp of cocoa and half a cup of peppermint schnapps. Froze the mixture in 4 plastic pint containers with lids. There was minor separation with mint-creamy over salty-boozy-chocolatey, but that made for swirling fun when served. WOW!!!TroutappleTucson 6/30/2020This was not my favorite - it's very, very rich and the cocoa powder flavor overpowers the mint. I think the only way we can finish eating this is to serve it with vanilla ice cream to lighten up the flavor. If you do make it, I recommend chilling the mint cream longer than recommended as my whipped cream never got to the stiff peak phase but it still did set up in the freezer. ginahemmings6613Denver, CO6/14/2020I could not get the cream whipped to stiff peaks, which is usually not that case with the same brand of cream I usually use. It thickened but stayed liquid even after 5 min + of beating with an electric mixer. Maybe I did something wrong in the infusion part? Delicious flavors but liquid mess.AnonymousHouston, TX6/14/2020Having a really hard time getting the whipped cream to stiff peaks for this one. I made the almond raspberry version and had no issues but every time I try to make the mint whipped cream it starts to thicken and then eventually gets softer and softer as I keep whipping, never getting to stiff peaks and never getting over whipped either AnonymousDallas, TX6/12/2020Make sure your whipped cream is nice and light and fluffy, and I recommend halving or quartering the amount of salt - 1tsp was really too much. Otherwise simple and easy recipe!bakerjcMontclair NJ6/11/2020Turned out delicious! Family likes the natural mint flavor with chocolate ice cream. The ice cream consistency is soft and luscious. I lined the loaf pan with parchment paper; when it was frozen, I could lift it out of the pan, peel the paper and slice the ice cream without the 10 min defrost time in the fridge. Next time I try try adding bits of chocolate wafer or Oreo cookie crumbles, toffee or even pecans. AnonymousChapel Hill, NC6/8/2020Explore Bon AppétitFrozen DessertDessertIce CreamChocolateOther IngredientsMintHerbs & SpicesSummer5 Ingredients or FewerEasyGluten-FreeNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Sarah Jampel"]}