{"id": "c71d44f6cef0c12dd614d5092b39091b", "url": "https://www.bonappetit.com/recipe/pot-roast-brisket-with-harissa-and-spices", "year": 2020.0, "month": 11.0, "day": 4.0, "content": "Pot Roast Brisket With Harissa and Spices Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPot Roast Brisket With Harissa and SpicesThis one-pot recipe, which makes a holiday table centerpiece with leftovers you’ll be thankful for, turns a lean cut of meat into something juicy, tender, and packed with flavor.By Sabrina GhayourNovember 22, 20204.4(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Micah MortonEmailPinterestPrintEmailPinterestPrintThis one-pot recipe, which makes a holiday table centerpiece with leftovers you’ll be thankful for, is adapted from Sabrina Ghayour’s book Simply. Cooking a lean cut of meat like brisket (see note below) for an extended period of time in a moist environment yields meat that is, in Sabrina’s words, “ridiculously juicy [and] tender, [with] plenty of flavor.” She recommends serving it “with mashed root vegetables or shredded up and served with flatbread, yogurt, and a dash of pomegranate molasses, pomegranate seeds, and some fresh herbs, such as mint.” Leftovers make for an excellent sandwich or pot pie filling, or combine them with a can of coconut milk and serve over rice for a comforting stew.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronInstant-Read Thermometer$35 At ThermoworksDutch Oven$80 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonKitchen Twine$4.99 At AmazonMeasuring Spoons$10 At Bon Appétit MarketMedium Bowl$17 At AmazonLarge Basting Spoon$16.37 At AmazonIngredients6-8 servings5½lb. untrimmed flat-cut beef brisket, preferably rolled (see note below)2(heaping) Tbsp. rose harissa1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt1tsp. ground cinnamon1tsp. ground cumin1tsp. ground fenugreek1tsp. ground turmericFreshly ground black pepperPreparationStep 1A note on the meat: The original recipe calls for “boned and rolled beef brisket,” a cut that’s common in the U.K. but not available in the U.S. Instead, ask your butcher to roll a 5½ lb. untrimmed flat-cut beef brisket for you. While the meat will be slightly different, the cooking method—low, slow, plenty of liquid—will yield the same successful results, says Heather Marold Thomason of Primal Supply Meats. If your meat comes unrolled, you can roll it yourself: Turn it over so that the fatty side is against your cutting board. Roll it up into a thick log. Tie meat at 1\" intervals with kitchen twine—double-knot each tie for extra security. Make sure that you roll it so that the grain runs the length of the roast—that way, when you slice it, you’ll be cutting against the grain.Step 2Preheat oven to 350°. Stir 2 (heaping) Tbsp. rose harissa, 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, 1 tsp. ground cinnamon, 1 tsp. ground cumin, 1 tsp. ground fenugreek, 1 tsp. ground turmeric, a generous amount of freshly ground black pepper, and 3 cups water in a medium bowl until evenly combined.Step 3Place brisket in a Dutch oven or an ovenproof casserole dish with a lid and pour spice mixture over. Roast, uncovered, basting every 30 minutes or so, for 2 hours.Step 4Cover pot and bake, basting meat every 30 minutes, for another 2 hours. Remove lid and roast brisket until deeply brown and an instant-read thermometer inserted into thickest part registers 195°–205°, about 1 hour. Let rest in pot 30 minutes, then slice against the grain. Serve with any liquid in pot spooned over.Step 5Do ahead: Brisket can be cooked 3 days ahead. Let cool; cover and chill.Adapted from Simply: Easy Everyday Dishes by Sabrina Ghayour. Copyright © 2020 by Sabrina Ghayour. Reprinted with permission from Mitchell Beazley. All rights reserved.How would you rate Pot Roast Brisket With Harissa and Spices?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleOutstanding flavor. Easy to make. I use a crockpot for everything, so very slight modify: seared the brisket on all sides in a cast iron skillet, deglazed the skillet with 2 cups red wine, mixed the spices into the warm wine in the skillet and poured over the roast in crockpot. Let it go about 8 hours on low. I've never seen a \"lean\" brisket, and had to untie mine to trim off the 30% fat it came with. As it cooked it unfurled and tried to crawl out of the pot. Second time I made this I just cut it into three slabs, which made the searing much easier as well.troutappleTucson11/10/2021Why has Bon Appetit not responded to the comment below from San Diego and the mix up on rolling and cutting the meat?  It seems to be this is a very good question and should be answered unless no one there cares about the comments.AnonymousSouth of Mt. Shasta1/10/2021Made this with a 3lb - ish cut of rolled brisket (as I was ambitiously feeding a household of two) and adjusted the time by reducing the covered portion of the bake by 30 minutes. So, SO good, so very simple, and perfect for a stay-at-home Christmas. Went on little walks between the basting intervals. A knockout dish!AnonymousQueens, NY12/26/2020The seasoning was wonderful and I'll use it again.  My roast was up to temperature in 4 hrs and looked beautiful.  However, I found that by tying it the grain became very dense and it was more like a roast beef grain then a braised brisket.  So, I would not make it rolled again.  Also, the directions say to unroll it before you slice it.  This can't be correct since it says to tie it on the long side so when you cut it, it's against the grain.  It would be very messy to try and unroll. AnonymousSan Diego, Calif.12/9/2020Explore Bon AppétitBrisketBeefMeatEasyMainNut-FreeDairy-FreeGluten-FreeRoastPassoverRosh HashanahHanukkahDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-22", "author": ["Condé Nast", "Sabrina Ghayour"]}