{"id": "c726fbc18332f487e6204ec1fb4d7065", "url": "https://www.bonappetit.com/story/red-wine-pasta-sauce-elena", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "This Red Wine Pasta Sauce Uses Two Whole Bottles of Wine—and It’s Delicious | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Pasta Uses Two Whole Bottles of Wine—and It’s DeliciousIt’s cozy. It’s impressive. It’s low-effort. It’s the only way we’re getting through winter.By Molly BazDecember 12, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeFacebookTwitterEmailSure, sure, you’ve cooked with red wine before. A splish-splash here, a half a cup there. We’ve all done it. But have you ever made pasta using two entire bottles of red wine?! I didn’t think so. I have. And I think you’re gonna wanna give it a shot.I had the pleasure of making one seriously delicious wine-stained pasta during a visit to Montreal’s very beloved coffee-pizza-wine joint Elena last winter, right about the time they put it back on the menu. People have gone so crazy for it, it’s become a mainstay. I mean, it makes sense: A wine-centric restaurant known for their wine soaked pasta—what could be more symbiotic than that?But let me assure you, this isn’t a gimmick. And it definitely doesn’t taste like eating a bowl of Chianti. It’s actually one of those low-commitment, high-reward kind of dishes that uses a legit technique you’ll want in your back pocket. And out of the goodness of my heart, I’m here to let you in how it’s done.The only kind of red wine stain you actually want.\nPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeTwo whole bottles of GOOD red wine get cooked down with garlic and red pepper flakes for about 25 minutes. (Make sure the wine is something you like the taste of. Steer clear of the nasty un-drinkable stuff when you’re using it in this quantity.) The concentrated reduction will have gotten rid of any harsh alcoholic bite, but there will still be a “wine-y,” tannic flavor there. That’s when two whole sticks of (cold!) butter get whisked in, resulting in a smooth, thick mahogany-hued sauce that’s at once bright and acidic and creamy and round. Then, par-cooked spaghetti gets added to the pot and continues to cook while getting tossed tossed tossed, absorbing both the flavor and the deep crimson color of the sauce. Finally, a generous flurry of parmesan cheese tops it all off, because who wants pasta without cheese?Yeah, pretty easy.But if the thought of dumping two whole bottles of perfectly drinkable red wine still gives you pause, consider that this dish feeds eight (or more) people and uses two pounds of spaghetti. That means everyone’s really only consuming one glass of wine. You wouldn’t offer your guests anything less with dinner anyway, would you?Get the recipe:Red Wine SpaghettiIt’s a showstopper. Two bottles of red wine get cooked down to a glossy butter sauce that stains and flavors the spaghetti.View RecipeExplore Bon AppétitHoliday 2019Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-12", "author": ["Condé Nast", "Molly Baz"]}