{"id": "c72d3f89c6609c1fb1d5d09e87c9d4a7", "url": "https://www.bonappetit.com/story/disco-tehran-nowruz", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Nowruz 2022: How the Food of Nowruz Rings in Spring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow the Food of Nowruz Rings in SpringFor Disco Tehran’s founders, Persian New Year is a day of feeding friends and family while celebrating spring.By Caroline NewtonMarch 18, 2022FacebookTwitterEmailIllustration by Jose BerrioFacebookTwitterEmailIt started with ghormeh sabzi. In 2016 Arya Ghavamian began cooking the Iranian stew in his tiny New York apartment and inviting his friends over. One of them, Mani Nilchiani, would bring his setar, a traditional Iranian lute—and these dinner parties would often turn into intimate concerts. At times they would host more than 40 people in the small place. Sometimes Ghavamian would invite people he had just met while photographing the streets.“It was always essential to me to share an Iranian gathering and Iranian food with people who are not from Iran,” says Ghavamian, a filmmaker who grew up in and around Tehran. In 2018 he and Nilchiani, a musician who also grew up in Tehran, took the party public to celebrate Nowruz. At their first party, hosted at the barroom Home Sweet Home in New York, more than 250 people from different cultures and backgrounds showed up. The night featured live music by Anbessa Orchestra and Nilchiani’s own band, Tan Haw. After its success in New York, the project, which is now called Disco Tehran, went abroad: They hosted bigger and bigger parties in Paris, London, Berlin, and Mexico City. Last year, after a pause due to COVID, more than 1200 people attended the one in Paris.Disco Tehran’s first public underground party in 2018 taken by Mert GafurogluPhotograph by Mert GafurogluNowruz, or “new day” in Farsi, falls on the first day of spring at the exact time of the equinox. It is a celebration of new growth. “Nowruz has certainly been the most special time of year for me,” says Nilchiani. In the nights leading up to the food-heavy holiday, he looks forward to eating sabzi polo ba mahi, or herb rice with fish, and during Nowruz, he gets “seriously excited” about Iranian cookies, one of his favorites being qottab, a tiny sweet pastry stuffed with walnuts, almonds, and cardamom. In recent years he’s felt a growing awareness around the holiday. “I’d like to think Disco Tehran has something to do with that.”I am not Iranian, but Nowruz has become an important holiday in my life—my partner, Alfie, is Iranian Lebanese, and over the past few years it has become a celebration that I do not miss. I spoke with Ghavamian and Nilchiani about this holiday, Iranian cuisine, and other traditions that Disco Tehran celebrates.This interview has been lightly edited for clarity.Why is the project called Disco Tehran?Arya Ghavamian: [It’s] a reemergence of cosmopolitan discotheques in Tehran that were forced to shut down after the 1979 Iranian revolution. It provides a rare access to a reimagined underground scene that has long disappeared. It’s about making a home with the people around us, wherever we are.Why do you serve food, such as ghormeh sabzi, at Disco Tehran’s events?AG: Having Iranian food at Disco Tehran didn’t require a lot of thought; this is how everything started. In my opinion every party needs to have amazing food. That’s just the Iranian standard of hospitality. I chose ghormeh sabzi because it’s a family classic! Ghormeh sabzi is extremely time-consuming and requires patience and intricate attention to detail, as small mistakes in the beginning of [my] 12-hour recipe for this dish show themselves later in the process. As a joke, my grandmother used to say if you do this well, you’ll be ready to be married off. The act of making this dish for your family is an expression of love and devotion. Iranians love this dish because it gets the whole family, extended family, and even the neighbors together. At our last party in New York, we cooked for a thousand people in collaboration with Bonshan Kitchen, a female-led kitchen based in Brooklyn.Let’s get into Nowruz: How is it an important holiday for you?AG: Nowruz is the most important day of the year for me, and for hundreds of millions of Iranians and non-Iranians who celebrate this day and the arrival of spring. It is a pillar of our collective identity that has survived invasions and revolutions and dogmatic oppressors who have repeatedly tried to eradicate this celebration from our lives. In Iran, Nowruz, and all the traditions surrounding it, was an extremely communal and intimate experience for me.When I moved to the U.S., I was immensely shocked to not feel any of this. Not only was there no celebration, but I felt that people around me did not know and didn’t care much about learning about my culture, my history, or where I come from. I moved by myself, and I felt very lonely for years until I started Disco Tehran. Now I am able to celebrate Nowruz not with just Iranians but with everyone who enjoys having a good time. Mani Nilchiani's family opens Nowruz presents in his grandparents' home in Tehran in 1985.\nPhoto from Nilchiani family archiveMani Nilchiani: When I was growing up, the last weeks of our calendar promised the most magical days of the year. There was this soft sense of revival in the air. I remember the wind would blow away Tehran’s winter smog, and the Alborz mountains would rise tall to the north of the city, inviting you to look farther and breathe deeper. The air had this promise of rejuvenation, realignment, and shedding old skin. Everyone was busy with spring cleaning. We would go visit family and friends and their homes, and they would often return visits at our place. After a heady and isolated winter, this reciprocal visiting tradition brought life to the social fabric around us. It was customary for grown-ups to give cash handouts to us kids; we call that Eidi. We’d excitedly await to tally up our Eidi at the end of each day. I remember one time I saved up and bought myself a skateboard!Since moving to the U.S., I’ve always maintained my haft-seen every year. I was lucky to have my older sister in New York when I landed here, and I feel blessed to celebrate with loved ones everywhere. New York and Disco Tehran gifted me the privilege to connect with other cultures who celebrate Nowruz: Azeri, Kurdish, central Asian, and beyond.A haft-seen is a table of seven symbolic items that represent nature and embody values and wishes for the upcoming year. Why is it an important aspect to celebrating Nowruz?MN: In my experience, haft-seen is a moment of reflection, and an offering to the world and to ourselves. The seven elements that are arranged on this table usher in reawakening, abundance, and prosperity. Framed photos of loved ones who can no longer be with us often adorned [my family’s] table, as did a copy of the poetry book Divan of Hafiz. A centerpiece to this arrangement was sabzeh, or tall green sprouts, that we would prepare during the weeks leading up to the event.AG: Haft-seen is a versatile arrangement, but it also takes time and dedication. For most of my years in the USA, I felt too disconnected from myself to even set a haft-seen. An artist friend of mine would draw her haft-seen and attach it to the wall when she felt too sad to actually set it up. A nice touch that I appreciate on certain Iranian haft-seen arrangements is the addition of a book of poetry by Hafiz or the Rubáiyát of Omar Khayyám. My grandparents set their haft-seen with poetry. When we would visit them for Nowruz, they would take out freshly printed thousand-toman bills from inside the book and give them out to us as Eidi. Those are the moments that I valued the most.Arya Ghavamian and his mother celebrate his first Nowruz.\nI noticed on Disco Tehran’s Instagram that you’ve been collecting family photos and stories from people around the world who celebrate Nowruz. What are you hoping to convey with that project?AG: We started collecting family stories as a zine in 2020. Our first volume was dedicated to the experience of immigration. We received stories from China, India, Iran, the UK, and Colombia. We collected these stories and displayed them at MoMA PS1 as a zine alongside a mixtape of music selected by us. To me, sharing stories allows us to process events in our lives that we wouldn’t be able to otherwise. I think other people connect to that too; we all like to be seen, heard, and finally understood. So far, for this ongoing project, we have got stories from Iran, Azerbaijan, Indonesia, Canada, and Sweden.What’s next for Disco Tehran? I know you’ve been working on a Cinema Tehran project. Crossing my fingers for saffron popcorn.AG: Our newest project will be a cinema series called Cinema Tehran, which will premier in New York this May. This series will feature overlooked gems of Iranian and world cinema accompanied by our ghormeh sabzi and other homemade Iranian dishes. This is a reemergence of a forgotten dreamhouse, a place where we get to meet and connect over good films and good food. Oh, you just gave us an idea—maybe we’ll serve saffron popcorn at Cinema Tehran as well.Explore Bon AppétitCultureInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-18", "author": ["Condé Nast", "Caroline Newton"]}