{"id": "c740904b96942ee6f42b74f651b506d1", "url": "https://www.bonappetit.com/story/bread-knife-just-buy-it", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "The Best Bread Knife Costs $22 But Is Worth Its Weight In Gold. GOLD! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Bread Knife Costs $22 But Is Worth Its Weight In Gold. GOLD!I use it twice a day (but not to brush my teeth).By Alex BeggsApril 3, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Let’s cut right to the chase: Even the best bread knife is only going to do, like, four things. But two of those are so important to the day-to-day functioning of my life, I can’t imagine living without one.1: Slicing a crusty, fresh loaf of bread.2: Slicing a ripe summer tomato to go on top of that bread.As sure as I’m feeding a meowy cat every morning, so does my bread knife come out of the block. This $22 knife is the one the BA Test Kitchen uses; its sharp teeth bounce along the 10\" blade like a doodle on the top of your loose-leaf homework page. Something about it also reminds me of the decoratively edged craft scissors my mom always threatened to cut my hair with. (She never did, FWIW.) Its name, the Mercer Culinary Millennia, evokes a futuristic spaceship, one with an excellent canteen.Mercer Culinary Millennia 10\" Bread Knife$22 at AmazonWhy is it the best?This shape isn’t based on a cute aesthetic decision, but actual freaking physics, which I’m not very good at. However, I do subscribe to Cook’s Illustrated (love words and pictures), and I read a lot about serrated knives a few years back when it did a ridiculously thorough test of them all. In true Cook’s Illustrated fashion, it tested each knife on bread, tomatoes, cake layers, and overstuffed BLTs. (Sometimes I think they choose these tests based on what the staff wants to eat, and I appreciate that.) ANYWAY, the physics. As you put pressure (remember “force”?!) on the knife while slicing bread, it’s shared equally (remember “dispersed energy”?) on the tines, which means the fewer points the better, because they’ll each have more POWER. The “gulleys,” a term I learned in this video, are important too, as they reduce the friction that would otherwise mangle the food.There are other factors in a great bread knife. The handle needs some grip, the length needs to be enough to get through rustic loaves of sourdough, the tines need to be pointy, not smooth (to bite into soft tomato skin). And my humble $22 bread knife ticks allllll the boxes.Hey, what else can I do with a bread knife?In the test kitchen one afternoon, I asked Andy Baraghani what he used a serrated knife for other than bread and tomatoes, and he said: “Tomatoes! I would NEVER. If you cut a tomato with a bread knife, Chef would take that tomato”—he mimicked grabbing it from my hands—”and THROW IT AWAY. Your chef’s knife should be sharp enough to slice through anything.” Well, Andy—I mimicked throwing the tomato back at him—my chef’s knife is not guillotine-sharp on a daily basis, so yeah, I’m going to need this serrated knife, and I’m guessing most home cooks will too.For tomatoes. For bread. For big honkin’ sandwiches made of bread and tomatoes and probably some other stuff too. For cutting a cake into multiple layers so you can slather each one lovingly with frosting and then reassemble them (which is a thing that I will probably never do but would certainly like to be able to do). That may be about it...but those are some of the most important things in life, non?How do I keep my bread knife in prime slicing condition?If you notice your knife starting to dull, you can take it to your hardware store and have someone sharpen it, though I’ve found mine can still cut cleanly years later. Please note this Amazon reviewer’s photo of their sliced index finger, one of the most remarkable Amazon reviews I’ve come across lately:“Painlessly.” JUST WOW.I’d like to spend more than $22 on a bread knife. May I?You sure may! My bread knife is the best bread knife for me, but other members of the extended Bon Appétit family love theirs with similar zeal.Joshua Bellamy, baker and co-owner of Boulted Bread in Raleigh, North Carolina, swears by his Tojiro bread slicer: “If you know the bread we bake at Boulted, you know there’s some aggressive crust on our levain loaves. This knife—which is sturdy, balanced, and not too heavy—slides straight through them, even after using it multiple times a day for about a year.”Tojiro Bread Slicer 270mm$63 at AmazonAre you the more-is-more type? Another test kitchen pick is Wusthof’s 9\" Classic Double Serrated Bread Knife has serrations within the serrations for faster and easier slicing.Wusthof Classic 9\" Double Serrated Bread Knife$150 at Amazon$120 at Williams SonomaBaker Joy Huang—check out her Instagram for intricately scored loaves—loves her Misen serrated knife: “I’ve used bread knives before that were too flimsy, which made it hard to get through the crusty sourdoughs, but my Misen knife is long and sturdy.”Misen Serrated Knife$70 at MisenBow bread knives, so named because they look like you could play a fiddle with them (do not attempt this), are made of wood and help you cut even slices. Basically editor Sarah Jampel likes this handmade one from Etsy.Bow Bread Knife$30 at EtsyAmanda Turner, the former bread baker at Austin’s Odd Duck, opts for Korin’s Suisin Inox Bread Knife: “I’ve had a lot of different bread knives in my career, but this one was given to me as a gift from a friend about five or six years ago and it’s still razor-sharp! Also, the quality for the price is really great, so I highly recommend it.”KORIN Japanese Trading, Corp.Korin Suisin Inox Bread Knife$59 at KorinIf my physics teacher had us slice fresh sourdough, I probably would have retained more from all of those hours at a lab table, daydreaming and doodling across the top of my inscrutable notes. But she didn’t, and I didn’t, and a physicist I am not. But you know what? My bread knife and my tomato toasts and I are doing juuuuuust fine, thank you very much.And make some tomato toast already!Tomato Toast with Chives and Sesame SeedsSprinkle the chives, sesame seeds, and flaky salt with abandon.View RecipeEditor’s Note: This article was originally published August 2, 2018.Explore Bon AppétitBasicallyShoppingBreadKnifeKnivesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-02", "author": ["Condé Nast", "Alex Beggs"]}