{"id": "c753248b83bb3be98f196ddeab76d71f", "url": "https://www.bonappetit.com/story/bon-appetit-gift-box", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Give a Bon Appétit Gift Box, Become a Holiday Hero | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureGive a Bon Appétit Gift Box, Become a Holiday HeroMagazines! Cookie scoops! Recipes! More!By Jesse SparksNovember 16, 2018FacebookTwitterEmailHoliday shopping is complicated enough. Simplify things by giving BA’s exclusive subscription gift box. It’s chock full of goodies your friends are sure to love, like a “Don’t Worry, Eat Happy” tote, cookie scoop, and recipes for three stellar cookie recipes to bake all season long.FacebookTwitterEmailHere’s a little unsolicited holiday advice from the Bon Appétit team to you: People care a lot about what you get them each holiday season. Sure, we all know that it’s the “thought that counts” and as long as your heart is “in the right place,” everything will work out fine. But really, that scratchy sweater your great aunt gave you? We didn’t think so. Instead, give Bon Appétit’s brand spankin’ new gift box and be the holiday hero your family and friends deserve.People want gifts that keep on giving, and this one does—all the time. The box comes with a one-year subscription to Bon Appétit. We’re talking print AND digital, plus a bonus issue in the box, which means your cherished recipient never has to worry about missing out on the coolest new restaurants, the hottest trends, and the best new recipes BA has to offer.The bundle also boasts a signature “Don’t Worry, Eat Happy” tote, a reusable Stasher silicone storage bag (popularized by a little ol’ tv show called Shark Tank!), and a stash of BA editors’ favorite cookie recipes. We’ve even gone the extra mile and included a cookie scoop and two Skor bars, aka the closest thing to a perfect pre-made English toffee you’ll find. This way, your recipient can get right to making our new Snickerdoodle Party Cookies and you can get right to eating them.Who could say no to all of these goodies getting delivered to your door? Take our advice this holiday season and give the gifts people will truly want. And who knows, you might just end up with a few sweet treats for yourself.What are you waiting for? Get gifting!Explore Bon Appétitholiday2018GiftsGift GuidesHoliday GiftsRead MoreLifestyleThe Little Doodad That Turns My Apartment into a Fancy HotelBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-16", "author": ["Condé Nast", "Jesse Sparks"]}