{"id": "c797403def71e82305641a5ace2135ed", "url": "https://www.bonappetit.com/story/cbd-muscle-rub", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "This Topical CBD Muscle Rub Cuts My Workout Recovery In Half | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis CBD Muscle Rub Cuts My Workout Recovery In HalfThis topical saves me from period cramps and post-yoga stiffness.By Aliza AbarbanelApril 2, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!The year is 2019, and the options for using CBD are endless. It can be inhaled and stirred into coffee, shaken into cocktails, and added to desserts. But for sore muscles, period cramps, and other physical ailments, I use something that goes right on the skin.We love it: CBD+ Cool Stick, $25Unlike the luxe infused treats bouncing around your Instagram feed, topical CBD treatments bypass the bloodstream and digestive system to immediately get to work on targeted areas. Like all cannabis, research surrounding topical CBD is limited. But preliminary studies have been promising, and so have my personal results.After a year of use, Wildflower's Cool Stick is an essential part of my physical-care routine. The muscle rub suspends full-spectrum CBD oil in a moisturizing blend of shea butter, coconut oil, and hemp oil. Peppermint and arnica create an instant cooling sensation for immediate relief, and, within a few minutes, I’m more comfortable. I love it for post-yoga stiffness; my boyfriend religiously uses it to ease his lower back pain after long runs. The strong menthol scent conjures up memories of the drugstore muscle rubs at high school track and field practice, with one big difference: this stuff really works. –  Aliza Abarbanel, Healthyish editorial assistant.Buy it: CBD+ Cool Stick, $25All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish Loves ItHealthyishCannabisShoppingRead MoreLifestyleThese Sparkling CBD Drinks Have Replaced My La Croix Habit For GoodBy Annie DalyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Aliza Abarbanel"]}