{"id": "c799939d071c565bff2292de297843f4", "url": "https://www.bonappetit.com/story/price-of-taco-truck-taco", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "What Price Can You Put on a Taco Truck Taco? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureWhat Price Can You Put on a Taco Truck Taco?I come to my favorite New York City taco truck for the perfectly seasoned lengua tacos, but I stay for the community.By Francis LamFebruary 13, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailDo you remember the first star you ever saw? Your first sunrise? I can’t remember any of those things. But I can tell you exactly when I had my very first taco.I was at a flea market in my hometown of East Brunswick, New Jersey, at a stall with curtains drawn around for walls. We paid in quarters. By today’s food cognoscenti standards, it wasn’t much of a taco: crunchy shell, ground beef, a few feathery strips of lettuce. I was seven or eight, and I’d been led there on my bike by my preteen cousin who, in a bit of infamous family lore, my mother once said was a “bad influence.”But here’s what I remember as much as the taco itself: the other workers at the flea market who were eating them too; the chitchat between them; how their own stalls selling welcome mats and garden tools sat empty as they stood around laughing for a few minutes. I don’t know why all this is lodged in my brain, but I suppose it’s because I keep reliving that moment at different times, in different places, in different languages. I love watching easy friendships being born over carnitas and a spray of lime.El Gallo Giro taco truck in NYC.\nPhoto by Emma FishmanOne night 25 or so years after that, I was at my favorite taco truck, El Gallo Giro in Jackson Heights, Queens. I used to walk by it on my way home; it was always there, always open. I showed up and realized I’d left my wallet at work. No problem, the taquero told me, and held off on making my second taco until I finished my first so it would be fresh.I was eating, huddled by the little counter at the truck’s side, when a young man asked me how it was. He was Dominican; he’d never had a taco before, and I guess I looked like I was enjoying mine. We talked for a while: He told me he was looking for a job handing out free newspapers by the subway, and I told him what he should order. He liked his tacos de carne enchilada so much, he told the taquero he wanted to buy my dinner for me. I never saw him again, but that’s the kind of thing that can happen at a taco truck.Taco trucks—or carts, or stands—live out in the open; most people grab and go, and it’s easy to think that they’re transient and anonymous. But a great taco vendor is all about a kind of fleeting permanence, a constant point for people to gather, a place you can rely on for hot tortillas and the small bonds of humanity that keep society going.This year, on Thanksgiving, I found myself back at El Gallo Giro. I was returning from a work trip, my wife and kid left town to visit family, and, being solo, I paid a visit to my old Jackson Heights taquero. I’d moved away, it’d been years since I’d been back, and to make sure the truck was still there, I looked it up on Yelp, where I found someone fond of posting selfies from beautiful European seaside towns noting her disappointment that the tacos were $3 “instead of $2.50 like everywhere else.”The tacos were better than ever. The lengua was beautifully seasoned, cooked to the point just before the chewiness vanishes, the way I love it most. The truck had been upgraded, now loaded with a trompo for real-deal carne al pastor spinning before a flame, its edges charring into crispy bits, served with a few nicks of roasted pineapple.It was cold, and the streets were empty; no turkeys were being spared on this night. I ordered one more taco: cecina, griddled salt-cured beef, and smelled the coconutty finish of lime on my hands, anticipating the moment I would notice the scent of vaporized lard on my skin. I chatted for a while with the taquero, Jorge, when we heard some raised voices. Next to the truck, a South Asian produce vendor was arguing with a customer who wanted a five-dollar bag of fruit for four. After the customer stormed off, the produce guy and Jorge commiserated, even though neither of them really spoke English. I guess there’s a universal language for people not wanting to pay you what you’re worth when you work outside in 40-degree weather.As Jorge and his neighbor smiled off their conversation, another man came up, ordered a quesadilla, and fist-bumped the taquero. They said some things in Spanish too fast for me to understand and started laughing right away. I thought back to that first flea market taco. At a taco truck, the goods are wrapped in a tortilla. But the greatness is in the standing around, the talking and the nodding. The looking at a complete stranger and feeling, for the time it takes you to eat the six bites of a taco, that you’re here together. What price can you put on that?Francis Lam is a James Beard Award–winning food journalist, cookbook editor, and host of American Public Media's The Splendid Table. He lives in New York City.Want More Stories From Taco Nation? Right This Way...Why Are H-E-B’s Flour Tortillas So Dang Good?In Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceSandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoIt’s Time We Give the Mexican Combo Platter the Credit It DeservesHow the Food Javier Cabral Grew Up Rejecting Became His Greatest Passion—and His Career.Cooking in the Midst of a Border Crisis Is About More Than SurvivalAnd so much more!Explore Bon AppétitTaco NationMexicanNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Francis Lam"]}