{"id": "c7a609983bf25d12b5cf3ad45911bfc0", "url": "https://www.bonappetit.com/recipe/anzac-biscuits", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Anzac Biscuits Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAnzac BiscuitsBy Lara LeeApril 19, 20214.7(62)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintAsk any Australian or New Zealander about the iconic foods that define their countries and you may hear them proudly say Anzac biscuits. No other food holds greater significance to their history—so much so that the name, recipe, and shape are protected by law in Australia. (Read more about the history of Anzac biscuits here.) Minor variations are permitted and so the recipe has evolved over time (see the excellent addition of coconut), but the key ingredients are oats, butter, and golden syrup—a viscous amber-colored liquid sweetener with a rich caramel flavor—which binds in place of eggs. For those who can’t source golden syrup (Lyle’s is the go-to brand), you can substitute the 2 Tbsp. used in this recipe with 1½ tsp. dark treacle (or unsulfured molasses) mixed with 1 Tbsp. plus 1½ tsp. honey. (Just don’t call it an Anzac biscuit.) Be sure to use whole old-fashioned oats for perfect results, as instant or quick-cooking oats have a different level of absorbency. The biscuit dough should be firm enough to easily roll or press into balls, and it should be pliable and not crumble apart when flattened with a spoon. Fix a wet dough by adding flour a little at a time, and dry dough with a little melted butter. And as for the 100-year-old debate over whether an Anzac biscuit should be chewy or crunchy? This versatile recipe puts the argument to rest with a biscuit that can be taken either way; simply bake the biscuit for longer for a crispier (and crunchy) finish. —Lara LeeAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLyle’s Golden Syrup$14 At AmazonSmall Saucepan$155 At AmazonMedium #40 Cookie Scoop$16 At AmazonParchment Paper$3 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredientsMakes about 38125g (9 Tbsp.) unsalted butter40g (2 Tbsp.) golden syrup160g (¾ cup plus 2 Tbsp.; firmly packed) dark brown sugar150g (1 cup plus 3 Tbsp.) all-purpose flour, sifted100g (1 cup plus 2 Tbsp.) old-fashioned rolled oats80g (1 cup) unsweetened shredded coconut½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt½tsp. baking sodaPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 350°F/180°C or if you have a convection oven use 320°F/160°C fan). Heat butter and golden syrup in a small saucepan over medium, stirring, until melted. Remove from heat.Step 2Whisk brown sugar, flour, oats, coconut, and salt in a large bowl to combine. Stir baking soda and 2 Tbsp. hot water in a cup until baking soda is dissolved. Pour into butter mixture, stirring to combine. Add butter mixture to dry ingredients and stir until well combined.Step 3Scoop out level tablespoonfuls of dough and roll or press into balls. Place balls on 2 parchment-lined large baking sheet, spacing at least 2\" apart (you won’t be able to fit them all). Slightly flatten balls with a spoon.Step 4Bake biscuits, until golden and edges are slightly firm, 11–13 minutes. For chewier cookies bake 1–2 minutes less, for crispier cookies bake 1–2 minutes longer. Let cool on baking sheets. Repeat with remaining balls of dough.Do ahead: Biscuits can be baked 2 weeks ahead. Store airtight at room temperature.How would you rate Anzac Biscuits?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleThey're very crispy yet soft and they have this crunch that sinks into your teeth. Anzac Biscuits have this divine taste and flavor that melts your taste buds and makes you feel so happy and feel like your brand new. Oliva Wells, ME 3/21/2022I’m not sure what I did wrong. Followed the recipe exactly. Mine did not spread AT ALL. Looked nothing like the photo. I thought it was because I rolled them in too compact of a ball before slightly flattening them with a spoon. I did that because I found the mixture slightly dry and they fell apart easily. The second tray I rolled less compact and still no spreading. The flavor was just okay. I used good quality old fashioned oats that I use for my oatmeal cookies but with this recipe they tasted…raw, not cooked at all. I may try them again with a different brand of oatmeal. Any advice would be greatly appreciated. LisaChicago 1/1/2022These cookies are so delicious, I can't stop making them! I changed the recipe slightly, using 1/2 cup dark brown sugar and split the flours between whole wheat and AP. I baked them for 11 minutes, which resulted in crunchy edges and chewy inside, yum! I had no idea you could make cookies without eggs!MarciPort Townsend, WA1/1/2022One of the best cookies I've ever made.  Rave reviews from everyone at the office.  A 100% hit and I'm making again next week for NY's.  corayankBoise, ID12/22/2021These cookies are sensational. I have been baking chocolate chip and oatmeal and peanut butter cookies for 50 years and I just love these, so simple, so good. The women of Australia baked these and sent them to their troops, I think in WWI, hence the name Anzac, Australia New Zealand Army Corp. I add a large teaspoon of vanilla, and that lady is right, it is hard not to eat them all. I just made a batch and only ate four, my friends will love the rest. Make them!Sybil the BakerHonolulu8/4/2021I have made these a few times for my Community Lunch (free) program; about 130 lunches every Thursday.  Regardless of how special my entrée is, the comments are all about the biscuits!  Why are these not on cookie shelves everywhere in the US?   Jimmie VaughnPittsboro, NC6/14/2021Very good and easy to make. Follow the recipe but used maple sirop instead and added a tbsp of chia. As suggested I went for two minutes additional to have a dry cookie. Next time I may do half and half .\n\nSince I try to cut down on sugar I will reduce the brown sugar until I get the perfect cookie for me. I don’t believe this will change the taste very much.\n\nExcellent recipe and will do this again for sure. Pls don’t do this if you are hungry, they won’t last.Richard MCanada6/6/2021So very good and very, very easy. I substituted real maple syrup for the golden syrup and table salt for Kosher. The only Kosher I had was course grind and I wasn't sure how to measure so I went with half the amount listed of regular table salt. Turned out really well. So well I am afraid they will be gone before my grandkids get here tomorrow! I used a tablespoon to measure dough and got 28 cookies. I will definitely make these again but will wait until the grands are here with me so I don't eat them all myself - LOL.JulieSpringfield, Ohio5/1/2021These came out great, a bit crispy on the outside and still chew in the center.  I followed the recipe exactly but I only got 18.  For 38 you would have to roll them very small.Wanda K4/26/2021This is the best Anzac Recipe I have ever used!  They turned out great. Beautifully golden, delicious and all eaten before I could put them away. Definitely a winner! AnonymousBoston MA4/25/2021Delicious. Use an ice cream scoop with quick-release to make 19 perfectly sized biscuits from this recipe. Mr KNew Zealand 4/24/2021Every time I eat one of these delicious cookies I celebrate the memory of my dear grandmother - one of the best bakers I ever knew.  John Q. CitizenThe Good Ole US of A4/24/2021Anzac bickies are absolutely delicious. It's been a few years but I'm going to whip up a batch this year, probably from an ancient family recipe. There is a bit of debate among Aussies as to whether a 'proper' Anzac biscuit is chewy or crunchy. I mean obviously it should be chewy, but I'm willing to hear both sides of the argument.\nJust to agree with another commenter, I don't think it's right to call Anzac Day a celebration. A better word might be 'commemoration'. \nBut thanks for spreading the word re Anzac biscuits. They are delicious, and delicious things make people happy. LauraLondon, UK4/23/2021PLEASE, they are NOT cookies, they are BISCUITS! I know this is hard for Americans as your biscuits are our scones! (Let's not go there.) If it seems wrong for you to call them biscuits then it is perfectly acceptable to simply call them Anzacs but never cookies.\n Hard to make the genuine article without golden syrup but treacle works pretty well, it just makes the biscuits darker. Golden syrup is essentially liquid sugar. It is sugar one stage more refined than treacle. \nThanks for posting the recipe this Anzac weekend.anniemNew Zealand4/23/2021Anzac Day is not a celebration. It is supposed to be a sombre day of mourning and remembrance. The tradition of two-up and more than a few too many schooners grew out of PTSD-afflicted servicemen heading to RSL Clubs after official ceremonies to drown their sorrows.\n\nAs an American publication, I'd suggest revising your use of the word \"celebrate.\"\nDimitriSydney, Australia4/22/2021Explore Bon AppétitCookieDessertAustralianNew ZealandOatRice & GrainsCoconutFruitBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-19", "author": ["Condé Nast", "Lara Lee"]}