{"id": "c7b8a40222221dd73c537c8c33a36831", "url": "https://www.bonappetit.com/story/holy-moly-pasta-e-fagioli", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "Holy Moly, Make Pasta e Fagioli and Fried Bread Tonight | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHoly Moly, Make Pasta e Fagioli and Fried Bread TonightCarla Lalli Music proclaims it’s make-soup-and-nap season in her weekly newsletter.By Carla Lalli MusicSeptember 27, 2018FacebookTwitterEmailGentl & HyersFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Who you callin’ a fazool?The fall equinox happened this weekend, which can only mean one thing: Hibernation is coming.Where once it was light and bright, it is now dark and moody. Instead of picnics and barbecues, head inside: It’s Sunday soup or bust. If you ask me, the one soup that rules them all is the one with both pasta and  beans in it. That’s right: pasta e fagioli. Depending where you’re from, you might pronounce this “pasta fazool,” but I wouldn’t go throwing that around unless you know what’s up.Want this letter before it hits the website? Sign up for our newsletter!Like any good Sunday soup, pasta e fagioli is a low-and-slow, hands-off affair that you start in the morning, check on a couple of times during the day, and buy a fresh loaf of bread for in the late afternoon—you know, for dunking. To make this tomato-y, Parmesan-enriched, lazily-simmered soup, you need nothing but the basics: Dried white beans, carrots, celery, garlic, herbs, and trusty tap water burble along in a big pot for a couple of hours until the beans are done. Separately, olive oil, onions, more garlic, a can of tomatoes, and a long pour from an already-opened bottle of wine team up to become a flavorful, concentrated and saucy base. Then the cooked, creamy white beans and the tomato situation invite some dried pasta and escarole over for a getting-to-know-you session that leads straight to a shallow bowl, a big spoon, and your face. Economical, filling, nutritious, and soul-affirming.There are variations, of course. You could always render some diced pancetta or bacon along with the oil and garlic that go into the tomato mixture, or you could throw a ham hock in along with the beans. Instead of the classic cannellini, use a baby lima, a cranberry bean, or a gigante. Torn collard greens, kale, green cabbage, beet greens, or blanched broccoli rabe can stand in for the escarole. Red wine could replace the white; ditalini or small shells are perfectly acceptable substitutions for the broken pieces of lasagna in the original version.Life is better with fried bread.\nOnce I come to grips with the Season of Darkness and Despair, I actually start to look forward to simmering things again. I take a nap and make a big pot of soup and I think: Right, this kind of cooking is enjoyable, too. It’s not stone fruit or spring peas or anything, but it’s got its own power. My children emerge from their caves, lured into the kitchen by the powerful dinner vapors, and one of them will talk me into heating up a cast-iron skillet to make fried bread on the side (though a baguette passed around the table will do just fine). You’ll sleep well on a bowl of pasta fazool, and considering how short the days are getting, that’s precisely the point.Get the recipe:Pasta e Fagioli with EscaroleExplore Bon AppétitSoupCarla NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-27", "author": ["Condé Nast", "Carla Lalli Music"]}