{"id": "c7cbd5efc8994c733cbd51206e37e4c6", "url": "https://www.bonappetit.com/story/naz-riahi", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "How Naz Riahi Created Bitten, the New-School Food Conference That Goes Far Beyond Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Naz Riahi Created Bitten, the New-School Food Conference That Goes Far Beyond FoodThe bi-coastal event series uses food as an entry point into art, social justice, climate change, and restaurant culture.By Ali FrancisOctober 23, 2018FacebookTwitterEmailPhoto by Ruthie AbelFacebookTwitterEmailIn Entrepreneurs Run the World, we get advice and insight from game-changing entrepreneurs with big ideas. This week we talked to Naz Riahi, founder of Bitten, an event series coming to New York on November 1 that looks at food through the lens of technology, trends, creativity and more.At my first Bitten conference in 2015, I went through a rollercoaster of emotions akin to crushing two red wines and listening to Alanis Morissette on my fire escape. I felt wistful, hopeful, and a little tipsy all at the same time. (Particularly when Claudia Ficca started talking about styling meatballs for a living—swoon.)The bi-coastal summit, now in its fourth year, uses food as an entry point into a pretty heavy curriculum: Art, social justice, climate change, and restaurant culture are the real agenda. And it’s all curated by Naz Riahi—journalist, arts and advertising wizard, and trend consultant—who measures success in good vibes.“I don’t own an apartment, I don’t have an expense account, and I don’t make nearly as much money as I could if I had a full-time job,” Riahi explains. “But I am exponentially happier than I’ve ever been.”In between organizing this year’s details—“talks ranging from psychedelics to food as a weapon” and a “totally dreamy breakfast and lunch catered by Maman”—we chatted with Riahi about building a business as a woman of color, being the good kind of naïve, and the vegan yogurt she swears by.What inspired Bitten?Food is universal and in some capacity unites all people regardless of their background. And I love conferences, workshops, and off-sites for their ability to inspire and motivate people. I really wanted my work to be a catalyst for that in other people’s lives.How did you build Bitten?I came up with this idea very quickly, decided on a name, and built a website. I’m not a designer, and I didn’t have the right assets, so I reached out to an amazing food photographer and stylist duo and asked if I could use their photos. Those gorgeous, professional shots gave my work legitimacy. After that, it was a lot of naïveté.What do you mean by naïveté?I thought it would be so easy to get sponsors, speakers, and an audience. I was dead wrong. It was some of the hardest work I’ve ever done in my life—and continues to be. But I needed that bit of stupidity and blind faith.That being said, is there anything you really wish you knew before starting Bitten?No. I if I had known the truth—how hard it would be—I never would have done it.Where and when do you do your best work?I almost always work from my couch. I’d love to go into an office, but it’s often easier to just open my laptop and get to it. I never schedule a meeting for earlier than 10 a.m. because I don’t like the morning train traffic. And I like to take my dog for a long walk in the park and start my day off without rushing.What are three things we’ll always find in your work-from-couch repertoire?I’m obsessed with Lavva yogurt. It’s this vegan yogurt that’s tart and basically perfect. Also pasture-raised eggs from the farmer’s market. And New York Shuk’s condiments! Their harissa on everything.How did you attract high-profile speakers to an event that was then unheard of?Well, from the beginning, I never focused on celebrities or people considered high-profile. I focused on people doing interesting work and their stories. I’d rather introduce my audience to someone groundbreaking than to have a ubiquitous celebrity take my stage.What is the hardest part of a Bitten event to produce?The emotional part of it is really challenging. I want to put on an amazing show. I want every single audience member to leave feeling refreshed and inspired. I want them to go and tell everyone about it. Same with my speakers. That’s a hell of a lot of pressure.Does working out relieve any of that? When and how do you stay active?I walk a lot, like 5-8 miles a day. It clears my head, I run into people. It’s great. Besides that, I swim and do yoga and aspire to own a Peloton bike.Is Bitten your full time gig? Do you supplement it throughout the year with other work?Yes and yes. I work almost all year on Bitten in one capacity or another. I also curate and design custom events for brands. These can be workshops, panels, or conferences. And I work with big brands and startups as a marketing and communications consultant.Is Bitten totally self-funded? How does the event make money?Yes! It’s a combination of ticket sales and sponsorships.Are money and success correlated for you?I used to think success was about financial wealth. I now know that success is about happiness, and happiness has almost nothing to do with money. Since launching Bitten, I’ve met the most incredible people, been able to walk my dog in the park at almost any time of day, written a book of essays that I hope to publish, and made a short narrative film.Can you tell us more about this book?I grew up in Tehran, Iran, and immigrated to the U.S. as a 9-year-old, under extremely traumatic conditions. The book is about love and food and assimilating to a country and culture through cuisine. It’s called Bad at Love and an essay from it will be published on November 21 on Longreads! “I’m shook,” as the kids would say.Are there any business challenges you face on an ongoing basis?I joke that for the first year of Bitten I cried every night. It’s a lot of pressure to put this event on and to make money from it! Another big emotional challenge is when I feel unsupported by the community. It really hurts my feelings because I believe that we are all responsible for each other. Especially as women. My mantra has always been that any woman’s success is my success (and mine should be hers). I want us to help each other out, to promote each other. But I find that is sadly not always the case.What have you learned about being a female entrepreneur?It is far harder for women and women of color to own their own businesses. We constantly have to challenge people’s stereotypes and prove ourselves capable and worthy. We are not given the benefit of the doubt. We don’t walk into a room with the advantage of automatically being respected, believed, and trusted. That’s one (of many) heartbreaking effects of patriarchy. And it fucking sucks.Have you received any great business advice from any of this years’ Bitten speakers?Definitely. We have a talk this year by Laurie Woolever, who is brilliant, and was Anthony Bourdain's friend, assistant, and collaborator for over a decade. In discussing her Bitten talk, which is about Tony, she told me that he used to say, “I always leave room for the possibility that I'm wrong.” Hearing that was really powerful for me.If you could pick one person's brain about Bitten over lunch, who would that be and where would you go?Danny Meyer. I have a lot of amazing women mentors. I’d like to balance that out, and I know I can learn a lot from him. Of course, I’d let him choose where we eat.What’s one snack that reflects your overall food philosophy? (We won’t tell Danny.)Banana with peanut butter. I tend to live a very unrestricted life. Which means that I eat whatever I want. The problem is that I don’t have the fastest metabolism. So from time to time, I’ll do Weight Watchers—instead of having a scone every single day, I’ll only have it once a week. Anyway, a banana is zero points! (Peanut butter, on the other hand, is not.)Explore Bon AppétitHealthyishEntrepreneurs Run the WorldInterviewsRead MoreLifestyleHow Moving to Jamaica Helped This Entrepreneur Launch Her Travel BrandBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-23", "author": ["Condé Nast", "Ali Francis"]}