{"id": "c7cfc472154623b241a44c43a6f987cc", "url": "https://www.bonappetit.com/story/day-of-sitting", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "A Tale of Two Buttcheeks: Rating New York’s New Restaurant Chairs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Tale of Two Buttcheeks: Rating New York’s New Restaurant ChairsThe only way to investigate the state of comfort in buzzy new restaurants—walk in, have a seat, and leave.By Alex BeggsMay 4, 2019FacebookTwitterEmailIllustration by Simon LandreinFacebookTwitterEmailAre restaurant chairs getting more comfortable lately, or is it just me? This is something I’ve been thinking about. I’ve even consulted experts in an attempt to pinpoint the qualities that make a truly comfortable seat. (Is that memory foam under my butt?) You can read about that here. But during my research, something became clear: I needed to test out this theory in the field. So I devised a plan for a Day of Sitting, which then turned into a Few Days of Sitting. All in, I hit up nine recently opened, buzzy New York City restaurants of the $$-$$$$ caliber (where the chair stakes are higher, per here), and literally put my ass to work. I’d walk into a restaurant, ask if I could please try out their seating for a minute or two, and be on my way. No coat check. No still or sparkling. Plenty of side-eye.This is the tale of one butt; however, the world contains multitudes, each with their own seating preferences and chair fantasies. Please feel free to record your own comfort ratings each time you write a Yelp review or Instagram caption, to help make the world a more comfortable place. With that in mind, here is my journey, ranked in plain text buttcheeks, from zero, very distressed cheeks to a full, happy set: (  )(  ).Frenchette’s chairs offer ventilation opportunities.\nPhoto by Heidi's BridgeFrenchetteThe booths: When I walked in, the kind hostess said I could sit anywhere and do my thing—as if people came in asking for a sit without food every afternoon. I plopped down in a big, burnt sienna–colored booth in a corner of the nouveau-Frenchie brasserie. The definitely expensive leather didn’t make any embarrassing fart noises when I slid across the smooth expanse. The seat was springy and comfortable—maybe...even...too springy? Did I feel an actual spring in there? I took a few extra bounces in the booth to inconclusive results but conclusive joy. The booth had a posture-enforcing upright back, for which it loses one half-cheek. Otherwise, extremely comfortable. Rating: (  )(  ’The dining chairs: The definitely expensive wooden dining chairs have portholes in the back that make them featherlight, and I assume, also let in a nice breeze. The wood is rounded, so it doesn’t stab you in the back, while the seat is wide with a subtle sloping butt depression (technical term). However, it’s still a wooden chair, which is never going to be as comfortable as something cushioned. Rating: (  )Benno’s got the blues.\nPhoto by Alex LauBennoThe booths: Are oxblood, with a velvet back and herringbone seat, fitting for this swanky Italian restaurant. The seats are firm—no bouncy-bounce here. The back tilts back slightly, as it should. A manager lurks behind me, watching with a relaxed anxiety. “It’s a good one!” I assure him. Two cheeks. (  )(  )Those glamorous velvet chairs: with brass arms and tufts of Bellagio velvet on the freaking armrest. I sit and prop my elbow on the upholstered armrest, pretending I have something important and interesting to say. Instead, I say, “Nice arms!” The curved back hugs me as if we’ve met before. The seat is very firm. There’s another version of this chair without arms—more of a bucket shape that allows you to sink all the way back. Rating: (  )(  )Good chair-age at Henry.\nPhoto by Bea De CostaHenry at Life HotelI wander in during sleepy off-hours pre-dinner, and no one really stops me except a guy who gives me a face I’d call “extreme side-eye,” and walks away, quickly, when I tell him why I’m there. Little does he know what he’s missing out on! Comfort! These chairs are a buttery cognac leather, like a seat in a luxury car, with an inviting, deep butt depression. More of a scoop. The stretchy leather means you can lean back, cross and uncross your legs, and whatever other gymnastics people do while dining. Rating: (  )(  )Step into the time machine, we’re at Cipriani.\nCourtesy of CiprianiHarry Cipriani, uptownThis isn’t a new restaurant, but I wanted to include it because when I interviewed designer Christine Gachot, she told me it was her favorite seat in New York City. Cipriani had just opened for dinner, and the entire place was glowing yellow from the table linens stolen straight from Gatsby’s closet. A server with pomade-slicked hair waves his hand gesturing, Have a seat, whereva you want! And whooaaaa. These chairs are much lower to the ground than usual—by at least a foot. (It’s technically bar seating.) They’re a little scratched and worn, but polished and rounded, and so, so smooth. Can wood be silky? It’s silky wood, with an experienced leather cushion that thousands of other butts have worn in for me. “Ya comfortable?” asks my waxy-haired friend from across the room. Before I decide to stay forever, five cubs of Wall Street walk in and that’s my cue to leave. Rating: (  )(TabeTomoI’d heard VERY good things about the ramen at TabeTomo, so I stopped by to check out the barstools. Unfortunately I really confused every employee at this charming place, who kept asking, “Sooo, you’re eating...alone?” “I’m just having a sit!!!” The black leather seat is smooth and serviceable, and the wooden back tilts slightly, which would be amazing if there wasn’t a design flaw: An abrupt angle juts out, gently stabbing you in the kidneys as if to say—you’re not the only lady who wants ramen tonight. Elsewhere, there are long benches with an inch-high cushion and a 90 degree straight back, not ideal. I still plan on coming back for ramen; I eat fast. Rating: (Violet’s eternal flatness.\nPhoto by Meghan FarrellVioletThis is a pizza place where the pizza is cut with scissors. I sit on a barstool with a tiny square wooden seat. It is flat. Uh oh. I didn’t feel the need to tell you anything about my anatomy but I have these things, thighs, and this stool only fits one of them. I find a precarious balance and have a glass of wine while the friendly bartender does a cheer kick to the music. Despite this outpouring of joy and red wine, the corner of the square is digging into my thigh and I’m thinking about square-shaped butts, which do not exist. There are also hardwood booth/benches, and I overhear a couple discussing who’ll sit on the booth-side, ultimately the man refuses because he can’t squeeze between the two tables to get there. When I sit in the wooden dining chair opposite the benches, my butt slides into the empty space between the seat and the back, sort of...oozing. Not fabulous. There’s a theme here. I have no choice! Rating: A quarter cheek. ‘Au ChevalI slide into a taut and bouncy diner-style booth, the way to go if you’re having a cheeseburger here soon. Your other seating option is a diner-style leather barstool, or a wood chair sourced from the frontier, it appears. Those are dark wood, with delicate wooden stiles (I think that’s the word for the vertical rails on the back?) that remind me of Victorian dollhouse porches. Guaranteed numb butt if you sit in those for over an hour. Good thing there are plenty of booths! Rating: (  )Momofuku’s hot dog booths.\nPhoto by Louise PalmbergMomofuku Noodle BarAt the new Columbus Circle Momofuku, I’m allowed a quick sit before lunch service begins. If you know the legend of Momofuku, it started as a hole in the wall noodle shop with hardwood benches that food critics took as a personal F-U. Famously uncomfy! Diners didn’t care, the place was and is always packed. But restaurants evolve, and the seating situation at their newest location is improved: there are twofers and long booths with caramel-colored leather seats and squishy, hot dog cushioned backs that remind me, pleasantly, of a stress ball. At the bar and the ends of tables, there are wood chairs that I nearly slip ‘n’ slide off, but they have lumbar-supporting backs and wide-ish seats. Grab a booth! Rating: (  )(The Four Seasons RestaurantImagine a restaurant where everything is the most expensive version of itself. Welcome to the Four Seasons, I live here now. I sat on 12 total chairs at the wowee-zowee restaurant, but I’ll focus on the gold-plated highlights. In the bar, there are lush armchairs in a brown, grandpa sweater tweed that swivel. As I literally take one for a spin, I realize the back is low, encouraging me to sink back and swirl an imaginary scotch. When I swivel around, there’s an older gentleman waiting for me. “Would you like to try some more?” he asks, and gestures to another bar seat with a caned back (beautiful, but not the most comfortable here). The man is managing partner Alex von Bidder. The upholstered chairs in the dining room appear in three different warm colors, which obviously complement the five shades in the terrazzo marble floor. This is living room furniture. I take a seat and examine the fine-weave, the deep mustard shade, and sigh. “I need to make more money,” I tell Alex, who knows a lot about it. I mention that armchairs aren’t inclusive to all diners; some might feel restricted. “You could also say a chair holds you,” he replies elegantly. If you’d prefer armless, there’s eel-gray banquettes in a buttery suede with back pillows more comfortable than my bed. In the ladies’ room upstairs—the marble-covered mausoleum of my dreams—there are pale pink vanity seats and a wide pink bench. I’m gonna need more cheeks for this place. Rating: (  )(  ) (  )(  )Explore Bon AppétitDesignRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-03", "author": ["Condé Nast", "Alex Beggs"]}