{"id": "c7d29660514712acf27c50782fe7f114", "url": "https://www.bonappetit.com/story/chicken-stew-topped-with-chicken-skin-recipe", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "What’s Better Than Chicken Stew? Chicken Stew Topped With Crispy Chicken Skin | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat’s Better Than Chicken Stew? Chicken Stew Topped With Crispy Chicken SkinTop this uber-rich slow-cooked autumn centerpiece with mix n’ match fixings.By Hilary CadiganSeptember 28, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethFacebookTwitterEmailNo one has ever given me an award for my ability to plan ahead. Because I’m terrible at it. But here’s the thing: I love the singular benefits of cooking low and slow. The plush, fall-apart-ability of meat that’s stewed for hours; the deep, silken texture of broth that’s bathed with bones overnight. The Instant Pot is great and all, but for me it’s never quite captured the full amplitude of a slow-cooked-thing, try as I might to cut corners.A person with more sense than I would probably come to a simple conclusion here: Make these foods when you, like, have time. On a Sunday. Or a sick day. Or a “rejuvenation leave,” a real thing according to a press release we recently received. But I’ve never gotten an award for being sensible either. And that is how I found myself tearing through my local Key Foods at 7 p.m. on a Tuesday like a contestant on Supermarket Sweep, hurling packages of organic skin-on bone-in chicken thighs into my bag with no explanation beyond a very specific craving for hearty, slow-cooked, made-at-home stew. Specifically, this Slow-Cooked Chicken Stew with Kale, a new autumn centerpiece built to warm the tummies and stick to the bones of up to eight people (or two, many times over), topped with a quartet of crunchy and acidic mix-n-match toppings to complement its richness.Photo by Chelsea Kyle, Food Styling by Susie TheodorouHere is my story.7:34 p.m. Remember how I texted you earlier that I was making slow-cooked chicken stew for dinner and how excited you were? I say to significant-O Rob, who has just returned from work and informed me he is very tired and very hungry. Well, we’re starting now. He gives me a long dead-eyed stare. I pour him a large glass of wine and relinquish Spotify rights, then give him an onion to chop.7:49 p.m. Rob fries a tangle of bacon in a pot on the stove 'til it’s crispy and smells very nice. I salt and pepper eight gleaming chicken thighs to perfection, then turn my back for one moment (okay, maybe five moments). When I return, my sons who are cats have licked what appears to be every single piece of chicken, and are team-dragging one thigh across the table back to their lair behind the stairs. They do not seem sorry.8:13 p.m. Chicken thighs are crackling in a shallow pool of bacon fat. Hot bacon fat burns off cat saliva, right?8:40 p.m. You know what's impossible not to prematurely snack on? Chicken skin that’s been fried in bacon fat then removed and baked real crispy. The key to this recipe is not just what’s in the stew; it’s what goes on top: fried chicken skin chopped and tossed with grated garlic, salt, pepper, and lemon zest. Kind of like a zingy chicharron situation. I eat about half of it while Rob isn’t looking, then blame its absence on the cats.8:51 p.m. Now-skinless chicken thighs are simmering with water, shallots, garlic, parsley, bay leaves, and bacon. The recipe says this step will take an hour to an hour-and-a-half to complete, so Rob cranks up his Miami Vice-themed playlist to drown out the sound of our stomachs growling and we settle in to polish off the rest of the wine.9:32 p.m. The stew is still simmering. \"A watched pot doesn't boil!\" I say helpfully to Rob, who is cursing the day we met. I prepare stew topper number two, homemade lemon oil, by thinly slicing a lemon into quartered rounds and submerging it in a small bowl of olive oil with a pinch of sugar, salt, and pep.10:08 p.m. We remove the chicken thighs from the broth and let them cool for about ten minutes, then pull tender meat from the bones and tear it into bite-sized pieces. The bones go back into the pot, so we may glean from their marrow every last bit of fatty, flavorful goodness.10:27 p.m. Curly kale balances out fatty goodness, so we dump eight cups of it into the bubbling cauldron. They turn bright green and immediately shrink into the broth. Magic! Then the stew comes off the heat and the meat goes back in.10:39 p.m. Suddenly, I notice a small recipe direction I did not notice before: for best results, this stew is supposed to sit and chill for 12 hours (bones and all) before we eat it. (Colleague Sarah Jampel, who could and probably has won many Planning Ahead awards in her lifetime, on Slack the next day: “Reading the recipe all the way through before you make it is the No. 1 recipe rule!” Thanks, Jampel.) But this kitchen smells too good and my stomach is growling too loudly and Rob is too close to calling off our wedding to not eat this stew right this very second. So, we carefully fish out the bones and put them in Tupperware. I’ll put them back later and pretend this didn’t happen.10:55 p.m. Out come the bowls and the spoons and the toppers: crispy-crunchy chicken skin gremolata, lemon oil, sliced radishes, and red onions. One by one I spoon them onto the stew, surface slick and studded with silk-soft mounds of chicken, green swirls of kale, and bits of bacon. The crunch of the toppings plays like a jazzy little song off the unctuous broth. One-dish dinner: complete!11:23 p.m. After we’ve scarfed down all we can I plop the bones back into the pot, cover it, stick it in the fridge and collapse into bed.THE NEXT DAY: I wake up ready for—what else?—more stew. The recipe is correct: chilling for hours has dramatically improved the flavor. (Hot tip: Scrape off about half of the superfluous fat that has risen to the top, both for the sake of your heart health and to brighten up the flavor of the broth.) It was all worth it. I bring my stew to work along with a tupperware full o’ toppings for the least sad desk lunch OF ALL TIME! Stew for lunch! Stew for supper! Stew for breakfast! Stew forever.Get the recipe:Slow-Cooked Chicken Stew with KaleA flavorful chicken stew that gets every iota of value from the chicken bones.View RecipeExplore Bon AppétitStewchicken skinChickenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-28", "author": ["Condé Nast", "Hilary Cadigan"]}