{"id": "c7de1512255d3309a781468ce702a982", "url": "https://www.bonappetit.com/story/gift-guide-glassware", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "The Cheap, Chic Glassware You Need for Your Next Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Cheap, Chic Glassware You Need for Your Next PartySix affordable options for grown-up glassware, because you're too old to be serving drinks in Solo cups.By Amiel StanekDecember 4, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailI've flown first class exactly one time. (Don't look at me like that, it was a free upgrade!) And while getting to board first and all that extra legroom certainly didn't suck, those luxuries paled in comparison to one small, simple gesture: When I ordered a gin and tonic, it was served to me in a real glass. An actual glass! Made of glass!  I was sipping an alcoholic beverage from a clear vessel made out of melted sand at 30,000 feet. I felt like A Million Dollars.And you know who else will feel like A Million Dollars? All of your friends when you invite them over to your house for a party and have real glasses for them to pour their beverages into instead of a stack of disposable plastic cups. And no, I'm not talking about the random assortment of branded pint glasses you stole from bars in college—nice glasses, ones that match and feel good to hold in your hand and aren't too big or too small. It's classy! It's grown-up! It's better for the environment! And before you groan about being asked to buy more stuff, just relax: The glasses you're looking for are affordable enough to buy in quantity, durable enough to survive a party, and low-profile, meaning they're easy to stash on a high shelf until you need them again. Where can you find glasses that fit this description? Well, right here, of course! Here are six options you should buy right now.Chelsie CraigWe've said it before and we'll say it again: When it comes to durable, stackable, iconic glassware, Duralex is the reigning champ. These simple cafe glasses will never go out of style, and we'd love to see even your clumsiest friend try to break one.Buy It: Duralex 4⅝-oz. Picardie Clear Tumbler, $15 for 6 on Amazon.Chelsie CraigSleek, stackable, and easy to love, the Bormioli Rocco Bodgea Modern Red Wine Glasses feel about 100 percent fancier than any two-buck-a-pop glass should. Bonus: They're low-profile enough that they can do double duty as bowls for olives or ramekins for individual puddings.Buy It: Bormioli Rocco Bodega Modern Red Wine Glasses, $30 for 16 from Bed Bath & BeyondChelsie CraigSturdy, no-nonsense, restaurant supply store-chic. We're big fans of red wine that tastes like juice, so what better vessel to drink it out of than a sturdy little diner-style juice glass?Buy It: Libbey 5.5-oz. Heavy Base Juice Glass, $18 for 8 from Home Depot.Chelsie CraigLike the Libbey juice glasses above, but fashion. A bit taller, a bit more sophisticated, these are the glasses your cool aunt who sometimes bums you cigarettes after Thanksgiving dinner has in her loft.Buy It: 7-oz. Unie Tumblers, $18 for 6 from Bed Bath & BeyondChelsie CraigThe. Price. Is. Right. Daaaaamn, IKEA! Back at it again with the inexplicably-cheap version of the thing you can get for more-expensive elsewhere! These Chunky Bois may not have the same soigné as some of the above options, but if you need a lot of glasses, well, you know what to do.Buy It: Godis, $4 for 6 from IKEA.Chelsie CraigAt nearly 13-ounces, these simple stackable tumblers from Tar-Jay are bit bigger than the other options on this list—great if you're pouring more on-the-rocks cocktails and craft beer than wine.Buy It: Made By Design Stackable Short Tumblers, $11 for 6 from Target.And once you've got enough glasses, you're ready to upgrade your dinner party table...The (Affordable!) Platters, Bowls, and Utensils You Need to Host a Proper Dinner PartyBecause food served from a proper platter just tastes better.View StoryAll products featured on bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingCocktail PartyPartyGift Guidesholiday2018Read MorecookingThe (Affordable!) Platters, Bowls, and Utensils You Need to Host a Proper Dinner PartyBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-04", "author": ["Condé Nast", "Amiel Stanek"]}