{"id": "c7eb47240e38a7ff9f53a2fdfed3f4b2", "url": "https://www.bonappetit.com/story/marcus-samuelsson-gift-ideas", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "14 Gifts Chef Marcus Samuelsson Recommends in 2020 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertClose14 Gifts Chef Marcus Samuelsson Is Giving Everyone on His ListShoppingBA MarketMerch ShopMoreChevronStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopUnder $35Under $100 (And a Few Splurges!)CookbooksRestaurant MerchHealthyish FavesMarcus's PicksGift Guide 202014 Gifts Chef Marcus Samuelsson Is Giving Everyone on His List What our global brand ambassador is doling out this year.By Marcus Samuelsson, as told to Emma WartzmanNovember 17, 2020FacebookTwitterEmailPhoto by Laura Murray, prop styling by Sophie StrangioFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This holiday season, our global brand ambassador, Marcus Samuelsson, is sourcing most of his gifts closer to the home he’s lived in for 15 years: Harlem. Many of the folks who make these goods might live down the street or work in his nearby restaurant, Red Rooster. Another thing these craftspeople have in common: “They’re dream makers,” Samuelsson says. “They have worked so hard to create what they love in the community that they love, and I’m so proud to be able to broadcast it here.” From a conversation-starting sweatshirt sold at one of his favorite West Coast restaurants to the labor-of-love cookbooks, these are the gifts that really mean something to Samuelsson this year.Flamekeepers Hat Club Torch MB Burgundy“This hat comes from Marc Williamson, a young guy who takes a lot of pride in an old craft. He puts so much care into every hat, from the luxe material to the classic design. Each one is made by hand—and if you go into the Harlem shop, he’ll teach you about what he does. It feels like walking into a record store and talking to the people who work there. You learn as you’re shopping.”Photo by Jess PettwayFlamekeepers Hat Club Torch MB Dlux Burgundy$150 at Flamekeepers Hat ClubSerengeti Ethiopian Black Tea Blend“Ethiopia is known for coffee, but tea has been there just as long. Doughba Hamilton Caranda-Martin III, the founder of Serengeti, is so knowledgeable about tea, and I’ve been lucky to be able to be around that knowledge (he lives down the street from me). This particular blend has spices without being spicy—it’s got cinnamon, cardamom, cloves.”Serengeti Ethiopian Black Tea Blend$18 at Serengeti Teas & SpicesChitlins Sweatshirt“This is a sweatshirt that creates conversation. I’ve walked down the street wearing it, and older African American women will look at me and be like, ‘What?! You put the word chitlins on a sweatshirt!’ Or someone younger will say, ‘Oh, man, that’s dope.’ I love that interaction. Plus, wearing it makes me feel connected to JuneBaby, which is an amazing Southern-inspired restaurant from chef Edouardo Jordan in Seattle.”Photo by Jess PettwayChitlins Sweatshirt$85 at JuneBabyLemongrass and Lime, by Leah Cohen With Stephanie Banyas“The flavors in this book are just absolutely incredible. Leah is the chef behind Pig & Khao in New York City, and she makes food that is bright, vibrant, and exceptionally delicious. These are dishes you’ll never get tired of cooking and eating—especially the grilled cod in banana leaf.”“Lemongrass and Lime”$24 at Amazon$32 at BookshopThe Spice House Berbere Jar“When I smell berbere, I smell Ethiopia. It’s our salt and pepper; it’s good sprinkled on top of everything. This particular one seems spicier than it is—kind of close to a smoked paprika but much more layered. My favorite way to use berbere is in the legendary Ethiopian chicken stew called doro wat. Cooking down berbere slowly with onions and butter really builds the foundation of the dish. I also love to toss it with carrots before I roast them, or sprinkle a simple melon salad to add a touch of spice.”Photo by Jess PettwayThe Spice House Berbere$7 at The Spice HouseThe Barbuto Cookbook, by Jonathan Waxman“Jonathan has been one of my favorite chefs for almost as long as I have been cooking. This cookbook demystifies many of the signature dishes at Barbuto, his beloved New York City restaurant, and teaches home cooks how to do what he does best: treating ingredients simply (and with the utmost respect) to coax out the most flavor.”“The Barbuto Cookbook”$28 at Amazon$37 at BookshopDanyaki iDeation Aprons“My friend Hass Kwame makes these colorful hand-painted aprons. When he was a server at Rooster, it was always his goal to run his own business. Now we can support him and his dream by purchasing his durable, stylish aprons. If we have a guest chef, this is the apron we give. It’s from us. It’s of us. It’s our postcard.”Photo by Jess PettwayDanyaki iDeation Aprons$90 at Danyaki iDeation ApronsThe Nom Wah Cookbook, by Wilson Tang With Joshua David Stein“Nom Wah is one of the most legendary dining establishments in New York City. Having been open for more than 100 years, this restaurant has seen Chinatown change and evolve in spectacular ways. However, owner Wilson Tang doesn’t get lost in the past. Instead, he uses this moment to celebrate the Chinatown of now, sharing profiles and recipes that celebrate today.”“The Nom Wah Cookbook”$27 at Amazon$32 at BookshopMafi Mafi Tibeb Set“In Ethiopia, it’s cold at night and cold in the morning, with wind from the mountains. People always wear scarves. These are inspired by traditional Ethiopian patterns and handloomed in there.”Photo by Jess PettwayMafi Mafi Tibeb Set$150 at Mafi MafiIn Pursuit of Flavor, by Edna Lewis“Edna Lewis is one of the most important American cooks. Throughout her seminal cookbook, she tells stories from her childhood in rural Virginia and how that upbringing influenced her views on food and cooking. With her, it’s less about the individual recipes and more about the entire ethos of her cooking—she reminds cooks to celebrate the bounty that is around them.”“In Pursuit of Flavor”$22 at Amazon$28 at BookshopKristen Kish Cooking, by Kristen Kish“Kristen is one of the most supremely-gifted, technique-driven chefs I know. Her talent comes through in all the recipes, like the dead-of-winter vegetable rosti with saffron aioli (a personal favorite!). In this book, she shares her knowledge with folks at home, and for that we definitely owe her one.”“Kristen Kish Cooking”$23 at Amazon$40 at BookshopHarlem Candle Company Candle“Teri Johnson, the founder of Harlem Candle Company, has so much local pride and her candles represent that. The way the jasmine interacts with the mandarin notes in this candle—it just smells so good. Also, the design speaks to Harlem. That’s why I really love them.”A Night Club Map of Harlem Candle$60 at Harlem Candle CompanyParwana, by Durkhanai Ayubi“Parwana is one of the most beautiful books I’ve ever laid my eyes on. Durkhanai Ayubi combines gorgeous photography, personal narratives, and mouthwatering recipes to tell a complete story of what Afghan food means to her and her family.”“Parwana”$32 at Amazon$32 at BookshopHarlem American T-Shirt“When I walk down the street in Harlem, I see everyone wearing this stuff. Kids, adults, teenagers—they all rep this classic, comfortable clothing brand. It’s an iconic look of the neighborhood. It reminds me that I’m home.”Harlem American Classic T-Shirt$65 at Harlem AmericanExplore Bon AppétitGift GuidesShoppingChefsHoliday 2020Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-16", "author": ["Condé Nast", "Marcus Samuelsson", "As Told To Emma Wartzman"]}