{"id": "c7f5c2a6353b3fb46ec423ad77fabdf1", "url": "https://www.bonappetit.com/story/bulk-up-instant-noodles", "year": 2020.0, "month": 7.0, "day": 2.0, "content": "6 Instant Ramen Noodle Recipes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking6 Delicious Ways to Bulk Up Instant NoodlesSave that flavor packet for another day.By Hetty McKinnonJuly 10, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Sarah JampelFacebookTwitterEmailIn Basically on a Budget, we'll talk tips, ingredients, and recipes that'll help you save money and eat well.To many, instant noodles are budget food, the backup pantry item that steps up when you are short on money, time, or both. But to me, instant noodles also represent indulgence, pleasure, and thrill.The ritual of instant noodles runs deep in my veins. Growing up in a Cantonese household, instant noodles were a daily staple—when we came home from school, we would snatch a packet from the box of ma ma mian on top of the fridge for a quick snack to satiate our teenage hunger until dinnertime. When I was in high school, it was one of the only foods I knew how to cook. The times we ate instant noodles as a full meal for lunch, my mother would often add some \"fancier\" fixings to make the dish feel more special—she loaded them with ample greens, most often iceberg lettuce or bok choy, shiitake mushrooms, Spam, and sesame oil.With current times dictating that we cook at home, relying on pantry staples and keeping a sharp eye on our finances, instant noodles have returned as the ultimate frugal feel-good food. And ditching the high-sodium (though admittedly extremely delicious) sachet opens up a world of breakfast, lunch, and dinner possibilities. With some help from fridge and pantry standbys like leftover vegetables, eggs, kimchi, miso, tahini, and peanut butter, instant noodles can easily become a full-bodied main meal.Here are my favorite ways to do just that:Takeout noodlesWho doesn’t love cold sesame or peanut butter noodles? Instant noodles are perfect for this dish, as their squiggly texture perfectly clings to the sauce. They’re also very simple to make: Thin out tahini or peanut better with water, add a small clove of chopped garlic, and season with salt and pepper. Whisk everything together and drop your cooked noodles straight in, tossing to coat the noodles in the nutty sauce. Add some sliced cucumber, top with scallions, and drizzle with chili oil.Carbonara instant noodlesI love the way the cheesy egginess of carbonara sauce sticks to the curly noodles. While making carbonara can often feel technical, I try not to overthink the steps here. This works best with two packets of instant noodles. Whisk together 1 egg, a few tablespoons of grated parmesan or pecorino, and lots of black pepper. Once the noodles are cooked, keep a little of the cooking water, and then drain. Add the hot noodles gradually, in 2-3 batches (so you don’t scramble the eggs), to the eggy mixture, tossing as you go. Drizzle in a small amount of the cooking water and then toss well with tongs. The heat from the noodles will cook the egg, melt the cheese, and create an unctuous sauce. Top with more cheese and black pepper.Spicy kimchi noodlesIf you always have kimchi in your fridge like I do, making a bowl of spicy noodle soup is a cinch. Heat up some vegetable stock, drop in a couple heaped tablespoons of kimchi (both the liquid and the solids) and cook for a few minutes—the kimchi will mingle with the stock, creating a spicy broth. Season accordingly with salt and pepper, and top with items from your pantry, such as leftover tofu (pan-fried or silken both work) or roasted vegetables, scallions, sesame seeds, and more kimchi. A drizzle of sesame oil doesn’t hurt either.Big skillet fry-upThis is a super fun way to create an entire meal in one pan. Rather than pre-cooking the noodles, I soak them in boiling water for 2 minutes and then drain. In a skillet, add a drizzle of oil, along with a few handfuls of veggies, some sliced onion or shallot, and once these soften, the noodles. Fry undisturbed for a couple of minutes, to allow the bottom to crisp up. The last step is to crack an egg or two into noodles, cover and allow the whites to firm up. Season well with salt, pepper, and dollop with some chile crisp or chile oil. While you could use any noodles for this dish, somehow, the wavy texture of instant noodles just creates the perfect contrast of crispiness to softness.Miso noodle brothMiso is always a great source of umami to have in the fridge, and here, you can use it to make a quick broth. Bring 1 quart of water to the boil and then add 1-2 tablespoons of miso until you have a flavorsome savory broth. Add the noodles and when they are almost cooked, add some tofu, leafy greens, a lot of scallions and, if you have it, top with nori sheets.Thai coconut curry noodlesTwo things I often have in my fridge are a half-can of coconut milk and a half-used jar of Thai curry paste. If you combine the two, you’ll have a quick and easy Thai curry broth for your cooked noodles. Top with veggies, tofu, and scallions.Hetty McKinnon is a cookbook author, food writer, and creator of Peddler Journal. Her newest book is Family: New Vegetarian Comfort Food to Nourish Every Day.Explore Bon AppétitBasically on a BudgetRamenNoodleBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-10", "author": ["Condé Nast", "Hetty Mckinnon"]}