{"id": "c7fae2d3b999fc042e6c68016ac8c374", "url": "https://www.bonappetit.com/story/puff-pastry-appetizers", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "Frozen Puff Pastry Is an Appetizer Waiting to Happen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFrozen Puff Pastry Is an Appetizer Waiting to HappenYou’re one frozen box away from a party.By Kendra VaculinOctober 14, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailIn my mom’s rotation of party appetizers, nothing was more beloved than her pastry-wrapped Brie. Maybe you have eaten a version of this dish yourself: It’s a whole round of cheese topped with a slick of something sweet (she used apricot jam) and encased in a blanket of puff pastry, objectively an ideal combination of things. The baked result was a shiny, golden-brown stunner that oozed molten cheese and hot preserves when you cut into it, begging to be scooped up and spread on tiny toasts. It was sweet, salty, creamy, and crispy—perfect, really, and it never lasted long. Which was fine by her, because with the help of frozen puff pastry, it took almost no time to make.If you’ve ever seen a single episode of The Great British Baking Show, you know that homemade puff pastry is notoriously tricky. The process is technical and time-consuming, with plenty of opportunities baked in for you to screw things up. So the frozen version, from brands like Dufour or Pepperidge Farms, is an attractive substitute, and one that doesn’t compromise on workability or flavor. As long as you remember to defrost them in the fridge overnight, the premade sheets are ready to use straight from the box and bake up reliably every time—crispy, buttery, flaky, and perfect. And if you’ve got a package of the frozen stuff on deck, the world is your appetizer oyster.I say “appetizer” because, while frozen puff pastry is definitely a fast track to all sorts of hearty mains (hello skillet pot pie) and decadent desserts (this apricot and almond galette), Starters-ville is truly where this ingredient shines, a land of snacky few-bite bits that practically beg to be wrapped in pastry. Whether you’re throwing something together for last-minute dinner guests or just having an apps-for-dinner night at home, a box of puff pastry can easily become cheesy hand pies, a spinach and feta tart soleil, crispy ham and cheese squares, or crunchy cheese twists.(Puff pastry goes extremely well with cheese, if that wasn’t clear.) You can roll a sheet out to act as the base for savory palmiers, spinach puffs, and tarts of all kinds: tomato, leek, butternut squash, carrot, artichoke, and even one made to taste like a deconstructed samosa. Rolled, folded, stuffed, or topped, puff pastry is the versatile workhorse that deserves an invite to every party.I would even go so far as to say that if you have a box of frozen puff pastry, you can have a party, no other information needed. The formal recipes are fun, but you can also scour your fridge and pantry for additional ingredients and turn out food that looks like you planned it, thanks to the very professional level of flakiness achieved with a package of Dufour (my personal fave brand). Spread the last of a jam jar across a sheet, roll it up, and slice it before topping with a little demerara sugar and baking: voilà, jammy pinwheels that could have come from a fancy bakery. Stuff triangles of the dough with sliced sandwich ham, or pickles, or thawed frozen spinach, or pesto, or anything, and CHEESE, always CHEESE, crimp the edges with a fork to seal and there you have it: perfect little personal, crowd-pleasing pies. So, as a gift to your future self, stick a pack or two of frozen puff pastry in the freezer. I promise you, even if all you do is wrap it around a wheel of Brie, you’ll never regret it.Not just a puff piece:Samosa Tart With Caramelized Onions and FontinaWhen you're not up for deep frying, bake a samosa's spiced potato filling into a buttery, flaky bed of puff pastry instead.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-14", "author": ["Condé Nast", "Kendra Vaculin"]}