{"id": "c7fccb970110cddc782379edeee809b1", "url": "https://www.bonappetit.com/recipe/vanilla-cake", "year": 2021.0, "month": 3.0, "day": 5.0, "content": "Vanilla Cake With Vanilla Cream Cheese Frosting Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNo-Mixer Vanilla Cake With Tangy Cream Cheese FrostingExtremely plush, fine-crumbed, and dare-we-say moist, this is like the best wedding cake—and you mix it entirely by hand.By Sarah JampelMarch 29, 20214.8(47)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintThis vanilla cake doesn’t skimp on the butter, sugar, or eggs—and that’s part of what makes it so delicious. The other big part is the “dissolved sugar method,” a technique that comes from Shirley Corriher’s brilliant baking book, Bakewise. The sugar is dissolved with hot liquid (in this case, that’s milk), which makes for a fine-crumbed, extremely plush cake. It also means you don’t need any sort of electric mixer or special equipment to make it. For the best texture (and to prevent sinking), you really do have to buy cake flour for this recipe. It’s also best to measure the flour by weight, using a scale. If that’s not an option, use a light hand and spoon it into your measuring cup, then use a knife to level off. Even if you’re having only a small celebration (often the case these days), this cake keeps well in the fridge for several days. You can also easily halve the recipe—just use 3 large egg yolks and 2 large eggs and halve everything else. The fruit powder, while optional, adds a bright tartness to the frosting. If you can’t find freeze-dried raspberry or strawberry powder, you can buy freeze-dried fruit and grind about ⅓ cup (10 g) in a food processor or spice mill for the amount of powder you’ll need for this recipe. Jam would also make a good substitute!All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRound Cake Pan$12.99 At AmazonParchment Paper$3 At AmazonMedium Bowl$17 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketWhisk$10 At AmazonParing Knife$10 At AmazonSmall Saucepan$155 At AmazonLarge Bowl$18 At AmazonCake Tester$3 At AmazonWire Rack$23 At BA MarketSpatula$12.99 At AmazonMesh Sieve$13 At AmazonSmall Bowl$13 At AmazonIngredients10–12 servingsCakeNonstick vegetable oil spray or room-temperature unsalted butter (for pans)8large eggs, room temperature2¾cups (316 g) cake flour (preferably King Arthur Unbleached Cake Flour)2¼tsp. baking powder½cup (1 stick) unsalted butter, room temperature2¼cups (450 g) granulated sugar½cup whole milk1Tbsp. vanilla bean paste or vanilla extract2¾tsp. Diamond Crystal or 1 tsp. Morton kosher salt½cup vegetable oil¾cup sour creamFrosting28-oz. packages cream cheese, room temperature½cup (1 stick) unsalted butter, room temperature2Tbsp. (or more) sour cream1tsp. vanilla bean paste or vanilla extract¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more1½cups (165 g) powdered sugar2Tbsp. (10 g) freeze-dried raspberry or strawberry powder (optional)PreparationStep 1A little advance planning: Your butter, cream cheese, and eggs must be at room temperature before you make the cake and the frosting. The butter and cream cheese should be soft enough that you can easily squish them with your fingers, but not so soft that they’re greasy or starting to melt. If you have a cool kitchen and plan to bake the cake in the evening, set them out on the counter in the morning; if you plan to bake the cake in the morning, set them out the night before. To speed up the process, cut them into tablespoon-size pieces. And if you need to bring your eggs to room temperature quickly, place them in a medium bowl (a quart container also works) when you go to heat your oven and fill the bowl with hot tap water. They should be good to go by the time you are ready for them.Step 2Place racks in upper and lower thirds of oven; preheat to 350°. Lightly coat two 9\"-diameter cake pans with nonstick vegetable oil spray or butter generously. Line bottoms with parchment paper rounds and lightly coat with nonstick spray or butter. Whisk 2¾ cups (316 g) cake flour and 2¼ tsp. baking powder in another medium bowl.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Cut ½ cup (1 stick) room-temperature unsalted butter into tablespoon-size pieces. Place 2¼ cups (450 g) granulated sugar in a large bowl. Heat ½ cup whole milk in a small saucepan over medium until just about to simmer, about 1 minute. (Or, heat in a microwave-safe bowl in a microwave in 30-second increments.) Pour over sugar and whisk vigorously until sugar is dissolved, about 1 minute. Immediately add butter and whisk vigorously until incorporated, about 1 minute. (Go for a full minute when whisking the sugar and the butter if in doubt.) Whisk in 1 Tbsp. vanilla bean paste or vanilla extract and 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt. Arrange a damp kitchen towel underneath bowl in a hollow ring to stabilize it, then gradually stream in ½ cup vegetable oil, whisking constantly until emulsified with no oily spots remaining.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Add dry ingredients in 3 additions, whisking after each just until no dry spots remain before adding the next. Batter will be thick.Step 5Working one at a time, crack 5 large eggs into your hand or a mesh sieve set over a small bowl and let eggs whites collect in bowl; add yolks to batter one at a time, whisking until completely incorporated after each addition. (Save eggs whites for another use.) Add remaining 3 large eggs to batter one at a time, whisking until completely incorporated before adding the next. Whisk in ¾ cup sour cream; batter will be smooth and glossy.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Divide batter between prepared pans. (If you’re a perfectionist, weigh your batter, divide by two, then measure that amount into each pan—you’ll likely want about 750 g in each.)Step 7Bake cakes, rotating pans top to bottom halfway through, until golden and a tester inserted into the center comes out clean, 40–50 minutes. Transfer pans to parchment-lined wire racks and let cakes cool in pans 10 minutes. Turn out cakes onto racks, peel away parchment paper rounds, and turn right side up. Let cool completely. (The parchment on the racks will prevent the moist cake from sinking into the racks.)Step 8Wrap cooled cakes tightly in plastic and chill in the fridge at least 1 hour or in the freezer at least 20 minutes (this will make them easier to frost because the frosting won't pick up as many crumbs).Step 9Meanwhile, make the frosting. Using a rubber spatula, smash together two 8-oz. packages room-temperature cream cheese and remaining ½ cup (1 stick) room-temperature unsalted butter in a clean large bowl until homogenous, smooth, and fluffy (don’t be afraid to be aggressive). Stir in ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt, remaining 2 Tbsp. sour cream, and remaining 1 tsp. vanilla bean paste or vanilla extract. Using a fine-mesh sieve, sift in 1½ cups (165 g) powdered sugar. (It is important to sift here, otherwise, you’ll end up with clumps.) Stir until smooth, then taste and add more sour cream or salt if needed. (You should have about 3 cups frosting.)Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 10If you want to make a fruity filling, scoop about 1 cup frosting into a small bowl. Sift in 2 Tbsp. (10 g) freeze-dried raspberry or strawberry powder and stir until no lumps remain.Step 11To frost the cakes: Place 4 long strips of parchment paper along edges of plate to make a large, hollow square, then place a cake layer on top. You’ll be able to shimmy these out from under the cake, leaving a clean, frosting-free plate behind. Scoop fruit frosting (or about 1 cup plain frosting) on top of cake and spread into an even layer with rubber spatula. Place second cake layer over. Scoop another 1 cup frosting on top and spread evenly over cake surface. Frost sides of cake, as well as top as needed, with remaining frosting. You can use a thin butter knife to fill in any gaps or bare spots. Run knife along the top of the cake to create a subtle ridge pattern or swirls as desired. Remove parchment strips.→  Domed layers? No spatula? Get our stacking and decorating tips here.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 12This cake has the best texture at room temperature—tent it with foil or plastic and leave on the counter 1–2 hours before serving. It will also tastes great straight from the fridge if you make it ahead.Do ahead: Cakes can be baked 2 days ahead; keep chilled, or freeze, up to 2 weeks. If frozen, let thaw overnight in the fridge. Frosting can be made 5 days ahead; cover and chill. Bring to room temperature, then whisk or stir with a rubber spatula to lighten before using. Cake can be assembled 5 days ahead; wrap and chill.How would you rate No-Mixer Vanilla Cake With Tangy Cream Cheese Frosting?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangle@Sarah, how can this be made into a sheet cake?Joan5/14/2021I followed the recipe exactly and it turned out really well!  Dare I say, a little sweet though? :) I might cut back on the sugar in the milk mixture next time.  Also, the frosting still  had a few tiny lumpy butter bits despite a lot of hand mixing, so I would do that in a mixer next time. Overall, the raspberry powder and cream cheese frosting filling was delicious and the cake was super moist.  Rob T. Seattle, WA4/26/2021Yes, I agree the cake looks delicious, and I will make it, but use a butter cream icing. I agree with Bruce that the frosting ingredients should be listed separately. I have to \"sift\" through the recipe to back out the frosting ingredients.DMilwaukee, Wisconsin4/15/2021Could cocoa powder be added to make this a non -red dye red velvet cake if some baking soda were added, would the sour cream act as a substitute for buttermilk?tsalpharetta ga4/15/2021It would be much better if you followed the well-established convention of listing the cake and frosting ingredients separately, since some people probably want to use a different frosting.BruceOhio4/14/2021I made this cake for my dad's birthday and it was a huge hit. It was really simple. I was feeling a little lazy, I used my mixer and it still came out great. I added jam for the middle frosting and was accidentally a little heavy handed, so that frosting got a little too thin, but still tasty!KatieSacramento, CA4/14/2021I’m excited to try this recipe! It sounds like this method of dissolving the sugar in the milk results in a delightful crumb. But I do have the same question as Rob below: is there a reason the eggs are added after the flour? It seems like there might be a risk of overdeveloping the gluten this way. I was considering doing a test run, making a half recipe as directed and a half recipe whisking in the eggs before the flour. But then I figured, hey, can’t hurt to ask the question!StephaniePittsburgh4/12/2021I really enjoyed the cake, and it’s relatively easy to make, although it is a good arm workout, however, the method for the icing did not work for me at all, I was just left with lumps of butter no matter how vigorously I mixed. This meant that the icing was runny and so I couldn’t spread down the sides at all. I would definitely make the cake again but would probably use a mixer and the usual method for the icing. HannahEngland4/11/2021We double checked measurements and still ended up with a very thin batter, nothing like the thick batter in photo #4. The end product was pretty much a disaster. I'm curious if others have had this problem. AnonymousSeattle, WA4/5/2021Looks delicious! Can this recipe be made with gluten free flour? I have Celiac’sAnonymous4/4/2021I'm fairly sure this will translate easily to a 9x13 rectangle pan? I only have one 9in round and want something just a little less fussy for a last minute Easter dinner tomorrow...AmyOklahoma4/3/2021i made a half batch of this cake and baked it in a 10x10 square pan (baked in ~40 min), frosted it all over, and used a Godzilla stencil and a dusting freeze dried raspberry powder to give it a Godzilla silhouette on top. it was a huge hit! my boyfriend said the cake texture was perfect and i couldn't agree more. it's moist, tender, smooth. very fun to decorate creatively!annaliseLos Angeles, CA4/2/2021@Anne, Yes you can CERTAINLY make these into cupcakes. Start checking them around 12 or 13 minutes—I don't think they'd need more than 15–17 in a 350° oven.\n\n@Anonymous in Vancouver, I haven't done the math, but yes, you can convert it to a 6\" cake pan. Google \"Epicurious 6\" cake pan\" and you'll find an extensive article about how to do the conversions. Hope that helps!Sarah Jampel4/1/2021Really tasty cake. Mine still domed just a little but I just had to cut a little bit to level it. I used lemon curd in the middle instead of the strawberry powder and added a little almond extract into the frosting and it was really good. The cake is very vanilla forward and almost tastes like a freshly made waffle cone.Holly St. Louis4/1/2021This looks so deliciousAB3/31/2021Explore Bon AppétitCakeDessertVanillaHerbs & SpicesCream CheeseCheeseRaspberryBerryFruitCake FlourFlourEasyBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-28", "author": ["Condé Nast", "Sarah Jampel"]}