{"id": "c80aa8f60bdc46f1c82edb754442df4a", "url": "https://www.bonappetit.com/story/homemade-salad-dressing-is-better-than-bottled", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "This Is the Summer You Start Making Homemade Salad Dressing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is the Summer You Start Making Homemade Salad Dressing\"But it's never as good as the bottled stuff,\" you say? We're here to help.By Alex DelanyMay 17, 2018FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailI grew up in a bottled salad dressing household. There were brief periods of my life when oil and vinegar would be placed on the table—a nod to health or culture or maybe something else I was missing entirely—but for the most part, when there was salad, there was also a bottle with Paul Newman’s face on it riding shotgun. But these days, I don’t buy bottled salad dressing at all. This isn’t me rebelling against the way my parents raised me. (Love you Mom. Love you Dad.) It’s because making salad dressing at home is 100% better. It’s healthier, more affordable, and more personal. But most importantly, homemade dressing tastes better.Well, mine tastes better now. That was definitely not the case when I first started. The first time I made dressing at home, it was a bland, oily shadow of the stuff I grew up pouring out of the bottle. It was discouraging. I found myself thinking, This is nowhere close to the flavor bomb that comes from the bottle. This kind of sucks. Why does my dressing taste like...nothing? Am I missing something? Should I retire from my brief home cooking career before I embarrass myself even further?And a lot of people feel the same way when it comes to homemade dressing. That's understandable! But I’d like to say that I decided not to retire. I decided to keep making salad dressing. And I’m glad I did, because now I can tell you a few things about why yours might not taste as good as its bottled cousin—and how it can.First things first: Bottled salad dressing has a ton of sugar and salt in it. It’s actually kind of obscene. But that’s why it tastes so good. (Or at least so...much.) Dressing is supposed to season every piece of the salad, so it needs to be concentrated. And that’s the number one mistake people make when making dressing at home. They under-salt and under-sweeten. The day my dressings became great was the day I decided to up the salt and sugar that I mixed into them. Always taste your dressing and add more seasoning, if you need it. It should always taste a smidge too salty and a smidge too sweet, which is okay, because its a sauce—you aren't eating it by the spoonful (hopefully). And if you're worried, even when you get it to that totally delicious place, it will still probably have a lot less salt and sugar than the bottled stuff.Also, you should be dressing a salad with your hands.\nThe other challenge facing amateur dressing makers is consistency. I don’t mean being consistent. I mean the way the dressing feels, texturally. There’s something magical that happens in the bottle that makes the dressing creamy. (Read: weird additives probably.) It makes it seem like it’s not just oil and vinegar hanging out, but rather  one cohesive, brilliant new thing.You can get that texture at home though, sans weird stuff. One way to achieve this is to create a proper emulsion, the way you would if you were making homemade mayonnaise, aioli, or a proper Caesar dressing—more on that here—which involves whisking oil drop-by-drop into vinegar or lemon juice that's been mixed with raw egg yolk. That's kind of the 2.0 option, but will give you an unforgettably rich, creamy dressing. The much easier option, though, is to whisk in something that will simply thicken the ol' oil-and-vinegar-and-whatever-aromatics-you've-got dressing you're already working with. A spoonful of store-bought mayo, good Dijon mustard, Greek yogurt, or tahini will go a long way to creating the silky, lettuce-coating dressing of your dreams. All that said, even if you're just working with a bare-bones, well-seasoned oil and vinegar mixture, giving it a vigorous whisk or shake in a jar right before you dress your salad will give you dressing that at least disperses through a salad evenly.That's how you add the oil slowly. See, easy.\nOnce you have the seasoning and consistency down, and you’ve made a dressing or seven, you should be starting to realize why homemade is the road worth traveling down. The flavor combinations are totally up to you. You can add and tweak ingredients in recipes to align with your taste preferences. You don’t have to go buy another bottle of dressing if you want to change it up. You can just tweak your own house recipe using ingredients you already have. Which means that homemade dressing is actually cheaper. All that stuff in your cabinet can be used in salad dressing. Neat! Rad! Awesome!But the real flex that homemade dressing provides comes when you cook for others. It's impressive. Homemade dressing over-delivers. It’s actually quite easy to assemble and makes you look like a professional. Your bottled dressing friends will be amazed when you casually drop the, “Oh, I made that dressing,” in response to Jeremy’s declaration that whatever dressing is on the BLT salad is “bonkers good.” Your friends will see you in a new, well-seasoned, texturally-supreme light.Here's a good place to start:Chopped Dinner Salad with Crispy ChickpeasExactly what you want when dinner NEEDS to be salad, and salad NEEDS to be dinner.View RecipeExplore Bon AppétitBasicallySalad DressingSaladRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-17", "author": ["Condé Nast", "Alex Delany"]}