{"id": "c80e01c55ed3a1be7e3ae52fdd52aac2", "url": "https://www.bonappetit.com/recipe/little-gem-wedge-salad-with-tahini-ranch", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Little Gem Wedge Salad with Tahini Ranch Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueLittle Gem Wedge Salad with Tahini RanchBy Andy BaraghaniMarch 20, 20184.9(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintPhilosophical question: Is it still a wedge if it isn’t smothered in blue cheese and bacon? It’s debatable, but we do know that this is a healthyish wedge salad recipe we’d happily make every day. It’s got the rich part—a creamy tahini dressing that’s so thick it anchors the greens. It’s got the crunchy stuff—seeds and coarse salt. And it’s got freshness—actual lettuce and herbs. Iceberg who?Ingredients4 servings 1small garlic clove, finely grated1cup plain whole-milk Greek yogurt3Tbsp. tahini2Tbsp. fresh lemon juice1Tbsp. extra-virgin olive oil, plus more for drizzlingKosher salt, freshly ground pepper4heads of Little Gem lettuce, halved lengthwise, or 2 heads of romaine, quartered lengthwise3Tbsp. white wine vinegar1½cups torn mixed tender herbs (such as basil, dill, tarragon and/or parsley)¼cup mixed toasted seeds (such as sesame, poppy, hemp, and/or sunflower)¼cup sliced chivesAleppo-style pepperFlaky sea saltPreparationStep 1Whisk garlic, yogurt, tahini, lemon juice, and 1 Tbsp. oil in a medium bowl until incorporated and smooth. Season dressing with kosher salt and lots of black pepper (it should look speckled).Step 2Toss lettuce and vinegar in a large bowl; season with kosher salt. Add mixed herbs and give it all another toss.Step 3Spread dressing over plates and top with salad. Sprinkle with seeds, chives, Aleppo-style pepper, and sea salt and drizzle with a little oil.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Little Gem Wedge Salad with Tahini Ranch?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleOutstandingly flavourful! The herbs, the seeds, the dressing, thank you! AnonymousJersey city 11/28/2020Absolutely OBSESSED with this salad.  Started making it during quarantine and have made it at least 11 times since - always a hit!  I follow the directions (and strongly advise that you do), I just go a bit heavier on the tahini (as I love it), add some lemon zest and a touch more lemon than it calls for, and go slightly lighter on the white wine vinegar.   I advise doing a mixture of herbs (I love using Parsley & Basil) and for the seeds - black sesame, regular sesame, flax, everything bagel seasoning, & even some crisped quinoa.  AMAZINGGGGG.Anonymousbrooklyn, ny10/30/2020I love this is a delicious twist on a classic.   Fresh, garlicky, and yummy. lgwmooKensington, MD5/4/2020I just made the dressing, with some slight modifications for a different salad, and it was lovely! I added a little bit of extra tahini, and I replaced the chives with green onions, and I used cilantro in place of the other herbs, because that was all I had. I mixed the herbs directly into the dressing, and it was quite thick, so I added quite a bit of water to thin it out (almost half a cup). I added what I thought was an adequate amount of salt, but when I tasted it, it wasn’t quite right, so I added way more salt than I typically do for other vinaigrettes, and it was perfect! So if you don’t have a problem with salt, don’t be afraid to add more than you think you should!Ellen LittleCharlotte, NC, USA11/13/2019could legit eat a bathtub full of this salad! Unreal how good this is. Aleppo pepper dayuummmmm. I did poppy, sesame and toasted pepitas and it's killer. kmarxmarxchicago4/10/2018I actually just used 4oz. yogurt, 2 TBLS tahini 1 clove garlic, 1/2 lemon juice, and a pinch or so of the herbs. Mixed and let it chill. In a bowl I put some left over chicken breast, chopped red delicious apple, chopped in 3rds a few sweet pea pods. S&P. Kind of like a tahini  chicken salad.\nYum!!AnonymousConcord, NC3/31/2018Explore Bon AppétitSaladLettuceLeafy GreensVegetableTahiniCondiments, Sauces & PastesQuickEasyWeeknight MealsSideVegetarianGluten-FreeKetoHealthyishHanukkahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Andy Baraghani"]}