{"id": "c81362b0071140512bd29576c31e3a20", "url": "https://www.bonappetit.com/story/beef-sliders-balsamic-onions", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "These Beef Sliders Are Filling Enough for a Meal (But Cute Enough for a Party) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Beef Sliders Are Filling Enough for a Meal (But Cute Enough for a Party)Tiny burgers means you can eat more burgers.By Alyse WhitneyMay 1, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiFacebookTwitterEmailBite-sized foods can be a mixed bag. I’m all for pigs in a blanket and other one-bite appetizers, but you have to be able to eat enough of those little snacks to fill up. At parties with passed hors d'oeuvres, that’s often not the case—unless you beef up your appetizer game. And our new recipe for sliders with provolone and balsamic onions does that perfectly.I made these little burgers for a solo dinner, because my story was due and I wasn’t about to host a slider party on a Thursday night. Each patty should be about 4 oz. (¼ lbs.) so it fits onto a squishy Martin’s potato dinner roll. They’re chubby little beef sliders that stand at ¾\" high before cooking; you should barely press the meat together so they don’t toughen up. And then the cheese: Try to find sharp provolone cheese at the deli counter or Italian market and shred it to make a mound of cheese on top of each slider. Provolone has a salty bite that cheddar or American just don’t have, melts well, and pairs better with the balsamic-pickled onions for this Italian twist on beef sliders.Juicy Lucy SlidersMagical mini versions of Juicy Lucys, cheese-filled burgers that hail from Minnesota.View RecipeI love burgers, but let’s focus on the game-changing part of this recipe: BALSAMIC ONIONS. When I read the recipe title, I thought they’d be caramelized onions with balsamic vinegar, which scared me because I always burn my caramelized onions. Fortunately, it was one thinly-sliced red onion mixed with 3 Tbsp. balsamic, 1 tsp. sugar, and a pinch of salt. You let them sit for a few minutes without cooking, and they soften and become more mellow than standard pickled onions. I piled them high on top of the sliders and slid it into a toasted, mayonnaise-slicked roll. Two will do you for a full meal with a grain salad on the side, or if you’re feeling less authentically Italian (like I was that night), boxed mac and cheese. Choose your own slider adventure.Get the recipe:Beef Sliders with Provolone and Balsamic OnionsRed onions soften in balsamic vinegar and add a burst of sweet flavor to these cheesy-wonderful beef sliders.View Recipe--Oh look, another burger!Explore Bon AppétitBurgersSlidersRead MorecultureHow to Drink and Snack Like an Italian on VacationBy Amiel StanekcookingMake Malfatti: Fluffy Ricotta Dumplings That Are So Much Easier Than GnocchiBy Alex BeggsrecipesOur Favorite Burger Recipes from Classic to \"Crunchified\"Gallery17 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-01", "author": ["Condé Nast", "Alyse Whitney"]}