{"id": "c81bdce9ece95cdfae6b5fd39250a63d", "url": "https://www.bonappetit.com/recipe/bas-best-guacamole", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "BA's Best Guacamole Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2016 IssueBA's Best GuacamoleBy Rick MartinezPhotography by Alex LauSeptember 7, 20214.3(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintYou’ll never hear us turn down freshly-made guacamole with crispy, crunchy tortilla chips. This easy guacamole recipe is a classic that’s best made in a Mexican mortar and pestle called a molcajete, but a bowl and a potato masher or fork works fine as well. Just don’t rush to get this recipe on the table too quickly. It takes a while for the avocado to absorb all the flavors you add to it. So if you ever find yourself wondering if your guac is spicy (or salty, or lime-y) enough, wait a few minutes before you add more so that you don’t accidentally overseason it.If you’re serving it as a dip, try it alongside a bowl of roasted and lightly chunky homemade salsa, pico de gallo when tomatoes are in season, or salsa verde, all of which will add an acidic punch to the spread.Editor’s note: This recipe was originally published on October 4, 2016.IngredientsMakes about 3 cups3large ripe Hass avocados¼white onion, finely chopped1serrano chile, seeds removed if desired, finely chopped1garlic clove, finely grated2tablespoons (or more) fresh lime juice1teaspoon kosher salt¼cup chopped cilantro, plus more for servingToasted pepitas (pumpkin seeds; optional) and chips (for serving)PreparationSmash avocados with a potato masher or fork in a medium bowl or with a molcajete (a Mexican mortar and pestle) until very coarsely mashed. Mix in onion, chile, garlic, lime juice, salt, and ¼ cup cilantro. Taste and add more lime juice, if desired. Top with pepitas (if using) and more cilantro; serve with chips alongside.How would you rate BA's Best Guacamole?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleSimple and so good! Whenever I make this for parties, everyone asks \"who made the guac?!\" I like mine extra lime-y :)kclaLos Angeles, CA2/23/2022Great classic recipe. Thanks for reminding me how much I love guacamole. Garlic is an essential ingredient which a lot of people leave out. I grind it in a mortar with a little kosher salt so it turns into liquid and subtly permeates the entire dish. Also, to the person who challenged the idea of putting cilantro in guacamole, it is standard in Mexico. I happen to like it and put it in if I have it around, but you don't have to put it in if you don't like it. It's not a deal breaker.\nWill TriggsSan Francisco11/18/2021Summer and avo season are just knocking at the door in NZ and I can't wait to try this. Always keen to try a new guac. My only comment is that I would dice the avo, by the time it is all stirred together the consistency would be spot on. But then I do like my guac chunky. Thank you.anniemNew Zealand10/6/2021I like to take the jalapeno and put it together with some garlic and salt and mash it up with a mortar and pestle before mixing together. This helps blend the pepper and the juices distribute nicely in the avocado.AnonymousNew Jersey7/26/2019Cook garlic on low heat in olive until is nice and soft. Careful not to burn the garlic. Use kosher salt, this is a great trick for cookies too. The flakes are bigger so you taste it. Fresh ground pepper and cumin to taste. Red peppers can add a bit of color. Diced tomatoes are also great. I often make pico de gallo the day before to mix in.AnonymousAnonymous 7/16/2019Made this recipe just half an hour ago and I think it’s delicious! I was weary about the cilantro but it turned out to really add a nice flavor to the dip. This dip + a salty chip = bliss! DannyC112Denton, TX3/23/2019Made it this weekend to rave reviews and requests for the recipe.  It was a real hit!AnonymousSan Antonio, TX2/12/2019Two problems: 1) no one I know puts either cilantro or pepitas into their guacamole; 2) the best recipe I’ve ever used calls for the addition of a small amount of diced tomato and black pepper along with the other ingredients listed here. Lemon juice can be used in place of lime juice. Just my experience w Tex-Mex after living in the Lone Star state for 42 years. AnonymousTX5/5/2018Looks great! I will probably make this today. Minus the cilantro. I used to like cilantro until it started appearing on everything but creme brulee. My mom has never liked it -- it tastes like soap to her. Any suggestions as to what will give Mexican food that fresh herbal note besides cilantro would be appreciated.AnonymousCentral New York5/5/2018Explore Bon AppétitDipMexicanLatin AmericanAvocadoVegetableSerrano ChileChileCilantroHerbs & SpicesEasyQuickStarterSnackVeganVegetarianDairy-FreeRawKetoGluten-FreeSuper BowlFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-10-04", "author": ["Condé Nast", "Rick Martinez", "Alex Lau"]}