{"id": "c821388522b344e2ea2c3a36f74c4924", "url": "https://www.bonappetit.com/story/mediocre-berries-sugar-salt", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "These 2 Ingredients Make Even Mediocre Berries Taste Irresistible | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese 2 Ingredients Make Even Mediocre Berries Taste IrresistibleNot all berries are created equal, but these two pantry staples are the great equalizers.By Molly BazJune 11, 2019FacebookTwitterEmailPhoto by Chelsie Craig, FoodFacebookTwitterEmailIf you follow any Bon Appétit staffer on Instagram, you know when Harry’s Berries are in season. In these parts, the arrival of these ridiculously-delicious berries from a single small farm in California marks the official beginning of summer. They're our first, precious taste of that real-deal ripe-ripe, and their brief season comes well before we actually get any decent local strawberries in this neck of the woods. These things are so bursting with flavor that they almost taste fake, more strawberry-y than you could even imagine strawberries could taste.But it can't be all Harry's Berries all the time—that's just not the world we live in. And when we're facing down a clamshell of less-than, trucked-from-far-away fruit, or even farmers' market berries that aren't bursting with flavor, we have a simple trick that will make them taste almost as good.All you’ve got to do to rescue mediocre berries from their own mediocrity? Add a little sugar and salt! Wash your strawberries, cut them, and hit them with a pinch of salt and a couple good three-finger pinches of granulated sugar, give them a little tossy-toss, and watch them magically start to darken and get extra juicy. The additional sugar supplements whatever natural sweetness the strawberries might be lacking, and helps to draw out their juices to form a tasty, ruby red syrup. And the salt, which may seem like a wildcard in a sweet preparation, actually does exactly what it does in savory applications—it makes the strawberries taste more, which is especially welcome in a situation when they don't taste like all that much. Magically, what were once ho-hum berries start to taste...actually awesome!But folks, it doesn’t stop with strawberries! This same little one-two punch of a flavor enhancer can be applied to any berry that could use a little pick me up. Raspberries. Blackberries. Blueberries. You name it! It even works with stone fruits like peaches, plums, and nectarines. To be quite honest, you’d be hard-pressed to find anything that couldn’t benefit from a little hit of salt and sugar.So whenever you can get flavorful, perfectly-ripe berries—Harry's or otherwise—enjoy them with unadorned and with abandon. And all those other times? A little salt ‘n suga will have things tasting juuuuuust fine.Strawberry shortcake, anyone?Basically Strawberry ShortcakesYou can make this classic summertime dessert with whatever seasonal berries are calling your name.View RecipeExplore Bon AppétitBasicallyBerryStrawberrySugarSaltSummer DessertsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-11", "author": ["Condé Nast", "Molly Baz"]}