{"id": "c8380cc3ed4b5ee79e4a257cbe532d6a", "url": "https://www.bonappetit.com/story/road-sodas", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "A Road Soda Reminds Me It's the Journey, Not the Destination | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat’s a Road Soda? A State of Mind, ReallyCatching a buzz in the back seat showed me life is about the bumps, the detours, the journey.By Ali FrancisNovember 24, 2021FacebookTwitterEmailIllustration By Alex MertoFacebookTwitterEmailHere we are: lost. I’m sitting in a rental car with my Australian parents and brother and his girlfriend amid a thicket of maple trees in the middle of, well, somewhere, I guess. Living across the world from each other, we’ve converged in the wilderness for our annual road trip. And things are not going great. For me, the fifth wheel; for them; for society en masse. I have recently incurred a haircut that makes my head look like a king trumpet mushroom and a spate of job application ghostings has left my self-esteem trembling like the cheap engine in our white Toyota Corolla. My brother anxiously awaits reentry to the U.S. after a visa snafu. My father, who has a head cold, responds to physical weakness with irritation. And Mum, the backseat driver in all of our lives, is starting every sentence with, “I’m just saying…”It’s almost midnight. Dad has been driving all day. And my brother, our navigator, has just realized our little blue Google Maps dot is pulsating at least an hour off-course. From the back, I exert a despairing sigh; my mum demands the navigation device with a sassy hand-flapping motion; Dad rests his brow against the steering wheel with Oscar-worthy drama. It’s my brother’s fault. He’d typed something-street instead of something-avenue—or something.“Listen, there’s no point blaming anyone,” he says. “It is what it is.”“You would say that,” chirps Mum.“Let’s just find a motel?” I offer.“Order in the ca—ah—AHHHH—TSOOO!” Dad hollers, punctuating his sentence with an almighty sneeze.For the past decade-plus, the four of us have been stretched across the globe like an elastic band. What started as temporary periods of absence—years at boarding school and college for my brother and me—became permanent. Then my brother moved to the U.S. for a music internship. I followed a few years later to write. And my parents stayed on our farm in Australia. Time flew by as it does, and what nested in all of us was a kind of chronic homesickness, a sickness for each other, really. To keep the pain at bay, we buy long-haul tickets somewhere and converge yearly. It’s a setup full of both promise and predicament. On the one hand, our annual trips are exciting! Primed for memory-making! On the other, with just one shot per year to enjoy each other’s company, the stakes are high: We must have fun. Look alive. Smile for the camera! I love you, please be happy.Amid the quibbling, my brother’s girlfriend, like a stowaway onboard, has been all but forgotten. Until, in a moment of silence, we all hear it: the familiar choo-kah of a pressurized can opening, gas escaping in a gasp.“Would you give me one of those?” my mum asks, slumping back into the middle seat between GF and me, extending a limp pointer finger toward the cooler of beers at our feet.“Me too,” I say.My brother reaches a hand back over the front passenger headrest like a crane.Choo-kah, choo-kah, choo-kah.“Great,” my dad, a captain losing his crew, mutters into his lap.I take an urgent slug of Genesee, like a diver coming up for air. I puff out my cheeks and let the liquid go warm in my mouth, weightless bubbles somersaulting everywhere. As the amber liquid dissolves the knot in my stomach, I note the beer’s message. A truth so universal it’s credited to King Solomon, Abraham Lincoln, and the poet Edward FitzGerald: This too shall pass. Life isn’t so bad, I tell myself. You’re in a car going nowhere with your favorite people on earth. The blinking blue dot, my fungal haircut, the starry night sky, a can of cheddar-flavored Pringles my brother just cracked open, the cold beacon of hope condensing in my hand. It’s all more than enough.The first road soda takes the edge off. My senses grow dull, the tactile world around looks soft and hazy. Like cheese and crackers when you’re starving; a good start. My dad, who hasn’t downed anything but water and Advil, finally rights our path, demotes my brother from first man, and starts the engine.Beer two gives me life. I have soooo much energy! What is this song? Can you turn it up? “Just relax, take it slowly,” croons Cat Stevens. “Take your next left,” says the Maps man. I’m at ease, resting a head on Mum’s shoulder. Laughing at nothing. I’m bringing the can to my lips and then lowering it again. I’m light. Vaporous. Nobody is emailing me and I don’t have a job, but I set a cheeky out-of-office auto response anyway. Did you need something? Oh, sorry, Ali’s not here.“If you could invite anyone to dinner, dead or alive, who would it be?” my brother’s girlfriend surveys the car.“Hmmm, probably Nelson Mandela,” says Dad. Then, after a pause: “Or Shania Twain.”“Shania?!” I squawk.“Wow,” my brother says, grabbing for the phone glowing on the dash.Mum starts saying something but she’s drowned out by a husky voice sing-whispering: “Let’s go girls.” And at that point, we all start belting out the first verse.Here’s the thing I’ve learned about family trips: That fantasy of a picture-perfect reunion (everyone is having fun; no problems here!) overshadows so much of the actual experience of traveling (life is complicated and we’re going through stuff) that it can be hard to feel truly present for each other. Which is the entire reason we fly around the world to hang out in the first place. Getting lost and waylaid, being hangry enough to eat a seat belt, and spiraling about our issues outside the car is all part of the journey—and dismissing those imperfect realities is what pushes us further apart.As I sip, I am fully in the here and now. There’s my family, brave and resilient and hurting with the constant pang of distance. Each of us grasping to keep the unit intact like sweaty-palmed trapeze artists. Before my eyes they appear as far-off moons—radiant, preposterous, and perfect. In their glow I am less interested in the fantasy. Give me their highs, their lows. Give me this weird-ass vacation. (To be clear: I’m not advocating for breaking any laws against passengers drinking in cars; if you’re not in an area where passenger drinking is legal, meditation is another option.)After beer two, it ends. Drinking road sodas is never about excess. And anyway, we arrive. The porch lights of our Airbnb twinkle away as my dad coaxes our Corolla into the driveway. We were lost and now we are found. Cracking beers in the back seat is an arguably juvenile thing to do. And yet striving to really see the people you love—no matter how far away they are—is, inarguably, wise.Explore Bon AppétitCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-24", "author": ["Condé Nast", "Ali Francis"]}