{"id": "c83e151edae71a0e37c5ef2a8b078225", "url": "https://www.bonappetit.com/story/regional-pizza-styles", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "8 Styles of Regional Pizza to Know, Love, and Cherish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture8 Styles of Regional Pizza to Know, Love, and CherishDo you know your Detroit-style from your New Haven apizza? Neapolitan from Grandma?By Arthur BovinoMarch 12, 2018FacebookTwitterEmailPhoto by Kathryn McCraryFacebookTwitterEmailWe’re living in a golden age of regional pizza. Distinct favorites are breaking out of their local confines—now you can get lacy-edged Detroit pies in Nashville, charred New Haven look-alikes in Denver, and autentico Roman pies in Chicago. It’s glorious—and overwhelming. So we’ve cataloged a cross section of the current pizza universe and suggested standout examples all over the country for you to do some...research.The eponymous pizza at Denver's White Pie. An imperfectly shaped pie is a hallmark of some of New Haven’s most famous pies.\nPhoto by Matt RitscherNew Haven ApizzaThe Style: Pilgrims once had to trek to Sally’s or Frank Pepe’s in Connecticut for coal-fired char and chewy oblong pies. No longer. The gospel of the thin, dry pizza continues to spread, and with it, the vernacular apizza, a vestige of Neapolitan dialect.Mootz or No Mootz? Mozzarella is a topping to be requested.Hot Spot: White Pie, DenverSome Detroit pies feature pepperoni beneath the sauce, but we like it best up top, as at Emmy Squared, so the cups get nice and crispy.\nPhoto by Alex LauDetroitThe Style: A rectangular pie best known for its crunchy caramelized-cheese-coated edge. The focaccia-esque bottom is usually lined first with “toppings,” then Wisconsin brick cheese followed by streaks of tomato sauce.The Backstory: The steel trays (which bake similarly to cast iron) used on the first pies were reportedly leftovers from a car factory, where they held nuts and bolts.Hot Spot: Emmy Squared, Nashville and New YorkThere’s a thin and crispy crust hiding under all those toppings.\nPhoto by Cameron ReynoldsBarThe Style: The thinnest of pies. Usually has very unfancy toppings and a cracker-like crust.The Name: Originally served in bars, presumably to keep patrons in their seats drinking.Hot Spot: At brand-new Melfi’s in Charleston, SC, pies feature the bacon and iceberg toppings of owner Brooks Reitz’s Indiana childhood.This guy is about to get cut with scissors.\nPhoto by Matt HaasAl TaglioThe Style: In Rome, pizza al taglio is literally pizza “by the cut.” It’s a long, doughy pizza that gets cut with scissors, then sold in rectangular slices by weight and reheated.Controversy: Some pizza nerds look down on reheated slices.Hot Spot: Gabriele Bonci of Rome’s famed Pizzarium recently opened his first U.S. location, Bonci, in Chicago.No sag here, folks.\nPhoto by Alex LauRomana TandaThe Style: American chefs have gone crazy for Neapolitan pies, but the truth is, Romans have long disliked them, preferring their own cracker-crunch crust with zero sag.Crib Sheet: Think of it like a bar pie version of Neapolitan pizza.Hot Spot: Martina, New YorkYou can make your own grandma pie in a sheet pan.\nPhoto by Kathryn McCraryGrandmaThe Style: Cooked in a rectangular or square pan lined with oil, which gives it a crispy, golden crust. Lightly topped first with shredded mozz, then crushed canned tomatoes and a scattering of chopped garlic. A thinner relative of the Detroit pie.The Backstory: Began as an off-menu item at the original Umberto’s of Long Island, NY, where founder Umberto Corteo served the pizza that “mama made” to friends.Hot Spot: O4W Pizza, Duluth, GAA classic pie from La Morra.\nPhoto by Tanveer BadalNeapolitanThe Style: Hand-stretched, wood oven-fired, with a chewy crust and a floppy center. Some spots stick to strict Italian standards, others veer more neo-Neopolitan, especially when it comes to toppings (think duck meatballs, tomatillos, and smoked salmon).Musical Metaphor: If Neopolitan is classical, neo-Neopolitan is jazz.Hotspot: L.A.’s pop-up La Morra leans traditional; Vivian Howard's Benny's Big Time in Wilmington, N.C. takes some liberties (see: pineapple + mint).Too big for the plate.\nPhoto by Alex LauNew YorkThe Style: A deck-oven, gas-fired,18-inch wide pizza cut in eight slices usually sold both by the pie and by the slice. Completely covered by about equal amounts grated low-moisture mozzarella and thick, slightly-sweetened sauce up to about an inch of the puffed edge.What Lies Beneath: A thin and darkened undercarriage with enough give to fold (enabling the walk-and-eat).Hot Spot: Scarr Pimentel worked at legendary NYC pizzerias like Joe’s before opening Scarr’s in Chinatown, which brings stone-milled flour to the otherwise traditional pies.Time to host your own pizza night, cast iron-style:Explore Bon AppétitPizzaRestaurants + TravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-12", "author": ["Condé Nast", "Arthur Bovino"]}