{"id": "c83f39457f5e7f45a58d42a1cd256d7c", "url": "https://www.bonappetit.com/story/pho-bac-sup-shop-seattle", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "Seattle’s Phở Bắc Súp Shop Is Bending a Few Family Traditions | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe New Pho Spot That’s Bending a Few Family TraditionsThree siblings are carrying their parents’ legacy into the future with huge bowls of pho and bottles of natural wine at Phở Bắc Súp Shop.By Angela GarbesApril 3, 2018FacebookTwitterEmailPhoto by Amber FoutsFacebookTwitterEmailIn the tropical-plant-filled dining room of Phở Bắc Súp Shop, diners slurp their way through bowls of Seattle’s lifeblood: rich, aromatic, steaming-hot pho. Above them a large neon sign glowing blue and red reads “Phocific Northwest.” Seattle may be famous for coffee, but locals know it’s this Vietnamese soup that really keeps the city running.Siblings Khoa, Quynh, and Yenvy Pham, proprietors of Súp Shop in Seattle’s Little Saigon neighborhood, grew up washing dishes and bussing tables in their parents’ four pho shops. Their parents, Theresa Cat Vu and Augustine Nien Pham, were pioneers, opening their tiny red boat-shaped restaurant Phở Bắc in 1982, the first restaurant in what would eventually become a thriving Vietnamese area.“While my parents worked in their shop, 15 hours a day, our day care center was a van in that parking lot out there,” Khoa says.“They were so busy trying to open this restaurant, and they were so brave to do it,” Quynh adds. “Their English was limited; their experience was zero. They didn’t have babysitters, so they would just load all us kids in this van.”Now the van is gone, and in its place the siblings have made Súp Shop their domain.A spread of wings, pho, “unfortunate cookie mix,” and egg rolls at Súp Shop.\nPhoto by Amber FoutsThough the building is owned by their parents, the decidedly modern Vietnamese restaurant is entirely the vision of the younger Phams, complete with a full bar, photobooth, and natural wine shop. Vietnamese pop music and videos play on screens above the long marble bar all day, and the design skews simple with a bit of flair: polished concrete floors, white subways tiles, gold light fixtures, a Vietnamese street food cart transformed into a host stand, as well as black leather and bamboo chairs (repurposed, much to their parents’ delight, from another family restaurant).“We went through a lot of ideas—late-night sandwich shop, dessert place, walk-up window,” Khoa says. “Vietnamese restaurants in Little Saigon aren’t really multigenerational businesses. So that transition is what we are trying to figure out—what’s the next step?”The wine shop inside Súp Shop.\nPhoto by Amber FoutsEventually the Phams settled on a vision that speaks to tradition as well as innovation. They’re serving pho, of course, but the menu is also heavy on appetizers and snacks that will be familiar and satisfying to the happy hour crowd—of both the post-work and late-night varieties. Along with the family’s famous peppery fried-to-order egg rolls (available with either pork, egg, and shrimp or tofu), there are sliders filled with nem nướng, fermented pork sausage, pickled carrots, and slathered with herby lemongrass sauce. There are also twice-fried jumbo chicken wings doused in a sticky, tangy tamarind glaze and topped with crunchy fried shallots, a pile of which begs to be washed down with a cold Saigon Export beer (or, if you prefer, a West Coast IPA from local brewery Standard Brewing). For dessert, Yenvy is perpetually refining an affogato-like sundae made with Vietnamese coffee and a cinnamon-laced condensed milk sauce.As for the pho, the broths—beef, chicken, and veggie—don’t stray from the family’s traditional long-simmered recipes, but the siblings have made a few modifications.“We serve a short rib pho that has two giant bones. It’s like the Flintstones bowl,” Yenvy says. “Mom said we should cut the pieces small, but we said, ‘Let’s have it big!’ It’s our most popular item right now.” (And in fact, Mom joins a crew of cooks for a few hours at Súp Shop each day.)“We made it because it’s good, because it’s carnal and fun,” Khoa says. “Turns out it’s also very Instagrammable.”That beef pho you’ve heard so much about.\nPhoto by Amber FoutsIndeed, the broth alone—imbued with the deep primordial flavor of beef bones, as well as star anise and clove—could sate you, but satisfaction reaches a new level when you lift up an eight-inch-long rib and nibble fatty meat straight off it, the juices dribbling down your chin.Stop at the bar for a drink and you’ll likely find yourself crunching your way through handfuls of Súp Shop’s signature bar snack the “Unfortunate Cookie Mix,” a Chex Mix–like combination of shattered fortune cookies, peanuts, black sesame seeds, and chili oil. Its main component—flat rejected, broken cookies—comes directly from a local family-owned Chinese company, Tsue Chong, open since 1917, that makes noodles and cookies in a factory just down the street.Along with beer and cocktails, the Phams are pouring nearly a dozen wines—all of them natural, low-intervention, and made by sustainable producers. Suzi An, who helped curate the wine list, also owns Vita Uva, a miniscule wine store consisting of two well-stocked shelves located within Súp Shop (look for it between the doors to the kitchen and the hallway to the bathroom).“I would never have had this opportunity if it wasn’t for the Phams,” An says. While An is a restaurant-industry veteran, she is also a first-time business owner who didn’t have access to all the capital necessary to find, rent, and renovate retail space, as well as build inventory.“I’m lucky to be supported by this family, who are so entrepreneurial and encourage you to take chances,” she says. “I want wine to be approachable and familiar. What better way to do that in Seattle than through this platform of such a familiar soup?”“A lot of us are stuck in a mentality that you have to have this with a certain that,” An continues. “But that’s the beauty of food and beverage—you can do what you want. Pair whatever you want with whatever you want.”And playing with expectations is ultimately what Súp Shop is all about.“People still associate Vietnamese restaurants with just cheap eats or being a ‘hole-in-the-wall,’” Quynh says. “Our price point is reasonable, but you can come in, have a nice drink or glass of wine, eat a bowl of pho, have a different experience.”“But we are just as chaotic and idealistic as our parents,” Yenvy says. “And the hustle is there too. That’s embedded into the immigrant mentality.”Angela Garbes is a Seattle-based food and culture writer.One final look at those wings before you go.\nPhoto by Amber FoutsCheck out some other great places in Seattle with our City Guide.Explore Bon AppétitRestaurants + TravelSeattlePhoVietnameseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-03", "author": ["Condé Nast", "Angela Garbes"]}