{"id": "c8420610fac80ec547abf5029a9e5ff2", "url": "https://www.bonappetit.com/story/keep-cup-best-office-mug", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "The Keep Cup Is the Only Mug I'll Use in the Office | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFinally, An Office Mug I Can Actually Take to MeetingsTo me, you are perfect.By Carey PolisJanuary 10, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailLike many corporate office workers, I have a daily struggle with our building’s central temperature controls. So much so that I can often be found at my desk, wrapped in a blanket while typing away on my computer. And often in my hand is a mug of tea.This isn’t just any mug, though. It’s a glass 12-ounce Keep Cup, an item that I have grown inordinately attached to during the work day. It seems as if it was designed specifically for my hands (which, in the scheme of things, are pretty “normal” hands…). It’s just the right size to fit a hot drink of single-serving proportions.I get it—the Keep Cup looks… rather perfunctory. Glass cup, one-inch thick cork band, plastic lid with an opening to sip from. But each aspect is designed perfectly: The glass never fogs up and is easy to clean, the cork is super soft and comfortable to the touch, and the lid has the right size slit for drinking without spilling all over yourself. And, there’s a plastic lever that allows you to close the opening to keep your beverage hot when you aren’t drinking it—and from scalding yourself as you carry it around from meeting to meeting.You know how people get attached to mugs because they have some sort of sentimental value? Like, say, if you happen upon a Tina Turner museum in a one-room schoolhouse during a road trip? Obviously, you’re gonna buy a souvenir mug (true story). The Keep Cup holds no such memories for me. It’s sterile, and doesn’t really have a ton of character. But it’s engineered with the office tea drinker in mind, and for that alone it has made me happier than any other mug I’ve owned.Should you decide that you need to possess one of your own, you can design a personalized cup in all sorts of colors. Perhaps go for a way less boring option than I did, and channel a little of that Tina moxie while you’re at it. Sadly, though, there’s no sequin option… yet.Buy it: Keep Cup 12-oz Reusable Coffee Cup, $27 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingStaff PicksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-10", "author": ["Condé Nast", "Carey Polis"]}