{"id": "c84620e956ebcf80a5f4212827af88a7", "url": "https://www.bonappetit.com/story/floyd-cardoz-my-muse", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Floyd Cardoz Was My Competition. But He Was Also My Muse. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsFloyd Cardoz Was My Competition. But He Was Also My Muse.He changed my life and blazed a trail that I and so many other Indian chefs have followed. The acceptance and legitimacy we all craved and finally gained was because of him.By Meherwan IraniMarch 26, 2020FacebookTwitterEmailChef Floyd Cardoz at a Chefs Club dinner in 2016.Photo by Kris Connor/Getty Images for NYCWFFFacebookTwitterEmailOn March 25, 2020, chef Floyd Cardoz passed away after testing positive for COVID-19. He was 59. Chefs, restaurateurs, editors, writers, and restaurant critics took to social media to mourn his passing and remember his accomplishments as a groundbreaking chef and industry leader. Here chef Meherwan Irani, founder of Chai Pani Restaurant Group, shares Cardoz’s influence on him, how he changed his perception of what a chef could be, and inspired him to continue pushing the boundaries.I first heard about Floyd Cardoz in the summer of 2009, just as my wife, Molly, and I were opening our own restaurant in Asheville, North Carolina. We were tentatively calling it Chai Pani. I imagined it would be a small, cozy chaat house serving chai, samosas, and the kind of street food I grew up with in India. Molly purchased every book about restaurant operations she could lay her hands on, including Danny Meyer’s now seminal book, Setting the Table. One day as she was reading through it, she called me over excitedly and asked, “Have you heard of this guy?” She pointed to a name: Floyd Cardoz. “He’s an Indian chef in New York, and he opened an Indian restaurant with Danny Meyer called Tabla,” she continued.I read the five sentences or so Meyer devoted to describing Floyd, and my world suddenly tilted. Up until that moment I never imagined that the seemingly rarefied culinary world—with its celebrity chefs, glossy magazines, TV shows, and black-tie award ceremonies—would ever take an Indian chef seriously. The ones held up as the greats were almost always white and male. But here was a chef who just upended my own biases. Floyd was classically trained, worked at some of the most revered temples of New York gastronomy like Lespinasse, and gained acclaim and respect not just as an Indian chef but a real-deal chef on par with anyone else in the field. New York Times critic Ruth Reichl gushed about this guy when he debuted Tabla.Then there was me. I had no culinary background, no one knew who I was, and I was opening a hole-in-the-wall, slinging Indian street food and chai in a small mountain town in western North Carolina, a long way from where everything important in food was happening. Yet, reading about Floyd, I suddenly wanted what he had: legitimacy and acceptance. Without knowing it, Floyd placed a chip on my shoulder that I carried around for the next 10 years.That chip pushed me hard. It changed how I cooked, plated, and ran my kitchen once I opened Chai Pani. Yes, I was cooking Indian street food and home-style meals, but I became obsessed with technique, with refinement, with taking apart dishes and making them better than any I ever tasted in India. If Floyd was known for bringing Indian flavors and spices to classical French and modern American cuisine, then I was doing the opposite: bringing classical and modern technique to Indian street food without changing the essential nature and casualness of it. I devoured books on technique and watched YouTube videos by everyone from Marco Pierre White to Heston Blumenthal after dinner service and late into the night. Floyd was my competition. But he was also my muse, my ideal of what an Indian chef could accomplish. When he won Top Chef Masters, I swelled with pride and also angst; the bar I set for myself was now raised even higher.But as the years went by and I came into my own, the chip started to erode. I found my voice and a sense of individual purpose: to play my part in changing the narrative of the American South from one of exclusion and racism to one of inclusion and diversity. I found my community of like-minded chefs and restaurateurs all working to add their stories to the anthology of Southern cuisine and culture. I opened more restaurants throughout the South, launched a spice company, and started a dinner series called Brown in the South that brought my purpose and my community together. It took a long time, but I finally understood that I could celebrate and be inspired by Floyd’s accomplishments without feeling that I had to emulate them to be successful.A snapshot of Brown in the South, with Meherwan Irani (far left) and Floyd Cardoz (middle)\nPhoto by Thomas PayneLast year I met Floyd. I had seen him in passing at one Brown in the South dinner we hosted at the Saveur offices in New York and was planning another the next day at the James Beard House with my fellow Indian chefs Asha Gomez, Maneet Chauhan, Cheetie Kumar, and Vishwesh Bhatt. Vish was close friends with Floyd and asked if we could invite him to the Beard House dinner. For a second I felt apprehensive. I had built Floyd up into my personal Svengali, then into a larger-than-life hero. But the apprehension faded as I realized I didn’t need to prove anything anymore. As a chef I’m happiest when feeding someone, so as the dinner approached, I was as excited as a fanboy about to meet a comic book superhero.At the Beard House there’s a longstanding after-dinner tradition where the chefs leave the kitchen to talk to guests in the dining room. As we stood in front of everyone, soaking up the applause and adoration, my eyes wandered over to Floyd. And my world tilted again. At that moment I realized how much I owed him. That unbeknownst to him, he changed my trajectory. He influenced me, pushed me, and taught me. He made me the chef I am today. So my first words to Floyd were spoken through a microphone in front of 60 or so guests. I thanked this man I’d never met for changing my life and blazing a trail that I and so many other Indian chefs have followed. The acceptance and legitimacy that we all craved and finally gained was because of him. I called Floyd the godfather of modern Indian cuisine. His eyes shone, and in them I saw something I didn’t realize I wanted from him all this time: validation.We talked afterward, the stutter-start conversation between two people who had heard much of each other but had yet to meet. As we eased into it, I knew that the man I respected from afar could be a man I loved up close. I figured we had time to fall into that closeness. I ate at his groundbreaking Goan restaurant, O Pedro, in Mumbai this past February and sang karaoke with his brother at a friend’s house in Malabar Hills. It seemed natural that our circles would close in on each other. Little did I know that fateful dinner at the Beard House would be the last time we'd meet.In all those years of trying to keep up with Floyd, it never occurred to me that one day I would be someone validating him. And that’s what I’m doing here. The culinary world has lost someone incredibly important—not just a talented Indian chef who laid the groundwork for legitimizing one of the great cuisines of the world but a capital C chef who was a leader, a mentor, and an iconoclast. The chip on my shoulder is long gone, but the weight on my heart will take a long time to lift. Thank you, Floyd.Explore Bon AppétitChefsRead MoreLifestyleMeherwan Irani Wants to Change Stereotypes About the South, Starting With DinnerBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-26", "author": ["Condé Nast", "Meherwan Irani"]}