{"id": "c84e1c27cd4c0df3ceec7de9bdbb5024", "url": "https://www.bonappetit.com/story/galette-for-dinner", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "You Should Be Making Pie for Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Should Be Making Pie for DinnerThis savory galette is everything you need leading up to the holidays.By Carla Lalli MusicDecember 6, 2018FacebookTwitterEmailPhoto by CHRISTINA HOLMES, FOOD STYLING BY REBECCA JURKEVICH, PROP STYLING BY KAITLYN DU ROSSFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I made this vegetarian galette a lot when it was first published, oh, four-and-a-half years ago. It has a flaky, whole-wheat crust (health halo!) and is filled wilted greens and caramelized mushrooms, with creamy ricotta atop and below. Imagine a savory pie bedazzled with all the flavors of a ravioli filling. Yes: I made it for potlucks. I made it for weekend dinner. I made it for brunch. I understood even then that I had a major advantage over most of our readers because I had gotten to taste-test it in the test kitchen before I made it at home (again and again). Risk-free cooking: I knew the recipe was a winner.Want this letter before it hits the website? Sign up for our newsletter!Turns out that convincing other people that they should drop everything and make a whole-wheat crust, then fill it with ricotta, sautéed greens, and browned mushrooms before baking all those ingredients into a savory pie is a tougher proposition. That’s where I come in!First of all: You’re going to be eating so much meat between now and New Year’s Day. Let’s get some roughage in there.Second: The crust can be made in a food processor. Food processor! Ever heard of it? Dump in flours and salt. Add butter. Pulse, pulse, pulse. Add vinegar and ice water. Toss, toss. Smush into a disc. Badda bing, badda boom, you’re done. (Also: If you don’t have whole wheat flour, you can use 100 percent all-purpose.) That was the hard part, and it’s already over!Shiitakes are a great mushroom for this galette.\nPhoto by Alex LauThird: Brown some mushrooms. I’ll admit, I am not, repeat not a huge fan of those ordinary-looking button mushrooms in the photo, and would use some frilly oyster mushrooms, maitakes, or shiitakes for this, but for real, anything will work. A few minutes over medium-high heat with some olive oil, salt, and pepper is all you need. In the same pan, sauté some garlic and Swiss chard (or kale, or spinach, or savoy cabbage) with a little garlic, salt, and pepper. That’s it.Now: Roll out the dough (the recipe says to do this on floured parchment paper, which is a layer of fool-proofing that eliminates any possibility that the dough will stick to the countertop and makes it easy to get the dough onto the baking sheet). Onto the dough goes some ricotta. Then the greens and the ‘shrooms, then more ricotta, and then you bake it.I like things that go in the oven for a few, because it allows a little window of time to put my tiny kitchen back together and wash whatever pots and pans I’ve used. This is also a great time to tear some herbs and send someone you live with to the store to pick up a lemon—that’s the basis for a fresh herb salad for topping the earthy forest flavors happening in the galette.Strategically speaking, it would be overambitious and unrealistic to make the dough on the same night that you want to eat the galette. But maybe you work at home, so you can do this when you’re procrastinating around lunch time. Maybe you’re an actor-waiter or a group fitness instructor and you don’t have to go to work till 4 o’clock—you have time during the day! If you’re a teenager who loves to cook, get the dough ready when you get home from school and let it chill till your parents get home from work and the rest of the family will love you, unless they hate vegetables in which case the entire galette is yours! Or you can do this first step on the weekend and then swing right into your veg-forward dinner another night of the week. I’m just trying to cover all the bases here.A fried egg on top turns a slice of galette into a full meal.\nPhoto by Ted CavanaughIf a slice of veggie pie is not your idea of dinner, make this your side dish. Or bulk it up by serving it with a fried egg on top. Cut it into thin wedges and tell people it’s an appetizer. There are a lot of reasons to make pie for dinner. The number one reason for not doing it is because you haven’t had it before, and once you get over the hump, you won’t have that excuse. I hope I’ve been convincing. If not, the galette will speak for itself.Get the recipe:Swiss Chard and Mushroom GaletteExplore Bon AppétitCarla NewsletterGalettePieMushroomRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-06", "author": ["Condé Nast", "Carla Lalli Music"]}