{"id": "c850a225341dac280988d2adee6c40a2", "url": "https://www.bonappetit.com/story/mars-2112-eulogy", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "A Eulogy for Mars 2112 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAll I Want to Do Post-Pandemic Is Eat Quesadillas at This Mars-Themed Restaurant in Times SquarePlease, dear God, bring it back. This is my only prayer in 2021.By M.M. CarriganMarch 19, 2021FacebookTwitterEmailPhoto courtesy Daroff Design Inc. + DDI Architects, PCFacebookTwitterEmailMars 2112 was a science-fiction themed restaurant and tourist trap in New York City. Few mourned it when it closed in 2012, one hundred years ahead of its time. It was like a Rainforest Cafe, except with aliens, craters, and a spaceflight simulation ride that dropped space travelers off at the hostess stand. Patrons dined in the three-story high Crystal Crater, decorated with neon lights and bubbling lava pools. Martians with names and backstories mingled among the tables for photo ops and conversation. Having been there just once, when I was 18 years old, I can say it was tacky. It was overpriced. It was basically a space-themed version of Applebee’s. And goddamn it, I miss it. I miss all of it.We’re over a year into the pandemic. I’ve been trapped in my house with my wife and children. I’m bored. I’m depressed. And I’m fantasizing about partying with martians. I want to chug sugary outer space cocktails at the Star Bar. I want to play in the futuristic Cyber Street arcade. When the waiter asks me if I would like to try the “Sub Space Sampler,” the answer is not simply yes. I’m opening my mouth like a foghorn and emitting a high-pitched woot—hell yes—and also I’ll take the Nebula Chili Nachos. Load it up with extra chili. I don’t even eat meat. I just want to have fun.The 33,000-square-foot space was the largest themed restaurant of its kind when it opened in 1998. Mars 2112 was founded by Irish businessman and former meat mogul Paschal Phelan, who had visions of the restaurant being more of an event than an experience: “the fusion of fun and good food and fantasy,” he told the New York Times for a story that ran in 1998. Tourists stepped off the streets of Times Square and into an international space station, where they were issued Mars Federation visas before being herded into one of the two 30-seater simulation rides. The three-minute program blasted riders over the Chrysler Building, out of the atmosphere, and through a “lunar wormhole” to Mars.We can thank Daroff Design for this masterpiece.\nPhoto courtesy Daroff Design Inc. + DDI Architects, PCPlease, dear God, bring it back. This is my only prayer in 2021.At its height, Bill Clinton and his niece partied at Mars 2112. So did Brad Pitt and Maddox. It was a God-tier location for a birthday party. It was a place to go on awkward first dates in hopes that ordering the Magellan mozz sticks might break the ice. And it was a great place for mothers to take their mortified teenage daughters in 1999.My mother, born and raised in suburban Baltimore, made it to New York City just once in her life. She planned the weekend trip, dragging me and my sister around the city with that forceful Mom Energy, ignoring our teenage scowls. She insisted upon the “NYC tourist experience” as we huffed it through Central Park and toured the Statue of Liberty. We saw Rent on Broadway. We woke up at an ungodly hour to stand in the Today Show’s plaza, where my mother tried to catch Al Roker’s attention with a neon sign. She had been studying the show and developing an attention-grabbing methodology for weeks. My sister and I were coached—maybe threatened—to smile and wave like maniacs if Al got close. He did not, but there is a fast-panning, blurry shot on the VHS tape at home that proves she tried.Photo courtesy Daroff Design Inc. + DDI Architects, PCBy the time we made it to Mars 2112 to eat dinner, I could barely contain my eye-rolling. The appeal of the 22-foot-in-diameter UFO outside the building was lost on me. I avoided eye contact with anything in costume while trying to convey through my nonchalance that I was being held against my will. My mother snapped pictures and laughed. The Empress Glorianna, ruler of Mars, came to our table, and taught us how to say “hello” in Martian. I slunk into my seat and prayed for the pain to end soon. I ordered the Quasar Quesadillas and a Diet Coke and consumed them passive-aggressively.By the mid-2000s, Mars 2112 had already declared bankruptcy a handful of times. Fraud allegations haunted the troubled owners. The arcade games were in disrepair, never even making it to auction, instead repossessed for liens. Patrons were now greeted by bored aliens in frayed wigs. The space simulator ride was busted and just a movie now, “if anyone wanted to watch it before entering the dining room,” according to an online review. Cosmic drink specials continued to keep the place afloat among the Midtown happy hour crowd. Then, one day in 2012, the restaurant went dark. A PR person said they were “remodeling.” Grub Street New York and Gothamist made jokes about Mayan prophecies and space tragedies. Then a luxury gym moved into the space.Photo courtesy Daroff Design Inc. + DDI Architects, PCWe’ve written so many eulogies for beloved restaurants over the last year. I guess I just wanted to write a eulogy for an unloved one. I miss restaurants. Nah, it’s more than that. I miss impromptu stupidity with other people in places designed to make it easy. I miss that magical type of food that’s bland and greasy when you’re alone but amazing when you’re with friends. It’s easy to laugh at the unreality of these themed restaurants, the Hard Rock Cafes and Planet Hollywoods and Medieval Times of the world. But after a year in the pandemic, in my 341st day of wearing gym shorts, I’ve begun to question what real even is. Hanging out in Mars 2112 that day after stalking Al Roker, being embarrassed with my mother and sister, was no less real than any other moment in my life.Mom, I get it now, and I’m sorry. Right now, eating inside a space crater on Mars would bring me unbridled joy. I will totally pose with the three-eyed sweaty alien the size of a major league mascot. I’ll make my kids do it too. I’ll force them to smile. My youngest is three and adorable. She could probably catch Al’s attention. (By the way, Al, if you’re reading this, my mother’s sign said “Pasadena, Maryland Loves You.” She really wanted you to know that for some reason.) Let’s go hop on a rocket, narrowly avoid whiplash injury on the janky simulator, and then let’s splurge on the Mercury Oreo Mountain for dessert. We’ll drink so many Martian cocktails, we’ll actually teleport ourselves to Mars to see if they got it right. We’ll tell Empress Glorianna that we’ve got one hell of a story about the past year, back home where we come from.Explore Bon AppétitRestaurantsCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-19", "author": ["Condé Nast", "M.M. Carrigan"]}