{"id": "c85c221221f3e8886930dec0bb301336", "url": "https://www.bonappetit.com/story/omakase-chasers", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "The Omakase Chasers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Omakase ChasersAmong New York City’s dining elite, high-end omakase is the new top prize.By Rachel Tepper PaleyMarch 19, 2019FacebookTwitterEmailIllustration by Subin YangFacebookTwitterEmailFrom his perch at the lustrous wood counter at Kosaka, Jonathan Wigser plucks a pillow of rice from the slate slab before him. It was placed there moments earlier by one of the restaurant’s somber-faced chefs, the canvas for a fat coin of raw scallop blanketed in citrus-inflected yuzu foam. A single strand of translucent sea grape algae rests atop the whole thing, glistening like a jewel bracelet. Wigser tips the nigiri into his mouth with the ease of someone who clearly does this often, and I follow suit. A hush falls over our corner of the restaurant as we consider the buttery scallops, the tart hit of aromatic yuzu, the sweet smack of sea. We share a slow nod of closed-eye approval, then swallow.The meal at the dramatically lit, glass-enclosed sushi restaurant in the West Village constitutes Wigser’s third omakase in 30 days. Wigser, a real estate investment banker, was first introduced to luxurious, multicourse sushi dinners in the 1980s while entertaining clients from Mitsubishi Group. The predilection stuck.Today he counts himself among a group of diners obsessed with New York’s most exclusive sushi dens, where the price of a single dinner for two amounts to what some New Yorkers pay monthly in rent.“To be very candid, a typical dinner, when you throw in sake, it’s going to be $800 to $1,000 for two people,” Wigser tells me. At $155 a head, Kosaka is a relative steal—it’s Wigser’s “local,” and he comes here at least once a month—and it represents only a fraction of his monthly sushi budget. The next course, lightly torched lobes of tangerine uni from Santa Barbara, California, touches down. Wigser snaps a photo and tosses it back. He’ll later upload the image to Instagram. “When we’ve been really bad,” Wigser says of him and his wife, “we go three times a week.”New York City’s high-end sushi scene has been growing steadily for more than a decade but seemingly never so much as in the past several years. Within the sushi genre, omakase—a style of sushi chef–guided tasting menu—has emerged with particular vigor. To name a few recent openings: Sushi Nakazawa debuted from Sukiyabashi Jiro apprentice Daisuke Nakazawa in 2013; the inventive Shuko came to the fold in 2014; O Ya and Sushi Zo, imports from Boston and L.A. respectively, opened Manhattan outposts in 2015; Sushi on Jones, which set the bar for budget options ($58 for a 12-piece, 30-minute tasting) arrived in 2016; subterranean Omakase Room by Tatsu, elegant Sushi Amane, and more affordable Sushi Ishikawa, entered the scene in 2017; ultra-pricey Sushi Noz opened its eight-seat sushi bar for business in 2018.“It seems to me that Japan—and Tokyo specifically—replaced Paris as the great food obsession for New Yorkers a long time ago,” New York Magazine restaurant critic Adam Platt told me. Platt has written his fair share of reviews and articles about upscale sushi restaurants in the past decade, including the publication’s recent rundown of the absolute best sushi spots in New York City. “In those sort of high, high finance circles, and certainly among the younger moneyed finance classes, the trophy-style dining is now sushi,” Platt said. “These places are basically all filled with young guys, sometimes women, sporting their $30,000 watches, who all have ‘my guy.’”The connection between the moneyed class and omakase is so strong that it’s become a pop-culture trope, turning up in a 2017 episode of Showtime’s Billions. In the scene, a pair of rowdy bankers cause a stir at Sushi Nakazawa while speaking loudly on a cell phone and dunking their nigiri in soy sauce. The blatant disrespect inspires an impassioned schooling on proper sushi etiquette from Mike “Wags” Wagner, the show’s smarmy hedge-fund COO. Billions co-creator Brian Koppelman tells me that the scene was inspired by real-life characters he’s encountered in New York City.“At a place like Shuko or Nakazawa in New York, most of the people at the sushi bar are there in a great spirit, and then there’ll be a couple of people there who just want to be able to say they ate there,” he says. “You can usually tell, because they start putting ginger on top of their fish and they’re calling their money manager. You know, someone who treats the corner seat of the sushi bar as though it’s a blackjack table.”David Foulquier, the co-owner of the Upper East Side’s Sushi Noz, where omakase starts at $300 a head with a $175 drink-pairing option, knows the real-life characters well.“There’s a guy who comes and spends $500 on a bottle of champagne and $500 on sake and then buys a round whiskey for everybody,” he says. “That guy exists and that guy is 100 percent a client, but there are also people who are actually going for what they consider to be a truly extraordinary culinary experience.”Omakase, Foulquier continues, delivers a uniquely personal and therefore more exclusive luxury experience than, say, an equally expensive dinner at the Michelin-three-star Eleven Madison Park. “As hard as these places try, you cannot personalize a dining experience when there are 200 other people in the room as much as you can with an omakase restaurant.” In some cases, regulars will take advantage of the restaurant’s small size, scheduling weekly standing reservations that claim every chair in a seating. “They can buy out the restaurant for them and eight of their friends,” Foulquier says. “It’s this kind of an extra-personal experience where you feel like you own the place.”Social media plays its own role in the flaunting “gotta catch them all” version of the omakase experience. Wigser says that during his sushi outings, he usually spots at least one diner he recognizes from their Instagram accounts—users like Oh My Kase (18.2K followers), The Sushi Legend (16K followers), and omakase_nyc (39.1K followers).“Lately I’ve slowed down, but I could easily do two omakases a month,” says Josh Birns, who’s also in New York real estate. His You Uni Live Once account has 29.1K followers. “It’s the same thing as me buying a ticket to a Broadway show. We’re going for the experience to remember forever. It’s not just a dinner. It’s an event.”“It is a lot of money,” says Masha Stroganova, an art gallery director who runs the Instagram account omakase_nyc. Stroganova says she indulges in up to three omakases a month with each meal averaging between $150 and $200. “But I’d never blow the same cash on a high-end French meal. I’ve done it before, and it’s never left me satisfied.”“Sushi, it checks all the boxes,” Platt says. “It requires a fair amount of money to consume. It signifies that you’ve traveled. The world of high finance and money has always been food obsessed.” It’s just that these days, “they’re not talking about ‘my last trip to Peter Luger.’”Explore Bon AppétitRestaurantsNew YorkSushiJapaneseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Rachel Tepper Paley"]}