{"id": "c869afbcc08c35f703fb02a08662947e", "url": "https://www.bonappetit.com/story/types-of-kale", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "The Most Common Types of Kale, Explained | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAre You Using the Right Type of Kale for That Recipe?Know the difference between baby kale and curly kale? You should, if you want your salads, soups, and pastas to be their best.By Alex DelanyJanuary 2, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailYou know kale. Hell, everyone knows kale at this point. Those four letters are printed on sweatshirts and tote bags galore. But do you know the difference between all the types of kale? Well, you should, because they're all different, each with its own particular strengths.They’re all nutritious, hearty, and flavorful (with a grassy, peppery bite that we love), but they cook differently. You should be familiar with the most commonly available types of kale, so the next time you're shopping for the stuff you'll know exactly which kind you should pick up for a given recipe. Here's what you'll come across at the grocery store most often:Curly kale gets nice and crispy on a white pizza.\nPhoto by Alex LauCurly KaleThis stuff is everywhere. It’s kale’s most common variety, and like the name advertises, has wavy, curly edges on each leaf. Being the most common, it’s earned the reputation as overplayed, but we think it’s actually a bit underrated. After stripping the leaves from those tough, fibrous stems, it’s great sautéed with a bit of garlic or slow-simmered in oil, and even roasted alongside proteins or other vegetables. The curly edges crisp up beautifully when exposed to the oven's dry heat, and they taste great when cooked in an almost-dry skillet. It's a little bit tough compared to other varieties, so if you're going to eat it raw, it needs to be gently massaged with a bit of salt and acid like lemon juice or vinegar; that said, when treated properly, it lends a delicate, feathery texture to salads, and those crinkly edges make for a dramatic presentation.Kale BLT salad. Yes.\nAlex LauTuscan Kale aka Lacinato Kale aka Dinosaur KaleIt goes by a lot of different names, but whatever you want to call it, this is our rock. This is our favorite child. This is the kale we love to cook—and not cook—the most. It has a deeper color and is slightly thinner and more tender than curly kale, making it more versatile—it cooks more quickly and requires less massaging for use in raw preparations. Slow cook it. Remove the stems and use it in a salad or slice it into strips to make a slaw. We also love it stirred into soup or pasta right when it’s being finished in the pan. Tuscan kale has a pleasant, chewy texture that disappears when overcooked, so be sure to keep an eye on it.Red and green kale, hanging out in some minestrone\nChristopher TestaniRed KaleRed kale, sometimes called \"scarlet kale\" and \"red Russian kale\" is almost identical to curly kale, except in appearance. Depending on the specific variety and when it is harvested, it may have deep red-hued leaves and stems, or just ruddy-colored stems and grey-green leaves. In any case, it's a looker, so we love to massage it gently and mix it into salads that already have greens in them. And you can never go wrong sautéing it slowly in garlic and oil with a good pinch of salt, and finished it with lemon juice, a hit of fresh olive oil, chile flakes, and flaky sea salt.Baby kale and sesame noodles, best friends forever.\nLaura MurrayBaby KaleBaby kale is exactly what it sounds like: a younger version of kale. You're probably more likely to find this in a plastic tub with the salad greens, which is a good clue as to how it wants to be treated. Don’t cook it as long as you would mature kale—if you're going to cook it at all; we don't—and definitely don’t massage its tender leaves unless you want green mush in your salad. Baby kale’s flavor isn’t as strong, so be gentle. Instead of using this as a base, we like baby kale as a supplement to other greens in salads. It gets you a hit of the kale flavor and those dark leafy green nutrients without the need to commit completely.Kale and brussels sprouts belong together. This Winter Crunch Salad is proof.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-02", "author": ["Condé Nast", "Alex Delany"]}