{"id": "c8793716678009f4302103944f22fa6e", "url": "https://www.bonappetit.com/story/antipasto-platter", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "The True Measure of a Red Sauce Restaurant? Its Antipasto Platter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe True Measure of a Red Sauce Restaurant? Its Antipasto PlatterZeppoli in Collingswood, New Jersey, sets the bar.By Alex DelanyApril 16, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.You’ll find the king of antipasto platters at Zeppoli in Collingswood, New Jersey. Overflowing with meats, cheeses, and veg, it’s an embarrassment of locally sourced, thoughtfully prepared riches that can be scaled up based on your party’s size—which means no fighting over the best parts. Chef Joey Baldino’s philosophy is that once you hit the minimum prereqs—one cured meat, one cheese, and two veg—you’re free to choose your own path. For him that means leaning on a huge array of vegetables for a food tour’s worth of Sicilian flavors, textures, and colors. Here’s what makes his plate supreme:THE MEATSSopressata: These sweet, salty, fatty, tangy logs of cured pork are made at Claudio Specialty Foods in Philly’s Italian Market, which is where much of Zeppoli’s meats and cheeses come from. When sliced, they’re destined to be wrapped around cheese or maybe even a vegetable (you know, for health).Mortadella: Meat number two—let’s call it the deputy—should have a different texture from the first since a perfect antipasto plate is all about contrast. Hence, soft, bologna-like mortadella to contrast with the hard sopressata.THE CHEESESProvolone: Aged for at least four months, this is sharper than the stuff you’ll find sliced at a deli but still versatile enough not to dominate the plate.Baked Ricotta: Baldino’s creamy, wonderfully springy cow’s-milk ricotta is made in-house, then baked for a deep, toasty flavor.Fresh Mozzarella: Baldino also sources his mozzarella from Claudio, where it’s made fresh daily. Then he tosses it in olive oil, basil, parsley, and chile flakes for a milder counterpoint to the provolone—a nice resting point for your palette. Annnnnd...your rest is over.THE VEGETABLESPickled Beets: A refreshing, high-acid intermission from all that cheese and meat, plus a little extra flavor thanks to Baldino’s star anise–loaded brine.Mushroom Salad: Crimini mushrooms get mixed up with rosemary, parsley, and chile oil, then cooked low and slow to concentrate the earthy flavor and dry heat.Grilled Long Hots: These lanky green guys are the official chile of South Jersey, grown by many farmers in the area. They pack serious heat and are best followed by a nice cooling bite of cheese.Roasted Carrot Salad: Made with carrots from the Collingswood Farmers’ Market and seasoned with super-fragrant dried Sicilian oregano, this salad tastes dirty and funky in the best possible way.Roasted Squash Agrodolce: Agrodolce, that tantalizing sweet and sour flavor combo, is huge in Sicilian food. The tangy dressing balances perfectly with the natural sweetness of the squash.Roasted Red Peppers: A staple on any antipasto plate, these red bell peppers are roasted in-house—never poured from a jar.Stuffed Pepper: Cherry peppers packed with prosciutto and provolone are kind of like an entire antipasto platter in one bite, and thus Baldino’s favorite part of the spread—a direct shot to the briny, spicy, creamy Italian flavors of his childhood.Roasted Cauliflower: Tossed with salted anchovies before it’s cooked, this lucky cruciferae gets an extra-deep, umami-loaded flavor that holds its own on the plate.Eggplant Caponata: A Sicilian classic, defined by red wine vinegar and warm spices for another hit of sweet-sour flavor.Sun-Dried Tomatoes: Baldino slow-dries plump, tender New Jersey Roma tomatoes overnight in Zeppoli’s ovens during the summer. Come winter, he imports them pre-dried from Sicily to keep the quality high.Grilled Zucchini: An unadulterated vegetable is key to balancing out all the strong flavors of an antipasto platter. Here, a simple seasoning of salt, pepper, and olive oil lets that delicate zucchini flavor and bitter char shine.Sautéed Asparagus: Okay, okay, maybe you need two unadulterated vegetables.Grilled Corn Salad: Jersey corn, charred and tossed with ricotta, chives, and olive oil, brings a bright, fresh dose of natural sweetness.THE FISHTuna and White Bean Salad: Full of rich, olive oil–packed tuna (read: nothing like that stuff that’s been sitting all day at the deli bar), this salad is all about creamy textures and fatty richness.THE EGGSFrittata: Frittatas are more commonly seen in Italian antipasto than their Italian-American counterparts. Baldino’s is flavored with saffron and full of…spaghetti, which is actually a traditional frittata filler back in the motherland.Alex Delany is an associate editor at Bon Appétit.Explore Bon AppétitItalian AmericanRestaurantsAntipastoRed SauceRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Alex Delany"]}