{"id": "c87ccad1a7e612380e895ca8588411bf", "url": "https://www.bonappetit.com/story/how-italian-food-became-red-sauce", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "How Did Italian Food Become “Red Sauce”? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow Did Italian Food Become “Red Sauce”?We asked the Yale historian who wrote the book Ten Restaurants That Changed America.By Paul FreedmanApril 16, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.If chicken parm didn’t come from Italy, where did it come from? Historian Paul Freedman walks us through the three phases that turned Italian food into Red Sauce.The Bohemian Phase Restaurants in major U.S. cities once fit into two categories: fancy French on the high end and dreary workingmen’s hash houses on the low. Then came the 1880s, and with them a massive influx of Southern Italian immigrants. Exotic yet accessible, the restaurants they opened appealed to “Bohemians,” the hipsters of that era. Red-and-white-checked tablecloths gave a soigné-but-informal vibe, as did candles in straw-wrapped Chianti bottles (standard in Italy to prevent the bottles from breaking, perceived as picturesque in the States). From Sodini’s Green Valley in San Francisco to Dante & Luigi’s in Philly, chefs developed dishes that were unknown in the old country. The higher American standard of living meant more meat, so meatballs were paired with spaghetti. Parmesan, formerly a special treat, was now lavished upon eggplant, chicken, and veal dishes.The Spectacle Phase Italian cuisine became so popular post–World War I and through the 1970s that it spread beyond the artsy crowd and out to moderately affluent suburbanites. This was the era of the Italian restaurant as spectacle: Gargiulo’s in Brooklyn, Miceli’s in Hollywood, and Mamma Leone’s in Manhattan, a palatial establishment that redefined the meaning of oversize portions (the antipasti alone consisted of a dozen plates) and where thousands of customers ate every day. Instead of the romantic ambiance of the Bohemians, the spaghetti palaces of the mid-20th century were celebratory, appealing to families and stars alike. When the entranced public blew kisses to Liberace at a table in the middle of Mamma Leone’s in 1956, it nearly caused a stampede.The Regional Phase In the 1980s, as Americans became more well-traveled and developed more sophisticated palates, a third era of Italian restaurants emerged. Regional Northern Italian food replaced the Neapolitan and Sicilian cuisine of earlier immigrants. Pioneering New York restaurants like San Domenico, Da Silvano, and Lidia Bastianich’s Felidia offered a more refined environment with prices to match: In place of Gonfarone’s multicourse meal for 50 cents, there were white truffles, shaved over almost anything, for a $200 supplement. The prominence and prestige of this “authentic” cuisine tagged the older Southern Italian types with the affectionate if dismissive term “red sauce restaurants.”Explore Bon AppétitRed SauceRestaurantsItalian AmericanRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Paul Freedman"]}