{"id": "c886c9abcdac816a3ac46b340611f628", "url": "https://www.bonappetit.com/story/frozen-hash-browns", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "How to Use Frozen Hash Browns in Place of Peeled and Shredded Potatoes  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking5 Very Smart Ways to Use Frozen Hash BrownsWhen you just can't deal with scrubbing, peeling, grating, or boiling. By Priya KrishnaFebruary 28, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailA few years ago, I was at my aunt Guna’s place for dinner. She was making masala dosas, and I was saddled up at her kitchen counter, totally mesmerized as she spread batter on a tawa, forming it into thin circles. When it was time to make the potato filling, instead of grabbing potatoes, she went to the freezer. She took out a bag of hash browns, tossed them in a pan with some spices, and stuffed them inside the dosa. She told me that frozen hash browns are her trick for when she’s short on time and doesn’t feel like waiting for potatoes to boil. It was brilliant.I love a potato. It absorbs flavors beautifully, is a great thickening agent, and can be eaten in myriad formats. But I don’t love all the time I spend scrubbing, peeling, grating, and boiling them. Frozen hash browns eliminate all of that effort, as they come pre-peeled, shredded, and frozen for convenience. They also last a loooong time in the freezer and they require no extra chopping or prep. In essentially any dish that calls for peeled and prepped potatoes, you can (and should) use frozen hash browns. Thaw them in the fridge or the microwave, then squeeze out their moisture for optimal texture and use them in these five ways:In fritters: Combine hash browns, a small scoop of flour, and a big pinch of salt in a bowl. Add an egg or two (enough to bind the potatoes and flour together), plus any finely chopped herbs, onion, and/or garlic. Form the mixture into small pancakes, and fry in a pan on medium heat filled with a little pool of oil, flipping once, until both sides are crispy.In a cheesy casserole: In a casserole dish, combine thawed hash browns with chopped sautéed vegetables (onions, bell peppers, zucchini, and mushrooms all work great as long as you don’t overcook ’em—you want them to be a little al dente), a firm grated cheese (cheddar, Gruyère, Swiss, low-moisture mozz), enough cream or broth to just cover the potatoes, salt, and any other herbs or spices. Bake at 350° F for 25 to 30 minutes, until bubbly, and if you want, sprinkle some more cheese on top, turn up the heat and switch the oven to broil until the cheese is melty and browning.In sabzi: In a medium pan, add oil or ghee, plus a pinch of mustard seeds and a handful of curry leaves. Once the spices have toasted and the leaves have crisped, add a pinch of turmeric, one chopped yellow onion, hash browns, salt, and red chile powder. Let it all hang out in the pan for a few minutes, stirring occasionally, until the potatoes are fully cooked and bright yellow from the turmeric.In soup: To thicken a soup, add frozen hash browns as you're simmering (I love this trick for any kind of squash or carrot soup!), then blend away. The starches in the potatoes will help the soup get luscious and creamy, no heavy cream necessary.Of course, you could also just follow the instructions on the back of the package and make hash browns out of frozen hash browns. But where’s the fun in that?Explore Bon AppétitPotatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-28", "author": ["Condé Nast", "Priya Krishna"]}