{"id": "c888955d3f1711220d99d5327b2eb04f", "url": "https://www.bonappetit.com/story/chinese-preserved-plums-huamei", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Chinese Preserved Plums Are the Cure for What Ails You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingSour, Salty Chinese Preserved Plums Are the Cure for What Ails YouSnack on ’em, cook with ’em, and pop one when you’re feeling carsick.By Connie ChangOctober 19, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Whenever I begged for candy while growing up, my grandmother would offer me a wrapped preserved plum from the stash in her purse instead. Or if we were at her house, she’d retrieve one of the dried varieties from the plastic pouches cinched tight with rubber bands that lined her pantry shelves. I loved them so much that I’d almost forget about the chocolate I’d been craving.Sour and salty and sometimes sweet, preserved plums pack a wallop of pucker-inducing flavor. The most basic iterations contain just salt and sugar, while other varieties are marinated with top notes of licorice, cloves, and citrus. They come in two forms: The drier, saltier, and much tarter incarnation is called 話梅 (huamei) in Mandarin or 旅行梅 (li hing mui) in Cantonese. According to Hanson Li, cofounder of Lazy Susan in San Francisco, huamei lovers “almost treat [them] like gum, sucking and chewing on [them] for a long time.” 陳皮梅 (chan pui mui) is the more kid-friendly version—a fleshy, sticky-sweet confection about the size of a large gumball that comes wrapped in wax paper.Chan Pui Mui (Sweet Preserved Plums)$14 at Amazon$5 at Weee!Half snack, half cure-all for whatever ails you, preserved plums—particularly the dried varieties—can help with everything from combating nausea to stimulating the appetite. George Chen, founder of China Live in San Francisco, remembers the nausea cure well: “When we would go on car trips with my dad and some of us kids would get carsick, my mom would say, ‘Eat a huamei!’” And when I was pregnant with my first child, huamei kept my first-trimester nausea at bay.Huamei’s vibrant flavor also imparts extra oomph to cooked dishes. My grandmother—a native of Hunan, a region known for its spicy and sour dishes—combined Chinese dried plums with soy sauce, ginger, sugar and chile for an umami-infused glaze that she brushed onto proteins as varied as spareribs, fish, and chicken. At China Live, Chen features huamei in the restaurant’s most popular vegetarian entrée—Sichuan Blistered Green Beans. “It has this wonderful tanginess, like tamarind or hawthorn,” Chen says. “It balances the other flavors out.” Li compares it to the preserved lemons used in Mediterranean cuisines: “I’ve squished it in hot water to get a flavored tea and grated it like you would lemon zest.”Huamei (Sour, Salty Preserved Plums)$7 at Weee!Iterations of preserving stone fruit like this abound across different cultures and reflect its universal appeal. Huamei is similar to Mexican chamoy, for example, which historians believe was brought over from China and gained a foothold after hundreds of years. Hawaii and Japan have their own versions (and accompanying rabid fan bases) as well. But for me, the sweet, sticky orb, carefully liberated from its crinkling wrapper and inner square of plastic, just tastes like home.Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Connie Chang"]}