{"id": "c8891ed930349ae8482383a98baf5c0f", "url": "https://www.bonappetit.com/story/onda-restaurant-newsletter", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "Our October Digital Cover: Jessica Koslow, Gabriela Cámara, and Their Megawatt New Restaurant, Onda | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleOur October Digital Cover: Jessica Koslow, Gabriela Cámara, and Their Megawatt New Restaurant, OndaEditor Amanda Shapiro unveils Healthyish's first-ever digital cover.By Amanda ShapiroOctober 29, 2019FacebookTwitterEmailFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Two megawatt chefs; one hotly anticipated restaurant; all kinds of delays, snafus, and unexpected moves. Ever since we launched Healthyish, I’ve wanted to run a story like this.For Healthyish’s first digital cover, we headed to Santa Monica, where Gabriela Cámara and Jessica Koslow have been hard at work opening their Mexican-influenced, seafood-forward restaurant Onda. Writer David Tamarkin followed their progress from June through the restaurant’s opening (last night!), and had this to report:Onda's corn nuts are tossed in lacto-fermented jalapeño-sauerkraut salt.\nPhoto by Dylan + JeniOnda translates to English as “wave,” and Cámara and Koslow are quick to say that the name, in part, refers to them being on the same wavelength. But they named the restaurant before the real work began, before they knew how much they could get hung up over a fritto misto. “Gabi’s food is elegant and clean and minimal,” Koslow says. “Mine can be technical and heavy.”This is the story of how two distinctive cooking styles—and two equally distinctive personalities—have come together to try to create what Koslow calls “a new food for Los Angeles.” Onda isn’t like Sqirl, Koslow’s defining Silver Lake cafe, nor is it like Contramar, Cámara’s destination restaurant in Mexico City. So, as Tamarkin asks: “What kind of restaurant—and whose kind of restaurant—will Onda be?”It’s a question that is, of course, impossible to answer on the restaurant’s second day. But in trying, Tamarkin reveals a lot about these two high-powered chefs who’ve built global careers by having uncompromising visions, and the struggle of merging those visions under one very sleek, sun-soaked roof.I hope you’ll read and share.Onda's 120 seat dining room is just a few blocks away from the beach\nPhoto by Dylan + JeniAnd while we’re talking L.A., Healthyish will be there in just a couple weeks for Mercado Sagrado! I’ll be leading a panel called “How to Feel Good About Feeling Good” with some very exciting guests, and we’ll also be selling some sweet Healthyish and Bon Appétit merch: pins, t-shirts, and a few swank, limited-edition totes that I can’t wait that I can’t wait to share. Get your tickets and we’ll see you there on November 16th and 17th.Until next week,Amanda ShapiroHealthyish Editor\\Explore Bon AppétitHealthyishessayRead MoreLifestyleRunning a Restaurant Is Hard, Chef Partnerships Are Even Harder. Can Onda Get It Right?By David TamarkinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-29", "author": ["Condé Nast", "Amanda Shapiro"]}