{"id": "c891cf312c50b89f5796aa0dc18e0b75", "url": "https://www.bonappetit.com/story/shikanji-salty-limeade", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Shikanji, aka Salty Limeade, Gets Me Through Scorching Dallas Summers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingShikanji, aka Salty Limeade, Gets Me Through Scorching Dallas SummersMy dad calls it “Indian Gatorade” for a reason.By Priya KrishnaJune 13, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Anna Stockwell, Prop Styling by Mathea MillmanFacebookTwitterEmailThe first time I heard about putting salt and pepper in limeade, I was skeptical.It was a scorching summer in Dallas, I was about 7, and my dad and I were doing our usual routine of going to the local library, and then picking up the famous homemade limeade from Braum’s—a regional ice cream chain known, surprisingly, more for their icy beverages than their hard-packed ice cream. Whenever I’d go through the drive-thru with my dad and we’d rattle off our usual order from the air-conditioned comfort of our Honda Odyssey (limeade for me, limeade and chocolate chip cookie dough ice cream in a cone for dad), he’d tell me about how I needed to try shikanji, the salted limeade that he grew up drinking during scorching summers in India. He’d point out how much better it was than any sort of warm-weather drink he’d ever tried in the U.S. “Like Indian Gatorade!” he’d always say. I’d scoff, as I chewed on the tart, limeade-coated ice granules from my super-sized foam cup. Salt in limeade? Yeah, right.And then a few summers later, I tried it at my dad’s cousin’s place in Lucknow, a city in Uttar Pradesh. It was 100 degrees, and we had just arrived, completely dehydrated and drenched in sweat after an hours-long train ride with zero air conditioning. My cousin greeted us with a tray replete with glasses of shikanji. The drink was nothing more than loads of lime, ice, a touch of sugar, salt, and my dad’s family’s secret ingredient: a boatload of ground black pepper. At first sip, it was alarmingly savory—not what you’d expect from a summer cooler. But then I kept sipping, and couldn’t stop. The salt and pepper played similar roles that they do in any dish, enhancing the existing flavors, without being overwhelming, and they had somehow super-charged the limeade. It felt more refreshing, more thirst-quenching, more interesting as a drink. I downed the glass and immediately asked for another. I remember very little about that cousin’s house—I think it was all white and smelled of aloo bhujia? —but that shikanji was hard to forget.Since that trip to Lucknow, my dad has made shikanji on the regular back in Dallas, particularly during those dry, searing Texas summers. He squeezes the juice out of about 6 or 7 limes with a citrus press, and adds it to a blender along with double the water, ice cubes, around a ¼ cup of sugar, and about a teaspoon each of salt and pepper. My dad always tosses in an extra spoonful pepper because the man goes through more of those large, plastic CostCo Kirkland Signature pepper grinders than any household ever should. We actually got into a big fight when we were shooting the photographs for my cookbook at our home in Dallas, because he thought I was perennially skimping on the pepper in the shikanji. But trust me: start conservatively, and you can always add more.He blitzes all those ingredients together until a foamy layer forms at the top of the blender, pours it over ice in heavy beer steins (my dad’s preferred vessel for drinking just about anything), and garnishes the glasses with—what else?—even more ground pepper. When my brother-in-law, David, is in town, he will take the leftover shikanji and use it as a base for margaritas. I strongly recommend doing this.For me, shikanji symbolizes summer more than a drippy popsicle or an ice cream cone or a slice of sweet watermelon. I now completely understand what my dad meant when he called it “Indian Gatorade.” Shikanji sends this sodium-laden, electrolyte-like jolt throughout my entire body. It’s the liquid version of standing directly in front of your blasting air conditioning unit during July in New York. And I would totally dump an entire water cooler of the stuff over my head after a football game.Priya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.Another way to cool off:Explore Bon AppétitSummer DrinksLimeIndianishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-13", "author": ["Condé Nast", "Priya Krishna"]}