{"id": "c8994cd5315f62e640fb7c0a363a4cc7", "url": "https://www.bonappetit.com/recipe/pretzel-bites", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Pretzel Bites Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssuePretzel BitesBy Kat BoytsovaJanuary 25, 20183.6(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintThese pretzel nubbins are crunchy on the outside and soft and chewy on the inside. Instead of using lye, which can be hard to find and work with, we achieved the deep mahogany color by boiling them in a baking soda bath. Make sure you serve them with our Spicy Cheddar Cheese Spread; we also love this German mustard in a tube.IngredientsMakes about 642tablespoons unsalted butter, cut into pieces, room temperature, plus more for greasing1¼-ounce package active dry yeast (about 2¼ teaspoons)1tablespoon dark brown sugar3¼cups (or more) unbleached bread flour½cup cold pilsner-style beer2teaspoons kosher salt¼cup baking sodaVegetable oil (for greasing)1large eggCoarse kosher salt, pretzel salt, everything seasoning, paprika, caraway seeds, and/or poppy seeds (for topping)Spicy Cheddar Cheese Spread and/or mustard (for serving)PreparationStep 1Grease a very large bowl with butter. Pour ½ cup warm water (100°–115°) into the bowl of a stand mixer. Sprinkle yeast over. Add brown sugar and stir to dissolve. Let sit until foamy, 5–7 minutes.Step 2Stir in bread flour, beer, kosher salt, and remaining 2 Tbsp. butter with a wooden spoon or spatula until a shaggy dough forms. Mix with dough hook on medium-low speed until dough forms into a smooth ball, about 2 minutes. (You might need to help dough form into a ball by scraping up some flour from bottom of bowl with your hands.) Dough should be firm and might be a little tacky, but not sticky. If dough is still sticky, add flour 1 Tbsp. at a time, mixing until smooth. If dough is too dry, add warm water 1 tsp. at a time. Continue to mix on medium-low speed until dough is smooth and elastic, 5–7 minutes. (Alternatively, mix dough ingredients in a large bowl, then turn out onto a clean work surface and knead by hand, about 10 minutes.)Step 3Transfer dough to prepared bowl and cover tightly with plastic wrap. Let rise in a warm place until doubled in volume, about 1½ hours.Step 4Place racks in upper and lower thirds of oven; preheat to 500°. Turn out dough onto a clean work surface and punch down to deflate. Divide into 8 equal pieces (if you have a kitchen scale, weigh the dough before cutting, then divide by weight; otherwise, eyeball it). Working with 1 piece at a time and keeping remaining dough covered with a damp kitchen towel, shape dough into a rope about 12\" long and ¾\" in diameter, applying light pressure with your palms and working from center of dough out to the ends. If you need more friction, lightly spray work surface with water.Step 5Cut rope into 8 pieces about 1½\" long. Arrange on 2 rimmed baking sheets, spacing ½\" apart. Repeat with remaining pieces of dough. Cover with plastic wrap and let rise at room temperature until increased in size by about half, 20–30 minutes.Step 6While dough pieces are going through second rise, bring 8 cups water to a boil in a large pot. Carefully add baking soda, which will bubble violently.Step 7Using a large spider and working in 2 batches, gently dip dough pieces into boiling solution. Cook, turning, until pieces are fully coated, about 20 seconds. Using spider, remove from liquid and drain on paper towels. Divide between 2 lightly oiled rimmed baking sheets, spacing at least 1\" apart.Step 8Beat egg with 1 Tbsp. water in a small bowl, then brush dough pieces with egg wash. Sprinkle with toppings. Bake pretzels, rotating sheets from front to back and top to bottom halfway through, until deep brown in color, 8–12 minutes. Let cool slightly.Step 9Serve pretzel bites with cheese dip and/or mustard alongside.Step 10Do Ahead: Pretzel dough before rises can be made 1 day ahead. Wrap in plastic and chill. Let come to room temperature, then let rise in a warm place until doubled in volume, 3–4 hours.How would you rate Pretzel Bites?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThis recipe was super simple and a crowd pleaser. I had to add one to two tablespoons of water as I was blending the dough but they came out perfect. I topped with everything bagel seasoning. Pro tip: wrap the pretzels in a kitchen towel when they come out to stay warm Tay Bozo NJ 2/7/2021This came out great!  Don't know how the complaining half-wits made it so wet, likely don't know what baking soda is and used Pepsi.BillDenver, CO2/6/2021I made this recipe several times last year and turned out fine every time. Tried making it today and it seems the recipe was altered - maybe an issue in website migration? It's so wet it's not even funny. I had to add in an extra cup or so of flour to even get the dough workable - BA, please re look at this as it used to be fine and is now completely unusable!Sea Salt + ParmBoulder, CO11/22/2020This recipe is seriously messed up. I've made it before so don't know how they messed it up but if you follow the instructions you make something akin to pankake batter. It is not possible to kneed a liquid. Had to add so much extra flour as to be basically on my own making the dough. WTF ain't you guys a food publication. Stop worrying about how many black people there are in the office and write a recipe that works for God's sake. Topher Denver CO11/22/2020Loved the recipe! Was super simple and came together seamlessly. Important note: I followed the other users' suggestions and used only ½ cup water and ½ cup beer to start. I added another tablespoon or two of water, but it didn't need much more than that. They were delicious with a little \"everything bagel\" seasoning!bmacna12Chicago, IL4/29/2020Wish I had read the comments because the dough was so wet -- added at least 3/4 cup of flour to get it to a state that I could work with. Maybe we could get the weight measurement on the flour in case that is the problem? Plan to try again with Just3Jon's suggestion. (By the way, topped some of them with furikake and would recommend that if you want to change things up a bit.)holzhuterMadison, WI3/24/2020I skipped the 2nd rising for the dough part, and everything went well! I rate this 9/10Avag6789Indiana2/29/2020I have made this several times and it does always come together in the end, but the flour to liquid ratio is definitely off. Just3Jon's suggestion is definitely better, and I also had to add ~5tbsp flour. Letting your dough rest for about 10 minutes during the kneading process will also help with the stickiness as the flour absorbs the liquid.  Once you get the dough texture and ratio right, this is a very fun weekend project to make, and they are so delicious!AnonymousAtlanta10/13/2019I have to agree with Pinfeldorf--I tried making this and the liquid ratio is either off or a typo. I proofed the yeast, included the water and beer and it came out like batter, not shaggy dough. I consulted other recipes and they included less water. I used 1/2 cup of water and 1/2 cup of beer and it worked great. just3jonBoston2/3/2019Hi @PINFELDORF, thank you for trying this recipe and sharing what happened with us. We're sorry it didn't work out for you. To help troubleshoot: The first thing that is essential is to proof the yeast—make sure that there are bubbles on the surface of the water. This means the yeast is active and will ensure that your dough will proof and become workable in the later stages. Once you've started to knead your dough for the first time, it's normal to have some flour at the bottom of your stand mixer bowl. At this point you could help work the flour into the shaggy mass using your hands. It might look like something is wrong, but if you keep at it, the butter will begin to homogenize with the rest of the ingredients and the flour will begin to hydrate. Also, when it comes to kneading (whether by hand or dough hook), you must knead for the full amount of time specified in the recipe. This is when it really comes together. Kneading helps build gluten and gives you a smooth, bouncy dough. If you try again, do let us know how everything turns out!Bon_AppetitNew York, NY11/26/2018This is definitely a labor of love, but these came out amazing..followed the recipe to the T. The only problem with them is I can't stop eating them...AnonymousTampa, FL10/7/2018I would like to thank this recipe for wasting 45 minutes of my Saturday afternoon.  The recipe here calls for a half a cup of water at the first stage, which leaves you with an absolutely untenable product.  This was my first baking project after getting my brand new stand mixer, and I have to say, an error that egregious has put me in a position where I cannot trust any recipes on this website.  I have no idea if any of them have been proofread for mistakes as glaring as 1/2 cup instead of 1 1/2 cup.PinfeldorfTucson9/8/2018Explore Bon AppétitBread FlourFlourKaleLeafy GreensVegetableYeastOther IngredientsSnackStarterVegetarianBakingSuper BowlFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-25", "author": ["Condé Nast", "Kat Boytsova"]}