{"id": "c8a28d08ab0fc6f07032eb4256b97774", "url": "https://www.bonappetit.com/story/its-good-to-be-back", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "It's Good to Be Back | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIt's Good to Be BackSeptember goals, updates, and more from Healthyish editor Amanda Shapiro.By Amanda ShapiroSeptember 5, 2019FacebookTwitterEmailPhoto by H. Armstrong RobertsFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Hi there, remember me? I love turning over these newsletters to the Farmers’ Market Challenge every August...but I really love coming back in September and writing them again. It feels right, like shaking out the sand from your totes and your shoes and opening to the first page of a fresh notebook.I didn’t mean to set goals for the fall. It happened as subtly as the days have gotten shorter. But that’s how I always end up making changes: by drifting like a piece of Coney Island beach trash until I hit some shore.And I think September is a better time than January to make resolutions anyway. Everything’s hard in January. It’s cold. You’re probably hungover. September, on the other hand, is full of potential. You’re sunsoaked and calm and clear-headed—or you’re also hungover, but you’re in a better mindset for starting new habits (like writing in that fresh notebook).So in that spirit, here’s what I’m committing—and re-committing—to this fall:Budgeting. Ugh, I know. You’re like, “But what about grown-up fun?!” And I’m like, I hear you, but you can’t drink the water if the well is dry. So I’m getting an app, either YNAB or Mint. Which one should I subject myself to?Brain organization. I always thought of myself as an organized person, but I recently realized that arranging your pot lids from smallest to largest doesn’t make you organized, just slightly neurotic. My first step toward actual, big-picture organization has been to take the many to-do lists scattered across my digital and physical spaces—from desktop Stickies to the Post-Its on my kitchen counter—and put them all into Trello. I won’t bore you with a rundown of my whole system, but I have Trello boards for both work and life, and so far it’s made me more productive and way less overwhelmed.Exercise...but better. I haven’t had much of a workout routine since I hurt my back last winter while training for a half-marathon. In hindsight I think I was pushing myself toward a goal that wasn’t right for me at the time. Now that I’m finally able to run again, I’m reminding myself to do it for the right reasons (how good it feels!) and not some arbitrary endpoint.Keeping Healthyish fun and awesome. We’ve been working on some really exciting projects for this year and beyond, and I’m very psyched to start rolling them out. First up: Healthyish is heading to Portland, OR for Roux, a festival for and about women in the food and beverage industry. I’ll be there, moderating a panel and hanging with some of our favorite ladies, including Kia Damon, Dana Frank, Caitlin Hata, Sue Chan, and Sana Javeri Kadri. Get your tickets and I’ll see you there.And until then, here are a few stories you may have missed while you were busy cooking that eggplant with ground pork:~ Einat Admony on turning her life as a chef and mother into material for the comedy stage~ What happens to your brain on diets like Whole30 and paleo~ A search for better posture becomes a lesson in self love~ Interviews with not one but two amazing wine women: “recovering perfectionist” Martha Stouman and O.G. natural wine importer Jenny Lefcourt~ The recipes that Bon Appétit staffers rely on to use up all the stuff going bad in their fridges.I’d love to know about your fall goals and how Healthyish could help you this season. Is there a recipe you’d love to see or a story you want us to cover? Tell me about it: healthyish@condenast.comUntil next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleA Summer MixtapeBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-05", "author": ["Condé Nast", "Amanda Shapiro"]}