{"id": "c8a90b78c84ff5d0b347e5d55f1e7bc2", "url": "https://www.bonappetit.com/story/kontozisis-greek-wine", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "If You Try One Greek Wine This Fall, Make It This | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIf You Try One Greek Wine This Fall, Make It ThisIf the only Greek wine you've had is Assyrtiko, you're missing out.By Marissa A. RossAugust 28, 2019FacebookTwitterEmailIllustrations by Katie BennFacebookTwitterEmailIn Unfiltered, Bon Appetit's wine editor Marissa Ross shares her latest favorite bottles and—you guessed it—unfiltered thoughts on natural wine.Chances are you’ve either never had Greek wine or you’ve had Assyrtiko. The white wine originally from Santorini is the wine equivalent to the island’s starkly contrasted white walls and blue roofs—it’s one of the only things Americans see. Hell, it was the only Greek wine I really knew before going to Greece this summer, and I’m not going to lie...I was expecting the highlight of my trip to be sipping Assyrtiko on some pristine beach, hypnotized by a gradient of teal waves. Instead, it happened on a hillside in the tiny village of Kanalia, where I was surrounded by bottles of the indigenous Greek red Limniona instead of the sea.After traversing the Pindus mountains from the Oracle of Delphi, I found myself in the northeast of mainland Greece. Kanalia is perched in the hills of Karditsa and is touted as the balcony of the region of Thessaly below. I hopped off the bus in the town’s small square and found myself on what could have just as easily been the set for a film whose elevator pitch was, “It’s like Fellini meets Amelié,” as it could have been any real place. (I realize neither are Greek, but the electric blue Vespas casually parked under staircases overflowing with potted perennials and fountains that loud Americans can get in without being arrested [but are warned not to drink from because you will fall in love] left me no choice.) The whole town seemed closed aside from a café along the single cobblestone street that stitched the sloped dwellings together. It was empty inside, but outside, a long table was full of bottles from Kontozisis.Kontozisis is the project of winemakers and partners, Andreas Kontozisis and Aphrodite Tousia. The young couple, and my hosts for lunch, organically grow and vinify their wines in Karditsa. We had a classically long European lunch, discussing hand-harvesting while bottles of Greek varieties I’d never heard of were passed hand over fist. Eventually, I was poured a glass of their “A-Grafo” Limniona, an indigenous grape the young pair are particularly passionate about. I quickly understood why.The Kontozisis “A-Grafo” Limniona is a dark red—nearly oxblood—that shines with hints of violet like an oil slick. It smells like a pine tree dripping chocolate resin down its crackled bark, as its green needles rustle in a juniper-blackberry breeze. Or black olives. OK, both. It definitely tastes like all of it; juicy but savory with sticky tannins. It’s the kind of wine you want to stay up with. You don’t want to party with it. It’s not for chugging, but you will want to sit with it longer than you should, maybe settled into a corner of the couch while swirling and casting glances. It’s an intimate wine; the kind that turns even the best of us into “close talkers,” the kind of wine that might make you nuzzle into a neck by the end of the night.Or in my case, become enamored with your own personal European sound stage, low-key pretending you’re Sylvia from La Dolce Vita and performing a showing of “Amelié: The One Woman Show: The Musical” to an audience of confused village elders. It was one of the best times of my life.There are only so many French wines you can drink before you start chasing that feeling those bottles gave you after you had grown tired of California Cabernet.I thought about that day and that wine a lot when I returned home. In the way a $5 bottle can taste like a million bucks when you’re camping with your buddies, a wine that tasted phenomenal while you were frolicking through a town like some Diane Lane character could very well taste mediocre back home. I got another bottle of the “A-Grafo” and drank it in my scientifically controlled environment: My living room. It was July and a super comfy 91 degrees, and a 14% ABV wine was honestly the last thing I wanted to drink.Yet I enjoyed it just as much as I had in the picturesque Kanalia, although not for the same reasons (not enough fountains in my house, tbh). At home, the “A-Grafo” Limniona excited me not only because it was once again as fresh as a forest in a morning dew dripping of red berries, but because it reminded me of how much I love discovering and drinking and learning about varieties I’d never heard of in places I’d never been before. That’s why we all get into wine, isn’t it? To be surprised and delighted by what is in our glass? And if you don’t love drinking wine for those reasons yet, I suspect you will. There are only so many French wines you can drink before you start chasing that feeling those bottles gave you after you had grown tired of California Cabernet.Assyrtiko and Limniona are only two of Greece’s seventy-seven varieties. I dipped into Malagousia, Roditis, Muscat of Alexandria and Limnio, and so many more over my ten-day trip through the country. But skimming your toes along the tide is not the same as diving in. Next time I go to Greece, I won’t be looking forward to sipping Assyrtiko along the shore but jumping straight into the deep end of the country’s lesser-known grapes. There is a whole ocean of Greek wine to explore—and to be excited about—whether you’re starring in your own Mediterranean dramedy or just hanging on your couch.Explore Bon AppétitHealthyishUnfiltered natural wineessayRead MoreLifestyleThe New Burgundy Wines Are Not as Bougie as You ThinkBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-28", "author": ["Condé Nast", "Marissa A. Ross"]}