{"id": "c8ad2a38536a5d540274c3d2933d4330", "url": "https://www.bonappetit.com/story/tofu-skin", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "What Is Tofu Skin? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTofu Skin Is a Textural Delight of Rich Soybean-y FlavorTo know tofu skin is to love tofu skin.By Jessie YuChenJanuary 27, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowellFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Having grown up in Taiwan, a country deeply influenced by Japanese and Chinese cultures, I eat a lot of tofu skin. Along with Buddhism, tofu skin is an essential part of Taiwanese food culture, and you can find it nearly everywhere you look, from street food vendors to restaurants to food halls to grocery stores. I’ve been enjoying this delicious plant-based protein, which is everyday fare throughout East and Southeast Asia, in hot pots, stir-fries, and even cold salads since well before I knew that a vegan diet was a trendy thing.So what is tofu skin?Tofu skin, or yuba in Japanese, is actually the skin of soy milk (that’s right: It isn’t the skin of tofu itself, though it is often a by-product of the tofu-making process). It’s made by removing the rich, fatty film of coagulated proteins that forms on the surface of heated soy milk, then drying and processing it into different products. As cookbook author Andrea Nguyen has described it, tofu skin can be “ethereal tasting, a pure expression of the soybean.” If it starts with soy milk that’s “super rich and thick (think half-and-half or cream), the skin is very fatty, supple and sublime.”Where did tofu skin come from?No one knows exactly how tofu skin came to be, but one legend states that in imperial China, a tofu maker noticed the skin that formed on soy milk when heating it up to make tofu. Out of curiosity, he carefully lifted it to dry and created the first sheet of tofu skin. Tofu skin rose to popularity during the Tang Dynasty, when it was used to make products that mimicked the texture of meat for vegetarian Buddhists. (You might think of it like plant-based meat that was many, many years ahead of the Impossible Burger.)As Buddhism spread across Asia, tofu skin came with it. It became an especially important part of Japanese Buddhist cuisine (Shojin Ryori), as well as a common ingredient in everyday Japanese food. Not only can you find tofu skin in many Japanese stores and restaurants, but there are also restaurants devoted to it entirely. What are the different types of tofu skin?Over the thousands of years of its history, people have come up with lots of creative ways to shape and form tofu skin for different purposes. These are some common forms of tofu skin you might spot in your local Asian market or in online stores:Fresh sheets: Fresh tofu skin sheets are silky, nutty, and creamy with a firm bite. They can be cut into strips like noodles or added to your favorite soups, salads, or stir-fries.Fried rolls: Fried tofu skin is like a sponge with bubbles of air pockets that will soak up all of the flavors of soups and sauces. It’s a must-have hot pot ingredient.Large sheets: You might have tried this when you dined at your favorite dim sum spot. It is often used as a wrap for stuffed bean curd rolls that are fried and/or steamed to perfection. You can use them as wrappers for spring rolls as they can be fried, steamed, or poached.Tofu sticks: This might be my favorite form of tofu skin! Called bamboo sticks in Mandarin because of their stick-like shape, these are purposely “textured” with folds and wrinkles. They are amazing for hot pots, soups, stir-fries, or braises, in which they absorb the flavor of the broth. You can find them in different lengths, both fresh and dried. The fresh ones are ready to use, with a silky texture and a cleaner taste. The dried ones take a while to rehydrate and have a slightly inferior texture but a longer shelf-life.Kumiage yuba: This is considered a delicacy, made with just the top layer of soy milk and often served with extra care. Think of a creamy burrata, but lighter. Enjoy it like sashimi with soy sauce and a dash of wasabi.Photograph by Isa ZapataFresh Yuba (6 Pack)$45 at HodoWhy tofu skin?Tofu skin is like a concentrated version of tofu—it’s higher in protein with a rich soybean-y flavor and a comforting texture. A popular staple for over a thousand years in Buddhist cuisine, it’s versatile enough to incorporate into any plant-based diet. Even though I eat meat, I sometimes find myself laser-focused on the tofu skin in a hot pot restaurant, especially when there are more than two kinds on the menu—I must have it all!If you’re new to the yuba-verse, start with my recipe for Tofu Skin Noodles with Nut Butter Sauce. Fresh yuba slices are blanched in boiling water to soften their texture and accentuate their flavor, then used as a topping for saucy, creamy noodles. Consider it your tofu skin gateway.Get the recipeCreamy Sesame Noodles With YubaRibbons of protein-packed fresh yuba, or tofu skin, add a delightfully bouncy texture and nutty flavor to these quick, creamy vegan noodles.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-27", "author": ["Condé Nast", "Jessie Yuchen"]}