{"id": "c8c7dc4ed51a33f0cbd1209bd20c4eff", "url": "https://www.bonappetit.com/story/wylie-dufresne-egg-sandwich-du-donuts", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "How to Make Wylie Dufresne’s Scrambled Egg Sandwich | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Wylie Dufresne’s Incredibly Creamy Scrambled Egg SandwichIt's time to start whisking cream cheese into your scrambled eggs.By Wylie Dufresne, as told to Emma WartzmanFebruary 26, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailWylie Dufresne breaks down the expert egg technique behind his grilled cheese-egg sandwich hybrid at Du's Donuts in NYC. It’s the only non-donut item on the menu, so you know it’s gotta be good.My love of eggs has been long and unwavering. I grew up in New York City where the bodega egg and cheese breakfast sandwich is a classic—on a Kaiser roll, of course. That goes back to my childhood. The egg and cheese is also, as you go through your college years, a great hangover helper. Hangovers are not exclusive to New York, but nonetheless.When it comes to the version we do at Du’s, I was imagining a way to make the egg and cheese that would hit all the notes the classic had for me over the years, but in our own voice. We wanted it to be reminiscent of comfort food, but over deliver by hitting the texture and flavor out of the park. This sandwich is delicious first and foremost, but it’s also playful and fun. And you don’t need to have the NYC egg and cheese in your memory bank for it to work.Just look at that cheese oozing out.\nPhoto by Alex LauAt a bodega, the eggs are basically a folded omelet. But I’ve always loved scrambled eggs, too, so in our version we lean towards that.  I was trained in the classic French style, which is to start the pan over very low heat and whisk for a long period of time until tiny curds form. But that method produces eggs so soft they’d be a mess in an egg sandwich.Instead I whisk them from beginning to end so I still get smaller curds but cook them quickly over high heat so they’re firmer and don’t come spilling out of the bread.  Whisking constantly is key. Large chunks or curd of scrambled egg make me think of an unfortunate hotel steam table. The smaller the curd, the more compelling the scrambled egg becomes.When the eggs are scrambled, remove them from the heat and whisk in cream cheese, which ensures they’re incredibly creamy. Cream cheese is a miracle ingredient.To assemble the sandwiches, divide American cheese between 2 slices of bread and top with the creamy scrambled egg mixture. Close the sandwiches, and toast them on a buttered skillet until golden brown, about 3 minutes per side, as you would grilled cheese.Get the recipe:Wylie Dufresne’s Scrambled Egg SandwichAdding cream cheese makes them EXTRA creamy. Trust Wylie. He knows.View RecipeExplore Bon AppétitSandwichScrambled EggsBreakfastRead Morerecipes109 Brunch Recipes Because Leisurely Mornings Are the Best MorningsGallery100 SlidesBy Bon AppétitcookingHow to Make the Absolute Best Scrambled Eggs EverBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-26", "author": ["Condé Nast", "Wylie Dufresne", "As Told To Emma Wartzman"]}