{"id": "c8cbffc07dc682c6b20927a64f3e21ae", "url": "https://www.bonappetit.com/recipe/scotch-bonnet-and-grapefruit-margarita", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "Scotch Bonnet and Grapefruit Margarita Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredScotch Bonnet and Grapefruit MargaritaShake it up with this scotch bonnet grapefruit margarita by BA's Chrissy Tracey—Cointreau, blanco tequila, fresh lime juice, freshly squeezed grapefruit juice, and scotch bonnet paper (or habanero).By CointreauJune 23, 20215.0(1)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintIngredients1.5 oz. Cointreau1.5 oz. Tequila½ oz. Lime¾ oz. Fresh Squeezed Grapefruit Juice1 Scotch Bonnet Pepper or HabaneroSugar or SaltIcePreparationStep 1Place glass in freezer to chill.Step 2Add ¼ cup sugar or salt to small bowl for rimming the glass. Set aside.Step 3Take your pepper and slice it thinly. You'll want 1-2 slices for your drink, depending on your spice tolerance, and 1 for garnish. Step 4Fill a shaker with ice. Add Cointreau, tequila, lime juice, fresh squeezed grapefruit juice, and 1-2 slices of pepper. Shake vigorously, about 30 seconds until shaker gets very cold to the touch. Step 5Remove glass from freezer. In a small bowl, add a little bit of water. Dip the rim of your glass into the water, only about ¼ inch. Swivel the rim generously in bowl with salt or sugar. Step 6Strain your Margarita into a rocks glass or 8 oz. mason jar filled with a few 1-inch ice cubes. Garnish with a silver scotch bonnet pepper and grapefruit. Enjoy! How would you rate Scotch Bonnet and Grapefruit Margarita?Leave a ReviewTell us what you thinkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-23", "author": ["Condé Nast"]}