{"id": "c8de33885067dfaadfae74ad1a27f442", "url": "https://www.bonappetit.com/story/maya-kaimal-sauces", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Maya Kaimal Simmer Sauces Satisfy Even My Pickiest Kids | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIn a House of Picky Eaters, These Jarred Sauces Are Always a WinMy four-year-old loves Maya Kaimal's tikka masala….and so do I. By Chris MoroccoFebruary 10, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!I still panic sometimes while cooking dinner for my family. It's not the nervy anxiety that comes with cooking for crowds or large dinner parties, but the grinding dread of coming up with a meal that everyone will eat. A family’s worth of highly idiosyncratic thoughts about what constitutes deliciousness has slowly chipped away at my enthusiasm for cooking at home, where I am in a constant struggle to deliver non-sugar based-calories to small children. The more effort I put into dinner, the higher the potential for emotional free-fall when my 4-year-old won’t touch it. Or touch anything that it might have touched.These days I always try to make something for dinner that I know my kids will eat, but save some energy for working on new dishes that might be more of a stretch for them. That is where Maya Kaimal comes in. Not her, exactly, although I can't think of many people I would rather have cook for me. I'm talking about her eponymous line of wildly flavorful sauces, inspired by her family's versions of Indian dishes originating from various parts of the country. The shelf-stable jars have been a short-cut of mine for years, allowing me to build incredibly rich and complex flavors in my cooking without frankly having to work very hard. At all.I often combine the tangy, tomato-forward tikka masala sauce with boneless, skinless chicken thighs and simmer until they're fall-apart tender. Or I will combine the mellower, richer butter masala sauce with chopped potatoes and green beans and let them stew into a fragrant side dish. My kids are into these milder sauces, which are fantastic at providing tons of flavor without really being spicy, but I'm quietly hoping that I'll be able to increase their tolerance for spicy foods over time. Perhaps in a few years they will graduate to the hot and sour punch of spicy vindaloo, or the chile-forward kick of Madras curry. Who knows. A cook, and a parent, can always dream.Buy it: Maya Kaimal Tikka Masala, $5All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRead MoreLifestyleThis Rosé Vinegar Is a Serious Upgrade at a Miraculous PriceBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-10", "author": ["Condé Nast", "Chris Morocco"]}