{"id": "c8f022fe27fbd9999d801ce8144afe82", "url": "https://www.bonappetit.com/recipe/crispy-smashed-potatoes-and-chickpeas-with-greek-salad", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Crispy Smashed Potatoes and Chickpeas with Greek Salad Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDCrispy Smashed Potatoes and Chickpeas with Greek SaladSponsored by The Spice HunterFacebookPinterestTwitterEmailServes 4 PeopleCrispy chickpeas and smashed potatoes share the plate with lemon-juiced onions, tomatoes, and olives, all balanced by a creamy spread of yogurt. Brought to life with Greek Seasoning, made with oregano, garlic, cinnamon, peppermint, dill, nutmeg, red pepper, and chives. It turns your favorite staples, like potatoes, into flavorful masterpieces.PrintIngredientsIngredients1 1/4 pounds baby potatoesKosher saltBlack pepper1/4 cup extra-virgin olive oil1 cup chickpeas, drained and rinsed (from one 15.5-ounce can)1 cup whole milk Greek yogurt2 teaspoons The Spice Hunter® Greek Seasoning, plus more for serving3 tablespoons fresh lemon juice1/4 cup cherry tomatoes, halved1/4 cup Persian cucumber, chopped1/4 cup red onion, thinly sliced2 tablespoons pitted olives, halved1/4 cup crumbled feta cheeseRecipe PreparationPreheat oven to 450 degrees.In a medium pot, cover potatoes by about an inch and a half of water. Season generously with salt and bring to a boil. Reduce heat and simmer until just cooked through, about 15 minutes, do not overcook. Drizzle a rimmed baking sheet with 2 tablespoons of the oil.  Drain the potatoes and transfer to the prepared baking sheet. Let sit until cool enough to handle, about 15 minutes.On the prepared baking sheet, lightly crush each potato with the heel of your hand until the potatoes are about 1/2-inch thick. Scatter chickpeas around potatoes and drizzle everything with the remaining 2 tablespoons of oil. Season with salt and pepper.Roast the potatoes, flipping the potatoes halfway through, until golden and crisp, about 35 minutes.In a small bowl, combine the yogurt with the Greek Seasoning, and 1 tablespoon of the lemon juice. Season with salt and pepper.In another small bowl, toss the tomatoes, cucumber, onion and olives with the remaining 2 tablespoons of lemon juice and season with salt and pepper.Spread the yogurt sauce on the bottom of a serving platter. Top with the roasted potatoes and chickpeas. Add tomato salad and drizzle with any juices remaining in the bowl. Sprinkle with feta and more Greek Seasoning. Serve.Sponsored by The Spice HunterGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredThe Spice HunterMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["The Spice Hunter"]}