{"id": "c8f85bf6c303811d3245bec690bca7e6", "url": "https://www.bonappetit.com/story/blood-orange-feud", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Happy Halloween to Everyone Except Blood Oranges | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHappy Halloween to Everyone Except Blood OrangesIt’s been a very creepy week here.By Alex BeggsNovember 2, 2019FacebookTwitterEmailPhoto by Alex Lau, Styling by Andy BaraghaniFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Happy belated Halloween!There are shrunken heads and then there are rosy cheeked, wrinkly APPLEHEADS. In the 1960s-70s, carving dehydrated apples into dolls was a niche creepy craft. It takes 3-4 weeks to dehydrate an apple into carveable form, and then you dress it up and get weird. People to this day continue to sell them on Etsy (sorry, and watch out for some problematic heads). There are pamphlets that can show you how to do it, like the one below that was lent to me by Nastassia Lopez and Dave Arnold, the cocktail geniuses of Booker and Dax. Nastassia carved applehead cocktail garnishes recently for a party at the Harry Houdini mansion in Laurel Canyon (fitting) and made some more for Halloween. “Once they’re shrunken they actually look like they have their own personality,” she told me. “People will be like ‘this one looks like Buddy Hackett. This one looks like the night watchman at an animal processing plant. It’s fun.” See?Ahhhh!Want this letter before it hits the website? Sign up for our newsletter!Speaking of nightmaresCrying emojiWe saw your Bon Appétit Test Kitchen Halloween costumes and are in AWE. But this tiny Brad with his pickle and knife—winner!Photo by Emily SchultzShe went to WegmansEmily Schultz went to college in Wegmans’ hometown of Rochester, New York, which practically means she majored in Wegmans. So when the giant grocer dropped down in Brooklyn this week like the Wizard of Oz house, she went on opening day to investigate and celebrate. “It was more crowded than Trader Joe’s, but worth it for the Western New York camaraderie,” she said. “It’s really easy to bond over a bad football team and freezing cold winters. I bought the perfectly chewy chocolate chip cookies, but I also LOVE the Wegmans brand radiatore pasta that they call “nugget” pasta. Also they have rotisserie chicken IN A BAG. Their cheese section has over 100 cheeses, and all of the produce was being misted as I walked by so it looked fresh. But Danny [Wegman...the owner], if you’re reading this, we need to talk about putting a sub shop and a better bulk section in this location. I drank a Genny Cream Ale in the parking lot and felt like I was 20 again. All in all, a great day.”She went to breakfastThis week, Sarah Jampel went to a press breakfast in honor of the new cookbook Poilâne: The Secrets of the World-Famous Bread Bakery. The host of the breakfast was Ina Garten! Here’s Sarah’s report: “My husband used to think that Barefoot Contessa was the name of the host who cooked ‘in a garten,’ so I was relieved when she stuck out her hand and introduced herself to me as Ina. That cleared things up. I learned that Ms. Contessa bought her Paris pied-à-terre based on its proximity to Poilâne. I spent the majority of the morning fretting over whether to eat my savory pain perdu with my fork in right or left hand (50:50 chance). Before I left, I snapped a photo of a fellow attendee (it was her birthday) and Ina herself. ‘She makes you feel like you’re the only girl in the world,’ she told me on the subway after.” Thanks Sarah!Unnecessary food meme of the weekPlease keep sending theseUnnecessary food feud of the weekAlex LauBlood oranges: a vampire’s mocktail! In a meeting about an upcoming citrus story, Sarah Jampel had one request: “Please, no blood oranges.” Tell us how you really feel about them, Sarah! “Disappointing to bite into it! Horrible!” She replied. Kate Fenoglio gasped (made that up, I wasn’t there): “I don’t understand this! Blood oranges are my favorite fruit!” She shared a link to Alison Roman’s beautiful blood orange upside-down cake in hopes of persuading us. Kate has Carla Lalli Music on her side: “Love them! They’re rare and fleeting and special and different. Celebrate the season, citrus has peak moments and this is one of them.” Chris Morocco shrugged, “They’re good,” and then showed me the swag he got from an Allure giveaway (dry shampoo!). Molly Baz was chopping celery in a sideways formation that made me nervous, saying that blood oranges “are for aesthetics only—they just sit pretty. I prefer a Cara Cara.” Andy Baraghani seconded the Cara Cara, adding, “Blood oranges got a reputation for being special and delicious, but they’re not. Color wise, yes, it’s supreme. But to me, they have more seeds. And they’re difficult to peel, not juicy enough—” and then he tore into a turkey wing and all conversation ceased. Brad Leone crossed his arms. “Let me guess—Rapo doesn’t like ’em. Well they’re fine, but they’re no grapefruit.” He slapped his hands and carried on his way. “Stupid!” concluded Sohla El-Waylly.How do you feel?Explore Bon AppétitBeggs NewsletterHalloweenRead MorecookingRoasting Pumpkin Seeds Is 100% More Fun Than Dressing Up Like A CatBy Aliza AbarbanelcultureSexy Food Costumes, Ranked By SexinessBy Alex BeggscookingThe Halloween Snack You Should Feed Your Kids Before Trick-Or-TreatingBy Carla Lalli MusiccultureAlmond Joy or Almond Despair?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-02", "author": ["Condé Nast", "Alex Beggs"]}