{"id": "c8f934e88ff9f6eec99e6223390170b8", "url": "https://www.bonappetit.com/story/dinuguan-blood-stew", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "Dinuguan by Any Other Name (Is Still Dinuguan) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDinuguan by Any Other Name (Is Still Dinuguan)My community called this rich stew “chocolate meat,” but I’m proudly using its Filipino name.By Yasmin TayagJune 23, 2021FacebookTwitterEmailIllustration by Lydia OrtizFacebookTwitterEmailAt a family party in the ’90s, a tita served me a startlingly dark stew and told me it was “chocolate meat.” I glared at her with all the irritation a kid could muster, aware of what it really was: dinuguan, a classic Filipino dish of pork meat and innards simmered in vinegar, garlic, and pork blood. I didn’t understand why she was lying to me. It was blood—so what? I never had a problem with this fact, but it seemed like everyone else thought I should.Growing up in Toronto, I often heard Filipino immigrants winkingly refer to dinuguan like my tita did, with coy nicknames. They wouldn’t let their white friends taste without a warning. But I’d spotted these same people at community gatherings, eagerly devouring bowls of their beloved black stew. In Manila, blood-based dishes need no equivocation: On visits with family, I saw butchers handing out blood-filled plastic bags with orders of lechón, or street food vendors grilling betamax—skewered blocks of coagulated blood—over sizzling coals. And dinuguan was ubiquitous, on menus everywhere from the historic Aristocrat restaurant to local karinderias, served piping hot for merienda.Europeans champion their own blood-based delicacies. Across the Atlantic, blood pudding is the black gem in a full English breakfast. Butchers in France hawk boudin noir, Swedes serve blödplattar pancakes with lingonberry jam, and Germany counts blutwurst and “black and sour” schwarzsauer as traditional fare. Even at steakhouses throughout America, diners request their steaks bloody. These dishes are named with unceremonious bluntness. They are what they say they are, and that’s enough. Why couldn’t Filipinos do the same?I wanted to know about the history of Philippine blood-eating, so I did a little digging. Though I encountered plenty of research pointing to Spain’s influence on Philippine cuisine, I struggled to find historical texts that documented the genesis of our blood-based dishes. Several Filipinx recipe and culture blogs referenced a theory: that Spanish colonizers first introduced foods like morcilla sausage after invading the archipelago in the 16th century. Indigenous peoples perhaps then adapted these flavors into dishes that were uniquely theirs. Tangy blood stews known as fritada in Mexico and Guam—other stops on the Galleon trade route—support this cross-cultural origin story. But like others have suggested, I think it’s just as likely that precolonial Philippine cooks had already invented dinuguan to make the most of the jungle’s ample herds of wild pigs.I found it unsettling that our written record and oral history didn’t seem to match up. To get a different take, I reached out to my uncle Claude Tayag, a chef and culinary writer based in our family’s home province of Pampanga. He believes dinuguan likely emerged out of necessity. “Using every part of the animal is an age-old tradition in Filipino cuisine,” he told me. “As a country develops, the upper class of society chooses the lean meat, the clean fillets, and discards the rest.”Impoverished Filipinos, oppressed by Spanish colonial rule for more than 300 years, couldn’t afford the most desirable cuts of meat. Loathe to waste, they made the most of the in-between. Early cooks took the humble offcuts and created dishes resplendent with fierce green chiles, earthy peppercorns, and bouquets of native garlic, transforming undesirable ingredients into the well-loved Filipino food we know today: lungs and hearts for spicy bopis, tripe and sticky oxtails for kare-kare, the fatty head for sizzling sisig, and blood for dinuguan. My uncle serves a regional version of the latter called tinadtad, teeming with chunks of coagulated blood, pork belly, trotters, and intestines in a mouth-puckering kamias broth. Anyone who tosses the innards, he said, is “throwing away the best parts.”After our phone call, I felt like a pressure cooker about to blow. A confusing swirl of pride, sorrow, and rage swelled in my chest, and I burst into tears. Centuries of colonization and white supremacy in the Philippines had warped how we see our food—and ourselves. This extends beyond Spanish rule: When the United States annexed the archipelago in 1898, it foisted American culture upon its inhabitants too. Many would argue this influence continues to dominate today, on the islands and in the diaspora.Whenever my relatives see me feast on dinuguan, they whisper incredulously: “Wow, her taste is so Filipino.” I hope that someday this will no longer surprise them; that they’ll take it for granted that I adore the foods our ancestors wrought.I imagined the aching homesickness that countless immigrant Filipinos experience when they land in a foreign country, and their desire to fit in—if they could just be a little more white. Perhaps they felt that jokes like “chocolate meat,” which made light of the differences that made them unique, would ease their entry into a new society. Internalized oppression, the unfounded belief in the superiority of our white colonizers, fueled by centuries of subjugation, has caused so many of us to lose sight of what dinuguan really is: a celebration of Philippine creativity, resourcefulness, and defiance.When it comes down to it, blood is just a weak yellow broth crammed with cells and flecked red with iron. Humans have evolved to feel shock at the sight of blood because it pours out of us when we’re hurt. But lingering disgust about eating it? I think that’s learned.When I was a kid, my dad cooked dinuguan in the dead of Toronto winters, electrifying our home with its barnyard pungency. I watched as bright scarlet mellowed to deep brown; as blood turned into food. The steaming broth was the color of the earth after a typhoon or the wet hide of an ancient tree. I’ve since devoured many variations, some made with wiggly gelatinous pork, others with funky fish sauce or chewy intestinal frills. Whenever my relatives see me feast on dinuguan, they whisper incredulously: “Wow, her taste is so Filipino.” I hope that someday this will no longer surprise them; that they’ll take it for granted that I adore the foods our ancestors wrought.My dad served dinuguan with pride, so I never felt the need to call it by any other name. Sometimes I make it for myself, the way he taught me. Or I turn to Nora Daza’s Let’s Cook With Nora, arguably the first great Filipino cookbook. Her recipe is straightforward: “Cut beef blood into small pieces. Pour in pork and beef blood, stirring continuously until thick.” Toss in some chopped pig head and a diced pig heart, and dinner is served.In New York, where I live now, I may not see bags of pig blood handed out at the butcher, but Filipino cuisine is finally proliferating—which delights my family to no end. At a recent sold-out outdoor event in the Lower East Side, hosted by the Filipino street food pop-up So Sarap, chefs scooped traditional Philippine braised meat dishes onto soft tortillas, a nod to Mexican cuisine. Behind wide steel pans heaped with fragrant longganisa, tocino, and tapa, an immense cauldron bubbled over a gas flame. When I peered inside, I saw tender strips of pork, lacy intestines, and snappy slivers of pig ear bathed in a deep mahogany sauce. I didn’t need to see the menu, hanging on a sign overhead, to know what it was. But when I looked up, I was exhilarated to see the name dinuguan, on display for all the world to see.Explore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-23", "author": ["Condé Nast", "Yasmin Tayag"]}