{"id": "c8fe775b4927e96785107afe427ba194", "url": "https://www.bonappetit.com/story/salmon-nicoise-salad-weeknight-dinner-party", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "This Salmon Niçoise Salad Is a Weeknight Dinner Party Dunk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Salmon Niçoise Salad Is a Weeknight Dinner Party DunkIt's impressive-looking, healthy-feeling, and fancy-sounding. Tell me: What's not to love?By Sarah JampelJuly 31, 2018FacebookTwitterEmailPhoto by Caleb AdamsFacebookTwitterEmailYou know that Henry David Thoreau quote turned dorm room wall art, “Go confidently in the direction of your dreams! Live the life you've imagined”? (What am I saying: Of course you know it.)I am pleased to announce, dear reader, that I have found the recipe that’s enabled me to go confidently (and sanely) in the direction of the dinner party I’ve imagined. And it's this Summer Salmon Niçoise, our summery, not-so-traditional spin on the classic composed French salad. Impressive-looking, healthy-feeling, and fancy-sounding—what's not love?See, I’ve tried to apply Thoreau’s same philosophy to dinner parties for years now, but without much success. I’d invite friends to come after work on a Friday (eight people for dinner on a weeknight? No problemo!), get groceries on my way home, and start cooking three recipes I’d never tried before at 7:30. By the time the food was ready at 9:30, I’d be exhausted. By the time the dishes were cleaned up and I’d body-slammed my friends out the door, I’d have melted into a puddle on the floor, like something straight out of a cartoon. It was never the elegant, effortless, laid-back, low-key dinner party I’d imagined. Don’t lie to me, Thoreau!But it all changed with this salmon Niçoise. I got home with the ingredients by 6:30 pm and just one hour later, the four of us were seated around the table, waving our utensils like orchestra conductors, and having a “sophisticated” conversation about lord knows what. I even remembered to chill the wine and put on some easy-listenin’ (hey, who says I don’t know how to throw a party?).The magic is in the recipe: While the fish cooks (low-and-slow in a 300°F oven), you’re free to prep the rest of the ingredients. Separate the butter lettuce leaves (anyone who once enjoyed the game of “He loves me, he loves me not” will enjoy this petal-plucking exercise); slice the tomatoes (a serrated knife will help); pit the olives; trim and blanch the green beans; and boil the eggs. (Bonus: Since the eggs and beans are boiled in the same pot, you’ll save time waiting for water to boil and washing dishes.) By the time you’ve whisked together the dressing, the salmon is finished (stick a fork in the thickest part—if it flakes without resistance, it’s ready) and you’re ready to assemble. You won’t know how it happened so quickly: Was it all a dream?Eggs cooked for 8 minutes exactly will have those perfect, cooked-but-not-dry yolks. Swoon.\nTed CavanaughI was so calm (so unlike myself!) that I had time to artfully arrange the flaked fish in a conga line down the salad, nestling the olives, eggs, and all of the snappy vegetables into the lettuce cups before spooning mustardy shallot dressing over the whole shebang. My friends looked on in confusion: “You know we’re just going to mess that up, right?” They had a point, but would that really do justice to such a dignified salad?Even once we ruffled my masterpiece, it was exactly the dinner party I’d imagined. One friend (or should I say “dinner party guest”?) said, and I quote, “This is perfect!” He was referring to the salad, which we finished with not one leaf left behind, but I’ll extrapolate that to the night as a whole. Because you know what Thoreau also said? \"Friends...they cherish one another's hopes. They are kind to one another's dreams.\"(But, P.S.: If you’re not in the business of having random dinner parties on a weeknight, but you are one of those responsible capital-A adults in the business of meal prep, you’re in luck. You can cook the fish, make the dressing, boil the eggs, and prep the veg a day ahead of time. When you’re ready to eat, just lay out those lettuce leaves all decorative like, dollop them with the vinaigrette, and place your toppings. Even if no one is around to sing your praises, you can revel in your own preparedness—a joy that needs no inspirational quote backup.)Get the recipe:Summer Salmon NiçoiseWe love a classic Niçoise salad made with fancy oil-packed tuna, but using warm, slow-roasted salmon instead makes the whole thing feel a little more special.View RecipeExplore Bon AppétitSalmonSaladBasicallySummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-31", "author": ["Condé Nast", "Sarah Jampel"]}