{"id": "c91935aac76a9776e1386430efd26845", "url": "https://www.bonappetit.com/recipe/swirled-sesame-tea-cake", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Swirled Tahini Tea Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueSwirled Sesame Tea CakeBy Claire SaffitzMarch 20, 20184.8(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintOf all the trends we’ve covered, “savory dessert” has always been a hard sell. But the appearance of tahini shortbread cookies, tahini brownies, and halvah sundaes at restaurants helped boost tahini out of the hummus bowl and into the pastry case. And for that, we give thanks. This tahini quick bread recipe will make you a believer too.IngredientsMakes one 8½x4½\" loafNonstick vegetable oil sprayWhite sesame seeds (for sprinkling)2Tbsp. black sesame seeds, plus more for sprinkling1cup sugar, plus more for sprinkling1½cups all-purpose flour1¾tsp. baking powder1tsp. kosher salt½tsp. ground cardamom¼tsp. baking soda½cup plain whole-milk yogurt½cup tahini2large eggs1tsp. vanilla extract½cup vegetable oil1½tsp. toasted sesame oilPreparationStep 1Preheat oven to 350°. Lightly coat an 8½x4½\" loaf pan with nonstick spray. Line with parchment paper, leaving overhang on long sides. Lightly coat parchment with nonstick spray. Sprinkle sides and bottom of pan with white and black sesame seeds and sugar and shake around in pan to coat; tap out excess. Finely grind 2 Tbsp. black sesame seeds in a spice mill, food processor, or blender; set aside.Step 2Whisk flour, baking powder, salt, cardamom, and baking soda in a medium bowl to combine. Whisk yogurt and tahini in another small bowl until smooth (mixture will seize and stiffen at first).Step 3Using an electric mixer on medium-high speed, beat eggs, vanilla, and 1 cup sugar in a large bowl until eggs are pale and thick (use the paddle attachment if using a stand mixer), about 2 minutes. Reduce speed to medium and, with motor running, gradually stream in vegetable oil and sesame oil. Reduce speed to low and add dry ingredients in 3 additions, alternating with yogurt mixture in 2 additions, beginning and ending with dry ingredients. Beat after each addition until fully incorporated. Scrape half of batter into the bowl that held the dry ingredients. Add reserved ground black sesame seeds to the remaining batter and mix on medium speed until evenly distributed—this is your black swirl.Step 4Alternating between batters, spoon large dollops into prepared pan.Step 5Joe WilsonThe dramatic streaks may look like they require artistic talent, but really all you need is a metal or wooden skewer. The key is not to overswirl, which will muddle the two different-color batters into a gray blob. For Instagram-worthy defined swooshes, insert the skewer all the way to the bottom of the pan, then use confident strokes to make up to four figure-eight patterns throughout the loaf.Step 6Sprinkle with more white and black sesame seeds, then with more sugar. Bake until a tester inserted into the center of cake comes out clean, 55–65 minutes. Transfer pan to a wire rack and let cake cool in pan 10 minutes. Run a knife around short sides of pan and use parchment to help lift cake out of pan and onto rack. Let cool completely.Step 7Do Ahead: Cake can be baked 2 days ahead. Store tightly wrapped at room temperature.Step 8Photo by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiRead More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Swirled Sesame Tea Cake?Leave a ReviewTell us what you thinkReviews (37)Back to TopTriangleTurned out so well the first time that I made it again within a week! The second time, I used black tahini in place of the ground sesame seeds, which resulted in a super-dramatic dramatic black swirl. AnonymousBrooklyn, NY11/1/2021Genius. I made the first cut half an hour ago, and two of us have made it through 1/3 of the loaf already. Aesthetically, mine could have been higher-contrast--I didn't get a fine enough grind on the black sesame seeds. Next time I'll use a mortar and pestle to break them down. Still delicious, even with a light-gray swirl!SlighthoundAnn Arbor, MI5/30/2021Made it yesterday and it is already gone. I swear this tea cake os addictive!! So, so good. \nI didn’t add the toasted sesame oil and it still had a prominent sesame flavour and the texture is just incredible. I can’t recommend this enough. DoloresRosario, Argentina5/3/2021This cake is so good-moist, not too sweet, and just a bit nutty. My housemates keep asking me to make it again. It never lasts more than a day in our house. AnonymousBaltimore, MD4/7/2021This pound cake was a great discovery for me and I've made it 3 times so far. The texture is incredible : moist, tender and very soft. Using tahini in pastry opens a door to a new world of flavors (definitely a new ingredient to learn hour to incorporate in your cooking I think). It isn't too sweet but very nutty and flavorful. Cardamom pairs exceedingly well with it ! The cake can indeed be made on Sunday and be eaten for breakfast, desert or coffee through the week without drying out. Will keep on making !Claire SanchezParis, France3/6/2021It was so good!!! I totally recommend, such a new flavor for me aswell!Anonymous12/12/2020I've made it twice already! I used sour cream instead of yogurt. I've done this with 1tsp of sesame oil and no sesame oil (bc I forgot) and it's still great either way! You wouldn't know that you're missing any sesame flavor tbh. I use ~7/8 cups sugar because why not if I can get away with it? No problems at all. And I think using about 40% of the batter for the black sesame will give you a more dramatic end product. Also, my tops started getting a little too dark, so I sometimes tent it for the last 10 min of baking. Careful because it will go from smelling toasty to smelling burnt really quickly. It's definitely more work than a usual loaf cake, but it is so worth it! Anonymous11/11/2020This was so so good! A tad complex for a tea cake, but worth it for the depth of flavor you get. Definitely don't skimp on the sugar/sesame crust, and also don't underswirl like I did. AnonymousPhiladelphia9/24/2020Soooo good! The texture and flavour are mesmerizing...AnonymousCanada6/29/2020My family really liked it but the sesame oil smell and taste is so overpowering, even with the 1.5 tsp that it called for. I personally didn’t like it but I would make it again and would not use the sesame oil and would probably use vanilla yogurt.AnonymousColumbia, SC6/4/2020Due to not wanting to go to the grocery, I skipped the swirl and used sour cream in place of yogurt. This cake has really good sesame flavor and isn't too sweet. Like the name, it is perfect with tea! Mine sank a LOT but I live at high altitude and did make some substitutions so that might have been the cause.  Either way, great recipe.cupcakemuffinDenver, CO5/14/2020Made this with a friend, a week later she requested we make this again because she ate her portion within a matter of days. It's a great balance of flavors - the toasted sesame with sugar makes for a perfect savory cake that pairs well with chamomile tea. What a delightful desert! wangzhou1234Arlington, VA5/13/2020The baking aroma that came off of this cake while in the oven was amazing - it needs to be come a candle scent asap! This was surprising easy to make. I didn't have all the ingredients as I'm trying to make due with what is in the pantry/fridge and it still tasted delicious. Thanks Claire, this one might become a regular in my baking staples.meenak1923Greenville, SC5/12/2020This cake is super tasty and very easy to make. I bloody love Claire Saffitz.AnonymousLondon4/30/2020This is an absolutely delicious cake with a soft, perfectly moist interior. The sugar and sesame seeds coating the crust is a wonderful addition. I highly recommend watching the video on this page where the author of the recipe shows some great techniques.AnonymousChicago4/28/2020Explore Bon AppétitCakeDessertLoaf CakeTahiniCondiments, Sauces & PastesYogurtOther IngredientsSnackBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Claire Saffitz"]}