{"id": "c93a9002e27f3e1992c7dbccd35c99ba", "url": "https://www.bonappetit.com/recipe/classic-coleslaw", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Traditional Coleslaw Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2014 IssueClassic ColeslawBy Hattie B's, NashvilleMarch 17, 20213.8(229)Read ReviewsTriangleEmailPinterestPrintJeremy LiebmanEmailPinterestPrintEmailPinterestPrintActive Time15 minutesTotal Time15 minutesThis traditional coleslaw recipe is the answer to your question, “What can I make that’s crunchy and a little creamy but has enough vinegary pizzaz to keep things light and bright?” This is precisely the colorful and cooling side your hot chicken dinner needs, which makes sense, considering the recipe was created by the braintrust at iconic Hattie B’s in Nashville. It’s packed with shaved and julienned cabbage and carrots (for health!) and dressed in the holy coleslaw triumvirate: apple cider vinegar, honey, and mayonnaise (though you can substitute with tangier Greek yogurt or sour cream if you prefer). And if you want to go all out, be sure to whip up some black-eyed pea salad to serve alongside.Editor’s note: This recipe was originally published August 11, 2016.Ingredients8  Servings1cup mayonnaise1½tablespoon apple cider vinegar1tablespoon honey¾teaspoon celery seeds1teaspoon kosher salt½teaspoon freshly ground black pepper½medium green cabbage, very thinly sliced (about 4 cups)½medium red cabbage, very thinly sliced (about 4 cups)2medium carrots, peeled; julienned or gratedPreparationStep 1Whisk mayonnaise, vinegar, honey, celery seeds, salt, and pepper in a large bowl to combine. Step 2Add green and red cabbage and carrots to dressing and toss to coat. Cover and chill until ready to serve. Do Ahead: Coleslaw can be made 8 hours ahead. Keep chilled.Nutrition Per ServingCalories (kcal) 250 Fat (g) 22 Saturated Fat (g) 3 Cholesterol (mg) 10 Carbohydrates (g) 11 Dietary Fiber (g) 3 Total Sugars (g) 7 Protein (g) 2 Sodium (mg 460How would you rate Classic Coleslaw?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleIt is certainly not racist but it is somewhat ignorant to suggest that this site should tone down recipes that include inspiration from abroad. I mean this site has a French name after all. You should know this is not simply American fare. Yes Coleslaw is now an American classic that was imported from Europe. Who knows what the next American classic will be 200 years from now.... perhaps Dal Palak? This site is intended to open your mind to new culinary options and  for that I am grateful.AnonymousToronto, Ontario11/20/2021Lordy, Lord how woke have we gotten that one cannot say lately we had to much of ethnic recipes without someone thinking it is racist? Calling it racists make that very person one by thinking it only applies to minority of color. I am German one of my girlfriends is Swiss other French as far as I know we are all of ethnicity. Slaw is my favorite I use less mayo sometimes l sub lemon juice for vinegar.Sonja G LarkinDallas, Texas6/22/2021Lordy, Lord how woke have we gotten that one cannot say lately we had to much of ethnic recipes without someone thinking it is racist? Calling it racists make that very person one by thinking it only applies to minority of color. I am German one of my girlfriends is Swiss other French as far as I know we are all of ethnicity. Slaw is my favorite I use less mayo sometimes l sub lemon juice for vinegar.Sonja G Larkin6/22/2021The most recent review is racist BS. So adding this to say you can love a classic coleslaw without having to hate on other cuisines and ethnicities. Cut down the mayo by about 25% if you like things drier. Up the vinegar for a bit more acid. CaseySan Francisco6/12/2021Honestly, I'm just happy to see a down home American recipe. I appreciate the good intentions but all the ethnic variety has been a little much recently......AnonymousSan Diego, CA4/20/2021It's very good and I'll make it again.  However, unless you like your slaw REAL wet I'd say cut the mayo to 2/3 or maybe even 1/2 cup.  Even that'll be plenty to dress it.  And believe me, I love the taste of mayo.  I used half the celery seed.  Good for about two days max; after that it gets very tired and, well, sloppy.  But you knew that.PaulTexas3/29/2021To remaining dollop in mayo jar,I added Dahi,apple cider vinegar,honey,pepper,\nand a stir. Thanks for the nudge!Tana JPennsylvania11/13/2020Thanks for this recipe. I was looking for one to serve at our Super Bowl party. This was a good starting point. I added a little more to my tasting. I used 3/4 cup o mayo & 1/4 cup Greek yogurt.  I added 3 Tbl of apple vinegar & 1 Tbl of rice vinegar. I also added 2 Tbl of honey & 2 Tbl of white sugar. I like my slaw with a little more vinegar with a touch os sweetness. RickFHawaii1/26/2020I love this recipe and so do my kids! It’s crunchy, fresh and I love the apple cider vinegar and celery seed! Give it a try it’ll be a favorite.AnonymousCa12/31/2019I used 3/4 cup of mayonnaise and Rice Vinegar, this was easy to prepare and delicious.  AnonymousNorthampton, MA3/11/2019This recipe is a keeper for me.  I love coleslaw especially with pulled pork.  I did not think there was too much mayonaise, but I do not use commercial mayo; I use a brand that is made with olive oil, mustard flour and other ingredients that one would not find in commercial mayo. Maybe that made a difference for not having too much of a mayo taste. ElliethefoodieNew Jersey3/19/2018A little too much mayonnaise. But over all great recipe.Jack the chef0101lawerance ks3/16/2018Too much mayonnaise flavorAnonymousMiami, FL12/31/2017Explore Bon AppétitSlawSaladCarrotVegetableRed CabbageCabbageLeafy GreensQuickEasySideVegetarianGluten-FreeNut-FreeJuneteenthFourth Of JulyMemorial DayLabor DayLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2014-05-14", "author": ["Condé Nast", "Hattie B'S"]}