{"id": "c93b049d98df9fe3ff5de881a2a044e4", "url": "https://www.bonappetit.com/story/spicy-glazed-shallots", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Chile-Glazed Shallots Are an Ideal Vegetarian Thanksgiving Side  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Thanksgiving Side Is Perfect for Vegetarians and Control Freaks AlikeShould you suddenly find yourself cooking for everyone you know, this hands-off recipe is here for you.By Emily SchultzNovember 16, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailFor a reason I’m still not totally sure of, I decided to host 20 of my closest friends at my apartment for Friendsgiving.And cook everything myself.Being the oldest child, being a stubborn taurus, and working at a food magazine all probably had something to do with it. Not only did I have four dishes to cook, but three vegetarians to please, a VERY tiny oven to manage, and no dishwasher to speak of. So when I saw Molly Baz’s new recipe for glazed shallots with chile and thyme, I knew I had to make these sweet and saucy, extremely hands-off, and totally make-ahead-able flavor bombs.The awesome thing about this recipe is that the shallots get all glazy and wonderful by spending A LOT of time in the oven. Which meant while they were doing their thing, I could chop celery and crush almonds for Josh McFadden’s celery salad, and wash all of the inevitable dishes piling up in my sink. (Again, no dishwasher.)To begin, I peeled enough shallots for a sprint to the bathroom for a quick cry sesh. (It wouldn’t be Thanksgiving without one, TBH.) Then, I added butter to a skillet* (*Dutch oven because I didn’t have a free skillet with everything else cluttered on the stove) and let the shallots bathe in butter until they browned a bit. I added a few sprigs of thyme, red wine vinegar, water, sugar, and pepper. My local grocery store didn’t have red chiles, so I frantically texted Molly Baz (the benefits of working at said food magazine above) about what to replace them with: fresh jalapeño or dried serrano (since that’s what I had in my house). “Fresh jal! Or use dried red pepper flake,” she quickly responded. TYSM Moll, TYSM. I ended up using 2 tbsp of red pepper flakes, which was way too much and made the dish REAL spicy. Word of advice: use more like...1 tablespoon! But again, the magic of being able to control this dish is also controlling the spice level.Then you pop that warm shallot kiddie pool into the oven for about 45 minutes. After the liquid reduced to a sticky glaze and the shallots got all tender and soft, I took them out and transferred them to a glass baking dish. I did this because I needed my Dutch oven to cook in, and because I knew I could gently reheat the shallots in the oven in the baking dish, and then serve them right from there. I know, I’m literally a genius. I also may or may not have had a note on my phone that broke down my cooking times, as well as cooking vessels minute by minute. I looked like this:Anyways, these were a breeze to make, didn’t dirty an insane amount of dishes, and accommodated my veg pals. I plan on making them on days that aren’t just Thanksgiving, and will probably assign them to a friend to make next year, when we do Friendsgiving potluck style instead.Get the Recipe:Glazed Shallots with Chile and ThymeThese sweet and saucy shallots are your best answer to an effortless, plan-way-ahead side.View RecipeExplore Bon AppétitThanksgivingRead MoreGlazed Shallots with Chile and ThymeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-16", "author": ["Condé Nast", "Emily Schultz"]}