{"id": "c94b6d3f5b433f477a9305523dcbea52", "url": "https://www.bonappetit.com/recipe/cashew-cream", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Cashew Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCashew CreamBy Hetty McKinnonSeptember 5, 20214.4(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintCashew cream is more than just a dairy-free substitute for vegans. For me—a cheese-toting, egg-flipping, non-vegan vegetarian—it’s a multipurpose workhorse, an ingredient that easily functions as a sauce, condiment, or dressing. This version is distinctly savory thanks to the addition of garlic and salt, and it’s a gateway to lots of quick and flavorful weeknight dishes.Many cashew cream recipes call for long soaking times to soften the nuts and make them easier to blend. If you have the time, you can certainly soak your cashews overnight in the fridge. I, however, prefer to speed things up: Soaking cashews in just-boiled water breaks down their crunchy texture in 30 to 60 minutes. Whip up this double batch and keep on hand for making a couple of weeknight dinners, such as Creamy Cashew Udon With Crispy Mushrooms, Roasted Carrots and Chickpeas With Herby Cashew Cream, or Broccoli and Cashew Cream Soup. —Hetty McKinnonAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonMedium Pot with Lid$155 At AmazonGlass Measuring Cup$19.99 At AmazonIngredientsMakes about 2 cups 2cups raw cashews2garlic cloves, coarsely chopped2Tbsp. extra-virgin olive oil1tsp. Diamond Crystal or ½ tsp. Morton kosher saltPreparationStep 1Bring a medium pot of water to a boil, then remove from heat. Add cashews and let sit until tender, 30–60 minutes.Step 2Drain cashews and transfer to a blender (preferably high-speed) or food processor. Add garlic, oil, salt, and 1 cup water and purée until smooth.Do ahead: Cashew cream can be made 5 days ahead. Transfer to an airtight container and chill, or freeze in a resealable plastic freezer bag up to 3 months.How would you rate Cashew Cream?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleGreat sauce, but only one of the three recipes listed tells us how much of the cashew cream recipe to use. That means that people are putting the FULL RECIPE of cashew cream into the udon and onto the carrots. Please update your recipes to tell us how much to use in each individual recipe. This is a rather silly editing error.Anonymous9/16/2021Explore Bon AppétitVeganCashewNutVegetarianCondiment/SpreadSauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-05", "author": ["Condé Nast", "Hetty Mckinnon"]}