{"id": "c968bb63830928d7241e87a3b90537ad", "url": "https://www.bonappetit.com/recipe/traditional-carbonara", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "Classic Carbonara Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesClassic CarbonaraBy Carla Lalli MusicApril 16, 20204.4(31)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintWe took a deep dive into traditional carbonara, tracing it back to its roots as a peasant dish made with pantry ingredients, and re-considered every factor. The result? Less pasta, more crispy-chewy strips of guanciale, and more silky creamy egg to hold it all together. When you buy the guanciale, make sure to ask for it in one piece so that you can cut it into chunky strips that will turn chewy-crispy and find their way into the pasta tubes as you toss together the sauce.IngredientsServes 4 as an appetizer or 2 as a (generous) main courseKosher salt1tsp. black peppercorns3oz. guanciale (salt-cured pork jowl) or pancetta (Italian bacon)Extra-virgin olive oil (for drizzling)3large egg yolks1large egg⅓cup finely grated Parmesan, divided⅓cup finely grated Pecorino, divided8oz. rigatoniSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Bring a large pot of lightly salted water to a boil.Step 2Meanwhile, toast peppercorns in a medium Dutch oven over medium heat, swirling often, until heated through and fragrant, about 3 minutes. Transfer to spice mill or mortar and pestle and let cool; reserve skillet.Step 3Cut guanciale into 1x½x¼\" pieces. Arrange in reserved skillet and drizzle with a little oil. Set over medium heat and cook, stirring occasionally, until lightly golden brown and starting to crisp, about 5 minutes (don’t let pieces get too crunchy). Using a slotted spoon, transfer to a small plate.Step 4Add about ½ cup hot water from pot to skillet, scraping up brown bits with a wooden spoon. Set skillet aside.Step 5Whisk egg yolks, egg, and about three-quarters each of Parmesan and Pecorino in a medium bowl. Coarsely crush peppercorns and add all but a pinch to egg mixture; set remaining pepper aside for serving.Step 6As soon as pot of water is at a boil, cook pasta, stirring occasionally, until very, very al dente, about 4 minutes less than package directions.Step 7Using a spider or slotted spoon, transfer pasta to skillet with reserved guanciale liquid and set over medium heat (alternatively, scoop out about 2 cups pasta cooking liquid and drain pasta in a colander). Cook pasta, stirring occasionally, until liquid is simmering (you’ll be able to tell because the pasta will be steaming), about 1 minute.Step 8Whisking constantly, add about 1 cup pasta cooking liquid to egg mixture to warm it up. Add egg mixture to pasta and cook, tossing constantly, keeping the mixture below a simmer, and adding more pasta cooking liquid by the ½-cupful if needed to adjust the consistency, until sauce thickens just enough to lightly coat pasta, about 5 minutes. Do not rush this step or you risk ending up with a pan of pasta and scrambled eggs. Remove skillet from heat if you want to slow the process down. As soon as you see wisps of steam rising from the egg mixture, that’s a good indication that the sauce is about to go from very liquidy to perfectly thickened. Remove from heat and toss in guanciale.Step 9Divide pasta among plates. Top with reserved Parmesan, Pecorino, and pepper.How would you rate Classic Carbonara?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleThis is absolutely delicious and very easy. I’ve always avoided carbonara because I don’t like eggs. But my son made this for the family so I gave it a try. If it was healthier I’d eat it every dewy. Silky, wonderful and delicious. SaraMelbourne, Australia 12/22/2020been cooking for over 25 yrs now and never seen this ?? ==>1x½x¼\" pieces.\nwow \nother than that the recipe is okmarcel bichonOntario12/17/2020A comment below refers to a video for this recipe. Where would I find it. Thank you.Magpie11/5/2020Easiest carbonara recipe I have found. I made this for my very picky 5 year old nephew and he told his mom to get the recipe from me! AnonymousWisconsin7/29/2020This was my favorite carbonara recipe by far! Highly recommend! My only change was I added a few smashed garlic cloves while frying the guanciale and the removed before adding guanciale to the pasta. I love both spaghetti and rigatoni for this! Angie TTacoma, WA5/24/2020Hmmm...The sauce recipe was perfect, but since the “classic” version was made with spaghetti, I don’t understand the use of rigatoni. Italians are masters at using the appropriate shaped pasta for each sauce. Carbonaro Sauce benefits greatly from a long noodle.Pittsburgh PA5/4/2020Made with bacon because I couldn't find guanciale, but it was great! Super glossy sauce. Easier instructions and more foolproof than other carbonara recipes I've tried.AnonymousLethbridge, AB5/2/2020I really miss eating at restaurants. This carbonara helped. Would definitely make again.AnonymousPhiladelphia5/1/2020I never leave reviews, but this recipe is awesome. For quarantine reasons I used penne instead of rigatoni and bacon instead of guanciale/pancetta. It was delicious nonetheless and shockingly easy. I have been afraid to attempt carbonara for fear of scrambling the eggs, but this was a total success!AnonymousConnecticut4/29/2020Absolutely amazing. I was nervous about the eggs scrambling but I just followed the method carefully and it was fine. So much tastier than other carbonara recipes I've tried.Australia4/25/2020The instructions in this recipe were very clear, especially the paragraph for what to do once you add the egg and cheese mixture back into the pan. I was patient and paid attention to temperature (glass cooktop in my apartment makes temp control a little difficult) and it paid off. I would just be VERY CAREFUL about adding the hot water to the pan with hot oil from browning your meat -- it will sputter if you don't have a lot of time to let the oil cool! I halved the recipe to dine for one by using one whole egg and one egg yolk - the yolky ratio is off with this substitution and I can only imagine how much richer and creamier it would be, BUT it did still come together very well! breebridger3741Houston, TX4/23/2020Amazing! The flavors were awesome and really each bite was extraordinary. My housemate and I ate until we couldn’t each anymore. So simple to follow and I felt like a pro the whole time! Definitely making this again!natsovintageBrooklyn, New York4/22/2020Another winner from the BA team. Loved the detailed but approachable instructions. PS. I cheated and used bacon since it's all we had at home, and it was still fantastic. Anonymous4/20/2020Made this for my family today!! It was my first “pasta water” sauce recipe that I’ve made and it turned out amazing. I was nervous about the egg scrambling but it worked out. A great pantry dinner too!gaby26California4/19/2020Isn’t this the same recipe as “The Silkiest Carbonara”, but just halved? AnonymousOregon4/18/2020Explore Bon AppétitPastaItalianEuropeanGuancialeCured MeatMeatRigatoniPasta & NoodlesParmesanCheesePecorinoEasyMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-16", "author": ["Condé Nast", "Carla Lalli Music"]}