{"id": "c96d2e43000d8d81e3c502f2ae8ce5d4", "url": "https://www.bonappetit.com/recipe/eggnog", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "Eggnog Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesEggnogBy Amiel StanekPhotography by Matt DuckorDecember 14, 20214.1(85)Read ReviewsTriangleEmailPinterestPrintPhotograph by Matt DuckorEmailPinterestPrintEmailPinterestPrintThis homemade eggnog is nothing like the thin, artificial-tasting versions you might find in grocery stores. Instead, it tastes like grown-up melted ice cream, thanks to the simple and reliable base of cream, egg yolks, sugar, and dark rum. Adding fluffy beaten egg whites right before serving makes it lighter and easier to drink than a cup of dairy and booze has any right to be.While eggnog has a long history—similar drinks were served in medieval England—it has evolved over the centuries and is ripe for riffing. Writer and bartender Al Culliton has suggestions for a “cool-kid” version made with mezcal and topped with cocoa powder and freshly grated cinnamon, as well as an “old-fashioned” one with Madeira, Oloroso sherry, and a light dusting of allspice. And if you or your guests are dairy-free, give this Cashew Nut Nog, made with coconut milk, a try.For more festive cocktail options check out these recipes.*Raw egg is not recommended for the elderly, people with weakened immune systems…or people who don’t like raw egg.Editor’s note: This recipe was originally published December 6, 2013.Ingredients12  Servings6large eggs*, separated1cup sugarA pinch of kosher salt3cups whole milk2cups heavy cream2cups dark rumWhole nutmeg and cinnamon stick (for serving)PreparationStep 1Whisk egg yolks, sugar, and salt in a large punch bowl just until sugar is dissolved, then whisk in milk, cream, and rum. Cover and chill egg nog base at least 2 hours.Step 2Just before serving, using an electric mixer, beat egg whites in a medium bowl until stiff peaks form. Gently fold into egg nog base. Finely grate nutmeg and cinnamon over as desired.Do Ahead: Eggnog base can be made 6 hours ahead. Keep chilled.How would you rate Eggnog?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThe alcohol will take care of bacteria.  With the proper amount of 70 proof or higher egg nog can be gos for 1+ years if chilled.  Good recipe but I scald the milks and temper the egg yokes, chill overnight then fold in the beaten whites.  Add alcohol.  AnonymousStudio City, CA12/26/2021Why do people stress about \"Raw\" eggs so much??? Just used pasteurized eggs for heavens sake.  This is an  amazing tasting nog.Dpmac12/21/2021To the folks worried about raw eggs, you'll notice the recipe includes two cups of alcohol as well. It'll be fine. AnonymousAtlanta, GA12/25/2020Raw eggs? Really?AnonymousStockholm12/20/2020I came here from the article about \"the best eggnog tastes like melted ice cream with booze\" and first off, that really is how the base tastes before adding any alcohol. I would absolutely serve this without alcohol and know that everyone would love it. Regardless, I added a cup of whiskey and a cup of brandy which was very tasty - for those complaining there's too much alcohol, you gotta taste as you work! My preference is alcohol forward and this hit the spot perfectly, especially if serving on ice. I was a bit stressed trying to get the sugar to dissolve in the egg yolks, so I creamed them as best I could then it fully dissolved as I added milk bit by bit. Would maybe recommend not using eggs straight from the fridge to make that easier.t1na12/25/2019I made this yesterday on Christmas, I doubled it and ended up using 4 cups of booze (rum and bourbon). In the future I would probably scale back the booze a little maybe a half cup less for the single recipe. Other than that I loved it SvGuintherCalifornia12/27/2018Sounds great -- but isn't it dangerous to eat raw eggs?\nAnonymousPhiladelphia12/13/2017Explore Bon AppétitCocktailDrinks AllEggRumAlcohol & Other DrinksEasyDrinksNut-FreeChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2013-12-06", "author": ["Condé Nast", "Amiel Stanek", "Matt Duckor"]}