{"id": "c97e16a52cbf9079d2df322b1504aee7", "url": "https://www.bonappetit.com/story/zak-the-baker-leek-latkes", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "When It Comes to Latkes, Can Thick and Fluffy Beat Thin and Crispy? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLOOK INSIDE »holiday issue 2020Add Leeks to Your Latkes. Never Look Back.Zak the Baker makes the case for adding an unexpected ingredient to the Hanukkah faveBy Zak the Baker, as told to Sarah JampelDecember 1, 2020FacebookTwitterEmailPhotograph by Emma Fishman, prop styling by Elizabeth JaimeFacebookTwitterEmailAs a secular Jew growing up in the Miami suburbs, Hanukkah was it—the number one holiday of the year, the best part about being Jewish, the pinnacle of the religion. My mom was always the latke cooker, and she took her role very seriously. While I thought everyone liked the latkes my mom made, now that I’m getting older, I’m starting to see a division within the family. Not everyone loves the thin crispy ones. Could there ever be a latke we all look forward to?Zak the Baker, a.k.a. Zak Stern\nThat’s why I was so into these latkes that our night baker Zach Polani shared with me. In Israel, where Zach is from, Hanukkah is everywhere: You smell it at the markets, you hear it in the music, you see it in the offerings at bakeries. Zach’s latkes help re-create that same festive atmosphere here in the diaspora.Soft and fluffy inside (but still crisp on the outside) and more leek than potato, they’re certainly a departure from the latkes I grew up with—and the recipe doesn’t go back generations and generations. Still, potato and leek is a combination I find homey and satisfying. Because these latkes are vegan, eschewing the egg that’s sometimes added, they’re a little bit more inclusive, which is one of our goals as a community bakery. In our kitchen we deep-fry these for all-over browning, but pan-frying is fine too. Sure, any kind of frying can be a bit messy, but the stink of oil and the plumes of onion and potato—that’s Hanukkah for me.Get the Recipe:Vegan Leek LatkesWith crisp outsides, creamy insides, and a subtle sweetness from tons of blanched leeks, these latkes might not be what you’re used to—and that’s a good thing.View RecipeExplore Bon AppétitHanukkahHoliday 2020Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Zak The Baker", "As Told To Sarah Jampel"]}