{"id": "c98cce6a00096bc08d8a172970484360", "url": "https://www.bonappetit.com/story/coconuts-and-collards", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Coconuts and Collards Author Von Diaz on Redefining Puerto Rican Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking'It’s Puerto Rican Because I Made it'Von Diaz, author of Coconuts & Collards, on breaking stereotypes about her island’s food.By Korsha WilsonApril 23, 2018FacebookTwitterEmailPhoto by Cybelle CodishFacebookTwitterEmailOn the surface, Coconuts & Collards by Von Diaz is a cookbook slash memoir about a family’s journey from Rio Piedras, Puerto Rico to Atlanta and the blending of Puerto Rican and Southern dishes in Diaz’s kitchen. There are recipes for adobo, sofrito, sazón, and the flavorful caldos (stocks) that are the building blocks of Puerto Rican food. But, beyond the surface, Coconuts & Collards is about the complex blend of history and agriculture that have shaped the island’s food and how Diaz found a way to blend two distinct cultures in a way that felt true to her own life.Puerto Rican food and Southern food are both often stereotyped as unhealthy and relying heavily on fried dishes, but, as Diaz found, that’s a small part of a larger picture. As she writes in her book, it’s possible to adapt traditional Puerto Rican and southern recipes to be healthier while still keeping the soul of the food. The recipes are her family’s history in edible form. “The food my family eats and the way we cook reflect multiple migrations back and forth from the Caribbean to the American South,” she says. Below she shares what advice she has for fellow home cooks and what she learned.How did Coconuts & Collards come about?Five years ago, I started a project where I wanted to cook all the recipes in Cocina Criolla, which is considered to be the Puerto Rican Joy of Cooking. I was going to do it in a Julie and Julia-type process and strictly follow each recipe as a way to get closer to my grandmother and Puerto Rican culture as a whole. But I found it difficult to cook that way because of the techniques and how unhealthy many of the recipes were. They used a lot of fat and deep frying and, to me, it didn’t produce a very satisfying dish. When you’re cooking, I think it’s important to be intentional about what ingredients you’re using and why you’re using them in a certain way.Do you think people have stereotypes around what Puerto Rican food is?I would say yes and no. No, because I think people don’t know a lot about Puerto Rican food, and they’re really curious. Mofongo, pernil, and tostones are three dishes that people are familiar with if they know any at all. And if that’s all that you know, then you would assume the food is really heavy. Puerto Rico was a colony cultivated for sugarcane, and, like so many islands in the Caribbean, the sugarcane was cultivated by enslaved people. Many of the dishes and foods were created to keep people working all day. There wasn’t room for or interest in cultivating vegetable crops, but there’s so much that grows on the island. In my book, the recipe ensalada de berro con China y aguacate is a very simple salad with avocado and watercress. It doesn’t seem to have a home in its ingredients, but I included it because, in Cocina Criolla, there are a bunch of recipes with watercress. I came to find out that watercress grows wild in Puerto Rico.Are you hoping Coconuts & Collards encourages people to think a little more deeply about what they define as Puerto Rican food?I hope that my book does that! I hope people will ask ‘well, why is the food so heavy’ and will take a look at the history of it. This project really opened my mind and my heart and I tried to position myself right where I sit as a Puerto Rican and as someone who grew up in the South. I started noticing the similarities in food in both places in dishes like stewed okra and pernil (roast pork) and that’s because of history. I hope people see that in the book and I’m hoping that people start to ask questions about what’s in their pantry.Do you remember the first dish that you modified from Cocina Criolla?One of my first experiments was a fried chicken dish called, pollo a la Maryland, and it’s made in a cast iron skillet. I tried to make the recipe as it was written, but the writer had it frying for a whole hour in pure lard. I mixed lard and corn oil instead and fried just until crispy, then finished it in the oven. What’s great is that you give the chicken time to release that excess oil, and you get a much less fatty version.How did you approach the process of making dishes healthier?I have so many memories of trips to Puerto Rico when I would gorge myself on yucca and cod fritters and chicharrons and I would feel terrible afterwards. My heart would be full but my stomach would be angry. When writing the book, I found that I could keep the soul of my people’s food without keeping all the fat. I think it’s similar with Southern food: You can cook in a way that expresses the diversity of local ingredients, like Edna Lewis brought to light in so many of her books about southern cooking. The same is true of Puerto Rico.What advice would you give to home cooks who want to adapt certain recipes to be healthier?First, I would start with the amount of fat, particularly oil, that you’re using. The early adjustments I made to recipes was to use a quarter of the recommended cooking oil and see if that worked. Second, citrus is a miracle ingredient for everything you’re cooking. If you need to emulsify something or keep a vegetable from going brown after you’ve blanched it, citrus works. And it keeps forever. My partner and I buy a dozen lemons or limes each week, and we run out. The third thing is substitutions. Pork, whether it be bacon, salt pork or lard, is used in Puerto Rican food to add flavor, smokiness, and sometimes funk. Those are easy flavors to manipulate. If you’re looking to add smoke, use smoked paprika or liquid smoke. You can even fire roast your vegetables right on your gas stovetop or in the oven. It’s a smart way to trick your tastebuds.Is there anything else you want people to take away from your cookbook?My book is really about women and how we nourish each other. I grew up in an environment with economic insecurity, and I think, too often, the way people cook when they’re broke is not celebrated enough. It makes you creative and intrepid, and you get to know ingredients and learn how to cook them. I hope people realize that home cooks are actually incredible, and we should lean on them more.Explore Bon AppétitHealthyishPuerto RicoPuerto RicanRead MorecultureWhat Will Puerto Rican Food Look Like After Hurricane Maria?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-23", "author": ["Condé Nast", "Korsha Wilson"]}