{"id": "c99102a39ff4240d4435fb5103658f37", "url": "https://www.bonappetit.com/story/kugel-feud", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Make a Pitcher of Cosmos | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMake a Pitcher of CosmosA cocktail suggestion, a conversation with Sarah Jessica Parker, and more news from the BA offices this week.By Alex BeggsSeptember 21, 2019FacebookTwitterEmailTed CavanaughFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Order the CosmoContributor Amiel Stanek, wearing a cutoff tie dye sweatshirt and wide brim straw hat (pause to picture it), sat next to me at the bar at The Odeon and ordered a martini. But didn’t he know, I asked, about the restaurant’s role in making the Cosmo a modern icon? I learned this in Priya Krishna’s oral history of the Cosmopolitan in Punch, a fun read that will, for the first time in a decade, make you crave the pink drink. At the Odeon in ~1988, Toby Cecchini came up with a Cosmopolitan with Absolut Citron, Cointreau, cranberry juice, and fresh lime juice. The bartender told us that it’s a consistent, popular order—they shake around 15-20 a night. Amiel reminisced about how his dad loved Cosmos so much he used to keep a pitcher of them in the fridge for the better part of the ’90s. But the more you talk about it the more you want to drink one. So we shared a Cosmo as friends should on a Monday night. It was a creamy, cloudy pink, sweet but tart like a Pixie Stick, utterly delicious. We compared it to sorbet; a nice meal-ender. “Vodka is just soooo...anonymous,” said Amiel, again, and I can’t emphasize this enough—wearing a self-tie-dyed self-cropped Champion sweatshirt. No need to order a Cosmo ironically, people, but just order it. This weekend. And be happy.Or make one! Here’s a recipe.Want this letter before it hits the website? Sign up for our newsletter!Ring ringSpeaking of modern icons and Cosmos, I talked to Sarah Jessica Parker this week about her new wine with New Zealand brand Invivo. It’s called SJP and has a blue paint-slashed X on the label—a Sauvignon Blanc that’s “nimble, surprising, and deeply satisfying” she said, followed by a honey-lacquered laugh. It retails for $20.“I was really nervous when the first bottles came in,” she said, “it reminded me of when scripts came in for Sex and the City, I couldn’t wait to read them and I didn’t want to read it. I wanted to know what was in store, what the future held, but I’d be worried I’d be upset, that it would let me down in some way. So I put off drinking the wine for a few days…” But she had a trusted, snobby (her words!) friend come over on a hot summer’s day, poured him a chilled, condensating glass of SJP, and when he said, “Oh, sweetie,” she knew it was a victory. “A-ha!” she cheered on the line. I asked her what she felt was a proper pour of wine*, but it turns out her glasses are nearly thimble-sized and not wine glasses at all. “We have short bistro glasses, 2-3 ounces, that I buy in hardware stores in Europe,” she said. Like these Duralex glasses that guess who, AMIEL STANEK**, also drinks wine out of. “I also drink out of old jam jars, I’m not kidding,” she added. “Not huge Hellmann’s mayonnaise jars, but old Grey Poupon jars, short European yogurt jars…” Devastatingly chic! SJP suggests pairing SJP with spicy Szechuan chicken; it can stand up to the heat without competing with it. I paired it with a bath, where it stood up to the heat just fine. The first sip was big, round green apple Jolly Rancher, and the rest was history.*The proper pour, according to me, leaves just enough room at the top of the glass for my nose, around 1.5 inches.**If you’re thinking, Is Amiel the Carrie Bradshaw of Bon Appétit? All signs are pointing to YES. Sorry, Andy!HahaBut seriously...here’s the salad recipe.It’s so good, please read“Tonight I am going to the restaurant, where I will eat a killed and burned-up bird and drink liquefied old purple grapes, and also I will swallow clear water that used to have bugs and poop and poison in it…”Michael Graydon + Nikole HerriottI’m BabyDid you see our Hot Ten list drop this week? I’m biased towards the wonderful Ochre Bakery in Detroit, a city I visit family in frequently. Get the espresso shortbread! Make the pistachio cake! When Emma Fishman went to Ochre to produce the photoshoot for the magazine, Michael Graydon and Nikole Herriott snapped chef Jess Hicks and Daisuke Hughes’s baby Yuka, who was hanging out in a very large pot. It’s impossible not to melt when you see it. Yuka chomped on bread and fennel while her parents prepped for service. Emma said: ”She was just chillin’ out.” Any other funny details in the bakery? “No, I was too stressed out.” Sounds like somebody could use some big ol’ pot time.Recipe comment of the weekGet the conky doodle recipe: Amiel’s (of course) ridiculous All-American Cheeseburger PastaUnnecessary food meme of the weekUnnecessary food feud of the weekPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaOn Basically this week, a noodle kugel recipe appeared. As creator Sarah Jampel describes, it’s “just slightly sweet. Just slightly eggy. Definitely not diet food. Lots of surface area for crispy noodles. Curdy in the best sense of the word (from cottage cheese). Buttery. Balanced between airy (like a soufflé) and custardy (like a pudding).” Months in the making, it was a heated topic in the Test Kitchen as every editor in every department voiced their preference. Carey Polis believes that kugel needs to be either sweet or savory—not both. Emily Schultz is team savory, and when the (slightly sweet!) recipe published, her dad called, asking in outrage, “Why is there sugar in this? Didn’t you make Mom Mom’s kugel for the Test Kitchen?” She did NOT. (Schultz added: “He also pronounces it “kegel” like the exercise, but we don’t need to include that.” In fact, we do.) Adam Rapoport will not allow raisins in kugel, but Molly Baz doesn’t mind them (they were left out of Jampelini’s recipe). Emma Wartzman prefers to eat it leftover, at room temp. Brad Leone, who was caught noodlin’ with Matty Matheson this week, commented: “Never really liked kugel” when the recipe appeared on Instagram, racking up 423 likes from fellow haters. No comment from Chris Morocco.Make it! Recipe here.Or if you must, make any of these other baked pastas instead.Explore Bon AppétitBeggs NewsletterRead MorecookingHow Interesting That This Tomato Galette Could Serve 8...or 1By Alex BeggscultureCook the Cover! It’s FoolproofBy Alex BeggscultureCinderella Lattes, Lonely Tomatoes, and Butter BoysBy Alex BeggscultureMake Minty Limeade This Weekend (Tequila Optional)By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-21", "author": ["Condé Nast", "Alex Beggs"]}