{"id": "c993ae64c30548cd89f57aa25bf4026b", "url": "https://www.bonappetit.com/story/kevin-the-office", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "The Best 'Office' Scenes About Food, Reviewed by Kevin | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Most Iconic Food Scenes in ‘The Office,’ Reviewed by KevinBrian Baumgartner, the actor and author of Welcome to Dunder Mifflin, spills the, er, chili on how everything came together.By Ali FrancisNovember 22, 2021FacebookTwitterEmailPhotograph by Getty ImagesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.“Eating is a communal activity,” says Brian Baumgartner, who played earnest doof Kevin Malone on the genre-redefining sitcom The Office. “And we needed to find ways to get these characters to interact, right?” Baumgartner, sunlit in his Zoom rectangle, is recalling all the ways food was eaten, thrown, spilt, and Jell-O–fied throughout the show’s eight-year run. “Whether it be in the break room, by the vending machines, or [at] some sort of party,” he continues, “I think our show probably leaned into [food] more than most.”Last year The Office was the most-streamed TV show across platforms. (I can personally account for a good chunk of the 57 billion minutes Americans spent LOL-ing our way through all nine seasons.) Since the U.S. adaptation of the British original debuted in 2005, The Office has become a cultural icon, delivering us memes, punchlines, and now an oral history in book form: Welcome to Dunder Mifflin. Coauthored by Baumgartner and the show’s producer Ben Silverman, it draws from hundreds of hours of interviews with the cast and creators, painting a behind-the-scenes, nostalgic, and absurdist picture of a series that—spoiler alert!—barely survived its first season. According to me, any Office stan worth their salt needs a copy. “Let me just tell you this,” Baumgartner says, levitating the book into view. “It is thick and it is significant. And I think it's beautifully done.”Welcome to Dunder Mifflin: The Ultimate Oral History of The Office$30 $20 at AmazonOff screen Brian Baumgartner is kind, funny, and optimistic. While you wait for your copy of the book to arrive, here’s his review of The Office’s most iconic food scenes, starting, of course, with Kevin’s famous chili.ContentThis content can also be viewed on the site it originates from.1. Kevin spills his famous chili (season 5, episode 26)On a Casual Friday, Kevin Malone brings in a huge silver pot of his famous chili, the thing he says he does best. After struggling up the stairs (the elevator is, of course, out of order), Kevin drops the pot and gallons of chili spill all over the Dunder Mifflin carpet—and himself. “People come up to me and they just focus on the comedy of [the scene],” Baumgartner says. “I think they’re psychopaths. Because you have to feel bad for the guy, right?” It’s true. One of the things that makes Kevin such a lovable character is witnessing how much joy he gets out of incredibly small victories. “So making this the thing that Kevin is most proud of, and then having it fail, makes it funny,” says Baumgartner. “But there is also a tremendous amount of heart behind it.”The scene itself was a total mess to make. “I was told [by our prop master], ‘We have three pieces of carpet. That’s it, man. So don’t screw this up,’” says Baumgartner, who luckily nailed the shot in one take. While there was a lot of thought paid to cleaning up the set, “not as much [was paid] to the cleaning up of me,” he laughs. “It wasn't like, ‘Oh, just put on another suit.’ No, it was bad.” Despite smelling of garlic and tomatoes well after shooting, Baumgartner still enjoys making and eating chili. His secret? “Well, you know the trick is to undercook the onions.”ContentThis content can also be viewed on the site it originates from.2. Todd Packer drugs the office with cupcakes (season 9, episode 17)Todd Packer (David Koechner) arrives at Dunder Mifflin carrying cupcakes laced with a variety of drugs—some legal, some not. Everyone suffers rough (and disturbing) aftermaths, except Kevin and Andy (Ed Helms), who frolic around the office all night arm wrestling, hugging, and swapping outfits like two gals on a sleepover. “Ed Helms and I went to high school together,” Baumgartner says. “So that was really fun to play together. I don’t remember exactly what was improvised, but we would get into it and just start thinking of things. I still remember sitting cross-legged on the table, massaging each other’s faces and putting on each other’s clothes.”The colorful cupcakes deployed throughout the episode are elegantly frosted and adorned with shredded coconut and mini Oreos—kind of like the designer cupcakes you might find at a Baked by Melissa. At the time “that was the fancy thing that you would give to your workplace,” Baumgartner says. “I feel like now we've moved to doughnuts, right?”ContentThis content can also be viewed on the site it originates from.3. Michael forces Kevin to eat broccoli (season 7, episode 13)Sweet Kevin’s New Year’s resolution is to eat more vegetables, so in front of the entire staff Michael (Steve Carell) forces him to eat raw broccoli, literally shoving the crown into his mouth while screaming, “Eat it!” The whole thing is a corporate lawsuit waiting to happen, and kinda hard to watch. “In terms of the embarrassment, being forced into doing something because of Michael’s pure will, that he doesn’t want to do at that moment, was really not good [for Kevin],” Baumgartner says.It wasn’t great for Baumgartner either, who loves “well-cooked” broccoli. “I don't like eating it raw,” he confirms, shuddering at the multiple takes he had to do. “They put [them] in crudités all the time. Everybody eats the carrots, the celery, and maybe a few tomato balls—but nobody ever eats the broccoli or cauliflower.”ContentThis content can also be viewed on the site it originates from.4. Jim puts Dwight’s stapler in Jell-O (season 1, episode 1)You know this Jim (John Krasinski) and Dwight (Rainn Wilson) spoof. Michael is introducing a new hire to the office when Dwight opens his desk drawer to find his black stapler suspended in an ornate mound of puke-colored jelly. Yes, Dwight is being bullied by his literal boss and that is bad. But I challenge you to watch this bit and not root for Jim and Michael. The scene, which sets up eight years of horseplay between the two office pranksters, is also a feat of food engineering. “I know there were multiple Jell-O’s made,” Baumgartner says. “I remember, even then, it was difficult to get the stapler to suspend. For years now, via social media or other picture-sharing apps, it's been attempted many times. And mostly abject failure occurs because the stapler always sinks.”ContentThis content can also be viewed on the site it originates from.5. Michael demands A MINT CHOCOLATE CHIP ICE CREAM CAKE (season 1, Episode 4)A month before Meredith’s actual birthday, Michael tries to boost morale by throwing her an office party. Despite her dairy allergy, Michael demands the planning committee serve a mint chocolate chip ice cream cake from Baskin-Robbins. “I can't eat generic mint chocolate chip ice cream to this day because of how much was consumed over the five days of shooting that scene,” Baumgartner says. “Every time the camera whipped around, we were all—especially Kevin and Michael, who’d made a big deal about it and had to enjoy it—supposed to be eating this really, really, really green mint chocolate chip ice cream. Now I know: The greener it is, probably the less good it is.”ContentThis content can also be viewed on the site it originates from.6. Nobody’s allowed to join the “Finer Things Club” (season 4, Episode 10)Oscar (Oscar Nunez), Toby (Paul Lieberstein), and Pam are founding members of the “Finer Things Club,” an exclusive group that meets monthly in the break room to discuss art and culture over very extra lunches. As they’re chatting, Kevin comes in and fights with the vending machine, interrupting the conversation while procuring a bag of what appears to be Doritos. “The tower of finger sandwiches was, I don't know, very funny to me,” Baumgartner chuckles. But the moment also gestured at class issues in the workplace, he adds, giving a chance “for Pam, Toby, and Oscar to demonstrate a higher status”—or their aspirations for one, at least.ContentThis content can also be viewed on the site it originates from.7. Cheese puffs derail (not very) serious business (season 5, episode 24)In a montage of satisfying crunches, Michael, Pam, and Ryan (B.J. Novak) lob each other cheese puffs to catch in their mouths at an otherwise Very Important Business Meeting. If ASMR existed in the mainstream back in 2009, this scene would make for a perfect track. “There was that gigantic container of cheese balls that sat on top of this rolling cabinet thing that was by the bathrooms—I don’t know, forever,” says Baumgartner. “And I think somebody from the writers’ room was like, ‘Yeah, we should use that in some way.’” He found something “pleasurable and nostalgic” about the whole tossing-cheese-puffs-at-people’s-faces thing. Which is exactly what you might say about falling back down an Office rabbit hole.Explore Bon AppétitCulturePop CultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-22", "author": ["Condé Nast", "Ali Francis"]}