{"id": "c9931b35dd879a4c15f60b517b3a8628", "url": "https://www.bonappetit.com/story/minimalist-brussels-sprouts-thanksgiving-side", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "The Minimalist Brussels Sprouts Thanksgiving Side with Maximalist Results | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Minimalist Brussels Sprouts Thanksgiving Side with Maximalist ResultsThe coveted Brussels sprout side dish that requires watching football to prep.By Carla Lalli MusicNovember 19, 2018FacebookTwitterEmailLaura MurrayFacebookTwitterEmailThe quick-sautéed Brussels sprouts with walnuts that my family serves as a Thanksgiving side dish every year would surely not exist without support from the wonderful world of pro football. During the days leading up to the holiday, my dad, Frank Lalli, stations himself in front of the kitchen TV, paring knife in hand and pints of Brussels sprouts arranged around him, to begin what is known in my family as “The Brussels Prep.”This painstaking process involves coring each tiny little cabbage and then separating the leaves so that they can be stir-fried over high heat in the minutes leading up to the Thanksgiving meal. Before that can happen, every leaf must be liberated from the rest, and it has to be done right. This drudgery is supposedly alleviated by a good college game, or at least that’s the theory. If Frank gets lazy or impatient and starts pulling the leaves off in clumps, or with pieces of the root attached, he will incur the loving wrath of one of the Lalli sisters (that would be me and my sister, Nina). We like our leaves fluffy. Because this laborious prep can be done days in advance, there’s at least some amount of balance to the whole affair. Yes, it’s a lot of vegetable butchery. But! It’s easy. And! You can do it on the Monday before T-Day. Plus! The dish itself takes minutes to prepare.The more hands to help, the merrier.\nPhoto by Michael GraydonI can’t remember when the Brussels first made an appearance on the menu. They’ve never not been there. Memories of all the years of making them have blurred together, a slo-mo flashback montage of Thanksgivings that took place in the kitchen of the house I grew up in, and the one my parents have lived in for the past 20 years, along with the cast-iron skillets that have been residents of both. The only thing that’s changed is the addition of some lemon zest and some lemon juice—a modern intervention on the classic presentation, and a move we might debate this year.No matter how many pints Frank works his way through, there’s always just enough Brussels to go around the table once, bright green and crisp-tender, perfectly blistered and charred spots. Their preciousness—alongside an abundance of every other dish on the table—makes us covet them even more.Get the recipe:Stir-Fried Brussels SproutsWith this brussels sprouts recipe, get straight to the good stuff: those sweet, bright green, tender-crisp leaves.View RecipeExplore Bon Appétitbrussels sproutEntertainingThanksgivingWalnutCooking Without RecipesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-10-27", "author": ["Condé Nast", "Carla Lalli Music"]}