{"id": "c99549dcf5c070cefe9d5ecc425bc685", "url": "https://www.bonappetit.com/recipe/cilantro-chutney", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Cilantro Chutney Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueCilantro ChutneyBy Priya KrishnaMarch 19, 20194.3(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Alison AttenboroughEmailPinterestPrintEmailPinterestPrintThis is the best thing you can do with a bunch of cilantro and five minutes of time. Herby, spicy, and bright green chutney, it can be drizzled on rice, roasted veggies, and eggs—but most ideally on dahi toast!Recipe adapted with permission from Indian-ish by Priya Krishna with Ritu Krishna (Houghton Mifflin Harcourt). Copyright © 2019. IngredientsMakes about ¾ cup1large bunch cilantro, stems and leaves coarsely chopped1small Indian green chile or serrano chile, coarsely chopped2Tbsp. (or more) fresh lime juice¼tsp. sugarKosher saltPreparationStep 1Blend cilantro, chile, lime juice, and sugar in a blender, adding a tablespoonful or so of water if needed to get it going, until smooth. Season with salt, taste, and add more salt and/or lime juice if needed.Step 2Do Ahead: Chutney can be made 2 days ahead. Cover and chill.How would you rate Cilantro Chutney?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI used a jalapeño and added a little more water, sugar, and salt… It SLAPPED!!! I will definitely be making this again!AnonymousTaylor, MI6/23/2021Definitely missing onion and garlic!Anonymous6/4/2021Extremely good! I really enjoy making chutney sandwiches, which is two pieces of bread, a slice of american cheese, hot lays, and the chutney of course. Highly recommend! ( if you have a mouth for hot foods 😉)AnonymousFort Wayne Indiana10/17/2020Such a great use of past-its-prime cilantro. It was spectacular, although I did substitute red pepper flakes for the chile (pandemic and all). It was perfect on eggs, sandwiches and roast chicken. Can't wait to make a second batch.  gabriel.iglesias205Miami, FL4/16/2020SO GOOD! Bright and zingy and not too too spicy (we used serrano peppers). I had to use a little more lime juice than recommended but I may have an overly large bunch of cilantro. Definitely give this a try and put it on EVERYTHING. AnonymousNew Jersey6/15/2019Explore Bon AppétitCondimentChutneyIndianSouth AsianAsianCilantroHerbs & SpicesLimeCitrusFruitQuickDairy-FreeNut-FreeVeganVegetarianKetoHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Priya Krishna"]}