{"id": "c9a0fbc5056098b518d2bed92139443d", "url": "https://www.bonappetit.com/story/sandwich-secrets-chefs", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "7 Sandwich Secrets We're Stealing from Chefs (Thanks, Chefs) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking7 Sandwich Secrets We’re Stealing from Chefs (Thanks, Chefs)Chefs share their X-factors for making your at-home sandwich So. Much. Better.By Bon AppétitFebruary 26, 2018FacebookTwitterEmailPhoto by David AlvaradoFacebookTwitterEmailThe perfection of some sandwiches lies in their simplicity (say, a ham and cheese with nothing but the highest quality ham, cheese, and don’t forget the butter). Others, however, benefit from a little something extra—a secret sauce that’s not necessarily a secret sauce, if you will. They’re the X-factor ingredients or techniques that take a sandwich to the next level, where it goes from being lunch to a true revelation between two pieces of bread. We asked chefs to share the little tricks they rely on that distinguish their dishes from our home versions.A BLT is all about simplicity, but a suped-up mayonnaise won't hurt—recipes here.\nChristopher TestaniDoctor Up Your Mayo“We do a special sauce, which is mayo, ketchup, mustard, and chopped dill pickles. That’s pretty much good on everything. We also make Russian dressing, which is mayo-based. And our white sauce is based off of a New York City halal truck, which is mayo and vinegar, so we make one with mayo, sour cream, and white vinegar.” —Kevin Pemoulie, Mean Sandwich, SeattleCut Down on the Bread“When you get a sandwich that’s half bread or more, that’s a real bummer. We’ll slice [our rolls] open and pull a little bit of the bread from the inside as soon as they walk in from the baker. You [want] all the crust, but to keep the focus on what’s inside. It’s laborious on top of the labor we’re paying for to have the bread made, but it’s our number-one rule.” —Megan Sanchez and Alec Morrison, Güero, Portland, ORPut Something Crispy On It“I’m all about crispy bits—fried quinoa, crispy shallots, sugar-fried garlic [sliced garlic tossed in sugar, then fried], and toasted sesame seeds. These things bring a ton of flavor and texture variance to each bite.” —Joseph Frietze, Publican Quality Meats, ChicagoIf you’re headed to Durham soon, get a big sandwich at Lucky’s (and send us pics).\nPhoto by D.L. AndersonUse Chunky Almond Butter Where You Least Expect It“We make a chunky almond butter and put that on our chicken salad sandwich with bacon. There’s something a little over the top about it, but they go really\nwell together.” —Drew Brown, Lucky's Deli, Durham, NCTwo Sauces Is Better Than One“If you can use two sauces, it’ll be that much more interesting. Our Italian grinder has an aioli and an oregano vinaigrette. Our cauliflower banh mi has a Thai vinaigrette and a spicy mayo.” —Todd Ginsberg, Fred's Meat & Bread, AtlantaGriddle with Something Extra“We brush guajillo paste onto some of our rolls before griddling. It creates this savory dark red chile bread that gets extra crispy. At home you could use sauce from\na can of chipotles in adobo.” —Megan Sanchez and Alec Morrison, Güero, Portland, ORThe collard green melt from Turkey and the Wolf was so good we had to get the recipe.\nPhoto by Alex LauFreshen Things Up“If you want to put herbs on your sandwich, put way more than you think you need. Just go huge on herbs. We definitely like to do dill, mint, basil, all that kind of stuff.” —Mason Hereford, Turkey and the Wolf, New OrleansThis chutney also takes a pimiento grilled cheese to the next level:Explore Bon AppétitSandwichRead MorecookingHow to Make Special Sauce, a Perfect CondimentBy Alex DelanyLifestyleFermented Hot Sauce Is Definitely Having a MomentBy Juno DeMelorecipes38 Sandwiches We'd Make Over and Over AgainGallery38 SlidesBy Danielle WalshRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-26", "author": ["Condé Nast", "Bon Appétit"]}