{"id": "c9a6c16492af64e935cde88e09192004", "url": "https://www.bonappetit.com/recipe/marinated-lentils-with-lemony-broccolini-and-feta", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Lentils with Broccolini and Feta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueMarinated Lentils with Lemony Broccolini and FetaBy Andy BaraghaniOctober 7, 20194.8(55)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintThe broccolini doesn’t need any pre-roast browning and there’s barely any chopping—just assemble and let the oven do the work. This healthy, hearty dish can be a warm vegetarian main or a cold lunch left to marinate in the fridge over night—the spiced oil is even better the next day. (We might even suggest doubling the recipe to have a little extra to drizzle over whatever else you’re planning to eat that week.) This dish is part of the Bon Appétit Guide to Actually Enjoying Your Lunch at Work. Find more recipes, tips, and tricks here.Ingredients4 servings 2tsp. coriander seeds2tsp. fennel seeds1red chile (such as Fresno or Holland), thinly sliced2garlic cloves, thinly sliced½cup plus 3 Tbsp. extra-virgin olive oilKosher salt1½cups black beluga or French green lentils, rinsed, picked through2bunches broccolini (about 1 lb.), trimmed, halved lengthwise½lemon, very thinly sliced, seeds removed¾cup finely chopped dill, mint, and/or parsley2Tbsp. sherry vinegar or red wine vinegar4oz. feta, slicedSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Preheat oven to 450°. Coarsely grind coriander and fennel seeds in spice mill or mortar and pestle.Step 2Transfer spice mixture to a small skillet and add chile, garlic, and ½ cup oil. Set over medium heat and cook, shaking pan occasionally, until garlic is golden brown and chile slices have shriveled slightly, about 5 minutes. Season spiced oil lightly with salt and transfer to a small bowl.Step 3Cook lentils in a large saucepan of simmering salted water until tender but still firm, 20–25 minutes. Drain and transfer to a medium bowl.Step 4While lentils are cooking, toss broccolini and lemon on a rimmed baking sheet with remaining 3 Tbsp. olive oil; season with salt. Roast, tossing halfway, until broccolini is charred in spots and lemon is softened, 7–9 minutes.Step 5Pour half of the reserved spiced oil over warm lentils. Add herbs and vinegar, season with salt, and toss to coat.Step 6Divide lentils among bowls and top with broccolini, lemon, and feta. Spoon remaining spiced oil over.Step 7Do Ahead: Lentils (without herbs and vegetables) can be marinated 3 days ahead. Cover and chill.How would you rate Marinated Lentils with Lemony Broccolini and Feta?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleThis dish was delicious and simple. It has easily worked its way into the rotation.EmilieBrooklyn, NY1/21/2022Delicious lunch. Love these French lentils. I’m on a whole plant food diet ( no SOS salt oil sugar) so I used tofu feta tofu was marinated in 1/4 cup lemon juice, tablespoon oregano, 1/4 cup cider vinegar, 1/2 cup water) which turned out great. I omit oil and sauté in water. Delicious and good for my heart ❤️.\nAnonymousBoston9/7/2021Absolutely delicious! LoridpVancouver BC9/3/2021It was fabulous, we used halloumi instead.  The oil is everything!! Made it twice in the same week!\nI used chipoltle peppers, limes instead of lemons, and brocollcini \nThis recipe has a solid foundation so sensible replacements work.\nWendyPeloYogiNew Rochelle, NY4/13/2021Delicious! I somehow forgot to get lemons so I used Szechuan peppercorns and substituted the fresno chile with aleppo pepper, and it was still so good. Next time I'll try it as is. This one is a keeper.BradVancouver, BC3/26/2021Fantastic! I used a Serrano instead but still a stellar recipe Pob3/11/2021Somehow...maybe...the best recipe I've ever made from BA? Literally the only thing I would change is not roasting lemon slices but instead using lemon juice, I highly suspect I used the wrong lemons because it was a bit bitter but otherwise this is the perfect recipe. You're not even ready for this. Serve with grilled bread to scoop up the last of the lentils at the end, amazing. Andy your recipes have yet to fail me!HalleSeattle, Washington3/4/2021When I made it, I burned my food till it was black and it tasted really bad. Andres Perezz Wuhan China  2/14/2021Delicious, really liked it.  Served with roasted chickenSamToronto 12/9/2020So delicious! I made it once with what I had to hand (spinach instead of broccolini, halloumi instead of feta, and red lentils instead of the firmer options, and red chili flakes instead) and it STILL came out wonderful. A kind of warm tasty bowl. Lemon added nice brightness. Second time I followed the recipe almost to a T, save for the herbs (which I didn't have) and still using red chili flakes. Firmer, more textural, tastes same: delicious! Agree with others that it is the OIL that makes this dish; might try experimenting with it and other combos soon :)AnonymousBoston MA9/7/2020We absolutely love this recipe - and always double it for the amazing lunch leftovers. Seems like it’s going to be too much oil, but it’s perfect as written. AnonymousWashington, DC8/17/2020Sweet baby jesus this was a good one. Only modifications I did was Jalapeños instead of red chili - turned out amazing. \n\nI followed all the other instructions step by step. The recipe sounded kind of boring to me but oh my god, it tastes heavenly with some french green lentils. It's so simple but all the flavors work so well together. Definitely use 1/2 cup of some good EVOO too, I think that makes a big difference. And fresh herbs as well. unkavehAtlanta, Georgia7/17/2020I LOVE this recipe.  I've never ground my own herbs before and the freshly ground coriander and fennel were such a treat!  Doing this has opened my eyes to even more flavor possibilities.  Thanks so much!!Jocelyn KorabBoston, MA7/5/2020Great recipe - started it, realized I didn't actually have lentils, so I used wheatberries instead.  I poured the hot oil over sliced radishes and then mixed in the wheatberries.  A great method that is clearly very adaptable for quarantine times! AnonymousPhilly5/29/2020Made this with French green lentils (1 cup was plenty), regular broccoli (florets and sliced stems), 1 jalapeno, and a mix of cilantro and parsley for the herbs.  It is a bit of a project, but was totally worth it!  The oil makes the dish, and the feta is vital.  Eating warmed leftovers with a little avocado thrown in today - very good!  I think you could throw some toasted pine nuts on top, as well.Laurie HeilHuntington Beach, CA4/22/2020Explore Bon AppétitFetaCheeseBroccoliVegetableFrench LentilLentilBlack LentilWeeknight MealsMainVegetarianNut-FreeGluten-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Andy Baraghani"]}