{"id": "c9ae96a4021ffd5ec638b144fc7e44e5", "url": "https://www.bonappetit.com/story/pink-drink", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "This Rhubarb Daiquiri Is My Favorite Way to Consume Rhubarb | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Pink Drink Is My Favorite Way to Consume RhubarbHere's looking at rhubarb.By Alex BeggsMay 12, 2020FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Thrumppp. That was five pounds of rhubarb being kerplunked into my trunk at Detroit’s Eastern Market contactless pickup last weekend. I had to reserve that sour stalky weed a week in advance! Five-pound bags only! Okay! But rhubarb—or as I pronounce it in the Princess Bride “mawwiage” voice, WOO-BAHBBB—is something to get hyped about.Cakes, pies, galettes, brown butter jam bars! The weird wannabe-celery gets sweet and tangy when it’s cooked, and maybe most importantly, retains its flashy pink color in a way purple asparagus wishes it could. Rhubarb is vanity.Which is why my favorite way to play with it is to make blushing pink rhubarb daiquiris, recipe courtesy of Lily Mirabelle Freedman. Her recipe requires making a rhubarb simple syrup and some light upper body work—cocktail shaking. But that’s never stopped me before.Me when rhubarb's in season.\nAfter I made the syrup, squeezed in some lemon juice, and let it cool, it was cocktail time. I stretched the definition of daiquiri to contain tequila as I was out of rum, and then I made one with gin for my mother-out-of-law, because, as she retells it, “the last time I had tequila I got arrested.”But please don’t alert the professional cocktail people. Rum, tequila, vodka, moonshine, whatever! The combination of sweet-sour rhubarb, lime juice, and booze is fail proof. The fam loved it. “Wooobahb!” we exclaimed as we clinked glasses. I regretted not making a double batch. Until next year.Make it:Rhubarb DaiquiriThis syrup isn’t just for cocktails. Feel free to stir an ounce into club soda for easy drinking.View RecipeExplore Bon AppétitRhubarbNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-12", "author": ["Condé Nast", "Alex Beggs"]}