{"id": "c9c4fb527e34aea1d1d4c11b6489a20d", "url": "https://www.bonappetit.com/recipe/flourless-chocolate-cake-with-cafe-de-olla-ganache", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Flourless Chocolate Cake With Café de Olla Ganache Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueFlourless Chocolate Cake With Café de Olla GanacheBy Tamar Fasja Unikel and Elena Vazquez FelgueresMarch 16, 20214.6(36)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek Brown, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintTamar Fasja Unikel, co-owner of Masa Madre bakery in Chicago, grew up in a tight-knit Jewish community in Mexico City where Passover was a very big deal. One of her aunts, Adela, started making this cake 35 years ago and it’s now a part of Unikel’s holiday table too. At Masa Madre she and her partner Elena Vazquez Felgueres pay homage to their Mexican heritage by frosting the cake with ganache enriched with the flavors of café de olla, a combination of ground coffee, piloncillo, and cinnamon. This cake gets better throughout the week, whether cold from the fridge or warmed before serving. It can be made parve/dairy-free by subbing in margarine or vegan butter for the butter and cream. If you don't eat corn syrup during Passover, Unikel suggests using honey or maple syrup in its place.Ingredients8 ServingsCake7Tbsp. plus 1½ tsp. unsalted butter, plus more for pan1cup (150 g) semisweet chocolate, chopped1¼cups (125 g) raw pecans, plus chopped for serving1cup plus 2 Tbsp. (125 g) almond flour or meal½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt6large eggs¾cup (150 g) granulated sugarganache and assembly1½cups (200 g) semisweet chocolate, chopped¾cup heavy cream1Tbsp. light corn syrup1Tbsp. finely ground espresso or other dark roast coffee½tsp. cinnamon, preferably Ceylon½tsp. grated piloncillo or light or dark brown sugar1Tbsp. unsalted butterPinch of kosher saltPreparationCakeStep 1Place a rack in middle of oven; preheat to 325°. Lightly butter a 9x5\" loaf pan; line with parchment paper, leaving a generous overhang on long sides. Butter parchment. Combine chocolate and remaining 7 Tbsp. plus 1½ tsp. unsalted butter in a medium bowl and set over a large saucepan of simmering water (do not let bottom of bowl touch water). Heat chocolate and butter, stirring occasionally, until melted and smooth. Remove bowl from heat and set chocolate mixture aside.Step 2Pulse pecans in a food processor until somewhat finely ground (it’s okay if there are some coarser pieces). Pulse in almond meal and salt; set aside.Step 3Beat eggs in the bowl of a stand mixer fitted with the whisk attachment on medium-high speed until fluffy, about 2 minutes. With the motor running, gradually stream in sugar and beat until mixture is very pale and nearly doubled in volume, about 1 minute. Stream in reserved chocolate mixture and beat until no streaks remain. Remove bowl from mixer and fold in reserved pecan mixture with a rubber spatula, making sure to scrape bottom of bowl, until well incorporated. Pour batter into prepared pan and tap pan on counter to remove any air bubbles.Step 4Bake cake, rotating pan halfway through, until a tester inserted into the center comes out with just a few moist crumbs attached, about 1 hour. Transfer to a wire rack and let cool in pan.ganache and assemblyStep 5As soon as the cake is almost cool, place chocolate in a medium bowl. Bring cream, corn syrup, coffee, cinnamon, and piloncillo in a small saucepan to a faint simmer over medium heat. Pour over chocolate, whisking constantly until melted and smooth. Add butter and salt and whisk until butter is melted and ganache is shiny and smooth. Let cool until thickened slightly, 15–30 minutes.Step 6Turn cake out onto a large plate or cake stand and turn right side up. Pour ganache over (it should flow over the sides but not quite hit the plate). Scatter chopped pecans over as desired; chill until ganache is set, 10–15 minutes.How would you rate Flourless Chocolate Cake With Café de Olla Ganache?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleThis turned out great, although the cake ended up sinking a bit in the middle as it cooled. For the ganache, did the recipe mean to specify using instant coffee or espresso powder? Just using finely ground coffee would leave the ganache incredibly gritty. I ended up infusing the cream with the ground coffee and then straining it out before continuing on with the recipe.JacobPhiladelphia, PA11/11/2021**Well, I tried to rate this cake 4 out of 5 stars, but the review automatically changed it to 5, so that seems like a tech issue on BA's end.\n\nI made this cake for my mom who is gluten sensitive for Pascha (Orthodox Christian Easter); she loved it, but honestly I was only marginally impressed. I followed the recipe to a T and went out of my way to get all the exact, specified ingredients (the piloncillo, for instance) and I was underwhelmed with the final product. The cake itself was moist and the ganache was good (what ganache isn't good?!), but I just didn't find myself craving a slice like I have with other flourless chocolate cakes and tortes. I think it has something to do with the slightly grainy cake texture from the pecans (I did a fine ground). I think if I make it again for my mom I would try to use only super fine almond flour instead—and maybe add vanilla extract.\nAll that said, it did look really pretty on the serving platter!Sarah A.Louisville, KY5/13/2021Is it possible to make this cake in a pan other than a loaf pan?Caroline E.Brooklyn, NY4/4/2021Amazing recipe!!  I am Ashkenazi and just left out the corn syrup.  Still a delicious and amazing cake!\nDefinitely a keeper that will be on my Passover table in the years to come as well.AnonymousNew York , NY4/3/2021Okay - you gotta make this. After YEARS of horrible, dry Passover desserts I was literally blown away by what a good flourless cake this is. So rich, but not heavy or dense (thanks to those whipped up eggs), and not too sweet. I toasted my nuts and added a half teaspoon of almond extract to the mix to really bring out the nuttiness of the dessert and it was delish. I also did not have heavy cream in the house, and used almond milk... it worked with zero issue! Cake is good enough to eat any day of the year, not just Passover. Jaclyn TBrooklyn, NY3/28/2021Hi there! This is Tamar Fasja. I’m the co-owner of Masa Madre and provider of the recipe. \nFor those of you that might not know this, Sephardic Jews, like myself, eat Kitniyos on Passover. Even the most orthodox of the Sephardic Jews eat corn, rice, beans and other things that many Ashkenazim wouldn’t. \nThis collection of recipes showcase the variety of Jewish identities out there and that includes disparities on kosher diets. \n\nHowever, for a ganache recipe without Kitniyos, this is a great substitute:\n113g butter (vegan butter or margarine)\n175g semi sweet chocolate \n1/2 tsp piloncillo \n1/2 tsp cinnamon\n1 Tbsp espresso powder or finely ground coffee. \n\nAll melted and cooled.  TamarChicago, IL3/27/2021All these outraged people should do a little research. Reform Judaism has allowed corn since the early 1800s; Conservative Judaism has since 2016. So only Orthodox Ashkenazi Jews are prohibited from eating corn. It might not be part of your tradition, but it's not some massive oversight either.  Anonymous3/26/2021I'm the last person who would defend BA amid their discriminatory practices, but I'm from Chicago and I love Masa Madre. Happy to go to bat for them here. Corn and corn products are only considered chametz for Ashkenazi Jewish people. Sephardic Jewish people consider corn and corn products K4P. While I agree that adding that information would be helpful in this recipe, to say that corn is universally chametz is excluding a significant portion of our Jewish friends and family. MSLChicago, IL3/25/2021I'm the last person to defend BA for their discriminatory behavior, but I live in Chicago and I love Masa Madre, so I'm willing to defend them. Corn syrup is (and has only ever been) chametz for Ashkenazi Jewish people and not Sephardic Jewish people. I agree that the recipe should have additional information about why corn syrup is or is not K4P. However, to say that it is universally unacceptable is leaving out a significant group of Jewish people for whom corn syrup and other corn products are completely fine.MSLChicago, IL3/25/2021For those in the comments outraged by the inclusion of corn syrup in a Passover recipe, many Jews DO eat corn syrup during Passover. It is only Ashkenazi Jews that don't. This recipe may be perfectly acceptable for some Jews' Passover needs, and if it doesn't fit yours, that's okay! There are plenty of great corn syrup-free recipes you can make instead.MK3/25/2021I'm so tired of cooking sites being so uneducated.  You seem to think flour is the only thing Jews can't eat on Passover.  There is a whole list, including corn syrup.  Bon Appetit has continually had issues with racism, misogyny, and, yes, anti-Semitism in this case.  There are many people to ask if this recipe is ok.  Can you imagine someone who didn't know, baking this and serving it to people who know you can't eat corn syrup.?  Get it together Bon Appetit.\nJohannaBBala Cynwyd3/25/2021Corn syrup for Passover?  Otherwise, the recipe is interesting!  I will have to see about finding a substitute for that.\nMHHuntington, NY3/24/2021I had some almond flour to use up so I thought I would give this a try. \n\nThere is a typo in the ingredients list: The ganache should only have 1 cup of chocolate instead of the stated 1.5 cups (1 cup = 150 grams). I still had more than enough ganache to cover my cake, even with switching it to an 8x8 baking dish instead of a loaf pan. \n\nFlavors were good, I did think it tasted even better the next day. JaneMaine3/21/2021Can this be made Keto friendly? What can be substituted for the sugar and corn syrup?SusieReidAlbany OR3/16/2021Explore Bon AppétitCakeDessertLoaf CakeMexicanLatin AmericanChocolateOther IngredientsGluten-FreeBakingPassoverRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Tamar Fasja Unikel", "Elena Vazquez Felgueres"]}