{"id": "c9d1d5f1d2d30284a39bfd1c9b9973e1", "url": "https://www.bonappetit.com/recipe/fermented-garlic-honey", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Fermented Garlic Honey Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueFermented Garlic HoneyBy Andy BaraghaniSeptember 18, 20184.7(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintIf the raw honey you find is solid at room temperature, warm it in the microwave or in a saucepan over low heat to bring it back to a liquid state before using for this recipe. You can drizzle this honey over pepperoni pizza (trust!), serve alongside spicy fried chicken, use in a glaze for grilled pork or fish, and/or add a few spoonfuls to savory cornbread.IngredientsMakes about 2 cups12garlic cloves (about 1 head), crushed1½cups raw honeySpecial EquipmentA heatproof 1-qt. jarPreparationStep 1Place garlic in jar. Pour honey over garlic and stir to combine, making sure all the garlic gets coated. Seal jar and let sit at room temperature 3 days. Unscrew and remove lid to let out any gases; give garlic honey a stir. (You’ll most likely see tiny bubbles at this stage, which means the fermentation process has started.) Reseal jar and let sit, stirring once every other day, at least 1 week before using.Step 2Do Ahead: Garlic honey can be made 1 month ahead. Keep room temperature.How would you rate Fermented Garlic Honey?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleMade several this week for my family. They have bubbles I have been burping everyday. How do you know if you have to add apple cider vinegar? Nina.             Laredo Tx8/14/2021Mine has been jarred for over a month and never developed bubbles. Has this happened to anyone else? Should I toss it and try again?Jax a.Los Angeles, CA4/18/2021We just made ours this morning but I can’t wait to try it on grilled shrimp, grilled chicken, grilled pork, or warm brie. Jkeva410Virginia3/7/2021I've had mine going for a couple weeks now but have all the same questions as everyone else! Can someone please answer before I just panic and throw the whole batch away? lolYayaBurkPlano, TX8/28/2020Just started my jar! After a week, can you take the honey out of the jar and put it in another vessel? Will you compromise anything this way? jessica.moffitt196207Ontario Canada 5/24/2020Just started this recipe and it smells divine.  As with most fermentation processes, is it important to make sure the lid of mason jar is plastic and not metal?kmac9New Jersey4/8/2020This is an answer to Peek_Abu... In the video, Brad says he tests the pH and if it gets above 4.6 he adds apple cider vinegar. While this is to prevent botulism in the honey, maybe it also keeps the fermentation process going.monroe444Mintaka3/25/2020Hi, after a while I noticed I didn't need to burp my jar as often. Then the other day, I found the honey in the jar had gone solid. Is it still safe to use my solid fermented honey? What sign would indicate its no longer safe?peek_abuBoston, MA1/2/2020Love love love it so much! As far as the question below goes, I believe you can add water to it to continue the fermentation process.kevinloredo222949Laredo, TX12/19/2019Question: I just started my jar. Can I use this as a starter base after a week...as in, keep adding more honey and occasionally more garlic cloves or do I need to use it all up and start fresh every time? Rating a 5 cause I love this idea and it already smells awesome CmeadesLouisiana 11/21/2018Explore Bon AppétitCondimentGarlicVegetableGluten-FreeDairy-FreeVegetarianNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Andy Baraghani"]}