{"id": "c9d573960e474a7433ae6c2dbcaccf96", "url": "https://www.bonappetit.com/story/eggplant-salad-recipe", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "This Warm Eggplant Salad Is Cozier Than a Vintage Flannel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Warm Eggplant Salad Is Cozier Than a Vintage FlannelIt also has toasted walnuts, lots of mint, and a drizzle of sweetness on top.By Aliza AbarbanelSeptember 18, 2018FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Olivia Anderson, Prop Styling by Bea ChastkaFacebookTwitterEmailIt’s easy to crave crunchy lettuce and juicy tomatoes in the heat of summer. But fall salads? Now that’s a harder sell—especially when hearty soups and baked pastas are finally back in my life. The best way to ensure I'm hitting my vegetable RDA even after I've busted out my (very precious) vintage flannel collection? Warm salads.More specifically, this warm eggplant salad. The recipe, created by senior food editor Andy Baraghani, is fortified with some of my most favorite foods: crunchy chopped walnuts, plenty of fresh mint, and rich date syrup, which provides just the right amount of sweetness. It might feel like an unruly mix of flavors, but a bit of warming fall spices brings them all together to create a surprisingly harmonious, totally craveable dish.I start by preheating my oven to 350°, then toss the walnuts on a rimmed baking sheet and toast, tossing occasionally, until they’re slightly darker and super fragrant. (This kind of toasting situation is the perfect job for a quarter baking sheet, but I haven't managed to buy one just yet and my usual half sheet works just fine too.) Once my kitchen smells deliciously nutty, I take out the tray and let the walnuts cool. Then I give them a fine chop, set them aside, and get a dressing going from lemon juice, cinnamon, red pepper flakes, and a bit of extra virgin olive oil. I whisk the dressing in a large bowl so I can add the eggplant right on top.This recipe calls for sliced Japanese eggplants, which are smaller, sweeter, and faster-cooking than other types. Japanese eggplant also have a firm texture that’s ideal for stir-frying—it turns creamy when cooking but still holds its shape. If you can’t find any, try fairy-tale or globe eggplant sliced crosswise into even 2” sections. After all my eggplant pieces are relatively even in size, I cook them in a large nonstick skillet over medium high until golden brown and tender. Then I use kitchen tongs to transfer the eggplant into the dressing bowl and add in some thinly sliced red onion, mint, and most of the chopped walnuts. (I hang onto the rest for plating, because this recipe is a little fancy like that.)Once the eggplant salad has been seasoned with salt and I'm sure everything is evenly coated, I transfer it to a big platter and top with those remaining walnuts. This is when I add the final ingredient: date syrup. We like Date Lady syrup because it’s slightly fruity, organic, and easy to find online, but honey or pomegranate molasses would work well too. Whatever you use, go ahead and be generous with the drizzling. The hint of sweetness rounds out the dish with just the right amount of richness, coating the warm eggplant like, well, my softest vintage flannel. Powerful stuff, indeed.Get the recipe:Warm Eggplant Salad with WalnutsDate syrup gives this savory, nutty eggplant salad the perfect amount of sweetness.View RecipeExplore Bon AppétitHealthyishEggplantFallSaladDateWalnutSideRead MorecookingThis Miso Eggplant Bowl Will Convert Even the Most Hater-y of Eggplant HatersBy Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Aliza Abarbanel"]}