{"id": "c9d8981cfd9bc193a8e6a842228d4e0b", "url": "https://www.bonappetit.com/recipe/sous-vide-steak", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Sous Vide Strip Steak Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueSimple Sous Vide SteakBy Brad LeoneJanuary 24, 20184.6(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Anna BillingskogEmailPinterestPrintEmailPinterestPrintThe sous vide technique is great for parties since you can cook the steak to the ideal internal temperature (way) ahead of time and quickly sear it before serving. The device eliminates any worry about over- or undercooking, and each one will be perfect. Read more about what sous vide cooking is, and see how to cook anything sous vide with step-by-step photos here.Ingredients2 servings114–16-ounce boneless strip steak (1½–2 inches thick)¼teaspoon garlic powder¼teaspoon onion powder1teaspoon kosher salt, plus more¼teaspoon freshly ground black pepper, plus more3sprigs rosemary3sprigs thyme1tablespoon grapeseed or other neutral oilSpecial EquipmentA sous vide machine; a 1-gallon vacuum-sealable or resealable plastic bagPreparationStep 1Clip (or stand) sous vide machine to a tall large pot. Fill pot with warm water to height according to manufacturer’s instructions (keep in mind that steaks when added will cause water to rise).Photo by Alex LauStep 2Rub steak on all sides with garlic powder, onion powder, 1 tsp. salt, and ¼ tsp. pepper. Place steak in bag.ChevronChevronStep 3Lightly bruise rosemary and thyme by smacking them against a cutting board or lightly rolling in your hands (this will helps release the volatile oils). Add herbs to bag.Photo by Alex Lau, Food Styling by Anna BillingskogStep 4Vacuum seal or partially close resealable bag, getting as much air out as possible to keep bag from floating, and place in water bath. If using a resealable plastic bag, push down into water to submerge (this will push more air out of the bag) and fully close. To ensure proper cooking, contents of the bag need to be completely submerged in water. Turn on machine and heat water to 130°. This temperature will give you a tender, perfectly medium-rare steak (adjust 5° either way if you like your meat more or less well done).ChevronChevronStep 5Using a small clip, secure top edge of resealable bag to rim of pot, positioning it opposite the machine’s water outlet; as the water circulates, it will help keep the bag submerged. If using a vacuum-sealed bag, you may need to set a small plate on top to prevent floating. Cook steak, maintaining water bath at 130°, 2½ hours. Remove bag from water bath and let steak rest in bag 15 minutes (this lets the steak absorb some of the juices).Photo by Alex Lau, Food Styling by Anna BillingskogStep 6Remove steak from bag and pat dry with paper towels. Season all over with salt and pepper. Let air-dry a few minutes.Photo by Alex Lau, Food Styling by Anna BillingskogStep 7Heat a large cast-iron skillet over high until very hot. Add oil and cook all 4 sides of steak until a nice crust forms, 1–2 minutes total (it happens fast, so don’t walk away). The steak is already perfectly cooked; this step is to get some color and texture on the exterior. Slice steak against the grain, if desired, and season with salt and pepper. (The steak may appear slightly gray when you first cut into it but will turn bright pink when exposed to air.)Photo by Alex Lau, Food Styling by Anna BillingskogStep 8Do Ahead: Steak can be cooked in water bath 4 days ahead. Keep sealed in bag and chill, or freeze up to 1 month. Reheat with sous vide machine at 100° until warmed through, about 1 hour, before searing.How would you rate Simple Sous Vide Steak ?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleGreat technique. Perfectly cooked steak! Will use this method every time.AnonymousVancouver, BC2/13/2022Explore Bon AppétitSteakBeefMeatMainDairy-FreeGluten-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-24", "author": ["Condé Nast", "Brad Leone"]}