{"id": "c9df90172781aae9300475aeeaec2ec7", "url": "https://www.bonappetit.com/story/wine-to-bring-to-thanksgiving", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "5 Thanksgiving Wine Bottles for Every Dinner Situation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe 5 Types of Wine to Bring to ThanksgivingWhether you're trying to impress new in-laws or crashing a friend's dinner, these bottles have you covered. By Marissa A. RossNovember 25, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Prop Styling by Elizabeth JaimeFacebookTwitterEmailOn paper, Thanksgiving is an easy holiday. There aren’t a dozen boxes of decor to bring down from the rafters, no presents to buy people you barely know, and no religious hoops to jump through. But if John Hughes has taught us anything (aside from how high school sucks) it’s that no holiday is truly easy. Thanksgiving is an unpredictable shuffle of relatives and relationships and unwanted air travel. And then there’s the meal. The only element you can ever completely control is the bottle of wine you're bringing to dinner. Here are five reliable styles to take to the most uncertain of tables this season:For the Friend of a Friend's: Pétillant-NaturelSometimes Thanksgiving gets random, and that’s fine because you have pétillant-naturel, Champagne’s more casual cousin. With its soft bubbles, a punch of acidity, and touch of residual sugar, pet-nat is a great way to start dinner and conversations with total strangers.Strekov's Creme is the perfect Thanksgiving pet-nat.\nPhoto by Chelsie CraigFor the In-Laws to Impress: Burgundy Pinot NoirPinot Noir from Burgundy complements everything on the table of your (fingers-crossed) future in-laws. But you don’t have to shell out the big bucks. New Burgundy producers sell more accessible versions (Think $30-$40) that are just as expressive. The in-laws will know the region and the grape, and you’ll be sneaking winks to your significant other as they praise your excellent taste.For the Traditional Family Round-Robin: RoséYou know the bar at your loud, crowded, full-family Thanksgiving will inevitably be filled with watery Pinot Grigios and overpowering Cabernets, so bring a rosé (one that leans more savory in flavor) that will elevate your grandmother’s cranberry sauce. Bonus: It’s nearly a crime not to love rosé these days, so it’s also a crowdpleaser!Domaine Philippe's Rosé is an excellent choice for Thanksgiving wine.\nPhoto by Chelsie CraigFor the Proud Unconventionalist Thanksgiving: Skin-Contact White WineSome people just don’t serve turkey. Maybe it’s a deer they hunted that week, or a whole fish they got at the market at 4 a.m, or suddenly they’re vegan. Who’s to say?! A skin-contact white wine can handle it all—with enough acidity to drink alongside lighter entrees and the tannic structure to stand up to bolder dishes.For the Leftovers: LambruscoYou’re not serving this wine at dinner. You’re hiding it away in the refrigerator, until lunch the next day. Rich in flavor but refreshing, it pairs perfectly with turkey sandwiches and mashed potatoes on the couch in your pajamas (and celebrating getting your parents out of the guest bedroom).Explore Bon AppétitHealthyishThanksgivingnatural wineWineessayRead MoreLifestyleYou're Not Going to Believe I'm Saying This, But Merlot Is BackBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-25", "author": ["Condé Nast", "Marissa A. Ross"]}