{"id": "c9eef8d1adcf2d7cc6670f5df4c7ef6f", "url": "https://www.bonappetit.com/story/alexandria-ocasio-cortez-lessons-from-restaurants", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Alexandria Ocasio-Cortez Learned Her Most Important Lessons from Restaurants | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAlexandria Ocasio-Cortez Learned Her Most Important Lessons from RestaurantsThe youngest woman ever elected to Congress ran much of her campaign out of a paper grocery bag behind the bar at a Manhattan taqueria.By Hilary CadiganNovember 7, 2018FacebookTwitterEmailPhotograph by Corey TorpieFacebookTwitterEmailAlexandria Ocasio-Cortez orders a pastrami taco, hold the guac. It’s a cloudy Monday in late August and we’re sitting at a four-top near the back of Flats Fix, a narrow Manhattan taqueria sidled up next to Union Square. This isn’t just another random interview-in-a-quiet-restaurant selection, though—and not just because this place isn’t quiet.Until last February, Ocasio-Cortez spent most of her days working here, slinging tequila-based cocktails and living off tips from the happy hour crowd. Everyone knows her: the servers, the bartenders, the cooks, the regulars. “I haven’t been back in awhile,” she tells me, as yet another former coworker comes up for a hug. “Things have been a little crazy.”Yes. A little crazy.Last night Ocasio-Cortez became the youngest woman ever elected to Congress. But on the day of our interview, she’s still processing the reality of  having trounced the 14th District’s powerhouse incumbent Joseph Crowley in the Democratic primary. Crowley had been in politics since before she was born, repped the district unopposed since 2013. Ocasio-Cortez, a 29-year-old self-described Democratic Socialist of Puerto Rican descent, didn’t even have a Wikipedia page. Her campaign spent just over 5 percent of what Crowley’s did. And yet, on June 26, 2018, she beat him by more than 14 percentage points and rocketed into the national spotlight; not just as an unexpected victor who proved all the polls wrong, but as a shining light for progressives—and especially young people of color.Here at Flats Fix, with its a zigzag of fluorescent lights and trip-hop playlist and giant yellow surfboard affixed to the wall, she’s taking a moment to reflect.“My campaign started in food, and in a lot of ways evolved out of food,” she tells me, motioning toward the wooden counter that runs the length of the restaurant, the bottles of José Cuervo and Patron stacked on shelves strung with red fairy lights and South American flags. “For 80 percent of this campaign, I operated out of a paper grocery bag hidden behind that bar.” Between shifts at the restaurant, she’d reach into the bag for her political literature and a change of clothes, then set out to canvass.She leans across the table, her jean jacket buttoned all the way up, her large brown eyes intense, magnetic. “For me it was especially potent that I was working in the food service industry while running for office because I wasn’t, like, reminiscing on some summer job I had when I was a teenager. This was the life I was living.”For Ocasio-Cortez, food is political, and the most tangible indicator of our social inequities. Sure, as living beings we all must eat to survive—and there’s unity in that—but what we eat and how much and where it comes from and what we must do to get it varies widely. “The food industry is the nexus of almost all of the major forces in our politics today,” she says. “It’s super closely linked with climate change and ethics. It’s the nexus of minimum wage fights, of immigration law, of criminal justice reform, of health care debates, of education. You’d be hard-pressed to find a political issue that doesn’t have food implications.”Most politicians, she points out, are disconnected from these realities. At the start of this Congress, the median net worth of members across both parties was five times that of an American household. “Many members of Congress were born into wealth, or they grew up around it,” Ocasio-Cortez says. “How can you legislate a better life for working people if you’ve never been a working person? Try living with the anxiety of not having health insurance for three years when your tooth starts to hurt. It’s this existential dread. I have that perspective. I feel like I understand what’s happening electorally because I have experienced it myself.”Alexandria Ocasio-Cortez as a baby with her late father, Sergio Ocasio.\nCourtesy of Alexandria Ocasio-CortezAlexandria Ocasio-Cortez was born in the Bronx, the daughter of Sergio, an architect, and Blanca, who cleaned houses and drove a bus to make ends meet. “We were poor, so I was used to eating rice and beans every day,” Ocasio-Cortez recalls. “Also—what do they call it in English? Cream of Wheat. I loved Cream of Wheat. With sugar.”Every year for her parents’ anniversary, Sergio would dig up a traditional Puerto Rican roasting pit in the backyard and spend hours turning a whole pig on a spit until the meat was smoked crisp on the outside, juicy-tender on the inside. Those are some of her best memories.When she was five, her family moved to a considerably more affluent suburb of Westchester County, New York, where the public schools were better. But that didn’t mean life got easy, she says. “The thing that people don’t realize is that wherever there is affluence, there’s an underclass. There’s a service class. And that’s what I grew up in, scrubbing toilets with my mom.” But the Ocasio-Cortez family found their place in the community, inviting employees of the local Dunkin’ Donuts over for Thanksgiving dinner, serving their turkey with pernil, a Puerto Rican–style roast pork shoulder bathed in tangy sofrito.“My dad used to say that he collected people,” she recalls. “If you didn’t have a place to go on Thanksgiving, you came to our place. We never had a table big enough to fit everyone, but we’d always have folding chairs. You’d make a plate, eat it out of your lap, and share stories.”She wanted to be a scientist when she grew up, but her first on-the-books job was at an Irish pub, at 15 or 16 years old, working as a hostess to pay for her extracurriculars. She’d split up the after-school hours: a few days a week working at the pub, a few taking the commuter rail into Manhattan to run experiments out of Mount Sinai Medical Center in Spanish Harlem. She was competitive, won second prize at the world’s largest pre-collegiate science fair, got a small asteroid named after her as a reward: the 23238 Ocasio-Cortez. Oh yeah, and she always loved cooking because: “That’s what it is. You know? It’s chemistry.”As a freshman at Boston University, Ocasio-Cortez moved into pre-med housing. More science; that was the plan. But then she studied abroad in Niger, doing rotations at a maternity clinic on the outskirts of Niamey. The country, ranked last in the UN Human Development Index, was recovering from severe famine. “I saw a lot of pretty brutal things there,” she says, recalling babies born on steel tables covered in nothing but wax print cloth. Cemented in her mind is one particularly difficult pregnancy that resulted in a stillbirth: “The reason the child had passed was very preventable. For me it was a very powerful moment. This child’s life was literally decided because of where it was born.”Suddenly the path she’d planned—medical school, becoming a doctor, having a family—no longer seemed like an option. “I couldn’t just go back home and lead a normal life,” she says. “I just…couldn’t.” Though she recognized the importance of individualized care, she wanted to go bigger, deeper, down to the dark roots of suffering. So she switched her major to economics and began to focus on policy—and in particular, the issues that affected her own community of working class people of color in the Bronx.After graduation Ocasio-Cortez returned to New York where she was hired as an educational director at the National Hispanic Institute, a nonprofit serving Hispanic youth. But she also went back to the restaurant industry: bartending and waitressing were necessary to supplement her income, which she used to help her mother stay afloat after Sergio died of cancer. At restaurants, she worked side by side with immigrants both documented and undocumented. Their stories and experiences informed her work as a local organizer.“For me what’s important is to value the hands that go into your food,” she says. “All of them.”Ocasio-Cortez at a bodega in Queens, New York.\nPhotograph by Andy HurAbout one-third of the people working in the food-service industry are undocumented, with most holding the lowest-paying jobs, like bussing tables and dishwashing, according to a recent Pew Research Center study. In the agricultural industry, that number rises to more than half. As a result, restaurant kitchens, food-processing facilities, and commercial farms have been a frequent target for U.S. Immigration and Customs Enforcement (ICE) since it was formed in 2003. But after President Donald Trump took office in January 2017, raids and arrests surged, and not just in the food industry.During the current administration’s first 100 days, ICE apprehended 41,318 immigrants, up 37.6 percent over the same period the year before, according to the agency. But arrests of immigrants with no criminal record represented the biggest statistical increase: that number more than doubled by the end of April 2017. And we have yet to see the results of more recent White House policies.While these mandates aren’t the only factors contributing to the increasingly severe labor shortages reported at restaurants across the country, they certainly play a part, especially when coupled with ramped-up enforcement at the border. Between 2015 and 2017, the number of National Restaurant Association members reporting labor recruitment as their top challenge more than doubled.“The tenor of working at Flats Fix became very different,” Ocasio-Cortez says. ICE never raided this particular restaurant, but the fear that they might permeated the kitchen. Immigrant workers, even many who were here legally, began quitting and returning to their countries of origin.She recalls one long-term brunch chef, nicknamed “Grande,” who’d been at the diner next door (where she also worked) for 15 years. “He ran the line like clockwork,” she says. The Coffee Shop, as it was called, had once been an iconic New York City establishment, even a regular setting for Sex and the City. But after Grande returned to Mexico, the workers who were left couldn’t keep up with demand. “You can’t hire that back. That stuff takes years to perfect,” she continues. “Our kitchen got all messed up. We had to change our brunch menu because we couldn’t handle the same volume of orders anymore.”Last month the Coffee Shop shut down.Ocasio-Cortez celebrating her primary win.\nPhotograph by Corey TorpieOcasio-Cortez’s platform is one built on her own life experiences. Her push for universal Medicare strikes a particular chord with the more than 85 percent of restaurant workers whose employers do not offer health insurance. Her proposed doubling of the federal minimum wage from $7.25 to $15 addresses the income imbalances brought on by the tipping industry and the 40 percent of restaurant workers living in near poverty. Even her calls to abolish ICE tie in to the frequency with which immigrant restaurant workers are targeted.“It’s one thing to put your head in the sand,” she says, “but it’s another to actively disrespect and hate the people who feed you. Because honestly, that’s what a lot of this anti-immigrant rhetoric is about. You’re hating the people who feed you, which is a pretty messed-up thing.”It’s this conviction, perhaps, that allowed her to win a seemingly unwinnable primary, even as a young, unknown, and underfunded candidate. Taking a seat in the House of Representatives never seemed out of the question.“Even when things looked their worst—like in January when it was just me and my partner in our apartment and I was bartending full-time while challenging one of the most powerful members of Congress—never did I feel like I didn’t have a shot,” she tells me. Her communications manager is signaling we’ve run out of time. “Because I’m an organizer. I’m on the ground. I know my community. We acknowledge that all this shit is stacked up against us, but we don’t get to give up. We don’t have the luxury.”She pushes her chair back, gets up to go, her taco only half eaten.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-07", "author": ["Condé Nast", "Hilary Cadigan"]}