{"id": "c9fd4eacc441c33e62bc8f269b078761", "url": "https://www.bonappetit.com/story/pecan-thumbprint-cookies", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "These Thumbprint Cookies Will Remind You of Mini Pecan Pies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingImagine Pecan Pie In Cookie Form, Then Bake and Eat ItThese pecan thumbprint cookies with a gooey frangipane filling are like mini bites of pie.By Alex BeggsDecember 4, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susan Spungen, prop styling by Kalen KaminskiFacebookTwitterEmailAll along, I thought I’d have to stick my thumb in something. But it turns out, thumbprint cookies are just symbolic, like inflatable snowmen and bourbon on the breath of a mall Santa. To master these iconic holiday cookies I wouldn’t need to burn my flesh in buttery cookie dough. The indentation is made by a teaspoon’s rounded rump.Let me tell you more about these cookies tho. Chris Morocco developed the official Bon Appétit lineup of holiday cookies this December, a task as important and Herculean as the Thanksgiving turkey. How do you convince people to try something new when they’ve been baking the same cookies for decades? By developing some really special, showstopping cookies that they just can’t resist. My favorite recipe (to eat during testing) was this one for double pecan thumbprint cookies. They’re like pecan pie in cookie form. The dough is a buttery pecan shortbread and the frangipane filling is this sweet and gooey pecan paste. Top it off with a crunchy pecan half and an elf’s sneeze of powdered sugar and call it Christmas, folks!I spent a rainy Sunday morning baking the pecan thumbprints, so know that these are a project. You need the leisure of time (not ALL day), but you can do this over two days if you’ve got things to do and people to see. The recipe is basically two mini recipes, the cookie dough and the frangipane. Both need the food processor, and to chill. Project means it’s got a few moving parts, but that doesn’t mean it’s technically difficult. It’s not. It’s mixing stuff. What took me time was setting up two separate mise en place (egg yolk over here, egg white over there)—which I highly recommend to stay organized—and then pausing to wash the food processor in between. You can mix the frangipane a few days ahead if that makes your life easier.The hardest part for cookie amateurs like myself was achieving that picture-perfect shape. You use a tablespoon to measure the cookie dough, but lazy, heaping scoops and lazy, under-filled scoops left me with some that were smaller than others. And then the thumbprint. The recipe suggests the handle of a wooden spoon to make the imprint, but I found the bottom of a metal ½ teaspoon to be better, since you’ll then use that same spoon to measure the frangipane. If your imprints are too shallow, you won’t get that satisfying frangipane gooey-center in every bite. See how I’m looking out for you?Because there’s so much butter in this cookie (hey, it’s a cookie), they can keep for a while—up to five days! And the sturdy pecan-flour dough holds up well in say, a festive holiday tin you bought 50 percent off last January. If you’re looking for a make-ahead cookie to win the swap at the office this year, or cookies you can ship to family across the country, or just a cookie that tastes like a mini pecan pie because that sounds insanely good, this is the one.Get the recipe:Double Pecan ThumbprintsThese buttery frangipane-filled pecan buttons are decadent without being fragile, and they make excellent cookies for boxing up and giving as gifts.View RecipeYou know what would make a pretty great holiday gift? Our magazine! And a cool tote bag, plus some great baking tools for holiday cookies. More details here.Explore Bon AppétitCookieHoliday Cookiesholiday2018PecanDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-04", "author": ["Condé Nast", "Alex Beggs"]}