{"id": "ca0131c79a4c789c62f568f40d96dbc7", "url": "https://www.bonappetit.com/recipe/soy-braised-chicken-wings", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Soy-Braised Chicken Wings Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueSoy-Braised Chicken WingsBy Lisa Cheng SmithNovember 19, 20194.2(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Lillian Chou, prop styling by Beatrice ChastkaEmailPinterestPrintEmailPinterestPrintDark soy sauce along with regular soy sauce is what gives these wings their rich color (if you can’t find it, use regular soy sauce). We like to use all flats–arguably the best part of the wing!—but a mix with drumettes or whole wings works too. This recipe is from Taiwanese-American cook Lisa Cheng Smith’s spectacular Lunar New Year feast. Find the rest of her menu here.Ingredients8 regular or 16 small servingsFive-Spice Powder2½4\"-long cassia or cinnamon sticks20whole star anise1Tbsp. plus 1 tsp. whole cloves20slices dried sand ginger (optional)2Tbsp. plus 1½ tsp. Sichuan peppercorns2½tsp. sliced dried licorice root or fennel seeds1tsp. black peppercorns1tsp. white peppercorns (optional)Chicken Wings and Assembly23\" pieces ginger, scrubbed, thinly sliced, divided½cup dark soy sauce, divided20–24chicken wing pieces (about 2½ lb.)3Tbsp. vegetable or sunflower oil1shallot, thinly sliced3scallions, roots trimmed, halved crosswise5garlic cloves, smashed1red finger or Fresno chile, halved lengthwise3oz. Chinese rock or lump sugar or ¼ cup raw sugar3whole star anise2pieces dried licorice root (optional)14\"-long cassia or cinnamon stick¼tsp. freshly ground white pepper (optional)¼tsp. Sichuan peppercorns½cup low-sodium soy sauce¼cup unseasoned rice wineThickly sliced cucumbers (for serving; optional)Special EquipmentA spice mill or coffee grinderPreparationFive-Spice PowderStep 1Toast cassia, star anise, cloves, sand ginger (if using), Sichuan peppercorns, licorice root, black peppercorns, and white peppercorns (if using) in a small skillet over medium, tossing once, until fragrant, about 3 minutes. Let cool; grind to a powder in spice mill or coffee grinder.Step 2Do Ahead: Five-Spice Powder can be made 1 month ahead. Store airtight at room temperature.Chicken Wings and AssemblyStep 3Mix half of ginger, ¼ cup dark soy sauce, and 1 tsp. Five-Spice Powder in a medium bowl. Add wings; toss to coat. Cover and chill at least 1 hour and up to 8 hours.Step 4Heat oil in a wok or large deep-sided skillet over medium-high. Add shallot, scallions, garlic, chile, and remaining ginger and cook, stirring, until fragrant, about 2 minutes. Add rock sugar, star anise, licorice root (if using), cassia, white pepper (if using), Sichuan peppercorns, and remaining 1 tsp. Five-Spice Powder and stir to combine. Pour in low-sodium soy sauce, remaining ¼ cup dark soy sauce, and 1 cup water. Bring to a boil, then reduce heat to medium-low.Step 5Lift chicken wings out of marinade; discard marinade. Add wings to wok and pour wine over. Stir gently, then bring to a simmer. Cover and cook over medium-low 15 minutes. Gently stir, then cover again and continue cooking until chicken is cooked through and a deep brown color, about 15 minutes longer. Using a spider or slotted spoon, transfer wings to a plate.Step 6Pour liquid in wok through a fine-mesh sieve into a small bowl; discard solids. Return strained liquid to wok and bring to a simmer over medium-high. Cook until sauce thickly coats a spoon, 10–12 minutes. Return chicken wings to sauce and toss to coat. Using a spider or slotted spoon, transfer to a platter. Serve with cucumbers if using.How would you rate Soy-Braised Chicken Wings?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleExceptionally tasty. Like other reviewers mentioned, it took longer than the recipe stated to cook the sauce down to a glaze. Really no complaints, pretty straight forward to make, especially if you use store bought five spice like I did. Next time I'll up the chilis and add some crushed red pepper flakes because I did wish it was a bit spicier. Awesome recipe. Can't say that mine looked exactly like the picture but also I really don't care - the flavor was AMAZING. FredWashington, DC2/27/2022Outrageously good. LIke some, I used a pre-made five-spice blend. Will probably make it from scratch one day but didn't have time.  Couple of modifications: doubled the chicken (you'll congratulate yourself); added six Thai chiles and about four serranos (chopped)--just \"kinda spicy\" in our opinion; we were out of sugar so I used a few tablespoons of honey instead; mirin for the rice wine; did NOT strain out the solids (you crazy? It's pure goodness!); threw in 2-3 tsp of cornstarch at the end to thicken.  I'd spring for the dark soy sauce; it gives an intense color.  As for how they looked compared with the photograph: mine looked almost exactly the same but in the end, who cares?  These are a huge flavor bomb. Garnish with mini marshmallows. (JK) Will absolutely make again.PaulTexas5/25/2021This was a fantastic recipe, but I  am giving it 4 stars instead of 5 because it looks nothing like the photograph. Mine came out more saucy and I threw it under the broiler for 5 minutes, which gave it a nice char but still looks nothing like the photo.  If you are going to use normal soy sauce (instead of reduced-sodium called for) I recommend reducing the amount of soy sauce by 1/3 or 1/2 and perhaps replacing the volume with water or some sort of broth, or else you will be left with too much salty taste that is overpowering. Finally my sauce reduced beautifully in about 15-16 mins, not the 10-12 listed. But at the end of the day these wings are amazing and I will be making them again in the future. AnonymousNew York, NY11/2/2020Very tasty. These were not too difficult to make in my experience, but I used a pre-mixed fivespice blend. I agree with previous reviews saying the sauce takes quite a while to thicken, especially if simmering over low heat to avoid burning the sugar. I do not have low-sodium soy sauce and was just using a light soy sauce, and I would recommend cutting down the amount to 1/3 cup because I found the salty slightly overpowering the sweet when I used 1/2 cup. I also am not sure how to get the nice \"crispy\" looking sheen in the photo, but maybe that is the result of me not letting the sauce/glaze thicken enough. AnonymousMissouri9/25/2020These were indeed very tasty - and good thing - since they take a LONG time to make. I found the sauce took at least twice as long to thicken and I popped the wings and sauce under the broiler for a few minutes, trying to get that gorgeous glazed look like in the photo to no avail. They weren't pretty, but we all loved them.AnonymousSalt Lake City, Utah8/23/2020These are delicious! The balance of spices is perfect. I made them a month or so ago and I crave them all the time. AnonymousOakland CA1/22/2020These were DELICIOUS!  I had to make some minor ingredient substitutions, but I will be making this recipe anytime I want Teriyaki flavored wings.  AnonymousDallas, TX1/6/2020Explore Bon AppétitChineseEast AsianAsianChicken WingChickenPoultryStarterMainNut-FreeDairy-FreeBraiseSuper BowlLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Lisa Cheng Smith"]}