{"id": "ca0519484c4cdc1dd34dfb83e84d67e7", "url": "https://www.bonappetit.com/recipe/nhoam-trey-mhasamout-grilled-halibut-salad", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "Nhoam Trey Mhasamout (Grilled Halibut Salad) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNhoam Trey Mhasamout (Grilled Halibut Salad)By Chanthy YenOctober 6, 20204.8(6)Read ReviewsTriangleEmailPinterestPrintPhoto courtesy Chanthy YenEmailPinterestPrintEmailPinterestPrint“In most Cambodian households this dish relies on the earthy flavors of fresh fish caught from the Mekong River, which are then sun-dried and smoked over an open flame,” writes Chanthy Yen, the chef at Touk and at Parliament Pub & Parlour in Montreal. Since we don’t have access to fish from Cambodia, we’ve adapted this recipe by using fresh halibut that is grilled and topped with a bright and citrusy dressing loaded with aromatics. This fragrant salad is a multisensory experience—every bite is infused with a different combination of crispy shallots, juicy citrus, fresh herbs, and tender, grilled fish. Yen has cooked around the world and across cuisines, but it took the pandemic for him to return to his roots—the Cambodian food he first learned from his remarkable grandmother. Read his story here. Ingredients4-6 servingsHalibut112-oz. fillet halibut or haddock1tsp. vegetable oilKosher saltDressing1Tbsp. finely chopped lemongrass1Tbsp. finely chopped ginger1Tbsp. finely chopped galangal or ginger2limes2Tbsp. fish sauce2Tbsp. vegetable oil1Tbsp. shrimp paste½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt½tsp. freshly ground black pepperSalad and assembly1pomelo or 3 small or 2 large white grapefruits, peeled, segments torn into 1\" pieces3medium tomatoes (about 1 lb.), cut into wedges1bunch scallions, thinly sliced on a diagonal1small bunch cilantro, leaves with tender stems picked, torn1small bunch mint, leaves picked, torn3cups coarsely chopped purple or green cabbage (about 1\" pieces)2medium shallots, thinly sliced1red or green Thai chile, thinly sliced¼cup crispy fried onions¼cup puffed rice, preferably wild (optional)PreparationHalibutStep 1Prepare a grill for medium-high heat. Rub halibut all over with oil, then season with salt. Grill, turning halfway through, until just cooked through, about 5 minutes total. Transfer to a plate.DressingStep 2Pound lemongrass, ginger, and galangal in a mortar and pestle to a paste. (Alternatively, you can pulse in a food processor.) Transfer to a small bowl and finely grate zest from limes into paste. Halve limes and squeeze in juice; mix well. Add fish sauce, oil, shrimp paste, salt, and pepper and mix again to combine.Salad and assemblyStep 3Gently toss pomelo, tomatoes, scallions, cilantro, mint, and cabbage in a large bowl to combine. Flake grilled halibut into bowl and add any accumulated juices on plate. Pour dressing over salad and gently toss to coat.Step 4Divide salad among plates. Top with shallots, chile, crispy fried onions, and puffed rice (if desired).How would you rate Nhoam Trey Mhasamout (Grilled Halibut Salad)?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThe recipe includes shrimp paste.  I'd never used it before.  As soon as I opened the jar I had second thoughts.\nThe recipe includes Thai fish sauce, which is stinky in its own right.  But the shrimp paste....good God it reeks.\nI tried watering down the sauce in which the shrimp paste is used.  I used a lot of lime juice.\n\nBut still......\n\nI threw out the jar of shrimp paste about half an hour ago.\n\nIf you ever want to get revenge on someone, smuggle a jar of shrimp paste into the house and open it.  Even better, open it and microwave it.  But you'd better run as soon as you start nuking it.  Else you'll vomit from the smell.  Rotten lobster may smell more disgusting, but not by much.\n\nIn retrospect, the recipe is bad in several respects:\n\n    It takes a wonderful mild fish -- halibut -- and overpowers it with a stinky concoction that includes Thai fish sauce and shrimp paste.  Why overpower a good mild fish like halibut with that?  If you want a strong, fishy flavor, use a fish with a strong, fishy flavor, like salmon, bluefish or even [shudder] mackerel.\n    The pomelo fruit is too difficult to peel and section.  Better to use a more easily-peeled citrus.\n    Cabbage is too crunchy for this recipe.  Field greens or spring mix would be better.\n    The portions of salad are far too large, relative to the amount of fish.  We have a large amount of leftover salad.  We will use it with smoked sockeye that I cooked last night.\n\nObviously we won't be making this recipe again.SasquatchAnytown, USA10/9/2021This was delicious! I didn’t have shrimp paste, so I subbed anchovy paste instead, and it was still wonderful. Used black cod instead of halibut too. Can’t wait to try again and possibly add some cashews. Thank you!AnonymousNew York, New York10/24/2020wow this looks so delicious can't wait to tryAnonymousBrooklyn, NY 10/6/2020Explore Bon AppétitSaladCambodianSoutheast AsianAsianHalibutFishSeafoodMainDairy-FreeNut-FreeGluten-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-06", "author": ["Condé Nast", "Chanthy Yen"]}