{"id": "ca144e4aa35772626905a614b9597c12", "url": "https://www.bonappetit.com/story/favorite-restaurants-2019", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "The 24 Restaurants We Couldn’t Stop Talking About in 2019 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe 24 Restaurants We Couldn’t Stop Talking About in 2019(And that we’ll definitely be still thinking about in 2020.)By The Bon Appétit StaffDecember 16, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailSome people might be making their 2020 resolutions right now (you do you), but our brains (and bellies) are still thinking about 2019. We’re walking down our food memory lanes and reminiscing about all the delicious things we ate this year—and the restaurants we could not shut up about.Apologies in advance to our partners, friends, families, and hair stylists trapped cutting our hair that have heard about these spots—exhaustively—but we’re bringing it up here yet again. Here we are shouting from the internet rooftops about the restaurants we loved the most. Scroll on to see the BA staff favorites. Maybe you’ll even get an idea or two for a resolution, uh reservation, to make in the new year. Bungalow by Middle Brow, Chicago“This self-described ‘beer, bread and pizza den’ in Chicago’s Logan Square is a perfectly imperfect restaurant run by what I suspect is a beautiful group of weirdos (read their blog; you’ll get it). Where else in the country can you suck down a peach brut IPA with your naturally fermented, wood-fired pizza, and then leave at the end of the night with a free loaf of wonderfully dense sunflower seed bread because it was the end of the night and your server told you ‘someone should eat it.’!?” —Christina Chaey, associate editorInstagram contentThis content can also be viewed on the site it originates from. Atoboy, New York“Atoboy opened a few years ago, and each time I go, I’m reminded how special of a restaurant it is. The Korean-inspired food is insanely creative; I love the chrysanthemum salad with leek, plum, and cheddar and dream of the beef tartare with... pineapple! Plus, the granita (with BURRATA) is, I’m convinced, the best dessert in New York City.” —Carey Polis, digital directorInstagram contentThis content can also be viewed on the site it originates from. Yang’s Kitchen“If the only menu item at Yang’s Kitchen in Alhambra, California, was its stick-to-your-bones beef noodle soup, that’d be enough to make it the restaurant I didn’t stop thinking about this year. The bowl is filled with rich Santa Carota grass-fed beef broth, chewy noodles made with Grist and Toll whole wheat flour, and super tender beef shank and brisket. But then there’s also the whole-grain scallion pancake that’s the size of my face. And agua fresca with oolong, orange, lemongrass, makrut lime leaf, and mint that’s the drink version of the splashing-water-on-your-face moment in every Neutrogena commercial. Oh, and the milk soft serve with sweet corn flakes that is every cereal lover’s fantasy. So, yeah, come for the soup and stay for literally everything else.” —Rachel Karten, associate director of social mediaInstagram contentThis content can also be viewed on the site it originates from. Saint Julivert Fisherie, Brooklyn“When I found out Alex Raij and Eder Montero, the duo behind some of the most beloved neighborhood restaurants in New York City, were opening a seafood restaurant in Cobble Hill, I was immediately intrigued. While the two chefs (and partners in life) are known for their Spanish tapas, the menu at their newest venture draws inspiration from all over. The fatty hamachi collar is rubbed with smoky jerk seasoning before being perfectly charred, and it demands to be picked apart with your hands. The scene stealer though is a tuna casserole like you’ve never seen before: spiked with curry leaf and tomato and packed with tiny noodles that are so crispy, you’ll think they’re deep fried. It’s the type of comfort food you wished you actually had growing up, but will happily go back to Saint Julivert for.” —Andy Baraghani, senior food editorInstagram contentThis content can also be viewed on the site it originates from. Green Almond Pantry, D.C.“All of a sudden, my wife was crying. And it wasn’t because of anything I said. We were sitting at the counter of Green Almond Pantry—a tiny restaurant/market/takeout in the Shaw neighborhood of Washington, D.C.—and Simone’s eyes welled up after one bite of the open-face egg sandwich we ordered. Seven-minute jammy eggs sat atop a charred baguette and they were festooned with pickled rainbow radishes and, what I think, were mustard seeds, celery chunks and leaves, and a generous dousing of red wine vinaigrette. Sometimes you can just tell that food is made with love. And when you can, it’s okay to cry.” —Adam Rapoport, editor in chiefInstagram contentThis content can also be viewed on the site it originates from. 손맛 By Tae, Seattle“This is by far my favorite restaurant meal of 2019. I’m not sure if it was because I was offered a Capri Sun at the very beginning, or that I ate the best crab dumpling soup I’ve ever had out of a coffee cup, or that I was asked at the end of the meal by the chef if I had actually had enough to eat, but this lunch-only counter-service, omakase-ish restaurant tucked behind a bakery in Seattle completely charmed me.” —Priya Krishna, contributing writerInstagram contentThis content can also be viewed on the site it originates from. Golden Diner, New York“Golden Diner is the kind of place I thought could only exist in a sitcom (or quaint New England town): It’s cozy but not so small that you can’t get a table, with a menu full of dishes that are comforting but nowhere near boring. The pastry case is stocked with matcha-hojicha coffee cake, for crying out loud—but I assure you, this place is real. I’m just as eager to go for breakfast, where I’ll order the egg sandwich with the crispiest-ever hashbrown on a scallion milk bun, as for dinner, where I get the vegetarian hero with charred yuba (and, if I’m lucky, the patbingsu dessert special). Some speculate that the classic New York City neighborhood diner is dead, but I’m betting that restaurants like Golden Diner, with Thai cobb salad and seasonal bibimbap bowls, will beckon its revival.” —Sarah Jampel, Basically editorInstagram contentThis content can also be viewed on the site it originates from. Café Regina, San Juan, PR“Watching the chilled-out crowd of regulars at Café Regina seriously made me contemplate moving to San Juan, Puerto Rico. The Santurce location checks all my all-day café boxes: a dog-friendly sunny porch, generous pours of small-batch coffee, and delicious sourdough toasts topped with tropical fruits, and, yes, avocado.” —Aliza Abarbanel, assistant editorInstagram contentThis content can also be viewed on the site it originates from. Sey Coffee, Brooklyn“2019 was the year I became the kind of person I never thought I’d be, and that’s a coffee person. And I have Sey, the high-ceilinged, plant-filled, extremely Brooklyn-y coffee shop to thank for breaking my 33-year caffeine-free streak. Also, romance: I was dating a guy who lived down the street, and what started as a few sips of his iced oat milk latte one summer morning became a swan dive into pour-over sets, burr grinders, gooseneck kettles, and digital scales. Nothing I make will ever be as good as that latte, but now that I know what perfection tastes like, I can make up for lost time.” —Amanda Shapiro, Healthyish editorInstagram contentThis content can also be viewed on the site it originates from. Joy, Los Angeles“I went home an absurd number of times this year—multiple weddings!!—and Joy was my first meal. Every. Single. Time. The thousand layer pancake with egg and cheese is what dreams are made of, but the dan dan noodles and vegetarian mapo tofu are also very, very good. Plus, the space itself is in a beautiful, old (for California) building with lots of sunshine that makes me want to move back to Los Angeles.” —Alex Pastron, audience development managerInstagram contentThis content can also be viewed on the site it originates from. Shabu Shabu Macoron, New York“No place has surprised me in 2019 the way Shabu Shabu Macoron in NYC has. From watching chef Mako Okano spin between bubbling pots to personally swish each guest’s course to realizing that, yes, ‘90s hip hop is exactly what I want to listen to while a sliver of A5 wagyu melts on my tongue, I was delighted at every turn. This isn’t the rowdy communal shabu shabu I’ve come to know. Instead, as the first-ever (allegedly) omakase shabu shabu restaurant, it’s a deliberate study in simmering, swishing, and slurping.” —Sohla El-Waylly, assistant food editorInstagram contentThis content can also be viewed on the site it originates from. Folk, Detroit“I’ve thought a lot about Folk in Detroit since I first went last summer. The venue is airy and welcoming without leaning into the over-designed tropes of the all-day café genre. Instead, it’s the type of neighborhood-y space I could actually spend all day in, chatting with owners Kiki Louya and Rohani Foulkes about local farms they partner with and trying new additions to their constantly changing menu, like the hearty bowls of soba crowned with roasted mushrooms and the almond flour waffles showered with Michigan maple syrup.” —Jesse Sparks, editorial assistantInstagram contentThis content can also be viewed on the site it originates from. Gee Whiz Diner, New York“I love Gee Whiz because it is everything I think a worthwhile NYC diner should be. The food isn’t great, but the menu is huge, laminated, and reassuring. What comes out of the kitchen comes fast, and it’s nothing if not consistent. Since I always order the same thing (spinach and feta omelet with fries instead of home fries, side of rye bread), this arrangement works out fine. The service is friendly-gruff, the booths are red pleather, and the orders are taken on standard paper waiter pads before being ripped off and placed in the dew that has collected beneath your plastic cup of ice water. Pay at the counter; leave a tip on the table. Gee Whiz even has stunning seasonal decorations and a refrigerated case of rotating pies. In other words, it’s perfect.” —Carla Lalli Music, food editor at largeInstagram contentThis content can also be viewed on the site it originates from. Sonoratown, Los Angeles“My colleague Aliza wrote about the supremely delicious flour tortillas at L.A.’s Sonoratown back in May. As a diehard flour tortilla fan (I know, I know, it’s a controversial opinion), I had to go when I was back home later in the summer. The succulent, vaguely pork-y, chewy-but-thin tortillas did not disappoint—and neither did the fillings they were wrapped around. I ate a lot of good things this year, but it’s those perfect flour tortillas I crave on the regular.” —Emma Wartzman, assistant editorial producerInstagram contentThis content can also be viewed on the site it originates from. Hao Noodle and Tea By Madam Zhu’s Kitchen, New York“First it was the cold wood ear mushrooms. Then the delightfully gummy mung bean jelly. The perfect pillows of eight-spice tofu. The chile wontons. The dan dan noodles. The beef with walnuts... I spent 2019 working my way through the entire menu at Hao Noodle in New York City, and I still haven’t met a single dish I didn’t flip my shit over. It became my go-to for intimate catch-ups with friends and big celebratory gatherings with family, for casual Tuesday nights and fancy-feeling Fridays. Oh, did I mention the space on 6th Avenue is beautiful? Yeah. It’s pretty much everything.” —Sasha Levine, Bonappetit.com editorInstagram contentThis content can also be viewed on the site it originates from. Izakaya Minato, Portland ME“When I started dating someone who lives in Portland, Maine, I started going there a lot. Which is lucky for me since it was our Restaurant City of the Year in 2018! And as I realized I really liked this person, I also realized I really liked Izakaya Minato. Obviously Maine is synonymous with fresh seafood, but everything at this little Japanese bar is treated with so much care, from the perfectly chilled carafes of nigori-style sake to the crispy-on-the-outside, pillowy-on-the-inside tofu. Oh, and the omakase is THIRTY DOLLARS and the perfect amount of food that leaves you feeling full without keeping you in your seat for three hours. They do every little thing so darn right there—it’s a must visit every time I’m in Portland.” —Emily Schultz, social media managerInstagram contentThis content can also be viewed on the site it originates from. Ochre Bakery, Detroit“I have family in Detroit, so I’ve been lucky enough to go to Ochre three times this year. And I got to follow Max Leonard’s journey from Guy Who Had a Secret Bakery in His House to Guy Who Makes Bread in a Professional Kitchen Now. My favorites at Ochre are the seeded sourdough loaf and the espresso shortbread cookies. And the oaty, coconutty ANZAC cookies. I haven’t visited the city without stopping by the bakery—so in a way, it’s become like another relative...who I pay to love me. Nice.” —Alex Beggs, senior staff writerInstagram contentThis content can also be viewed on the site it originates from. Prairie Whale, Great Barrington MA“I wish I could tell you about some new place that is currently surfing around on several best-of lists. This isn’t that kind of recommendation. I am writing to say that I drove one hour out of my way during Thanksgiving (which became three hours out of my way once it began to snow and the roads became a skating rink) to go to the Prairie Whale in Great Barrington, Massachusetts, on my way back to NYC from Boston. And it was totally worth it. Housemade ’nduja slathered on grainy bread with soft eggs, artful huevos rancheros, a grass-fed burger with pickled green tomato and the best fries. The Prairie Whale has been consistently fantastic ever since it opened, and chances are, even if you go a long way out of your way to get there, it will be totally worth it.” —Chris Morocco, deputy food editorInstagram contentThis content can also be viewed on the site it originates from. Kopitiam, New York“I think I was probably the last person on the BA staff to make it to Kopitiam, but when I did I finally understood the hype. You can scarcely go wrong on the menu, but the pandan chicken (deeply flavorful minced chicken wrapped in pandan leaves) and the criss-cross shrooms (meaty, spicy, scored wood ear mushrooms) are the dishes I think about most.” —Meryl Rothstein, features editorInstagram contentThis content can also be viewed on the site it originates from. K’Far, Philadelphia“You know when you’re so excited to talk about something you can’t finish your sentence before starting the next? That’s how I’ve been talking about K’Far in Philadelphia, the new cafe from Camille Cogswell (the pastry chef of the legendary Zahav). So I’ll keep this simple: Perfectly executed espresso. Laminated babka with so many chocolatey layers. Fried toast with tahini and date syrup swirls. A phenomenally spicy zhoug, egg, and cheese on a sesame Jerusalem-style bagel that—like my sentences—will have you starting your second before you even finish your first.” —Alex Delany, associate editorInstagram contentThis content can also be viewed on the site it originates from. Big Tiny, Brooklyn“I love New York—sometimes; kinda; it’s complicated. But I also love pretending to be somewhere else, namely Europe, and my new favorite neighborhood French cafe-slash-wine-bar, Big Tiny in Carroll Gardens, allows me to do just that. I can while away the whole day there, starting with a morning latte, followed by a crock of cheesy-bready French onion soup, then get to some reading, and when the time is appropriate (noon), a glass of Syrah. Then more glasses of Syrah. Then a charcuterie board. Then more Syrah. What? I can’t here you. I’m in Paris. Connection is bad. Please forward my mail.” —Hilary Cadigan, associate editorInstagram contentThis content can also be viewed on the site it originates from. Longoven, Richmond“There’s always a weak dish on a tasting menu—not all 12 or 20 dishes can be perfect, I get it! But that’s not the case at Longoven in Richmond, Virginia. Every dish I had was spot on, from the cloud-like foie gras to the uni- and buttermilk-streaked grilled romaine. Don’t even get me started on dessert!” —Elyse Inamine, digital restaurant editorInstagram contentThis content can also be viewed on the site it originates from. Win Son Bakery, Brooklyn“If toasted buttered brioche, creme brûlée, and flan were in a thruple, Win Son Bakery’s custard toast would be their love child. I am salivating just writing these words! The first time I ordered it, it landed on the table—thick and buttery like Texas toast, warm with a caramel-y top, and custardy flan baked inside waiting to devoured. And that’s exactly what I did. And then I ordered another one.” —Rick Martinez, contributorInstagram contentThis content can also be viewed on the site it originates from. Gracie’s Luncheonette, Leeds NY“This year, I became an upstate New York regular, and naturally, that status extended to Gracie’s too. The food here is unfussy, but the breads, desserts, condiments, sodas, and even the American cheese is homemade. I always get the biscuits and gravy for breakfast. At lunch, I opt for the fried green tomato BLT and broccoli cheddar soup. Gracie’s is so good; you can’t help but become a regular. You heard it here first, kids!” —Bryan Fountain, senior designerInstagram contentThis content can also be viewed on the site it originates from.Explore Bon AppétitRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-16", "author": ["Condé Nast", "The Bon Appétit Staff"]}