{"id": "ca1e3cf3c4c40bfc831fb42a6cd3588f", "url": "https://www.bonappetit.com/recipe/stuffed-peppers", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "Stuffed Peppers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesStuffed PeppersBy Brad LeoneFebruary 22, 20183.8(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Styling by Chris MoroccoEmailPinterestPrintEmailPinterestPrintWe take classic stuffed peppers to the next level by adding a secret ingredient (chopped walnuts) and using both ground beef and ground pork to prevent the filling from drying out. Believe it or not, these are even better reheated the next day!Ingredients4 servings3Tbsp. extra-virgin olive oil1large onion, finely chopped¼cup chopped walnuts6garlic cloves, finely chopped1tsp. tomato paste½tsp. cayenne pepper½tsp. ground cumin½tsp. ground turmeric½tsp. smoked paprika¼cup dry white wine1tsp. kosher salt, plus moreFreshly ground black pepper½lb. ground beef (20% fat)½lb. ground pork1cup cooked rice¼cup golden raisins2oz. Parmesan, finely grated (about ½ cup), divided4medium or 6 small bell peppers, any color4cups tomato juice (100% juice)PreparationStep 1Preheat oven to 350°. Heat oil in a large skillet over medium. Cook onion, stirring often, until translucent and starting to brown, 10–15 minutes. Add walnuts, garlic, tomato paste, cayenne, cumin, turmeric, and paprika and cook, stirring constantly, until combined and garlic is softened, 2–3 minutes. Add wine and cook, stirring, until just slightly reduced, 1–2 minutes. Season with salt and pepper.Step 2Mix beef, pork, and remaining 1 tsp. salt with your hands in a large bowl. Fold in rice, raisins, and ¼ cup cheese with a wooden spoon and mix well to combine. Add onion mixture and mix with wooden spoon until incorporated.Step 3Carefully cut off bottom bumps of bell peppers to create a flat end so they can stand upright. Don’t shave off too much or the filling can leak out. Using a spoon, stuff peppers with meat mixture and fill to the top. Press down and pack pepper fully.Step 4Arrange peppers in a small Dutch oven or baking dish. Pour tomato juice around them, leaving about 1\" of pepper exposed.Step 5Top stuffed peppers with remaining ¼ cup cheese; season with pepper. Cover with foil and bake 1 hour. Uncover and continue to bake until peppers are tender and cheese is browned, about 30 minutes more.Step 6Do Ahead: Stuffed peppers can be made 2 days ahead. Transfer to an airtight container and chill. Reheat in a 350° oven, covered, until heated through, about 20 minutes.How would you rate Stuffed Peppers?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleThis recipe is the best stuffed pepper recipe I've ever made!  Absolutely delicious and very interesting!  I will definitely keep this one in the books for future use.  Thank you!Terri WarkMaine11/29/2021I thought these were flavorless. I made them for company after reviewing the reviews and have to say I was embarrassed. They had so little flavor. Needed more cheese in the meat mixture and perhaps some chili powder and/or a small amount of stewed tomato. It was like a bland meatloaf inside a pepper. I will NOT make this again!!Paula AsbraBoise ifaho3/11/2021People please, STOP reviewing if you haven't followed the recipe exactly! The chefs at bon appetit no doubt know a bit more about cooking than the average reviewer. These are the best peppers ever. The unique blend of spices adds a depth of flavor that you won't get if you change or omit them, and the mix of two meats makes is  so tender. I have never been a stuffed pepper fan, they are generally bland and too full of rice, but these were a wonderful surprise to both myself and the gourmet cook I made them for. Delicious!NancyLos Angeles1/21/2021Really good!  I made last night for a crowd not familiar with traditional stuffed peppers and they loved. I followed recipe minus the raisins and used parmesan and gruyere as that is what I had on hand..  Great flavors in the meat and the tomato juice thickened with the cooking.  I recommend good smoked paprika otherwise it will overtake the profile.  Can't wait for the leftovers. AnonymousGranite Bay, Ca6/3/2020Sooo good! I actually used a can of tomatoe sauce instead of paste and I used sauce+water+tsp of sugar in the bath. Very flavorful!! Idk what happened w that one reviewer below... My boyfriend loved these. Candieee13Los Angeles4/13/2020These were delicious!!  I made a few adjustments based on what I had in the house. I added a half a can of corn niblets (leftover!) and added a tablespoon of bbq sauce (end of a bottle) in place of the tomato paste. I used V-8 juice in place of tomato juice, again because it was already open in the fridge. It made enough for nine medium red peppers, which is dinner for two nights. Yum!AnonymousBrandon, Manitoba 4/5/2020I made it with a savory tofu instead of the meat and it was p good but also kinda strange. I tried to create replacement umami with msg, mushrooms, caramelized onions and a tiny bit of soy. Resulting flavor made roomates go \"hm...\" but the rice/pepper parts were very solid. I think I would recommend against vegetarianism (or at least against soy sauce) with this one, but top scores on the parts of the recipe I did not butcher (pun intended).NatWatAustin, TX3/18/2020Unfortunately, not delicious... very bland. We spooned the tomato sauce from the pot onto our plates, and because the tomato sauce was not seasoned in any way, it was very very bland.  I felt like, in hindsight, some of the tomato sauce might have been good mixed in with the meat mixture.  The red peppers themselves were very bland too.  I didn't have turmeric, but I didn't think that would make a huge difference.  Also, I will say that I did use a can of crushed tomatoes, instead of tomato juice... Not sure if that would have made a big difference either.   Disappointing.  CatCatCatgrand rapids, MI10/9/2019Good recipe but didn’t add the full slate of spices, cumin, smoked paprika, chili flakes.  Used beef only as no pork within reach.  Used cotilla cheese rather than parmesan which melts much better.  Overall a very good recipe that i will use again.  No tomato juice (really, tomato juice?  Who has that lying around?). Used jar sauce, calm down, it was  Valencia brand (best jar sauce on the shelf) thinned 50/50 with water.  Walnuts were good for texture but have a no-nut person sometimes and i don’t think the loss will be evident.  No sultanas but regular raisins provided a nice sweetness.  I liked it.  Good meat to rice ratio.  Careful with the smoked paprika as it is quick to overpower, used a quarter maybe.AnonymousPVD RI6/19/2019These were lovely.  I thought the cayenne might be too much but it was not.  I did forget to add the chopped walnuts -- I discovered them in my FP just as I'd put the stuffed peppers into the oven.  So I just added them in at the top when serving.  I didn't really miss them although I don't doubt that I'll notice the difference next time.  I had thought the cooking time seemed far too much, but they came out perfectly as directed.AnonymousBrooklyn, NY5/24/2019The meat in the peppers was severely undercooked - Where did I go wrong?  That being said, I put some of the extra meat mix in the pan (it cooked all the way through) and it was delicious.AnonymousOhio5/1/2019Brad knows his stuff. This recipe is delicious. I've always HATED stuffed peppers but I figured I'd give this one a shot. I used a nice short-grain rice and packed the peppers tight and it did indeed give me that nice \"meatball\" texture, super juicy and delicious, the raisins plumped up with the juices from the filling, and the top got nice and crispy. Thanks for converting me, Brad!mr_mrakBoston, MA4/10/2018OMG, I am 100% Not Italian, and this recipe for stuffed pepper is delicious. I will never get sick of people trying to \"improve\" on an old standard; it often works. Walnuts, tumeric, cumin, in stuffed peppers?? YASSSSSS, You have got to be kidding.gretchinfRapid City, SD4/9/2018OMG, I am 100% Italian, and this recipe for stuffed pepper is disgusting.   I'm sick of people trying to \"improve\" on an old standard; it never works.  Walnuts, tumeric, cumin, in stuffed peppers??  Yuk, You have got to be kidding.  karonColorado2/28/2018I made this last night with only one change: 12 oz 80/20 ground lamb and the remainder ground sirloin, instead of the pork/beef called for. I thought the lamb would marry well with the spicing. We loved the silky peppers, spiced filling, and the surprisingly complex-tasting sauce the tomato juice made. I only needed 22 oz tomato juice to fill my baking dish -- around 6 medium peppers fitted tightly in a dutch oven.  I was somewhat disappointed that the filling crumbled as we ate -- I was expecting a meatball-like texture.  It may have been from not packing the filling in the peppers sufficiently, or the meat substitution, but I'm not likely to use ground pork, so \"oh, well.\"  My husband -- who loves walnuts -- was put off by the nuts but I liked them.  I would definitely make again, but put an egg into the filling mixture.AnonymousCalifornia2/26/2018Explore Bon AppétitAmericanBell PepperVegetableGround BeefBeefMeatGround PorkPorkMainGluten-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-22", "author": ["Condé Nast", "Brad Leone"]}