{"id": "ca22d6c30c49b1a6457c236c30c5f3e1", "url": "https://www.bonappetit.com/story/make-ice-brew-not-cold-brew", "year": 2020.0, "month": 5.0, "day": 5.0, "content": "Japanese Iced Coffee is the Fastest, Easiest Way to Make Iced Coffee At Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen I Can’t Be Bothered With Cold Brew, I Make Japanese Iced Coffee InsteadIt's the fastest way to make iced coffee, no planning ahead necessary.By Sarah JampelMay 30, 2020FacebookTwitterEmailPhoto by Michelle HeimermanFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.It’s nice when I wake up and there’s a jar of cold brew in the fridge, ready to be diluted by glugs and glugs of milk—just the way I like it. But more often than not, someone (okay, it’s me) forgets to make it. (And then there’s the issue of fitting yet another jar into the already-packed fridge…)So instead of making cold brew, I’ve been turning to Japanese-style iced coffee a.k.a. flash-brewed coffee a.k.a. ice brew a.k.a. brewing super strong coffee directly over ice. The hot drip melts the ice, diluting the coffee to the perfect strength while also cooling it down immediately. It’s ready in about 10 minutes (including bringing the water to a boil), and—not to offend all the cold brew fanatics out there—but… I actually like the taste better?The cold brew versus ice brew debate was a hot topic among baristas way back in 2012, but allow me, an amateur, to summarize: While cold brew makes a big batch of concentrated coffee that’s rich and chocolatey at best (and muddy and grimy at worst), ice brew yields a brighter, cleaner-tasting, more complex cup. That’s because brewing with hot water brings out all of the beans’ complex aromas, and cooling it instantly—rather than chilling it in your fridge to drink later even though you know it’ll taste like wet cardboard—instantly locks in those flavors before dreaded oxidation. (If you’re not convinced, watch this video from Peter Guiliano at Counter Culture.)You can’t make a big batch of ice brew for the week, as might cold brew, but it’s so fast to make, I’ve never minded.To do it, I follow the platonic coffee to water ratio of 1:16 except that I replace some of that water with ice. To make two large servings of coffee, I use 165 grams ice, 315 grams hot water, and 30 grams coffee. (You can easily scale this down for a pour over.)As the water heats up, I grind the coffee beans to medium fine, like coarse salt; these grounds are much finer than what I’d use for cold brew and a little bit finer than for a regular pour over, too.Just imagine that there's ice in the server, okay?\nPhoto by Chelsie CraigNext, I weigh the ice into my Chemex and put the coffee into the filter (I use a metal filter but if you’re using paper, you’ll want to put it over the Chemex and flush it with hot water before adding the ice). I pour a little of the hot water over the grounds, let them be for 45-ish seconds to bloom, then pour the rest of the water over top slowly and in circular motions. I know I should let this take about 3 minutes, so I try to distract myself by scrolling through my phone or sweeping the floor between pours.Once I reach 315 grams of hot water, I swirl the Chemex around to melt any remaining ice, then pour the coffee over a glass of fresh ice and drink it in about 30 seconds flat (you can sip slower, though). It’s over as quickly as it started. Time for another round!Explore Bon AppétitIt's That SimpleCoffeeIced CoffeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-30", "author": ["Condé Nast", "Sarah Jampel"]}