{"id": "ca30b54a0292c0e7a8e3daed4147b02f", "url": "https://www.bonappetit.com/story/how-many-dish-towels-do-you-need", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "How Many Dish Towels Do You Need? Probably the Number of Dish Towels You Have, Multiplied By 3 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Probably Don’t Have Enough Dish TowelsThe number you need = the number you have multiplied by three.By Ali FrancisApril 10, 2020FacebookTwitterEmailPhoto by Ted + Chelsea CavanaughFacebookTwitterEmailWant to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: how to wash the dishes.I’ve used a lot of random crap to clean up kitchen spills: A handkerchief, a bandana, an old t-shirt, and, most regretfully, a bath towel that had been wrapped around my sopping wet person just 20 seconds before an egg yolk busted all over my floor. All because the couple of dish towels I did own were always lurking in the wash when I needed them most. I now know that’s because two towels is about 1200% less than the recommended stockpile.So how many dish towels do you need? Well, it's \"impossible to own too many,” according to Adam Rapoport. “Minimum, two dozen,” Sohla El-Waylly confirms. Rachel Karten thought her boyfriend was losing his marbles when he ordered 16 for their kitchen. “But now I am VERY thankful for each and every one of them,” she says. For Alex Beggs, dish towels are a saving grace in her relationship. “My boyfriend is a messy cook; like a slovenly Midas, everything he touches turns to an oil stain,” she says. Her solution? “Approximately 17 towels.” Then, just like that, Carla Lalli Music totally upped the stakes: “I have a thousand.”Why so many? Well, you want to have enough that there can be a few in the wash at any time—using a dirty towel to clean is unadvised. Some towels should be kept clean and dry and used only as oven mitts, others can be poised to sop up messy spills, the thinnest ones are best for polishing your delicates (uh, nice glassware), and thicker ones should be relegated to  heavy-duty dish-drying. I don’t know about you, but I’ve lost count.So, when it comes to stocking up on new dish towels, you’re really looking at three specific types: thick, thin, and fancy-ish.Sturdy, thick towels, whether they’re waffle- or flat-weave, are, in the words of Test Kitchen Manager Gaby Melian “the horsepower towels.” They’re good for taking a lasagna or tray of cookies out of the oven, wiping up big spills, and getting through a dinner’s worth of dish-drying.Thinner dish towels—like your classic Herringbone weave—can be folded to suit most tasks: heat-proofing handles, drying fragile items and cutlery, and wiping up light spills. You can also lay them down on a counter or table when you’ve made an elaborate fried chicken feast and need to temporarily extend the capacity of your dish rack. These guys will soak through faster, though, so make sure you “let them air dry before throwing them in the laundry,” says Melian.It should go without saying that your special towels—for Beggs that’s a corny dish cloth from H-E-B that’s covered in Texan landmarks, for Lalli Music that’s “some nice linen ones”—should be reserved for drying clean dishes (or lining fruit bowls to impress your guests). An oily slick of marinade is a hard thing to come back from.No matter the category, when it comes to absorbency and durability, you should be opting for lint-free, 100% cotton dish towels. “They get better with age!” says Melian.So, yes, you probably don’t have enough dish towels. But in the name of not playing favorites, let’s just say that, thick or thin or fancy-ish, they’re all good. And, take it from me, they’re all a whole lot better than your favorite t-shirt .Just Buy It: Royal Classic White Kitchen Towels, 30-Pack, $29 on AmazonJust Buy It: Williams Sonoma Classic Logo Towels, 4-pack, $20 Williams SonomaLet's be real. You'll need them after this:Basically Skillet LasagnaFinally: an easy, cheesy, vegetarian(!) lasagna recipe that doesn't require you to dirty every pot and pan in your kitchen.View RecipeAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitequipmentproductShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-10", "author": ["Condé Nast", "Ali Francis"]}