{"id": "ca329aec1e54f57213e0618386b6be75", "url": "https://www.bonappetit.com/recipe/argentinian-beef-empanadas", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Argentinian Beef Empanadas  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesArgentinian Beef EmpanadasBy Gaby Melian September 9, 20214.3(117)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintThere are as many variations of empanadas as there are cooks in Argentina (though they’re popular throughout Latin America, and Spain too). This version was developed by BA’s former test kitchen manager Gaby Melian, who is from Buenos Aires and was taught as a little girl by her mother and grandmother how to make them. She prefers these ones baked, not fried—and the puff pastry dough ensures you’ll still get all of those flaky layers. (If you prefer fried ones, try Gaby’s Ham, Cheese, and Onion Empanadas.)Empanadas have “saved me so many times,” writes Gaby in her step-by-step guide. “Birthday parties? Empanadas. Somebody’s coming over? Empanadas.” Keeping some in the freezer certainly helps. These beef empanadas can hang out there for three months—just be sure to freeze them on a sheet tray first so they don’t stick together.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonCloth Bowl Covers$18 At AmazonPastry Brush$9 At AmazonSlotted Spoon$13 $10 At AmazonMedium Bowl$17 At AmazonIngredientsMakes about 363Tbsp. extra-virgin olive oil, divided2lb. ground beef (20% fat)2medium onions, chopped2small red bell peppers, seeded, choppedKosher salt, freshly ground pepper3Tbsp. ground cumin2Tbsp. sweet paprika1Tbsp. dried oregano¼tsp. cayenne pepper1½cups low-sodium chicken stock or broth2tsp. sugar½cup raisins3packages (12 each) Puff Pastry Dough for Turnovers/Empanadas (preferably Goya)½cup pitted green olives (Picholine or Spanish), rinsed well, cut in half lengthwisePreparationStep 1Heat 2 Tbsp. oil in a large pot over high. Cook beef, breaking up with a spoon, until browned but not completely cooked through, 6–8 minutes. Transfer to a medium bowl with a slotted spoon, leaving as much fat in pan as possible.Step 2Reduce heat to medium and cook onion, bell peppers, and remaining 1 Tbsp. oil, stirring, until tender but not browned, 6–8 minutes; season with salt and black pepper. Add cumin, paprika, oregano, and cayenne and cook, stirring, until fragrant, about 1 minute. Add chicken stock and reserved beef along with any accumulated juices to pot. Stir in sugar, 4 tsp. salt, and ¼ tsp. black pepper. Bring to a simmer and cook, stirring and scraping up any brown bits, until most of the liquid is evaporated, 15–20 minutes; taste and season with salt and black pepper, if needed. Stir in raisins. Transfer to a medium bowl, cover, and chill at least 3 hours.Step 3Preheat oven to 375°. Let dough sit at room temperature 15 minutes to temper. Remove 6 rounds from package, keeping plastic divider underneath, and arrange on a work surface. Place 2 Tbsp. filling in the center of each round. Top with 2 olive halves. Brush water around half of outer edge of each round. Using plastic divider to help you, fold round over filling and pinch edges to seal. Using a fork, crimp edges. Remove plastic and transfer empanada to a parchment-lined sheet tray, spacing 1\" apart. Repeat with remaining rounds (you’ll get about 12 empanadas on each tray).Step 4Bake empanadas, rotating tray halfway through, until golden brown and slightly darker around the edges, 25–35 minutes.Step 5Do Ahead: Filling can be made 3 days ahead. Keep chilled. Unbaked empanadas can be made 3 months ahead; freeze on sheet tray, then transfer to freezer bags and keep frozen.How would you rate Argentinian Beef Empanadas?Leave a ReviewTell us what you thinkReviews (43)Back to TopTriangleThis recipe is the closest I have seen to the way I was taught. My late husband was raised in Argentina & this is his family’s recipe. With one exception….they added hard boiled eggs. AnonymousOkc ok12/12/2021How do I bake the frozen empanadas?KenCalifornia12/9/2021Goya used to get their dough from Argentina, now the come from Uruguay. As any empanada lover will tell you, it’s the dough. Goya for baking is by far the best you can get in the US.\nAnonymousArgentina11/24/2021I love Goya and Badia. Mccormick is a ripoff with inferior products. There is NO room for politics in the kitchen. Stay in your lane or move to the west coast. AnonymousTampa,FL11/21/2021Can't even look at recipes without you communist libtards being yourself and spreading hate. you should all be ashamed, oh wait you have no empathy and are all narcissist's you have noting in you for being ashamed..  tired of libtardsLubbock, TX 7941011/15/2021We use store-bought pie dough (Pillsbury is the most common) cut into 4\" or 6\" rounds instead of puff pastry, which is closer to street food empanadas found in Argentina and elsewhere in South America. We also use black Alfonso olives instead of green ones, which also seems to be more common in real life.Peter JNew York11/1/2021Love this, I'd agree, you should not use goya, which supports a fascism regim, but looking forward to making more of these, my kids gobble them up. MikeMaryland10/31/2021To Johnny, I’m not a huge fan of cumin either. It’s too strong for my personal taste. You can absolutely cut back on cumin.  Just add a teaspoon and it’ll taste fine. I just add garlic and onion powders for more oomph. As a matter of fact I just add a couple of tablespoons of sofrito to the meat while it’s browning (fresh onion, garlic, red pepper & cilantro - blended) & it comes out perfectly. \nAdd spices that taste good to you. :)DiannaWashington, DC10/31/2021Such stupid people that won’t use Goya, because they don’t like my President Trump.....very childish.....the review is about a recipe not your political communist /socialist association Anonymous10/29/2021I also don't use Goya - they support the Orange guy -\nTell me: what other pastry can I use? What about the 2 round sheets that come in a box to make an apple pie? In Argentina they use 'La Saltena' for the pastry to make empanadas. I tried Goya a long time ago and came out awful. They were thick, dry and hard. Never again.\nAny suggestions? I don't want to make the dough from scratch.\nHELP...... thanksAnonymousN. Syracuse10/12/2021Three Tablespoons of ground Cumin sound excessive for just 2 pounds of ground beef.\nI want to do this recipe but curious if anyone actually used so much cumin as listed.johnny10/3/2021I've been making empanadas (mostly beef) for years, and my friends know that I've put my heart and soul into making them.  My recipe is very similar - I use very lean beef, and often grind my own using steak, I use jalapeno or pasilla peppers for the heat instead of cayenne, and always use golden raisins. No eggs.  My sinful crust is made from flour, butter and cream cheese. I bake mine.  The other unbaked empanadas go into the freezer in bags to pull out as appetizers.  I know it is not traditional to serve sauces, but my killer creamy green sauce with jalapenos, cilantro, sour cream, a bit of mayo is always a hit.  I serve it also with my Peruvian chicken.  PacificaMumPacifica, CA9/30/2021Ditto on Goya. Love the recipe using ingredients from responsible companies. LindaLivingston 9/30/2021I will not use Goya because their CEO is supporting the Big Lie, but I'll definitely try the recipe.DWSnoqualmie, WA9/9/2021Yum! For those of us that don't like Goya, I used Villa D'agri brand pastry, a product of Argentina.  Be careful to get the kind for baking, not the frying variation -- the middle icon on the package shows an oven. CoopadoopLos Angeles 7/18/2021Explore Bon AppétitSavory Pie & TartArgentineanSouth AmericanLatin AmericanGround BeefBeefMeatOliveOther IngredientsRaisinDried FruitFruitPuff PastrySnackStarterLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-02-16", "author": ["Condé Nast"]}