{"id": "ca366bd2bd294f66542d440229017136", "url": "https://www.bonappetit.com/story/zaitoun-yasmin-khan-june-cookbook-club", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "The Zaitoun Cookbook by Yasmin Khan Is Our June Cookbook Club Pick | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureZaitoun by Yasmin Khan Is Our June Cookbook Club PickThere are trend-chasing cookbooks and there are passion projects, and Khan's Palestinian cookbook is definitely one of the latter.By Amanda ShapiroJune 1, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI swore if I saw another Middle Eastern cookbook cross my desk this year, I’d quit my job and take up needlepoint. Then Yasmin Khan’s Palestinian cookbook Zaitoun appeared in February, and I realized that books like hers are the reason I work where I do. See, when it comes to cookbooks (and most things in life), there are trend followers and there are passion projects. And despite the fact that Middle Eastern food is popping up everywhere from Instagram to fast-casual chains, Khan’s book of Palestinian recipes and travel stories is undeniably in the latter camp. I loved it from the moment I opened it, and I’m so glad we chose it as our June Cookbook Club pick.Khan, a human rights activist, first turned to food in 2016 when she published The Saffron Tales, a memoir-cookbook with recipes inspired by her Iranian mother. Zaitoun—which means “olive” in Arabic—is a more anthropological follow-up focusing on the cuisines of Palestine (there are at least three different styles of cooking in the region, which is approximately the size of Delaware). In the book, Khan introduces us to these cuisines via the people she meets, cooks with, and eats with during her travels. These stories paint a beautiful and complex portrait of the oft-misunderstood region.Okay, so what about the recipes? Good news: They all look delicious and approachable. I’ve been swooning over hummus with spiced lamb; seared halloumi with orange, dates, and pomegranate; asparagus with eggs and za’atar; lentils with chard and tahini; and too many more to name (okay, one more: banana and tahini ice cream with date syrup!). It’s going to be impossible to choose one to make for June’s cookbook club. I may very well show up with a few different dishes...but I can’t imagine anyone will complain.The seared halloumi dish.\nPhoto by Chelsie CraigBuy It: Yasmin Khan’s “Zaitoun,” $24 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon Appétitcookbook clubCookbooksMiddle EasternRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-01", "author": ["Condé Nast", "Amanda Shapiro"]}