{"id": "ca3c48524f81a6f28948aaf429984401", "url": "https://www.bonappetit.com/story/chicago-vegetarian-museum", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "The National Vegetarian Museum and Chicago’s Forgotten Vegetarian Past | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureChicago’s Forgotten Vegetarian Past—and the Woman Who Wants Us to RememberKay Stepkin founded the National Vegetarian Museum to tell the world about her meat-centric hometown’s neglected history of vegetarianism. Will anyone listen?By Jake MalooleyJuly 23, 2018FacebookTwitterEmailPhoto by Keystone-France/Gamma-Keystone via Getty ImagesFacebookTwitterEmailA few weeks ago, Vienna Beef opened a history museum in Chicago as part of the company’s 125th anniversary celebration. Among the artifacts on display are hand-painted advertisements of mid-century vintage, a meat grinder dating from 1859, a gold-plated cocktail weenie, and a photo of the stand at the city’s world’s fair in 1893, where the Vienna Beef hot dog made its debut. Visitors who work up an appetite during a tour can head over to the factory store cafe and tuck into a Chicago-style dog.On a recent afternoon, a mile east of the Vienna Beef museum, Kay Stepkin swung open the front door of the Lincoln Park library, where a very different Chicago food story was on view. The sprightly 75-year-old made a beeline to a small, carpeted room at the building’s rear that was the temporary home of the National Vegetarian Museum, which she founded in 2016 and debuted last year. The first vegetarian museum in the country, its name nods at grand ambition—but its present is rather humble. The nascent institution’s first travelling exhibit, “What Does It Mean to Be Vegetarian?,” has been on a tour of libraries across Chicago. It’s a modest display, made up of a dozen seven-foot-by-three-foot panels littered with archival materials (a reproduction of the 1974 debut issue of Vegetarian Times, featuring a recipe for mushroom loaf), persuasive factoids (“Up to 51% of greenhouse gases come from livestock”), and quotes from notable vegetarians (quoth Einstein: “Nothing will benefit human health and increase chances for survival of life on Earth as much as the evolution to a vegetarian diet”). There’s also a small video installation that traces plant-based eating through the ages, from Pythagoreanism in the 6th century B.C. to the present day.Having spotted Stepkin passing through the foyer, a librarian stepped out from behind a mountain of books on the front desk and sheepishly approached. “I’m so sorry, Kay,” she said in a whisper. “I turned off the video. Honestly, no one was watching it.”The report didn’t seem to trouble Stepkin. “Oh, that’s okay,” she said, smiling. “Would you mind turning it back on?” The librarian fired up the monitor and the chirpy voice of the video’s narrator, vegan author and podcaster Victoria Moran, filled the otherwise empty room.A longtime vegan raised in Chicago whose father made his living as a wholesale meat dealer and delivery man, Stepkin always knew a vegetarian museum would be a tough sell here. The city’s most well-known culinary identity is deeply anchored in flesh—in slaughterhouses and steakhouses, in Polish sausage and Italian beef, in hot dogs and deadly serious hot dog condiment orthodoxy. But there’s another, long-neglected, chapter of Chicago food history: Around the turn of the 20th century, even as the city’s South Side was the capital of the U.S. meatpacking industry, Chicago emerged as the center of the American vegetarian movement. During that period, the city saw a then-unparalleled surge of new vegetarian restaurants, vegetarian grocery stores, vegetarian social clubs, and vegetarian publishing houses. To Stepkin, these facts add up to a kind of counterhistory, and a response to the prevailing narrative of Chicago as “Hog Butcher for the World”—poet Carl Sandburg’s enduring description of the city circa 1914.Stepkin was first acquainted with vegetarianism in the mid-1960s, during a two-year stint living in Berkeley, California. Upon returning to Chicago, she secured a loan from her father, and in 1971 opened the Bread Shop, a bakery and natural food store in the Lakeview neighborhood on the city’s North Side. “Until I opened the Bread Shop, I had never met another vegetarian in Chicago,” she says. “But as soon as I opened the doors, they started coming in.” Stepkin soon spun off an adjacent vegetarian restaurant, the Bread Shop Kitchen, which she shuttered in 1982. For more than 40 years, Stepkin had believed that the Bread Shop, which she closed in 1996, had been Chicago’s first business catering to vegetarians. To her knowledge, no one disputed the claim.In the summer of 2012, Stepkin was writing a regular vegan recipe column called “The Veggie Cook” for the Chicago Tribune and began to receive invitations to speak publicly about vegetarian history. “I went to the library to see what there was that I didn’t know, not only about vegetarian history in Chicago but nationally,” she says. “I was absolutely stunned by my findings.”Stepkin learned that Chicago was where American vegetarianism was first put on the international stage, during the World’s Columbian Exposition of 1893, which celebrated the 400th anniversary of Christopher Columbus's arrival in the so-called New World. That exposure helped the city swiftly develop into the U.S. hub of organized vegetarianism. During the fair, a meat-free boarding house opened near the fairgrounds in the south-side Englewood neighborhood, catering to the delegates of vegetarian organizations who had arrived in the city from England, Germany, Switzerland, India, Australia, and beyond. That, it turned out, was Chicago’s first fully vegetarian business. It was soon joined by a handful of vegetarian clubs, local offshoots of the Vegetarian Society of America (VSA). By 1900, the VSA was compelled to relocate the headquarters of its national publication, The Vegetarian Magazine (formerly known as Food, Home and Garden), to Chicago from Philadelphia, the nation’s first capital of the meatless movement. That same year, Chicago’s first vegetarian restaurant, the Pure Food Lunch Room, opened in the downtown business district known as the Loop.“I was just amazed! I thought I would’ve heard something—anything!—about this history,” says Stepkin, who had served as president of the Chicago Vegetarian Society from 1994-1998 and again in 2000. The experience planted in her the seed of the idea for the National Vegetarian Museum. “If I didn't know the truth about Chicago’s vegetarian history, I thought, neither did anyone else.”Stepkin was right, of course. Chicago’s vegetarian past “is forgotten,” says Tim Samuelson, the city’s official cultural historian. “It’s not written about. You don’t hear people talk about it at all. It just doesn’t come up.”“There’s a real historical amnesia there,” agrees historian Adam D. Shprintzen, author of The Vegetarian Crusade, a woefully under-read book that delves deeper than any other into Chicago’s improbable rise as a hub for the meatless movement. “Vegetarians themselves have a kind of amnesia about this time period in Chicago, because it doesn’t fit neatly with our popular ideas of vegetarianism. We associate Chicago with industrial modernity—and people’s assumptions are that vegetarianism is this back-to-nature movement.” The modern vegetarian movement that grew in Chicago after the Columbian Exposition, Shprintzen explains, happened in lockstep with the industrial growth of the city. “There was a breaking away from vegetarianism with a social reform agenda and a move toward vegetarianism as a way to reform the self—to be competitive in an increasingly corporate society.”In his book, Shprintzen charts this critical shift in vegetarianism in the 19th century: From 1817—when a migration of 41 meat-abstaining Bible Christians first brought organized vegetarianism to Philadelphia from England—until the start of the Civil War, various U.S. groups saw dietary reform largely as a route to progressive social reform: the abolition of slaves, women’s suffrage, gender and economic equity, an end to war. But the strain of vegetarianism that later took root in Chicago had a more commercial and individualist bent. In June 1893, during the world’s fair, some 200 vegetarian delegates representing groups from around the globe gathered at the newly opened Art Institute of Chicago for what was called the World’s Vegetarian Congress. Throughout three days of lectures, movement notables such as John Harvey Kellogg—the same Kellogg responsible for Corn Flakes was superintendent of the pioneering Battle Creek Sanitarium health spa and developed early meat substitutes such as Protose—extolled vegetarianism as a way for individuals to achieve health, physical strength, and industriousness, as well as economic success and social advancement.“Chicago as a vegetarian center kind of made sense, because people there were more intimately involved in the implications of the modern meat industry,” Shprintzen says. “If you read accounts from the time period, during the summer, people could smell rotting meat wafting into the Loop.” In the classic muckraking novel The Jungle, Upton Sinclair described the odor from the meat factories as “like the craters of hell.” The horrors depicted in the book led to the passage, in 1906, of the Pure Food and Drug Act and the Federal Meat Inspection Act—two landmark pieces of regulatory legislation.“The Jungle led to a lot of people becoming vegetarian,” said Stepkin, gesturing toward a small image of the book’s iconic olive-green cover displayed in the exhibit. On the same panel is an advertisement for the Pure Food Lunch Room, which ran in the September 1900 issue of The Vegetarian Magazine. It billed Chicago’s first veg restaurant as “clean, airy,” with “good ventilation,” “quick service,” and “appetizing food” at “moderate prices.” The restaurant’s claim of serving “pure food” projected the healthful properties of vegetarian cuisine and also exploited a growing anxiety among people at the turn of the 20th century about the handling and processing of meat and milk. Neither Stepkin nor Shprintzen was able to dig up a Pure Food Lunch Room menu, but Shprintzen theorizes, based on the vegetarian cuisine of the time, that “lunches were pretty simple: things like asparagus on toast, broiled tomatoes—light fare. The idea was that a heavy meal would lead to less productivity in the afternoon.”The opening of the Pure Food Lunch Room ushered in a boom of vegetarian businesses in Chicago in the early 1900s. The publishing house Vegetarian Company produced The Vegetarian Magazine, vegetarian cookbooks, and other pro-veg literature. Chicago’s vegetarian restaurant options, according to advertisements and classified listings in The Vegetarian, expanded to include such establishments as Mortimer Pure Food Company, the Ionia, the Vegetarian Good Health Restaurant, the Hygeia Dining Room, Robertson’s Physical Culture Restaurant, as well as scores of private vegetarian dining clubs. Popular vegetarian grocers included Benold’s Pure Food Store, an Old Town “bakery of the genuine unfermented whole wheat bread,” according to one ad. Berhalter’s Health Food Store and Bakery, also located in Old Town, asked Vegetarian readers, “Would you like to be a successful vegetarian?” The store pitched its products—wheat bread, rice, raisins, figs, olives, olive oil, et cetera—as “in accordance with Vegetarian Dietetics,” promising “progress in physical health and spiritual wealth.”The salad days of Chicago vegetarianism would last until only the second decade of the 20th century. “When I finally found out the city’s vegetarian history goes back to the 1800s, I also realized the movement kind of came to a halt in the early 1920s,” Stepkin said as she concluded the exhibit tour. “It was World War I, the Great Depression, World War II, and then vegetarians as a movement didn’t pop up again until the 1960s. I thought, This could easily happen again. I don’t want our history to get lost again.”She held a grim expression for a moment. Then, suddenly, her face brightened. Something remarkable had happened: a real, live person had strolled into the room to check out the museum—the first in more than an hour. Stepkin watched intently as the woman browsed the exhibit panels.“Hi! I just wanted to say hello!” Stepkin said after several minutes. “And to let you know we have fliers over there.”“Thank you,” the woman said. “I came in to use the Internet, and I saw the sign as I was leaving the restroom.” She was in town from the Bay Area to escort her son, a DePaul University student, back home to California for the summer. “We’re both vegans,” she said. “It’s good to see information about it.”“Well, California might be a bigger vegan center,” Stepkin said, “but this is the first vegetarian museum in the country!”“Make sure it gets on the back of a truck and gets to lots of libraries,” the woman said. “Get the word out there any way you can.”Explore Bon AppétitChicagoVeganessayVegetarianHealthyishRead MorecultureThis Civil Rights Activist Is the Reason I've Been Vegan for 30 YearsBy Tracye McQuirterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-23", "author": ["Condé Nast", "Jake Malooley"]}