{"id": "ca3e77b7cfa0a29f47254977b8bc1266", "url": "https://www.bonappetit.com/story/joyoung-soy-milk-machine", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "The Best Soy Milk Maker Is the Joyoung | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Joyoung Makes the Best Soy Milk (And All the Other Milks Too)Step 1: Add beans and water. Step 2: Press a button. Milk!By Clarissa WeiAugust 13, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.In Taiwan, where I live, hot soy milk is a universal right. It’s the first thing many families make every morning. You can toss in a bit of sugar or add pickled mustard stems, a swirl of soy sauce, and chunks of oily deep-fried breadsticks to make a savory soup. I personally like mine hot and plain with all of its beany flavors still intact. Like coffee, if soy milk isn’t made and consumed on the same day, it loses its robustness (or worse, tastes like those refrigerated, additive-heavy versions found in many Western grocery stores).In the greater China area, centuries of churning out bean milk has resulted in fancy gadgets and machinery designed to simplify the task. How it works: Add beans and water into the machine, press a button, and voilà. My family has had a dedicated soy milk maker for as long as I can remember, and we’ve always gone with the Joyoung brand, allegedly China’s largest maker of soy milk machines (a necessary niche!). For years, ours was a simple automated pitcher, but you still had to strain the liquid by hand to get a creamy, smooth milk. It was decent, but it could have been better.My mother recently upgraded all of her kitchen tech, and when I visited her this summer, I discovered that she’s now the proud owner of a Joyoung DJ10U-K1. It’s a multifunctional behemoth that can not only pop out soy milk, but also generate all the nut and seed milks of your dreams, along with coffee, fruit juices, and plain old hot water. You don’t even have to filter anymore. The milk comes out smooth as butter, frothy and ready to drink.The machine retails at a rather steep $433, but a huge appeal is its self-cleaning function. Previous generations of the soy milk maker required you to scrub them down because grit from the pulverized beans would accumulate inside the machine after each brew. This new machine takes care of all of that with steam and a high-powered water pump. It also features a timer so you can pop in the soybeans the night before and schedule fresh milk for the morning. And with the dazzling power of technology, you don’t even have to soak your beans (or nuts) the night before any longer, a typically necessary step that softens them so that they produce more milk.If you like to switch up breakfast bevs, the Joyoung makes all the drinks you’ll ever need to start your morning with—coffee with a generous splash of milk, for instance, or a tall glass of fresh orange juice to pair. I’m comfy with its namesake soy milk, but you can and should go wild. It’s the all-in-one Swiss Army knife of drink machines.Joyoung DJ10U-K1 Multi-Functional Soy Milk Maker$425 at Amazon$423 at WalmartExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-13", "author": ["Condé Nast", "Clarissa Wei"]}