{"id": "ca3f9e959ae2654443cd3c6168a15aef", "url": "https://www.bonappetit.com/story/nik-sharma-los-angeles", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "Nik Sharma's Los Angeles Travel Guide | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eatNik Sharma’s Guide to Los AngelesThe cookbook author’s perfect day eating all the carbs (and saving room for dessert) just north of the cityBy Nik Sharma, as told to Esther TsengJuly 14, 2021FacebookTwitterEmailDesert Garden at The Huntington Botanical Gardens, San Marino, CaliforniaPhoto by Richard WongFacebookTwitterEmailNik Sharma has written multiple books on flavor, the science behind it and how to enhance it in your own cooking with spices. So naturally we wanted to know where the flavor-seeker goes out to eat! Here, he shares restaurants old and new, bakeries and dessert spots, and a plant-filled detour that’s worth the possible traffic jam.Check out more food-focused itineraries from our favorite food people here.Go big with a breakfast sandwich at All Day BabyPhoto Courtesy of All Day BabyA Taiwanese feast at JoyPhoto by Jakob N. LaymanLos AngelesLos Angeles is so huge that it is impossible to tackle in one day. I live north of downtown, which is central to all my favorites. With just a few freeways, you (or your rideshare driver) can navigate from Miracle Mile to San Marino to get to all of them.I’ll start at République, which has exceptional pastries. There’s lots to choose from, and I love their baguettes and avocado toast, which has sumac and dill—a delightful combination of fresh herbs.Or I’ll head to All Day Baby, a great diner-inspired restaurant where the portions are ridiculously huge. They do a fantastic wedge salad (the dressing is made of labneh!) and hot crab sandwich, which has a smoked jalapeño mayo that plays so well with the sliced green tomatoes.A beautiful place to walk all that off is on a scenic route through The Huntington in San Marino. In spring, they have a plant sale, which is open to the public.After that, it’s time for lunch, which means a thousand layer pancake at Joy, a casual Taiwanese restaurant. I get it fully loaded—with egg, cheese, chili sauce, and basil—and it also does a delicious Chiayi chicken on rice.For dinner, I’m off to Pardis in Glendale for Persian food. Everything from the rice to the bread and the kabobs is delicious. They even serve you lemon verbena leaf to snack on as a palate cleanser.For dessert, I like to go to Mashti Malone’s, a Persian ice cream shop. The Mashti Special, two wafers sandwiching an ice cream flavor of your choice, is superb, and I fluctuate between a few flavors, including the orange blossom, pistachio, ginger rosewater, and sour cherry rosewater with rice starch noodles sorbet.WHERE TO STAY:The gorgeous Cara Hotel in Los Feliz, which has a pool to cool offWHAT TO BRING BACK: Three-cheese semolina loaf from RépubliqueExplore Bon AppétitRestaurantsTravelLos AngelesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-14", "author": ["Condé Nast", "Nik Sharma", "As Told To Esther Tseng"]}