{"id": "ca4489918117fa04e1325ab719bd282f", "url": "https://www.bonappetit.com/story/wine-tasting-decoded", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "Wine Tasting, Decoded | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredWine Tasting, DecodedA winemaker dishes on her career journey and on pairing wine with food.By E&J Gallo Winery – Wine DialoguesJune 12, 2019FacebookTwitterEmailFacebookTwitterEmailA deep foodie culture surrounded Nicole Hitchcock while she was growing up. This California native, now head winemaker at the Russian River Valley’s acclaimed J Vineyards & Winery, dove right in. “I worked in restaurants in Carmel that are well-known for their culinary and wine programs,” she says. “Discovering the interplay between food and wine is what initially got me fascinated with this industry.” A summer working abroad in an Italian agriturismo further opened her eyes to wine and food’s role as a cultural pillar. “You see its importance in an entirely different light. It is an integral part of people’s daily lives,” she says.A Viticulture & Enology graduate from University of California, Davis, Hitchcock worked her first harvest in the Napa Valley. As a winemaker, she has found a way to blend her culinary and enology passions. “Having a feel for the grapes and then using my experience to guide them into delicious wines is my general approach,” she says. “Having worked in a broad range of restaurants, from rustic to fine dining, as well as in wineries large and small, I feel that I have a good sense of the range of people’s palates and the different occasions that food and wine serve. I see wine as a means of bringing joy to the table because it sparks so much connection,” she says.After nearly a decade working in wine, Hitchcock had the opportunity to work closely with third-generation winemaker Gina Gallo in Sonoma County. “Her approach made me look at winemaking differently,” says Hitchcock. “I learned that details like the inclusion or exclusion of just one barrel in a blend can dramatically shift a wine’s style. Another technique I learned from Gina is that while developing a wine blend, the true test is bringing the wine home to taste it in a different setting. That’s where the wine is headed anyway, home to people’s tables.”Nicole HitchcockJ was founded more than 30 years ago producing cool-climate varieties that thrive in the soils and climate of their Russian River Valley home.  The region's huge day-to-night temperature shift is key, says Hitchcock, “The mornings are cool, usually with misty coastal fog. By midday, the sun breaks through and we have warm days ripening the grapes. At night, the breezes cool everything down again, preserving the wonderful, crisp acidity.” In these ideal conditions, the wines develop layers of deep, complex flavor.An accomplished home cook, Hitchcock’s favorite family meals incorporate flavors and techniques from across her life experience, like handmade gnocchi with local fava beans and chanterelles, as well as Italian prosciutto and Pecorino.  “I usually pair this with our Cuvée 20 sparkling or our Russian River Valley Chardonnay.  This paring is a great example of wine and food allowing you to harmoniously blend different regions and cultures together.”\nShe also looks locally for another summer favorite, zucchini blossoms stuffed with anchovies, ricotta and herbs, then battered and deep fried. “Sparkling wine is amazing alongside fried foods, so I pair these with our California Cuvée or Cuvée 20.” For her spiced lamb sliders topped with herbed yogurt sauce and greens and stuffed into a pita, she chooses the J Canfield Vineyard Pinot Noir because “their spicy and savory characteristics complement one another so well,” she says.Learning has been vital to Hitchcock's career. As a member of Women of the Vine & Spirits, J Vineyards & Winery also strongly believes in supporting the continued growth of women in the wine and spirits industry. Their Women Behind the Wine fund awards women with scholarships for continuing education, including tuition grants toward Master of Wine and Master Sommelier students as well as regional scholarship grants.“It’s important to get to know people throughout the industry because it’s not as big as people might think. Those relationships can be fun and help you through your career,” says Hitchcock about finding mentors and support. She also advises women to remember that the crafting of food and wine are skills that take years to develop.  “In many ways, these are skills that can’t be rushed. It's important to savor and build upon each experience.”Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-12", "author": ["Condé Nast", "E J Gallo Winery", "Wine Dialogues"]}