{"id": "ca50aa038cdbd08e009d3a0836ac713a", "url": "https://www.bonappetit.com/story/how-much-turkey-per-person", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "How Much Turkey Do You Need Per Person This Thanksgiving? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow Much Turkey Do You Need Per Person This Thanksgiving?Depending on whether you want a lot of leftovers or a TON of leftovers.By Nico AvalleOctober 26, 2021FacebookTwitterEmailMichael Graydon + Nikole HerriottFacebookTwitterEmailBuying turkey for Thanksgiving dinner is a big choice. Do you want a heritage bird or a classic grocery store bird-in-a-bag? Fresh or frozen? Whole or parts? And, arguably the most important consideration of all: Just how big should that bird be?To calculate the exact number, you need to figure out how many people you’re serving and how much turkey you need per person. After all, if you’re hosting Thanksgiving, it’s your mission to send everyone home as full of delicious food as possible.Here’s how to buy the right sized bird for the job:How many pounds of turkey do I need per person?The general rule of thumb is 1–1½ pounds turkey per person. If that seems like a lot, remember that a whole turkey comes with a lot of parts that don’t end up getting eaten. “When you buy a whole turkey, a lot of it is bone,” says assistant food editor Jessie YuChen, and the smaller the bird, the higher that percentage may be. That’s why, for smaller gatherings, Jessie recommends going all the way to 2 pounds per person to maximize leftovers (more on that later). “For four to six people, 11 to 13 pounds is a good range,” Jessie says.That might seem like a lot of bird, but remember: Beyond the bones, the mass of your whole bird also accounts for cartilage and less favorable cuts of meat around the shoulders, neck, and back that are better for making stock the next day than for serving on the big night. Just because you’re buying a pound for each guest, it’s not the same as serving everyone a 16-oz. rib eye.What if I’m afraid of under-serving my guests?“I think that most people put out so many sides that running out of turkey just really isn’t an issue,” says contributing editor Amiel Stanek. “Turkey is, in my experience, the thing that people want least.” As a host, then, you can take some of your attention away from the cartoonishly large bird and think deeply about the side dishes. The sides are where you can customize your selection based on the size, tastes, and needs of your crowd. Serving a few extra vegetarians this year? Go all-in on salads, casseroles, and roasted veggies. Want to show off your hard-earned quarantine baking skills? Make a big tray of showstopping stuffing biscuits.Amiel also points out that the bigger the turkey, the less likely it is to cook evenly. He would much rather serve smallish portions of perfect poultry than massive servings that are half-raw, half-dry. “In terms of ensuring that the breast meat is delicious and moist and the dark meat is cooked through, I think you’re going to get the best results from a 14-to-15-pound bird, max.”If that sounds teeny tiny compared to your guest list, Amiel and Jessie recommend serving a different meat or protein (no matter your party’s size). “I like to do steak or lamb chops,” says Jessie, “which are also very festive and are a lot easier to prepare than a whole turkey.” Having a second meat on the table not only provides a backup if your bird is on the scrawny side, but it also makes your turkey stretch further (I mean, between a slice of seared rib eye and a piece of white breast meat, what are you reaching for?). Aim for 1–1½ total pounds of protein here and you’ll have nothing to worry about.What if I’m serving turkey to a really big crowd?We get it, everyone’s getting vaccinated, we’re excited to see our friends and families again, and suddenly your guest list is ballooning. If, despite our advice, you’ve ended up with a massive bird and are worried about cooking it evenly, consider breaking it down into smaller parts for more control over individual cook times. “Take the legs off and cook them separately from the breasts,” says Amiel, “you can even slow-roast them until they’re really tender and falling apart the day before, then reheat them while you’re roasting the breasts.”Even broken down, that jumbo bird is going to take up lots of oven space. To save on precious real estate, you can also take parts of the meal prep outside, weather permitting. Once your turkey is in pieces, those breasts, thighs, and legs are perfect candidates for grilling. Not only will this get you out of the kitchen here and there (and let’s be honest, anyone cooking a Thanksgiving feast could probably use some fresh air), it’ll bring smoky flavors to a protein that’s known for trending bland.What if you STILL end up with way too many leftovers?It happens to the best of us. No matter how much turkey per person you prepared for, there’s bound to be one cousin who went vegan last year, or an uncle who got stuck at O’Hare, or too many good-tasting appetizers to fill up on. However you got here, you’re stuck with very many resealable plastic bags full of leftover turkey.Fret not, though, because there’s plenty of ways to repurpose those leftovers into delicious meals without letting things get overly repetitive. “I think that as far as your first couple of days of leftovers consumption are concerned, cold breast meat sandwiches are the way to go,” Amiel says. That’s because the dark meat is slower to dry out, so getting through the white meat should be step one.From there, you can turn bone-in dark meat and whatever’s left of the bird’s skeleton into homemade stock, which can be portioned out and frozen, and will bring way more flavor to soups, sauces, and braises than the boxed stuff.As for the dark meat that’s already been carved, you can shred it up for quick tacos at lunchtime, add it to your homemade stock for a quick, comforting soup, or—if you want something truly impressive—mix it up with any leftover gravy and veggies to make pot pies, which freeze well and make incredibly lazy dinners down the road.But before you let the promise of delicious leftovers convince you to buy the biggest Butterball you can get your hands on, think about yourself on Thanksgiving day. Hosting any event is stressful enough without a literal feast to prepare, and an unnecessarily huge bird is just another headache you don’t need.“My tip is just to plan ahead,” says Jessie. “The goal for the meal is to have a beautiful spread and have everyone fed, and you don’t need a gigantic turkey to do that.” After the year we’ve all had, it’s safe to say that your guests will be satisfied just because they’re together again. Keep things simple, enjoy the company, and always—ALWAYS—outsource the cleanup.Explore Bon AppétitcookingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-26", "author": ["Condé Nast", "Nico Avalle"]}