{"id": "ca64d6cfd25f46a900bcfe98f1406fb5", "url": "https://www.bonappetit.com/recipe/thai-basil-sauce-noodles-with-jammy-egg", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "Thai Basil Sauce Noodles with Jammy Eggs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesThai Basil Sauce Noodles with Jammy EggsBy Jessie YuChenAugust 26, 20214.4(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, food styling by Kat Boystova, prop styling by Allie WistEmailPinterestPrintEmailPinterestPrintFor people within the Taiwanese diaspora in the United States, the scent of Thai basil is a reminder of the pungent and spicy basil you’ll find everywhere in Taiwan. The Taiwanese variety is quite hard to find in the States, but the more readily available Thai basil, which you can find at Asian supermarkets, is a good substitute. You can make these noodles with sweet basil if you can’t find Thai, but it will lack the same punch of grassy, spicy flavor.Quick-frying the basil-garlic purée with rice wine brings out the fragrance of the herb and mellows the sharpest notes of raw garlic without completely muting them. The result is a savory, aromatic, licorice-scented green sauce that clings perfectly to wide noodles.This topping combination is inspired by the traditional noodle stands you see everywhere in Taiwan. With crunchy fried garlic or shallots, mung bean sprouts, garlic chives, and an egg on top, this is a complete meal in a bowl that’s easy to execute on weeknights.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonSlotted Spoon$13 $10 At AmazonLarge Straight-Sided Skillet$290 $199 At AmazonMedium Pot with Lid$155 At AmazonIngredients4large eggs (optional)1head of garlic, peeled3cups Thai basil¾cup vegetable oil, divided¼cup michiu tou or other rice wine1tsp. sugar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more4garlic chives, cut into ½\" pieces2cups mung bean sprouts4servings dried wide sliced noodles (such as Hsin Tung Yang; about 8 oz.)Store-bought fried garlic and chili crisp (for serving)PreparationStep 1If using eggs, bring a large pot of water to a boil over medium-high heat. Using a slotted spoon, carefully lower eggs into water one at a time. Cook 6½ minutes, adjusting heat to maintain a gentle boil. Transfer eggs to a bowl of ice water with slotted spoon; reserve pot with boiling water. Let eggs sit until just slightly warm, about 2 minutes.Step 2Gently crack eggs all over and peel, starting from the wider end, which contains the air pocket. Slice in half and set aside for serving.Step 3Blend raw garlic, Thai basil, and ½ cup oil in a blender or food processor until a smooth paste forms.Step 4Heat remaining ¼ cup oil in a large skillet over medium. Carefully scrape in Thai basil purée and add wine, sugar, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt. Cook, stirring, until fragrant, about 1 minute. Remove from heat and season with more salt if needed.Step 5Return reserved pot of water to a boil. Cook garlic chives and bean sprouts until chives are bright green and sprouts start to turn translucent, about 1 minute. Using slotted spoon, transfer to a small bowl.Step 6Cook noodles in same pot until al dente, about 5 minutes. Drain noodles and transfer to pan with sauce. Using tongs, toss noodles to coat.Step 7Divide noodles among bowls. Top with bean sprouts, garlic chives, fried garlic, and reserved eggs (if using) and drizzle with chili crisp.How would you rate Thai Basil Sauce Noodles with Jammy Eggs?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis recipe is fantastic. For not much effort, you end up with a meal that tastes like it was made at a restaurant. We made it as is except for frying the egg sunny side up instead of boiling. I would emphasize that having thai basil is key to this dish and it wouldn't be nearly as great with sweet basil. We found thai basil at 99 ranch, labeled as just regular basil. Highly recommend this recipe!AnonymousSan Diego, CA8/31/2021Explore Bon AppétitBasilHerbs & SpicesEggNoodlePasta & NoodlesAsianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-26", "author": ["Condé Nast", "Jessie Yuchen"]}