{"id": "ca66b0465626d839ff21c73588cf7f91", "url": "https://www.bonappetit.com/story/mothers-day-classic-cookbooks", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "8 Great Mother’s Day Cookbooks, Recommended by Our Very Own Moms | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture8 Great Mother’s Day Cookbooks, Recommended by Our Very Own MomsThis just in: moms love Ottolenghi.By The Bon Appétit StaffMay 3, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThere’s no time like Mother’s Day to reflect on all the advice your mom has given you over the years, some pieces lighter than others. Last year, we asked our moms for their best kitchen tips, so this time around, we’re taking it one step further and getting their cookbook recommendations. No matter if you’re looking for something to give your mom this Mother’s Day or are just in the market for classic recipes, here are the cookbooks that the moms of Bon Appétit staffers, and one mom-on-staff, recommend.Plenty by Yotam Ottolenghi“In the Abarbanel household, the last word on cookbooks is Ottolenghi. No family gathering is complete without a staggeringly beautiful, often vegetarian main sourced from the pages of Plenty or  Jerusalem. My mother, Stacey Abarbanel, draws her support from the notable array of seasonal, vegetable-forward dishes, like roasted butternut squash with sweet spices, lime, and green chile, or eggplant with buttermilk sauce (pictured on the cover).” - Aliza Abarbanel, Healthyish editorial assistantBuy it: Plenty: Vibrant Recipes from London's Ottolenghi, $26 on AmazonJersualem by Yotam Ottolenghi“My mom loves Jerusalem by Yotam Ottolenghi. She traveled in the Middle East a lot before she had kids (aka before my sister and I crashed the party) and then spent 20 years feeding us all on weeknights (my dad called dibs on Saturday and Sunday night cooking when he could blast opera and take four hours to make one dish). Now that she has gotten inspired in the kitchen again my mom can kick my dad out and enjoy cooking. No opera allowed.” - Chris Morocco, senior food editorBuy it: Jerusalem: A Cookbook, $21 on AmazonThe Best Recipe by the Editors of Cooks Illustrated“Aside from my elementary school’s PTA cookbook, my mom’s favorite is The Best Recipe. She makes the chicken pot pie almost every two weeks, even in the summer.” - Elaheh Nozari, e-commerce editorBuy it: The Best Recipe, $36 on AmazonThe First 40 Days by Heng Ou“This is an AMAZING book for anyone who is pregnant. While other books about how to prepare for a new baby are fear-mongering, this book is nothing but affirming and supportive. It is half advice about how to prepare for this next stage of life, and half recipes to cook (or have people prepare for you) during the ‘first 40 days’ after the baby is born.” - Julia Kramer, deputy editorBuy it: The First 40 Days: The Essential Art of Nourishing the New Mother, $17 on AmazonDining In by Alison Roman“Yes, this is very biased since Alison is a close friend. But I am recommending this because my mom is a huge fan, too, and frequently sends Alison pictures of all the dishes she has cooked from it.” - J.K.Buy it: Dining In: Highly Cookable Recipes, $18 on AmazonAnything Barefoot Contessa by Ina Garten“The cookbooks my mom truly cooks from the most are Ina Garten’s. She finds them reliable and super weeknight-friendly with a minimal number of ingredients. She also turns to Ina for baking—her favorite thing is the orange chocolate chunk cake from Barefoot Contessa Parties, especially this time of year with California citrus.” - Emma Wartzman, web editorial assistantBuy it: The Barefoot Contessa Cookbook, $20 on Amazon or Barefoot Contessa Parties, $20 on AmazonThe Sprouted Kitchen by Sara Forte“My mom loves The Sprouted Kitchen because of the way Sara Forte can make vegetables the main attraction in a dish. We’re big fans of eating green things in my family, so finding new and flavorful ways to eat well is always encouraging. We recently made the soba bowls with salmon—there were no leftovers. A real hit for moms who love seedy, crunchy, produce-heavy meals.” - Zoë Sessums, e-commerce editorial assistantBuy it: The Sprouted Kitchen: A Tastier Take on Whole Foods, $18 on AmazonSavor the Moment by Dan Forer“My mom’s all-time favorite cookbook is Savor the Moment (circa 1999), it’s still the first one she reaches for in the kitchen. She loves the ‘magic toffee’ (essentially saltines covered in toffee and chocolate, and a pasta recipe with shrimp, tomato, and feta.” - Savannah Jackson, communications managerBuy it: Savor the Moment: Entertaining Without Reservations, $16 on AmazonExplore Bon AppétitShoppingMother's DayRead Moreculture17 New Spring Cookbooks We Can’t Wait to StainBy Christine MuhlkecookingOur Pancake Personality Quiz Reveals What to Make Mom for BrunchBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-03", "author": ["Condé Nast", "The Bon Appétit Staff"]}