{"id": "ca6f92e3a1f112f6714cfa69bbe90cd0", "url": "https://www.bonappetit.com/story/post-vax-wine-pairings", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "The Perfect Wine for Every Possible Post-Vax Hang | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusThe Perfect Wine for Every Possible Post-Vax HangBrunch with grandma. Your postponed wedding. Coworker happy hour. Whatever your IRL event, we’ve got a wine for that.By Alex BeggsMay 5, 2021FacebookTwitterEmailFacebookTwitterEmailYOU DID IT! You’re double-vaxxed, two weeks out, and ready to rage! Your bloodstream is pumping with little messenger RNA cells whispering to each other, Let’s hang out. And so we shall, with the blessing of a nice nurse named Chris, who came out of retirement just to perform this civic duty.* Thanks, Chris!So in the great tradition of pairing wines for the hell of it, I consulted Sage Redman at the wonderful Grapefruit Wines store in Hudson, NY, to pick wines for whatever post-vax rager you’re planning, from the awkward intimate gatherings to that giant wedding you’ve been holding out on. Cheers!*I got Pfizer.Note: However you’re partying, please follow [CDC guidelines](https://www.cdc.gov/coronavirus/2019-ncov/vaccines/fully-vaccinated.html) and all that stuff. And if you don’t plan on getting vaccinated, you are not allowed to continue reading. Get outta here!A low-stakes dinner party with two other peopleOh, God, where are the NAPKINS. People eat with NAPKINS, remember? For such a stressful situation—oh, God, WHEN WILL THEY LEAVE?—you need an easygoing wine. Go for Cossard’s “Version Sud” Grenache, which tastes like “bright bing cherry in a glass,” Sage says. And, like you, it’s best when chilled out.Brunch with GrandmaPerhaps you’ve only seen her through a window in the past year, or worse, not at all! How will you even know if you’ve gained weight/are still unmarried if your grandma isn’t there to tell you? You’ve been worried about her, she’s been worried about you, and both of you need to gather around a platter of pepperoni lasagna with 26-month-old powdered Parmesan, which is begging for a nice bottle of literally anything to wash it all down. Even better, Fattoria Mani Di Luna Sangiovese, a LITER of fresh ’n’ easy rustic table red that’ll take you from the early afternoon till at least the 6 o’clock news. The one with the cute weatherman. Hear he’s single!Bring the book club back togetherYou guys had a WHOLE YEAR to read Where the Crawdads Sing and yet only three people did and they don’t even remember who the killer was. Was it even a murder mystery? I DON’T REMEMBER. Other things have happened since then! Refresh your memory of what it’s like to be disappointed in your friends, vaguely intellectually stimulated, and in another person’s home with a double liter of “glou glou cinsault,” per Sage, Domaine Puech Redon’s 2L. The double-liter serves a crowd, yes, but fun fact: It was bottled specifically to get around the stupid wine tariffs that went into effect in 2020 (there was a lot going on last year).Pool party with 17 of your closest budsPhoto and prop styling by Anna Morris, Courtesy Grapefruit WinesNo glass! La Bodega de las Estrellas makes a magnum-size POUCH of Tempranillo rosé with a little spout and a handle and everything. Perfect pool-party wine.Your postponed weddingIn a year of isolation, you may have realized that the person you wanted to spend the rest of your life will never learn how to brush their teeth without leaving toothpaste puddles all over the sink. But you put a down payment for this wedding, so let’s get on with it. The white: Miles Garrett Chardonnay. Sage says it’s oaky in a good way, and anyone who hates California Chards is challenged not to like this. “It feels luxe, subtle, and sleek, which it should, because this is the first time you’ve worn heels in over a year.” The red: Roberto Henríquez Santa Cruz de Coya. This Chilean wine comes from a País vine that’s like 200 years old, which is a good omen for the long-lasting depths of your love, right? The bubbles: Les Hautes Terres, Méthode Ancestrale “l’Air du Paradis”. A spritzy pet-nat that “bursts with delicate apple blossoms as it does rich nuttiness and depth,” Sage says. And “the Air of Paradise” may or may not refer to your vaccinated friends and family, breathing clean congratulations into your newly married face.An orgyPhoto and prop styling by Anna Morris, Courtesy Grapefruit WinesI’m not here to judge your postvaccination rager of choice, I’m just trying to accurately represent all possible options. And this is definitely one. You need a wine as wild as you are. Azienda Agricola Nasciri’s Calabrese Nero “is a dirty girl,” Sage says. You can see its “chunky sediment” settled at the bottom of the bottle (and feel free to use “chunky sediment” as your safe word). Sage says this wine is “not modest,” tastes almost like vermouth, and that fans of Dr Pepper will be into it. So get naked and pass the corkscrew.A shared Airbnb cabin in the woods with palsYou miss your friends so much you want to spend an outdoorsy three-day weekend with them, even if by day one you remember that so-and-so always goes to bed too early, the other one hates “all the bugs” and refuses to hike, and nobody ever wants to play Charades, Alex, please don’t make us play games. What will bring together this chaotic group is a bottle of Oyster River Winegrowers “Morphos” pet-nat. Like your friend group, it’s made of hybrid grapes. Sage says: “It’s spring in a glass, a little woodsy, fresh, and delicious to every palate.”A bangin’ baby showerSuch a momentous occasion, one that cannot be missed even if your baby can already eat solid food and erase her internet history by now. Because PRESENTSSS! A baby shower needs two wines. Number one, a wine inspired by the T-shirts that say “Mama needs wine.” The wine she—we all—needs is Domaine Balansa “Pech de Rozies,” a blush and peachy rosé with a touch of a sea shell salinity, which pairs well with stereotypes and chocolate-covered strawberries in equal measure. Wine No. 2: A nonalcoholic wine for any nondrinkers! Domaine des Grottes L’Antidote is “a killer nonalcoholic ‘wine,’” says Sage, which is made from grapes and 15 different herbs. It tastes like good vermouth, but it’s sparkling, and 0% ABV. YUM!An out-of-practice house party, show your vax card at the doorThis vaccination has you craving a sticky-floored, tub-full-of-High-Life, vase-breaking house party. But because you’re 37, you want the tub full of decent wine and for people to take off their shoes. Fill the tub with Domaine Rietsch “Tout Blanc”—liters, again! A great wine size. Sage says it’s “dangerously drinkable,” aromatic, and mineral-driven. Buy too much so you can drink it summerlong.A meet-and-greet with the new coworkers you’ve only seen on ZoomAll along you’ve default assumed your new coworkers are at least 6'5\"—they seem tall in the little box, don’t they? And once everyone’s vaxxed and has taken three days off each to “recover” (lies), it’s time to see how tall they really are. This gathering is sure to be awkward (Nico, it turns out, is an average 5'11\"), so you need a wine that can distract everyone. Give them something to talk about. Laura Lorenzo’s Camino de la Frontera Tinto is that wine.“Laura has been working to bring biodiversity and soil health back to Spain’s ‘green hill’ of Galicia, an area previously rampant with industrial farming,” Sage says. “The Camino de la Frontera Tinto is predominantly a grape called Juan Garcia, but what’s most important and delightfully captivating about this wine is its deliciousness. Scrubby mediterranean dried herbs, bright red fruit with an undercurrent of spice and earth, refined and rustic, full of life and intrigue. It just slaps!”Fuck it. Take the kids to Chuck E. CheesePhoto and prop styling by Anna Morris, Courtesy Grapefruit WinesEverybody has to rage in their own way. I’m not suggesting you sneak in wine to Chuck E. Cheese, but I am suggesting that, three exhausted hours after, when you get home and sink into the couch and can’t get the smell of congealed cheese out of your pores, you drink a glass of Tissot’s Patchwork Chardonnay. Like you, Sage says, “this wine gives and gives.” It’s lush, elegant, and deep...like the couch. You’re vaccinated and free now, but the couch, the couch will always be there.Warehouse EDM rave in BushwickWow, sweaty. You might be vaccinated, but remember, you’re not immune to the mysteries that linger on the lips of strangers. For all that dancing (thrashing?), you’re gonna need a refreshing wine that holds up well in a flask. Try tequila.Explore Bon AppétitCoronavirusPicnicPartyShoppingRead MoreculturePipeño Is Our Post-Zoom WineBy Joseph HernandezcultureI’m Still Wearing Sweaters, But Current Cassis Is My First Taste of SpringBy Aliza AbarbanelcultureIs It Ever Okay…to Bring a Single Serving to a Picnic?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-05", "author": ["Condé Nast", "Alex Beggs"]}