{"id": "ca79678b8ac1f01ad0d388082958e99d", "url": "https://www.bonappetit.com/story/how-to-cook-shrimp", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "How to Cook Shrimp Perfectly Every Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Not Overcook (or Undercook) Your ShrimpDon't be one of those people that just thinks they know how to cook shrimp. Be one of those people who knows how to cook shrimp.By Alex DelanyMay 9, 2018FacebookTwitterEmailFacebookTwitterEmailThe line between perfectly cooked and messed-up shrimp is really thin, which can make cooking the things feel intimidating. But we're here to tell you that you don't have to be afraid—we’re all about building confidence over here at Basically. Let’s learn how to tell when shrimp are cooked through, how to get them tender and juicy every time. Let’s lift your crustacean confidence to new heights.Shrimp cook really quickly, which is partially why they are so often over or undercooked. There’s less of a margin for error when something is only in the skillet for three or four minutes, which is how long we usually cook shrimp. You can cook shrimp on a lower heat for a longer period of time, but for the best result, we like to sear or sauté shrimp on high heat. It gives them the best texture, juicy and tender, without any stringy chewiness.To start, make sure your shrimp are deveined. You can either do this yourself, or ask the person at your seafood counter or fish market to devein them. We like deveined shrimp because...well, there’s less poop. (That's what that dark line is, people.) But also because the doneness of a shrimp will always be easier to judge when they've been cut along the back, exposing more surface area.Consistency is a big part of tasty shrimp. You want to make sure all of your shrimp are the same size (no mixing jumbo and medium shrimp) and enter the pan at the same time. There shouldn’t be any shrimp lying on top of one another. The only way to cook the shrimp evenly is to spread them out in one layer, across the bottom of the pan, so they’re all exposed to the heated surface of the pan.So we place all of our thawed, deveined shrimp in a single layer on a hot skillet. And we don’t touch them. We let them sear with some butter or olive oil, hard and fast, for about 1-2 minutes. The shrimp will initially stick to the pan, but once the exterior has seared they’ll release from the pan naturally. Once you can move the shrimp around easily, flip them all over onto the opposite side.You’ll notice the flipped side is white and orange, a sign that the exterior has cooked. The side you just flipped onto the pan will be turning the same color in a minute or two, but since we do not possess the technology for x-ray vision just yet, we can’t see inside the shrimp to tell if it’s white. So what do we do? How can we tell that the shrimp are finished cooking?Shrimp scampi is the holy grail of shrimp dishes. Bow down.\nLaura MurrayThis is the trick: You want to keep an eye on the crevice in the back of the shrimp where the vein was removed. Stay locked onto the thickest part of the shrimp (the opposite end as the tail), and when the flesh at the base of that crevice turns from translucent to opaque, the shrimp is done.It’s cooked through. We promise. Don’t go thinking, “Oh, an extra minute...just to be sure.” The only thing that will surely do is overcook them. Remove them from the heat immediately. Even when you turn the heat off, the pan the shrimp cooked in is still hot. That means the shrimp will continue to cook if they’re still in the skillet. Transfer them to pasta, greens, polenta, a salad, or just a big ol’ platter for serving.The lesson here is that you can’t ignore your shrimp. You need to pay attention to them. Listen, watch, and understand what they’re going through. Be there for them. If you are, you’ll have perfectly cooked shrimp every time. Okay. This is starting to sound like relationship advice. It’s not. It’s about juicy crustaceans.Shrimp like to hang out on top of grits. Just FYI.Shrimp and No-Stir GritsBrunch, lunch, or dinner, we're never not excited about sweet, garlicky shrimp and cheesy grits.View RecipeExplore Bon AppétitBasicallyShrimpSeafoodRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-09", "author": ["Condé Nast", "Alex Delany"]}