{"id": "ca832beb47fd6c7d8b3c54a5c7dbf423", "url": "https://www.bonappetit.com/story/first-indonesian-food-truck-san-francisco", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "My Indonesian Food Truck Is the First in San Francisco | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy I Launched the First Indonesian Food Truck in San FranciscoIndonesian food is underrepresented in the U.S. Siska Silitonga Marcus wants to change that.By Siska Silitonga MarcusMarch 26, 2019FacebookTwitterEmailPhoto by Aubrie PickFacebookTwitterEmailCold sweat runs down the back of my neck as I drive a food truck down Highway 101 to Google’s campus in Mountain View. It’s my first time driving this kind of vehicle, and it’s giant compared to my two-door Mini Cooper. My truck-driving instructors are just as nervous as I am. When I knock a mirror off a FedEx truck, we all scream.The last seven months have been a whirlwind. Google and Off The Grid, a company that provides marketplaces for food trucks to gather and sell food, have accepted me into their incubator program, where I can try out my Indonesian food truck ChiliCali at Google campuses before launching it to the public. My days consist of cooking, prepping, and serving food for 300 people, and I do store demos and sell my cooking sauces at farmers' markets on the weekends. Other weekends I host pop-up dinners at restaurants and cafes. I barely sleep, I am constantly tired, and I spend all my energy prepping, cooking, and talking about the foods of my heritage. I am not complaining. This is my calling.ChiliCali's Nasi Campur: Steamed jasmine rice, mie goreng (fried noodles), shrimp sambal, roast pork belly, and Balinese urab salad with egg, tempeh and roasted peanuts\nPhoto by Aubrie PickI started cooking with my mother in Jakarta when I was a teenager. She was a catering chef, and I was her unpaid sous-chef. I left her kitchen to go to college in the U.S. because I wanted to see what other opportunities were  out there for me.  I got my degree in Mandarin Literature while working under the table at restaurants in San Francisco to afford college, mostly in touristy areas like Fisherman’s Wharf and Union Square.I worked in Silicon Valley after graduation, but I was very homesick. I missed my mother's food, and I missed speaking in Indonesian. I didn't feel like I had a community. In 2015, 10 strangers came to my house for my first weekly pop-up. They brought friends, and their friends brought  friends. Now I have a community who are my regulars and friends. In 2017, I quit my office job and rented a commercial kitchen to start my company, ChiliCali. I catered, hosted pop-up dinners, and launched a line of Indonesian cooking sauces after a successful Kickstarter campaign. I saw the food community in the  Bay Area starting to take notice of Indonesian food, so I applied to Off The Grid’s food truck incubator program.I chose the name ChiliCali because chili is what we eat with everything in Indonesia, and Cali stands for California, because I source all my ingredients locally.  I like the mobility of a food truck. Just like at my pop-ups, I can reach more diners this way. It’s also the first Indonesian food truck in the Bay Area. San Francisco might be one of the best food cities in the country, but Indonesian food is still largely missing. With fewer than five Indonesian restaurants here, I often wonder if our food is not good enough for this city. It seems equally under-represented across the nation, and my fellow Indonesian chefs all have our own theories about why that is.Silitonga Marcus handing out lunch on Google's campus.\nPhoto by Aubrie PickMy friends from Kaki Lima, a popular pop-up restaurant in Boston, have a good point: We have limited support back home. Thai cuisine erupted all over the United States in part due to the Thai government’s financial support, but the Indonesian government has been slower to promote our cuisine here. Less than 200,000 Indonesians live in the U.S., but our food is still worthy of acknowledgement, and nearly everyone I cook it for agrees.Indonesian ingredients have been consumed and, in many cases, exploited by developed countries for centuries now. Coffees grown in Sumatra or Java, tempeh, palm sugar, and spices like cloves are commonly exported from Indonesia. Palm oil, which is commonly produced by an evil industry that uses deforestation, is widely used in the U.S. Many people here are unaware that forests in Indonesia are quickly disappearing because of this demand, along with the potential extinction of animals like orangutans, elephants, and tigers. Is it too much to ask that that people in America try to learn more about Indonesia, Indonesians, and our food?It’s impossible for one chef to represent the entirety of Indonesian cuisine, which has 20,000 islands and is influenced by China, Japan, India, Europe, and the Middle East. I have roast pork belly on my menu, a dish influenced by my upbringing in Medan, North Sumatra, where many ethnic Chinese-Indonesians reside. I also have fried noodles, shrimp sambal, and tempeh sambal. Soon I’ll add our classics: beef rendang, braised beef chuck cooked in spice paste, coconut milk and lemongrass; nasi goreng, Indonesian fried rice cooked with sweet soy sauce. Try our curries and gado-gado salad, which includes blanched vegetables, fried tempeh and tofu, and compressed rice cakes with a thick peanut sauce. You’ll come to crave the salty, sweet, bitter, sour, and spicy flavors that define Indonesian cuisine.Special thanks to Ellie Tumbuan, chief strategist of The Justice Collective, whose research contributed to this piece. ChiliCali will be at Fort Mason’s ‘Off the Grid’ night market in San Francisco this September.Explore Bon AppétitHealthyishIndonesianSan FranciscoFood TrucksessayRead MoreLifestyleHow Daisy Orlana Ramli Kirschen Holds Down a Design Job While Hosting the Perfect Indonesian Pop-UpGallery5 SlidesBy Lizzie NoonanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-26", "author": ["Condé Nast", "Siska Silitonga Marcus"]}