{"id": "ca8aa1346341229482800341ef6caee6", "url": "https://www.bonappetit.com/story/jose-andres-we-fed-an-island", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "No Man Is an Island, But José Andrés Helped Feed One | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNo Man Is an Island, But José Andrés Helped Feed One“What went wrong with the disaster relief in Puerto Rico? The simple answer is: most of it.” The acclaimed chef pulls no punches in his powerful new book on Hurricane Maria's aftermath.By Hilary CadiganSeptember 11, 2018FacebookTwitterEmailPhoto courtesy World Central KitchenFacebookTwitterEmailChef José Andrés arrived in Puerto Rico five days after Hurricane Maria, on one of the first commercial flights to make it through. He found the tiny Caribbean island devastated: houses caved in, roads strewn with debris, electricity down, dead bodies piling up at barely-functioning hospitals.Yet here on the mainland, despite the fact that Puerto Rico is a U.S. territory populated by American citizens, little was being done. President Trump sent a few blustery tweets and headed off to his private golf club in New Jersey. FEMA, according to a federal report released this month, led a slow and disorganized relief effort marred by staff shortages and a lack of trained personnel. The Red Cross collected over $65 million from well-meaning donors, though it ultimately left more than half of that sum unspent. The Puerto Rican government’s officially reported death toll hovered under 20 for weeks after the storm; according to a revised count released last month, it was 2,975.If you expected the James Beard Award-winning Andrés’s new book, We Fed An Island, to be a feel-good fluff piece, think again. Yes, there are happy moments: chefs singing while doling out steamy, belly-warming bowls of sancocho; neighbors rescuing each other from the floodwaters; schools and churches coming together to feed their own. On a shoestring budget made up mostly of private donations, Andrés, local chef Jose Enrique, and their network of community kitchens managed to make and distribute more than three million meals to the people of Puerto Rico. But this book is a candid manifesto, brimming with righteous anger and holding to account those who should have fed the island, and didn’t.“What went wrong with the disaster relief in Puerto Rico?” asks Andrés in the concluding pages. “The simple answer is: most of it. When you see such epic failures, you realize these are systemic problems. The system failed from the top to the bottom, at every level of government, from federal agencies to nonprofit charities.”We caught up with chef Andrés over email to talk more about what happened in Puerto Rico, what he learned, and how we can do better.As you mention repeatedly in the book, chefs can be some of the most crucial people on the frontline in crises like this one. Why?Chefs have a very specific and unique skill set: We are trained to feed people. In times of disaster, we’ll find a kitchen, some ingredients, we’ll gather the people to help, and food will be ready and available for everybody. Too many organizations don’t see this. After a crisis, there needs to be medical care, electricity needs to be restored, houses rebuilt. So they’ll bring in doctors, electricians, engineers. But when people need to be fed, they send MREs [readymade Department of Defense field rations low on flavor and fiber]? Chefs—look us up, the Chef Relief Network of World Central Kitchen. We will put you to work!José Andrés wades through a flooded street to deliver a meal in Puerto Rico.\nPhoto courtesy World Central KitchenWhat was the biggest lesson you learned from your experiences in Puerto Rico?I think the biggest lesson is also the most simple one: When you find yourself up against a challenge, just start moving. Maybe it’s not profound; it’s not a lesson that will win a Nobel Prize, but it’s a lesson that will make an opportunity out of a problem. If you try to tackle everything all at once, you will stall, you will freeze, you will have a meeting to establish another meeting because you are trying to come up with ways to postpone action. We didn’t meet. We just began cooking. A thousand meals the first day, then doubled the number every day. Before we knew it we were at 150,000 meals a day! Break down big problems into smaller ones. You will be much more effective.In the book you mention “disaster boredom” and “compassion fatigue,” as growing problems in our current society, where we’re bombarded with news of crises, political nonsense, and tragedy. What advice would you give when it comes to retaining our sense of humanity?I think the best way we can avoid getting overwhelmed and shutting down entirely is to get involved locally in our own community. There are opportunities all around us to support good work, and by starting those conversations, volunteering, getting active, we will see that there is good all around us. All of you—everyone out there—has a talent. Don’t be shy, use it!Andrés, Jose Enrique, and their fellow volunteer chefs dole out sancocho from a makeshift community kitchen in Puerto Rico.\nPhoto courtesy World Central KitchenYou and your fellow chefs sing a song as you cook in the community kitchens, with Spanish lyrics that translate to “you live like me, I live by cooking.” Why did this become your anthem?These two amazing chefs, Roberto Espina and Rawi Leafar Yuri, were cooking at the Coliseum when some pleneros, street musicians, came and played for the chefs. They played a famous song, “Voy Subiendo”, which has the line “Tu vives como yo vivo, yo vivo vacilando”—”you live like me, I live by slacking.” The chefs changed the lyrics a bit: “Yo vivo cocinando” or “I live by cooking.” Literally and figuratively, so many of us live by cooking. It is in our blood, it is our passion, it’s what we think about when we wake up and when we go to sleep.What have you been up to since you finished writing?There is no time for a siesta. Next we are opening the newest, most modern Jaleo [the sixth location of Andrés’s flagship Spanish restaurant] at Disney [World] later this year, and then we are going to New York in the Spring when we are opening Mercado Little Spain—35,000 square feet of Spanish food and culture. And we’re hearing about some interesting opportunities for expanding our restaurants in Europe and Asia. And we will see what is next with World Central Kitchen. Never forget what Steinbeck wrote (with my slight edit), “Wherever there’s a fight so hungry people can eat, WE will be there!”Buy it: José Andrés's new book, We Fed An Island is $18 on Amazon.Photo courtesy EccoExplore Bon AppétitJose AndresPuerto RicoBooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-11", "author": ["Condé Nast", "Hilary Cadigan"]}