{"id": "ca9bce0ae2708a0924ca648bde1c81b1", "url": "https://www.bonappetit.com/recipe/ultra-creamy-mashed-potatoes", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Ultra-Creamy Mashed Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2017 IssueUltra-Creamy Mashed PotatoesBy Andy BaraghaniOctober 16, 20214.7(78)Read ReviewsTriangleEmailPinterestPrintMichael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintWe're ready to declare these the fluffiest and easiest creamy mashed potatoes around (though, if you like yours topped with some crispety cruncheties, we understand). The key here is not to waterlog your spuds: Boiling the potatoes with their skins on means they'll absorb less moisture, yielding a silky texture, not a gummy one. Yukon Golds are the best potatoes for mashing, with rich buttery flavor and creamy mouthfeel. As for those skins, the ricer or food mill will catch them—great news for lazy cooks everywhere. (Want all the pro tips? Watch Andy make them here!)If you’re tight on time on Thanksgiving, or any other day you plan to serve these mashed potatoes, you can make this recipe a day in advance and tuck it in the refrigerator. And while you’re at it, you could get a head start with this gravy recipe, which goes great with the potatoes, doesn’t rely on turkey drippings, and can be made up to five days ahead.Editor’s note: This recipe was originally published October 16, 2017.Ingredients8 servings 4pounds medium Yukon Gold potatoes, scrubbed4teaspoons kosher salt, plus more1½cups whole milk½cup heavy cream1head of garlic, halved crosswise3sprigs rosemary1cup (2 sticks) unsalted butter, room temperature, cut into piecesFreshly ground black pepperSpecial EquipmentA potato ricer or food mill fitted with fine diskPreparationStep 1Place potatoes in a large pot and pour in cold water to cover by 1\". Add a large handful of salt (water should taste briny, like the ocean) and bring to a boil. Reduce heat and simmer until potatoes are very tender but not crumbly, 30–35 minutes. Drain, briefly rinse with cool water to remove any excess starch, and return potatoes to warm pot (off heat) to dry while you heat the milk mixture.Step 2Warm milk, cream, garlic, and rosemary sprigs in a small saucepan over medium until fragrant, about 5 minutes. Remove pan from heat.Step 3Pass hot potatoes through ricer or food mill into a large bowl (cold potatoes will become gummy). Add butter and 4 tsp. salt and stir until butter is completely incorporated. Strain warm milk mixture through a fine-mesh sieve into a large measuring glass. Pour into potatoes ½-cupful at a time, stirring after each addition until liquid is fully incorporated and mixture is smooth before adding more.Step 4Serve mashed potatoes topped with a few grinds of pepper.Step 5Do Ahead: Mashed potatoes can be made 1 day ahead. Cover and chill. Reheat over medium, stirring often and adding ¼ cup milk or stock to thin out if needed.How would you rate Ultra-Creamy Mashed Potatoes?Leave a ReviewTell us what you thinkReviews (41)Back to TopTriangleWhy use unsalted and 4tsp salt instead of just salted butter? Amazing every time and I’m just beginning cooking!GCBaltimore12/20/2021Delicious!  These were extremely creamy and the best mashed potatoes I've ever made. I used Russet potatoes and they worked perfectly. I held off on 1/2 C of the milk mixture (added 1 1/2C overall) since it looked like I was on the verge of potato soup. I'd also use 1/2 tsp less salt the next time.Lauren PHouston, TX11/26/2021The new hack is to cook the potatoes in the milk, along with thyme, rosemary, and butter. Strain off the milk and use it when mashing. Utterly divine. Jkeva410Quicksburg, VA11/25/2021I love to cook and I love making all of the traditional recipes. As it turns out, my husband and adult kids don't seem to appreciate those old-fashioned staples nearly as much as I think they should! Year after year, I sought a mashed potato recipe that even the hardest-hearted of them would enjoy.  And finally, for Thanksgiving 2017 I tried this recipe. And my daughter said they were the very best mashed potatoes she'd ever had! I've been making them ever since. I do not deviate one iota from the recipe presented, as they are perfection! (Just ask that non-spud-loving daughter of mine!) Thank you Bon Appetit!Veda MSeattle, WA11/25/2021Super easy recipe to follow!   So good.   Make sure if you don't have a ricer you have a massive bowl to mash the potatoes in, I ran into some texture issues because of lack of bowl real estate.  Thanks Andy!Molly J.Brooklyn, NY11/24/2021Definitely my go to for mashed potato recipes! Highly recommend a food mill or ricer for the process. \n\nThe steeping process with the herbs in the milk and butter are a brilliant way to infuse the flavors so that it's throughout the mashed potatoes. I will continue to recommend this recipe to my friends. MarcelSeattle, WA11/24/2021Fire. Best mashed potatoes I've ever had. I tried this tonight with a skirt steak from Trader Joe's we BBQ'd to medium rare. I did not have a ricer but I used a large strainer! The golds mashed nicely. I used the jus from the steak to pour over, extra toss of kosher salt and cracked pepper, threw in some warmed baby peas. Best pub meal I've ever had at home. I think I need to get a ricer.Kathy W.Atlanta, GA.11/23/2021Fantastic potatoes, served it with BA's Red Wine-Braised Short Ribs and it was a hit. Warming the garlic for 5 minutes in milk is no where near enough time. Next time I will roast garlic in the oven first. Didn't have a ricer and used a masher instead - Still incredible.Connor B11/15/2021Sounds bomb but I posit that you can't call any mashed potatoes \"easiest\" if a ricer is involved, much less a mf \"milk mixture\".\nJupiter Henry10/22/2021Turned out absolutely amazing.  The right amount of creamy and still a bit fluffy.  Super fragrant and a nice flavor.  I did not have yukon and used russet and still turned out better than any other recipe I've ever used even with russets.  Also just used a potato masher and worked fine.L.L.San Francisco12/27/2020If you’ve never made and eaten these mashed potatoes you’ve never had simply delish mashed potatoes! I promise you! It will ultimately be a brand new experience. It’s not just the wonderful taste, but also the texture snd mouth feel of the Yukon Golds. What more can I say? They are just on a totally different level. I will never make mashed potatoes any other way; no point!Renee McGinleyWest Sacramento, CA12/27/2020Delicious, very easy.  The garlic really comes through.  Will absolutely make again! AnonymousSouthern California11/27/2020LOVED. THIS RECIPE! Definitely don't skip the rosemary.  I didnt add all the salt at once because of reviews saying it would be inedible (yeah right). Ended up using even a little more than the requested 4 tsp. All around great recipe and will be trying again!\n\nAlso,  I roasted a bulb of garlic and riced that along with the potatoes. Delicious!AuroraTX11/26/2020Whoa---I'm in sodium shock here. 4 teaspoons salt ???!!! Inedible.AnonymousMichigan10/24/2020These are BOMB and so easy to make. 12/10.skincareChicago4/19/2020Explore Bon AppétitPotatoVegetableYukon Gold PotatoSideThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-10-17", "author": ["Condé Nast", "Andy Baraghani"]}