{"id": "ca9e45a72d1fa9febadf890e498b42a3", "url": "https://www.bonappetit.com/story/joi-nut-milk", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "This Nut Milk Maker Keeps My Future Full of Almond Milk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI'll Never Run Out of Alt Milk Thanks to This ConcentrateJOI’s shelf-stable oat and nut milk bases are a sure bet.By Aliza AbarbanelAugust 24, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Oat and nut milks hold a special place in my kitchen’s ecosystem. They’re a shortcut to many of my favorite breakfasts, from chia pudding to smoothies, especially when hot weather makes turning on my stove undesirable. But I’ve been frustrated with the contents of the refrigerated aisle these days, largely due to a desire to cut down on single-use packaging and the potpourri of stabilizers found in many alt milk brands.I’ve flirted with making my own almond milk from scratch in the past, but soaking and squeezing big quantities of raw nuts is a messy activity that doesn’t come cheap. And, somehow, I always manage to snack or cook my way through my nut stash before I actually find the time to make milk. Then a coworker tipped me off to JOI’s organic oat and nut milk concentrates. The ingredient lists are short. JOI’s shelf-stable Organic Almond Base is made from just one ingredient—blanched organic almonds. It’s basically like an unroasted, easily emulsified nut butter. And JOI’s Organic Oat Milk Powder (made from, you guessed it, organic milled oats) even comes in compostable packaging that’s backyard-bin approved.Photograph courtesy of JoiJOI Organic Oat Milk Powder$16 at JOIMaking milk is as simple as whirring together JOI and water for thirty seconds using either a blender or a portable milk frother. I’ve found that watching the clock is key—blend too long, and it’ll separate. One 12-oz pouch of oat milk powder makes 4 quarts of oat milk, and the 15-oz tub of nut milk base (which also comes in cashew) yields 7 quarts. Mine doesn’t stretch quite that far since I like to add an extra teaspoon or two of powder or base each time I blend for a luxurious, silky-smooth texture. After reconstituting, your alt-milks can chill in the fridge for up to a week.Let the record show: I have tried way more than my fair share of nut milk concentrates over the years, and JOI’s is infinitely creamier than the rest—never gooey or gritty. Every Sunday, I take down my blender to make two cups for the week ahead. When I’ve worked my way through a jar of nut milk concentrate, I throw it in my recycling crate, which is noticeably emptier now that it’s not filled with half-gallon containers of alt milk. And as for the oat milk powder, once the bag is empty I take it over to my neighborhood community garden and bury it in the compost bin. Then I walk home in the summer heat, dreaming of the blueberry-tahini smoothie I’ll whir up with as my reward.JOI Organic Almond Milk Concentrate$25 at JOI (for 1)$48 at Amazon (for 2)Explore Bon AppétitShoppingRead MorecultureThe Joyoung Makes the Best Soy Milk (And All the Other Milks Too)By Clarissa WeishoppingThe 6 Best Vegan Ice Creams of Summer 2021, According to MeBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-22", "author": ["Condé Nast", "Aliza Abarbanel"]}