{"id": "caa8de6f4614ec556ade2baee4ec7ad3", "url": "https://www.bonappetit.com/recipe/pork-meatball-rice-bowls", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "Pork Meatball Rice Bowls Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPork Meatball Rice BowlsBy Molly BazMay 5, 20194.5(47)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintIf you’ve never used fish sauce before, this recipe is a great place to start. It’s a magical, salty, umami-packed condiment that truly shines when paired with other bold, flavorful ingredients like vinegar, chiles, and garlic. In this recipe, it's doing double-duty—both as a seasoning in the meatball mixture and as a part of the finishing sauce.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketSieve$18 At AmazonMeasuring Cups$18 At Bon Appétit MarketMedium Saucepan$39 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonMicroplane$16 At AmazonWhisk$10 At AmazonVegetable Peeler$10 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketHeavy-Duty Aluminum Foil$10 At TargetForkIngredients4 servings2cups basmati rice (NOT parboiled, converted, or quick-cooking)Kosher salt4limes1serrano chile3garlic cloves, divided3Tbsp. sugar, divided2Tbsp. fish sauce, divided3medium carrots2Persian cucumbersVegetable oil (for greasing)6scallions1small bunch cilantro11\" piece ginger1lb. ground porkPreparationStep 1Before we dig into the rest of this recipe, let's make a perfect pot of rice. (No shade on your rice cooker if you've got one, but everyone should know how to make a pot on the stovetop.) First, rinse 2 cups basmati rice in a fine-mesh sieve until water runs clear, at least 60 seconds. (Alternatively, you can rinse the rice in a bowl in several changes of cold water—whatever feels easiest to you.) Combine rice, 1 tsp. salt, and 2½ cups water in a medium saucepan with a tight-fitting lid. Stir to combine. Bring to a boil over high heat, then cover pot with lid and reduce heat to low, aiming for the lowest possible flame. Cook rice without uncovering, 18 minutes. Let stand at least 15 minutes, or until ready to use.Step 2Let's make a dressing! Cut 3 limes in half and squeeze juice into a medium bowl. Cut remaining 1 lime into wedges and set aside for serving. Cut off and discard stem of 1 serrano chile. Thinly slice crosswise, then finely chop and add to bowl. Using a Microplane, finely grate 1 large garlic clove into bowl. Add 2 Tbsp. sugar, 1 Tbsp. fish sauce, and 1 cup water and whisk to combine. Taste and adjust seasoning for salt.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Peel 3 medium carrots (no need to peel the cucumbers). Cut carrots and 2 Persian cucumbers thinly on a diagonal and add to bowl with dressing. Let sit to lightly pickle while you make your meatballs.Step 4Place a rack in top third of oven. Heat broiler. Line a rimmed baking sheet with foil. Lightly grease foil with vegetable oil.Step 5Time to make the meatballs! Thinly slice 6 scallions crosswise. Transfer white and light green parts to a medium bowl; reserve darker parts for garnishing later on. Finely chop stems of 1 small bunch cilantro and add to bowl along with pork. (Reserve cilantro leaves for serving.) Finely grate 1 1\" piece ginger and remaining 2 garlic cloves into bowl. Add 1 lb. ground pork and remaining 1 Tbsp. sugar, 1 Tbsp. fish sauce, and 1 tsp. salt. Work together with your hands just until well combined—you don't want to overwork your meatballs, otherwise they'll become tough.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Form pork mixture into twelve 1½\" balls. Arrange on prepared baking sheet.Step 7Broil meatballs, rotating pan halfway through, until browned on top and just cooked through, 7–8 minutes.Step 8Uncover and fluff cooked rice with a fork. Divide among bowls. Top with meatballs and some of the pickled veggies.Step 9Garnish with reserved dark scallion parts and cilantro leaves. Serve lime wedges and any remaining sauce alongside for dipping and drizzling.How would you rate Pork Meatball Rice Bowls?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleI just made this for dinner and loved it! It was definitely a refreshing change to what I normally eat and came out amazing! Thank you!John FToronto, Ontario 9/15/2021I cook a lot and this is in my families top 5 recipes. I stick pretty much to the recipe except sometimes I mix up the pork with 1/2 and 1/2 or i got Bison tonight. My husband likes a little more of the fish sauce so I add another tablespoon to the meat and I had another 1/2 tablespoon of sugar to the sauce. You can get whatever type of carrots you want. This time I bought rainbow carrots. This is soooooo good you will definitely add in your monthly rotation.Melissa JPlano, Texas8/31/2021I found the directions so much fun to cook with that I didn't even bother to prepare my ingredients ahead of time, which is a new system for me. I knew that I had everything I needed to make the dish, but the simplistic and clear directions were a great way to venture forth with this recipe. I cooked the meatballs on the second top tier for 6 minutes under the broiler and then moved them up to the top for another 5 and they were amazing. I think I'll reduce the amount of water in the pickling liquid next time but otherwise it was a spectacular success. Great meatballs, ya meatball! AnonymousRedwood City, CA 5/11/2020Delicious. Looking at the picture of this recipe I thought the only tasty thing would be the meatballs, but boy was I wrong. The pickled carrots and cucumbers were delicious, and the dressing was an amazing topping for the entire bowl. Of course, the meatballs were great as well.  Didn't have fish sauce so I used a sub of half soy sauce/half white wine vinegar, and replaced the serrano chile with some cayenne powder. freshquinoaOntario, Canada5/7/2020OK, to those who are offended because BA did not \"credit \" Vietnamese cuisine for the recipe, I have a somewhat different take. I think this is an effort not to talk down to the reader. Presumably, most of us who read BA are reasonably sophisticated about food. My guess is the vast majority recognize this as a Vietnamese dish. How would you feel if they accompanied a recipe for tacos with a brief explanations that \"tacos are a dish that is popular in the country of Mexico\"? You would think you had been transported back to the 1950s. BA is simply being appropriate for the times.AnonymousNorthern California4/10/2020Delicious! I made as directed with exception of adding some leftover red cabbage into the pickling liquid (my carrots and cucs are fuscia now, and I’m not sorry). I made this for my lunches this week, and I can tell I will be tapping my foot impatiently, waiting for my lunch break each day. Hannah HellevangMoorhead, MN1/20/2020I found an amazing hot sweet sauce that introduced me to fish sauce. So this was a have to try. I am surprised that people would rate this recipe a 1 because of it not stating it was of Vietnamese origin. That has nothing to do with the recipe itself or its great taste. Maybe everyone could be a little less touchy and more on to the Yea! Category of life and read a recipe or an article for its value and celebrate the result. Looking for reasons to be offended just makes others say “REALLY??!?” This is a fun, recipe sharing website...How did you get off track? Cook and  be happy!!Grammag8CALIFORNIA12/15/2019This was a hit among my family, including a sorta-picky 6 year old. The broiler wasn't getting the color I wanted on the meatballs so I actually switched to sauteeing the meatballs on the stove top. The sugar in the recipe gave a nice caramelization that I was NOT getting in the oven. I suspect I didn't preheat the broiler quite long enough before popping them in. \n\nI ran out of limes, so my sauce was a combo of lime and lemon, and it worked really well. Also didn't have fresh cilantro, so I subbed fresh parsley in the meat, and a little ground coriander. Definitely will make again. Would be great piled onto a sub, like a Banh Mi. AnonymousIndianapolis, IN12/6/2019The ginger in the meatballs is amazing. I didn’t grate the ginger but cut them in small julienne sticks to really get some ginger explosions as you’re eating. I let the rice cool down a little bit until lukewarm to get a nice contrast between the zingy cold pickled veggies, the lukewarm rice and the oven hot meatballs. Ate the leftovers the next day without reheating, still amazing.JonathanVLBelgium9/30/2019SO GOOD! I actually made it with ground turkey instead of pork and doubled the recipe. I forgot to double the amount of fish sauce in the meat mixture and it was still delicious. Definitely putting this recipe in my dinner rotation! AnonymousNashville, TN7/9/2019Incredible recipe, super flavorful and very easy to make. Make sure to credit the Vietnamese origin of dishes like this in the future, as other reviewers have stated.Anonymouscolorado6/3/2019Epic recipeAnonymousNew York5/31/2019People make food from other cultures all the time - it doesn’t get weird until you TAKE a Vietnamese recipe and refuse to give credit. Just say it’s a Vietnamese recipe! kaybrinckBay Area5/29/2019This recipe is not reminiscent of nuoc cham- it IS the traditional recipe for nuoc cham. It should not be too much to ask that a recipe created by a non-Viet person at least give credit to the culture it is clearly borrowing from.AnonymousWestminster, CA5/29/2019This is Vietnamese nuoc chamAnonymousGarden Grove, CA5/29/2019Explore Bon AppétitMeatballRice and Grain BowlRiceRice & GrainsGround PorkPorkMeatCarrotVegetableCucumberMainNut-FreeGluten-FreeDairy-FreeBroilLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-05", "author": ["Condé Nast", "Molly Baz"]}