{"id": "caa89dc81474bc334c4e2fedbd9ab86a", "url": "https://www.bonappetit.com/story/nordstrom-anniversary-sale-2021-2", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "The 14 Best Kitchenware and Home Deals from the Nordstrom Anniversary Sale 2021 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Kitchenware and Home Deals from the Nordstrom Anniversary Sale 2021Viking cast iron, Hydro Flasks, and our favorite at-home sparkling water maker—all on sale.By Tiffany HopkinsAugust 5, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.If you, like me, can’t bring yourself to pay full price for that fancy cookware set you really neeeed, let the Nordstrom Anniversary Sale 2021 be the opportunity to treat yourself. This is arguably the best time of year to shop (lots of sales but no holiday season pressure), and at Nordstrom today until August 8, you can score deals on everything from whiskey glasses and chic coasters for your next dinner party to aromatherapy diffusers and coconut-apricot candles that’ll help you chill the f*ck out. Below, I’ve gathered some of the best kitchenware discounts you can find on the web right now. And though I can’t tell you exactly what to cop, I can inform you that your dream indoor garden awaits.Hydro Flask Water BottleOf all our favorite insulated water bottles, the Hydro Flask is by far the best one for taking on long hikes. Unlike other insulated bottles, this one is equipped with a wide mouth that makes it easy to pack with ice cubes and a flexible carrying strap so you can hydrate on the go. Grab an extra for your favorite VSCO Girl (is that still a thing?).Photo courtesy of Nordstrom16-Ounce Hydro Flask Wide Mouth Cap Bottle$38 $28 at NordstromHestan Nanobond Three-Piece SetHestan’s stainless-steel cookware conducts heats like a boss, is incredibly durable, and—we hate to say it but it’s true—has “disrupted” the pots and pans marketplace. Just ask test kitchen director Chris Morocco, who reaches for the Hestan Nanobond 3.5-quart lidded saucepan more than any other pan in his arsenal. This set includes the saucepan and a 12.5-inch skillet.Photo courtesy of NordstromHestan Nanobond Three-Piece Set$790 $500 at NordstromClick & Grow Indoor GardenSay it with me: I will not allow a lack of space to prevent me from channeling my inner Kelis. You deserve a self-watering smart garden that’s equipped with a water reservoir, LED lamp, and basil starter pods to kick-start your green thumb journey. If you’re committed to growing your own salad bar, opt for the big boy version, which comes with tomato and lettuce pods in addition to the basil and has space for nine plants.Photo courtesy of NordstromClick & Grow Smart Garden 3$100 at Nordstrom$100 $75 at Click & GrowMalin + Goetz Votive Candle SetWe love Malin + Goetz's candles—especially the ones that are inspired by food, drinks, and…herbs. This set features three votive candles in dark rum, leather, and cannabis.Photo courtesy of NordstromMalin + Goetz Votive Candle Set$60 $42 at NordstromAarke Sparkling Water MakerNothing says partaaay like a sleek sparkling water maker that fits on your countertop. This Scandi-designed at-home carbonator produces 60 liters of perfect bubbly water from one CO2 canister, and unlike its competitors, it’s so handsome it’s practically an objet. All you’ve got to do is add some ice and citrus juice—and maybe a little vodka—and the party has begun.Photo courtesy of NordstromAarke Sparkling Water Maker$249 $164 at Nordstrom$219 $164 at AmazonFellow Electric KettleIf you don’t have a gooseneck kettle and are looking to up your pour-over coffee game, here’s your chance. With a subtle matte finish and modern, minimalist design, this is an electric kettle you’ll gladly keep on the counter for all eyes to see. It also has unbeatable precision. Select any temperature between 135°F and 212°F, and it’ll maintain your desired temp for an hour.Photo courtesy of NordstromFellow Electric Kettle$169 $120 at NordstromWine RackBe a person who has bottles of wine casually lying around instead of the person (me) perpetually running to the wine shop five minutes before they close. Then display those bottles in this gold-toned metal wine rack.Photo courtesy of NordstromWine Rack$49 $30 at NordstromViking Cast-Iron GriddlePancakes for two? Your cast-iron skillet will get the job done. But if you’re feeding a crowd, you need this reversible cast-iron griddle and grill. Sized to straddle two burners, it’ll handle French toast and fried eggs on one side and steaks and burgers on the other.Photo courtesy of NordstromViking Cast-Iron Griddle$100 $70 at NordstromFood52 Ultimate ApronThis super-functional, 100% cotton apron is like a Batman suit for serious cooks. Adjustable neck strap? Check. Chest pocket, side pockets, and lower pockets that double as pot holders? Check. Cup to tablespoon to fluid ounce conversion chart printed on a hidden flap? CHECK!Photo courtesy of NordstromFood52 Ultimate Apron$45 $36 at NordstromNorth Stream Natural Hand SanitizerApplying hand sanitizer every time you shake hands with a stranger at your friend of a friend's cookout? Great. Having dry, cracked knuckles for the entire shindig? Not so great. This all-natural hand sanitizer contains 70 percent alcohol to kill off germs and bacteria, but it also includes aloe vera, glycerin, and essential oils to keep your hands hydrated (and smelling like wildflowers).Photo courtesy of NordstromNorth Stream Natural Hand Sanitizer$18 $12 at NordstromSet of Two Latte Art CupsThe thick ceramic walls on these 11 oz. mugs not only keep your coffee at just the right temperature, but their subtle slope also helps you hone your burgeoning latte art skills. Look, it's a…swan?Photo courtesy of NordstromLatte Cups$45 $30 at NordstromAtelier Saucier NapkinsDo it. Throw a dinner party just to show off your fancy napkins. Three sets from Atelier Saucier, which makes soft, textural napkins out of recycled materials, are up for grabs during the Nordstrom Anniversary Sale 2021. Choose from navy pinstripe, a teal chambray, or a hot pink weave.Photo courtesy of NordstromAtelier Saucier Napkins$66 $50 at NordstromFood52 Kitchen TowelsThese lint-free flour sack towels are everything I aspire to be: low-maintenance and ready for any task. There’s nothing they can’t do. Use them as hot pads, food basket liners, mixing bowl stabilizers and, of course, for drying dishes and wiping up spills.Photo courtesy of NordstromFood52 Flour Sack Kitchen Towels$39 $31 at Nordstrom (4-Pack)Bamboo & Grapefruit Diffuser SetThe sleek black reeds on this oil diffuser set up from Nest New York will keep the citrusy aromas coming for up to three months—no matches or lighters required. Photo courtesy of NordstromBamboo & Grapefruit Diffuser Set$100 $67 at NordstromExplore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-28", "author": ["Condé Nast", "Tiffany Hopkins"]}