{"id": "caac462f8aefd96dcec929f57505f079", "url": "https://www.bonappetit.com/recipe/all-dressed-up-cauliflower-rice", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "All-Dressed-Up Cauliflower Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueAll-Dressed-Up Cauliflower RiceBy Sophia RoeDecember 1, 20204.3(55)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Adriana Paschen, Prop Styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintA vegan weeknight dinner of fluffy, textured cauliflower with warm spices from chef Sophia Roe, the host of Counter Space on Vice. For distinct bits of cauliflower that won’t turn into mush once they’re cooked, don’t overcrowd the bowl of your food processor. Doctor up your cauliflower rice with toasted pine nuts or almonds, dates or dried currants, lots of fresh herbs, unsweetened coconut flakes, or chopped fresh chile.Ingredients4 Servings1medium head of cauliflower (about 2¼ lb.), broken into florets2Tbsp. extra-virgin olive oil1medium red bell pepper, finely chopped1shallot, finely chopped2garlic cloves, finely grated1Tbsp. curry powder1tsp. ground turmeric½tsp. ground coriander¾cup canned unsweetened coconut milk1tsp. finely grated lime zest1Tbsp. fresh lime juice1tsp. coconut sugar or granulated sugarKosher salt¼cup golden raisins¼cup coarsely chopped cilantro¼cup unsalted, roasted pumpkin seeds (pepitas)¼cup coarsely chopped mint, plus torn leaves for servingPlain whole-milk Greek yogurt and lime wedges (for serving; optional)PreparationStep 1Working in 2 batches, pulse cauliflower in a food processor until pieces are about the size of rice (you don’t want to overprocess; err on the large side). Transfer cauliflower to a medium bowl lined with a kitchen towel to absorb any extra moisture.Step 2Heat oil in a large skillet over medium-high. Add bell pepper, shallot, and garlic and cook, stirring occasionally, until shallot and garlic are softened slightly, about 3 minutes. Sprinkle in curry powder, turmeric, and coriander and cook, stirring, until fragrant, about 30 seconds. Add coconut milk, lime zest, lime juice, and coconut sugar; season with salt. Reduce heat to medium-low; cook, stirring, until slightly thickened, about 2 minutes. Add cauliflower and raisins; cook, tossing occasionally, until cauliflower is just tender, about 3 minutes. Taste and season with more salt if needed.Step 3Add cilantro, pumpkin seeds, and ¼ cup mint to cauliflower rice and toss to combine. Divide among bowls; top with a dollop of yogurt if using and torn mint. Serve with lime wedges for squeezing over if desired.How would you rate All-Dressed-Up Cauliflower Rice?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleSuper delicious!! I didn't expect this to turn out the way it did. Don't skip the yoghurt ;). This is one of my new favourite recipes!AnonymousUG2/11/2022So delicious!!! I don’t make a ton of curry dishes so I was a little nervous, but it turned out amazing. The Greek yogurt adds so much to the dish. This is great for someone who doesn’t like a ton of spice (it is not spicy at all, in my opinion) but wants a lot of flavor. Andrea O.4/17/2021People complaining about the flavor probably think mayonnaise is a spice.\n JesseSmithfield, VA4/14/2021Did not like the heavy handed flavors mixed together. Will not make again.AnonymousNew York,  NY4/12/2021I was intrigued by this recipe because it’s a one-pot dish that comes together quickly with a fun variety of ingredients that I don’t typically cook with together. Unfortunately, I didn’t enjoy the overall flavor but I might try making a similar dish another time by experimenting with different spices. Note that it is very easy to overprocess the cauliflower. Next time, I’ll process the cauliflower in four (not two) batches.CarolSan Francisco, CA1/7/2021This was delicious! I increased the amount of herbs + spices for more flavor, and then topped it with feta and a side of roasted pita. Also chopped up two small red jalapeños and cooked them with the bell peppers, shallot and garlic for some much needed heat (and as a personal preference, left the seeds in.)LaurenVenice, CA1/5/2021We loved this! I fixed it for Christmas Dinner (for the vegans among us) and am fixing it again for New Year's Eve...different people. What a yummy dish. We loved the combination of flavors and the textures. It will become one of my favorite go-to dishes in 2021, I'm sure!\nAnnieDallas, TX12/31/2020Easy, healthy, great weeknight complement to almost anything.  We didn't find it bland--just add a bit of extra spices.  Mint at the end helps too.  Have made this several times because it's way better than rice.Good recipe follower12/31/2020I thought this recipe was delicious and super easy to make.  SheilajrossRocklin, CA12/30/2020Overall just a little bland for my taste. I ended up topping it with some sweet potatoes and it was an improvement.  Definitely don't skip the nuts and fresh herbs. LuluAlameda, CA12/29/2020We enjoyed this - super easy to prep and throw together on a weeknight. I think without the “optional” ingredients, the meal can be kind of bland, and feels like you’re eating healthy slop, so the texture in the pine nuts and chiles / yogurt was absolutely necessary. Also I made this for four adults - I would definitely recommend doubling up on ingredients or making a few side dishes if your serving a few!AnonymousChicago12/23/2020I’m not sure what I did wrong (I did follow the recipe exactly and think of myself as a good cook) but I found this a total waste of a cauliflower not to mention my spices. It just didn’t taste like anything... did I miss something?AnonymousNew York, NY12/21/2020It's a wonderful recipe! Love love love! Thanks SophiaJing Zhang12/14/2020YUMMY!  So easy to make and delicious.  Make sure to have everything chopped and measured before you start. I will make this again.SheilaJRRocklin, CA12/7/2020I love how easy and fast this recipe was! Super great AnonymousBrooklyn, NY12/6/2020Explore Bon AppétitCauliflowerVegetableCoconut MilkOther IngredientsSideGluten-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Sophia Roe"]}