{"id": "cac8468c194aff1ba25dadf4c21a333d", "url": "https://www.bonappetit.com/recipe/caramel-apple-breakfast-cobbler", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Caramel Apple Breakfast Cobbler Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCaramel Apple Breakfast CobblerBy Anna StockwellDecember 16, 20194.4(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Yekaterina BoystovaEmailPinterestPrintEmailPinterestPrintThis hearty make-ahead cobbler is ideal for busy holiday mornings. You can prepare the cardamom-spiced biscuits and the honey caramel apple filling a day in advance, then assemble and bake the cobbler as soon as you wake up for a low-effort, cozy, and satisfying morning treat.Ingredients8 servingsBiscuits¼cup granulated sugar1Tbsp. baking powder1½tsp. ground cardamom1tsp. kosher salt2cups all-purpose flour, plus more for dusting½cup (1 stick) chilled unsalted butter, cut into pieces1⅓cups chilled heavy creamFilling and Assembly½cup honey2Tbsp. unsalted butter1Tbsp. fresh lemon juice1tsp. kosher salt5Pink Lady or other crisp apples (about 2 lb.), cored, cut into 1\"-thick wedges2Tbsp. heavy creamRaw sugar (for sprinkling)Plain or vanilla yogurt (for serving; optional)PreparationBiscuitsStep 1Whisk granulated sugar, baking powder, cardamom, salt, and 2 cups flour in a medium bowl to combine. Add butter and toss to coat. Quickly smash butter into flour mixture with your fingers, working until the largest pieces are about the size of a pea. Gradually stream in cream, tossing flour mixture constantly with a fork to distribute. Using a flexible bench scraper or hard plastic spatula, fold dough over and onto itself several times, scraping bottom and sides of bowl, to bring together to a mass (the dough will feel very wet and sticky).Step 2Turn out dough onto a generously floured surface. Pat to a ¾\"-thick rectangle or square with floured hands, using bench scraper or spatula to lift up dough and dust underneath with more flour as needed to prevent sticking. Dust work surface with more flour, then cut dough into 4 equal pieces and stack on top of each other. Dust with flour and press down on stack. Pat down to a ½\"-thick square, dusting with more flour as needed. Using bench scraper or sharp knife, cut dough into 2\" squares (don’t worry if they aren’t perfect or even); you should have about 12. Chill until ready to use.Step 3Do Ahead: Biscuits can be made 1 day ahead. Place on a floured plate or rimmed baking sheet, wrap tightly, and chill.Filling and AssemblyStep 4Heat honey in a heavy 10\" ovenproof skillet (preferably cast iron) over medium, stirring occasionally, until caramelized and deeper in color, like maple syrup, 8–10 minutes (if using a cast-iron skillet, test color of caramel by spooning some onto a white plate). Stir in butter, lemon juice, and salt until combined. Add apples and toss to coat. Let cool.Step 5Preheat oven to 425°. Brush cold biscuits with cream and sprinkle with raw sugar. Arrange biscuits, cream and sugar side up, over top of filling, leaving some gaps between. Bake cobbler until biscuits are golden brown and filling is bubbling, 25–30 minutes. Serve with yogurt alongside (if using).Step 6Do Ahead: Apple filling can be made 1 day ahead. Cover and chill.Photo by Laura Murray, food styling by Yekaterina BoystovaHow would you rate Caramel Apple Breakfast Cobbler?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleNot sure that the biscuits alone rates this recipe as “breakfast,” but I’d eat it anytime of day just the same.AnonymousLas Vegas, NV10/25/2021Made this as a dessert instead of as a breakfast. It was delicious without being sickly sweet. I was worried about the apples not cooking enough but they turned out perfect, not mushy with just a bit of bite. I had to cook for closer to 35 minutes to get the biscuits cooked through and did foil them for the last 10 to insure the tops did not burn. We ate with unsweentend whip cream but I think the yogurt would have been a better addition by bringing in a bit of tartnessAnonymous7/30/2021i'm not sure what is supposed to make this a breakfast item but it is definitely too sweet and sugary?? maybe an american thing?? in any case, I find this recipe a little blah- there is a punchy flavour to the biscuits and the caramelized honey is tasty but I just don't find that it is particularly exciting or remarkable. technically the biscuits rise nicely and the filling cooks well but it's nothing to write home about. and not a breakfast??? lol toronto5/26/2020This was so easy! I made the elements the night before and just assembled everything and popped it in the oven in the morning. One thing i would say is if you’re not all that keen on honey this does have a very obvious honey taste but that is to be expected. My biscuits cooked all the way through and everything came together beautifully.Potatosandwichtimeottawa, canada5/25/2020First dish to ever impress my hard to please mum without any criticism.  That says everything! caramelmochiVienna, Austria3/27/2020Made this for Christmas breakfast and everyone raves about it! It even heated up as leftovers well. Went to make it again today and saw the reviews and needed to comment, I thought it worked perfectly as described. With the cream brushed on the biscuits they did not burn on top, they were crisp and fluffy and the bottom was cooked through and not raw as others said but instead had soaked up the sticky honey-apple goodness. Absolutely delicious. But of course if you don’t like the the syrupy quality to the bottom of the biscuit I can understand, but I did not find them remotely raw or underdone. This is a winnerAnonymousNew York City 1/19/2020I agree with the review below. Cooking the biscuits on top of the cobbler left the bottom raw and doughy and the tops over done. The cobbler went well with yogurt, I did enjoy that. michnationToronto, Canada1/3/2020I’d like to make but, I’d like to add dried cranberries to the recipe.AnonymousI live in Minneapolis, MN12/27/2019This recipe was a little misleading. I cooked the cobbler with the biscuits on top, as instructed, and after 20 minutes the tops of the biscuits were burning while the bottoms were still raw. I would highly recommend cooking the apples and the biscuits separately to avoid this mess. Sophie AndersonLos Angeles12/19/2019Explore Bon AppétitCobblerFruit DessertDessertAppleFruitYogurtOther IngredientsFallWinterNut-FreeBakingChristmasBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-16", "author": ["Condé Nast", "Anna Stockwell"]}