{"id": "cac85439ea237fca2736e93ae0cc7772", "url": "https://www.bonappetit.com/recipe/easy-blueberry-cream-scones", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Easy Blueberry Cream Scones Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesEasy Blueberry Cream SconesBy Claire SaffitzMay 15, 20184.5(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintThink of these scones as the easier, cooler cousin of the blueberry muffin. Why cooler? Because they don't even require a muffin pan. Why easier? Because all you have do is mix heavy cream and a little honey into the dry ingredients. It's a one-bowl brunch slam dunk.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketGlass Measuring Cup$19.99 At AmazonMicroplane$16 At AmazonLarge Bowl$18 At AmazonWhisk$10 At AmazonMedium Bowl$17 At AmazonForkFlexible Metal Spatula$9.99 At AmazonPastry Brush$9 At AmazonSmall Bowl$13 At AmazonChef's Knife$34.53 At AmazonParchment Paper$3 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredientsMakes 81lemon⅓cup plus 2 Tbsp. sugar2cups all-purpose flour, plus more for dusting1cup plus 2 Tbsp. old-fashioned oats2½tsp. baking powder½tsp. kosher salt1⅓cups plus 1 Tbsp. chilled heavy cream2Tbsp. honey1cup frozen blueberries, preferably wild1large egg yolkPreparationStep 1Place a rack in upper third of oven; preheat to 400°. Finely grate zest of 1 lemon with a microplane into a large bowl. Add ⅓ cup sugar and massage with your fingertips until mixture looks like wet sand and is very fragrant. Set aside remaining lemon for another use.Step 2Add 2 cups flour, 1 cup oats, 2½ tsp. baking powder, and ½ tsp. salt to bowl with sugared zest. Whisk to combine.Step 3Whisk 1⅓ cups cream and 2 Tbsp. honey in a medium bowl until combined.Step 4Slowly drizzle cream mixture into flour mixture, tossing with a fork to disperse liquid and hydrate flour. Stop mixing when you still have a few dry spots.Step 5Add 1 cup blueberries and fold mixture with a rubber spatula, taking care only to mix until blueberries are distributed throughout and you have a sticky dough. It’s okay if some of the blueberries bleed or get broken up.Step 6Dust countertop liberally with more flour and turn out dough. Pat down into a 1\"-thick square, flouring hands lightly to prevent sticking as you work.Step 7Mix 1 egg yolk and remaining 1 Tbsp. cream with a pastry brush in a small bowl. Brush yolk mixture all across surface of dough.Step 8Sprinkle remaining 2 Tbsp. oats and 2 Tbsp. sugar over.Step 9Using a knife or metal bench scraper, cut dough into 4 quadrants, then cut each quadrant in half diagonally so you have 8 triangles.Step 10Transfer each triangle to a large parchment-lined rimmed baking sheet, spacing evenly.Step 11Bake scones on upper rack until tops are lightly golden all over and bottoms are golden brown, 15–20 minutes. Let cool on baking sheet. Serve warm.Step 12Do Ahead: Scones are best made the same day. Rewarm slightly in microwave or oven, if needed.How would you rate Easy Blueberry Cream Scones?Leave a ReviewTell us what you thinkReviews (30)Back to TopTriangleWe liked them but I would double the lemon zestIrinaCT2/19/2022This is an excellent recipe.Elaine McCoy Durham, North Carolina 1/18/2022Excellent! for the person who used milk - heavy cream has higher fat and lower water content, so using milk in a cream scone recipe doesn't warrant giving the recipe fewer stars! The recipe didn't call for milk - so of course you are going to get a wet sticky dough and a completely different final product. For those asking about non-dairy, I would definitely try full fat coconut milk. I've used that in a scone recipe before and it worked pretty well. Jennifer GeoghanPrinceton7/8/2020I have made this 3 times now, every time they are perfect! AnonymousCalifornia7/4/2020Dough was too sticky and wet. I put in 1/3 less liquid (half almond milk/half regular milk) and it was way too wet. Dough didn't really rise and texture was gummy... flavour was very good!Itsaviola6/21/2020These came out so good and I like that these can be modified for different flavors. I used orange zest and craisins since we had a big bag in the pantry and they were delicious. Also added almond extract and chopped almonds to a second batch to use for strawberry shortcakes and it was a success AnonymousAustin 6/1/2020Not the Very best scones I’ve had but certainly the easiest to make and still very tasty. I might add a smidge if almond to the next batch. Will definitely make again. Took 20 minutes in my oven. AnonymousNaples FL5/24/2020SILK has a dairy free heavy whipping cream. Ive made it before with reg heavy whipping cream and the dairy free heavy whipping cream and there was no difference. My favorite blueberry scone recipe ever!anwatsonnHarrisburg,PA5/22/2020I made this recipe once and it was wonderful, super easy to follow along! However, I have a few lactose intolerant members of my family that the heavy cream didn't agree with haha. Does anyone have any suggestions for a dairy free option for the heavy cream so i can try to make it again?! apyapyNY, NY5/21/2020My go-to scone recipe! It's very easy to sub in different fruits and/or flavors and they come together with limited time and dishes.Anonymous5/21/2020These scones are amazing! Really pillowy and moist texture inside unlike other butter based recipes. I’ve made them four times and they always come out great. In a pinch, I swapped the cream for plain yogurt thinned out with a little milk and they turned out great. DominicLizamaGuam5/11/2020I followed the recipe as written. Made 8 scones. They were tasty.RecipeFollower5/5/2020This was so super easy and simple - loved the step by step and they tasted amazing!! I will have my daughter make these next time!Maria RecchiSnoqualmie 4/27/2020Truly amazing. Super easy to make and extremely delicious. I'll definitely be making these again!nunezc2002Sacramento, CA4/20/2020Absolutely delicious! This was my first time making scones and the recipe was so easy to follow! They turned out beautifully and the whole family loved them. Thanks,​ Bon Appetit! JuliaWAlberta3/28/2020Explore Bon AppétitSconePastriesBritishEuropeanBlueberryBerryFruitOatRice & GrainsEasySnackNut-FreeVegetarianBakingBreakfastBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-15", "author": ["Condé Nast", "Claire Saffitz"]}