{"id": "cacc477bcb1d90cafc23d6cb37560fd7", "url": "https://www.bonappetit.com/story/jennifer-kim-passerotto-chicago", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Don’t Call Passerotto in Chicago Fusion | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsDon’t Call Passerotto FusionAt the buzzy Korean-Italian restaurant in Chicago, chef Jennifer Kim refuses to play by the rules.By Elyse InamineOctober 8, 2018FacebookTwitterEmailPhoto by Jeff MariniFacebookTwitterEmailInside the kitchen of Passerotto in Chicago, you’ll find a curious combination of doenjang and bagna cauda, kimchi and Calabrian chile. These building blocks of Korean and Italian cuisines aren’t often found on the same plate, but for chef Jennifer Kim, it all makes perfect sense.“That’s a question I get asked a lot: ‘Why Italian?’” Kim, a first-gen Korean-American, tells me over the phone. “I’m not randomly taking two things and trying to make it work. It’s something that’s been in the making my whole life.”Kim, 35, grew up in the quiet Chicago suburb of Schaumburg in the 1980s, a place and time when international food aisles and Korean restaurants were few and far between. While her parents worked odd jobs late into the night, she’d fix herself dinner at home, heating up spaghetti and meatballs courtesy of Chef Boyardee with a serving of her mom’s makeshift kimchi on the side. “It’s in no way traditional kimchi, but for us, it was kimchi when there was no kimchi,” she explains.In many ways, her dishes at Passerotto are simply more sophisticated versions of these early mashups: Cavatelli is tossed in nori butter; lamb ragu is served with chewy rice cakes; gochujang and tofu come together with Manila clams, mussels, and head-on shrimp for a clever marriage of soondubu and cacciucco, a Tuscan fish stew.“There are a million different renditions of cacciucco—every family has their own,” says Kim, who spent time eating her way up and down Italy and in the kitchen at Nico Osteria and other Italian hotspots in Chicago. “The first one I had was made by my friend’s parents from Liguria. I remember I felt like I had this before: It really reminded me of soondubu.”This coming of age story translated into food is exactly what makes the buzzy new restaurant, open since May, so radical. In blurring the borders between seemingly far-flung traditions, Kim’s cooking epitomizes how the children of immigrants often eat, blending the cuisine of their heritage with that of their hometown for an entirely new kind of comfort food.“The whole menu is a progression, showing people what it’s like to be an immigrant and how other cultures play a part,” she says. “Why does Italian food make me feel the same way [as] when I eat Korean food? What are the bridges between the two cultures?”These questions have resonated with diners who often bring their own experiences to the table. Recently, a couple told Kim that her popular cacciucco-soondubu hybrid reminded them of their grandmother’s étouffée, a roux-enriched, tomato stew with shellfish and rice from the Creole and Cajun cooking canons. “It was such an interesting response,” she recalls. “The fact that this dish isn’t just emotional and personal for me but for someone else [too] is so meaningful.”And while connecting the threads between the foods of her youth has become her mission at Passerotto, she’s just as determined to show how no cuisine truly stands alone.“When I think of Korean food,” she says, “there are such large Japanese and Chinese influences. What if we never had those influences? How different would Korean food be? When does traditional food start?”She pauses. “Inevitably, food morphs—and it should.”Explore Bon AppétitChicagoRestaurantsKoreanItalianChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-08", "author": ["Condé Nast", "Elyse Inamine"]}