{"id": "cada50a4987903b7482fd3548e48ae43", "url": "https://www.bonappetit.com/story/dinner-party-dietary-restrictions", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Is It Ever Okay... To Cancel a Dinner Party If Too Many People Are Paleo? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay... To Cancel a Dinner Party If Too Many People Are Paleo?You’ve got dietary restriction questions. We’ve got answers.By Alex BeggsJanuary 18, 2019FacebookTwitterEmailGetty ImagesFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s etiquette column. Have a question? Email staff.bonappetit@gmail.com.When a waiter asks me if I have allergies, and I really dislike cilantro, can I just say cilantro is an allergy? If they clarify if it’s really an allergy, should I stand firm? —Lying LarryI have some THOUGHTS because I am “one of those people” for whom cilantro tastes like soap. My family is deeply embarrassed about it. If I’m ordering tacos, I ask the waiter to hold the cilantro and I can feel the head-shaking shame vibrating off them. If I forget, I take the cilantro off with my own bare hands—it’s NOT A BIG DEAL. And because this is a widely known “genetic thing,” saying you’re allergic to cilantro is hilariously, obviously, a lie. Plus, the odds of it crashing your party are low. It’s usually right on top! When you know what dish you want to order, ask the waiter to “tell you more about it,” and keep your ears perked for cilantro while they give you the spiel about how the chef gets this really nice radicchio from an underground salad lair farmed by Ninja Turtles. Then order it “without the cilantro, please!” ALTERNATE SOLUTION: No matter the cuisine or setting, always add “hold the cilantro” to your order. “But ma’am, it’s a hot ‘n’ ready.” “But ma’am, it’s flan.” But sir, it’s called insurance.Hello! I’m curious what you could delight me with for my vegan-candida-cleansing-sweet-tooth self😳 I apologize in advance🙏 —Apologetic AllisonOh Allison why’d you have to throw this at me. The emojis did help lessen the blow, but damn, this is a restrictive diet that I’m not medically trained in. You’re reducing foods that might be causing yeast infections or other fungal problems I’ll leave to deep WebMD searches. It sounds like cutting processed food, white sugar, and switching to whole grains play the biggest part, but I see other lists online that are terrifyingly militant, cutting all berries and fruit, only allowing for artificial sweeteners—damn! It’s a free country (other than the taxes and cable monopolies), so I’m not going to come over there and rip the Stevia out of your hands on this antifungal journey. BUT I AM GOING TO RECOMMEND A GREAT VEGAN DESSERT!! This citrus with nut crumble uses coconut sugar (allowed? I dunno, this is stressful), and you can eat the crumble by the handful, or sprinkle it everywhere, like on all that seaweed.This vegan Caesar is SO GOOD THO.\nI feel like anchovy is popping up more and more in otherwise vegetarian recipes lately (Ottolenghi I’m looking at you!). What’s the best substitution for anchovy, so I can keep things fish-free? —Mopey MaxAnchovies are AMAZING and yes, they’re everywhere right now, and I like your inclination to blame Ottolenghi, because it shows you’re a cool, in-the-know food person. Maybe you dabble in pomegranate seeds—that’s classy as hell. But depending on where the anchovies are appearing, you could sub capers if you need a hit of brine (like in this vegan Caesar), garlic or onion powder if it’s in a dressing or sauce that needs umami oomph, mushrooms or mushroom powder for funkyness, or cut a piece of potato into a fish shape and let your mind do the work.SNACK BREAKGluten-free carrot cake! Satisfy your sweet tooth, your carrot tooth, and feel proudly gluten-free, whether you’re Celiac or just looking for a dietary answer to your inner troubles!!Gluten-Free Carrot CakeAlmond flour is a wonderfully sweet, nutty complement for fresh carrots, walnuts, and raisins.View RecipeI’m a low-key baker, and I try to be inclusive for people who are gluten-intolerant despite not being so myself. When baking, do I need to simply switch out the recipe’s preferred flour for a gluten-free flour? (I’ve used King Arthur previously.) —Judicious JaredWay to position yourself as the hero here, Jared! Gluten-free flours like King Arthur’s are great for 1:1 subs when you’re turning a regular recipe gluten-free. I talked to Gluten-Free Carrot Cake King Chris Morocco, who likes Bob’s Red Mill GF flour even better. But when Chris developed the carrot cake, he went with almond flour to play off the flavors of the spiced carrots; it was a deliberate choice, and all other ratios in the recipe reflect that flour. (Similarly, you gotta try Alice Medrich’s wonderful oat flour sponge cake). Recipes that call for 5 different flours, worm’s wort, a breath of fresh air, and Xanthan gum are annoying, but it happens.)When you invite people to a dinner party, do you ask them if they have any dietary restrictions, do you expect them to tell you if they don’t eat certain food groups, or do you just prepare a delicious dinner and hope for the best? What does a good host do?  —Gregg’s got a pointI’ve got an answer for every position:Host: Ask your guests WHEN YOU INVITE THEM: “Is there anything you don’t like?” Deal with the answers by adjusting your menu.Guests with an allergy: If the host doesn’t ask, and you’re allergic to mustard seeds, you better fuckin’ tell me. Follow this script. “I’m so excited to come, I’ve heard you’re such an incredible cook and conversationalist, I’d love to bring something—oh, and, I wanted to tell you I’m allergic to mustard seeds. I hope that doesn’t throw a wrench in your beautifully planned menu and beautiful, perfect life!”Host with a guest with an allergy: Come on, you can deal with eliminating an ingredient or two, think of it as a Chopped basket full of EpiPens!Guests who are VEGAN or WHOLE30 or PALEO or KETO: Or whatever very strict diet. Dare I ask that you offer to bring a dish? Gasp! The nerve! These are diets that require you to cook a lot and know the ins and outs and rules and lists like the back of your hand. It can be terrifying and anxiety-inducing for the host who loves you and wants to spend time with you. I’d like to live in a world where home cooks can deal with this like restaurants (mostly) can. But we don’t. If the host is savvy and up for a challenge, they’ll be like, “Nah, I got u, I’ll make a big salad! Just bring your cute face and maybe some freaky vegan chocolate or something.” But if they’re going to have to Google every ingredient, help out. You were going to bring wine anyway, right? Bring a Paleo thing, maybe we’ll all dig it and soften our judgy feelings. Bring a whole head of raw broccoli and eat it like cotton candy. Bring a frozen Trader Joe’s thing. It doesn’t have to be a vegan cassoulet.Host with a guest who is VEGAN or WHOLE30 or PALEO or KETO: If they don’t offer to bring something, you could politely ASK. Script: “That’s awesome! I’m so happy for you, that must be a hard adjustment after 38 years of eating Manwich. I have 14 people coming over, so I was going to make a leg of lamb, would you mind bringing something vegan you’d like to share? I can’t wait to see you!!!”We just all need to work together here.That’s all for now, but if you have petty etiquette questions or recipe requests for me, email staff.bonappetit@gmail.com and be too specific. I want the juicy details!Love, AlexSome Dietary Restriction–Friendly Recipes30 Great Paleo RecipesKeto Recipes That Aren’t All Bacon53 Gluten-Free Recipes You Definitely Want to Cook AND Gluten-Free Desserts33 Vegan Dinner RecipesVegetarian Weeknight Dinner Ideas and Vegetarian Comfort FoodsExplore Bon AppétitEtiquetteVeganGluten FreeIs It Ever OkayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-18", "author": ["Condé Nast", "Alex Beggs"]}