{"id": "cade963ba6fbc7e1452af2e7b6ab12f2", "url": "https://www.bonappetit.com/recipe/dahi-puri-with-black-chickpeas", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Dahi Puri Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueDahi Puri With Black ChickpeasBy Preeti MistryMarch 16, 20214.5(4)Read ReviewsTriangleEmailPinterestPrintPhotograph by Heami Lee, food styling by Frances Boswell, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“These are the best party snacks. They’re light, and they look really nice with crunchy sev and different chutneys on top,” says chef Preeti Mistry of this chickpea-and-potato-filled chaat. They call for black chickpeas in this recipe—Mistry recommends Rancho Gordo’s desi chana—which lend a nuttier flavor than the larger, tan garbanzo beans. Pigeon peas or black-eyed peas work well as a substitute. Kala namak, or black salt, which Mistry describes as having a sulphuric smell and an umami kick, should be used in place of kosher salt if you have it.To serve, Mistry suggests encouraging folks to have fun scooping the chickpeas and potato hunks into the puris, then drizzling spiced yogurt, chutneys (like this one), and garnishes over them.Find more of chef Preeti Mistry’s Holi party recipes here.Ingredients8 Servings½cup dried black chickpeas, soaked overnight, drained (Rancho Gordo desi chana, recommended)Kosher salt3medium Yukon Gold potatoes (about 1 lb.), peeled, cut into 1\" pieces1tsp. ground turmeric½cup tamarind concentrate (such as \tSwad)2Tbsp. date syrup2tsp. finely chopped, peeled ginger4Tbsp. chaat masala, divided, plus more for serving3tsp. ground cumin, divided3tsp. red chili powder, divided2cups plain whole-milk yogurtVegetable oil (for frying; about 8 cups)17-oz. packet pani puri½cup Scallion Chutney1small red onion, finely chopped1cup coarsely chopped cilantro1cup coarsely chopped mint18-oz. package thin sevspecial equipmentA deep-fry thermometerPreparationStep 1Place chickpeas in a medium saucepan and pour in water to cover by 2\"; season with salt. Bring to a boil, then reduce heat to medium-low and simmer, stirring occasionally and adding more water as needed to keep covered, until tender and very creamy, 45–60 minutes. Drain.Step 2Meanwhile, combine potatoes and turmeric in another medium saucepan and pour in water to cover by 2\"; season with salt. Bring to a boil, then reduce heat to medium-low and simmer, stirring occasionally, until potatoes are tender, 8–10 minutes. Drain.Step 3Purée tamarind concentrate, date syrup, ginger, 2 Tbsp. chaat masala, 1 tsp. cumin, 1 tsp. red chili powder, and ¼ cup cold water in a blender until smooth. Season tamarind chutney with salt.Step 4Mix yogurt, 2 Tbsp. chaat masala, remaining 2 tsp. cumin, and remaining 2 tsp. red chili powder in a small bowl to combine; season with salt.Step 5Pour oil into a large pot to come 3\" up sides and fit with thermometer. Heat over medium until thermometer registers 350°. Working in batches, slip 6–10 puris into oil and fry, turning with a slotted spoon, until golden and puffed, about 30 seconds. Transfer puris to a paper-towel-lined baking sheet.Step 6Break open puri on one side and fill each one with 1 Tbsp. chickpeas and 1 Tbsp. potatoes. Transfer to a platter; drizzle with spiced yogurt, tamarind chutney, and Scallion Chutney. Scatter red onion, cilantro, mint, and sev over and sprinkle with more chaat masala.How would you rate Dahi Puri With Black Chickpeas?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleok never mind, i see that a \"packet of pani puri\" is needed.  phew!Anonymous3/23/2021So maybe i'm missing something - where is the recipe for the puris?  Ruthanne17Sag Harbor, NY3/23/2021Explore Bon AppétitIndianSouth AsianAsianChickpeaBeanVegetablePotatoPigeon PeaBlack-Eyed PeaYukon Gold PotatoSnackStarterVegetarianHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Preeti Mistry"]}