{"id": "cae75a9a88abb0c385d8c97f4c34c4e6", "url": "https://www.bonappetit.com/story/alcohol-and-acne", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Does Alcohol Cause Acne? (Asking for a Friend) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHelp! I’m Pretty Sure All This Booze Is Giving Me Acne Does alcohol cause acne??? An investigation.By Ali FrancisJanuary 3, 2022FacebookTwitterEmailIllustration by Ina JangFacebookTwitterEmailDear Universe,I would say I hope you’re well, but this isn’t really about you, is it? No, it’s about me, and the burning question I hope you can help me answer: Does alcohol cause acne???I’m asking because, after a jolly holiday season of margaritas at the office party, honey-laden hot toddies after cold ski days, and poppin’ bottles on New Year’s Eve, a vagrant cast of cystic pimples are living rent-free on my forehead and chin. If they could—they’ve only got pus for brains—I’m sure they’d point their greasy little fingers at booze and say, “He dunnit.” I know it, they know it, but can dermatology prove it?Listen, at this point in my testimony, I should probably disclose that I’m not new to this rodeo. I have endometriosis, the inflammatory disease affecting roughly 10% of people with periods. And after enjoying clear skin throughout my teen years, bouts of hormonal acne have haunted the majority of my adult life. I’ve worked through (most) of the insecurities our impossible beauty standards inspire (thank you, therapy), but I also know that when my skin is inflamed, it’s usually trying to tell me something. So I have to wonder: Why so mad, face? Sure, I’ve been pounding holiday cookies like the next guy—but I do that regardless of the season. Which brings me back to the main point: Usually a light imbiber, I downed more alcoholic drinks in the past month than I had all year.Here’s the thing, though: Skin health aside, I don’t want to stop partaking altogether. But nothing else I’ve done—buy fancy cleansers, experiment with elaborate skin-care routines, meditate like it’s my job—has helped with the acne. So, Universe, can you step in please? Does alcohol cause acne? How? Are some types of alcohol easier on the face than others? And is there any way I can lap at the odd white wine without Puberty 2.0 rearing its unwanted head(s)?Yours,Grown-Ass Adult WomanAlcohol can trigger acne, but it’s not the direct causeAs it turns out, bacteria, inflammation, excess oil production, and clogged pores are the true culprits behind all those blemishes. But alcohol can trigger many skin conditions, “including acne, psoriasis, and rosacea,” says Rachel Nazarian, M.D., F.A.A.D., a dermatologist practicing in New York City. Which means, essentially, that if you are prone to any of those issues already, slamming a flight of Jell-O shots might likely prompt some side effects.Booze is also a diuretic, so it causes dehydration, which, says board-certified dermatologist Rose Ingleton, M.D., signals to your oil glands to produce more, more, more! Not to mention, “high [alcohol] consumption may also suppress immune [system] responses, which could make you more susceptible to [a buildup of] bacteria” in the first place.Ingleton explains that a big night on the sauce could also disrupt your hormone levels—one study found alcohol can boost estradiol (a form of estrogen) and another found that the same went for testosterone levels in premenopausal women—which leads to inflammation. Bad news for people like me: “In theory, those with already existing hormonal imbalances may be more likely to experience [acne] breakouts triggered by alcohol,” she says.Mixed drinks tend to be the worst offendersIngleton puts it simply: “Sugary alcoholic drinks are going to be worse for your skin.”Acne thrives on foods with a high Glycemic Index (GI), which means they have an increased effect on your blood sugar, and cocktails and punches can get pretty sweet. Therefore, Nazarian says, “We can hypothesize that alcoholic beverages with high sugar content would be a ‘double whammy,’ thus increasing risk [of an acne flare-up].”While people prone to rosacea should probably avoid red wine, which can worsen the condition, Ingleton explains, acne sufferers like me might want to stick to clear liquors “like tequila or vodka” and skip the sugary mixers. “You could also try keeping a log of what you’re drinking and whether or not it causes breakouts to figure out if you have specific triggers,” she says.1 / 19ChevronChevronSalted Watermelon MargaritaView RecipeWater is your best weaponNazarian’s best advice for mitigating the negative effects of alcohol on skin is “to hydrate aggressively before and after any event which you know will include alcohol intake.” We all know water is good for us, and it’s also good for our skin: When properly hydrated, it’s easier for our skin to flush toxins and dead skin cells and balance natural oils.Nazarian adds that increasing dietary antioxidants like foods high in vitamin C can work to “counteract inflammatory triggers.” For the foreseeable future, I’ll be going to town on the kale, citrus, blueberry, broccoli, and strawberry recipes. It’ll be delicious, sure, but it might also be the ticket I need to evict the Big Bois up top.Lookin’ for the buzz without the booze?A Beginner’s Guide to Making Weed ButterYou don’t have to be a master chef or cannabis connoisseur to make legit weed butter.View StoryExplore Bon AppétitLifestyleCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-03", "author": ["Condé Nast", "Ali Francis"]}