{"id": "caec247b6e7f6376ce5056b0acc9f33e", "url": "https://www.bonappetit.com/story/romesco-pasta-salad-recipe", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "The Summer Pasta Salad Recipe All Other Pasta Salads Should Aspire To | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Summery Pasta Salad All Other Pasta Salads Should Aspire ToBuh-bye, mayo.By Sarah JampelAugust 15, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailOf all the summer pasta salads you’ve met before, this romesco pasta salad is bound to be the spiciest, the sauciest, and the reddest. See, a couple of weeks ago, my friends had the very festive and seasonally appropriate idea to have a potluck picnic at 7 p.m. on a Friday night. How lovely! I immediately thought of pasta salad, the best food to eat with your hands whilst your legs are criss-crossed on a scratchy blanket.Got my mind on pasta and pasta on my mind:The only problem was that I had to go straight from the office to the get-together, which meant that my contribution would have to live in a big plastic bag jammed in a tote bag all day long. And then it would have to transform itself into something we’d all want to eat—out of doors, in the 5000° F New York City weather—during my subway ride from work to the park.I knew that a traditional mayo-based pasta salad would definitely not be friend on a long, hot day. Instead, I looked to this new romesco version. If any of friends missed the mayo, I couldn't hear it over the sound of them eating handfuls (so we forgot forks, okay?) of this pasta and licking the bold, spicy pepper sauce off their fingers.Making the romesco—a creamy sauce from Catalonia that gets its texture from toasted walnuts, its heat from chile flakes, and its color and rich sweetness from roasted red peppers—is a little more involved than whisking together mayo, vinegar, and mustard...but not by that much (you can use store-bought roasted peppers, after all). And once you have it, you can use it as the bed for roast fish, the smear in a cheesy sandwich, or the dip for a pile of grilled vegetables.Your extra romesco can be a dip for meatballs—how convenient!\nNot only is this pasta salad fresher-tasting than a mayo- or vinaigrette-dressed version, but, with no dairy danger, I was less fearful that things would get weird, mushy, or altogether unappetizing as day turned to night. Plus, it holds up especially well because of the Double Dressing Technique: The warm, very al dente noodles soak up the first half of dressing completely, which means that the second half of the sauce, folded in at the end, remains glam and glossy. Think of the preliminary sauce coat like hydrophobic penguin feathers, repelling any excess absorption. Or just think of it like a rain coat (that’s simpler).If, after all of that convincing, you’re still worried about the sog factor—which will be mitigated with toasted walnuts and fried breadcrumbs—you can save the last sauce toss (and the addition of the basil, tomatoes, Parmesan, and crumbage) until you’re just about to eat. (If you’re taking the pasta salad on the road, this means one container for the pasta, one for the sauce, one for the tomatoes and basil, and one for the breadcrumbs and cheese.)But even if you don’t take precautionary measures, the worst that can happen is a tomato stain or two on your pants. And that’s a risk I’m willing to take.Get the recipe:Romesco Pasta Salad with Basil and ParmesanThis pasta salad holds up well at room temperature and has a flavorful, punchy romesco sauce.View RecipeRead Moretest-kitchen4 Weeknight Dinners You Can Throw Together After WorkBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-15", "author": ["Condé Nast", "Sarah Jampel"]}