{"id": "cb02a57fc22e7441975c768c6647d479", "url": "https://www.bonappetit.com/recipe/pesto-pasta-with-v8-healthy-greens", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "Pesto Pasta with V8® Healthy Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredPesto Pasta with V8® Healthy GreensYour New Go-To, Easy Weeknight Dinner! Sponsored by V8®.June 15, 20211.9(55)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintIngredients⅓cup raw pistachios3oz. parmesan, grated (about ¾ cup), plus more2garlic cloves, finely grated4cups basil leaves (about 2 bunches)2cups parsley leaves⅔cup Extra-virgin olive oil⅓cup of V8® Healthy Greens1tsp. Kosher salt12oz. Long pasta (such as spaghetti or bucatini)PreparationStep 1Put pistachios, cheese, and garlic in a blender and process until finely ground, about 1 minute. Add basil, parsley, and place the top back on.Step 2With the motor running, add oil in a slow and steady stream until pesto is mostly smooth, with just a few flecks of green, about 1 minute. Pour in the V8® Healthy Greens and season with salt.Step 3Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving ¼ cup pasta cooking liquid.Step 4Place pesto and 2 Tbsp. unsalted butter, cut into pieces, in a large bowl. Add pasta and half of pasta cooking liquid. Using tongs, toss vigorously, adding more pasta cooking liquid if needed, until pasta is glossy and well coated with sauce.Step 5Divide pasta among bowls and top with more Parmesan, if you desire.How would you rate Pesto Pasta with V8® Healthy Greens?Leave a ReviewTell us what you thinkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-15", "author": ["Condé Nast"]}