{"id": "cb1ad1f0a22b2f233bf4e55aa19082f0", "url": "https://www.bonappetit.com/recipe/torta-pasqualina", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Torta Pasqualina Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueTorta PasqualinaBy Ignacio MattosApril 17, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis double-crusted stunner of a savory tart is a traditional Italian Easter dish, but it makes for an impressive vegetarian main no matter what you're celebrating. Just don’t expect your first pasqualina to look perfect. But it will taste absolutely amazing if you remember three key steps: Don’t sweat the crust, squeeze every drop of liquid out of the greens, and save your chard stems! Make breakfast an occasion by serving it alongside a savory peach and shaved fennel salad, marinated beans with ricotta salata, and breakfast calzones.Ingredients8 servingsDough3½cups all-purpose flour2Tbsp. sugar1½tsp. kosher salt1½cups (3 sticks) unsalted butter, cut into pieces, chilled in freezerFilling and Assembly3½lb. Swiss chard (about 5 bunches), ribs and stems removed3Tbsp. extra-virgin olive oil2medium onions, finely chopped10large eggs1½cups whole-milk fresh ricotta, preferably box-drained, patted dry4oz. Parmesan, coarsely grated1large garlic clove, finely grated2tsp. finely grated lemon zest¼tsp. freshly grated nutmeg2tsp. kosher salt, plus more1½tsp. freshly ground black pepper, plus moreAll-purpose flour (for surface)2tsp. sugarSpecial EquipmentA 10\"-diameter tart pan with a removable bottomPreparationDoughStep 1Pulse flour, sugar, and salt in a food processor to combine. Add butter and process until largest pieces of butter are pea-size. Drizzle in ½ cup ice water and pulse until a few shaggy pieces of dough form.Step 2Transfer dough (get all the dry bits) to a work surface. Drizzle 1 Tbsp. ice water over; knead to just barely bring dough together. Divide in half. Place a half on a piece of plastic wrap. Using plastic and your hands, form dough into a ¾\"-thick disk and tightly wrap. Repeat with remaining dough. Chill at least 2 hours.Step 3Do Ahead: Dough can be made 5 days ahead. Keep chilled, or freeze up to 1 month.Filling and AssemblyStep 4Working in batches, cook Swiss chard in a large pot of boiling water until bright green and slightly softened, about 2 minutes. Using tongs, transfer to an ice bath to stop the cooking. Swish to cool, then remove greens and squeeze out as much excess liquid as possible. Transfer greens to a cutting board and finely chop (you should have about 4 cups).Step 5Heat oil in a large saucepan over medium. Cook onions, stirring occasionally, until very soft and golden but not browned, 8–10 minutes. Remove from heat and mix in greens. Let cool.Step 6Using a fork, whisk 4 eggs in a large bowl to blend. Add ricotta, Parmesan, and Swiss chard mixture and mix to combine. Add garlic, lemon zest, nutmeg, 2 tsp. salt, and 1½ tsp. pepper. Taste and adjust seasoning, if needed.Step 7Let dough sit at room temperature 5 minutes to soften. Roll out 1 disk of dough on a lightly floured surface to a 12\" round about ⅛\" thick. Transfer to a parchment-lined rimmed baking sheet. Roll out remaining disk of dough and carefully transfer to tart pan. Lift up edges and allow dough to slump down into pan. Press dough firmly into sides and bottom of pan. Trim, leaving about a ½\" overhang. Beat 1 egg in a small bowl to blend and brush edges of dough.Step 8Scrape filling into pan, creating a mound in the center. Using an offset spatula, evenly spread filling over bottom, smoothing surface.Photo by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiStep 9Use a spoon to create 5 divots in filling and crack an egg into each. Season eggs with a bit of salt. Arrange remaining round of dough over filling. Trim edges of top round, leaving ½\" overhang. Fold edge of bottom crust up and over top, then press edges together to seal.Photo by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiStep 10Crimp and brush top of dough with remaining beaten egg; sprinkle with sugar. Transfer pie to a foil-lined rimmed baking sheet and chill in freezer 10 minutes.Photo by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiStep 11Preheat oven to 375°. Bake pie until crust is deep golden brown, 65–75 minutes. Transfer pan to a wire rack and let pie cool in pan at least 30 minutes before serving.Step 12Do Ahead: Pie can be baked 1 day ahead. Let cool; cover and chill.How would you rate Torta Pasqualina?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI used a combination of spinach, kale and chard for this and a different pastry recipe. Fit in a deep 9\" pie pan. Made it to have a quick, delicious breakfast during the week. Definitely recommend. (I actually did 6 whole eggs so I could split the pie into easy portions)AnonymousMaryland7/30/2018I haven't made it yet, because (a) the recipe says crack five whole eggs into divots in the chard mixture, but (b) the pictures show 10 divots, each containing only a yolk. Which one is it? Keen to try the recipe, but not until this gets clarified for me!rpickard709931Canada7/14/2018Explore Bon AppétitSavory Pie & TartItalianEuropeanSwiss ChardLeafy GreensVegetableRicottaCheeseMainNut-FreeVegetarianEasterDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}