{"id": "cb1f91037907dce55c7ad935b71a0a9c", "url": "https://www.bonappetit.com/story/spring-soup", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "What’s Green and Wet and Full of Substitutions?! Soup! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat’s Green and Wet and Full of Substitutions?! Soup!Make minestrone, but make it spring.By Carla Lalli MusicMay 14, 2020FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I have learned two important life lessons while staying at home these past several weeks. One is that sometimes it snows in May and you’re not allowed to complain about it. The other is that the only recipes I’m making are ones that are still good, even if I have to change half the ingredients based on availability. These two learnings may seem totally unrelated, but trust me—they’re not. So for those still-chilly spring nights when you can’t always get exactly what you want, make soup, but make it green.The process for making this springtime minestrone is like any other: You start with a soffritto (a mixture of leeks, celery, and onions) that gets the flavor party going. This is the first opportunity to find substitutes. No leeks? Use more onion, or add scallions. No celery? Do you have fennel? Cilantro or Swiss chard stems? Sure—not the same, but not worth scrapping your plans on their account either. Then you add a mix of pantry things and fresh things: pre-made stock and canned beans, along with leafy greens and fresh peas. No stock? Use water or a bouillon cube. No beans? Use rice (and a couple extra cups of water to compensate). If you don’t have kale, use spinach, Escarole, Swiss chard (again), beet tops, or some cabbage leaves. (If you don’t have cabbage, you are not experiencing quarantine to the fullest. I would be nothing and nowhere without cabbage.) The recipe, blindly optimistic, calls for fresh peas, of which there are none to be had in this house. Frozen though, that’s the ticket! Last week I had green beans, and those could work. I have seen some snow peas around town. And if that fails, any quick-cooking vegetable can join for a dip, even if that’s some chopped-up broccoli florets.Want this letter before it hits the website? Sign up for our newsletter!Ted CavanaughThe soup doesn’t simmer for long, but long enough to toast some nuts and blitz a pesto. Andy Baraghani called for pistachios (they’re green, see what he did there?). But literally any nut is invited. You could also try using pumpkin seeds or sunflower seeds. His pesto uses both basil and parsley, but whenever there are a blend of tender herbs I think one or the other can party solo. Or introduce a different herb, like the one in your crisper drawer that you were trying to figure out how to use up. Was it cilantro? Mint? Tarragon? Use those!By the end of this process, you will have a light, brothy, vegetable-laden bowl of soup that you can shave some parm onto and serve with toasted (possibly stale!) bread on the side. When you dollop some aromatic pesto over the hot liquid, those herbs will bloom, and not only will you smell something delicious, you might just feel something, too. Will it be as restorative as a warm breeze on a sunny May day? I can’t promise that. But it’s not all bad. Somewhere, birds are chirping, and we’re here slurping. These aren’t ideal times, but at least this soup promises to be very flexible.Explore Bon AppétitCarla NewsletterSoupSpringRead MoreLifestyleGreen Minestrone Is Here to Justify Your Spring Farmers' Market SplurgeBy Aliza AbarbanelcultureI Have Feelings About Asparagus, and Yes, I Peel ItBy Adam RapoportLifestyleThis Recipe Wants You to Know That Meatballs Are Totally Appropriate for SpringBy Amanda ShapirocultureThe Springy Spring Salad I’m Making This WeekendBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-14", "author": ["Condé Nast", "Carla Lalli Music"]}