{"id": "cb2aef940e1a477dafaa24005affe6b2", "url": "https://www.bonappetit.com/recipe/garlicky-smashed-chickpeas-with-corn", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Garlicky Smashed Chickpeas With Corn Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueGarlicky Smashed Chickpeas With CornBy Abra BerensSeptember 14, 20214.0(29)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Frances BoswellEmailPinterestPrintEmailPinterestPrintThis recipe from chef Abra Berens’s new bean-and-grain-focused cookbook, Grist, employs a technique for lightly crushing, then crisping chickpeas that you can apply to infinite combinations of pulses (think lentils!) and vegetables. Starting with dry chickpeas you cook yourself will earn you a gold star, but using canned will massively cut down on cooking time.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCan Opener$14 At AmazonLarge Skillet$84 At AmazonChef's Knife$34.53 At AmazonIngredients4 Servings5Tbsp. plus ¼ cup extra-virgin olive oil, divided1small onion, finely chopped½poblano chile, thinly sliced3ears of corn, kernels removedKosher salt3cups cooked chickpeas or two 15-oz. cans, rinsed4garlic cloves, finely chopped4large eggsCoarsely chopped dill or cilantro (for serving)PreparationStep 1Heat 3 Tbsp. oil in a large skillet over medium. Cook onion and chile, stirring, until tender, 6–8 minutes. Add corn, season with salt, and cook until corn is tender, about 4 minutes. Transfer corn mixture to a medium bowl; wipe out skillet.Step 2Return skillet to medium heat and pour in ¼ cup oil. Add chickpeas and a big pinch of salt and smash with a spoon until evenly chunky. Cook, undisturbed, until chickpeas crisp a little on the edges, 7–9 minutes. Add garlic and cook, stirring occasionally, until garlic is softened but not browned, about 3 minutes.Step 3Divide chickpeas among bowls and top with corn mixture.Step 4Pour remaining 2 Tbsp. oil into skillet and increase heat to medium-high. Crack eggs into skillet and season with salt. Cook until whites are golden brown and crisp at the edges and set around the yolk (which should still be runny), about 2 minutes. Transfer an egg to each bowl with chickpea and corn mixture and top with dill.Reprinted from Grist: A Practical Guide to Cooking Grains, Beans, Seeds, and Legumes by Abra Berens with permission by Chronicle Books, 2021.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Garlicky Smashed Chickpeas With Corn?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThis is delicious. We made ours with cilantro and frozen corn. It was crispy, savory, and easy to make. It works as a quick dinner but would be yummy for brunch. I am looking forward to eating it again. Sari10/23/2021I gave the recipe 4 stars as it is, but with the changes I made and will make I’d give it 5 stars.\n(1) I replaced the poblano with a large deseeded jalapeño.\n(2) I cut the oil down by ~1 T. for each step.\n(3) I used my potato masher to smash more than 75% of the chickpeas.\n(4) Instead of fried eggs, I made a side salad of arugula with lemon, EVOO, and honey to which I added the chickpea/corn dish.\n(5) Next time I’ll fry up some bacon and use the bacon grease to crisp the chickpeas, then add the crumbled bacon on top at the end.Hollis RamseyFlorida10/15/2021This recipe immediately caught my eye while browsing the current edition of BA, and I stickied it as one to try soon. Ultimately, it  was pretty, hearty, and easy enough for a weeknight (I even made my own chickpeas from dried) but it wasn't craveable enough to make it into regular rotation.  AnonymousSeattle10/12/2021Just ok...it was great for a quick, easily vegan-friendly week night meal, but it didn't wow. I used a whole poblano and it maybe would've been better to add a jalapeño or serrano chile to amp up the heat a bit. SSAArlington, VA10/8/2021This was so good! I’m glad I went with my gut and made it, despite the 3.7 stars (I normally aim to make recipes with 4-5 stars). Savory and sweet, great use of my canned garbanzos. I think the onions here in Southern California must be bigger than in bon appetit land, because I only used half a medium sized (I guess) onion and it seemed like plenty. Anyway, it took some time to make, but was well worth it. Seems like a lot of oil and probably isn’t a low fat meal, but it was all used and didn’t turn out oily. I followed the recipe as written. Thank you!Nikki CAnaheim, CA10/6/2021Really good! I used frozen corn - 10 oz to sub the 3 ears. I baked it in the toaster oven at 400 degrees for 10 minutes with 1/2 tablespoon of oil, then followed the recipe pretty much to a T, only cutting the oil by half. Would make again.Anonymous10/6/2021This is really simple, but even with just salt as the seasoning it’s very flavorful and quick to put together. My chickpeas were a bit dry, so I could have used an extra drizzle of oil at the end, but I’ll definitely be making this again.AnnBoston, MA9/29/2021Explore Bon AppétitMainDinnerLunchVegetarianDairy-FreeNut-FreeHealthyishEasyQuickWeeknight MealsChickpeaBeanVegetableCornEggFryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Abra Berens"]}