{"id": "cb2e3cbd13f7bc0a1aca8031177bf8a7", "url": "https://www.bonappetit.com/recipe/vegan-banana-oat-pancakes", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "Vegan Banana-Oat Pancakes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegan Banana-Oat PancakesBy Sarah JampelJanuary 14, 20224.1(45)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susan Ottaviano EmailPinterestPrintEmailPinterestPrintLike banana bread in pancake form, these pancakes have crisp edges and tender centers with big banana flavor, plus the wholesome chew of raw oats. They’re vegan, dairy-free, refined-sugar-free, and gluten-free (as long as you use gluten-free certified oats), and they come together in a food processor, which means minimal cleanup and no risk of overmixing. And while you don’t have to add the chocolate chips, a bit of their sweet richness goes a long way. We think singer Jack Johnson would be proud.If you don’t have a food processor, you can use 1 heaping cup (100 g) oat flour instead of the 1 cup (100 g) old-fashioned oats—mash the banana well before stirring all of the ingredients together (including the ¼ cup old-fashioned oats).This recipe is easily doubled to serve four. —Sarah JampelAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonLarge Nonstick Skillet$50 At AmazonOxo Stainless Steel Measuring Cups$21 At AmazonOxo Stainless Steel Measuring Spoons$11 At AmazonIngredients2 servings1¼cups (129 g) old-fashioned oats, divided2ripe bananas, divided½cup plus 2 Tbsp. dairy-free milk (such as Oatly)1½tsp. baking powder½tsp. ground cinnamon¼tsp. kosher salt½tsp. vanilla extract3Tbsp. extra-virgin olive oil, plus more for pan¼cup dark chocolate chips (dairy-free if desired; optional)Yogurt or dairy-free yogurt (optional) and pure maple syrup (for serving)PreparationStep 1Grind 1 cup (100 g) oats in a food processor until finely ground but with some texture remaining (think coarse sawdust), about 1 minute.Step 2Peel 1 banana and tear into large pieces. Add to ground oats along with dairy-free milk, baking powder, cinnamon, salt, vanilla, and 3 Tbsp. oil. Process, stopping to scrape down sides as needed, until well combined. Remove bowl from base and stir chocolate chips (if using) and remaining ¼ cup (29 g) oats into batter. Let sit 15 minutes; it should be slightly thickened.Step 3Meanwhile, thinly slice remaining banana and set aside.Step 4Heat 1 tsp. oil in a 10\" or 12\" nonstick skillet over medium-high, swirling to coat bottom of pan. Working in batches of 2 or 3, depending on the size of your pan and the confidence you have in flipping, scoop in about ¼ cup batter per pancake and flatten slightly with a spatula. Arrange a few reserved banana slices on top, then reduce heat to medium, and cook until set and golden brown underneath, 2–3 minutes. Flip pancakes over and cook on other side until golden brown, 1–2 minutes. Transfer to a large plate. Repeat with remaining batter, adding more oil to pan between batches as needed.Step 5Serve pancakes topped with yogurt (if using) and maple syrup.How would you rate Vegan Banana-Oat Pancakes?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleMichael--the yogurt as topping is what's optional :) :) :) also why does it matter, if you're vegan, make it veganAnonymousBoston MA2/28/2022I used only 1 tbsp of coconut oil in the batter and replaced the other 2 tbsps with applesauce. I did not add the 1/4 cup raw oats and extra banana to the batter because I like my pancakes smooth. I also added 1/2 tsp of cardamom. It turned out perfect.Anonymous1/29/2022How is dairy-free alternatives 'optional' if this is a Vegan recipe? Adding anything not vegan kinda defeats the point of the title of this recipe. Soya yogurt and dairy free chocolate is easy to find and cheap nowadays!\nOtherwise was very tasty, works well with shredded oats too, would recommend slow and stead heat for best results especially not to burn the chocolate! Keep up the vegan recipes please!Michael Boston, MA1/29/2022Trying to eat a more plant-based diet but I love a hearty weekend breakfast. These were great! Absolutely hit the spot. Did not add chocolate chips — they were sweet enough for me as-is and the texture was very good. Topped with a bit of PB for extra protein. Yum!AnonymousDriggs, Idaho1/23/2022@SCOTT S Yes, I would recommend 100 grams of oat flour. You might have to add a little more to get the right consistency, but that's a good place to start!Sarah Jampel1/19/2022I made these for my 2 daughters as they are pancake lovers and they liked them. I also tried them as well and are tasty. Very customizable as well. I'll definitely make again.GessBaytown, TX1/18/2022These turned out pretty well, but I used 2 tbsp oil instead of 3 and it was still quite oily. I might even use 1 tbsp next time. Anonymous1/18/2022Mediocre recipe. If you use a 1/4 cup scoop per pancake, it will not make 8 pancakes. They stick to the spatula when you try to flatten them and if the pan is very hot, the chocolate chips burn easily. Overall, the pancakes are too thick and take a long time to cook inside resulting in a much darker outside than the one shown in the image . The texture is also nothing to write home about. All in all, nothing exciting.Tatti KIrvine, CA1/18/2022Great recipe!  If you are using oat flour (rather than using oats that you grind yourself), how much would you recommend we use?  Still 100 grams worth?Scott SLos Angeles, CA1/18/2022My first batch stuck horribly to the pan. Maybe it was the very ripe banana? I baked the rest of the batter in a baking dish in the oven. The flavor is great and I will try again.BethGrand Rapids, Michigan 1/17/2022These are great for brunch. Easy to prep but I think you lose a lot even when scraping the blender because it's not super runny. Probably will transfer mixed oats and mix with hand mixer of I make it again. Super easy to customise too.Camille K.France1/16/2022Made these this morning! So quick and easy - and they actually taste delicious. Highly recommend if you’re in the mood for pancakes, gluten free eater or not!MeighanNew York1/15/2022Explore Bon AppétitBreakfastEasyQuickVeganVegetarianDairy-FreeGluten-FreeNut-FreePancakeBananaFruitOatRice & GrainsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-14", "author": ["Condé Nast", "Sarah Jampel"]}