{"id": "cb3b837499eb86bbd336bd3a8b4b0c7a", "url": "https://www.bonappetit.com/story/chicago-restaurant-week-2018", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "Chicago Restaurant Week 2018 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredChicago Restaurant Week 2018Get ready to eat incredible food during Chicago Restaurant WeekBy Choose Chicago January 1, 2018FacebookTwitterEmailEugene (Huge) GaldonesFacebookTwitterEmailYou are probably well aware that we dig the Chicago restaurant scene—we did name Chicago our 2017 Restaurant City of the Year, after all. The Windy City has plenty to offer locals and visitors alike with a bustling array of restaurants that run the gamut of styles, sizes, and types of cuisines. Just when you thought that all the holiday season fun was done and dusted, Chicago’s Restaurant Week returns for its 11th year (January 26–February 8), with special prix fixe pricing and menus from a multitude of spots in town. Here are a few of our faves to add to your hit list.Nico OsteriaNew rock star chef Bill Montagne and his rustic-Italian-inspired menu at Nico Osteria will be offering both a lunch and dinner prix fixe during Restaurant Week. This always-crowded corner space features a long, open kitchen and you’ll love trying a variety of house-made pasta, exceptionally fresh fish, and hearty, meaty mains. See if you can grab one of their sleek banquettes next to the floor-to-ceiling windows for a magical dining experience.avecBasically, if you are in Chicago and are not dining at avec, you’re doing something wrong. Stop for lunch ($22 per person) or dinner ($44 per person) to try a selection of signature Mediterranean-inspired dishes from Chef Perry Hendrix. The space is jam-packed, but fear not! The team at avec has it running like clockwork with an open kitchen, communal tables, and shared plates like whole-roasted fish, bacon-wrapped dates (yes, please), and other dishes accented by a slew of Middle Eastern spices like sumac, za’atar, urfa, and the like.BlackbirdThis critically acclaimed restaurant has been a staple in town, whipping up elegant and imaginative Midwestern cuisine with a strong focus on farm-fresh ingredients. Blackbird’s Chef de Cuisine Ryan Pfeiffer prepares dishes like strip loin with chestnut mole, cabbage, and truffle oil, also crispy Brussels sprouts accented with apple cider, Fresno chile, orange, and Parmesan. For Restaurant Week, they’ll be offering a prix fixe lunch for $22 per person. Don’t miss it.Travelle Kitchen + Barmichael weberInside the luxurious Langham hotel in the heart of downtown Chicago, you’ll find Travelle Kitchen + Bar with Chef Ricardo Jarquin’s playful spin on seasonal American cuisine and a special Restaurant Week prix fixe for both lunch and dinner. The menu is filled with fresh ingredients—think smoked burrata with gooseberries, squash, radicchio jam, and almonds, large-format dishes like seared fish, and grilled and roasted meats—which utilize the chef’s connection with some of the nation’s finest farms, ranches, and orchards.Monteverde Restaurant & PastificioEugene (Huge) GaldonesConsider a visit to this stunning spot by James Beard Award–winning chef Sarah Grueneberg for dinner and a show. Diners here get to watch the cooks in action at the pastificio, where they shape tender doughs into pasta magic like gnocchetti and tortelli. Grueneberg’s menu at Monteverde focuses on Italian with a few Texan and global influences woven through. They’ll be offering a three-course menu featuring some of their hit dishes and a choice of piattini (small plates), along with pasta, and dessert.Smyth and The LoyalistEugene (Huge) GaldonesWhen your establishment boasts two Michelin stars upstairs at Smyth, and a cult-fave burger downstairs at The Loyalist, you know you’re doing something right! The fine (yet not stiflingly formal) dining upstairs from Chefs John Shields and Karen Urie Shields features five-, eight-, and 12-course menus that showcase impeccable ingredients sourced from the farm they collaborate with to grow custom ingredients. During Restaurant Week, it’s The Loyalist you’ll want to check out—and yes, the mouthwatering burger will be an option on their $33 dinner prix fixe menu.Explore Bon AppétitRestaurants + TravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-01", "author": ["Condé Nast", "Choose Chicago"]}