{"id": "cb4d20801dcf9eeb9b15c3a65f9cfd86", "url": "https://www.bonappetit.com/recipe/chocolate-budino-with-candied-walnuts", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Chocolate Budino with Walnuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueChocolate Budino with Candied WalnutsBy Che Fico, San Francisco, CAAugust 14, 20184.3(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis deliciously wobbly, very special pudding isn’t thickened with cornstarch or gelatin. Instead, it’s made with chocolate, milk, cream, and eggs and spiked with olive oil and salt, which complement the bittersweet and fruity flavors of the chocolate. To die for! This recipe is from Che Fico in San Francisco, CA, our No. 7 Best New Restaurant 2018.IngredientsMakes 6Candied Walnuts½cup sugar1cup coarsely chopped walnutsKosher saltBudino and Assembly1cup bittersweet chocolate wafers (disks, pistoles, fèves; preferably 70%–74% cacao) or 5 oz. chocolate, finely chopped1cup heavy cream1cup whole milk6large egg yolks¼cup sugar¾tsp. kosher salt1Tbsp. extra-virgin olive oil (preferably Olio Verde), plus more for servingFlaky sea saltFreshly ground black pepperSalted caramel gelato or ice cream (for serving; optional)PreparationCandied WalnutsStep 1Bring sugar and ½ cup water to a boil in a small saucepan over medium-high heat, swirling occasionally to dissolve sugar. As soon as the sugar is dissolved, add walnuts and bring syrup back up to a simmer. Cook, swirling saucepan occasionally for even cooking, until walnuts look slightly translucent and are softened, 30–35 minutes.Step 2Drain walnuts in a mesh sieve and arrange in a single layer on a rimmed baking sheet lined with a silicone baking mat or parchment paper. Sprinkle walnuts with salt.Step 3Place a rack in upper third of oven and preheat to 300°. Bake walnuts in oven, stirring once or twice, until well browned, 15–18 minutes. Let cool, then break up into small pieces.Step 4Do Ahead: Walnuts can be candied 1 week ahead. Store airtight at room temperature.Budino and AssemblyStep 5Place chocolate in a medium bowl; set aside. Bring cream and milk to a bare simmer in a large saucepan and remove from heat.Step 6Vigorously whisk egg yolks and sugar in another medium bowl until pale yellow and sugar is dissolved (rub between fingers to check), about 2 minutes.Step 7Gradually pour cream mixture into egg yolk mixture, whisking vigorously. Immediately pour egg yolk mixture into saucepan and cook over medium heat, stirring constantly with a heatproof rubber spatula and making sure to get into the corners of the pan, until an instant-read thermometer registers 175° (custard should be thick enough to coat a spoon; do not let it simmer or allow thermometer to go above 180°).Step 8Pour custard over reserved chocolate and let sit until chocolate is melted, about 5 minutes. Using an immersion blender or a whisk, blend until emulsified (if using a whisk, you may want to strain budino through a fine-mesh sieve after to ensure a silky texture). Add kosher salt and 1 Tbsp. oil to chocolate mixture and blend to incorporate.Step 9Divide budino evenly among six 8–12-oz. glasses. Cover with plastic wrap and chill until firm, at least 1 hour.Step 10Top each budino with candied walnuts, sprinkle with sea salt and pepper, and drizzle with a little oil. Serve with scoops of gelato if desired.Step 11Do Ahead: Budinos (without toppings) can be made 3 days ahead. Keep chilled.How would you rate Chocolate Budino with Candied Walnuts?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI'm not entirely sure the amount of hand whisking I put into this little dessert was worth the effort. It's great that it's a good gluten-free option and the candied walnuts on top are delightful, but I ended up with a small amount in 6 small stemless wine glasses and it tasted like basic chocolate pudding. Lots of stars because it was simple and straightforward to make. WouldEatThatWashington, DC7/16/2021Excellent; simple to make and a nice do ahead dessert foe a gathering. AmyIowa4/25/2021Fantastic! Not difficult, followed directions as written except subbed Splenda for sugar. Will be making this many more times in the future. The creamy texture is fantastic. TacyVLittle Rock AR2/15/2021This was delicious! The budino came together well. When I make it next, I’ll probably go with a darker chocolate/less sugar and also halve the kosher salt in the recipe. The pudding had a bit of a salty taste even without the salt topping.AnonymousNew York, NY1/2/2021I absolutely loved the flavor on this but I couldn't get it to set. It was a little soupy. Not sure what I did wrong. I would definitely try it again because I love the idea of it and the flavors were incredible. AnonymousMaine2/15/2019Dang, this was incredible. I made this for a gathering, with substitutions to make it dairy free (coconut milk for heavy cream, vanilla unsweetened almond milk for the milk). It was a huge hit with all my guests and it's made my list of all-time favorite recipes. Given the time effort of the base recipe, it's worth increasing the recipe by 50-200% to serve more people. Small jelly jars are a great way to serve the budino.AnonymousOakland, CA10/13/2018Wow! What a day. Haha. Hope everyone is doing well. Not a huge walnut/chocolate fan but this ended up coming together. Thanks again! We're excited to see what's next.  GreatJobFriendsSouth Frederick9/16/2018Explore Bon AppétitPuddingDessertItalianEuropeanChocolateOther IngredientsGluten-FreeSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Che Fico", "San Francisco"]}