{"id": "cb64d7bf76205c154cb45808b8cdd480", "url": "https://www.bonappetit.com/story/french-75", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "The French 75 Cocktail is the Perfect Fancy-Yet-Easy Drink For New Year's Eve  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA French 75 Will Make New Year's Feel Fancy, Even If You're Wearing Pajamas Bring on the bubbly. By Al CullitonDecember 26, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically’s resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.What better for New Year’s Eve than a cocktail that evokes maximalist luxury? That’s right, it’s time for a very opulent drink with the fanciest, Frenchiest stuff out there: Cognac and Champagne. But the French 75 isn't intimidating, despite its high-rolling components. The only other ingredients you need to make it are lemons and sugar, making this a very easy cocktail, not to mention a perfectly balanced one. Cognac provides a grounding weight, lemon brightens things up, sugar counteracts the acid, and the Champagne lifts the whole thing up with effervescence and a subtle yeasty note.But before you learn to make one, why not learn a little about the origin of this cocktail and the great Gallic products that it consists of so that you can impress your guests with a bit of commentary?Très élégant, non? \nPhoto by Laura MurrayThe drink itself came into being in the early twentieth century at Harry’s New York Bar in Paris, which was also known as \"sank-roo-doe-noo.\" (This was a way for dim expat Americans to tell cabs drivers where they wanted to go: “5 Rue Daunou.”) Through the years, a version made with gin became more popular. But today, we’ll stick with the original, which lives on most famously in New Orleans. There’s a whole bar called Arnaud’s French 75 Bar, where they churn out these delightful drinks by the hundreds. It’s a terribly classy and wonderful place, where the bartenders wear elegant outfits, and you should visit if you haven’t been.But let’s backtrack for just one second and clarify what we’re dealing with here. Cognac is something you might have heard people talking about but couldn’t quite define. It’s is a type of grape brandy made in a small region on the western coast of France, and it has to be made in that little area for it to be called Cognac. That’s what we call a \"protected appellation.\" If you’re also wondering what grape brandy is (....good question), it’s a spirit that’s distilled from wine. Distillation does many things, but for our purposes, let's just say that it concentrates the liquid, reducing water content.Champagne might be a little less befuddling to you, but I’ll explain it just in case. It's a sparkling wine, made from just a handful of grape varietals, wherein the wine is bottled with added yeast and sugar, after which a second fermentation occurs in the bottle. The bottles are let to sit, then they’re moved about (or “riddled”), and finally they are disgorged to remove the dead yeast. There’s more to it, but essentially it's a natural carbonation method. As with Cognac, this wine is made under the protected appellation of Champagne.Okay, back to the matter at hand, which is your NYE plan. It’s a very short shopping list! This way you’ll have lots of time to make some onion dip or pigs in a blanket.Your Shopping ListCognac, like Pierre FerrandChampagne, or really good brut (i.e. very dry) sparkling wineSugar8 lemonsPhoto by Laura MurrayYour PrepLet’s start as we often do, by making a simple syrup. Add 1 cup boiling water to 1 cup sugar and stir vigorously until sugar is completely dissolved. While you’re letting that cool, juice 6 of your lemons. (Reserve 2 for garnish!) Strain juice through a fine strainer to remove pulp and any seeds that may have snuck in.How to Make ItNow, some people love this drink in a Champagne flute with no ice, but me and my pals at Fort Defiance did a big tasting session where we tried this cocktail every which way, and we disagree: A regular-size wine glass and cracked ice are the way to go. To crack the ice, use a wooden muddler or a mallet to break up bigger cubes into pleasingly craggy pieces without pulverizing them. Add cracked ice to the wine glass.Pour 1 ounce Cognac, ½ ounce lemon juice, and ½ ounce simple syrup into your shaker. Add plenty of ice and seal. Shake hard for about 15 seconds. Strain into your prepared wine glass. Then top with about 3 oz. Champagne. Finally, do the lemon peel thing we’re always talking about: Take off a wide piece of lemon peel using a Y-peeler. Using your thumb and fore- and middle-fingers on both hands, pinch the peel, yellow side down, to express the oils onto the surface of the drink. Rub the now-oily, yellow side of the peel all the way around the rim of the wine glass. Place peel in the cocktail. Serve.Now you’ve got a drink that’s so perfect for NYE that it will make all other drinks seem a little out of place. Legend has it that if you drink something extremely swanky at the stroke of midnight, you’re sure to have your fanciest year yet.Al Culliton is a writer, bartender and consultant living in western Massachusetts. She is an alum of the beloved Red Hook bar and restaurant Fort Defiance and owns her own cocktail company, Al’s Bar. Al enjoys poring over menus and cocktail books from bygone eras, touring the New English countryside, and cooking for her partner at home.Explore Bon AppétitHappy Hour with AlChampagneCognac/ArmagnacCocktailNew Years EveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Al Culliton"]}