{"id": "cb675b48a6e744beded72118347f60d1", "url": "https://www.bonappetit.com/city-guides/washington-dc/venue/maydan", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Maydan Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginwashington dcMaydanCome for the showstopping hearth, stay for all the expertly grilled dishesFacebookPinterestTwitterEmailMichael GraydonGO: for the craziest hearth you’ll ever lay eyes on—and all the masterful North African and Middle Eastern dishes coming out of it from chefs Gerald Addison and Chris Morgan. It's a 2018 Hot 10 winner for a reason.ORDER THE: things that make your mouth water as you browse the menu—the somehow simultaneously melty and charred lamb shoulder, lemony cabbage salad with flecks of mint, seared halloumi with peanut dukkah, all the spreads (we love m’tababal, a swiss chard and tahini dip, in particular). The signature perfectly puffy flatbreads come with your meal—you'll eat a lot of them.THE VIBE IS: lit (sorry). Obviously, the custom-built hearth is the centerpiece of owner Rose Previte’s restaurant, but you’ll want to hang out a bit further afield, either upstairs in the more intimate space or at one of the ornately adorned tables, to still get in on the action. Bonus: The Obamas have been spotted here...PRACTICAL STUFF: Open every day: Monday to Friday, 5 p.m. to 2 a.m., and Saturday and Sunday, 5 p.m. to 3 a.m.Michael Graydon and Nikole HerriottWE ALSO LOVEThe LineThe kind of place you might hang out at, even if you aren’t staying thereBad SaintBold Filipino cooking that tastes best with beer and loud musicLittle SerowThe wait is worth it for Johnny Monis’s sweet, sweet heatExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-11-12", "author": ["Elyse Inamine"]}