{"id": "cb6758acc6c9a7b28089e56d4d3e692b", "url": "https://www.bonappetit.com/story/best-philly-cheesesteak", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "I Ate at 16 of the Best Philly Cheesesteak Spots in 12 Hours | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcity-guidesI Ate at 16 of the Best Philly Cheesesteak Spots in 12 HoursI picked a winner, and yes, I felt terrible.By Alex DelanyJanuary 3, 2018FacebookTwitterEmailPhoto by Vincent CrossFacebookTwitterEmailI had major hesitations about doing this. Not because eating steak and cheese sandwiches for 12 straight hours would probably shave a few months off my lifespan. Not because I didn’t believe in my stamina or my qualification. I was worried because you don’t just walk into Philly, make a declarative statement, and expect it to go over smoothly.This is the city where passion is found between every crack in the sidewalk. Where no issue is a small issue, where yelling is recreation. Philly is the city where that hitchhiking robot, which counted on the collective humanity of strangers to reach destination after destination, was beheaded a few years ago. And I love it.This is pretty much what I looked like all day.\nPhoto by Vincent CrossI was born in Philly, and I’ve eaten more cheesesteaks than I can count. At Eagles tailgates. After concerts at the Troc. On Saturday nights and Wednesday mornings. On friends’ couches in Fishtown and on my grandmom’s stoop in South Philly. The conversation that accompanies the sandwich always ends along the same lines. “This is the best cheesesteak.” “What the hell are you talking about? Absolutely not.” “Fine, then what’s your favorite?”I’ve had that argument many times, and I’ve changed my answer many times. But it hit the point where I needed an actual answer. So we packed our bags to spend 12 straight hours in search of a champion.The Original Philly cheesesteak at Pat's.\nPhoto by Vincent CrossWhat was I looking for? It starts with the steak. The Philly cheesesteak is made with sliced ribeye, and it can be prepared in three distinct ways. The steak can be chopped finely, pulled or chopped into loosely-separated ribbons, or left in fully-intact large pieces. For me, the best cheesesteaks have ribbons of steak. The fine chop generally gets too dry, and the full-sized slices don’t let the cheese permeate every nook and cranny of the sandwich. Ribbons preserve the juices, allow for slight crisping, and let the Cheese Whiz and onions hang out in one beautiful mess.That’s right, Cheese Whiz and onions. Those who prescribe to a certain mentality would order that by saying “Whiz wit,” but honestly, it doesn’t matter what combination of words you use to relay the message. I will always order fried onions (not breaded, but flash-fried on the griddle) on my steak. Sure, white American cheese is tasty. Provolone is acceptable. But Whiz is seldom seen outside of Philly, making it impossible to pass up. That was my cheese of choice for this noble pursuit.And that all lives in an Italian roll. Whether your allegiance lies with Liscio’s, Aversa’s, Carangi, or Amoroso’s, a good cheesesteak roll will be slightly crackly (more like a plastic grocery bag than a baguette) on the outside and pillow-y soft on the inside. Everything has to work together to create the perfect sandwich. The ratios, the integration, the attitude. There has to be textural variety, saltiness, sweetness, and fat throughout. The first, sixth, and thirteenth bites should all be equally enjoyable.My favorite of the day at Tony Luke's\nPhoto by Vincent CrossSouth Philly's Tony Luke’s served the best cheesesteak I had all day. Every single bite was full of steak, cheese, and onions. The seasoning was strong and the steak was treated right, seared quick on the hot griddle. The grease was there, but not overwhelming, combining with the Whiz and slyly dripping out of the roll from time to time. The roll was slightly crackly on the outside and soft on the inside, soaking up grease and cheese. And the steak, onions, and cheese became one. It was everything that a cheesesteak should be, with zero pretension or prejudice.Yes, Tony Luke’s has multiple locations. You can get one at a Phillies game or over the bridge in South Jersey. It’s a chain. But who said that all chains are bad? Sometimes the Goliaths are Goliaths for a reason. The steak I ate under an overpass on Oregon Avenue was the best of the day. Nothing like the congealed, soggy, mistreated monstrosities I’ve encountered in Philly’s less frequented establishments. Not even close.The crew at John's Roast Pork\nAlex LauI was also impressed with a long-time favorite (and home of the best roast pork sandwich in Philly) John’s Roast Pork, which doesn't serve Whiz, opting for American. And new kids on the block Woodrow’s Sandwich Shop are making incredible house-made Whiz. Wiz Kid served a vegan cheesesteak that I enjoyed way more than I thought I would, and Jim’s Steaks brought me right back to middle school, post-concert, at the TLA. But this is my ranking:1. Tony Luke’s2. John’s Roast Pork3. Woodrow’s Sandwich ShopHonorable Mention: Jim’s SteaksOther cheesesteak joints that didn't make the cut (in no particular order): Philips, Ralph and Ricky’s, Pat’s, Geno’s, Shank’s Original, Campo’s, Sonny’s Famous Steaks, Wiz Kid, Gooey Looie’s, Chubby’s, Dalessandro’s, and Lorenzo’s.And by this point, you’re probably pissed off. I said something you don’t agree with or snubbed your favorite spot. I knew the risks. Serve me your opinions. Hit me with my missteps. Yell at me. Tell me to never come back. That’s fine. I consumed enough yellow, processed cheese to kill a cow. I can handle it.Explore Bon AppétitSouth PhiladelphiaPhiladelphiaCheeseSteakCity GuidesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-03", "author": ["Condé Nast", "Alex Delany"]}