{"id": "cb676e9dc1e4b1a94da3740a62d7e0ff", "url": "https://www.bonappetit.com/story/mona-talbott-and-kate-arding-hudson-new-york", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "Mona Talbott and Kate Arding's Guide to Hudson, New York | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eatMona Talbott and Kate Arding’s Guide to Hudson, New YorkA whirlwind tour of farms, antique shops, and tropically inspired meals with local shop ownersBy Mona Talbott and Kate Arding, as told to Samantha GarbariniJuly 14, 2021FacebookTwitterEmailPhoto by Hilary CadiganFacebookTwitterEmailThe gravitational pull toward uprooting yourself and moving to upstate New York is strong. And it’s all the more so after getting a taste of what life is like for Mona Talbott and Kate Arding, the owners of Talbott & Arding Cheese and Provisions in Hudson. They share about their weekly farmers market runs, their go-to housewares shops, their perfect hikes with cool contemporary art installations to boot, plus all the restaurants they love for each meal of the day. Resist booking the one-way ticket...Check out more food-focused itineraries from our favorite food people here.The lunch spread at Kitty'sPhoto By Alex LauLil' Deb's Oasis is pure vibes.Photo by Emma FishmanHudson, New YorkIf we’re going to hang out in Hudson with friends from out of town, we’d meet them at the train with some breakfast sandwiches from Kitty’s to start the day.Then, we’d take them to the Hudson Farmers Market (only open on Saturdays!) to meet some of our shop vendors, like Sparrowbush Farm. We love the bakery and farm’s super fresh breads, especially the rye, made with organic grains it grows and mills.Then we’d walk down Warren Street and check out a few cool stores. Batterby House, a charming kitchen and housewares shop, just expanded, and one of our friends is selling her small-batch Three Dancing Bears Jam there (get the peach preserves). It’s right next door to Red Chair on Warren, our other favorite store in town, which is stocked with absolutely beautiful French antiques.At this point, it’s time for coffee, so we’d stop in at Supernatural Coffee—it’s a real locals’ hangout and we always order the cappuccino, served in local Lail Design mugs.For a late lunch, there’s a relatively new restaurant in town called Cafe Mutton. Chef Shaina Loew-Banayan serves unpretentious, very delicious food—house-made country pâté sandwiches, seasonally changing rice porridge, scrapple made with local cornmeal and Kinderhook Farm pork—that we really crave.Then we’d get in the car and take our friends to Olana for the most incredible view of the Hudson Valley. It’s a national historic site and has these cool modern art installations.Afterward, we’d head to MX Morningstar Farm, where the owner Max Morningstar sells local breads, cookies, flour, honey, meats, and all his own produce. We think it’s the greatest thing ever.For dinner, Lil’ Deb’s Oasis! We love chefs Carla Perez-Gallardo and Hannah Black’s tropical comfort food. Their cooking is so different from the kind of food we cook, and it’s always fun.WHERE TO STAY:Rivertown Lodge, which is an IG influencer’s dream and has the most welcoming staffWHAT TO BRING BACK: A four-pack from Suarez Family Brewery, plus its family-friendly merchExplore Bon AppétitRestaurantsTravelNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-14", "author": ["Condé Nast", "Mona Talbott", "Kate Arding", "As Told To Samantha Garbarini"]}