{"id": "cb786014f4983765512685df0893f3bb", "url": "https://www.bonappetit.com/story/4-easy-winter-recipes-for-your-next-dinner-party", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "4 Easy Winter Recipes for Your Next Dinner Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored4 Easy Winter Recipes for Your Next Dinner PartyOn frigid winter nights, it’s all too easy to order takeout and hide under the covers until the first signs of spring thaw out our social lives. But a cozy, winter dinner party is the perfect opportunity to try your hand at wholesome, savory dishes (bringing friends and family to you). From a simmering tomato-curry chicken to a butternut squash bake, these four easy-to-make meals feature Campbell’s® soups and Swanson® stocks as a flavorful base and are packed with hearty vegetables, so you’re feeding your guests nothing but the good stuff.By Campbell'sFebruary 19, 2019FacebookTwitterEmailFacebookTwitterEmailChorizo & Chickpea Braised Chicken ThighsTransport your guests to Spain with this flavor-packed stewed chicken recipe. Using Swanson Chicken Stock as your base, make a tomato and paprika bouillon in which the chicken will simmer. The addition of fresh red bell peppers and briny olives add texture, while bringing out more flavor as the dish sizzles. Serve over rice or couscous with a bold red wine.Butternut Squash and Kale Breakfast Bake-StrataWhether you’re getting people together for brunch or love breakfast for dinner like we do, this creamy veggie bake is nourishing any time of the day. Simply make a strata using eggs, Campbell's Condensed Cream of Mushroom Soup, roasted butternut squash, and kale. The addition of leeks, instead of onions, makes for a milder, slightly sweeter finish. Bake in a 9 x 13 baking dish and set out for your friends to feast.Creamy White Chicken Pizza with Squash, Sausage, and SageWhen you’re craving pizza but need a little nutrition, too, this savory ‘za has the best of both worlds: vitamin- and potassium-rich squash and a creamy, cheesy finish. Roast the squash and brown the sausage, then top a store-bought pizza crust (opt for whole grain if you like) with Campbell's Condensed Cream of Chicken Soup, squash, sausage, sage, thinly sliced red onion, and mozzarella cheese. Bake until bubbly, top with red pepper flakes, and your dinner party is officially started.Tomato-Curry ChickenThis cozy, Indian-inspired hybrid is a cross between two traditional favorites: chicken tikka masala and chicken makhani, otherwise known as the saucy and delicious Indian butter chicken. Create your curry base with Campbell's Condensed Chicken Soup and spices, add chicken, and let simmer to deepen the flavor coming from the fresh ginger and herbs. Dish out over rice to sop up the juices and top with colorful crunchy herbs and veggies like cilantro, sliced chilies, and red onion.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-19", "author": ["Condé Nast"]}