{"id": "cb7c737bcca2736ee2e62f8fb831567e", "url": "https://www.bonappetit.com/story/never-fail-rhubarb-almond-cake", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "This Rhubarb-Almond Cake Is the Only Reason I'm Turning on My Oven This Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Rhubarb-Almond Cake Is the Only Reason I'm Turning on My Oven This SummerI'll gladly turn my apartment into a sauna for this recipe.By Emma WartzmanJuly 27, 2018FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Let me the set the scene. It was a couple of weeks ago, a blazing 90 degrees outside, and even hotter on the top floor of my building, which is where my apartment happens to be. And I decided to turn my oven on.Why, in god’s name, would you do such a thing?, you might be thinking. Lucky for you, I have a very good answer: this Rhubarb-Almond Cake.See, I had found the most beautiful rhubarb stalks at the farmers' market the week before and, as any good impulse-shopper would, I bought them with no set idea of what I would do with them. By the time I found the motivation to use them, the stalks were teetering on the edge of going bad, and so I pulled out this old recipe by then BA food editor, now BA contributor, Alison Roman. (Yeah, that Alison Roman, the one with The Cookies.)I had made this cake a few years before to bring to a dinner party, but didn’t end up getting to eat much of it because my friends devoured it pretty much immediately—a good sign if I've ever seen one. (Bonus: I had everything I needed to make the thing in my pantry.)So I warned my roommate to go into her room, turn on her AC, and close the door—I swear I’m a very good roommate!!!—and then I got to work.Just look at that color.\nThe cake batter came together quickly. First I prepped my rhubarb, chopping most of it up into bite-sized pieces and reserving some whole stalks to decorate the top. Then I mixed together all my dry ingredients. The recipe calls for blanched almonds that are ground up in a food processor, but I used already-ground almond flour, which you can find pretty much everywhere (and makes for fewer dishes).Then I beat together butter, sugar, and the seeds from one vanilla bean in my food processor until it was super light and fluffy. (I haven't tried it, but I imagine you can do this with a handheld beater as well.) In went a couple of eggs, the dry ingredients, and finally the sour cream (which, for the record, can also be swapped with full-fat yogurt), until it all came together to form a thick, gloppy batter, the kind that makes you want to eat it all raw with your hands (just me?).I then folded in the chopped rhubarb, spooned the batter into a buttered and sugared tart pan, placed the reserved rhubarb on top, sprinkled some extra sugar over it for good measure, and popped it into the oven. What emerged a little more than an hour later was so beautiful that suddenly all the sweating I had done that afternoon felt completely worth it—golden brown and crackly, with those dramatic ruby stalks sinking in just so, I nearly gasped with pleasure.That cake lived on my counter for a couple days as I slowly chipped away at it. I shared a few pieces with a friend over a glass of afternoon wine while it was still slightly warm from the oven. The next morning I ate a slice for breakfast. And then dessert. Not that slowly, but definitely surely, it disappeared, somehow feeling just right at every time of day, the little black dress of cakes. Not too sweet, not too tart, the perfect tender crumb studded with beautiful little pockets of soft, sweet fruit.Needless to say, I was still dreaming about this cake a week later. The only problem? There was no rhubarb in sight—not at the grocery store, not at the farmers' market, and certainly not in my crisper. But I had peaches that needed using, so I subbed them in, and it came out beautifully. I plan on trying it with apricots ASAP— they're looking mighty fine at the market these days—and then maybe Italian plums later in the season. The point is, this cake is officially in my summer rotation, even if it turns my already-hot apartment into a literal sauna. It's just that good.Get the recipe:Rhubarb-Almond CakeView RecipeExplore Bon AppétitBasicallyNever FailRhubarbAlmondCakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-27", "author": ["Condé Nast", "Emma Wartzman"]}