{"id": "cb950e746e1e84f0017dd3ab796c35ad", "url": "https://www.bonappetit.com/story/up-mountain-sparkling-switchel-swizzle", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "The Sparkling Switchel I Didn’t Know I Was Looking for | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Didn’t Know I Was Looking for Sparkling Switchel, But I Found It and I Love ItIt’s spicy and gingery and not too sweet. This stuff is gooood.By Julia KramerJune 18, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailEvery once in a while, to confirm my suspicion that nothing in life matters, I go to the Whole Foods in TriBeCa near our office and check out what new beverages have been invented.The other day I was studying inscrutably labeled bottles of “Chocolate-Mint Organic Electro Lyte Drink” and “Alo Awaken Wheatgrass Aloe Vera Juice Drink” for what actually might have been entire minutes when I noticed a can called “Up Mountain Swizzle”: a “sparkling switchel.”I’ve never really “gotten into switchel,” the elixir that recently made the unlikely leap from Laura Ingalls Wilder types to Acme-clad soundbathers; it’s always tasted to me a bit like...watered down apple cider vinegar (which it essentially is, mixed typically with ginger and a sweetener). I have one interest when it comes to beverages that do not come free from a faucet, and that is that they be carbonated (seltzer, wine, beer—I apply this rule across categories).Not only was Up Mountain Swizzle sparkling, but it promised me three things: “fresh ginger,” which I very much enjoy in GT Kombucha’s Gingerade; “apple cider vinegar,” which I love in fire cider, and “maple syrup”......hmm, no, that might be a dealbreaker. Would it be too sweet?Would I be writing this post if the answer was yes??? I cracked open that beautifully chilled can and holy wow: tart and tangy like a drinking vinegar, not remotely too sweet but instead spicy and gingery like my beloved GT Gingerade, with crisp, fine bubbles like the finest of seltzers. Best of all, it came in a can, and one distinctive facet of my personality is that I prefer drinking out of a can to any other vessel (yes, including a glass).The next day I went back to my Whole Foods safe space (I.e., the aisle where they keep all the experimental beverages). But I wasn’t there to ponder life’s existential questions (what even is a “Maca Mocha”?). I was there to buy five cans of sparkling switchel and get out.Where to Find it: A 6 pack of Up Mountain Swizzle is $18 online, or around $3 a can at Whole Foods and other retailersRelated: Get the recipe for Maple-Ginger Cider SwitchelOr make kombucha with Brad:Explore Bon AppétitShoppingApple Cider VinegarSummer DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-18", "author": ["Condé Nast", "Julia Kramer"]}