{"id": "cba72b22d479e493a2e603cafe084267", "url": "https://www.bonappetit.com/story/perfect-baked-potato-for-dinner", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "This Perfect Baked Potato Was the Best Part of Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Perfect Baked Potato Was the Best Part of DinnerThe steak was just a bonus.By Adam RapoportApril 15, 2019FacebookTwitterEmailChristopher BakerFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he’s been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you’ll get this letter before everyone else.Come over!7pmishSteak and baked potatoes—super simpleAnd martinisThat was the extent of the text, and it was all I needed to hear.It came from our friends Torrey and Steven, who have a yen for impromptu dinner invites. They hit up my wife and me on Saturday afternoon and we were immediately all in.Michael Graydon + Nikole HerriottThe old-school simplicity of the menu spoke to me. Why make things more complicated than they need to be? But in terms of specifics, what really pulled me in wasn’t the martinis. I’m way too much of a lightweight to handle straight vodka and vermouth (yes, I know “real” martinis are made with gin). And while I love steak, I eat a lot of it.Want this letter before it hits the website? Sign up for our newsletter!It was the baked potato that got me. I can’t recall the last time I baked one, and yet every time I’m served one, I ask myself why I don’t eat them more often.Torrey and Steven did like Andrew Knowlton preached a few years back. Rub up a russet with a generous amount of olive oil, hit it with some sea salt, and then pop it in a 400 degree oven, right on the rack.Michael Graydon + Nikole HerriottAn hour later, it emerges all browned and glistening and crispy, reminding you that the skin can be the best part, if you treat it right. (Read: Do not wrap your potato in foil, unless you appreciate limp, papery skin.)At the table, I prefer to split mine lengthwise like a pocketbook, pinch in the ends to open it up, and then add several pats of butter. And some salt. If there is sour cream on the table, I will not say no. Scallions for a bit of bite, absolutely. But even better, chives—for that allium flavor without being too aggressive.Grated cheese I can do without. Same with bacon, unless the stuffed potato is the meal unto itself. But if there is a beautifully grilled porterhouse on the table, like there was Saturday night, I’d prefer not to insult the steak.And I’m not ashamed to admit that about half way through my baked potato, I will re-up on the butter and salt and sour cream and chives. Because who knows when I’ll have one again.Get the recipe:Perfect Baked PotatoCrisp on the outside, pillowy on the inside, and up for dancing with any savory flavor in your fridge or pantry. View RecipeExplore Bon AppétitAdam NewsletterPotatoRead MorecookingMake French Toast On a WeekdayBy Adam RapoportcultureBon Appétit Used to Just Be a Magazine. Not Anymore.By Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-15", "author": ["Condé Nast", "Adam Rapoport"]}