{"id": "cbaaa8dfb8dbd14bdc46e0b87fb689bb", "url": "https://www.bonappetit.com/story/how-curtis-stones-restaurants-reflect-his-australian-roots", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "How Curtis Stone's Restaurants Reflect His Australian Roots | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHow Curtis Stone's Restaurants Reflect His Australian RootsBy Wine AustraliaJuly 23, 2019FacebookTwitterEmailCullen Wine in Margaret RiverPaul DoneganFacebookTwitterEmailIf you’re a fan of culinary television, you’ve undoubtedly seen Curtis Stone—the charismatic Aussie appearing on such shows as Top Chef Masters, Take Home Chef, and Top Chef Junior.But those in Los Angeles, especially those well-attuned to the restaurant scene, might know Stone for his two distinctive restaurants: Maude, which recently received its first Michelin star, and Gwen Butcher Shop & Restaurant.Beef Tartare on the Maude Menu, Los Angeles\nJana LanghorstWhile neither explicitly focuses on Australian cuisine, both show clear inspiration from his native country and his willingness to follow inspiration far beyond the bounds of more conventional restaurants.A childhood curiosity around food, and early years spent cooking with his grandmother, sparked Stone’s interest in the kitchen. “I’ve always just loved to eat,” he laughs. “And as I learned, I wanted to get more and more involved in everything about it.”Over the years, this evolved into a career in the culinary world. And while much of that career has unfolded in Britain and America, there’s a distinct Australian perspective embedded in his culinary style.Curtis Stone – Chef Owner of Maude & Gwen Butcher Shop & Restaurant\nRay Kachatorian“The way we as Aussies approach food is kind of unconventional,” Stone says. “On the one hand, we’re a young country. On the other hand, we have such old and deep roots”—with Australia’s Aboriginal population as one of the oldest documented groups on earth.“On another level, there are multicultural elements to Australia, whether European or Southeast Asian—ingredients and techniques used throughout our cuisine,” he says. “Growing up in that environment certainly shapes you as a cook.”And it’s not just an international perspective; it’s one that embraces the eclectic, the unpredictable, the rogue. According to Stone, “There’s something around our sense of freedom and spirit that encourages change, encourages us to push and try for what’s new and different.”“Compared with a Greek or Italian or Thai chef, an Aussie chef is harder to put a label on. But that can be a great thing.”It’s hard to put a label on Stone’s restaurants, as well. Maude, opened in February of 2014, presents intricate tasting menus inspired by the world’s great wine regions; Gwen, opened in July of 2016, is equal parts butcher shop and restaurant, each driven by the joys of seasonal cookery.When Maude launched in Beverly Hills, Stone’s series of monthly menus were based around individual ingredients. It fueled the kitchen’s creativity for years. But after dozens of these menus, Stone was ready for a new challenge.“We always thought the wine pairings were a highlight,” he says. “So as we really drilled down on those, we thought, ‘What if we looked to wine regions for inspiration?’”Cullen Wines -- An Australian winery based in Wilyabrup, within the Margaret River wine region of Western Australia.\nWine AustraliaAnd not simply to pair dishes with wines from a given region—but rather to embrace everything about the culture. “What if we study these places, and read up on them, but also learn the history, listen to the music, eat the food and drink the wine and just immerse ourselves?”Of course, hailing from one of the world’s great wine countries, Stone knew that the wines of Australia would play a part. So to compose the recent Western Australia menu, Stone led a mostly American team to the region.“I had a lot of pride around it,” says Stone, enamored of the beauty and diversity of the Western Australian landscape. “You’ve got the dusty, smoky Outback and the Aboriginal ways of life, up in the Pilbara; the incredible beaches with crocodiles, then the Margaret River where it’s so lush and beautiful… The entire region is stunning and unforgettable.”Stone felt a profound respect for the region’s ambitious, at times experimental, winemakers. Cullen Wines was a particular standout. “Their process down there is biodynamic, and just incredible,” he says, given the amount of attention this type of farming requires. “So much care and passion go into that method, when you’re looking out for the earth in an extremely natural way.”While wines were the backbone of the menu’s inspiration, the team took the opportunity to really explore native foods, as well. “We met a few Aboriginal guys and did a deep dive into indigenous ingredients,” Stone says, from wattleseed and bush tomatoes to mud crab and rock lobster. “There are so many of these ingredients that Western chefs are only beginning to appreciate.”Wattleseed, for instance, “has a cacao-like, almost espresso-like flavor.” Stone used it to encrust a venison loin, served with a celery root puree, roasted spaghetti squash, and venison jus. Davidson plum was another indigenous ingredient used —“super acidic,” according to Stone. He chose to dehydrate the plum for an accent on a not-quite-traditional tartare.“The Outback has incredibly flavorful beef,” he explains, the dish largely inspired by a visit to a fifth-generation rancher at Yarrie Station in Western Australia. “We found that the best preparation for it was raw”— that flavor emerging clearly in a tartare perked up by Davidson plum, with puffed rice and quinoa, smoked egg yolk, and fried capers.Yarrie Station in Western Australia\nPaul BellMore meat-centric fare is the focus of Gwen, Stone’s other Hollywood restaurant opened with his brother, Luke —inspired by his first job, “and first love,” in the butchery department at the Southern Cross Hotel in Melbourne. “We would cut whole animals, make charcuterie, all that old-school European stuff,” he says. “To me, it’s an art that’s getting a bit lost.”Fire-based cooking fuels the menu here. And with beautiful cuts of meat, of course, wine is the logical companion. Stone’s own passion for wine inspired much of Gwen’s list—perhaps a bit more literally than he might have liked.“When we first opened the restaurant, the sommeliers were stealing from my personal stash of Australian wines,” he laughs. “They’ve stolen quite a lot and promise to replace them at some point, but it hasn’t happened yet!”Stone has an enduring love for “those beautiful, big Barossa-style wines—what Australia is known for,” a gorgeous rich, peppery, Shiraz. Reds aren’t the whole story: “We also make some truly elegant whites, some of which drink beautifully with a bit of age on them, too.” He treasures punchily acidic Rieslings from the Clare Valley, or velvety Chardonnays from the Margaret River.Maude Wine Room Interior\nRAY KACHATORIANWith a great deal of respect for both venerable Australian wines and exciting newer upstarts, Stone sees a kinship between chefs and winemakers—balancing the classic and the novel. “Aussie chefs aren’t scared to break a rule here or there, and then see whether that could be successful for us,” he explains. “And that applies in winemaking, as well.”The brilliance of Australian native winemakers, he says—and, in many ways, Australian chefs—is that while they’re citizens of the world, they pursue their own paths. Winemakers have been able to learn from the world’s other major wine regions, \"but they haven't just replicated those wines,” Stone says. “They've figured out how to use the ingredients—terroir, weather, and grapes—to make wines that are unique and utterly unlike anywhere else in the world.\"Internationally influenced, with one eye toward tradition and another toward innovation—the recipe not only for superb, unexpected wines, but for inspired cuisine as well.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-23", "author": ["Condé Nast", "Wine Australia"]}