{"id": "cbbabf53558919a80079efdd99414310", "url": "https://www.bonappetit.com/story/hercules-mulligan", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "For the Best Holiday-Spiked Eggnog, There's Hercules Mulligan Rum & Rye | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingSpike Your Eggnog Without Breaking the BankWhy buy a bottle of rum and a bottle of rye when you can get them premixed with a gingery kick?By Chala Tyson TshitunduDecember 11, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what food people are obsessed with eating, drinking, and buying right now. Eggnog is like my ideal lover: she’s rich, she’s thick, and she’s always down to party. My obsession is almost grotesque; I spend about 10 months out of the year yearning for the time when it’s seasonally appropriate to gorge myself on mug after mug of frothy decadence. Whether scratch-made or store-bought, there’s really no wrong way to indulge in the pleasures of this wintery delight—especially when there’s booze involved. Eggnog is endlessly adaptable on the alcohol front, and can be spiked with anything from brandy to sherry and even mezcal.The best spiked eggnog recipes often call for a mix of spirits, and my pursuit of dairy-rich punch perfection has led me to spending countless dollars over on nice bottles of brandy, whiskey, and rum, only to end up using half a cup of each. But this year, there’s only one bottle on my ’nog “nice list”—Hercules Mulligan Rum & Rye. Named after the now immortalized tailor and spy who fought alongside Alexander Hamilton in the American Revolutionary War, Hercules Mulligan Rum & Rye is a bespoke blend of three aged Caribbean rums, three American rye whiskeys, fresh ginger, and house-made bitters.Photo by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksHercules Mulligan Rum & Rye$38 at FlaviarInspired by how Mulligan (the man) was known to loosen the lips of British soldiers in his New York atelier with a few cups of the good stuff, spirits entrepreneur and lifelong history buff Steve Luttmann created Mulligan (the drink) based on a unique Revolutionary War–era recipe. The result is a bright, playful, complex riff on an old-fashioned with layered notes of oak, honey, and warm spice. It’s great on the rocks and plays well with others—especially in cold weather concoctions like apple cider, hot toddies, and a delightfully fatty cinnamon- and nutmeg-forward eggnog.At just $38 a bottle, using the premixed blend in my spiked eggnog has allowed me to pocket the extra I would have spent buying both spirits separately. With a little extra cash to throw around, I can think about getting my loved ones a few more presents for the holidays. Though, gifting everyone their own bottle of Hercules Mulligan Rum & Rye just might be the way to go.Explore Bon AppétitHighly RecommendShoppingCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-11", "author": ["Condé Nast", "Chala Tyson Tshitundu"]}