{"id": "cbbc0c7d0fc7b6df5d858ce704601c43", "url": "https://www.bonappetit.com/story/buy-charcuterie-online", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "Where To Buy Charcuterie, Salami, and Cured Meats Online | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureWhere To Buy Charcuterie, Salami, and Cured Meats OnlineBecause a snack plate is an acceptable dinner.By MacKenzie Chung FeganMay 8, 2020FacebookTwitterEmailFacebookTwitterEmailBy now you know where to poke around on the world wide web for sustainable salmon (buy fish online here!) and free-range chicken (order meat online here!), which is all well and good for the nights you feel like cooking. For the other five days of the week, there’s salami. And jerky. And duck prosciutto. We’ve rounded up some of our favorite online purveyors of charcuterie and salumi so you can have everything on hand to make the snack plate of your dreams.All products featured on bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Smoking GooseCured and smoked charcuterie from Indianapolis. Made with antibiotic-free, humanely slaughtered meat from small family-owned farms. Pretty much everything is on sale right now.Seemore Meats & VeggiesVeggie-packed sausages made with humanely raised meat from fourth-generation butcher Cara Nicoletti.Elevation MeatsCharcuterie and salumi—including barley wine salami, lardo, ‘nduja, and a 2-lb. chunk of spicy coppa—made from heritage breed pigs in Denver.Olympia ProvisionsHandmade salumi from Portland, Oregon, using antibiotic-free pork. Associate director of social Rachel Karten is obsessed with their Pepperettes. Or you could always buy your sweetheart a salami bouquet!Let's see how the sausage is made.\nSalumi ChicagoArtisan salumi made with heritage pork, plus cured duck and Wagyu bresaola. Currently offering discounts and free shipping on orders over $50.The BaconerSpecialty bacon from the Bay Area made with antibiotic-free pork from family farms. 10 percent of proceeds are going to World Central Kitchen’s COVID-19 response program (which we support, too!)Driftless ProvisionsHandcrafted, dry-cured salami from humanely raised pork. Made in Wisconsin.Brooklyn Hot Dog CompanyThe natural casings on these hot dogs, made with pasture-raised pork and grass fed beef, give them a delightful snap. 10 percent of sales are being donated to New York restaurants to provide meals for local hospital workers. (Find other ways to support restaurants around the country right here.)Brooklyn CuredSmall-batch salumi, sausages, and hot dogs made from antibiotic-free meat.Underground MeatsWisconsin-produced charcuterie made with pasture-raised, heritage breed pork.Maui NuiWild harvested venison jerky from Maui. Hawaii residents can order fresh venison, too. It’s Alive! host Brad Leone is a fan of both their meat and their mission.Charlito’s CocinaDry-cured salami from Queens, New York.Tempesta Artisan SalumiSalumi made in Chicago with hormone- and antibiotic-free Berkshire pork from family farms in the Midwest. Recommended by our own managing editor Cristina Martinez. Try the ‘nduja.North Country CharcuterieHandcrafted salami from Columbus that features local ingredients like cheese from Blue Jacket Dairy and beer from Wolf’s Ridge Brewing.Black Pig Meat CoBacon made from free-roaming, heritage breed, antibiotic- and hormone-free pork.Edwards Virginia SmokehouseDavid Chang serves these Virginia country hams—specifically the Surryano variety—thinly sliced with baguette and coffee-spiked mayo. Free shipping.Looking for pantry staples online? Take a look over here!Where to Order Your Favorite Pantry Staples OnlineYour local grocery store is out of flour. The internet isn’t.View StoryExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-08", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}