{"id": "cbc55b8b3f81294aa308cf16c052f78f", "url": "https://www.bonappetit.com/story/central-europe-czech-austrian-german-wines", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "7 Wild Wines from Central & Eastern Europe You Need to Czech Out Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture7 Wild Wines from Central & Eastern Europe You Need to Czech Out NowOne of these wines tastes like a gin and tonic—and it’s the best cocktail I’ve had all year.By Marissa A. RossFebruary 20, 2018FacebookTwitterEmailPhoto by Marissa A. RossFacebookTwitterEmailLet me take a wild guess here and say your favorite European wine country is France. Okay, fine, there’s also a good chance it’s Italy. Or you could be one of those people who say Spain but probably not. I have a heavy handful of euros I’m too lazy to get exchanged betting that none of you thought, “Ooh! The Czech Republic!” Although I’m also willing to bet that same hand that you may be saying it soon because some of the most exciting wines in the world are coming from Central European countries.Central European wines aren’t by any means new, but in many ways they’ve been forgotten. I mostly blame the Soviets, and I’m not just saying that because it’s easy to blame Russians these days. I’m saying that because despite it being nearly 30 years ago, the embargo on goods from behind the Iron Curtain is still having an effect, not only in physical importing but also in reentering the American consumer consciousness.But once you taste these wines, they are impossible to forget. They have striking acidity, impressive fruit, low alcohol, playful juiciness, and a nearly lusty dryness. I can’t help but clamor for them, and I’m not the only one. “I’m smitten with SloCzech, as I call the area,” says Alice Feiring, author of The Dirty Guide to Wine. “There’s an enthusiasm for going back to their roots, by making natural wines. Their strength is in reviving traditions lost since the WWII, [making wine] the way wine used to be made. And these are wines that are going to appeal to the more extreme natural wine lovers. Some of those wines from Slovakia and the Czech Republic are crazy, but crazy delicious.”Crazy delicious, indeed. And while I love French wines, Italian wines, and Spanish wines— honestly, all the wines—today Central European countries are the ones driving wine, and its culture, forward. They are fresh, invigorating, and mind-bending, proving that wine is constantly evolving and there is always something new to explore.Wondering where to start? Here are some of my recent favorite bottles.Photo by Marissa A. RossLapati Kidev Erti Chinuri 2016Georgia$37; Domaine LAThis wine is buzzy in all the ways. Not only are Georgian pét-nats few and far between in the States, but this sparkler of the native white Chinuri grape evokes images of honeybees bustling around fresh citrus blossoms. Cloudy-dandelion in color, the Lapati Kidev Erti Chinuri smells and tastes like orange trees in the spring with wafts of cantaloupe, honey, and fresh laundry. With sudsy bubbles and bright acidity, pop it and you will be singing along with the chorus of Kendrick Lamar’s “Yah” in no time. Buzzin…Photo by Marissa A. RossStrohmeier Schilcher FrizzanteAustria$31; Discovery WinesFull disclosure: I’ve never been in a saltwater hot tub with cold blood oranges and guavas bobbing in the foam. But I can tell you with one hundred percent certainty that if I had, it would be like drinking the Strohmeier Schilcher Frizzante. This Austrian rosé bubbly is a bacchanalian vacation, with citrus and tropical fruits. With the color of a young coral-orange bird-of-paradise and the nose of a freshly cracked ruby red grapefruit, drinking it is like jumping into that hot tub I was talking about (and we all wish existed).Photo by Marissa A. RossStrekov 1075 RozaliaSlovakia$29; Henry’sStrekov 1075’s Rozalia is young love squeezed into a bottle. This pét-nat from Slovakia is 94% Saint Laurent, with 6% Alibernet, and looks like bright pink and red construction-paper valentines dissolved in a glass. On the nose it smells like tangerines, barely budded roses, and candied ginger, and it tastes like sour raspberries and grilled grapefruit with a faintly smoky charred-rind finish. Energetic and punchy, the Rozalia hits you like a school yard crush, and you’ll never not be nostalgic for it.Photo by Marissa A. RossMilan Nestarec “Gin Tonic” Sauvignon BlancCzech Republic$54; Henry’sIf ordering a Gin Tonic at a bar got you a glass of this wine from Milan Nestarec, it’d put Bombay out of business. This Sauvignon Blanc from the Czech Republic goes down as easy as a G&T from your favorite dive bar, but instead of being watered down, it’s overflowing with flavor. Maize-yellow in color, the Gin Tonic smells like a reimagined Dole Fruit Cup dessert from a Michelin-starred pastry chef. The nose is fruity and seemingly sweet, but a single sip explodes with unexpected acidity, highlighting flavors of Granny Smiths, pineapple, and mango, garnished with rosemary springs. Best cocktail I’ve had in years, tbh.Photo by Marissa A. RossArchil Guniava Kvaliti TsolikouriGeorgia$20; Lou Wine ShopGeorgian wines and their history require an entire book (thankfully, Alice Feiring wrote it for us: For the Love of Wine: My Odyssey Through the World's Most Ancient Wine Culture), but this ancient winemaking culture has been making skin-contact wines in clay amphora-ish vessels called kveri for nearly 10,000 years. In other words, there is no “orange wine” without Georgia. While many modern skin-contact wines can be one-noted, Archil Guniava’s Tsolikouri—an indigenous white Georgian variety—is simply mesmerizing. It is pale saffron in color, smells like fully bloomed sunflowers, and tastes like pears and almonds baked into a redwood. But what makes this wine so special is its texture. It’s like drinking Nina Simone’s voice; coarse but warm and melodic.Photo by Marissa A. RossTrossen Rot Pur’usGermany$28; Discovery WinesPur’us is Latin for ”pure,” a fitting name for this biodynamic blend of Pinot Noir and Dornfelder from Rita & Rudolf Trossen. From its bouquet to its palate, this wine screams of pure nature. It smells like rolling around in tiny tart blueberries and boysenberries, and tastes like a crisp walk through a forest, brambles of blackberry and red currant lining the damp soil trail as your boots sink into wet leaves. It makes me want to move to the woods.Photo by Marissa A. RossRichard Stávek BakonCzech Republic$28; Chambers Street WinesThis wine makes you want to run to the stereo and throw on The Hollies’ “Long Cool Woman (in a Black Dress).” Because there’s no better way to describe this wine. It’s long, it’s lean, it looks like it’s in a black dress, and most important, damn, it is cool. It’s a wine worth becoming a hot mess over, although you won’t because it’s only 10% alcohol. The bouquet is a rumble between blackberries and underripe blueberries with a canister of La Baleine sea salt doing a mediocre job of refereeing. Drinking it down is all bright, chlorinated (in a good way!) blackberries with a finish that feels like leather sliding across a wood floor. It might have only been at a local banquet hall, but damn is it delicious.After you try these, let me know your best shipping address for all these euros I bet you.All this talk of berries has us craving this cake...Explore Bon AppétitWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-20", "author": ["Condé Nast", "Marissa A. Ross"]}