{"id": "cbcbfb31004acde59e8c56aad79f5fb1", "url": "https://www.bonappetit.com/recipe/charred-kale-with-citrus", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "Charred Kale With Citrus and Green Tahini Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCharred Kale With Citrus and Green TahiniBy Chris MoroccoFebruary 17, 20204.8(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintEnough with having to give free massages to stubbornly tough greens. In this dish, a quick char in a hot skillet tempers the raw edge of kale and balances its vegetal flavor.Ingredients4 servings¼cup seasoned rice vinegar¼cup tahini1small garlic clove7Tbsp. extra-virgin olive oil, divided1cup (lightly packed) cilantro leaves with tender stemsKosher salt2bunches curly kale, ribs and stems removed, leaves torn into big pieces2large oranges or small grapefruit (or a mix!)⅓cup store-bought crispy shallots or onions2Tbsp. toasted sesame seedsPreparationStep 1Blend vinegar, tahini, garlic, 5 Tbsp. oil, and 5 Tbsp. water in a blender or food processor until smooth. Add cilantro and purée until very smooth and bright green. Season dressing with salt.Step 2Heat 1 Tbsp. oil in a medium skillet, preferably cast iron, over medium-high. Add half of kale to skillet and cook, undisturbed, until charred underneath and bright green, about 1 minute. Continue to cook, tossing once or twice, until kale is charred in spots and only partially wilted, about 1 minute longer. Transfer to a medium bowl. Repeat with remaining kale and 1 Tbsp. oil.Step 3Drizzle half of dressing over kale and toss to coat. Taste and season with salt.Step 4Using a paring knife, remove peel and white pith from citrus, being careful not to remove too much flesh. Slice citrus however you want, working to avoid the central axis, which contains most of the seeds (you can slice into ¼\"-thick rounds or cut into 1\" pieces; they don’t need to be an exact shape or size). Scatter citrus over kale.Step 5Drizzle salad with more dressing (you’ll probably have some left over). Top with crispy shallots and sesame seeds.How would you rate Charred Kale With Citrus and Green Tahini?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleExplosive, vibrant, flavor. Divine balance of sweet, bitter, nutty, salty, and smoky. Even the biggest vegetable skeptics at my table kept going back for more. \n\nDo not hold back on charring the kale, the crunchy texture works exactly as the recipe promises. Like a kale chip without the excess oil! \n\nVery filling. This recipe made enough for dinner plus three days of leftovers. Have remade this recipe several times and it’s a success every time. Edith B. Providence, Rhode Island 3/26/2022Really enjoyed this! Only used oranges because it's what I had on-hand and added some pan fried halloumi. I had some of the dressing leftover, and I'm excited to have that for salads for the rest of the week. KellySeattle, WA10/18/2021I made this last night watching for the election results in anticipation. The bright citrus was a mood booster and considering the news of a Biden/Harris win this morning I might just start referring to this as my celebration salad. Catherine11/7/2020Loved this charring technique. I made the mistake of thinking I didn't need 2 entire bunches of kale because I was making this as a side dish (for black bean burgers, yum), and just serving for two. I halved the recipe and it was NOT ENOUGH KALE since it shrinks a bit upon charring. Make the whole salad and save potential leftovers for later! Note to Future Self! That said, the dressing was flavorful and I didn't feel that it would require exact measurements to whip up–good for Future Self to keep in mind when I'm too hungry to look this back up.yagurlcarlyTucson, Arizona6/21/2020If you have any leftover dressing - I highly recommend using it on the kale salad on the Chickpea Pancakes with Fennel and Kale recipe!noramayeBuffalo5/2/2020Delicious! I ate the whole thing in one sitting and now am a little worried about what my poop will look like tomorrow after eating more greens in one sitting than I have in the past year, but I suppose that's a good problem to have!  I had dressing leftover, too.noramayeBuffalo5/1/2020Delicious! I made this salad for my boyfriend and I last week. So good that i'm cooking it for my client this week. For me it didn't take as long to cook the kale as the recipe said, unless you want very wilted kale. laurengressSeattle4/23/2020Now I love kale. I've been making this every week, it's my new favorite salad. I now have a favorite salad. Changing my life over here bon appetit.ash_chahineCalifornia4/21/2020Had to make some modifications but I loved it! Substituted apple cider vinegar for the rice vinegar (which I don’t have and didn’t want to go shopping for currently!) and left out the cilantro (which I don’t personally care for). Only used oranges (because that’s all I had) but I bet it would be fantastic with grapefruit too. Also completely forgot to add the sesame seeds at the end. I would absolutely make this again. I think it would be great with some salmon as a dinner (I think another reviewer did this?) but since I’m trying to make due with what I have on hand, I couldn’t try that this time around. I saved half of everything for lunch for tomorrow (dressing separately from greens separately from cut oranges) and I’m already looking forward to it!AnonymousNewark CA4/20/2020It just tasted weird, i know i did everything right. But it just was weirdspicypestoAustralia4/1/2020Thank you, Chris Morocco for this delicious, nutritous and simple recipe! jenny43Berkeley, CA3/29/2020Absolutely delicious! A salad I can get around! The kale flavour is perfectly balanced with the orange, roasted sesame and acidity from the dressing - so, so good for a salad, I couldn't believe how flavourful it was.Anneg1508Australia3/26/2020The dressing for this is amazing, I've made it multiple times.AnonymousWashington, DC3/23/2020Chris is doing the lord’s work with this recipe and the big flavor broccoli. I’m a broke, exhausted grad student and I need a reason to look forward to my veggies! This recipe was great for me because I had a ton of the tahini left over, and I can char the kale in my iron skillet in 2 minutes and it takes even less time to rinse out the skillet. This has given me a reason to finally finish the giant bags of kale they sell at Aldi! I can come home from teaching and char some kale and toss it in tahini and the other ingredients really fast. It’s also a way to get my leafy green vitamins so all of my sick students don’t infect me. Thank you for this!dallasmIllinois3/11/2020Delicious, made a roasted beet hummus to go with it and it worked really well! Thanks Chris that was a lovely brunchBigcorkyGlasgow3/11/2020Explore Bon AppétitSaladKaleLeafy GreensVegetableOrangeCitrusFruitGrapefruitWinterQuickEasySideDairy-FreeGluten-FreeVeganVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-17", "author": ["Condé Nast", "Chris Morocco"]}