{"id": "cbd10daeb773714f630199c0c9c754b3", "url": "https://www.bonappetit.com/story/talat-market-thai-recipes-redirect", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "\"I’m Still Waiting On My Dream Restaurant\" | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersrestaurants“I’m Still Waiting On My Dream Restaurant”Chef Parnass Savang grew up watching his parents simplify Thai food for American palates and promised himself that his own restaurant, Atlanta’s Talat Market, would never compromise. Then the pandemic hit.By Parnass Savang, as told to Hilary CadiganSeptember 30, 2020FacebookTwitterPinterestPhoto by Emma FishmanFacebookTwitterPinterestThis article is part of our series on how restaurants changed in 2020, and why we've never loved them more. Click to see all the stories.On weekends in high school, while my friends went to football games, I washed dishes at my parents’ restaurant, Danthai. All I wanted was to get away. It’s that first-generation thing: I grew up in a Thai bubble, then when I got to school, English replaced my mother tongue. School lunches were my education on American food: cheddar Sun Chips, pizza, really overcooked green beans. That’s what I was excited about. At their restaurant my parents tempered our family recipes to fit into a predominantly white community. It wasn’t the food they loved. It was the food that sold.I went to culinary school because I watched Gordon Ramsay on YouTube. I wanted to give my dad’s restaurant the Kitchen Nightmares treatment. But once I got to New York and started cooking French food, all I could think about were the things my parents made at home—lad na, sai ua—the things I always took for granted. So I made a 10-year plan: After culinary school I’d go back to Atlanta, work with all the best chefs (including my parents!), get to know the farmers, then open a Thai restaurant. One that challenged perceptions of what Thai food could be but never compromised.Somehow I’ve stuck to the plan. My friend Rod Lassiter and I started Talat Market as a pop-up three years ago; by March 2020 we were days away from opening our brick-and-mortar. Then the pandemic hit.Takeout was a big part of my parents’ business, like it is for most Thai American restaurants. Growing up I spent hours packing Styrofoam boxes full of pad thai. But working in high-end restaurants made me look down on to-go. Dining was about the plating, the presentation. You ate out to get the full experience, and that’s what I wanted for Talat. I wanted to transport people. I wanted an open kitchen so diners could watch our process—the pressing of the fresh coconut milk, the way the egg puffs up when you pour it into hot oil. I wanted Thai luk thung music playing over the speakers. I wanted tables with dinky plastic stools where guests could linger for hours like they would on a street in Chiang Mai. But now, in order to survive, restaurants must adapt, and that means serving our food to-go.I’m trying to look on the bright side. Rod and I see this as a chance to focus on the flavors, the techniques, the stories—what you’re left with when everything else is stripped away. My yum phonlamai, a savory Thai-style fruit salad, is a throwback to my mom, whose parents made a living sell-ing pineapples in Bangkok. My red curry is an homage to my dad, who learned it from his mom. And the seasonal Georgia produce in all my dishes is a nod to my Thai American upbringing, how I was raised between two worlds.So yeah, I’m still waiting on my dream restaurant. But in the meantime I know that the food we serve—whether it’s on a ceramic plate or in a cardboard to-go box—will never compromise.The recipes keeping his dream afloat: Photo by Emma Fishman1/6Fall LarbA rebellious take on a Thai classic, made with butternut squash, carrots, and parsnips.View RecipePhoto by Emma Fishman2/6Geng Dang MuuThe curry and ground pork reference the origins of the dish, while the brussels sprouts and leeks are a nod to the local ingredients of Georgia.View RecipePhoto by Emma Fishman3/6Khai JiaoAn ultralight and puffy Thai omelet with crispy golden brown edges.View RecipePhoto by Emma Fishman4/6Yum PhonlamaiThe interplay between the fish sauce, chiles, and sweet juicy fruits makes this a simple but refreshing dish.View RecipePhoto by Emma Fishman5/6Sai Ua Samun PhraiA vibrant Thai sausage made with ground chicken, plus a spicy chile dip.View RecipePhoto by Emma Fishman6/6Phat Sii Krong NeuaThinly sliced flanken-cut short ribs, packed with rich flavor, are the key to this Thai stir-fry.View RecipeExplore Bon AppétitThaiRestaurantsCoronavirusFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-29", "author": ["Condé Nast", "Parnass Savang", "As Told To Hilary Cadigan"]}