{"id": "cbddd037e0e4560767741418d16e4965", "url": "https://www.bonappetit.com/story/garlic-roasted-chicken-legs-recipe", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "A Garlic-Lover’s Chicken Recipe Because Life’s Too Short to Worry About Bad Breath | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Garlic-Lover’s Chicken Recipe Because Life’s Too Short to Worry About Bad BreathIf you’ve ever said the words “too much garlic,” don’t talk to me ever again.By Amanda ShapiroOctober 2, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie TheodorouFacebookTwitterEmailIf it were up to me, this recipe would be called Lots of Garlic with Roast Chicken Legs instead of the other way around. It’s for the true garlic aficionados. The garlic broth swillers. The fearless devotees who won’t balk at the prospect of putting four heads of garlic—that’s one head of garlic per person, mind you—into an otherwise very tame chicken recipe.Now that I’ve alienated a large swath of you, dear readers, let me qualify: This new recipe uses the Charlie’s Angels trifecta of olive oil, heat, and time to produce a garlic situation that’s more chill Aquarian than raging Scorpio, plus some fall-off-the-bone tender chicken to boot.The whole thing only takes ten minutes to prep—chicken legs, salt, sliced lemon, all that garlic, a few sprigs of thyme, a fresh chile (if you have one), and an ungodly amount of olive oil all meet up in one baking dish—but it needs some good QT in the oven to roast. You’ll know it’s ready when the meat is barely hanging on, and everything is bubbling and crisp (read: about an hour and a half).Once it cooled down, I popped the soft, melty garlic cloves out of their skins and stirred them back in with the chicken. You could keep them intact if you like the idea of garlic more than reality of garlic garlic everywhere, but please see above for my true feelings on this subject. You can add a green salad (because #healthyish, right?), but real garlic worshippers know the move is to ditch the fork and soak up as much of the stuff as possible with a loaf of bread.Which brought me back to another prized moment: That time I got lost in Tuscany and had one of the best, most garlicky meals of my life. I'll never find that random village or restaurant again, but I'll always have this recipe—and my strong, lingering garlic... memories—to bring me back.Get the recipe:Roast Chicken Legs with Lots of GarlicAnd we mean lots.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-02", "author": ["Condé Nast", "Amanda Shapiro"]}