{"id": "cbdd08b950b808fa0079b928dac62b20", "url": "https://www.bonappetit.com/story/torta-pasqualina-brunch-recipe", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "Torta Pasqualina Looks Like High Drama, But Comes Together In 3 Parts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTorta Pasqualina Looks Like High Drama, But Comes Together In 3 PartsThis Italian savory pie is a stunner, and no one needs to know you made it all ahead.By Emma WartzmanMay 4, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiFacebookTwitterEmailServing a quiche for brunch is a solid move, if a little predictable. Serving torta pasqualina, however, is anything but. The Italian savory pie is filled with mounds of Swiss chard mixed with creamy ricotta and salty Parm, and whole eggs baked right inside the flaky crust. It’s a stunner. Which is why it’s traditionally made on Easter and special occasions, but it works just as well for weekend get togethers.So yes, it’s a bit of a project. But a project where parts of or all of it can be done ahead of time—which is why you could prepare two—allowing you to casually pull out this oh-so-impressive dish as your friends arrive to drink buckets of coffee and commiserate their hangovers, or whatever it is you do at lazy weekend brunches. “The payoff is kind of incredible,” says senior food editor Andy Baraghani. “It’s sharable and casual, even though it reads as dramatic and different.”The crust is most often made with flour, water, olive oil, and salt, but this version from chef Ignacio Mattos of Cafe Altro Paradiso and Estela in NYC skews closer to a flaky pastry dough because of the inclusion of ...a lot of butter. All of the ingredients get blitzed up in a food processor, after which you just have to knead it a few times to allow everything to come together. “It’s not fussy,” Baraghani says of the dough, “and it’s super forgiving. The one thing to remember that is the secret to any good pie dough: don’t overwork it.”Divide the dough in half (one half for the bottom layer, one for the top), cover the halves in plastic wrap, and stick them in the fridge for a couple of hours. This is the key to supremely flaky crust: cold butter. If you do the whole ahead-of-time-thing, the dough can keep in the fridge as many as five days before you’re planning to bake.Spread those greens out.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiThere are slightly different variations out there, but the inside is always primarily made up of dark, leafy greens (chard, in this case, but it could be kale or collards) and cheese (a mixture of ricotta and Parm). The most important step of all is that, after blanching the greens, you squeeze as much excess water out of them as possible. Squeeze, and then squeeze again. This ensures that your bottom crust won’t get soggy, which we can all agree would be devastating. “You’re also likely to find onion and nutmeg in most torta recipes,” Baraghani says, “but the addition of a little bit of lemon zest and grated garlic in this one really lifts the greens to the next level and makes them pop.”Once the dough and filling are prepped, you’re almost there. Roll out both disks and lay one of them on the bottom of a pie dish. Scrape the filling in and spread it out evenly. Now comes the most fun part. Make little divots in the greens, which will be like nests for your eggs. Crack your eggs into the divots, salt them lightly, and then place the second rolled-out disk of dough on top. You can get all fancy with your decorating if you want, because this is your life and no one is stopping you. Lattice? Sure. Braids? Why not. But a fully-covered pie is definitely acceptable, too, held together with a simple crimp or pressed together with a fork. An egg wash on top creates a deeply golden brown crust, and a quick stint in the freezer before baking ensures the whole thing holds up well after it’s been in the oven for a little over an hour.“It’s great at room temperature,” Baraghani says, “and super sharable. Plus, once you have the ratio of greens and eggs and cheese, you can sub in kale, or another hard, salty cheese, or even play around and with other spices like chili flake or a mild curry powder.”Now go ahead and call your friends. You’re hosting brunch this weekend. And you’re not making quiche.Get the recipe:Torta PasqualinaThis double-crusted stunner of a savory tart is a traditional Italian Easter dish, but it makes for an impressive vegetarian main no matter what you’re celebrating.View RecipeThis is part of our May travel issue, devoted to Italy, subscribe here.Want to be really ambitious? Make your own ricotta cheese.Explore Bon AppétitWeekend BrunchItalianVegetarianchardEggPieRead MorecookingThis 2-Ingredient Cheese Dip Is the Easiest Thing I’ve Ever Seen a Chef MakeBy Amiel StanekcookingMake Malfatti: Fluffy Ricotta Dumplings That Are So Much Easier Than GnocchiBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-04", "author": ["Condé Nast", "Emma Wartzman"]}