{"id": "cbe60103c7dffa6d31bd75b29bc8c080", "url": "https://www.bonappetit.com/story/24-hours-on-a-cruise-ship", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "This Cruise Ship’s Kitchens Never Sleep, So For 24 Hours, Neither Did I | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Cruise Ship’s Kitchens Never Sleep, So For 24 Hours, Neither Did IThere’s always something to eat on this enormous floating playground.By Amanda ShapiroFebruary 4, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailIt was October and already cold in New York when I boarded the megaship to the Bahamas, where I’d heard the water was bluer than Bradley Cooper’s eyes. But I wasn’t going for the Caribbean coastlines, nor the gambling, the water park, the ropes course, Broadway shows, or any of the other amenities on the Norwegian Escape, one of the largest cruise ships in the world. I was there for the food. With my photographer Laura in tow, I was there to see how—over the course of 24 hours—5,800 people ate, what they ate, and how it all got made.11:16 a.m.The drinking starts early: mojitos, piña coladas, rum punch. The first bar I come across is in The Haven—Norwegian’s VIP wing—and it’s two-deep already. Here’s how many beers get drunk in a week on the Escape: 29,806. Add 5,500 bottles of wine and over 1,000 handles of liquor sold across the ship’s 21 bars, and it starts to make sense why “booze” and “cruise” kind of sound the same.12:45 p.m.We go in search of lunch alongside 4,000 passengers with the same goal and end up on deck 16, where the massive buffet is lined with pizza, french fries, burgers, pasta, and more. The Escape serves 22,000 meals every day out of 18 kitchens, which I will call galleys from here on out because, as I was corrected many times, that’s what you call a kitchen on a ship.4:47 p.m.Laura and I are in the largest galley, which services three dining rooms with identical menus. At 5,200 square feet, it’s bigger than an NBA court, and everything in it seems to scale. Cooks flip massive steaks on a grill the length of a train car. Pastry chefs drizzle chocolate sauce from squeeze bottles onto plates with hundreds of salted caramel tarts. The dish pit is a dish Grand Canyon.There are 250 cooks on the Escape, each working 12-hour shifts, seven days a week, for six to nine months at a time. A dozen of them gather by a long counter lined with the night’s specials—bruschetta, pasta with shrimp, filet mignon, that chocolate salted-caramel tart. One by one they present each dish to Prejith Sukumaran, the Escape’s always-smiling executive chef, who tastes every plate with a tiny plastic spoon, nodding as he works his way down the line.The Norwegian Escape in the Bahamas.\nPhoto by Laura Murray5:25 p.m.Outside the galley, it’s finally dawned on people that they’re on vacation. Laura and I dodge a group with T-shirts that say “Oh ship! It’s her 60th birthday!” and find a table at Food Republic, a food-hall-esque restaurant with white subway tiles. The high-topped tables are equipped with iPads for ordering butter-soft sea bass skewers and some excellent pork belly ramen along with a couple tequila cocktails. We could be in Brooklyn, but Brooklyn is behind us, quickly disappearing on the horizon.7:18 p.m.We walk the long halls of the Escape, scoping out the other restaurants on board. There are 18 dining concepts—from the gelato shop to Jimmy Buffett’s Margaritaville to fancier spots like Le Bistro (French concept), La Cucina (Italian concept), and Cagney’s (steakhouse concept).We quickly realize that every restaurant is also a show. At Teppanyaki (hibachi concept), cooks juggle knives and spatulas over hot grills while making fried rice and singing “Hooked on a Feeling.”  At the Supper Club, singers pass you foaming pints of beer between songs. At Moderno, servers present giant metal skewers of perfectly cooked Brazilian-style meats, which they shave onto our plates until we literally show them a red card and beg them to stop.10:24 p.m.Most of the restaurants on the Escape close at 10:30 p.m., but O’Sheehan’s is open 24 hours. It’s smack in the center of the ship next to the slot machines and overlooking an atrium with a giant movie screen. I love O’Sheehan’s because it reminds me of the Irish pubs of my suburban youth: glossy dark wood, a few shamrocks on the walls, really good chicken wings. The regulars call it O’Shay’s, and since I’ll be extremely regular here for the next 12 hours, I will call it that too.A bowl of pork-belly ramen at Food Republic.\nPhoto by Laura Murray11:36 p.m.In the narrow galley, night cooks are cranking out plates of prime rib (2,800 pounds per week) and baskets of wings (4,300 pounds per week). The attractive cast of the onboard musical eats at one long table; two women in pajamas share a plate of fries at another. At the bar, couples are meeting other couples and ordering rounds of drinks for their new best friends.12:31 a.m.I don’t normally drink caffeine, so I figure that a cup of coffee and a Diet Coke will keep me up for the night. I am very correct. Caffeine makes me unconquerable. We talk to newlyweds in matching shirts (“We’re on our honeymoon!”), two more newlyweds in matching shirts (“Wifey” and “Hubby”), and a guy we call Dancing with Corona Man because he is always doing exactly that.1:45 a.m.Laura is threatening to go to bed, so I ply her with nachos, wings, and light beer at O’Shay’s. There are a few hopeful singles at the bar and a group of teenage boys who take turns insulting each other and spraying soda out of their noses. Polishing off her food, Laura swears she’s going to make it through.2:07 a.m.Laura down. I’m going to have to win this night on my own. A young couple comes in, sweating from the dance party on deck 12 and feed each other bites of pasta. A man sits at a table alone, alternating between eating a hamburger and napping. I write in my notebook, “Is the whole world drunk?”Pasta with shrimp for dinner in the Manhattan Room.\nPhoto by Laura Murray3:00 a.m.O’Shay’s never closes, but it does stop serving booze at three. So now it’s just me and the cleaning staff, who swoop in out of nowhere like Mary Poppins, dusting every surface and vacuuming under my feet in preparation for the breakfast rush.3:28 a.m.I’m not tired, but I am bored. I read every word of the daily newsletter (cruise-letter?), marking the activities I plan to attend the next day: Mr. Sexy Legs Contest, Adult Karaoke Madness (18+), Guess the Weight of the 3D Crystal. I think about how everything on this boat has a start and an end, all these activities, even the cruise, even life itself. Only O’Shay’s is forever.3:40 a.m.I must have dozed off because suddenly all the tables have coffee mugs on them. A middle-aged couple comes in mid-fight—is it Wifey and Hubby?! I try to eavesdrop, but they take their iced teas to-go.4:08: a.m.Bacon smells come from the kitchen as a server meticulously refills every container of salt on every table. No other guests are in sight. Up on deck 16, the buffet staff is already cracking eggs (61,200  per week) and brewing coffee (3,000 pounds per week). Breakfast begins at 5:30. Downstairs on deck 5, the bakery crew is churning out muffins, danishes, and sticky buns (3,600 pounds of butter per week).Two scoops from the onboard gelato shop.\nPhoto by Laura Murray5:45 a.m.A guy in a fleece vest sits down and orders eggs and toast. I nearly whoop because that means it’s morning. I win O’Sheehan’s. I win at cruising. The queen would like her breakfast.6:03 a.m.I am eating oatmeal at O’Sheehan’s.6:30 a.m.I go back to my stateroom to watch the sunrise from my balcony. I check to see if the water is Bradley-Cooper’s-eyes-blue, but we’re still north of the Carolinas. The housekeeping staff has left an origami penguin made from folded hand towels on my bed. I take some selfies with it and wonder if I’ll ever sleep again.10:30 a.m.I wake up on top of the covers with my shoes on, spooning the penguin, who is now just two crumpled towels. Up on deck 16, the buffet has been serving breakfast for five hours already. In its galley, lunch prep is in full swing, and the specialty restaurants are getting deep-cleaned for tonight’s dinner. On the decks, the sun worshipers have taken their positions and the barflies order their first piña coladas (435 bottles of rum per week). While I slept, thousands of people ate and drank and ate some more. I get up, brush my teeth, and join them.6 More Ways to Cruise for FoodCelebrity CruisesLet’s be clear: Less isn’t more. Twenty-nine different dining options is more. Especially when one of them is a four-course meal featuring roasted lobster and filet mignon—guided by, you know, a tiny virtual reality chef.Princess CruisesRecently overhauled by wine genius Doug Frost (he’s both a Master Sommelier and a Master of Wine—one of only four in the world to hold both titles), the expansive onboard wine list is organized by flavor profile so you can be the captain of your own drinking voyage.Holland America LineEveryone loves a squad: the Avengers, the Mighty Ducks...and now the Culinary Council, an international chef dream team that includes a French-trained chocolatier and a Japanese sushi master.Crystal CruisesTake a cruise back in time with one ship’s new Rat Pack–themed Stardust Supper Club, where you can dress in sparkles and chow down to live renditions of Frank Sinatra.Windstar CruisesPrefer a bit more of a DIY situation? Grab your walking shoes for guided market crawls, wine tastings, and recipe demonstrations led by James Beard–recognized chefs and sommeliers.Royal Caribbean InternationalYou’d have to eat 15 meals an hour for 24 hours straight (no sleeping!) to try all of the 350 dishes the newest and largest ship serves daily. We did the math. But don’t worry, there’s a robot bartender slinging two drinks a minute to help you wash it all down.Explore Bon AppétitCruiseRead MoreLifestyleNote from a BoatBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-04", "author": ["Condé Nast", "Amanda Shapiro"]}