{"id": "cbf603d30905f903a4a95bca8fc96f58", "url": "https://www.bonappetit.com/recipe/chile-braised-chicken-tostadas", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Chile-Braised Chicken Tostadas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueChile-Braised Chicken TostadasBy Christina ChaeyAugust 10, 20214.4(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis saucy shredded chicken takes inspiration from Mexican chicken tinga. Here we harness the wonderful complexity of dried chiles, which simmer with onions, tomatoes, spices, and chicken broth to slowly braise whole chicken legs. Cracking the lid of your cooking vessel helps concentrate the liquid as the chicken cooks. Once the chicken is fall-apart tender, remove it and blend the braising liquid and aromatics into a rich sauce to toss with the shredded meat. Use it to top tostadas or rice bowls, or as a filling for enchiladas and tacos.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLodge 7.5 Quart Enameled Cast Iron Dutch Oven$90 At AmazonBlender$32 At AmazonTongs$13 At AmazonGlass Storage Container$16 At AmazonIngredients4 Servings3lb. chicken legs (thigh and drumstick; about 6)Kosher salt2Tbsp. (or more) vegetable oil1large onion, thinly sliced8garlic cloves, peeled13\" cinnamon stick1tsp. cumin seeds114-oz. can whole peeled tomatoes8dried ancho, guajillo, chipotle, and/or New Mexico chiles, stems and seeds removed2–3cups low-sodium chicken brothTostadas, shredded lettuce, chopped red onion, cilantro leaves with tender stems, queso fresco, and lime wedges (for serving)PreparationStep 1Season chicken generously with salt. Heat oil in a large Dutch oven over medium-high. Working in batches and adding more oil between batches if needed, arrange chicken, skin side down, in pot in a single layer. Cook, undisturbed, until skin is crisp and golden brown, 5–7 minutes. Turn over; cook until other side is browned, 5–7 minutes. Transfer to a plate.Step 2Reduce heat to medium and combine onion and garlic in same pot; season with salt. Cook, stirring occasionally, until onion is softened and starting to brown, about 5 minutes. Add cinnamon stick and cumin seeds and cook, stirring, until fragrant, about 30 seconds. Add tomatoes and their juices, crushing with your hands as you go. Cook, stirring occasionally and scraping up any browned bits, until juices are almost completely reduced, 5–7 minutes.Step 3Add chiles and 2 cups broth to pot, then chicken (it should be mostly submerged; add remaining broth if needed). Make sure chiles are under chicken so they can fully hydrate. Increase heat to medium-high; bring to a simmer. Reduce heat to low, partially cover pot, and simmer 45 minutes. Turn chicken over, scraping up browned bits. Partially cover; cook, scraping up browned bits every 15 minutes, until meat shreds easily and braising liquid is reduced by half to three fourths, 45–60 minutes. Transfer chicken to a plate; let cool slightly. Remove skin, then shred meat into a medium bowl; discard skin and bones.Step 4Fish out cinnamon stick; discard. Transfer onion, garlic, and chiles to a blender; add ½ cup braising liquid. Blend, adding more braising liquid or broth if needed until smooth (sauce should be the consistency of a loose ketchup); season with salt. Add enough sauce to chicken to coat (save extra sauce for another meal).Step 5Spoon chile chicken on tostadas and top with lettuce, red onion, cilantro, and queso fresco. Serve with lime wedges.Do ahead: Chile chicken can be made 4 days ahead. Let cool; cover and chill.How would you rate Chile-Braised Chicken Tostadas?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis recipe is Awesome.  I made it with all guajillo Chile's and ground beef/pork. This can be easily made with different cuts of beef and pork. AnonymousLos Angeles,  ca1/23/2022This seems like it could be done in an instaPot.  What do people think?jlc.Portland Or1/18/2022Great recipe, I halved it and made some adjustments and it turned out delicious. The sauce is delicious and I'm going to use the extra to make Arroz RojoBennett9/21/2021Explore Bon AppétitTostadaMexicanLatin AmericanChicken LegChickenPoultryCanned TomatoTomatoVegetableAncho ChileChileGuajillo ChileChipotleNew Mexico ChileMainNut-FreeGluten-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Christina Chaey"]}