{"id": "cc0dbbff4e0f1d09f821f8e5dab1242a", "url": "https://www.bonappetit.com/story/simple-sweet-lassi", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "I Beat the Heat With Homemade Sweet Lassis | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Beat the Heat With Homemade Sweet LassisThey’re cool, refreshing, and couldn’t be easier to make at home.By Tania BanerjeeJuly 28, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Kat BoytsovaFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.In Kolkata, my hometown, summer is infamous for its harsh sunshine. In the sweltering heat, my daily trips to the university were always punctuated by a pit stop at a food stall for a sweet lassi.Smooth and thick, this creamy concoction consists of yogurt whisked with sugar, chilled milk or water, and ice. (There’s also a salty variant of lassi, a sibling of the Turkish drink ayran; it’s unsweetened, less thick, and comes with a pinch of salt and spices.) In the stalls, the cold lassis, in all colors and flavors, were poured into glass mugs, garnished with cardamom powder, crushed cashews, pistachios, almonds, raisins, and topped with pitted cherries. At my home, my mother made classic sweet lassis on summer evenings. While my parents would discuss serious issues on the terrace, I would gulp my drink thirstily.Though their origins are said to be in the Punjab region of the Indian Subcontinent, lassis are now ubiquitous throughout India and even abroad. I’ve seen lassi scribbled on menus everywhere, from plush restaurants in Abu Dhabi to streetside eateries in Ho Chi Minh City.What makes the sweet lassi so amazing is its versatility. The white hue of the fruit-free classic lassi can change into shades of gold, pink, and green with the introduction of fruits like mangos, bananas, strawberries, and grapes. Of all the types, my favorite version is one less commonly found at shops: It’s infused with gondhoraj lebu, a fragrant lemon unique to West Bengal and Bangladesh.Since I’ve moved away from home to Mumbai, I’ve been missing the open terrace and my mother’s lassis—more so since the pandemic started. So I’ve started making my own.To make the classic sweet lassi, my mother used chilled homemade yogurt. She whisked it with milk using a wood churner until the blend grew frothy. Then she would sprinkle in sugar and a few strands of saffron and continue to churn until the crystals had dissolved completely and the lassi was ready to be served. While the handheld wood churner is the traditional tool used to retain the thickness of the yogurt, I’ve tweaked the method to make my life easier.I use store-bought full-fat unsweetened yogurt. I put 2 cups of chilled yogurt into a blender along with ¼ cup powdered sugar, 1 cup chilled milk, and a few ice cubes. Once fully blended, I pour the lassi into two glasses, garnish it with crushed almonds, cashews, pistachios, and raisins. Then I add a pinch of bitnoon, a.k.a. kala namak (black salt primarily harvested from the Khewra mines of Pakistan), to balance out the taste, though a bit of any salt will do if those aren’t available.Feel free to be creative and experiment! Add your favorite fruit before blending and play with the choice of garnish to discover your favorite variation.For me, when the summer sun is truly unrelenting, only a sweet lassi can fight the heat.Tania Banerjee is an India-based writer covering travel, food, culture, and art.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-28", "author": ["Condé Nast", "Tania Banerjee"]}