{"id": "cc200f659f287006b6c97d7ac57ce4af", "url": "https://www.bonappetit.com/story/legacy-of-edna-lewis", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "“Edna Lewis Was Unapologetically Herself the Entire Time” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture“Edna Lewis Was Unapologetically Herself the Entire Time”Three decades after its debut, In Pursuit of Flavor has been reissued. Chef Mashama Bailey explains why the cookbook remains so relevant today.By Hilary CadiganMarch 27, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWhen you ask Mashama Bailey who inspires her most as a chef, she doesn’t hesitate. The answer is always Edna Lewis: grand dame of Southern cooking, author of many cookbooks, winner of the inaugural James Beard Living Legend Award. Though Lewis passed away more than a decade ago, Bailey—a boundary-breaker in her own right (catch her on the first episode of this season’s Chef’s Table) and chef-partner at the Grey and the Grey Market in Savannah, Georgia—continues to find inspiration in the cookbooks she left behind. Among them, In Pursuit of Flavor, Lewis’s highly personal celebration of the South’s seasonality. Originally published in 1988, the book reissues today with a forward written by Bailey. We chatted with the Bronx–born chef about why she finds so much inspiration in Lewis’s legacy.Let’s rewind to the moment you first learned about Edna Lewis. How’d it happen?My first assignment of the first semester of culinary school was to write about a chef that inspired me. But this was probably 1999, and outside of Julia Child or the Frugal Gourmet, I didn’t know any chefs. So I was like, “Okay, I’ll just write about my grandmother because she was probably the best cook I knew: the one that introduced me to food and took me to Zabar’s and Katz’s when we first moved to New York City.”But my teacher said, “No, you have to pick an actual chef.” So I started looking for a black woman chef. I couldn’t find one. I couldn’t find any that were in restaurants and had a reputation. All the ones I was finding out about that were alive worked at Disney World, or hotels—these Five Diamond type of things.That world didn’t interest me at all. I didn’t want to wear the big toque on my head and I wasn’t interested in making ice sculptures. I just wanted to cook good food.Why do you think all of the black chefs were siloed at those types of restaurants?Maybe because people weren’t writing about or spending money on [traditionally black food]. Maybe they didn’t feel like an African American point of view was changing the culinary narrative, so they weren’t focusing on it. Maybe it was opportunity. I think a lot of black cooks decided to go into hotels because they had families to raise. So they stayed in the field but went for the benefits, you know? That was my observation.Chef Mashama Bailey at her restaurant, The Grey.\nPhotograph by Chia ChongSo what did you do?I went to the Schomburg Center for Research in Black Culture up in Harlem, and started digging. It was there that I found out about Edna Lewis.There was an article written about her, in the Washington Post or something, and I was just like, who is this woman? Then I realized what she had done: She was cooking in the ’40s and ’50s and all of these communists and writers and actors were really digging her food. And she was cooking the food that she grew up on. Southern food.That was really, really interesting to me because I didn’t see any black chefs cooking Southern food that was getting recognition. They were all cooking French, or German, or Italian. She was cooking food that resonated with her as a child. So I took that, packed it away, and held on to it.And your assignment?I still have a little essay that I wrote about her during that class, but I never really thought about it again. Until, as a chef looking for inspiration, I started unpacking parts of my life. Looking for things that really resonated with me, that had a story and a little bit of a history. I like to cook like that. The food has to mean something to me.Now that I’m cooking down in Georgia, people are always asking me how it is to be me, and how it is to be black, and having all of this recognition. And for me, Edna Lewis is just right there all the time.What about her did you relate to most?That she was a black woman, and that she cooked the food that she wanted to cook, and that she was the child of a former slave. Her family founded Freetown, Virginia. And she kept these traditions and celebrated the different times of the year with her food. We ate like that at home—we didn’t have a farm or anything, but on New Years Day we ate Hoppin’ John and collard greens, and in the summer, fried chicken and barbecue, and in the winter, grains. We ate with the seasons and I really liked that. When I think of a food memory, it really goes to a particular season.Reading through In Pursuit of Flavor, I’m struck by how much of Edna’s food is tied to memories—of her childhood, of her ancestors, of the days when food was purer and vegetables actually tasted like vegetables. What does that mean to you? How do you cook from memory—not just your own but that of your ancestors?Well, when I really started taking food seriously was after my maternal grandmother’s prime. It was just so flavorful. It smelled up the house and was just always…there. I remember how crispy the bacon was, and how long she would fry it. I remember the biscuits and the grits, and how she would make this pasta with ground beef and tomato and onion and cheddar cheese. She would cook it all day, so the pasta was overcooked, cooked into the sauce. That was the way she made spaghetti.It’s funny—a lot of her food growing up I didn’t like, because I wasn’t used to it. Like collard greens. I didn’t start liking collard greens until one day when I was 16 or 17, I went down to her house and she cooked collard greens with pigs’ feet in the pot. And I was like, “Holy crap.” They were gooey and rich and sumptuous, and there was this underlying umami. I didn’t even know that word then, but I had never tasted collard greens like that. From that pot on, I was hooked.Photo by Chelsie CraigDo you use that recipe today, in your restaurants?I don’t put meat in the collard greens we cook, but I put enough olive oil to replicate that feeling, to replicate that texture. I think that’s what it means to cook by memory: There’s a point when you eat something and you are like, that’s it! And then you are forever chasing that feeling. It’s a full body experience.Was it a particular sense of place—the South—that really connected you to both Edna and your grandmother? It seems like you often talk about the two in the same breath.I think initially, yes. Initially it was like, How are we related, what do we have in common? Okay, there’s this southern heritage, there’s this closeness to family, there’s this curiosity. We’re all kind of curious.I think Edna knew from a very young age what her role and her duties in life were. And I think that she went with the skills she had, and was introduced to the right people at the right time, and I have that in common with her. My whole entire career, even when it was hard, every step of the way I had people letting me know that I was doing the right thing. Like I was moving in the right direction, and I was supposed to be where I was.I started cooking late, at 26. I was like, oh man, this sucks, everyone is so much younger than me. And then all of a sudden something happens—I get a raise or a promotion or something like that. Every time I started doubting, I shook it off, put my head down, focused a little bit harder, and something else happened.The way Edna handled her career, and the way she handled success—I really want to emulate that. She was unapologetically herself the entire time.It’s kind of amazing that she was able to do that in the era she lived. Do you have any insight into how she was able to get around all the barriers that existed at the time?There was this person, John Nicholson, who was a friend of Edna’s and her husband’s, and went to her dinner parties, back in the ’40s and ’50s (same era as my grandmother). They would put the kids to sleep, and then sit down in the living room and play records and make gin cocktails and eat. In that sort of redcoat environment there were a lot of mixed races in the same building, and this guy who had a little bit of money was like, “Hey, I really like your food. Why don’t we open up a restaurant?” So they opened Cafe Nicholson [in 1948]. It was a very simple menu, I don’t even think it was written down: roasted chicken and soufflés and a salad, and that was it. People wanted her to make biscuits and do all of this other stuff, and she was like, “Nope, this is what I’m doing.”I met Edna’s sister Ruth, who is still alive, a year ago. She was saying how she used to help out in the restaurant and peel shrimp.Photo by Chelsie CraigWhat was that like, meeting Edna’s actual family?Oh, it was awesome. It showed how close and tight-knit they are. But it’s funny: they loved Edna but to them, she was just Edna. In the ’70s when she wrote her cookbook, they thought that was the height of her success. I don’t think they realized how she was making waves and changing people’s thoughts about black people cooking in this country, or how black people can elevate food in this country. I don’t even think she realized she was doing that. And now that she has passed on, there’s a stamp in her honor, a foundation in her honor. I think they’re kind of like, Holy crap, she was really important.Do you have a favorite recipe in the book? Anything that really resonated with you?Oh shit, probably one of her quail dishes. The quail with the grapes [Pan-fried Quail with Country Ham, pg. 101]. I always love cooking her quail dishes.What about ingredients? Any she introduced you to?Watercress. She loved watercress, and I try to use it every chance I get. A lot of chefs use arugula, but I think that watercress is very east coast, very American.What about cooking methods?When she makes her pie crust, she doesn’t let it get cold again; she makes it all the way through. And she doesn’t pre-bake the bottom, which allows the sauce from the fruit to soak into the crust. I had always been taught to blind bake the crust, but she doesn’t do that. Like with peach cobbler—when I blind baked the crust it didn’t come out as an old fashioned peach cobbler. So I’ll never do that again.What does it mean to you that this book is being reissued at this particular moment? Is there a message you take from it now that you didn’t before?Stay close to home, and don’t forget about the things your parents and your grandparents instilled in you. All of that stuff really, truly matters.I think as we grow older, we get to this phase in our lives where we’re trying to find ourselves, and when that happens we tend to forget about all the things that were put into us by our family. For me, Pursuit of Flavor is really about coming home, and remembering where you come from. It’s about not forgetting that every season has a reason and everything comes full circle.Buy it: The reissue of Edna Lewis’ In Pursuit of Flavor (with foreword by Mashama Bailey) is $20 on Amazon.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitCookbooksRead MorecultureI Was Searching for a Cook Who Looked Like Me—Then I Found Edna LewisBy Mashama BaileyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-27", "author": ["Condé Nast", "Hilary Cadigan"]}