{"id": "cc257e5f2ffbd62d07043774f1180034", "url": "https://www.bonappetit.com/story/tomato-galette-season", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "According to Instagram, It’s Tomato Galette Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAccording to Instagram, It’s Tomato Galette SeasonDoes it seem like everyone you know is making Andy’s tomato galette?By Emily SchultzAugust 9, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykFacebookTwitterEmailTomato season is a highly coveted time in the BA Test Kitchen. Every single staffer jumps at the chance to taste test recipes that make good use of bright red beefsteaks, sweet-as-heck sungolds, and juicy AF heirlooms. But of all the new recipes that we’ve developed for tomato season this year (the salsa to end all salsas! The tomato toast of 2019! The no-cook answer to puttanesca!?), there’s one that’s really taken off: senior food editor Andy Baraghani’s new tomato and garlic galette. Readers have been blowing us up on Instagram with their shots of the savory pastry. We’re here for the inspo, and thought you might be too.Moody in the best way possible:Instagram contentThis content can also be viewed on the site it originates from.1 different colored tomato=1 like:Instagram contentThis content can also be viewed on the site it originates from.Megan Thee Stallion can keep Hot Girl Summer because we have Hot Galette Summer:Instagram contentThis content can also be viewed on the site it originates from.Moment of appreciation for this crust:Instagram contentThis content can also be viewed on the site it originates from.Tomatoes have been waiting all year for this close-up:Instagram contentThis content can also be viewed on the site it originates from.Tomato Galette, but make it vegan:Instagram contentThis content can also be viewed on the site it originates from.May all of your galette crusts come out this flawlessly:Instagram contentThis content can also be viewed on the site it originates from.Blares bright red megaphone “IT’S TOMATO SEASON Y’ALL”:Instagram contentThis content can also be viewed on the site it originates from.Did Andy come into your home and art direct this light himself?Instagram contentThis content can also be viewed on the site it originates from.Important: Even BA Staffers are making the galette!Instagram contentThis content can also be viewed on the site it originates from.Taking a moment to appreciate each hand-picked herb gently placed atop this perfect galette:Instagram contentThis content can also be viewed on the site it originates from.So...you’re making the galette right?Get the recipe:Tomato GaletteA savory galette topped with peak season tomatoes, cheese, and garlic.View RecipeExplore Bon AppétitTomatoGaletteSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-09", "author": ["Condé Nast", "Emily Schultz"]}