{"id": "cc30c5f14800af629f9f77e3576e330e", "url": "https://www.bonappetit.com/story/happy-hour-with-al-pre-batch-old-fashioneds", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "How to Pre-Batch Old-Fashioneds—and Any Stirred Cocktail—for Maximum Party Portability | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Pre-Batch Old-Fashioneds—and Any Stirred Cocktail—for Maximum Party PortabilityRolling up to the party with a whole bottle of old-fashioneds is a power move.By Al CullitonApril 4, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically's resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.Okay, let’s say you’ve been invited to a party. The host says to “bring something to drink.” That’s pretty broad isn’t it? You’re probably going to default to wine. It’s easy, and who doesn’t love wine? But I’ve got a better idea, and it’s sure to make you the Party Hero you’ve always known you could be. You’re going to bring a bottle full of cocktails.The benefits of such a thing are many: You can do it ahead of time, you don’t have to stir or shake anything to order—you just pour the cocktail from a bottle—and you don’t have to go overboard and bring a whole bar set up with you.Any stirred drink can easily be turned into a bottle of cocktails—think Manhattans, martinis, and the like. But I’d like to draw your attention to a drink so elemental, so downright American that you’ll be hard-pressed to come across someone who will refuse it. That drink, my friends, is the old-fashioned.The old-fashioned was originally known as the Whiskey Cocktail because, well, at one point it was actually new-fashioned. It didn’t get its new old-fashioned name until the late 19th century, when it underwent a resurgence in popularity.The old-fashioned is an archetypal cocktail, and actually follows to the letter what is purported to be the first published definition of cocktail from 1806: just booze, sugar, bitters, and water. Typically it’s comprised of either rye whiskey or bourbon with a sugar cube or simple syrup, bitters, and ice.There she is, folks: the old-fashioned, in all her glory.\nPhoto by Chelsie CraigBefore we mix up this big batch of boozy goodness (eight servings, to be precise), we’ve got to make our simple syrup. For this application, I find that a richer-than-normal simple syrup is ideal due to its higher viscosity. That means it’s a two-to-one ratio of sugar to water instead of the usual one-to-one. Boil ¼ cup of water and add ½ cup sugar to it. Stir vigorously until sugar is completely dissolved. Set aside and let cool.Make sure you have all of your ingredients nearby: That’s a bottle of rye whiskey (Old Overholt is a great budget option), the rich simple syrup you just made, and bitters (Angostura, which you can find in most grocery stories, is classic here). Grab a liter bottle. The best kind are bottles that have flip-tops—they have myriad uses and you’ll never lose the cap—but any leftover bottle kicking it in your recycling bin (and washed!) that has a screw cap will work in a pinch. Using a funnel, pour in: 3½ cups of whiskey, ½ cup of water, 1½ ounces of syrup, and a whole ½ ounce of bitters. Prying the built-in dasher thing off the bitters bottle will make this easier. (If adding water to your cocktail seems weird, it isn’t! Dilution is exactly what we’re doing when we stir a cocktail. We’re not stirring these, so we’re going to add the water that would have been imparted by stirring with melting ice. Cool, huh?) Close the bottle and gently rock the contents back and forth a few times to combine. Add more syrup, water, and/or bitters to taste, but be sure to do so in very small amounts—the balance here is deceptively delicate. Chill in the fridge, or freezer if you’re hurting for time. You’re now the proud creator of not one but eight cocktails!All bottled up with places to go.\nPhoto by Chelsie CraigWhile your old-fashioneds get frosty, reflect on just how easy that was. Now that you know how to batch a stirred cocktail, you can do the same thing with Manhattans, Negronis, martinis, and all their many variations and relatives. Simply multiply your cocktail recipe by eight and add ½ cup of water to dilute. If the drink contains bitters, start small and scale up. Adjust sweetness and add water to taste.Now go about gathering some accoutrements like citrus or brandied cherries; bring what you need to finish your garnish, too, like a vegetable peeler for making citrus twists or some toothpicks. You’re ready! Grab your now-cold bottle, throw everything into a tote, and be on your way. (You’re going to want to get a bag of ice en route because there’s a good chance your host doesn’t have enough of it. Just saying.)The old-fashioned setup.\nPhoto by Chelsie CraigAll right, you're at the party, poised for greatness. To serve your old-fashioned, fill a rocks glass with ice, pour in about 3½ ounces from the bottle (it’s okay to eyeball at this point, because the ratio will be perfect regardless), and garnish with whatever you brought: orange slices, brandied cherries, and/or lemon or grapefruit peels. So festive!Pour an old-fashioned for yourself and one for your host. And then just let it happen. Prepare some gracious replies for all the compliments you’re going to get. Look at you, Party Hero!More Happy Hour with Al, right this way:3 Campari Cocktails You Don't Need a Gazillion Ingredients to MakeHope you’re thirsty! Introducing Happy Hour with Al, Basically’s new no-nonsense cocktail column.View StoryExplore Bon AppétitBasicallyHappy Hour with AlRye WhiskeyCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-04", "author": ["Condé Nast", "Al Culliton"]}