{"id": "cc3d31a7868f0ca6a227b2720e50d1aa", "url": "https://www.bonappetit.com/story/never-fail-chicken-and-rice-soup", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "This Chicken and Rice Soup Is Capable of Curing Any Bad Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Chicken and Rice Soup Is Capable of Curing Any Bad DayWhen things go to s***, I make this soup.By Rachel KartenJanuary 19, 2018FacebookTwitterEmailLaura MurrayFacebookTwitterEmailWelcome to Never Fail, a semi-regular column where we wax poetic about the recipes that never, ever let us down. This week: the chicken and rice soup recipe that social media manager Rachel Karten couldn't live without.There are lots of ways to cure a Bad Day. Crush it at the gym with your #fitfam. Mindlessly watch Seinfeld reruns. Call your parents. Pour an XL glass of wine. Take a bath. And while I support all of these options, my favorite way to turn the tide on a particularly shitty day is to make this soup.Boss get mad at you for not doing that thing? Chicken and rice soup. The person you went on two dates with suddenly not texting you back? Chicken and rice soup, baby. Lose your credit card on your way to go pick up your debit card at the bar (yes, this just happened to me)? Chicken and rice soup has got your back.The point is: this soup is the MOTHERFREAKING cure. First, it’s got the always-comforting combo of warm broth and rice. The sweet-ish ginger topping is unexpected and delightful. The Thai green chiles are a nice reminder that your mouth can hurt more than your heart. And it’s super easy to make!First off, everything in this recipe happens in one pot. (Did you hear that, people who use Pinterest?!) The stock is made using the boxed stuff and actual chicken, shallots, and garlic so it develops really intense flavor. And once the chicken is cooked through (around 25 minutes) you remove it and shred it, discard the shallots, and mash up the garlic to return to your stock.Having a case of wine around helps, too.\nPhoto by Alex LauOkay, this is my favorite part—and not because by now I’m usually at the Call Me By Your Name soundtrack portion of my Sad Day™ playlist—but because the rice goes RIGHT into the pot with the stock mixture. Not only do you save yourself having to clean another dish, but you also get perfectly-cooked, tender rice that thickens the soup in the most magical way. Once the rice is cooked (usually 35 minutes) you stir in a kicky combination of lime juice and fish sauce, along with that chicken you shredded earlier. When everything is all warmed up, put it in a bowl and top with a whole bunch of ginger, chiles, scallions, and peanuts. Take a deep breath: Everything is going to be alright.Look, I’m no doctor. Or therapist. Or self-help book author (one day!). But I know that when my day goes off the deep end, making this soup is the one thing that can get me back on track. And, sure, it doesn’t hurt to pair it with an XL glass of wine and a Seinfeld marathon.Get the recipe:Chicken and Rice Soup with Green Chiles and GingerThis chicken and rice soup has everything we're craving, plus a big handful of crushed peanuts on top.View RecipeExplore Bon AppétitNever FailChickenSoupRiceBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-19", "author": ["Condé Nast", "Rachel Karten"]}