{"id": "cc3e0cd31e553a47be06c8d2de437dfb", "url": "https://www.bonappetit.com/recipe/golden-fried-rice-with-salmon-and-furikake", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Golden Fried Rice With Salmon and Furikake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueGolden Fried Rice With Salmon and FurikakeBy Lucas SinAugust 18, 20204.2(58)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrint“Growing up, I watched Shin Chūka Ichiban!, an anime about a kid battling cooks in China,” recalls Chef Lucas Sin of Junzi. “In one episode he coats rice in egg yolks before stir-frying. I was like, WOW. Golden fried rice comes from Chinese imperial cuisine, which sounds fancy but is home-cook-friendly. Take leftover rice, stir into yolks, and throw in whatever you want—it’s adaptable. The yolks separate each grain into a capsule of flavor, so you get superb fried rice. That generational knowledge is legit.”Ingredients4 Servings4large eggs4cups chilled cooked short-grain white rice5Tbsp. vegetable oil, divided, plus more for drizzlingKosher salt112-oz. skinless, boneless salmon fillet, cut into 1\" pieces11\" piece ginger, peeled, finely chopped½small onion, finely chopped1tsp. sugar4scallions, white and pale green parts finely chopped, dark green parts thinly sliced, separated3garlic cloves, finely choppedFurikake (for serving)PreparationStep 1Separate egg yolks from whites, placing yolks in a medium bowl and whites in a small bowl. Add rice to bowl with yolks and mix to break up any clumps and coat each grain with yolks (take your time with this as any clumps will cook together); set aside. Stir 2 Tbsp. oil into egg whites and season lightly with salt.Step 2Heat a dry large nonstick skillet over high. Add egg white mixture and cook, pushing around constantly with chopsticks or a heatproof rubber spatula, until gently set, about 30 seconds. Transfer to a plate. Wipe out skillet if needed.Step 3Heat 1 Tbsp. oil in same skillet over medium-high. Season fish with salt and cook, undisturbed, until golden brown underneath, about 2 minutes. Turn and cook just until lightly browned on the other side and opaque throughout, about 1 minute. Transfer to another plate. Wipe out skillet.Step 4Heat 2 Tbsp. oil in skillet over medium-high. Cook ginger, stirring, until very fragrant, about 20 seconds. Add onion and season with a pinch of salt. Cook, stirring, until onion is translucent, about 1 minute (remove from heat if onion starts to go past golden brown). Add reserved rice mixture, sprinkle with sugar, and season with salt. Toss to combine, then cook, undisturbed, until rice is beginning to warm and crisp underneath, about 1 minute. Push some of the rice to the side to clear a few inches in skillet. Drizzle a bit of oil into the clearing. Add scallion white and pale green parts and garlic and cook, stirring, until just softened and fragrant, about 45 seconds. Toss into rice mixture and cook, tossing occasionally, until warmed through and rice is crisp and chewy, about 3 minutes. Return cooked egg whites to pan and cook, tossing and breaking up with spatula until distributed. Return salmon to pan and toss once to combine.Step 5Divide among plates and top with furikake and scallion greens.How would you rate Golden Fried Rice With Salmon and Furikake?Leave a ReviewTell us what you thinkReviews (35)Back to TopTriangleOMG, I just made this on  a whim because I had most of the ingredients on hand. It was THA BOMB. Couple of modifications to adjust for being a solo diner and this being a pantry meal:\n* Used about half a container of leftover Chinese takeout rice\n* Reduced eggs to two, which both coated the rice and led to the perfect (generous portion)\n* Had leftover salmon filets - already cooked - just heated one up in the same pan (after frying egg whites but before other steps) and then shredded. \n* I keep a jar of ginger/garlic combo on the refrigerator door - perfect application. Easier than mincing and shredding. (For a group I would go fresh, but in a pinch this makes it super easy).\n* Had no scallions on hand. I think they would have been a delightful addition, but in no way did I find the dish lacking without them.\n* Contrary to another poster's complaint, the rice cooked to a lovely shade of yellow from the yolks. I did leave it cooking a bit longer than 1-3 minutes to make sure I got some caramelization and crunchy bits.\n* Stirred in a small spoonful of chili crisp, which I would marry if I could\n* Topped with furikake, agree with poster who said it's a critical ingredient.\n\nThis will definitely join the ranks of refried rice and kitchen sink vegetable soup as one of those recipes which clears out the fridge and pantry, doesn't require much time or skill, and tastes way more complex than it is to make. I expect it will also become one of those family favorites that is a little different each time we make it, based on whatever is on hand.MarilynWashington, DC2/4/2022I've made this twice and have learned as others have that upping the garlic and ginger improves the end result, as well as using chili oil, sesame oil, or whatever condiments you prefer to add flavor.  Last night I sub'd mahi mahi fillets - used the frozen ones courtesy of costco and that worked fine.  I'd used shrimp the first time out which was also great.  The golden colored rice is beautiful!  This time I also upped the eggs by 2 because I had lots of thawed white rice to use up!  Though I learned that having more rice makes it challenging to fry it properly;-)  I also added a red bell pepper for additional flavor and color. This recipe is great for teaching the need to prep everything prior and the need for cooking ingredients in sequence.  I love this dish for leftover lunch fare! KristinPortland, Ore9/6/2021This recipe is terrific and a welcome change from all those greasy takeout fried rices that we all have had. I never understand when people complain that a recipe is bland. MAKE IT NOT BLAND.  You are coming to a cooking site, TASTE IT AS YOU COOK IT. If you want it spicy, add sirracha, Sambal, chili oil etc. Add salt, soy sauce, sesame oil. Increase garlic or ginger. It makes you a better cook.Michael GProvidence, RI3/19/2021This recipe is the ultimate Asian comfort food. Furikake is definitely not optional and make sure to generously season your salmon. I also added shichimi togarashi for a bit more of a kick.Anonymous3/4/2021What are the white clumps in the photo? They look like feta and I don't see anything in the recipe that explains. Carmen C.Brooklyn, NY2/20/2021Thankfully I tasted while it was on the stove--note to self, ALWAYS read the comments more in depth. \n\nAnyway, added rice vinegar, honey, soy sauce, and fish sauce. Also upped the ginger and garlic ratios. End result was quite tasty, will make sure in the future to add some shrooms and make a glaze for my rice.AnonymousPittsburgh, PA2/16/2021More of a project recipe than I expected (my usual fried rice is a leftover's dream) but once everything was prepped it came together nicely. The fish took a little longer than the recipe states. Unfortunately I couldn't find furikake at the store so bought some seaweed snacks and toasted sesame seeds as an alternative. Delicious with a drizzle of gochujang. Going on my roster!Izzy SiedmanPortland, ME11/26/2020I really loved this dish. Made as written, with the exception of using a wok instead of a skillet (which worked well). Mark Bittman had already convinced me of the wonders of furikake, so we had some (Seto Fumi) in the house. It really makes the dish - I can see how reviewers were underwhelmed without it. Might have been even more delicious as leftovers the next day, sitting overnight seemed to have brought the ginger forward. Definitely have everything prepped in advance, comes together really quickly once you're cooking. Season generously along the way.ArianeRochester,  NY11/16/2020First I made matsutake gohan, cooking rice in dashi, soy, sake, mirin with sliced matsutake mushroom steaming on top. Then  I made this dish with the gohan.  The layering of fish flavor (dashi, salmon, furikake) and intensely flavored matsutake made this one of the best Asian dishes I've ever produced.  Given other comments, it seems wise at least to cook the rice in dashi. That I had both dashi and homemade sort-of-furikake (bonito flakes left over from making dashi and crumbled nori) was kind of a miracle.AnonymousWinthrop WA11/11/2020I had no idea what furikake is (and of course, there is no explanation, but never mind, I will google it). Nevertheless, I went ahead with the recipe because I was intrigued by the concept of coating the rice in the egg yolks. I added chopped celery and snow peas, for some veggies, but otherwise stuck to the recipe. I'm sure furikake will improve it greatly. As it is, we added salt, pepper, and a drizzle of sesame oil and loved it. However, I didn't note any difference in the rice, which ended up not being golden at all once it was cooked. So that was disappointing.debnevRedding, CT10/2/2020I made this tonight and enjoyed it. Since seasoning is basic, it’s all about technique and of course, salt. After reading previous reviews, I thoroughly salted my salmon and also added a couple shakes of pepper. I salted the eggs as recommended and gave the rice a brief salting when I added it to the pan. I also gave my rice an extra step or two of crisping to add in more flavor. As with any dish, you should taste before serving to see if any additional salt is needed. Also, since there are minimal components you cannot skip the green onion or furikake. I do not recommend making this dish, unless you use all ingredients. Expect simple yet satisfying flavors!CantStopCookingChicago, IL9/29/2020Delicious! You have to have an eye for salting with this one though—don’t be shy, definitely shake it on there during the seasoning steps. Also the furikake adds a delightful and needed touch at the end. I subbed steelhead trout instead of salmon and used a red instead of a white onion, but otherwise followed exactly as written (I had to cook a little longer than the estimations for some steps, but following the descriptions rather than just watching the clock helped). It is good on its own, but I also tried adding a little drizzle of teriyaki to a serving which was delicious too. AnonymousSeattle, WA9/29/2020Soooooo bland. The technique intrigued me, but the result tasted like nothing. AnonymousColumbus, Ohio 9/22/2020I am reasonably familiar with a lot of Asian ingredients, but until I saw this recipe, I had never heard of \"Furikake\". Could someone please tell me just what it is, before I make the recipe? May thanks!AnonymousMadison, Wisconsin9/21/2020Are the folks leaving bad reviews Asian? Or are they just Americans used to the soy sauce flavored stir fried rice served at Panda Express and school lunches? I was taught to make a stir fry in a similar way -- minimal on the soy sauce, which is more for color, and rely on your aromatics (ginger and garlic, plus the scallion/green onions towards the end) for flavor. Use leftover refrigerated rice if possible so they're not moist and fry the grains of rice until they're hopping from the heat. This was the first time I've tried coating the rice with the egg first though. I made this with some cheap salmon belly and got good reviews from my non-Asian boyfriend (thankfully).AnonymousModesto, CA9/20/2020Explore Bon AppétitFried RiceAsianEast AsianChineseRiceRice & GrainsSalmonFishSeafoodQuickEasyWeeknight MealsMainGluten-FreeDairy-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Lucas Sin"]}