{"id": "cc65b011992feca0979de3b91040039c", "url": "https://www.bonappetit.com/city-guides/montreal/venue/nora-gray", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Nora Gray Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealNora GrayThe standout Italian restaurant in GriffintownFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for Southern Italian fare—and a moment of zen. Once you walk inside Nora Gray, you'll feel a calm wash over you, thanks to a lovely hum of conversation, warm candlelight, and your first glass of wine.ORDER THE: pasta! There are only three selections each night and can range from simple local produce tossed with lemony handmade fusilli to ravioli stuffed with duck heart. But to start, get any of these if you see them on the constantly changing menu: a slab of warm focaccia; pesto-and-tomato topped burrata; fluke crudo garnished with potato chips; whichever perfectly dressed salad catches your eye; and the juicy pork chop with braised cabbage, rabbit sausage, white beans, and a pool of au jus. After that, you should still save room for dessert, like the sugar-tossed doughnuts with rhubarb curd, the intensely chocolaty pot de crème, or a fruity ricotta tart.THE VIBE IS:  intimate and welcoming. It feels like home, if your house has sleek black leather booths, a beautiful long wooden bar, romantically dimmed but not-too-dark lights, and handmade pasta readily available. Service is attentive and the staff is all knowledgeable, so make sure to ask them about their favorite dishes. Bonus: Nora Gray is only a seven-minute walk from the Bell Centre, meaning you’ve got a better option than late-night poutine after catching a concert or a Canadiens game.PRACTICAL STUFF: Open Tuesday to Saturday 5:30 p.m. to 11:30 p.m.—Alyse WhitneyPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVEFoxyA perennially packed wood-fired hangout in GriffintownElenaPizza and natural wines go hand in hand at this Saint-Henri pie shopCafé OlimpicoGet your caffeine fix at this Mile End espresso shopExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Alyse Whitney"]}