{"id": "cc6540fe65b3f3dee10ad5e163ab22f9", "url": "https://www.bonappetit.com/story/what-is-a-donut-peach", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "What is a Donut Peach | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Is a Donut Peach and Why Are They Everywhere Right Now?Call them UFOs, Sauzee Swirls, or Flat Wonderfuls—flat peaches are taking over the world one market at a time.By Sarah JampelAugust 24, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis summer’s been called The Summer of Sleaze, of Rage, of Missing Out, and of Scam. Might I be so bold to throw my hat into the ring and call it The Summer of the Donut Peach?Okay, so maybe it’s a stretch, but I’ve seen more squat, pancaked peaches—which are sweeter, milder, and less fuzzy than their spherical sibs—this year than ever before. What once seemed like a rarity, sold at only the fanciest grocery stores (when Florence Fabricant wrote about “a new kind of white peach” sold at Grace’s Marketplace in 1993, she called the fruit “juicy and luscious” though “peculiar” and “positively deformed”) has become commonplace: crates piled high at the farmers’ market, clamshells for sale at Whole Foods and on Fresh Direct. I love their name, their look, and their feel, and I can't leave the market without buying at least one for each palm.With such a funny shape (they’re like the Persian cats of peaches), you might assume there’s some funny business going on with their breeding. But flat peaches aren’t genetically-modified oddities at all: They’re the descendants of wild pan tao (also called peento) peaches from China, which were introduced to the US nearly 150 years ago. It wasn't until the ‘60s and ‘70s, however, that scientists at Rutgers New Jersey Agricultural Experiment Station hybridized the plants to produce hardier, frost-resistant trees with bigger, sweeter, peachier fruit. They called the fruit, low in acid and high in sugar, the Saturn (you can guess why).Jerry Frecon, now a horticultural consultant and Rutgers professor emeritus, worked with Dr. Fred Hough to develop Saturn at the Agricultural Experiment Station, then, in the ‘80s, brought the variety to Stark Bro’s Nurseries and Orchards Co. in Missouri, which purchased the license to grow and sell the trees.Though the trees were originally intended for home gardeners, flat peaches growing in Washington were eventually brought to the attention of Frieda’s Specialty Produce, the company credited with making the produce section of the American grocery store infinitely more colorful and flavorful (they introduced spaghetti squash, kiwi, alfalfa sprouts, and hundreds of other fruits and vegetables to the US market). Karen Caplan, Frieda's President and CEO and daughter of founder Dr. Frieda Caplan, remembers sitting in the conference room when a salesperson representing the farm pulled out the flat peaches. \"Oh my God! They look like doughnuts!\" And so the peach was named. In 1986, Frieda's Specialty Produce trademarked the Donut name and enjoyed exclusivity as the flat peach purveyor for about a decade. With its juicy sweetness and eye-catching shape, \"the Donut Peach \"was a dream come true,\" Caplan told me. \"It was just a darling.\"When the Stark Bro’s' license for the Saturn peach expired in the early 2000s, more farmers were able to grow flat peaches than ever before, opening up the market and putting flat peaches in more stores. And since those early days, many more varieties of trademarked flat peaches have been introduced in US markets—Frecon estimates there are 15 to 20 kinds in this country, and many more around the world—as people have grafted and hybridized. You’ll find Galaxy, UFO, TangoOs, BuenOs, Sweet Bagels, Sauzee Swirls, Flat Wonderfuls, and Peach Pies, just to name a few. (The Stark Bro's stopped selling Donut Peaches in 2009, when it became economically inviable for their supplier to keep growing them.)You could sneak a donut peach into this peach lassi sorbet.\nAnd while the original Saturns had easily removable pits, with pink skin and white flesh, there are now flat peaches with yellow skin, or yellow flesh, or stones that cling. Flat nectarines, which will soon be introduced to the New Jersey Breeding Program, are already grown and distributed as the oblong Nectapie by California’s Family Tree Farms.Insert flat peach here.\nPhoto by Ted CavanaughWhen Lou Terrulli of Baldor Specialty Foods, one of the largest distributors of produce and specialty foods in the Northeast and Mid-Atlantic, first encountered flat peaches in the ‘90s, he was struck by their small stature, high sugar content, and short growing window. These days, the demand is high, he imagines, because people “learn about something today and can have it tomorrow.” More growers are finding the need to put [flat peach] trees in their orchard to supply the ‘Baldors of the world.”Of the three farmers I spoke with at the Union Square Greenmarket, two had started growing flat peaches in the past five years. Since they’re susceptible to blight and finicky in their development (the skins split as the peaches grow outwards), they demand a higher price. For that reason, Frecon explained, “they have to have really good flavor. If they don’t, people aren’t going to pay extra money for them.”One particular farmer at Union Square named Joe, who requested that I not mention his last name or his orchard, has been growing flat peaches for ten years. When I asked him which of the three varieties at the stand (yellow-fleshed donuts, white-fleshed donuts, and greenish-skinned mango peaches) was his favorite, he explained that he thought all were silly. They’re good snack-sized fruit for kids, he told me, but “if you’re an adult you should be eating regular peaches.” (Self-sabotage.)This adult, however, finds donut peaches irresistible. Brilliant marketers, you win! And while most peach experts I spoke to agreed that the novelty of a smushed peach might wear off (particularly if the flavor can’t keep up with the price), I want to make it clear to any horticulturists out there reading this story: I would buy a flat plum and a flat apricot. Flat cherry? I’ll pass.Explore Bon AppétitHealthyishPeachShoppingRead MorecookingHow to Buy Peaches, Plums, and Other Stone Fruit at the MarketBy Rochelle BilowRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-24", "author": ["Condé Nast", "Sarah Jampel"]}