{"id": "cc6b0399deb029095db3d01532e40247", "url": "https://www.bonappetit.com/story/zha-cai", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Dear Pickle People, Zha Cai Should Be Your Favorite Condiment | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingDear Pickle People, Zha Cai Should Be Your Favorite CondimentI eat this fermented mustard stem with noodles, in congee, and straight out of the bag.By Karen YuanSeptember 14, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.In Beijing my grandparents kept a giant jar in the back of the fridge. It was crammed with misshapen greenish vegetables drenched in brine. When they brought it out and opened its lid, a wild, chaotic aroma perfumed the room: the pungence of long-fermented zha cai. It’s one of the most Chinese smells, and since I was a child it’s been one of my favorites.Zha cai is the pickled stem of mustard plants. It originates in Chongqing, a municipality in the Sichuan area. Don’t let its odd knobbly humble appearance deceive you—a tiny bite of this preserved vegetable packs a powerful combo punch of tanginess and umami, and the texture is crunchy yet tender, not dissimilar to a cucumber. It varies in spiciness depending how much red chile paste is used in preparation. All that flavor comes from salting, drying, and seasoning mustard stems with said chile, then packing them into vats with more aromatics like garlic, soy sauce, ginger, and sugar to ferment. It is a pickle to end all pickles.Photo by Isa ZapataZha Cai$6 at Walmart$8 at AmazonI’ve always been surprised at the scarcity of the dish outside of China, where it can be found in home kitchens, restaurants, cafeterias, and grocery stores. But I’ve had luck scavenging for packets of ready-shredded zha cai from the Chongqing brand Yuquan in small Asian grocers. I spot it by its spring-green foil packaging, emblazoned with Chinese characters (鱼泉榨菜, or “yuquan zhacai”) and English text (the much vaguer “PRESERVED VEGETABLE” in uppercase letters). There’s also a sketch of a Chinese town I presume is Yuquan itself. It may not have the immediate zing of zha cai from a jar, but the compactness of a sachet makes it easy to take along for a quick bite while traveling, on picnics, camping trips, and train rides. It instantly transforms any meal into something flavorsome.You can add Yuquan zha cai to anything for a salty-sour kick (it’s barely spicy), but I find it especially handy for flavoring carbs. I’ve mixed a packet into noodles with Sichuan peppercorn and chili oil, scattered it on congee among scallions and salted mackerel, and topped plain old bowls of rice with it. I use it to boost veggie and meat stir-fries and add an elegant zest to silken tofu. I whet my palate with it as an appetizer on its own. And, because I’m obsessed with sodium, I occasionally pluck it straight out of the pouch like a bag of chips. Don’t knock it until you try it.In Chinese, zha cai literally means “pressed vegetables.” More than a hundred different varieties of Chinese pickles exist, including cabbages, radishes, and plums—but this is only one I know literally named after said pickling process, like how a pickled cucumber is simply called a pickle. That should tell you something about its ubiquity in China. It’s time for fermentation fans abroad to give it its due too.Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Karen Yuan"]}