{"id": "cc7407f88bf18ffe58a8f51520b9bde4", "url": "https://www.bonappetit.com/story/upcycled-snacks", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "9 Delicious Snacks Made From Upcycled Foods and Ingredients | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingSurprise! Upcycled Foods Are Way Better Than They SoundWe taste-tested 9 brands that are turning supply chain trash into snacking treasure.By Maggie LangeOctober 27, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Rachael Mamane first remembers seeing the term upcycled applied to food about a decade ago. “It acknowledges that our food system is a problem,” says Mamane, whose former company, Brooklyn Bouillon, reduced agricultural waste by selling delicious broth made of ordinarily discarded animal bones. She sees upcycled snacks—a burgeoning category of food products made from would-be-wasted ingredients—as the industrial food complex apologizing for its extravagance. “We are observing a process that ends in waste and identifying a use for that waste,” Mamane says of the scraps and by-products marketed in perky packages. Of course, for consumers to buy into the movement and its suite of thrifty products, vendors need to convince the public that what they’re selling is delicious food, not repackaged trash.In the past several months, she’s noticed a power surge of the term: on snack packs of fruit rinds with cheeky names, boxes of crackers manifest from veggie pulp and peels, and bags of fried puffs made from discarded potato skins. According to a 2019 Forbes article, the upcycled food industry is worth about $46 billion dollars and growing 5% annually. And in April the first third-party-verified certification mark for the category, Upcycled Certified, emerged to help customers easily recognize these climate-friendly products. Turner Wyatt, CEO of the Upcycled Food Association, the organization behind the new logo, says newfound consumer awareness drove the decision to give upcycled food a strict definition: Any food that otherwise would not have gone to human consumption, is procured using verifiable supply chains, and has a positive impact on the environment.Within the confines of that definition, “upcycled” is conveniently flexible. It can be specific or all-encompassing, earnest or vague—even misleading. Emma Chow, project lead on the Ellen MacArthur Foundation’s Food initiative, which strives to eliminate food waste, points to “ugly” fruits and vegetables as ingredients that were being upcycled long before the term existed: A squashed tomato has always become ketchup, and no one ever knew it was less than beautiful as they squirted sauce onto their fries. “We might be overplaying how much food we’re saving from waste, when it’s always been used for other purposes,” Chow says. In other words, scraps all gussied up in proud new packaging is well and good, but conserving imperfect edibles is a practice as old as time.Chow is, however, particularly enthusiastic about another category of upcycled food: one that uses new technology to transform inedible byproducts into something edible. She’s talking about companies like ReGrained or EverGrain that make flour out of spent (but nutrient-rich) brewer’s grain. But no matter the process (or lack of process, if it’s just rescuing a squashed tomato), Chow says that any effort to divert food that was otherwise headed toward the landfill or incineration is a worthy “solution [to] keep it in use for human consumption.”When chef Jehangir Mehta founded his now-closed restaurant, Graffiti Earth, in 2016, he sought to focus on ingredients that would have been wasted. Some days this involved transforming spent coffee beans into a cold-pressed espresso ice cream. On others he collected bits and bobs from high-end restaurants that would use only a small part of a vegetable in a dish. Despite being a devout upcycler, Mehta is amused by the term. When he came to the U.S. from India in the 1990s, he was shocked at how much food ended up in landfills. He wasn’t accustomed to such a culture of waste, he says. Where he grew up, if there were scraps, you found a way to eat them. “It was such a natural way to use ingredients, it didn’t strike me as upcycling,” he says.While the everyday salvaging Mehta describes isn’t necessarily novel, the success of upcycled products represents a meaningful attitude shift among consumers and producers. Mehta, who now works with food sustainability group Chefs for Impact, hopes that with a long overdue reckoning about waste and growing concern around what we eat and how it affects the planet, the practice of upcycling will keep growing to a point where the marketing term becomes unnecessary. It will just be obvious. “Like, my kids know that smoking is bad for you,” he explains. “No one has to tell them.”The spirit behind upcycling—“Making the most of food,” says Chow, like our ancestors have always done—is a solid one. But there’s still a crucial concern: Do upcycled foods taste good? I tried nine brands to find out.To the taste test!Blue StripesWhat is it? This cacao-lovin’ company exists solely to find ways to employ the whole seed—shell, pulp, and beans—in a suite of snacks. Its granola, for example, uses flour made from the cacao shell, and the cacao water is “milked” (sorry) from the juicy white pulp surrounding the beans.What does it taste like? Blue Stripes is the most consistently delicious of all the upcycled brands I tried. The cacao water is sprightly and sour, like a slightly sharper coconut water. The Nutella dupe is rich and nutty in the best way. And the granola, like the best parties, has a slightly unexpected mix of players (chocolate! poppy seeds! pumpkin!) and a cozy vanilla warmth that makes everyone play nice.Cacao Hazelnut Butter by Blue Stripes$15 at Amazon$16 at Thrive MarketWhole Cacao Granola by Blue Stripes$15 at Amazon$13 at Thrive MarketSpudsyWhat is it? Spudsy collects sweet potatoes that are landfill-bound due to perceived cosmetic flaws like shape, size, or color. They dry and grind the rescued bounty into flour, which is used to make the brand’s line of puffed snacks.What does it taste like? “Vegan junk food” is one of my most cherished snack categories, and Spudsy is now in my top five. Its Cheese Fry flavor is an uncanny mimic of Annie’s Mac and Cheese in the form of a hard, crunchy bite—a taste I will now crave forever. The flavors are brash, salty, and assertive. In other words: the ideal road trip snack.Spudsy Sweet Potato Puffs$11 at AmazonFancypants Upcycled CookiesWhat is it? This cheery cookie brand has released three new upcycled flavors: Vanilla Oatmilk, which uses flour made from oat milk waste; Chocolate Chip, which is made from okara flour (a tofu and soy by-product); and Double Chocolate Chip, which repurposes flour from coffee cherries (the fruity pulp surrounding coffee beans).What does it taste like? The first ingredient listed on the label is sugar, and, gird your teeth, these cookies are sweet. “Very Chips Ahoy!” is the review from my partner, the resident sweet-tooth of the home. Dry, compact, crumbly, ubiquitously pleasing in a nostalgic way, but would we be wrong to say they’re a little middle-of-the-pack?Upcycled Chocolate Chip Cookies$20 at AmazonGoodfishWhat is it? This snack company sources sockeye skins from an Alaskan wild-caught salmon supplier with responsible practices. The would-be-discarded skins are dried and then fried into perfectly crunchy, lightly salted morsels that, frankly, wouldn’t be out of place adorning the third course in a fancy tasting menu. They’re shelf stable too, not that they last long in my house.What does it taste like? The “crisps” (we shan’t call them skins) are firm enough to make each bite feel like a toothsome little adventure and definitely rigid enough to dip and dunk as you please. The flavor of salmon was a little hidden behind the salty curtain, but the variety I tried, Miso Teriyaki, was mild and a little smoky. Overall, these babies are very avant-garde, very nonconformist.Crispy Salmon Skin Chips$25 at AmazonI Am GroundedWhat is it? An Australian snack bar company that makes (caffeinated!) energy bars using upcycled coffee cherries sourced from small farms in the Coffee Triangle of Colombia.What does it taste like? I take an energy bar with me every time I go on a long bike ride, but they are emergency calories I hope to never eat because I hate bars. But these bright, confident, and summery, even—totally changed my mind. Their 9AM bar, my favorite flavor, was lemony, nutty, and not too sweet. They’re a far cry from the dank sludge I associate with coffee leftovers.Shop I Am GroundedCandid NoonsWhat is it? Like Blue Stripes, Candid uses the whole cacao fruit to make Noons, its semi-spherical chocolate bites.What does it taste like? The greatest chocolate devotee I know reported back that these bites—made from cacao beans as well as the fruit pulp—don’t quite satisfy “the chocolate craving.” But this doesn’t stop them from being a delight all their own! The Cacao & Quinoa Crispies pack my ideal one-two punch: velvety chocolate studded with crunchy bits.Candid Noons Cacao Crunch Bites$20 at Amazon (6-pack)$4 at HiveReGrainedWhat is it? This company is all about transforming spent barley malt leftover from beer brewing into products like pastas, cookie dough, and puffed snacks. Testament to its groundbreaking work, ReGrained’s innovations sell out pretty quickly; those puffs I tried will be out of stock soon, and the pasta is available now for a limited time.What does it taste like? The ReGrained Puffs aren’t exactly pillowy to the bite, but they won’t sharpen your teeth either. Each little nugget is coated in enough seasoning dust that it leaves the slightly suspicious impression of “covering something up.” But complaints stop her because sustainability is super fun and so are the flavor combos: Mexican Street Corn (a little hint of lime!), Texas Pit BBQ, and Urban Garden (a major garlic party).ReGrained Upcycled Snack Puffs$25 at Amazon (Pack of 3)RindWhat is it? Rind tells it to you straight: They use all parts of the fruit, including the rinds, dried and packaged into snack bags.What does it taste like? While I find this to be the case for many dried fruits, the intensity of the rinds in these snack bags imparts a holiday potpourri aura. As a general fan of perfumey stuff, I was into the floral notes and the taut bites of unusual fruit parts. I particularly adored the kiwi, which boasts a deep tang that won’t quit. Despite including literal rinds, most of the varieties I tried have the chewy, leathery bite of the regular dried fruit you know and love.Rind Snacks Tropical Blend$20 at Amazon (Pack of 3)$6 at HiveSecondsWhat is it? This cracker company collects upcycled carrot pulp and peels from manufacturers who make juice, sticks, and other carrot-y snacks. They then dehydrate and grind these leftovers into flour, which is used for baking.What does it taste like? The very hardy crackers are mild and earthy, which reminds me of everything I love about hearty and humble root vegetables. Like anything sturdy, they’re basically asking to bear some weight, which I recommend in the form of hummus or another soft, saucy condiment. I think this deference and durability is an asset in crackers, especially if you want to serve them with an attention-seeking cheese or a personality-packed quince jam.Seconds Variety Pack$36 at SecondsExplore Bon AppétitShoppingSustainableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-27", "author": ["Condé Nast", "Maggie Lange"]}