{"id": "cc7d92d6e42dbca64e477b5a0ed8a007", "url": "https://www.bonappetit.com/story/dinner-party-worthy-sheet-pan-chicken", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "Sheet-Pan Chicken That's Dinner Party-Worthy? It's All About the Marinade | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDinner Party-Worthy Sheet-Pan Chicken? It's All About the MarinadeChicken, cauliflower, zingy chutney, and one simple yet highly effective ingredient make for a one-pan dinner that’s anything but one-note.By Hilary CadiganNovember 28, 2018FacebookTwitterEmailFacebookTwitterEmailLet’s start with a fact, because facts are all we can count on in this cruel world (kind of). The fact is this: Yogurt is the best meat marinade there is. Why? Well, science. Unlike some acidic marinades—your vinegars, your citrus juices—yogurt contains microbes and lactic acid, which peerlessly break down proteins and tenderize meat (no weird serrated hammers required) rather than toughening it. See, when you cook meat coated in a snuggly little blanket of yogurt, the heat caramelizes the milk solids in said yogurt, creating a crisp, smoky exterior and a hyper-tender interior, thanks to all the juices that get locked inside.This, friends, is the key to creating your new favorite all-in-one sheet-pan chicken dinner: Sheet-Pan Garam Masala Chicken, a dish so easy to make and so rewarding to eat that it’ll break through your self-imposed salad-only post-Thanksgiving diet and get you back in front of your neglected oven (that romaine’s poison anyway, y’all).The first step to mastering this dish is an important one: You have to get the oven hot enough. This dish takes its inspiration from India, where meat marinated in spices and yogurt is sometimes cooked in a cylindrical clay oven called a tandoor, which is heated to temperatures up to 900 degrees. In our case, we’re not getting quite that hot. But if you preheat your home oven to 425 and move one of the racks to the upper third, you’ll still get the burnished, blistered skin and deep caramelization that makes tandoor cooking so delish.Next, it’s marinade time. Grate up a three-inch piece of fresh ginger (definitely scrub it clean, but peeling is now officially optional), put one teaspoon aside, and dump the rest in a resealable plastic bag with two cups of whole milk Greek yogurt (I repeat! Whole milk!). Squeeze in a lemon’s worth of juice, cayenne pepper, and garam masala—which you can buy off the shelf or make yourself. Then seal up that bag and shake it, sh-shake it, shake it like a Polaroid picture—seriously, classic white person Outkast reference aside, this is a good time to work out some rage and dance alone in your kitchen, a practice I recommend to all of you at least once a week.Now it’s time to season your chicken pieces GENEROUSLY with kosher salt, stick ‘em in that bag, and return to your bag-shaking dance—working in batches if you need to (I did, which just meant more time for dancing). Once the chicken’s good and covered, set it aside to marinate, at least 30 minutes at room temperature or up to four hours in the fridge. Meanwhile, chop up a big ol’ head of cauliflower, drizzle ‘n’ toss with salt ‘n’ olive oil, and arrange it all evenly across a large, rimmed, foil-lined sheet pan. Part of the great joy of this dish is that it only requires one pan which means not only that you 🚨ONLY HAVE TO WASH ONE PAN 🚨but also that you can get away with not adding any exciting seasonings to the cauliflower—it’ll get its true flavor from what happens next, which is nestling your marinated chicken pieces in the middle of that cauliflower forest. As the chicken cooks, the cauliflower will soak up all the spiced chicken-y juices that come out. Mmmmm, spiced chicken-y juices.Serve this juicy yogurt-marinated chicken to the squad, or keep it all to yourself.\nSo yeah, stick that baby in the oven and let it go until the chicken skin is blistered, the meat is tender to the bone, and the cauliflower is good and charred. You’ll want to turn the pan halfway through and move the chicken with tongs occasionally so it browns evenly, but the whole process shouldn’t taken more than 40 minutes. Spend that time dancing. That’s not a request. Your mom called me. She says you need it. It’s been awhile. Times are hard.Okay well, you also need to spend some of those minutes preparing your chutney. But that’s easy. Just be sure to rinse your onion in cold water after you chop it to tone down the harshness.At this point, your kitchen will be smelling real good because your one-pan dinner is ready to party. Your chicken should be crisp on the outside, tender on the inside, and a wee bit spicy all over. Dolloping it with that zesty-zingy chutney lends contrast, keeping the meat-n-veg from tasting one-note and bringing the whole meal together with balance. Now all you have to do is eat up, then pat yourself on the back. For we should consider every day lost in which we have not danced at least once. And we should call every truth false which was not accompanied by at least one yogurt-marinated chicken.Winner, winner, sheet-pan chicken dinner!Sheet-Pan Garam Masala ChickenMarinating in spiced yogurt gets you a juicy and super-tender chicken every time.View RecipeExplore Bon AppétitSheet-Pan DinnersYogurtGreek YogurtBasicallyChickenGaram MasalaCauliflowerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-28", "author": ["Condé Nast", "Hilary Cadigan"]}