{"id": "cc834cc2d8291bcc4811387dfc810c94", "url": "https://www.bonappetit.com/story/plastic-free-weekend", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "We’re Going Plastic-Free This Weekend—And We Want You To Too | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe’re Going Plastic-Free This Weekend—And We Want You To TooFirst came straws. Now comes...everything else.By Meryl RothsteinMarch 26, 2019FacebookTwitterEmailPhoto by Ted + Chelsea CavanaughFacebookTwitterEmailI knew I had a plastics problem. We all do, right? You’ve heard the statistics: one million plastic bottles sold every minute. Eighteen billion pounds of plastic tossed in the ocean each year. But if you’re like me, you’ve shuddered at the stats, then ordered in lo mein and thought, At least I use a tote. This time I wondered, What does my plastics problem actually look like? So for a week I kept every piece of disposable plastic I used while eating or cooking. In a giant, um, plastic bag, I put every take-out container, every clamshell leftover from cherry tomatoes, every one of those produce bags I drop my wet escarole into at the market. It was not a small pile.Good thing I recycle dutifully, I told myself. But then I learned that much of what we think is getting recycled isn’t because of contaminants like food residue and labels. Turns out only 9 percent of all plastic has ever been recycled, and none of it—none of it—has ever biodegraded.Was this experiment depressing? Yes. But it was encouraging too. I used so much plastic without realizing it, which means that if I actually thought about it, I knew I could do better.So from Friday, March 29th through Sunday the 31st, I am going to do better, joining much of the Bon Appétit staff and, we hope, many of you, to spend a weekend without using any new plastic. That means packing our own lunches, bringing thermoses to the coffee shop, passing on yogurt and baby arugula and all those other things the supermarket only seems to sell in plastic.It’s an exercise, not a solution. Every harissa-loving, BA-reading home cook in the world could forgo plastic for three days and it wouldn’t exactly clean up the oceans. But it’s a good place to start.Maybe it’ll help you identify your pain points, or make you aware of the plastic you can easily do without (do you really need that straw? or that plastic lid for your coffee cup?), or spark ideas for solutions you can implement going forward. Maybe it’ll inspire you to take on Big Cherry Tomato (or more likely, grocers and food companies) and tell them you care how products are packaged. Maybe it’ll implant in your brain a plastic radar that dings every time you encounter single-use plastic in your daily life, like the one I can’t seem to turn off these days.So find your best tote, grab your Swell bottle, and get on your soapbox (in a not-too-annoying way), because together, we’re going to break our plastic habit.Read Moreculture14 Ways to Break Your Plastic HabitGallery14 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-25", "author": ["Condé Nast", "Meryl Rothstein"]}