{"id": "cc9f71e2be4a8c6877d2a60924212a76", "url": "https://www.bonappetit.com/recipe/chungdi-malai-coconut-shrimp-curry", "year": 2020.0, "month": 11.0, "day": 1.0, "content": "Chungdi Malai (Coconut Shrimp Curry) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChungdi Malai (Coconut Shrimp Curry)The ideal family meal on a weekday that calls for something special. By Maneet Chauhan and Jody EddyNovember 5, 20204.5(56)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Pearl Jones, prop stying by Nicole LouieEmailPinterestPrintEmailPinterestPrint“Chungdi malai is one of the most coveted dishes of Puri (a city in eastern India),” chef Maneet Chauhan writes in her new cookbook Chaat. “It showcases the elegant flavors that are the trademark of the regional Oriya cuisine. Coconut milk and shrimp are natural dancing partners, rounded out with the earthy note of ghee laced with a tapestry of spices. The shrimp should be marinated for about 1 hour to infuse them with flavor, but otherwise this dish comes together quickly, making it an ideal family meal on a weekday that calls for something special. It was in Puri where I tried my first shrimp, which my father had bought from one of the train vendors. They were covered in a fiery red chile sauce that I didn’t realize also contained large chunks of pineapple, which when covered in sauce closely resembled the shape and size of the shrimp. I took a bite of what I thought was shrimp but was actually pineapple and exclaimed to my dad, ‘Shrimp tastes just like pineapple!’ The incident still makes him laugh, and whenever he visits one of my restaurants in Nashville, I inevitably hear him tell this story at least once to a tableful of customers. Pineapple is not a traditional ingredient in chungdi malai, but sometimes I add it, especially when preparing it for my father, because it always gets a laugh out of him. If you’d like to include pineapple, add 1 cup coarsely chopped fresh or canned pineapple when you add the coconut milk.”Reprinted with permission from Chaat by Maneet Chauhan and Jody Eddy copyright © 2020. Published by Clarkson Potter, a division of Penguin Random House, LLC.Ingredients4 Servings2lb. medium shrimp (about 24), peeled, deveined2bay leaves2cinnamon sticks, broken into small pieces4whole cloves2tsp. ground turmeric2tsp. garam masala1tsp. ground cardamomKosher salt1Tbsp. mustard oil*1large yellow onion, finely chopped1Tbsp. finely chopped ginger2tsp. ground cumin1tsp. Kashmiri or other mild red pepper powder1tsp. sugar1cup full-fat unsweetened coconut milk2Tbsp. plain whole-milk yogurt1Tbsp. gheeFinely chopped cilantro, cooked basmati rice, and lime wedges (for serving)PreparationStep 1Toss shrimp, bay leaves, cinnamon, cloves, turmeric, garam masala, and cardamom in a large bowl until shrimp are well coated; season with salt. Cover bowl with a damp cloth and chill 1 hour. Remove and discard bay leaves, cinnamon, and cloves.Step 2Heat oil in a large high-sided skillet over medium-high. Add onion, ginger, cumin, red pepper powder, and sugar and cook, stirring, until onion is translucent, about 5 minutes. Add coconut milk and yogurt and whisk until smooth, then add shrimp and ghee and simmer, turning shrimp halfway through, until shrimp are cooked through, 7–8 minutes. Taste and season with salt.Step 3Top with cilantro and serve with rice and lime wedges.Step 4*Most mustard oils are not FDA-approved as edible in the United States due to their high erucic acid content. If you are concerned, look for Yandilla, an FDA-approved brand, online, or use olive oil instead.How would you rate Chungdi Malai (Coconut Shrimp Curry)?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleVery flavourful, spiced just the right amount, refreshing and easy to make. A joy to eat and look at.Toasted NutsRomania11/9/2021Hey. I have noticed a few comments regarding the printing issue. If you scroll down below the Ingredients List a tad it will appear on the left hand side. I had the same issue, looking looking looking..... found it. \nI hope this helps :) TeresaGreenNew Zealand 8/10/2021I thought this was just excellent. Very flavorful & really pretty easy. I added a chopped zucchini & diced red bell pepper and I thought they went with it really well. AnonymousSouth Carolina 3/21/2021Thanks for the button newsDamaschkeOntario2/8/2021The print button, along with a mail button and a Pinterest button, drops down on the left hand sideSelenaPort Hope Ontario1/15/2021This was... just fine. Tried this out because I’m a huge chopped fan (lol @ the comment below saying this recipe is appropriated... did you even look at the byline?). This recipe is perhaps meant for actual chefs. I had trouble eyeballing the spices and salt and guessing when to add them in. I used butter instead of ghee because I am a disgrace to my ancestors. FatimaNew York, NY12/29/2020I think the print button moved to a bar along the left side of the window - not immediately intuitive, but it's there!Lori MPort Washington, WI12/5/2020Like others below I can't find a print button-- until recently most BA recipes had this but now I can't find it.  It is a real deterrent to trying the recipes as I have to copy and paste into a Word document.  Can you bring the print button back?  Many thanks!D MorganSaskatoon, SK12/4/2020This was excellent. Made as recommended, but I think in the future I would spend less time breaking up the cinnamon, seeing as how you have to dig it out later. A little spicy, but pleasantly so.AdizzleMichigan11/22/2020This was really good—restaurant quality, in fact. I wasn't sure when I read the first few ingredients, but it all came together well. I had Kashmiri curry, too. Just the right amount of heat for us. I was careful not to overcook the shrimp, and they were tender and flavorful. A definite keeper for me.Marlene BSan Diego, CA11/19/2020Thank you for specifying \"unsweetened coconut milk\" in your recipe.  I get so confused when recipes, especially Indian or Pakistani recipes on other sites call for coconut milk but don't specify sweetened or unsweetened.  I learn which when the recipe is completed and often inedible because of my choice of milk.SDTrianoFlorida11/15/2020I would really like Bon Appetit to put the nutritional values in their recipes.  My husband is on a salt-restricted diet, and I'd love to know the sodium content. Sue W.Vermont11/14/2020This was a HUGE hit with my family (even the 2 toddlers gobbled it up, asking for more, \"bite, bite, bites!\").  I served it on a weeknight, prepared everything early (covering in fridge till actual cooking time).  A truly enjoyable experience... herbs filling the kitchen, transporting me back to Winter Solstice holidays from days past! \nPS.  To answer Ashley's question, this recipe fed 2 adults, 2 toddlers (ages 2 & 4); no left-overs :)lmsDurham, NC11/13/2020Hi there! this looks so delicious and i can't wait to try it! Does anyone know how many portions this recipe can feed?Ashley NYC11/13/2020Looks & sounds like a delight. Can’t wait to try it!KarenCatherineMississippi 11/11/2020Explore Bon AppétitCurryIndianSouth AsianAsianShrimpShellfishSeafoodCoconut MilkOther IngredientsEasyOne-Pot MealsWeeknight MealsMainGluten-FreeKetoSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-05", "author": ["Condé Nast", "Maneet Chauhan", "Jody Eddy"]}