{"id": "cca5eccac2b584f3a3940ec90c8d3ec0", "url": "https://www.bonappetit.com/story/paris-coffee-shops", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "5 Paris Coffee Shops We Want to Hang Out In All Day Long | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoprestaurants5 Paris Coffee Shops We Want to Hang Out In All Day LongFrom perfect sweet treats to killer coffee (duh), these cafes have got it going on.By Christine MuhlkeDecember 3, 2018FacebookTwitterEmailCourtesy of Ten BellesFacebookTwitterEmailWe know Paris has fancy restaurants and natural wine down, but we're also so here for the coffee shops. Here are five spots that are worth checking out, whether it's for a real breakfast in the morning or that jolt of caffeine you need in the afternoon. Boot CaféSet in an old shoe-repair shop in the Marais, this spot is all about outdoor seating and espresso.Instagram contentThis content can also be viewed on the site it originates from. CaouaThis “coffee stop” alongside Canal Saint- Martin goes full-bore on le brunch (avocado toast, six-minute eggs). Great coffee too!Instagram contentThis content can also be viewed on the site it originates from. CravanWith a picturesque breakfast and correct coffee drinks, this gorgeous café is our antidote to too much cool.Instagram contentThis content can also be viewed on the site it originates from. TélescopeParis’ OG third-wave coffee bar in the 1st is still going strong, with pour- overs made with rare Scandinavian beans.Instagram contentThis content can also be viewed on the site it originates from. Ten BellesThis minuscule café in the 10th is as serious about coffee as it is about food and—amen—bread.Instagram contentThis content can also be viewed on the site it originates from.For even more, check out our full Paris City Guide here.Explore Bon AppétitParisTravelCoffeeRead MoreWhere to eatHow to Eat Healthyish in ParisGallery13 SlidesBy Belle CushingWhere to eat8 Restaurants That Prove Paris Is Anything But Old-SchoolBy Christine MuhlkeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-03", "author": ["Condé Nast", "Christine Muhlke"]}