{"id": "cca5507417f48b30ea9378ea349cbbdb", "url": "https://www.bonappetit.com/story/alison-roman-dinner-party-tips", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "How to Host a Dinner Party Without Losing Your Mind, According to Alison Roman | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Host a Dinner Party Without Losing Your Mind, According to Alison RomanThese five tips will start you on your way to a low-stress, seriously fun night.By Alison RomanAugust 26, 2019FacebookTwitterEmailPhoto by Michael Graydon and Nikole Herriott, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiFacebookTwitterEmailCooking for others seems like a good idea when you’re sending out that group text, but when it’s 9:45 p.m. and your house is full of friends who refuse to use coasters and you can’t find your bottle opener and the pork shoulder still isn’t tender, it can seem like…a lot. Here are some tips to help maintain your sanity—and have some fun while doing it.1. Before you even start, pick a theme.I am not into menus, per se, but I am into themes. Not themes like, “wear a Hawaiian shirt, make rum punch, and watch Point Break” (although 10/10 would do), but more like “Red Sauce Night” or “Taco Tuesday.” The goal isn’t to turn your home into dinner theater, but to set gentle guidelines and get the ball rolling. It’s extremely helpful for those of us who struggle with indecision (hi!). Regardless of what dream you’re dreaming, apply the same sensibilities you would to any meal. For example, I love a lemony salad, a starchy side, and a big hunk of meat no matter what. Sometimes that means Steakhouse Night, but it could just as easily be “Grecian Vacation” or “Homemade Stouffer’s” (that’s a fun one). Picking a focus, even if you stray, is a good place to start.2. Do it ahead.Honestly I should really take my own advice on this one, but every time I do work ahead, my stress level decreases by about 65 percent. Season your meat, tear your lettuce for the salad, batch those martinis—literally ANYTHING you can cross off a to-do list, even if that means writing a to-do list just to cross something off of it.3. Your house is not a restaurant and you should not feel pressure to make it one.Use all the quirky imperfections to your advantage: Mix martinis in pitchers and serve them in tumblers (charming!) and sit on the floor when there “aren’t enough chairs” (homey!).4. Turn your guests into contributors and collaborators.Asking your friends to buy ice, pick herbs, make a sauce, or wash dishes makes the whole thing feel like a group effort. By the end of the night you’ll all be looking into property for your new commune.5. You need to serve dessert, but you don’t need to make dessert.Though I used to be a pastry chef, I would rarely serve dessert were it not for two things: (1) my desire to please those for whom it is nonnegotiable (a.k.a. most people I invite over) and (2) my desire to place a proverbial and sometimes literal cherry on top of an evening (do you get it?). I don’t mean to send you down a YouTube rabbit hole trying to learn how to make a 17-layer cake—you can go as big or as small as you have the physical and emotional space for. A bowl of fruit on ice. A box of wafer cookies. An upside-down apricot tart using store-bought puff pastry, say. There are few times where the phrase “It’s the thought that counts” applies, and this is one of those times.Get Alison’s full Steakhouse Night at Home Menu:1 / 5ChevronChevronLow-and-Slow Rib RoastView RecipeExplore Bon AppétitEntertainingPartyDinnerRead MorecookingWhen a House Full of Hungry Friends Calls, Alison Roman Makes Brothy MeatballsBy Alison RomancookingIf You Can Open a Cheap Beer, You Can Make This CocktailBy Alison RomancookingBless Your Next Party with Big Dip EnergyBy Alison RomanLifestyle30-Something Dinner Parties Are the Best Dinner PartiesBy Amiel Stanek and Lauren SchaeferRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-26", "author": ["Condé Nast", "Alison Roman", "Lauren Schaefer"]}