{"id": "ccab4be45050668655fe7d43826c85f0", "url": "https://www.bonappetit.com/story/carve-a-chicken", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "How to Carve a Chicken for Chicken Noodle Soup | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDon't Know How to Carve a Chicken? This Recipe is the Best Place to StartAnd at the end you get soup. By Sarah JampelJanuary 6, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailOnce upon a time—actually not too long ago, but before I worked here at BA—I decided that I was going to roast a chicken (I am a vegetarian) and feed it to my meat-eating friends. I thought I needed to know how to roast a chicken to be a fully-formed Adult. But even more importantly, I thought I needed to know how to carve one. So I bought kitchen shears, I watched this video of Chris Morocco roasting a chicken upwards of 50 times, and I prepared myself. And then, when the moment came, I dragged my most chicken-familiar friend into the kitchen and held him captive until he walked me through the process. It wasn’t disastrous but it certainly wasn’t cute—let’s just say my platter of carved meat wasn’t a cover star.If I knew then what I know now (ah, the wisdom of retrospection), I wouldn’t have gone from zero to roast chicken—I would have gone from zero to boiled chicken. In other words, I would have started not with roast chicken but with chicken soup. When you poach a whole chicken, as you do at the start of Molly Baz’s Classic Chicken Noodle Soup, you get a bird that’s essentially falling apart at the seams (sorry…). It’s bending and flexing in all of the places you’re going to slice. (Whatever you do, don't start by breaking down a raw chicken. It's even harder and, TBH, even more skeevy.)Here’s how it works. Once your chicken breast has reached 155° F (this seems a bit low, but remember that the meat is going back in the soup later), pull the chicken from the pot and transfer it to a cutting board to cool slightly, breast side up.Next, grab a wing and pull it outward, away from the body, so you can see where it attaches. Using a chef’s knife, cut through the joint to separate the wing from the breast. You’ll need to angle your knife downwards and toward the chicken’s body, and you’ll know you’re in the wrong place if you hit bone—simply pull the wing out farther, then wiggle your knife into the place where the joint meets the socket. Remove wing, repeat on the other side, then move on to the legs.Cut through the flap of skin that’s shrouding the leg-body intersection (again, sorry…), then pop the chicken leg backwards—sort of like the bird is doing a hip-opening exercise—so that you see its joint pop out. An open expanse of easily sliceable soft flesh between the joint and the body will be revealed—cut through it. Repeat with the other leg.All that’s left to do is to remove the breast. Keep in mind that you there’s a bone running straight down the center—you’ll need to cut alongside it on the left and right, angling your knife toward the outside of the bird.At this point you may be staring at a sort of roughed-up carcass and some chicken parts that are far from picture-perfect. But that’s the best part of carving a chicken for soup: It’s just practice! It’s all getting shredded up anyway and no one has to know that you didn’t do the world’s very best job.And the next time, when you try it with a roast chicken, you’ll do even better.Get the recipe:Classic Chicken Noodle SoupThis chicken noodle soup recipe is about as comforting as they come. View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-06", "author": ["Condé Nast", "Sarah Jampel"]}