{"id": "ccdba4fea3e2653480292629e0f744d2", "url": "https://www.bonappetit.com/recipe/chicken-meatballs-in-spring-vegetable-broth", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "Chicken Meatballs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken Meatballs in Spring Vegetable BrothBy Andy BaraghaniApril 24, 20194.3(38)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintFor this soup recipe, we skipped browning the meatballs and poached them instead. This will keep them very tender and their flavor light, which is ideal for this seasonal dish.Ingredients4 servingsMeatballs4scallions, finely chopped1large egg1large egg yolk11½\" piece ginger, peeled, finely grated1garlic clove, finely grated1Tbsp. soy sauce1tsp. ground coriander1tsp. kosher salt½tsp. freshly ground black pepper1lime1lb. ground chickenBroth and Assembly2Tbsp. vegetable oil13\" piece ginger, peeled, thinly sliced3garlic cloves, thinly sliced½tsp. freshly ground black pepper1Tbsp. soy sauceKosher salt2celery stalks, thinly sliced10oz. thinly sliced snow peas or sugar snap peas2scallions, thinly sliced1cup coarsely chopped cilantroPreparationMeatballsStep 1Mix scallions, egg, egg yolk, ginger, garlic, soy sauce, coriander, salt, and pepper in a large bowl. Finely grate zest from lime into bowl. Add chicken and gently mix with your hands until evenly distributed.Step 2Gently roll chicken mixture into 1½\"-diameter balls (about the size of a golf ball; you should have about 20) and place on a baking sheet. Chill until ready to use.Step 3Do Ahead: Meatballs can be formed 2 months ahead; freeze until firm, about 2 hours, then transfer to a resealable plastic freezer bag and keep frozen.Broth and AssemblyStep 4Heat oil in a large saucepan over medium. Add ginger, garlic, and pepper and cook, stirring often, until garlic is golden brown, about 4 minutes. Add 6 cups cold water, increase heat to medium-high, and bring to a simmer.Step 5Working with 1 meatball at a time, reroll to ensure it’s round and gently add to broth. Reduce heat to medium-low and add soy sauce; season with salt. Cook meatballs until cooked through, 10–12 minutes. Add celery and snow peas and cook until peas are bright green and tender, about 3 minutes.Step 6Divide soup among bowls. Top with scallions and cilantro.How would you rate Chicken Meatballs in Spring Vegetable Broth?Leave a ReviewTell us what you thinkReviews (26)Back to TopTriangleI found the best way for me was to treat the meatball mix like dumpling dough and slow slide into the broth by teaspoon. Even after a good chill in the fridge I couldn't get a ball to form...but taste was on point if not the prettiest soup, it definitely had great flavor.Gregg C.San Francisco, CA5/21/2021This recipe is so easy and delicious. My meatballs initially were not as firm as I'd like them to be following the recipe to a tee, however I just froze them for two hours and they went in the soup perfectly. I did not have to add in breadcrumbs or other substitutions. I added double amount of greens the second time I made this because of how refreshing they tasted! The only thing I changed in the broth was I used Chinese grounded white pepper instead as I like to use that in my lighter soups. Flavor came out amazing and delicious! JulesNew York, NY1/15/2021This is one of my favorite things to make on a cold day. Without a bread binder, the meatballs are gooey, so make sure you chill or freeze them first. Also, for the broth I've made it with both sliced ginger (as noted in the recipe) and  grated ginger and found that grated ginger worked best. It flavored the broth beautifully without the slices of ginger floating around in the soup, which I'm personally not a fan of. Colleen San Ramon, CA 1/12/2021Omg, what are youse all on?! Hot tip: ignore the comments! (Except this one!) This recipe was honestly perfect as is. You don't need to add any breadcrumbs – just don't skip the chilling of the meatballs and you'll be set. The broth – while suspiciously light on ingredients – is complex and delicious. The greens were crisp and nourishing. My housemates literally gave me a round of applause when I served this up tonight. I was inspired enough by the experience to create a BA profile... guys, I'm a commenter now.unhingedsnowpeaAustralia7/28/2020Excellent! I got around the gloppy meatballs by putting them in wonton skins and freezing them.  Worked well! Also I used homemade chicken stock instead of water.zipsterVictoria BA CANADA 5/18/2020This recipe is a hit but definitely needed some on-the-spot tweaking. \nTHE MEATBALLS: This was my first time working with ground chicken (thigh meat only for moisture) and the reviewers below are correct, the mixture ended up being super goopy and for me, was impossible to work with. I added 1/4 cup breadcrumbs which brought it together into a more manageable batter. I did my best to form the--albeit ugly, non-round--meatballs and placed them on a small sheet pan in the freezer for 30 mins while I cleaned up and prepped the broth. \nTHE BROTH: You gotta remember that this is a very quick-cooking recipe so the broth doesn't have any time (or onions) to develop any depth of flavour in the 15 mins of cook time. I cooked the ginger alone for 5 mins before adding the garlic to avoid burning. I used 4 cups of storebought beef broth and 2 cups of water as suggested by others but the broth was still bland even after the meatballs had finished cooking. The soy sauce helped a bit but I added 2 teasapoons of fish sauce which helped immensely! If you do this, completely omit adding any salt to the broth as the fish sauce and soy are both salty. \nOPTIONAL ADDITIONS: the meatballs came out great and the small amount of breadcrumbs did not make them soggy or mushy. If you want to go the extra mile with your broth, you can add dried or fresh mushrooms (sautee the fresh mushrooms alone first, till browned), thinly sliced carrots or brocollini/gai lan (add halfway thru meatball cook time), and even a hearty green like kale, chard, or bok choy. For HEFT, add ramen noodles or any (separately cooked) noodle or rice/grain you have lying around. I served mine with fresh slices of homemade bread. \n\nThis is one of those recipes that teaches you the importance of tasting at each stage of cooking and to trust your gut when it comes to additions and substitutions but it is worth making :)CookSorceryBoston4/30/2020Was short on time so instead of freezing the meatballs, I formed each meatball and floated them one by one on the edge of my ladle in the soup until they firmed up. Works like a charm and saves you two hours! Also swapped the water for broth for more flavor and added carrots and celery in at the saute stage of the soup. AnonymousChicago, IL4/29/2020Was short on time so instead of freezing, I shaped meatballs and lightly floated each one by one on the edge of my ladle in the soup until it firmed up. Works like a charm and saves you 2 hours! Also swapped the water for broth to get more flavor, and added carrots and celery in at the saute stage of the soup. Chicago, IL4/29/2020Made the meatballs with about a cup of leftover jasmine rice (inspired by the BA chicken meatball and hummus recipe) to help with binding.  I added another tablespoon of soy sauce to the mixture for flavor because I didn't have lime or garlic. Chilling the mixture for about an hour and half helped alleviate some of the gloopiness. The meatballs really puffed up in the poaching process (like almost doubled in size; I had to cut them into eights them after cooking) and turned out SUPER moist and tender. Will be making this again!AnonymousAtlanta4/15/2020So yummy! Based on the other reviews of the meatballs being gloopy, we added panko to them. They were great! Perhaps too dense for the soup but all worked well and they were easy, delicious, and quick. If I were to do it again, I’d add a bit more to the broth - not ginger, and perhaps sliced jalapeños at the end. Keep it light but flavorful. AnonymousAustin, TX11/18/2019Because of the comments I didn’t go for the “soup” and served the meatballs with some pasta instead. I tried doing the meatballs with ground beef instead of the chicken and Although they were gloppy as some of you guys mentioned, they turned out to be perfectly!AnonymousBrooklyn 10/16/2019This was delicious! The meatballs were definitely “gloopier” than traditional meatballs, but they were fine once they were in the broth. Just quickly re-roll them into balls before you drop them in. I also used half homemade chicken stock in place of the water, and added some powdered stock and extra soy to the broth - it was a little bland. Topped with some fresh chilli which was lovely. Anonymous5/26/2019The meatballs were EXTREMELY gloopy when I first formed them. They were so wet they wouldn't even stay in balls. I was very worried this wouldn't work but it surprisingly did! It was super tasty. I think it would be even better with noodles or something for more substance. Here are my recommendations and modifications:\n\n-Definitely make the meatballs at least a few hours ahead so that you can chill them in the fridge. They were still super messy when I re-rolled them to put them into the soup but were much more together than when I first formed them. \n- Other reviewers mentioned the soup was bland, so I used 4 cups homemade chicken stock & 2 cups water instead of 6 cups water. The flavor for the broth was incredible!\n- Cooking the garlic for 4 minutes was definitely too much as it did burn a little bit. If I make this again I would add the ginger to the pot first, then add the garlic with only a minute to go. solikearose5/22/2019I also found the meatballs too wet. I hesitate to add breadcrumbs as I worry they'd go soggy when poached. My solution was to just drop spoonfulls of the mix into the soup. Not as pretty, but it was effective. Tastes terrific so who cares what it looks like. jez.wilson4506Sydney, Australia 5/22/2019Delicious, but messy! The meatballs were a gluey mess and impossible to form even after half an hour in the freezer. I added some bread crumbs to bind them together and served it with some noodles to make it a little more hearty. AnonymousChicago, Illinois5/8/2019Explore Bon AppétitSoupSoups and StewsMeatballGround ChickenChickenPoultrySugar Snap PeaPeaVegetableSpringOne-Pot MealsMainStarterNut-FreeDairy-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-24", "author": ["Condé Nast", "Andy Baraghani"]}