{"id": "ccdcacab77d41307b42a2245012b9bc9", "url": "https://www.bonappetit.com/story/hawa-hassan-covid-19", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Hawa Hassan Is Feeding Hospital Workers At the Epicenter of COVID-19 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusHawa Hassan Is Feeding Hospital Workers At the Epicenter of COVID-19Healthyish editor Amanda Shapiro and BA contributor Hawa Hassan talk about living alone and coming together.By Amanda ShapiroApril 28, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis story is part of the Healthyish Guide to Being Alone, a series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.Last week, from the comfort of my closet-turned-podcast-studio, I talked to BA contributor, entrepreneur, and friend Hawa Hassan for an episode of the Foodcast (live on April 29th!). Basbaas, Hassan’s line of jarred Somali sauces, has a cult following that includes most of the BA staff; you may also recognize her from Test Kitchen videos. I’ve long admired Hassan’s constant stream of humor and good deeds on Instagram, and during this lockdown, we’ve been swapping tips on getting through COVID, having virtual dance parties, and commiserating about the joys and pains of living alone. Our podcast conversation was a bright spot for me during a tough week, so I’m sharing a condensed version of it here. –Amanda Shapiro, Healthyish editorAmanda Shapiro: What's it been like for you over the last month-plus now, being alone in your apartment?Hawa Hassan: People think that I'm an extrovert, but I'm very much somebody who has been alone for a large part of her life. I've been in Fort Greene, Brooklyn for almost 15 years, and I've lived alone for the majority of the time I've been here. One thing I've always appreciated is my ability to be by myself and seek solitude when I've needed it. So, that hasn't been too much an issue for me.AS: So, you were sick a little bit ahead of me. How was that for you? Did you feel more alone during that time?HH: It hit me right as we went into lockdown. I rode a bike to Manhattan to pick up some samples to ship, and I didn't have enough clothes on. So I thought, \"It must be because I caught a cold from riding the bike for two hours.” I felt like I got hit by a truck that night on my way to bed. I was super achy the next morning when I woke up. I just could not fathom that I got COVID.And then I lost my sense of smell and taste. That same day or the day before, a report came out saying that doctors in Korea had just discovered that this was a symptom. From then on, I just started to do what I had been doing for other friends, which was sending products through this company called Corona Couriers. So, I went and got my ginger and probiotic pills. I'd already had lemons and Vitamin C packets. I started to go really heavy on all that. I started steaming. And in two, three days, the achiness was gone. But my sense of smell and taste didn’t come back for about three weeks.AS: Yeah, it's a long haul for a lot of us. I remember when I was at the end of it and you were better, it was really good to have someone on the other side who was like, \"Just keep resting.\" We had to keep telling each other because we're both so bad at it.HH: Yeah. I was like, \"Don't do too much.\"AS: You live right across from the Brooklyn Hospital Center, one of the hardest hit hospitals in the city. At what point did you decide to start delivering food to the healthcare workers there?HH: A friend of mine in the neighborhood got sick, and I sent him food from Colonia Verde, a restaurant in Fort Greene that’s like my Cheers. [The owners] Tamy and Felipe, have become like family for me. A friend of mine who's a doctor at SUNY Downstate saw me post about it, and he goes, \"I wouldn't turn down a hot meal.\" That’s when I realized I was playing really small by taking care of just my friends. So I texted Tamy and I said, \"What if I made my Digaag Qumbe in your kitchen and we donated it to hospital workers?\"Tamy, Felipe, and I were like, \"Let's learn as we go and not wait to figure it out.\"AS: How did you get in touch with the hospitals to offer these meals?HH: I live above Hungry Ghost, a coffee shop in Fort Greene, and a lot of the employees there are dear friends. I was in there getting coffee and telling the manager, Alex, that we were going to start delivering food, and there was a doctor from Brooklyn Hospital Center in line behind me. I was like, \"Do you need food?\" And she was like, \"We would love food.\"She's part of the infectious disease team, and she became our point person. She set us up with the coordinator, Mohammed, bless his heart, who's made things so seamless. So now, we deliver to him and his team and then they distribute the food. We deliver to SUNY Downstate too.AS: What’s it like going into the hospitals? What’s the response been from the people you're feeding?HH: I don't actually go into the hospitals. I usually wait outside the door and someone will meet me. You can tell when they've had a good night. One of the toughest days for me was, I think, on a Wednesday, when they knew that Thursday was going to be their hardest-hit day in terms of deaths. And it was. We learned that New York lost almost 800 people that day. You could tell that the energy had shifted, but also they were excited because it would be the first time that every patient would have a bed.AS: That's so hard. The good things and the bad things are just all mixed up with each other.HH: Yeah. So, my intentions, and those of everybody I've been working with, are just to support and then to get out of the way.AS: How has this work affected your perspective on the virus and our response to it as a city?HH: It’s really highlighted what I already knew, which is that we are operating in a failed, dated system. The most vulnerable of us are the essential workers. They are the people that hold New York City together but can't afford New York City. When I'm driving around these days, you often only see only black and brown people. So that's been really tough and disheartening.I’d hate for people to remember this time as just a break that they got from not having to see their boss every day, which is what it looks like when I’m on social media sometimes. You can do so much just by making yourself available and doing what you can from where you are, you know?AS: Yes. What do you want to remember about this time and what you did during it? I think it is a really great question for us to be asking ourselves right now.HH: It would be incredible to remember this as a time when a group of people not only came together but actually stayed together, who voted in November, not for their personal interest, but for the collective, who stood ten toes down in their communities and really got involved.If you don’t know where to start, I think you look at your own community. If you're a mom who's on the PTA, how about making calls to parents who might need extra support? Make sure that your neighbors don't fall behind. How about showing up for the seniors in your community? You don’t have to go out of your way to cook and deliver, but maybe the senior citizens center needs a donation. I just hope that those of us who are positioned to do, do, because when this is written down, you don't want to be remembered for going to your country home and closing the door.Explore Bon AppétitHealthyishCoronavirusHealthyish Guide to Being AloneInterviewsRead MoreCoronavirusHow I Threw a Dinner Party in IsolationBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-28", "author": ["Condé Nast", "Amanda Shapiro"]}