{"id": "cce1fd11c15a9089fb3bb60369adacd6", "url": "https://www.bonappetit.com/story/never-fail-ramen-cold-noodle-salad", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "This Cold Noodle Salad Is the Ultimate Picnic Side | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Cold Noodle Situation Is the Only Pasta Salad Any Picnic Actually WantsCatch me at every picnic with this silky, crunchy, zingy cold noodle salad (and my own folding chair).By Emily SchultzJune 15, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.In a recent Bon Appétit ideas meeting, we got on the subject of how lame most picnics are. And no, we weren’t talking about park wine or potato chips and onion dip, because those are the parts of picnics that rule. We were specifically talking about how sucky it is to have to pretend that you actually like sitting on the ground, amongst all of the park creatures (BUGS!) whilst trying to eat said chips and dip. In the spirit of picnic-improvement, I got to thinking about the picnic foods that need an upgrade, and pasta salad is definitely at the top of the list. Cold pasta salad, a frequent guest to all park picnics, usually contains lots of out-of-season raw veggies, a short pasta shape, and a flood of store-bought vinaigrette. It’s never satisfying. Who said it had to be this way?In my quest to take down the man (and shitty pasta salads), I resolved to bring a pasta salad to my next picnic that would actually be worth eating. Casting about for a recipe that would redeem the dish, I stumbled upon queen (and senior food editor) Claire Saffitz’s trove of not one but FOUR cold noodle salad recipes. I decided to go with the ramen noodle salad because, well, I already had dried ramen noodles at home and my horoscope told me to.First, you make the dressing, which is what every pasta salad dressing wishes it could be. You grate garlic and ginger so they will incorporate easily into the dressing instead of swimming around in it, and then whisk that together with some lemon juice, tahini, soy sauce, and sugar. Then you gradually whisk in the vegetable oil and a bit of sesame oil so it emulsifies properly and creates a smooth, creamy sauce that clings to the noodles and steak. While you’re getting all sauced up, cook your ramen noodles according to the package instructions, drain, and then immediately rinse under cold water—we’re making a COLD noodle salad, in case you missed it.Dried ramen noodles: not just for drunk people.\nPhoto by Alex LauTime for the meat! You just sear a hunk of steak (strip steak works wonders here), but I’ve also made this recipe with leftover rotisserie chicken or seared tuna. (If you need a refresher on how to cook steak, this should help.) Let your meat rest on a cutting board after it's been cooked, and while that’s having its relaxation moment, chop up your veggies. This recipe calls for kohlrabi, but you can use any kind of sturdy veg in its place—broccoli, radishes, carrots, whatever—paired with finely-shredded scallions, crunchy napa cabbage, and cilantro. Slice up the meat, toss that into a bowl with your noodles, veggies, and three-quarters of the dressing. Top it off with cashews, Sichuan peppercorns (or red pepper flakes if you can’t find these), and the rest of the dressing.Success! Pasta salad redemption! Silky and slurpable, with plenty of crunch from the veggies and zing from the sauce, it was about as far away from the highly-suspect specimens you see in the deli case at the grocery store. When I told everyone on the group text that I was bringing pasta salad to our last picnic, nobody seemed excited— but after one bite everyone was begging me for the recipe. And as much as it will slay at just about any picnic, it's so good that you should definitely double it and bring the leftovers for lunch once the weekend's over. Just remember to bring a folding chair with you, too.Make it! Make it! Make it!Ramen with Steak and Sesame-Ginger DressingThis cold noodle salad can be customized however you want, but it's all about that sesame dressing.View RecipeExplore Bon AppétitNever FailRamenPastaSummerBasicallyRead MoreRamen with Steak and Sesame-Ginger DressingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-15", "author": ["Condé Nast", "Emily Schultz"]}