{"id": "ccf2d2b3807bb5c1476c10a0560998c6", "url": "https://www.bonappetit.com/story/how-im-making-summer-last-forever", "year": 2020.0, "month": 8.0, "day": 5.0, "content": "How I’m Making Summer Last Forever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I’m Making Summer Last ForeverQuick pickles, fruit compotes, and more ways to hang on to the season’s best.By Christina ChaeyAugust 29, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the newsletter, you’ll get the scoop before everyone else.Dear Healthyish friends,Every year I dream about all the perfectly ripe tomatoes and peaches I imagine I’ll be eating come August. But when that time (i.e., right now) arrives, I have so much pent-up anticipation that I buy more than I can reasonably eat, and a few of the tomatoes and peaches inevitably end up bruised and shriveled on my kitchen counter.Peaches and tomatoes are the most delicate, but they’re far from the only things I tend to over-buy this time of year (see eggplant, green beans, peppers, lettuces...). I’ve done this for so many years now that I’ve fully accepted I will never buy less produce. So I’ve embarked on the next-best solution, which is to experiment with all the different ways to extend my market haul for as long as possible.If I have a glut of fruit that’s in danger of overripening, I’ve gotten into the habit of making quick stovetop compotes, which require little more than some cut-up fruit, a splash of water, a bit of sweetener like maple syrup or sugar, and whatever spices you desire, and maybe a hit of acid like fresh lemon juice for brightness. If I make a cup or two of compote on a Sunday, I’ll store it in the fridge and then stir it into overnight oats or yogurt or spread it on toast for breakfast the rest of the week.This Corn & Chickpea Bowl with Miso-Jalapeño Tahini is an excellent way to use produce.\nCopyright 2020. All rights reserved.When I have tons of crunchy vegetables like green beans, beets of any color, carrots, or onions, I’ll make a quick pickle that’ll last for awhile in the fridge, ready to dress up any sandwich or salad. I’ve been making variations on a big lunch salad all summer with lettuce, tender herbs, cubed avocado, some marinated lentils, and a handful of crunchy fresh pickles. I usually riff on the extensive guide to quick-pickling in Joshua McFadden’s timeless book Six Seasons, but right now I’ve got my eye on Lani Halliday’s Spicy Pickled Summer Beans, which I plan to make as soon as I finish a few of the...seven jars of pickles I currently have in the fridge.And when I’m not compote-ing or pickling my produce, I’m probably freezing it for later. If you’ve been reading this newsletter, you know I’m an unabashed freezer stan. In the September issue of the magazine (out now) you’ll find a big feature on all the lessons we’ve learned from cooking nonstop these past few months in quarantine, including a story on how to conquer your freezer once and for all. In it, I wax poetic about my new favorite way to blanch, squeeze, and freeze bunches of leafy greens. Any fruit that doesn’t become compote goes into the freezer in a single layer on a parchment-lined baking sheet; once it’s solid, I bag it up for future smoothies or frozen treats like this incredibly delicious Peach Sorbet With Crushed Blackberries. And ever since I read about Samantha Seneviratne’s Yogurt and Jam Pops over on NYT Cooking, I’ve found myself online shopping for ice-pop molds. (I am most definitely taking recommendations.)Happy preserving,Christina ChaeyAssociate editorExplore Bon AppétitHealthyishWhat's Chaey Cooking?essayRead MoreguideThe Healthyish Farmers' Market ChallengeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-29", "author": ["Condé Nast", "Christina Chaey"]}