{"id": "cd22543567394afa7104bcc4b0f38698", "url": "https://www.bonappetit.com/recipe/hammy-chickpea-soup", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Ham and Chickpea Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHammy Chickpea SoupBy Carla Lalli MusicOctober 6, 20194.4(108)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintName a better activity for an autumnal, sweater-weather Sunday than simmering a cozy soup. (Oh, and apple-picking doesn't count.) When cooked from dry, chickpeas are way more tender than their canned counterparts—and, despite what you've been told, they don't even need to be soaked. We cook them straight from the bag, then harness the flavor of their cooking liquid to make the base for a creamy, bean-studded soup. A small amount of ham—in the form of a smoked hock—goes a long way here. You won’t get a lot of meat off that bone; its major contribution is saltiness, smokiness, and a silky, rich texture. If you don’t have or can’t find a ham hock, use a few ounces of slab bacon instead.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketLarge Pot$55 At AmazonLarge Basting Spoon$16.37 At AmazonVegetable Peeler$10 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEABlender$32 At AmazonLadle$8 At AmazonIngredients4–6 servings 1lb. dried chickpeas, rinsed, picked over2Tbsp. kosher salt, plus more2carrots1large onion8garlic cloves1smoked ham hock¼cup extra-virgin olive oil, plus more for drizzling1tsp. crushed red pepper flakes1tsp. cumin seeds1tsp. smoked paprikaFreshly ground black pepper1bunch curly kalePreparationStep 1Place 1 lb. dried chickpeas in a large stockpot and cover with 4 qt. water. Season with 2 Tbsp. salt and bring to a boil over high heat and cook, skimming any foam that rises to surface, about 20 minutes. Reduce heat to medium-low and bring to a simmer.Step 2While you’re waiting for the water to boil, peel 2 carrots. Halve 1 large onion through root end and remove papery skins. Smash and peel 8 garlic cloves.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Add carrots, onion, garlic, 1 smoked ham hock, and ¼ cup extra-virgin olive oil to pot. Add 1 tsp. crushed red pepper flakes, 1 tsp. cumin seeds, and 1 tsp. smoked paprika; season with several twists of black pepper and stir to combine.Step 4Adjust heat so that you’re at a gentle simmer and cook, stirring occasionally and topping off with more water to keep chickpeas submerged by at least 2\", until chickpeas are completely tender, 1½–2½ hours (this may take longer, in which case continue to simmer, checking every 15 minutes or so).Step 5Meanwhile, strip leaves of 1 bunch curly kale from stems, then tear leaves into about 2\" pieces. Set aside.Step 6Using a slotted spoon, transfer ham hock to a cutting board; let sit until cool enough to handle, about 5 minutes. Using same spoon, transfer carrots and onion to a blender or food processor. Scoop out 2 cups chickpeas and add to blender, then dunk measuring cup into soup to collect 1 cup liquid and pour into blender. Blend until mixture is smooth, about 30 seconds. (Alternately, transfer vegetables, chickpeas, and liquid to a deep bowl and use an immersion blender.)Step 7Pour purée back into soup (this is what is going to make the soup thick, creamy, and luscious). Add reserved kale and stir to submerge.Step 8Pick meat from ham hock, discarding skin, bones, and any large pieces of fat and cartilage, and cut into ½\" pieces; add to soup. Simmer, stirring occasionally, until greens are extremely tender and soup is thickened slightly, about 45 minutes.Step 9Using a ladle, divide soup among bowls.Step 10Drizzle with oil; season with salt and black pepper.Step 11Do Ahead: Soup can be made 2 days ahead. Let cool, then transfer to an airtight container and chill. Reheat over medium, adding water if needed to loosen.How would you rate Hammy Chickpea Soup?Leave a ReviewTell us what you thinkReviews (72)Back to TopTriangleOk, usually I would not abide a review of a recipe that changes all the steps, but hear me out, it was delicious. I've been meaning to make the original recipe for a while, but the 2 hour cook time and a house that smells like chickpeas were kind of a turn off. May I present to you hammy chickpea soup with a thirty minute cook time:\n\nThe secret is four recipe adjustments:\n1. Canned chickpeas--four cans ought to cover you\n2. Swiss chard instead of kale-- again, a much shorter cook time until they get tender. 3-4 bunches should cover you, it does cook down. Remove the stems and chop, so it cooks quick.\n3. Ground or crushed coriander instead of whole seeds. Seeds would be better for slow and steady cooking.\n4. Bacon instead of hamhock, for the quicker cook time. Don't add any salt to this soup! Bacon is very salty!\n\nJust dump all your ingredients in at once, except the chard, and bring to a boil, then cook for twenty minutes. Then extract and chop the bacon, puree the carrot and onion with some chickpeas and broth, and add it all back in with the chopped up chard. Cook ten minutes, and you're done. It was incredibly delicious. Someone with the patience to try both recipes, let us know how they compare!Alex BLos Angeles, CA12/1/2021Really had a hard time getting my chickpeas to cook! I just used basic dry Goya chickpeas, but they were simmering for over 5 hours and still weren't getting any softer! I ended up having to scoop them out and eat the soup without them because it was almost 10pm and I was starving. \nContrary to what this recipe says, I would really recommend soaking your chickpeas overnight for best results. Deceived About ChickpeasChicago, IL11/9/2021I couldn’t find a smoked ham hock for the life of me, so I instead used a lamb shank! Without the smokiness and saltiness of the ham, I decided to use leftover bacon grease in place of olive oil. I also reduced the simmer time with the greens to just 20 minutes… the lamby chickpea soup was absolutely delicious! Perfect for colder weather. LeighBaltimore, MD11/7/2021Really tasty, hit the spot during lockdown.  A real winner!  Thanks for the recipe.Simon SSydney, Australia7/19/2021Wow, this was so good!  I substituted collards for kale, and added a bit more cumin.  Topped with EVOO and blue cheese, which I think compliments the broth.  Good job, Carla!CarolCrane Hill AL4/1/2021Creamy, hearty, and absolutely delicious!!!  I did decrease the salt to 1Tbps.AnonymousZanesville,Ohio1/28/2021Had trouble finding Ham Hock, but the butcher explained they had it labeled as Pork Hock & was the same thing.  Added a great flavor, but there was no ham on the bone to add to the soup (just bone & fat).  So, I had to go back to the store & grab a ham steak to use it.  The only change I made was starting with 3 quarts of water, instead of 4.  All in all, it was a pretty good soup.  The kids thought it was a bit spicy & needed less chili flakes, but I thought the slight kick was just fine (I'd say it was a medium heat).  \nWill cook again!ShiloniColumbus, GA1/18/2021Definitely had some issues along the way, but made it work on the end. Much like others, I couldn't find a ham hock anywhere, so I ended up using a ham. It did taste bland, maybe because the bone from the ham hock would be a source of some additional flavour? I had some beef bouillon paste, so I added that, which did wonders. If I were to make this again, I would definitely use broth instead of water. I also used some chipotle flakes instead of red chili flakes, which turned out to be great for flavour too.LeiaCanada1/11/2021One word. Scrumtrulescent. Chris MartinBrooklyn, NY1/11/2021I really thought this was going to be more flavorful.  Since I soaked the chickpeas, I probably should have used three quarts of water.  I followed previous reviews and only added 1 tbs. of Morton's Kosher Salt.  The saltiness and spiciness was fine.  There just wasn't a lot of flavor.  If I make again, I'll increase the flavoring.RonPReston, VA1/7/2021Almost inedibly salty - unfortunately, because it was otherwise delicious. I noticed in the comments (after the fact) that perhaps an issue is that Morton's Kosher salt (which is what I used) is saltier than another brand - Diamond Crystal Koser salt. So warning, if you are using Morton's don't put in the full amount that is called for in the recipe. I would say cut back at least by 1/2.KirstenVestal, NY1/4/2021I am going to try this recipe with Lentils. sounds wonderful !!  I also bought a fresh ham hock, and will have to sear really well before putting in soup. hope I will have good luck!..I was a subscriber many years ago, and still have some of my favorite editions !!Marie Aceto BlairCurrently, from Central Florida. Prior Boca Raton Fl. and Orange Ct. 12/7/2020Soak the dried chickpeas overnight in cold water in your fridge. \n\nThat will facilitate the softening. Then they will be plenty soft after about 1.5 hours boiling/simmering them. Todd GailunBrooklyn, NY11/15/2020Seriously am stunned at all the great reviews. I put in everything exactly as written, except the ham hock - used bacon as others have suggested.  I went in for a taste about an hour after adding spices/veg/etc. and HOLY SPICE-LEVEL. This was off the charts spicy!! I basically eat every spicy thing known to man, but this was inedible! I quickly removed as much of the liquid as possible - rinsing the strained veg. I added back water, some thyme sprigs I had, tomato paste and yes, a tablespoon of brown sugar. It is still spicy, but now edible. Wow. Maybe my spices are too fresh for this dish? LISAANN9Minneapolis, MN11/12/2020Wow! This is great. I struggle with chickpea recipes - sometimes they are a vehicle for incredible flavor, sometimes they are overwhelmingly bland. This recipe falls in the flavorful category! I used smoked bacon instead of a ham hock as others have. Also subbed chard for kale. ACV for balance. Came out beautifully. I'm definitely hopping on the dried chickpea train! CJSan Diego, CA11/10/2020Explore Bon AppétitSoupSoups and StewsChickpeaBeanVegetableKaleLeafy GreensFallWinterMainDairy-FreeNut-FreeGluten-FreeSimmerLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-06", "author": ["Condé Nast", "Carla Lalli Music"]}