{"id": "cd2df66d8ab69251cf67c6e6b2f99e97", "url": "https://www.bonappetit.com/recipe/instant-pot-collard-greens", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Instant Pot Collard Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesInstant Pot Collard GreensBy Carla Lalli MusicNovember 13, 20194.5(34)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintYou don’t need to add liquid to the pot before cooking—the collards will release plenty while they’re in there. You can reduce the braising liquid as much or as little as you want once they’re done. We like to serve the greens a little saucy, but you can simmer until the liquid is slightly reduced if that’s what you prefer.Ingredients4–6 servings3Tbsp. grapeseed or extra-virgin olive oil1medium white onion, finely chopped6oz. slab bacon, cut into 1x¼\" lardonsKosher salt, freshly ground pepper3bunches collard greens (about 1¾ lb.)1fresh red chile (such as Fresno), cut into thin rounds, seeds removed if desiredLouisiana-style hot sauce (for serving)Special EquipmentAn Instant Pot or pressure cookerPreparationStep 1Heat oil in Instant Pot on Sauté setting (or heat over medium-high if using another pressure cooker). Add onion and bacon, season with salt and pepper, and cook, stirring occasionally, until onions are softened and just beginning to brown and bacon has rendered some of its fat, 5–6 minutes.Step 2Meanwhile, cut collard leaves away from stems; discard stems. Cut leaves in half through the midline. Stack leaves and cut crosswise into 1\"-thick strips. Add collards and chile to pot, season again with salt and pepper, and cook, tossing frequently, until collards are shiny and wilted, 3–4 minutes. Lock lid and cook on high pressure 12 minutes.Step 3Release pressure manually, then open lid and taste collards; adjust seasoning as needed. If there’s a lot of liquid in the pot, simmer on Sauté setting until reduced enough to lightly coat greens.Step 4Transfer collard greens to a platter. Season with hot sauce as desired.How would you rate Instant Pot Collard Greens?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleThis was wonderful!  I just used regular bacon cut into large-ish pieces (instead of slab), and a bit of jalapeno instead of fresno, because that's what I had on hand.  We served with chicken and dumplings and were all extremely happy about i!Anonymous1/30/2022Substitute bacon with turkey or portobello AnonymousTexas11/20/2021This is best recipe for collards! Tastes like they've cooked for hours and they take no time to make. So tender and flavorful!Bex Knightdale, NC11/5/2021My southern husband thinks these are exquisite!    he could not stop raving.    i knew he would want them with more liquid, so put put in a small amount of vegetable bouillon, two splashes vinegar, and garlic to the saute.  used crushed red pepper since didn't have any good dried chilies at hand.  phenomenal, thank you for this recipe. alonaChapel Hill, NC2/27/2021Just fantastic!  I didn't have bacon the first time I made this, so I used some ham.  It tastes like your Grandma cooked them for half a day.  Right on!  Thank you. WendyNorth Carolina1/26/2021Absolutely amazing!   The cook time was just perfect.  I was worried about not adding liquid, but it came out perfect.  \n\nJennNorth Carolina1/1/2021Delicious and easy. I skipped the chile and added Tabasco, and a little bit of apple cider vinegar. maddieseanPhiladelphia6/16/2020I made these exactly as written and they taste just like the greens from my favorite New Orleans soul food restaurant. Easy and delicious with a perfect amount of chew. If you want to be with the saints when they go marching in, crumble a piece of cornbread over the greens and add Tabasco with abandon. -Bess-Houston by way of New Orleans5/8/2020Amazing with garlic, hot chili sauce.  A tremendous recipe for greens.lg_kelly3860Austin, TX4/5/2020This is a great recipe.  I did add some apple cider vinegar (about 1 tbsp) to deglaze the pot and tender the greens.  You can also add leftover ham if you have it.  In general a great recipe..will do againlg_kelly3860Austin 4/5/2020Don’t you hate it when people review without having made a dish? Ugh... anyways these collards came out SO DAMN GOOD. Thank you for never failing me Carla <3 \n\nI followed the recipe to a T adjusting only to add some white vinegar and I reduced the pressure cook time to 10 mins. Came out so, so good. savannahtabithaPhiladelphia 1/12/2020Interesting recipe. I grow collards and I have an instant pot which I love. The max I have ever tried to cook greens in my instant pot is 4 minutes.  Twelve minutes sounds like the greens would liquefy. I would be interested in making this recipe if there was a substitute for the bacon. Not into bacon.\nAnonymousCalifornia1/6/2020Just delicious. Made a couple of tweaks: left the collards in larger pieces and left in some stems for a bit more toothsomeness. Added 2 tbsp distilled white vinegar for tang, which complemented the caramelized bacon perfectly. Note that there was almost no liquid at the bottom of the pot after 12 min of pressure cooking (maybe adding a bit of broth would help?) but not a dealbreaker for me. Planning to serve with grits and maybe a fried egg. AnonymousWorcester, MA11/15/2019Explore Bon AppétitSouthernAmericanSoul FoodCollard GreensLeafy GreensVegetableBaconCured MeatMeatEasyQuick5 Ingredients or FewerSideGluten-FreeNut-FreeKetoInstant PotJuneteenthKwanzaaDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-13", "author": ["Condé Nast", "Carla Lalli Music"]}