{"id": "cd41d5a45e363c61690e0c0a74d2f1d1", "url": "https://www.bonappetit.com/story/babo-nashville-54-oz-beer", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "I’d Like All My Beer in a 54-Ounce Bottle From Now on | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’d Like All My Beer in a 54-Ounce Bottle From Now OnThis Nashville bar serves beer in a way I can get behind.By Amiel StanekFebruary 3, 2020FacebookTwitterEmailPhoto by Tim SongFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.It’s not that I don’t like drinking beer—I just don’t like the way we drink beer in America most of the time. There’s something inherently lonely about a standard 12-ounce can or bottle; it’s a solitary thing, a single serving of booze tailored to the individual. Taste aside, I think that’s why I’ve found myself gravitating toward wine more and more. A bottle of wine demands to be shared, to be decided upon and poured and consumed by a group, and feels all the more convivial for it. Sharing is caring, after all!There are exceptions to this, of course. A pitcher of Bud Light split between friends at a bowling alley, say, or the fancy small batch ale in a 750-ml bottle meant to be cellared and sipped and savored. But the most notable and delightful exception I have come across recently was at Babo, a Korean bar in Nashville, where a whopping 54-ounce bottle of Hite is the order of the day. I was at the bar with friends at the end of a long night of eating and drinking in Music City, and tasked with grabbing another round when I spied it on the menu. I almost did a double-take—I mean, I’ve had my share of 40s in my day, but 54 ounces?? I placed my order and returned to the table with a massive, ice-cold, plastic screw-top bottle of South Korea’s answer to Budweiser, four lilliputian glasses, and a goofy, triumphant grin on my face. Now this was living!Many months later, I asked Tim Song, one of the owners of Babo, about the Big Boy Beer, and he told me about how Korean drinking culture is all about sharing and togetherness, and that they put larger format drinks on the menu to help facilitate that particular style of convivial boozing.Turns out, that night we Did It Right. We passed the Hite around, pouring for one another with two hands and giggling about how much the squishy bottle felt like a two-liter of Sprite. Toasts were made, glasses were refilled, plates of fiery kimchi and juicy housemade dumplings were devoured. And before we knew it, our Large Adult Son of a beer was empty. We looked at our watches, and then at each other, and decided that we had time to share one more big bottle. Now that’s a way of beer drinking I can get behind.Go there: BaboExplore Bon AppétitHighly RecommendRestaurantsNashvilleBeerRead MorerestaurantsI’m Too Old For Shots But Not “Thimbles” of LiquorBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-03", "author": ["Condé Nast", "Amiel Stanek"]}