{"id": "cd424f2fe40724edcd8c391a5aab49cb", "url": "https://www.bonappetit.com/story/never-fail-plum-clafoutis-recipe", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "The Clafoutis Recipe That I Pair with Port, Puzzles, and Silk Pajamas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Plum Clafoutis Recipe That I Pair with Port, Puzzles, and Silk PajamasFancy name, seriously easy dessert.By Alex BeggsAugust 3, 2018FacebookTwitterEmailPhoto by Ted CavanaughFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Oh, this is a sneaky one. It’s called “baked plum pudding”, but get this—it’s a clafoutis in disguise. The disguise known as, that time editors thought no one would make something called “clafoutis” (how do you even pronounce it? Is that French?!) so they gave the recipe a neutral and kinda boring title. It sounds wintry, no? “Baked pudding” never got anybody out of their silk pajamas if you know what I mean*.(*Even I don’t know what I mean.)HOWEVER. This is a straight-up plum clafoutis: a lightweight, baked summer custard that’s airy and silky, like those pajamas you’re (hopefully?) wearing. The thin batter is somewhere in the realm of crepe batter and you whir it up in a food processor or blender in 16 seconds, on average. All cream and a little flour and three eggs, some vanilla and sugar. I’ve written about the existence of clafoutis before, because I went through a phase where I made one every two weeks. (I go through a lot of phases; my moon is in Gemini.) That was my cherry clafoutis phase. When plums came in season, I discovered Carla’s plum “baked pudding” recipe and my clafoutis phase reached a new level of advancement: stone fruit edition.And in case you weren’t aware, we’re in peak stone fruit season right now. Plums, apricots, nectarines, peaches—if it’s a fruit with a rock in the middle of it, it’s either already at the farmers’ market or getting ready to make a big, fat, sweet, juicy entrance. So there is absolutely no better time than now.That said...I made it for a dinner party scenario in which I overthought the mains and sides and needed a quick, painless dessert. Yeah: It was CHRISTMAS EVE DINNER. No, plums weren’t in season, but all those songs about sugar plums got me in the mood. Good thing American grocery stores live in a season-less purgatory outside the pesky constraints of weather, tides, and flavor! My sister placed the carefully sliced plums in a baking dish and I poured the batter on top. That’s it. Then it went in to the oven for about 40 minutes. How’s that for painless?You could even make it in a skillet!\nWhile the clafoutis cooled, we cracked open the port and discussed the merits of 1,000 piece puzzles over a rousing game of rummy 500. The heavy dusting of powdered sugar that went over the top mimicked the snow that might have been outside, though I don’t remember. My memory is saved for other details, like food. When we brought the clafoutis out, a profound silence, followed by this sort of gross slurping noise, washed over the table, as one by one my lovely guests freaked the eff out over custard. After a heavy meal, it was just the right amount of light, while also being comforting and irresistible. They cleared their plates, and then I made them help me wash them.Don’t say they were drunk!!! Don’t say it was the glow of the holiday season!! Don’t take this away from me. Everyone loves clafoutis, no matter what you call it.How else do I convince you to make this? Do you even like fruit? How about juicy, sweet plums at the height of their game? Do you see how fleeting life is? Have you ever noticed how nothing dusted with powdered sugar was ever bad? Just make this clafoutis recipe already—the plums are calling.Get the recipe:Baked Plum PuddingFeel free to use your favorite kind of plum for this pudding recipe, but we recommend prune plums, which have an almond-shaped body that tapers at the end. They’re on the smaller side, hold up well, and the pit comes off the flesh easily, all of which makes them especially good for baking.View RecipeExplore Bon AppétitPlumCustardNever FailPuddingSummer DessertsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-03", "author": ["Condé Nast", "Alex Beggs"]}