{"id": "cd4b70a8fee53aaa86345dc9ae4866c7", "url": "https://www.bonappetit.com/recipe/pasta-al-limone", "year": 2022.0, "month": 3.0, "day": 4.0, "content": "Lemon Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPasta al LimoneBy Molly BazMarch 23, 20224.7(328)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintLemon pasta (pasta al limone in Italian) is more than the sum of its parts. It is luscious and amply cheesy, but bright thanks to fresh lemon juice and zest. Like in cacio e pepe and fettuccine Alfredo, the key to this weeknight dish is not an abundance of ingredients (there are only five) or in a long slow simmer (it takes just 15 minutes start to finish). Rather, this creamy lemon pasta recipe relies on the power of emulsion and your patience to execute it: Work one tablespoon of butter at a time into the cream, whisking until it melts and incorporates completely into the lemon sauce, before adding the next one.Follow suit with the Parmesan cheese: add it slowly, allowing each fine shred to enrobe the spaghetti (or linguine if you’d like)—plop the cheese in all at once and you’re likely to end up with a glob that refuses to play nicely. Reserve some of the starchy pasta cooking water to give the sauce body (and loosen it if necessary). Finally, don’t be shy with adding salt and tasting as you go. This dish will likely require more seasoning than you think to strike a perfect balance. If you’re in need of more guidance, check out this video.Looking for a side dish? This classic pasta pairs well with a big green salad or a mix of fresh and pickled vegetables via our Giardiniera Antipasto Platter.Editor’s note: This recipe was originally published in September 2018.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronVegetable Peeler$10 At AmazonMicroplane$16 At AmazonDutch Oven$80 At AmazonWhisk$10 At AmazonIngredients4 servings1lemon12oz. spaghetti or other long pastaKosher salt¾cup heavy cream6Tbsp. unsalted butter3oz. finely grated Parmesan (about ¾ cup)Freshly ground black pepperPreparationStep 1Using a vegetable peeler, remove two 2\"-long strips of lemon zest. Thinly slice each strip lengthwise into thin strands; set aside for serving. Finely grate remaining zest into a large pot (like a Dutch oven). Cut lemon in half and squeeze out enough juice to yield 2 Tbsp. into a small bowl; set aside.Step 2Cook pasta in another large pot of boiling heavily salted water, stirring occasionally, until very al dente (pasta will finish cooking in the sauce).Step 3Meanwhile, add cream to pot with lemon zest and cook over medium heat, whisking often, until liquid is just beginning to simmer, about 2 minutes. Reduce heat to medium-low. Whisk in butter 1 Tbsp. at a time until melted and sauce is creamy and emulsified. Remove from heat.Step 4Just before pasta is al dente, scoop out 1½ cups pasta cooking liquid. Add ¾ cup pasta cooking liquid to cream sauce and return to medium heat. Using tongs, transfer spaghetti to pot with sauce (it’s okay if a little water comes along with it). Cook, tossing often and adding Parmesan little by little, until cheese is melted and sauce is creamy, about 3 minutes. If sauce looks tight, add 1–2 Tbsp. pasta cooking liquid. (Cream sauces tighten up very quickly as they cool, so it’s better to lean on the saucier side of things.) Stir in reserved lemon juice; season with more salt, if needed.Step 5Divide pasta among bowls. Season with pepper, then top with reserved lemon zest strips.Photo by Chelsie Craig, Food Styling by Kate BuckensHow would you rate Pasta al Limone?Leave a ReviewTell us what you thinkReviews (143)Back to TopTriangleEasy, delicious and perfectly creamyDominiqueBrooklyn NY3/25/2022This is how I make Alfredo sauce when I'm serving the pasta with seafood - the addition of the lemon zest and a bit of juice is wonderful. CarswellCanada3/23/2022This recipe was the manifestation of a long-held desire to make a creamy, lemony pasta sauce that didn’t break or curdle. Perfect texture, and it couldn’t have been easier to whip up! My only modifications were a little crushed red pepper in the cream and I only used about 8 oz of bucatini with a cup of frozen peas at the end of the cooking (after I removed the pasta water)— you know, to make this “healthy” and to add a little green to my plate. Served with salmon and topped with fresh parsley and basil, and of course more parm grated on top. Very excited to add this to the repertoire. Buon appetito! Sarah ElleryNashville TN1/6/2022Ok hear me out. I'm not a vegan. Definitely not. But I've been making this with oat cream and it blows everything out of the water. It's silky and delicious and stays the perfect texture, it doesn't seize up and coagulate like regular cream. Again, I love me some cream and meat, but this was a substitution we did once, but one we make every time now. Vegan Becel or regular butter work just as well. Either way, it's delicious!! One of our favorites.LMartisMontreal, Canada 12/3/2021I thought this was recipe was delicious. I followed the recipe essentially but I didn't have enough cream so I added sour cream and I used fresh fettuccine instead of spaghetti.  Additionally, I also used a bit more lemon juice and added a pinch of hot pepper flakes.  The dish is a bit rich but can't wait to make it again. It's a keeper!  AnonymousSF Bay area9/24/2021So yummy! Definitely will not be making it often because Woah that's a lot of cream and butter– but it's the best guilty pleasure. Lemon perfectly cuts through the cream. I added a clove of garlic, as well, because... well... every pasta needs garlic, frankly. Adding this to my list of recipes.Steven ZChicago, IL9/22/2021I needed a pasta to serve along with bbq shrimp.  This pasta dish was easy to make and delicious.  It was creamy and smooth and clung well to spaghetti.  However,  I will try making this again using slightly less butter and cream……so I can eat it more often!!!  My husband says it’s a keeper recipe. Cathi Giacopuzzi BeeryCalifornia9/7/2021i always make this dish. it is my guilty pleasure for sureMadeleineSeattle, WA9/2/2021it's just a meh pastaPicky eater8/27/2021This was just amazing! So much flavor yet so simple to makeAnonymousOrange County, CA8/10/2021I LOVE this recipe... well my version of it. I use 4 x lemons+zest and no cream (but add olive oil to the butter). Garnish with lemon strips and basil (maybe add some chilli flakes too if Im feeling frisky), I also use more parmesan.... must try it the real way some time but love my \"lighter\" version for summer!\nAnnabelLondon, England7/13/2021Best pasta I've ever had in my entire life (and I'm old).  I'm not even a fan of pasta with cream sauce.  Until now.  Only deviation was adding more lemon juice than what was called for because I love an aggressive lemon flavor.Kat MSouthern California7/1/2021I’ve made this recipe at least a dozen times. It is utterly fantastic and is easily one of the best pastas I’ve ever eaten (I’ve eaten a lot). Make this recipe exactly as described. The only tweak I’ve ever done is to use half and half instead of full fat cream. Both ways result in an amazing pasta. One other suggestion is to try the recipe using fresh pasta - really takes it over the edge. Also, and this is important, you need to use REAL parmasan with the rind stamped. If you don’t use real parmasan it won’t taste the same. When making pasta recipes with a few ingredients, it’s all about the quality of the ingredients. Molly, Bon Apetit is lucky to have you! Gita Santa Cruz, California 6/21/2021This is the best version of lemon pasta that I have ever made - absolutely delicious and not at all difficult!RachelNYC6/15/2021Really delicious! Was worried it would taste far too rich with the cream, butter and parmesan but the lemon cut through it beautifully. \nDefinitely a once in a blue moon recipe though - really not a healthy recipe 😋Michelle MSurrey, England5/5/2021Explore Bon AppétitPastaItalianEuropeanLemonCitrusFruitSpaghettiPasta & NoodlesParmesanCheeseQuickEasy5 Ingredients or FewerWeeknight MealsMainVegetarianNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-24", "author": ["Condé Nast", "Molly Baz"]}