{"id": "cd594ea29ee1149daa290bb612e4b945", "url": "https://www.bonappetit.com/recipe/blistered-green-beans-with-fried-shallots", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Blistered Green Beans With Fried Shallots Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueBlistered Green Beans With Fried ShallotsBy Yia VangApril 14, 20204.5(21)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Rose Daniels and Yia VangEmailPinterestPrintEmailPinterestPrintCrispy fried shallots complete this dish. And they don’t even need to be homemade. The folks at Union Hmong Kitchen in Minneapolis swear by the big jars of fried shallots available at Asian markets and online, but any kind of fried onion will work. Here’s a recipe if you want to make your own.Ingredients4 servings½small shallot, finely chopped1garlic clove, finely chopped1lemongrass stalk, bottom third only, tough outer layers removed, finely chopped11\" piece ginger, peeled, finely chopped3Tbsp. vegetable oil1lb. green beans, trimmed1Tbsp. oyster sauceKosher saltStore-bought fried shallots (for serving)PreparationStep 1Crush shallot, garlic, lemongrass, and ginger in a mortar and pestle to a coarse paste; set aside. (If you don’t have a mortar and pestle, chop very finely.)Step 2Heat oil in a large skillet over medium-high. Arrange green beans in a single layer; cook, undisturbed, until browned underneath, about 3 minutes. Using tongs, turn beans over and cook, tossing occasionally, until deeply browned in spots and tender, about 5 minutes. Add reserved lemongrass mixture; cook, tossing, until fragrant and tender, about 1 minute. Remove from heat. Add oyster sauce, season with salt, and toss to coat.Step 3Transfer green beans to a platter and top generously with fried shallots.How would you rate Blistered Green Beans With Fried Shallots?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleThese were amazing!! The flavor was so incredible. My only regret is that I didn't double the recipe. Next time! maria bSanta Cruz, CA2/20/2022Amazing green beans, no surprise as every recipe of Yia’s has been incredibly flavorful. I couldn’t find lemongrass as it was a last minute decision to make these, but I substituted lemon zest (the zest of 1/2 to one lemon for one stalk of lemongrass). My friends and I demolished these so quickly, definitely adding to my arsenalSophiaLake Worth, FL12/30/2021These are literally the best green beans ever!!! I made them for Thanksgiving and there was not a single green bean for leftovers. I got so many compliments. Such a great way to elevate green beans and really pretty simple to make. Definitely give them a try. I made a bunch of extra paste so I have it in the fridge for anytime I want to make more.J ReneeSan Francisco12/28/2021Love this recipe. Fast, tasty, healthy. Has breathed new life into dinner game. JudikaNZCanAuckland, New Zealand5/5/2021Really good but can feel too sweet if you eat too many. I omit the lemongrass (And sometimes add lemon peel in it's place)JSChicago, IL4/19/2021These were AMAZING. When I make them again I will double the recipe. It says 4 servings, but my boyfriend and I quite literally ate the whole pan because they were too good. And it was just our side dish! I can’t express to you how delicious they are. You must make them. AnonymousSpartanburg 3/21/2021Found this hard to time. My beans went from blistered to burnt in a nano-second.dpWashington, D.C.11/28/2020These were easy and delicious. Fried green beans are a fave for us when we order Chinese in, and these scratched that itch.AnonymousSeattle, WA6/18/2020This was delicious! I added a small can of mackerel, and left out the oyster sauce. I wasn’t sure if it would pair well. The mackerel helped make this salad a full meal. AnonymousWashington, DC5/26/2020This is absolutely delicious. I didn't have oyster sauce- instead added hoisin sauce. diyaguhaSan Francisco5/15/2020Quite possibly the BEST version of green beans I have ever had!!!!  Two of us ate an entire pound...by ourselves. We could have kept going except they were all gone!\nI didn't have a strong enough mortar/pestle to turn lemongrass into a paste, so I just minced all of the aromatics. I always have a little jar of fried shallots or red onion from the Asian grocer which worked perfectly here. So easy to put together, and the flavor?  Ridiculously good! Thank you SO MUCH for sharing this with us.storageladyBoca Raton, FL5/14/2020Loved this combination of aromatics. Didn’t have fried shallots for a garnish- still good. I kind of want to try it without the oyster sauce next time just to let the green bean flavor more prominent.AnonymousAustin5/3/2020This turned out great! I used an extra lemongrass stalk because I love the flavor and i blistered the green beans in batches so there was enough space for them to breathe in the pan then tossed them all together with the aromatics. I definitely will be making this dish again. Miami5/1/2020Explore Bon AppétitAsianGreen BeanVegetableShallotLemongrassHerbs & SpicesGingerSummerQuickEasySideNut-FreeDairy-FreeHealthyishSautéHanukkahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Yia Vang"]}