{"id": "cd5f32eeb8f43827eed3befed80bc952", "url": "https://www.bonappetit.com/story/trader-joes-reviews-2019", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Everything New at Trader Joe’s in 2019, Honestly Reviewed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTrader Joe’s Oat Milk, and More New Winter Stuff, ReviewedIncluding: bagged bone broth, cauliflower tot casserole, and whatever “cornbread bites” are. By Alex BeggsDecember 19, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmail“Are there any more cat treat advent calenders?” I asked my friendly local Trader Joe’s customer service dude. “Those sold out a while ago,” he replied. Oh right, it was mid-December and I guess I forgot how calenders worked. But get this. My inside source (I know!!) at Trader Joe’s revealed a secret to me: Cats are NOT loving the advent treats. Customer feedback was the equivalent of my cat Roger eating his Friskies too fast and then puking it on my bedspread. Not great. So I don’t feel so bad about missing out on that one. Now for the rest of December’s latest Trader Joe’s drops. See you in 2020!(Read our 2018 reviews here and here to dive deep.)Photo by Laura MurrayThe BitesCrispy Rice Salmon Bites, $6.99If you like to order salmon well-done, or enjoy the worst food in the world—salmon burgers—you’ll love these dry, flavor-devoid salmon bites with spicy mayo sauce. I do appreciate the crispy crunchy coating like when you get spicy sushi rolls “with crunch.” That coating is going places.Cornbread Bites, $3.99These are balls of cornmeal dough with liquidy cheese inside. They’re not as good as my beloved mac ‘n cheese bites (reviewed below, somewhere)—a perfect frozen food, and these cornbread bites would benefit from that textured, breadcrumby coating. Still ate ‘em all.Photo by Laura MurrayRandom SnacksSliced Alpine Semisoft Cheese, $4.99There’s a slight sharp tang to this uber-melty cheese. Classy.Plantain Crisps, $2.49YES. MUCH YES.Organic Dehydrated Carrots of Many Colors, $2.99NO.Chopped Medjool Dates, $4.99The reason dates WITH pits exist is because they stay juicier and plumper that way. Take the pit out and chop them up and you’ve got date jerky bites. Put them in your cereal or salad and pick them out of your molars the rest of the day!Photo by Laura MurrayFrozen StuffCuban Style Citrus Garlic Bowl, $3.49Bowl o’ mush.Cauliflower Tot Casserole, $5.99This was inventive. Cauliflower tater tots—sure, okay—surrounded by ???cheese??? Everything was gooey and cheesy and slightly breaded. WORLDS better than my arch nemesis, cauliflower gnocchi. Pro-tip: Take the frozen tot-lump out of the plastic container and bake it in a small cast iron pan for max crispy edges.Mini Cheesecake Cones, $3.99/box of 4Squeeeeee! These almond-cookie wannabe cannolis are on the TJ 2019 varsity team. The ricotta-quark cream cheese filling is light and fluffy and the sticky cookie cone is sturdy without being crumbly or hard. My only complaint—everything is so rich and sweet I couldn’t finish the whole thing. Make ‘em tinier and cuter!Soy Creamy Cherry Chocolate Chip Non-Dairy Frozen Dessert, $3.99You know the candies called “cherry sours”? Little globes of cherry corn syrup? This ice cream tastes like that, with tiny shards of chocolate chips hither and thither. Lives up to the name “creamy,” so congrats on that, non-dairy frozen dessert we can’t legally call ice cream.Photo by Laura MurrayBevsNon-Dairy Oat Beverages, $2.29I did a side-by-side of this and Oatly—with the help of avid Oatly consumer, Basically editor Sarah Jampel. Yes, we noticed a difference. TJ’s had a thinner consistency and sweeter flavor. Oatly tasted oat-ier. To each their oat! Ha ha, ha, haaaaaaaaaa. Sigh.Organic Bone Broth, $5.99Heck yeah! About time! This is what you want to make soups with instead of the salty-as-all-hell shelf stable, celery-tasting boxed stuff. When I microwaved the chicken broth to sip on, my cat came RUNNING. It was silky and tasted deeply chickeny, roasty. We’re both fans.Hibiscus Lemongrass Naturally Flavored Sparkling Beverage, $4.99/box of 4Like drinking disinfectant spray without the deadly results!Photo by Laura MurrayBaking MixesMaple Pecan Cookie & Baking Mix, $3.49It messes with my head to make cookies with oil instead of butter. Is it still technically a cookie? Hmm. Gotta ask Claire Saffitz the next time I see her. These have a maple syrupy flavor and cake-rocky texture thanks to approximately 14 pecan halves.Gluten Free Cornbread Mix, $2.99Y’all. Why. Did. You. Put. Vanilla. Flavor. In. Cornbread. This is against the LAW! Gah! As a Texan, I’m horrified. As a person with taste buds—horrified. I tried to offset the sweetness with some chopped chiles but it didn’t help. And the second my cornbread cooled, it dehydrated into a stale craggly mass the texture of those sea sponges they sell at Goop.Photo by Laura MurraySquash-AdjacentLeafy Greens with Butternut Squash Salad Kit, $4.49Just say NO to plastic-within-plastic salad kits in 2020.Harvest Grain Salad, $4.99Quinoa is still a thing?Pumpkin Bisque, $3.99A mega-thick, jiggly mass that, when heated, remains a thick, jiggly mass. Relatable. But halfway through my bowl, I threw in the towel. It has a warm-spiced, savory pumpkin flavor that isn’t bad, I’d just rather have in a pasta sauce than soup.PreviouslyPhoto by Laura MurrayPUMPKIN STUFFPumpkin Greek Yogurt, $.99Thick texture, tastes like a tangy PSL. Love it.Pumpkin Spice Biocellulose Face Mask, $2.99Heavy on the clove and allspice, which will linger on your cheeks for hours after. Skin remains same skin.Fall Harvest Salsa, $2.99Tastes like normal salsa, but slightly sweeter. Opening the jar releases a crowd-clearing horrific odor, somewhere between rotten vegetable crisper and school cafeteria tomato soup.Pumpkin Spice Almond Beverage, $2.99Nice n’ thick, viscous, and well-spiced. Would be great to mix into oatmeal.Pumpkin Pie Spiced Ginger Brew, $2.99Not as spicy as your usual ginger beer, this is watered down cinnamon juice.Pumpkin Spice Granola Bark, $3.99Too thick! Could roof a house with it. Dusty. A hard granola cake with chocolate frosting.Photo by Laura MurrayMAPLE STUFFMaple Ginger Cookie Swirl Ice Cream, $2.99ONE OF THE GREATS. Wonderful syrupy swirls with softened cookie chunks and enough vanilla to balance everything out.Autumn Maple Coffee, $7.99Makes the entire house smell like pancakes, but tastes like artificial death. Could be worse. Could be real death.Maple Streusel Bread, $3.99YUMMY. It’s super squishy sweet bread with frosting that’ll melt off if you put it in the toaster oven. Also smells like pancakes.Maple & Sea Salt Kettle Corn, $2.49YUMMY2. Can’t detect any maple, but kettle corn that tastes like kettle corn. Open bag, watch it disappear.Photo by Laura MurrayDIPSVegan Ranch Dip, $3.49Potentially rancid coconut milk, wobbly, and way too tropical to go in the savory ranch direction. Couldn’t take a second bite to elaborate.Chocolate Hummus, $1.99Deeply chocolaty and equally suspicious. Never trust a chocolate hummus. Who are you, frosting? What do you want from me? I can’t be in the same room as it.Cashew Cream Fiesta Dip, $3.49Awful. Rubbery and funkadelic from carrots and potato. Imagine a fiesta where the piñata is filled with sharp, rusty nails. This is that festive.Everything Bagel DipWell it’s yogurt-based, so it’s never going to be sour cream and onion dip, is it? The yogurt makes little puddles of water while the everything bagel spice overcompensates for the bland base. Still 1000% better than vegan ranch.Photo by Laura MurraySuper Sour Scandinavian Swimmers, $2.99These verge on mouthwateringly sour, but not a step further. You can only get so far without chemicals, wonderful, wonderful chemicals that made me who I am today. The swimmers are soft but not too soft, and orange is obviously the best, while blue is astonishingly aquatic.Photo by Laura MurrayLemon Peal, $7.99Love the little lemon illustrations on this, Bobbi! (Bobbi is a designer at TJ’s who reads all my reviews; I love her.) What we have here is a lemon “malt beverage,” absurdly sweet and malty and fake lemony, yet still better than any spiked seltzer.Photo by Laura MurrayButter Toffee Coated Virginia Peanuts, $3.99ADDED TO DESK SNACK STASH. The toffee coating is thin and shatters easily, meaning you can eat handfuls of these without tooth-struggle, a real affliction.Butternut Squash Pizza Crust, $4.29The pizza crust charade continues! Try as you might, this will never get crispy enough in the oven to replicate anything close to pizza crust, but it does exist and is edible, so. Put some cheese on it and face the fact that you’re eating mostly cheese tonight. The “crust” is chewy, tastes vaguely corny, and it creates a sort of pocket so when you take a bite, the bottom separates and you see all the grains holding it together. Intriguing.Photo by Laura MurrayFall Leaf Tortilla Chips, $2.99Our entire lives we’re told everyone is different, like gradient autumnal tree leaves, only to realize we’re all going to end up raked in the same garbage pile in the lawn, where a passing dog will pee on us. These tortilla chips all taste the same. It’s a bag of chips.Photo by Laura MurrayOrganic Creamy Cashew Cultured Yogurt Alternative, $1.69Extreme Yoplait vibes here, unabashedly sugary. After tasting other brands’ cashew yogurts with less sugar, or none at all, I understand the need. Cashew yogurt can be VERY BAD.Photo by Laura MurrayOrganic Dutch Gouda Cheese, $10.99/lbSupremely soft and melty, milky tasting and a friend to apples. Good job, cheese.Photo by Laura MurrayNo Sugar Dry Rubbed Uncured Bacon, $4.49A bacon with less sugar and salt than usual, and honestly, I couldn’t tell the difference. I used it in place of sausage to make broc-bolo, a great success.Photo by Laura MurrayOrganic Sparkling Apple Cider Drinking Vinegars, $1.99Drinking vinegars, and I say this as an expert, are a scam. That doesn’t mean I’m not gonna like these, because I like them. They’re not as acidic as other vinegars I’ve tried (good news for my enamel), bubbly, and sweet without much added sugar. In fact, these are mostly carbonated water, like Spindrift. Strawberry-basil was jammy and barely herby.Photo by Laura MurrayOrganic Cold Pressed Green Juice Beverage, $5.99Separates into a watered down Rothko, flaky green water on top, swampy green on bottom. Savory and healthy tasting—very grass forward—and much cheaper than the stuff from, you know, JuicePlaces.Photo by Laura MurrayBlack Bean & Cheese Taquitos, $3.99What’s fun about these is when they cook in the oven, the black bean filling oozes out of the taquito and you’re left with these puddles of black bean turd on the baking sheet, which solidify when they cool, and taste pretty good. Otherwise need a lot of hot sauce.Photo by Laura MurrayChicken Chilaquiles Rojo, $4.99I am patently against anything bag-within-a-bag, and we have SEVERAL here. The chips, the cheese, the sauce. They all combine into a saucy, chippy mess that I ate until the last crumb. The chicken is sparse, the sauce is mild, and sure, you could make a sheet tray of nachos for dinner instead, but the heart wants what it wants.Photo by Laura MurrayLight Ice Cream, $2.99My auntie ate these wannabe Halo Tops before I got a chance to try them, so here’s her review: “It was cold, it was low in milkfat, it was chocolate peanut butter ice.” Would you buy them again? “It wouldn’t be high on my list.”Photo by Laura MurrayCauliflower Butternut Squash Risotto, $3.69Looks like fresh human vomit. Barely seasoned. Hard, toothsome texture. Inedible.Photo by Laura MurrayOrganic Pita Chips With Sea Salt, $2.29Get a whiff of Ace Hardware when you open a bag of these. For some reason, they have a terrible wood chippy aroma, but you can mask it with enough garlicky hummus.Photo by Laura MurrayFocaccia Bread with Roasted Tomato & Parmesan, $3.99This flour-flavored focaccia is skimpy with the toppings and way too dense to call itself focaccia. My loaf had approximately three wimpy tomato smears on it, so despite filling my apartment with pizza smells, it tasted like someone’s rejected Chuck E. Cheese pizza crusts, shoved to the corner of a grease-soaked paper plate. I’m still going to eat them all, but I won’t be happy about it.Photo by Laura MurrayCinnamon Bun Spread, $3.49Auntie tried this and tossed it before I was given a chance to try. (Ruthless!) “Too sugary,” she deemed it, but told me it had a buttery, caramel-y texture, maple flavor, and serious saltiness. Not worthy of keeping around, though.Photo by Laura MurrayHoneycrisp Apple Diffuser, $4.99Cooking an apple pie will fill your home with the unparalleled scent of baking apples, but a Honeycrisp diffuser...no, it doesn’t get close at all. It smells like artificial apple Glade Plug-in in here. Which is still better than the scent of that Fall Harvest Salsa.Photo by Laura MurraySimply Almond Beverage, $4.99No added gums or thickeners here, so it’s watery. Little white flecks float about, ignore them. Bad for coffee, good for cereal. Speaking of cereal, it sort of tastes like the cereal milk you’re left with when you dig into a bowl of Great Grains (shout to to Great Grains).Photo by Laura MurrayHerbs de Provence Olive Oil, $3.99Rosemary olive oil, pairs well with doughy focaccia. Put this out at a party, tell people you brought it in Paris. They’ll believe it! Maybe!Photo by Chelsie CraigVanilla Flavored Baton Wafer Cookies, $1.99Trader Joe’s is now selling your favorite cookies from the checkout lines at T.J. Maxx. They’re good—a crispy wafer tube stuffed with vanilla frosting—but dated, no? I can picture a cylinder of these in a breakroom somewhere as decades pass and no one knows if the cookies are being eaten, or if it’s been the same package all along, growing older and more complacent as they edge toward retirement.Chai Concentrate, $2.49Even diluted with milk and ice, this was wayyyy too sweet. Is this adulthood? Things are “too sweet” for me now? Are fart jokes suddenly going to seem “unfunny”? How sad.Photo by Chelsie CraigEverything Ciabatta Rolls, $2.49The tops are seasoned with TJ’s super popular Everything But the Bagel Spice, and I have nothing to complain about. And they’re pre-sliced! Inside, the dough is holy and spongy, springing back into shape after I tried to smush it into a ball. Incredible.Photo by Chelsie CraigCrêpe Wafer Cookies, $2.49Another vaguely European T.J. Maxx checkout cookie, these ones resemble blah gingerbread triangles. But then you bite in and realize it’s like 100 layers of sugar-butter paper, an extremely fun texture to eat. Like cookie phyllo! Our office INHALED these.Photo by Chelsie CraigPatio Chips, $2.29The bag is mixed flavors of chips, which I believe (consults potato chip almanac), has never been done before. Now I know why! Every chip tasted like dill.Photo by Chelsie CraigOrganic Spicy Taco Sauce, $1.99What is… “taco sauce”? It sounds like we’re skirting around something here. This gloopy, tomato- and onion powder–heavy sauce reminds me of the canned Ortega enchilada sauce my Tex-Mex-enthusiastic family relied on. (Oh wait, Ortega also makes “taco sauce”? Interesting, interesting.) Well, Joe’s was thick and tomato paste-y, which puts it out of the hot sauce camp. At least it was spicy, as promised by the cheerful mustachioed skeleton. (Is that your artwork, Bobbi? Hi Bobbi!)Photo by Chelsie CraigStrawberry Greek Frozen Yogurt Parfait Bars, $2.99So it’s a popsicle with softened granola flecks in it. At first, the chewy granola caught me off guard, but once I accepted the lie that I was eating a healthy little frozen parfait, they were delicious. Great tangy yogurt flavor, strawberry ice cream creaminess, and since there’s granola, you can have these pops for breakfast on hot summer mornings.Photo by Chelsie CraigOrganic Cold Brewed Hibiscus Tea & Lemonade Beverage, $1.99I love agua de jamaica and make it summer-long, and you should too! It’s tart and floral, and unrelentingly sour if you omit sugar and are into that kind of thing. Here, Joe sweetens it with lemonade, and I drank it happily. I much prefer this pink drink to the Barbie champagne (reviewed in our last update).Photo by Chelsie CraigGeorgia Pecan Butterscotch Chip Cookies, $3.29These buttery crispy coins are the cookies Joe does best. While some were stuck together like colliding snowmen, I ate them by the handful. They left a film of buttery grease on my fingertips to remember them by.Photo by Chelsie CraigGreen Tea Mochi, $4.49Joe reports that he changed the supplier on these, and promises that they’re now made with real sugar instead of corn syrup, yada yada. While the updates to the recipe succeed—the rice flour pillow shell was soft and chewy, the green tea ice cream inside milky and delicious—the new packaging didn’t. Some mochi were ripped open and others stuck together.Photo by Chelsie CraigBloody Mary Salsa, $2.99Salsa with horseradish and pickle juice in it; leaves an after-burp (technical term) in your mouth of stale fire. Pass!Photo by Chelsie CraigBlueberry Lemonade Sparkling Water, $.42I jotted down notes of… “blue.” Citric acid zing. So if “anything but water” is the flavor you’re seeking out in water, you’ll love this one. It definitely does not taste like water.Photo by Chelsie CraigPimento Cheese, $3.99Grandma Knowlton’s is better—because two types of cheese gives you more flavor, and a pinch of cayenne keeps you coming back for more. This is pretty one-note (the note is CHEESE! written in bubble letters), but this’ll do when I don’t feel like shredding two blocks of cheese and waving my hands about in a stirring gesture. Straight from the fridge it’s a solid puck, so you need to get it up to room temp before attacking with a sleeve of Ritz at the beach or spreading it onto a life-changing grilled cheese.Photo by Chelsie CraigMango Gummies, $1.99\"Goooooomies!!\" She cried out to the midnight moon! These have a fantastic chew, unlike most of TJ’s other gummies, which are too soft. The mango flavor is juicy and strong, but the yogurt ones paled in comparison—literally. They had white slashes, and also taste like nothing.Photo by Chelsie CraigChili Onion Crunch, $3.99Trader Joe’s take on chile crisp, the greatest condiment of all time, gets an A for effort. It’s mostly dehydrated onions and red bell peppers, so it’s very crunchy and not very crispy (THERE’S A DIFFERENCE). Like little onion rocks. There’s not a lot of heat or ~depth of flavor~ (especially compared to this recipe, with star anise, cinnamon, fried shallots and garlic, plus tons of chile flakes—a personal obsession). I say make it at home instead.Photo by Chelsie CraigMac and Cheese Bites, $3.99A PERFECT FOOD. It has finally happened! We have been blessed. Joe’s looking out for us. He created a frozen food that caters to our deepest, cheesiest desires. These fried balls stuffed with cheesy pasta bake at 450 for 17 minutes and come out crispy on the outside, gooey inside. No demerits. Serve with jalapeño jelly. Or whatever.Photo by Chelsie CraigTurmeric Ginger Coconut Beverage, $2.69Joe writes a brief history of haldi doodh—an Ayurvedic Indian bev starring turmeric, milk, and usually some black pepper, ginger, or cinnamon that’s been around for centuries and now beloved by wellness-types—on the side of this carton as a nice little FYI. The drink is coconut creamy and lightly spiced. Too lightly, IMO! I couldn’t detect the cinnamon or black pepper at all, and wonder if they got lost somewhere in the Flavor Dept. of TJ HQ. You can only taste the turmeric and a hint of ginger juice. Warning! The pull-top lid is a booby trap, hold it far away from your body unless you want to splatter your clothes with turmeric.Photo by Chelsie CraigHoney Pale Ale Mustard, $1.99It’s sweet and tangy at first, and then you get that bitter, yeasty beer aftertaste. “Not bad!” I wrote on a Sticky Note when I added to our free table. I don’t need another mustard in my life rn, thanks for asking.Photo by Chelsie CraigStrawberry Fruit Spread with Natural Rose Flavor, $2.99Wow, “natural rose flavor” sounds about as enticing as “fruit spread.” The language of FDA-approval isn’t always delicious. But this spread is totally fine, it’s sweet and strawberry forward with only a whiff of “rose flavor.” The texture isn’t jam-like, there are no chunks of berries, just that gelatin jiggle, as if you’d made smooth jello and then whisked it into ...a mess.Sparkling Watermelon Juice, $3.99/4-packLike a pair of wedge sandals I’m waiting to go on sale, this juice is pink and sparkly and I’m genetically inclined to need it. Hey, I don’t make the rules. Marketers do! I’m sad to report that this bubbly Barbie juice tastes like stale citric acid and fake champagne. Going to stick with the fresh stuff until someone can bottle time.Outside-In Stuffed Gnocchi, $2.99I waited weeks to try this one, and it was fine. It’s frozen gnocchi, bigger than usual, stuffed with pizza flavor (an inner ooze of tomato + a few wisps of shredded cheese). The pillowy potato dough was satisfying in the way gnocchi is, but if I eat this glorified airplane food every week I will turn into a puffy gnocchi ball myself. I’m sorry, it’s true. The flavor wasn’t amazing enough to be worth it.Banana Date Nut Bread Crisps, $3.99I suppose, if your cheese plate was just a block of Philadelphia cream cheese on a plate, these would be the perfect crackers. They taste like Christmas cookie-spiced banana bread, but crunchy. Not bad, for a cookie! Weird, for a cheese plate. Another idea! Open-faced ice cream sandwiches! (As in: you, dipping crisps into pint of ice cream in the dead of night.)Cold Brew Coconut Cream Lattes, $1.99This takes me BACK. To days spent chugging caramel Frappuccinos from the cutsie glass bottle (bought on sale at Target) before I knew sugar was bad for me. Sweet, milky, vaguely coffee-ish. The Caramel-Spice flavor delivers that caramel syrup I (and maybe you!) know full well from early suburban Starbucks days, sitting in between the stacks of Barnes & Noble with a caramel macchiato while reading forbidden Cosmo. The coconut cream is rich, high in fat, and lightly flavored (not too sunscreeny, thank goodness). A special, special treat.French Fromage Slices, $4.99One staffer called these slices “Babybels run over with a steamroller.” Another said, “I don’t think I’ve eaten something that tastes so less like food.” And the rest of us ate them all anyway, because cheese is cheese. We called them “cheese slicks.” This flavorless, rubbery, milk cheese is white, oval, and sort of stretchy. Befuddling. Also lol: Fromage. Makes me want to fill a beret with nacho cheese and dip chips into it.Chocolate Covered Mini Pretzels, $3.49Even critical food director Carla Lalli Music admitted there was nothing wrong with these chocolate-covered pretzels. Editor in chief Adam Rapoport said they were “perfect” and “snappy.” And then went on a rant about how you know you’re an adult when you prefer dark chocolate to milk, which makes me still a child (not news to me). Good thing these pretzies come in both.Egg Frittata with Swiss Cheese & Cauliflower, $2.99Just make your own eggs, people. You’re going to turn on the oven (to 425!) for a 3-inch circular egg patty the texture of three yoga mats? Why did they add whey protein to an EGG? I have some fundamental problems with a microwaved egg puck, but I did it anyway to avoid turning the oven on, squishing my finger on the greasy center to check its doneness. How did I find myself here?Benne Wafer Cookies, $3.29These crispy quarter-sized cookies wrap up an entire history of Southern low-country cooking in a bag with quilt patterns on the side. (Benne seeds were brought to South Carolina from Africa during the slave trade; Edna Lewis had a famous recipe for benne seed wafers.) They’re crispy, buttery, and nutty, reminiscent of those honey-roasted sesame sticks you can also buy at TJs. I kept them at my desk for myself.Watermelon Cucumber Cooler, $3.49Liquid Jolly Rancher!Organic Salty Squares, $1.99Generic Saltines are never quite as airy as the original. Same story here.Soft-Baked Peanut Butter Chocolate Chip Cookies, $2.99Smushed and near-burnt on top, these cookies crumble like a kid on a playground who gets a foot to the crook of his knee and everybody laughs and laughs. Good times. Bad cookies.Oat & Greek Yogurt Sandwich Cookies, $2.99These divided the BA staff. The exterior oat cookies are nutty and delicate sandies that dissolve wonderfully, but then the Greek yogurt filling threw us off. It reeks a tangy perfume too similar to bath soap. Others found the stiff filling as delicious as canned cake frosting. Decide for yourself!Buttermilk Protein Pancake Mix, $3.49Whole wheat pancakes with added whey, hey! Something my diet doesn’t require, but maybe you’re trying to bulk up, bro, well, these are the pancakes for you. Floppy and spongy, they don’t get much lift (the instructions say to mix minimally, but usually with whole wheat flour, the more you mix the more they rise—it’s science, look it up in Cook’s Illustrated). The flavor was flour-y, so I’d suggest adding buttermilk or vanilla or chocolate chips to make them more interesting. I flexed my biceps after eating a stack and I swear I saw something quiver in there. Must be working.Cedarwood & Sage Multi-Purpose Cleaner, $2.99Smells pretty good! Woodsy but sterile. Put that on your dating profile.Ghost Chile BBQ Sauce, $2.69First ingredients are water, sugar, and tomato paste. But honestly, tasty—smoky, molasses sweet, and a ghost chile heat that’ll make you cough but keep eating. I got an odd aftertaste I couldn’t place, sort of plasticky? The flavors bounce after each other and never quite fully balance, but add a rack of ribs and a Dr Pepper and you’ve got yourself lunch, my friend.Organic Chocolate Chip Cookies, $3.49Famous Amos or Chips Ahoy? These small, hard and craggy cookies have a whiff of school snack nostalgia. You need a carton of milk to help them go down; or a gullible friend to trade them for Oreos.Vanilla Wafer Cookies, $3.49Here’s where things get interesting. Joe has recreated the Nilla Wafer, but overcompensated. In place of [super processed stuff], there’s salted cultured butter. That real butter flavor comes through nicely. Good one, Joe! But the vanilla extract had a sharp, alcoholic edge. The soft cookie also made me worry they would turn to mush in Nilla Wafers’ greatest use: icebox cake.Organic Spicy Avocado Hummus, $2.99There’s only a memory of spice here, buried under chickpeas and tahini. As buzzy as avocado is, it doesn’t add big (...or any) flavor. Some described the hummus as watery, but I think they were just trying to name that eternal nothingness.Jalapeño Sauce, $3.49HERE’S the spice. In a slow, blobby sauce that’s somewhere between hot sauce and creamy emulsified aioli. But finally, SPICY. Straight jalapeño flavor comes through and a smidge of sugar offsets the burn. I dipped cold steak in it, a fantastic idea. Would be great as a crudités dip, spread on a sandwich, breakfast burrito, or as dressing on roasted veg. INTO IT.Fudgy Chocolate Quinoa Loaf & Cake Mix, $3.49An oily cake with an extremely fine crumb. Each slice had a silky smooth texture, unnatural to cake-kind. The flavor fell flat for me, and I was too embarrassed to share it with others.Mochi Cake Mix, $3.99Trader Joe’s best boxed cake mix, hands-down. The instructions on the box say to add water, eggs, and butter, but online the company suggests coconut milk in place of water, with coconut flakes on top, so I did that (next time might add a pinch of salt too). The rice flour cake is bouncy and chewy, the coconut flavor is real enough, and the browned edge pieces are extra chewy-good. I ate half the cake.Jerk-Style Plantain Chips, $1.79One staffer loved these so much she asked me for the rest of the bag. The peppery seasoning chip dust electrifies your tongue, thanks to warming allspice and ginger.Milk Chocolate Caramel Crunch Medallions, $2.99When I gripped a medallion in my hand, the center caved and a popping pimple of caramel oozed out. Entrancing! But sadly, I had to quit after one cloying bite. Too sweet, no balance.Milk & Dark Chocolate Butterscotch Bits Bar for $1.79Needs! More! Bits!Organic Coleslaw Kit, $2.69I don’t mind the pencil shaving faded carrots and pointy cabbage lighting bolts; they all stay crisp and crunchy in their journey to TJs’ shelves. It’s just the dressing, which is more like sweet and gloopy cinnamon roll frosting, that I can’t get behind. Some people like a sweet coleslaw though, so I can see the appeal, maybe if you’re making spicy chicken sandwiches or something. To each her own.Creamy Chicken & Poblano Ravioli, $3.69These striped raviolis are streaked the orange and green color of a clown’s wig. But unlike the beet-dyed garganelli, which faded in boiling water to a putrid flesh color, these maintained their trippy look. So if you’re like, “I’ve really been trying to eat every color of the rainbow,” these pasta pockets of ricotta and parm will score you two. The pasta is silky and the ravioli don’t stick to each other in the pot, and you really only need to sauce them with some butter and salt, there’s so much going on inside (same). According to rudimentary studies, about one in every four ravioli contains the promised chicken, but we’re here for the cheese and the faint reminder of poblano. These are not spicy, Cheryl.Broccoli & Kale Pizza Crust, $4.29What a ruse! Imagine my shock/awe when I unwrapped the plastic packaging to discover a frisbee of broccoli masquerading as a G-D PIZZA CRUST. I closed all the blinds. (I live across the street from a slice shop.) (Or do I cook naked?) However, I was game. The crust is mostly broccoli, puréed and sculpted into a dough-like state with cornstarch, corn flour, potato starch, and then just a bit of kale for a deeper green flecked visage (and kale = marketing gold). In theory? Innovative. In practice, it remained too soft and floppy, never crisping up in the center. My toppings were mozz, parm, anchovies, and jalapeños. It felt like eating a broccoli-cornbread pancake. If you want broccoli and cheese for dinner, try Carla’s Broccoli Delight instead.Shakshuka Starter, $1.99Flot! That was the noise this frozen patty of tomato sauce made when I upended it into a small cast iron pan. The tomato glacier melts for a dangerous 7 minutes. You WILL get sauce on your shirt. Add two eggs, accidentally overcook them, and eat. (Was this two servings? I ate the whole thing.) This starter package is “bring your own eggs” as well as “bring your own bread,” so I ate it with TJ’s buttery frozen paratha (reviewed below), and promptly got more sauce on my second shirt. The sauce is somewhere between pizza sauce and salsa. As it came to room temperature, it solidified into a paste. Maybe BYO-feta would help, or some herbs. I will say one thing, it came together fast. So there’s that.Dark Chocolate Almond Butter Cups, $3.99Trader...Justin? Is that you? The almond butter-sugar mixture inside these is nutty and creamy, not grainy or dry. I ate four to confirm. The base of the cup is solid and makes a snap when you bite in. These cups have structure and sophistication. That’s more than you can say for some of us.Ultra Hydrating Gel Moisturizer, $8.99Pretty sure this might just be slightly solid water. Unpleasant, plasticky smell.Organic Buffalo Style Hummus, $2.99Imagine putting a lot of hot sauce in hummus. (It’s still hummus.)Milk Chocolate Caramel Popcorn, $2.99Globby, lumpy globs of thick chocolate coating over stale caramel corn. This entranced half the BA staff and horrified the rest. You be the judge.Gummy Bunny Tummies, $1.99“Medicinal!” “Not enough gush!” “Sour and tart!” “Sunny D!” “Vitamins.” These were the tasting notes we jotted down for GUMMY BUNNY TUMMIES—& FRIENDS! Some of the poor friends are pockmarked and indecipherable. Is that...an egg? But these are natural-fruit juice Gushers (with less gush, that was true) doing the best they can. I liked their unexpected tang and soft smoosh.Organic Elote Corn Chip Dippers, $2.29They are dusty! They are salty! They are spicy! They are COOL RANCH EXTRA LARGE FRITOS. They are photographed with guacamole, but that’s totally unnecessary. They are FLAVOR INCARNATE.Watermelon Jerky, $3.69One triangle of piggy pink watermelon “jerky” had folds Judy Chicago couldn’t have sculpted better herself. These are soft, sticky, slightly chewy, and overall, unremarkable. They taste like dehydrated watermelon, because they are. I prefer WaJu.Gochujang Chop Salad Kit, $3.99Shreds of lettuce, a one-note, watery gochujang dressing, and puffed rice crunchies to keep you distracted from the bigger problems in your life. Can a salad really do that? This one can. Add avocado.Vegetable and Soba Noodle Stir Fry Kit, $4.99Another bag full of bags, and in this case, one is filled with a gluey brick of congealed soba noodles that you soak in warm water then separate. My noodles broke into pieces like fideo. The cabbage in the stir fry had the gray, dried-out edge pieces from the base of the plant, which I had to pick out and compost. Joe, why?! Everything is dressed in a cloying soy-ginger sauce. Not enough food for two people, but two people didn’t want any more of this anyway.Sweet Basil Foaming Hand Soap, $2.99This sweet, sweet soap isn’t savory and herbaceous like another basil-scented hand soap you may know. It has whiffs of Bath and Body Works’ iconic coconut lime verbena, and leaves a sugary perfume on the knuckles. Not mad about it.Almond Ginger Scent Oatmeal Exfoliant Bar, $2.99A whisper in the suds asked, Are you Aveeno?Pancake Bread, $3.99Disappeared on our office snack table in ~9 minutes. Some moaned. Some groaned. One called the cinnamon sugar on top “flavorless wet sand” while another cried out, “I LOVE THE WET SAND!” The texture was dense, buttery, and squishy. A saturated cake. The maple syrup wasn’t too strong. Christina Chaey made eye contact with me and said deeply, “This is good. This is really good.” “Could the bakery supplier behind it be Entenmann’s?” someone asked, sparking a rumor we can’t shake. (For anonymous tips, please email staff.bonappetit@condenast.com.) WELL, PEOPLE. THE HYPE IS REAL. PANCAKE BREAD IS GOOD SH*T. FINE, I GIVE IN. IT WAS WORTH THE WAIT. WORTH $4. WORTH THE UNHEALTHY AMOUNT OF WHITE SUGAR. UGHHHH JOEEEEEE.Organic Thick & Chunky Salsa, $2.49That citric acid zing! Salsa that will preserve you from the insides. This spicy but watery, mushy salsa will do in a grocery store salsa pinch. It isn’t too sweet. However, it is not good. And for the love of Joe, do not make it into vegan soup. That’s...not right.Organic Green Vegetable Foursome, $2.99The word “foursome” here makes me uncomfortable. I don’t like to imagine cruciferous vegetables doin’ it. Like, who goes first, the green beans and the broccoli? Now I can’t stop thinking about it. I didn’t spy a single zucchini, nor did I taste any of the spices listed in the ingredient list (paprika whomst?). What we have here is a bag of frozen vegetables. Do your thing.Freeze Dried Red Seedless Grape Slices, $2.49THEY LITERALLY DID SURGERY ON A GRAPE. Joe sliced and then dehydrated red freaking grapes. Can you believe it? I can’t. It doesn’t seem like a good way to spend time. But I ate the whole bag. Because while these grapes look like crackly human scabs, they taste like concentrated grapes, with an airy crunchy texture. Some get stuck in your cavities, but doesn’t all candy? They’re candy.Gluten Free Cocoa Crunch Cereal, $3.49“Did you have a rabbit growing up?” Alex Delany asked me, “because this is what rabbit poop looks like.” Too bad this rabbit poop is delicious! But ONLY WITH MILK. The light and airy balls are sweetened with sorghum, and hardly any cocoa. But your kid won’t know what he’s missing (he’s missing Cocoa Puffs, poor baby). I love the rice-y aftertaste. If you close your eyes when you drink the cereal milk, it could be horchata.Onion & Chive Cream Cheese Spread, $1.99Let it warm up unless you like to spread cement. Good stuff.Sprouted Wheat Sourdough Bread, $3.99If it’s so sprouted, then why isn’t it sold in the refrigerated aisle? 🧐 Ezekiel this is not. Toasted and buttered, this bread sogs in the center like any processed sandwich bread. There’s a nice nutty wheat flavor and a mysteriously chewy texture, but I’d take the tangy TJ San Francisco sourdough over this any day of the week. For whole grains, try steel cut oats!Jalapeño Lime Almond Dip, $3.49We were rooting for this one, but sadly it was voted off the island (timely Survivor joke). But honestly, if you were stranded on an island with this floamy, modeling clay-scented dip—I’d recommend teaching yourself how to noodle before going for the dip. Nut expert Andy Baraghani thought the concept was good, but it needed to be made of another nut, like hazelnut or cashew, because almonds are too dry. As a result, the dip has the texture of rained-on styrofoam, and tasted of leftover almond milk pulp.Avocado Tzatziki Dip, $3.99We were rooting for this one too! We love dips! However, another dip has been voted off the island. The dose of cucumber here is TOO HIGH. So much so it nearly tastes like melon, an oddly sweet and soapy flavor. The smooth and mousse-y texture only added to the sensation that we were eating body butter. Per the BA Test Kitchen editors who tasted it, the recipe needs more salt and spice to move it to the savory direction.Organic French Rolls, $2.29Solid rolls. Dinner rolls. A decent roll.Amba Mango Sauce, $3.29Sauce bag! This creamy mango sauce has a nice garlic-cumin funk, and I’m guessing the ingredient “spices” is...curry powder? Joe and his secrets. I dipped pretzels in the Amba and it was great. Priya Krishna, who wrote about the Amba at Golda in Brooklyn if you want to learn more about it, told me she wasn’t offended by it either and suggested brightening it up with fresh cilantro. I imagine serving it on crispy-skin salmon. Floppy boneless, skinless chicken breasts would be awesome too.Previously, before I finally got my pancake loafCinnamon Croissant Loaf, $5.99While the best-by date told me I had some time, it turned out that this loaf dries out quickly. It had the wispy texture of Donald Trump’s combover—hard to swallow. It’s not as sturdy as toast toast, so I wouldn’t load it up with almond butter and banana slices or shove it between the cracks in the brick siding of my home. However, the dryness could be offset in a big batch of French toast casserole. WHERE’S THE PANCAKE LOAF, JOE?Antipasto Mediterranean Vegetables and Cherry Tomatoes, $2.99These “half-dried” antipasto veg things are about as tasty as they look, which is gross. Slimy and oregano-ed up the wazoo, deeply in need of acidity from fresh lemon juice or vinegar, I could only stomach a few bites of each before deeply pondering the customer this is meant for. Someone who wants a cheese plate no one will touch so they actually eat all of their dinner? Okay, maybe them.Joe-Joe’s Slims, $1.79What happens when you slim down a perfect cookie? There’s crispy crunch, sure. But the ratios go askew. Here we have too much chocolate flavor, not enough cream filling. You’re left wanting.Chocolate Chip Pain Au Lait, $2.99Sweet and squishy! It reminded me of a sweeter kolache, or a Hawaiian roll with bites of acceptable near-melty chocolate chips. READER, IT’S DELICIOUS. We all loved the way the shiny milk bread springs up after your finger’s left an indentation, like a carb trampoline.Lemon Cookie Scented Candle, $3.99Froot loops and graham crackers.Organic Honey Hedgehogs Snack Packs, $2.99 for a box of 6These are for sweet, innocent children who’ve never tasted the beautiful corn syrup landscape of an original Teddy Graham. Suckers! They’ll love these alongside a lukewarm carton of 2 percent milk. These cookies are sandy and slightly sweet, and the shape of one of nature’s oddest looking mammals.7 Seasoning Salute To Salmon, $10.99This huge frozen salmon filet packaged in a vacuum-sealed plastic contraption is as long as a Big Mouth Billy Bass, but it won’t sing on your wall for unsuspecting dinner guests. Nope. It’s pre-seasoned with TJ’s 7 Seasoning Salute, which is garlic, onion powder, cumin, black pepper, and some dried herbs. As Billy the Salmon roasted, my entire apartment smelled like barbecue, not a bad thing. And it’s low-maintenance: you just put it on a pan and go. I found the salmon strongly fishy in flavor (I wonder if it’s because you cook it straight from frozen, versus thawing?), but it flaked off in nice big coins. I give it four salutes (with my toes).Beer Bread Mix, $2.79Pour a bottle of Shiner Bock (or whatever beer represents who you are inside) into the dry ingredients, shred some cheese directly into the mixing bowl, douse everything in melted butter and blammo, 50 minutes later you have loaf bread version of Red Lobster biscuits. Buttery, moist, sweet, and yeasty. I can’t in good conscience tell people to bake with boxed mixes because we...develop recipes for a living...but this is a great product to eat. Dammit!Corn, Pea, Bean & Quinoa Crisps, $2.49Sort of like Popchips meets Popcorners meets a wolf in the woods trying to eat your granny. What are these things? The texture of packing peanuts with just as much nutritional benefit. Certain coworkers couldn’t stop eating them, because: salt. The bright dehydrated green dried peas will be familiar if you’ve ever had Cup Noodles. I don’t trust ‘em.Rich Hydrating Face Sheet Mask, $1.99MOUTH HOLE NOT BIG ENOUGH. I could only suffocate under this for six minutes before giving up. I need face masks with mouth holes big enough to sip my martini without getting moisturizer in my gin. This didn’t make the cut! But even then...my skin was so soft after.Organic Rosé Vinaigrette, $3.49Food director Carla Lalli Music caught me trying to take a shot of this dressing out of a plastic cup in the Bon Appétit Test Kitchen. I had a problem, I told her. The vinaigrette had separated and the rosé part was an amoeba bubble in a pond of olive oil, so every time I tried to sip it, all I got was oil. “No industrial stabilizers,” she noted wisely while reading the label. Once you do shake it to something close to mixed, you realize the rosé vin has an oxidized, unpleasant flavor and the dried oregano gets too much air time. Doesn’t it always?Chocolate Covered Wafer Cookie, 79¢These chocolate covered wafers are the chocolate covered versions of the Keebler ones my grandma always had stashed among the powdered donuts and ice cream cups and orange pop. If you’re wondering if she had diabetes the answer is yes, and it runs in our family, weeeee! Aaaanyway. These are airy, crispy, and feather-light. A little dry if I’m being honest (shifts eyes towards strangers across the floor). But I can turn a blind tooth to that for 79 cents.Organic Earl Grey Tea, $2.49Big Earl Grey fans (write as if the Queen is reading, write as if the Queen is reading) might find this too mild for their royal tastes, but it’s nice and floral, pleasant and light. By royal decree: a good desk tea.Red Honey Processed El Salvador Coffee, $8.99This is a medium roast coffee but it’s definitely closer to light, which is my favorite roast (more flavor!). Because of that bias, I loved this coffee. I’m not great at pinpointing notes in coffee (or have the bold confidence to spew them out), but I could tell it was complex and round, not one-noted and burned, or worse, flat and stale. It can stand up to other fancier brews in my modest routine any morning.Dark Chocolate Sunflower Seed Butter Cups, 99¢Really bitter and pasty, unless you like bitter and pasty, in which case you’re Emma Wartzman and you’re the only person who enjoyed these things. Great, take the whole package, get them way from me!Jackfruit Cakes, $3.99Like highwater jumpsuits and tiny sunglasses we’ve got a TREND ALERT. The box brags that these are vegan crabless cakes, which means the jackfruit—a gigantic tropical fruit that, in its young stage, tastes like nothing—is shredded like crab meat and doctored up with celery salt. It tastes like celery. Some onion. The exterior gets crispy in the oven, and a generous salting almost reminded me of a scallion pancake (there’s a ton of tapioca and potato starch to bind, giving them that savory pancake gummy quality). It’s oddly tough and harder to cut with the side of your fork than a tender, delicate Real Crab Cake, but I hear imitation is the sincerest form of flattery.Brussels Sprouts & Caramelized Onion Ravioli, $3.49Dr. Seussian green stripes are an indication to your brain that you’re eating vegetables. In reality, these are pillows of cheese, specifically European sham pillows of cheese. DELICIOUS CHEESE SHAMS. The caramelized onion gave them a pierogies vibe that I was not mad about. I added shredded parm on top and browned butter because if you’re going to go all the way, go all the way.Gluten Free Crispy Crunchy Salted Toffee Cookies, $3.99A downright suspicious competitor to Tate’s! So crispy-crunchy, with inexplicable little holes that make the whole cookie look pock-marked and planetary. The rice flour base turns to watery sand in your mouth, an intriguing experience. Plus they’re salted to the nth degree, which makes you want to smash them like Cookie Monster (did you know the cookies he smashes are actually rice cakes?). These are wonderful.Malabari Paratha, $1.99Kinda greasy and dry at the same time.Organic Spinach and Riced Cauliflower Salad Kit, $4.99Ugh, all I asked for was NO MORE SALAD KITS in 2019, but Joe clearly wasn’t listening. Must be listening to the market instead. The cauliflower maggots sank to the bottom or stuck to the side of the mixing bowl, but the sweet golden beets in this kit were a nice surprise after opening SIX INCREASINGLY SMALLER PLASTIC BAGS.Fruit & Nut (& Other Stuff) Crisps, $3.99These are orange-flavored crackers with stained glass windows of dried apricot that get stuck in your molars. My corrupt dentist would not want me eating these, but would love if I interviewed him for a story in exchange for a free cleaning.Chocolate Pecan Pie Bar, $6.99I thought this would be, you know, pecan pie, but it’s gooey. All chocolate and sugar and goo. MISSING: NUTS. Some pecan limbs were left behind, but that’s not going to cut it for me. I’m from TEXAS. We love pecans! Where are the pecans?! Also not corrupt dentist approved.Smoked Salmon Trio, $12.99Ranked by flavor from best to meh: 1) Pleasantly peppery black pepper, 2) amusingly pink beet–cured, 3) dill that doesn’t taste like dill at all.Mushroom & Company Umami Seasoning Blend, $2.99So we’re going to keep throwing around “umami,” huh? It would be a good dog name, honestly. “This is umami, he likes listening to classical music podcasts and sniffing butts.” This tastes like French onion soup stock: overwhelming onion and mustard seed, not that funky. I prefer the Spice House’s porcini salt if you want to get shroomy (add it to the water you’re making rice in!).Rolled Corn Tortilla Chips, Chili & Lime Flavored, $2.49These rolly chips are harder and sturdier than Takis and the chili lime flavor is SO SOUR it will make your cheeks pucker and burn...in a good way. The chemical flavor is especially zingy paired with a cheap pilsner or shot of tequila. The not-Hot Cheetos from TJ’s are still my favorite, but these were a wild ride.Stay tuned for more reviews for THE REST OF THE YEAR.Explore Bon AppétitTrader Joe'sTrends + NewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-14", "author": ["Condé Nast", "Alex Beggs"]}