{"id": "cd68e846663708f02883a45ade7f64a0", "url": "https://www.bonappetit.com/story/alison-carroll-noodle-bowl", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "The Noodle Bowl Recipe That Alison Carroll Loves | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOn Breaking Food Rules and Learning to Cook the Food You LoveHow Alison Carroll found balance through cooking, and the anti-inflammatory lunch bowl she cravesBy Alison CarrollMarch 12, 2018FacebookTwitterEmailPhoto by Jay CarrollFacebookTwitterEmailIt was my first visit to a far-out California chiropractor. I had just arrived out West by way of Philadelphia, a decade of cheesesteaks under my belt. I remember filling out an intake form in a sunny glass greenhouse and feeling equal parts wary and excited.  It was the first time I was evaluated as whole person—organs, bones, blood and emotions, all of me. And it was then that I started to really take a look at the state of my health, to connect the dots between seemingly unrelated ailments, and to take ownership of my well-being.At first, the changes that I decided to make for the sake of my health were daunting. I grew up in an Italian family back east, so removing gluten and dairy from my diet felt like a death sentence. Suddenly, going to a restaurant or to a friend’s for dinner left me feeling ashamed and feeling high-maintenance. But over time, the concept of good health wasn’t just some abstract idea; it was something I began to experience first hand. My complexion started clearing up.  Deep, restful sleep became a regular thing, giving me focus and clarity. And that quiet guiding voice that we all have—call it gut instinct or intuition—well, the volume was turned way up.So I began pushing the boundaries of healthy eating.  I tried restrictive dieting, intensive cleanses and fasting, deep dives into books and articles on the latest trends and studies. The further I went down the rabbit hole of health and wellness, the further away I got from the great pleasure I used to take in cooking and eating. Eating in a really restrictive, limited way was essentially eating with stress and longing. I wanted the big Sunday roasts, the carbs, the fat, the sauces, all of it.  I wanted to extract the analytical and judgmental part of healthy eating and just get into the joy of it.Carroll with Wonder Valley olive oil\nPhoto by Jay CarrollSo I started focusing on techniques. We built a large wood-burning outdoor kitchen that makes a farmers’ market haul of produce over the grill with some herbs and olive oil feel like a decadent feast. I stopped trying to make gluten-free alternatives to favorite dishes; instead I focused on whole foods, seasonal produce, colors, texture, and techniques with a lot of improvising. I worked on my butchery skills and got into lacto-fermentation.I also began introducing a little more self-compassion when I indulged or broke rules (I’m not going to not eat ramen when I’m in Kyoto). It’s a constant reminder that the point of this journey is feeling good and taking care of myself, not perfection.  I’m also learning that it’s not just what is on my plate but how I eat that matters, I’m doing my best to incorporate more dining al fresco in our high desert home and less dining al Netflix.Unless we're traveling, I end up cooking most of our meals at home here in Joshua Tree. This is not without limitations, but I’m finding my own language of cooking making simple, delicious, healthful dishes that are worth pausing for and enjoying. It’s been a process and a lot of fine-tuning; I don’t have all the answers and don’t expect to arrive to a place of perfect health and happiness. The heart of this reckoning, between food as pleasure and food as medicine, is a realization that I am the solution, not a book, a doctor, a miracle supplement, or a cleanse.In our household, we tend to favor a liquid breakfast (tea, smoothies, turmeric, or mushroom lattes) and rely on lunch to be our more substantial meal of the day. We opt for some easily digestible, grounding grain like rice or quinoa, then go heavy on plants. There’s care given to the vegetables on our plate; usually a combination of raw, steamed, or sautéed as well as fermented vegetables.  We cook together, and we don’t go back to eat at our respective desks; rather, we come together at the table to catch our breath, refuel, relax, and be present. The ingredients in our lunches are inflammation-reducing, so there’s never that post-lunch crash, just a slow burn as we work late into the evenings most days.This noodle bowl recipe exemplifies the generous, food-loving, health-conscious language of cooking I’ve been honing. The broth is a superfood-rich vegetarian dashi of sorts, the grains and add-ins are malleable, but the goal is to have a diverse bowl of colors and textures.  I like to double up on the seaweed using digitata (Atlantic kombu) for the broth and toasting and grinding nori with sesame and salt for a homemade gomasio. Cooking with dried seaweed, aside from the thyroid support it offers, is an easy and flavorful way to bring the nutrients from the ocean to my landlocked kitchen. This humble noodle bowl scratches both itches of being health-fortifying as well as deeply satisfying. And that brings me great pleasure.Break out your bowls because it's brothy lunch time:Brothy Noodle Bowl with Mushrooms and ChilesAlison Carroll, who developed this recipe, relies almost entirely on dry pantry staples to build depth of flavor in this superfood broth. Feel free to swap out the vermicelli for your favorite cooked grain or a different noodle—the recipe is designed to be customizable.View RecipeExplore Bon AppétitHealthyishGrainsLunchBrothSeaweedRead MoreLifestyleHow to Eat Healthy When You Live in a Rural PlaceBy Alison CarrollRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-12", "author": ["Condé Nast", "Alison Carroll"]}