{"id": "cd70041541ac8a6b4053e33a3b0d2f18", "url": "https://www.bonappetit.com/story/how-to-buy-and-use-cornmeal", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "What Is Cornmeal and Which Type Should You Buy at the Store? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Cornmeal and Which Type Should You Buy?So many types of cornmeal, so many opportunities to experiment.By Alex Beggs and Emma WartzmanApril 7, 2021FacebookTwitterEmailFacebookTwitterEmailIt’s a confusing cornmeal world out there. If a recipe calls for cornmeal, you might find yourself in the grain aisle staring down a bag of grits, polenta, coarse cornmeal, fine cornmeal, blue cornmeal, corn flour, and a familiar box of Jiffy, and who do you turn to? All cornmeals have a purpose, and we’re here to help you find the right cornmeal for the job. What is cornmeal, though? Simply put, cornmeal is dried and ground field corn (not the same type of sweet corn we eat off the cob) that ranges in texture from fine to medium to coarse, all of which refer to the size of the bits. The size of the grind indicates how fast the cornmeal will absorb water (smaller grind = faster absorption), which is why coarsely ground grits take so long to cook into creamy goodness. If you’re able to find local cornmeal at your market, swoop it up, because, like wine, honey, and dive bars, cornmeal has terroir, that fancy word for distinct local flavor. “Flavors range from vegetable-y, carroty notes to floral apricots. And just the tiniest hint of citrus,” Roxana Jullapat, baker and author of Mother Grains, told us recently. “Corn has a beautiful grounding flavor.” If you can’t find local cornmeal at your market, though, there are plenty of great online mills, such as Anson Mills, which sell heirloom varieties in a range of eye-catching colors and unique flavors. Find all of our favorite mills here. Now back to the grind.Types of cornmeal:Corn flour is the smallest, silkiest grind of cornmeal. Use it to make melt-in-your-mouth sablé cookies or light tempura batter.Fine and medium cornmeal are your everyday, do-it-all cornmeals. Use them for cornbread, ricotta pound cake, strawberry snacking cake, corn muffins, or pancakes. And honestly, don’t be afraid to experiment with it in recipes that use only all-purpose flour: Substitute a quarter of the AP flour with cornmeal and see how it affects the baked goods’ texture and flavor. (Cornmeal is gluten-free, so you don’t want to substitute it 100% or your cake might be dense.)You can use fine or medium cornmeal in these extra corny muffins.\nPhoto by Chelsie Craig, Food Styling by Molly Baz, Prop Styling by Emily EisenCoarse cornmeal will make your cakes gritty and pebbly, so save that for breading catfish, making Southern-style cornbread (where you want that toothsome texture!), and creating crunchy blueberry crisp topping or creamy, cheesy polenta. Unless a recipe explicitly calls for coarse cornmeal, you should generally stay away. Coarse cornmeal cooks for a long time before losing its granular bite. When it’s incorporated in a dish that does a relatively quick stint in the oven (say, cake), the result will be rocky.Polenta is coarsely ground yellow cornmeal. Use it as you would coarse cornmeal. Grits are coarsely ground white cornmeal, with a more subtle, delicate flavor from the white corn. Use it to make these decadent shrimp and pimiento cheese grits.Blue cornmeal is usually an heirloom variety with indigenous roots across the American South. Its color gives it a sweet, unique flavor. Learn more about it and try this variety from Anson Mills here. Yellow cornmeal has the most prominent corn flavor, while white cornmeal has a more delicate, subtle flavor (it’s especially nice in that ricotta cornmeal cake, below). Jiffy cornbread mix, in case you really are standing in the baking aisle wondering, is wheat flour mixed with some cornmeal, sugar, lard, baking soda, and a handful of preservatives. Note that because of the wheat flour, it’s not gluten-free.What if a recipe doesn’t specify which type to use?If a recipe calls for just “cornmeal” without calling out a specific kind, you can almost always use either fine or medium grind. Just know that a medium grind will give you some texture, while a fine grind might make a denser crumb.Photo by Chelsie Craig, Food Styling by Pearl JonesThis Giant No-Flip Blueberry Pancake was tested with both medium and fine cornmeal, and both worked. “The difference was just that the pancake made with finely ground cornmeal was a bit heavier as more of the liquid was absorbed,” says Carla Lalli Music, who developed the recipe.And if the packages don’t specify the texture (which, yep, sometimes they don’t), it’s safe to assume you’re getting either a fine or medium grind as well. Bags of cornmeal might also be labeled “stone-ground.” Stone-grinding—which is, um, just what it sounds like—means that some of the hull and germ of the kernel are retained. This makes for a more nutritious and corn-forward product (it also tends to be coarser). If stone-ground isn’t advertised on the label, the cornmeal was most likely ground with steel rollers. These get rid of most of the hull and germ, making the cornmeal shelf-stable for a longer period of time. (Think of it sort of like the difference between all-purpose and whole wheat flours.)When you finally buy the cornmeal you’ve been searching for, store it in an airtight container in your fridge or freezer, unless you plan on using it all within a few months, it’ll stay fresher in a cold environment. If you’re not sure how old your cornmeal is, give it a sniff. Rancid cornmeal will smell sour and off. And we can’t have that. Now, get baking:Ricotta Cornmeal Pound CakeRicotta adds a buttery richness and bit of tang to this cake, but you can substitute full-fat cottage cheese.View RecipeEditor’s note: This article was originally published by Emma Wartzman on July 17, 2019 and updated by Alex Beggs in 2021.Explore Bon AppétitCornmealRead MorecookingI Invented a Big Ol’ No-Flip Blueberry Pancake, You’re WelcomeBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-17", "author": ["Condé Nast", "Alex Beggs", "Emma Wartzman"]}