{"id": "cd992df7cc853173015e7d45d5918068", "url": "https://www.bonappetit.com/recipe/ranch-fun-dip", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Ranch Fun Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueRanch Fun DipBy Sohla El-WayllyApril 14, 20204.7(30)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray. Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintGuaranteed to make any raw vegetable taste good, and it will last for weeks! The pistachios, nutritional yeast, and salt should be ground to the texture of coarse sand so the dip easily clings to the cut sides of the vegetables—just like, well, Fun Dip candy.Ingredients¼cup raw pistachios2Tbsp. nutritional yeast2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt2tsp. Aleppo-style pepper2tsp. dried dill1tsp. sugar1tsp. onion powder½tsp. garlic powderSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Toast pistachios in a medium skillet over medium heat, shaking and tossing often, until golden brown, about 4 minutes. Transfer to spice mill or mortar and pestle and let cool.Step 2Add nutritional yeast and salt to pistachios and grind or pound until the texture of coarse meal. Transfer to a small bowl and mix in Aleppo-style pepper, dill, sugar, onion powder, and garlic powder.Step 3Serve dip with crudités.Step 4Do Ahead: Ranch Fun Dip can be made 2 weeks ahead. Store airtight at room temperature.How would you rate Ranch Fun Dip?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleThis is too good. I make x3 the recipe and it’s gone within a week and I’m the only one in my house. Great way to trick yourself into eating more raw veggies. Sometimes I want to just spoon the powder straight into my mouth.AllieJDC10/7/2021I have made this recipe a few times with some substitutions: already roasted pistachios because that is all I can find easily, a small amount of cayenne instead of aleppo because I have it on hand. I'm sure the texture is better using a mortar and pestle, but I can make it so fast in my tiny food processor. It comes together in minutes and makes eating fresh veggies way more delicious. AnonymousRochester, NY4/21/2021This is one of my most favourite recipes ever! I don’t have pistachio money so I subbed about 2/3 pumpkin seeds 1/3 walnuts, so much cheaper and sooooo tasty!Deanna Eliot2/6/2021THIS. STUFF. IS. ADDICTIVE. \n\nIt’s the best thing I’ve made from Bon Appétit ever. I can’t get enough!! I want to eat it by the spoonful! I will never go back to plain veggies again. Ohioan10/23/2020My kids are obsessed with this. It's a great way to make veggies more fun. Thanks, Sohla. Love you!AnonymousGlenville8/26/2020I was out of pistachios so I substituted almonds. It worked pretty well even though I didn't grind the nuts quite fine enough.\nI'm looking forward to trying some more variations of this idea :)paintgirl213554Victoria BC Canada8/3/2020My roommate is allergic to pistachios so I made this with almonds and it is still so good! I want to put it on everything. AnonymousMinneapolis, MN7/29/2020Can I replace pistachios with another nut?\n\nMade this with pistachios and we're already out!AnonymousHouston, TX6/13/2020This is so good.  I lacked the nooch so I replaced it with a little MSG and some tomato powder.  Same idea and it came out great.  I also used a bag of roasted, salted pistachios in my freezer.  Next time I'll follow it to the letter, but I love the bones of this idea and I'm probably going to use it for other applications.  I can see sprinkling this stuff on sandwiches, over soups, you name it.  It's great!Anonymous6/10/2020realizing now that I left out the sugar by mistake, but this is still phenomenal! I hadn't eaten lunch yet, so when I finished making it I sliced some radishes and cucumbers and tore up some pressed tofu, drizzled them with olive oil and a spritz of lemon juice, and then sprinkled the whole plate liberally with the fun dip. This may be a new go-to lunch salad! AbbyRAlabama6/7/2020Such a fun concept but next time I will use less salt and more dill! AnonymousToronto 6/5/2020So dang good!! I made mine in a blender and it worked fine. I couldn’t find Aleppo pepper so I used a combo of smoked paprika and cayenne. This actually made carrots taste good. I’ll totally be making this again. kristi.ellisGeorgetown, Texas6/4/2020I really enjoyed this! I quickly pulsed everything in the food processor to bring it all together. It is delicious on EVERYTHING from veggies, to chunks of turkey from a P3 snack pack. Sugar_PiesKnoxville5/23/2020I do not know if using already roasted pistachios, or the brand of nutritional yeast was the problem. But this is awful.Thornhill BC5/22/2020Such a great and simple idea! Thank you!!AnonymousNew York5/18/2020Explore Bon AppétitDipCruditéAmericanNutritional YeastOther IngredientsPistachioNutAleppo-Style PepperHerbs & SpicesQuickEasySnackStarterDairy-FreeGluten-FreeVeganVegetarianHealthyishSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Sohla El-Waylly"]}