{"id": "cdad93693291650fed4a91eb93399687", "url": "https://www.bonappetit.com/recipe/chicken-and-corn-stir-fry", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Chicken and Corn Stir-Fry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueChicken and Corn Stir-FryBy Chris MoroccoJuly 6, 20214.5(56)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintOyster sauce is packed with umami yet is rarely overpowering, adding tons of depth to stir-fries like this one, boosting flavor in marinades, and just being all-around incredibly delicious. No ripe corn at the market? Swap in peppers, peas, mushrooms, or summer squash.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonSilicone and Stainless-Steel Tongs – 2 Pack$17 $9 At AmazonCutting Board$10 At IKEASmall Bowl$13 At AmazonIngredients4 Servings3Tbsp. oyster sauce1Tbsp. unseasoned rice vinegar1tsp. toasted sesame oil4skinless, boneless chicken thighs (about 1 lb.), cut into 1” piecesKosher salt2Tbsp. cornstarch4Tbsp. vegetable oil, divided½small red onion, sliced4garlic cloves, sliced11” piece ginger, peeled, finely chopped½tsp. (or more) Aleppo-style pepper or other mild chile flakes3ears of corn, kernels cut from cobsSteamed rice and cilantro leaves with tender stems (for serving)PreparationStep 1Stir together oyster sauce, vinegar, sesame oil, and 2 Tbsp. water in a small bowl. Set aside.Step 2Place chicken in a medium bowl. Season with salt and sprinkle with cornstarch; toss lightly to coat. Heat 2 Tbsp. vegetable oil in a large well-seasoned wok or nonstick skillet over medium-high. Cook chicken, tossing occasionally, until golden brown and nearly cooked through, 6–8 minutes. Add red onion, garlic, ginger, Aleppo-style pepper, and remaining 2 Tbsp. oil. Cook, tossing, until vegetables are softened, about 2 minutes. Add corn and cook, tossing often, until tender, about 3 minutes.Step 3Stir in reserved oyster sauce mixture and cook, tossing often, until reduced nearly to a glaze, about 2 minutes. Taste and season with salt if needed.Step 4Serve stir-fry with rice, topped with cilantro.How would you rate Chicken and Corn Stir-Fry?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleEasy to do, but corn should be at least par cooked, flavors are good, but they overwhelm and should be cut back.cbkn10/18/2021This was a pretty solid weeknight stir fry - came together quick without a lot of fuss, as long as you prep all your ingredients up front and use a big enough pan/wok. I tried it first by following the recipe exactly, and I’d rate it a solid 4. I think it can be pushed up to a 5 by doing two things: nixing the cilantro and going for sliced green onions instead, and adding MSG at the end instead of salt. Once we put some MSG into the mix it was perfect, so I’m definitely coming back to this one. KatPittsburgh, PA10/10/2021 I cook Chinese-ish usually once a week. Oyster sauce is a common ingredient in both Japanese and many Chinese dishes. It adds major umami to the stir fry. It is by no means an \"unusual\" sauce. This is a marvelous quick weeknight meal, especially during sweet corn season (aka summer).\nTracy MadisonMadison, WI9/16/2021I just finished eating it. Very good recipe, easy to make and very tasty.Eva eng9/14/2021I stopped at oyster sauce. When using an unusual sauce, how about another option? AnonymousSan Diego CA9/9/2021It wasn't bad, but I'm not sure I'd make this again.  I used TJs frozen roasted corn and added it quite near the end so it was very lightly cooked--that may have been part of the difference and it would have been better with fresh corn.  But Southern CA corn doesn't come near to Eastern Shore (MD) corn which was in my taste buds from a recent visit--so I opted for the easy frozen option.A SpiegelSanta Monica, CA9/9/2021This is super yummy. Only had a yellow onion but it was delish!  I also added snowpeas which were perfect.  Jen M.Los Angeles, CA9/1/2021Perfect and easy to adjust with the vege’s on hand.  Loved the sauce and found it to be a perfect compliment to every combination we’ve tried to date. And we’ve tried quite a few.KimEdmonds , WA8/15/2021It's a keeper.  Super easy and actually used the TJ's roasted corn to save even more time.  If you like heat, add sliced jalapenos, or serrano's, Thai chili's... whatever you like.    This is one can turn into a wrap also with some fried or plain rice for easy lunch at work.CristinaBay Area - Cali8/9/2021Yep, this dish is fantastic.Karl BWoodbury, MN8/1/2021I made this a couple days ago after seeing the video and having read through the recipe in my magazine; it was delicious! The sweetness from the corn and the cooked red onion, the vinegary sauce (which I didn't expect to like as much as I did), and the juicy chicken...it all worked together really well. I did sub paprika for the Allepo, but it was still super flavorful. This is definitely going into the rotation of summertime meals. :)Amanda P.Atlanta, GA7/28/2021Followed the recipe to the letter, using very high quality Oyster sauce. While the texture of the chicken was very tender and juicy, the dish itself was underwhelming. I found the quantity of oyster sauce obliterated the delicate and sweet corn and made the dish rather salty and one note.  Oh well. LaFougasseNew York, NY7/22/2021After the first bite, I said “Chris, you’ve done it again.”Sam RAtlanta, GA7/21/2021We enjoyed this very much. Simple and quick to make! I added some sugar snap peas to bulk up the veg and the color. A keeper of a stir-fry for summer. AnonymousCincinnati, OH7/18/2021Wonderful easy weeknight recipe packed with flavor and texture.AnonymousNewton Highlands, MA7/14/2021Explore Bon AppétitRice and Grain BowlStir-FryChicken ThighChickenPoultryCornVegetableSummerQuickEasyWeeknight MealsOne-Pot MealsMainDairy-FreeFryLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Chris Morocco"]}