{"id": "cdaef0a1e6158eab01d410cb92da7c60", "url": "https://www.bonappetit.com/story/massimo-bottura-kitchen-quarantine", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "I Can’t Be With My Family for Dinner, But at Least Massimo Bottura Lets Me Join His | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureI Can’t Be With My Family for Dinner, But at Least This Chef Lets Me Join HisWatching Massimo Bottura’s “Kitchen Quarantine” on Instagram is giving me the family drama I crave.By Alex PastronApril 24, 2020FacebookTwitterEmailFacebookTwitterEmail“Remember, wash your ‘ands!” chef Massimo Bottura shouts through the phone in greeting. It’s 2:00 p.m. in Brooklyn and I’m hunched over my new “home office” (a table wedged between the radiator and the TV). But it’s 8:00 p.m. in Modena, where Bottura and his family are getting ready for dinner.The chef is one of countless people who have taken to live streaming from their self-isolation, cooking, exercising, or answering questions on their quarantine skincare routines. But he’s the only one I actually care to watch. Where other live streamers seek to educate, or instruct, or inform (whether they have any business doing so—or not), Bottura is simply allowing us to look over his shoulder. There are no fancy knife skills demonstrated. No set ingredient list. No meticulously laid instructions. (If you want that, go watch his MasterClass.) It’s just Bottura doing his thing. Plus, a whole lot of tossing olive oil, cross talking with his daughter who’s filming, and general family mayhem.Instagram contentThis content can also be viewed on the site it originates from.And in that way, “Kitchen Quarantine” more closely resembles the organized chaos of my own family’s pre-dinner scramble than it does an instructional video. Everyone flutters around, stealing green beans straight from the pan, and slamming cabinet drawers as plates and glasses are brought out. My parents will shout for whichever sibling is taking too long coming down from their room. The dog will be underfoot.Living across the country means I rarely experience this nightly ritual anymore. But I’ve been missing it more than ever as my own tiny kitchen has been forcibly closed to the friends and neighbors who typically pass through. Seeing Bottura and his family (and their dog), preparing to sit down together every night provides a kind of comfort I didn’t think I could get from yet another live stream. And so I’ll tune in, as I answer emails and juggle conference calls, and be reminded that I will be back to slamming cabinets and stealing green beans someday soon.Explore Bon AppétitCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-24", "author": ["Condé Nast", "Alex Pastron"]}