{"id": "cdb86f92d10ce02d644ca9ca0fae460c", "url": "https://www.bonappetit.com/recipe/skillet-cheesesteak-with-broccoli-rabe", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Skillet Cheesesteak With Broccoli Rabe Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueSkillet Cheesesteak With Broccoli RabeBy Kendra VaculinFebruary 8, 20224.3(9)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Kendra VaculinEmailPinterestPrintEmailPinterestPrintIs there a better way to eat steak than under a melty layer of pepper Jack with lemony broccoli rabe? We think not! Pickled peppers are the secret star of this dish, lending acidity and just the right amount of heat to an otherwise rich one-skillet meal. (Don’t throw out the pickled pepper liquid—it makes a great addition to a vinaigrette or Bloody Mary.) The steak should be pretty rare when you shingle it over the vegetables, but don’t worry: After a few minutes under the broiler, it will be perfectly cooked.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonInstant-Read Thermometer$35 At ThermoworksBox Grater$13 At AmazonCitrus Juicer$7 At AmazonTongs$13 At AmazonIngredients4 servings1lb. boneless New York strip steak, patted dryKosher salt, freshly ground pepper1Tbsp. extra-virgin olive oil, plus more3garlic cloves, thinly sliced1bunch broccoli rabe (about 1 lb.), cut into 1\"–2\" pieces⅓cup thinly sliced drained Peppadew peppers in brine2tsp. finely grated lemon zest3oz. pepper Jack, coarsely grated1Tbsp. fresh lemon juicePreparationStep 1Season steak all over with salt and pepper, then rub with 1 Tbsp. oil. Heat a dry large skillet, preferably cast iron, over medium-high. Cook steak, turning every minute or so and propping up on its fat cap to brown, until rare (an instant-read thermometer inserted into center should register 115°–120°), 5–7 minutes. Transfer to a plate.Step 2Add more oil to fat remaining in pan to make 2 Tbsp. fat total (leave the crispy bits!). Reduce heat to medium; cook garlic, stirring often, until golden, about 1 minute. Add broccoli rabe, season with salt and pepper, and cook, tossing occasionally, until slightly wilted and crisp-tender, about 3 minutes. Add ¼ cup water and cook, stirring often, until liquid is cooked off and broccoli rabe is tender, about 3 minutes. Remove from heat and stir in pickled peppers and lemon zest. Season with salt and pepper.Step 3Heat broiler. Slice steak ¼\"–½\" thick; shingle over vegetables in the center of skillet. Drizzle any juices on plate over vegetables. Scatter cheese over steak; broil until cheese is melted and browned in spots, about 3 minutes. Drizzle lemon juice over vegetables just before serving.How would you rate Skillet Cheesesteak With Broccoli Rabe?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleWe were gobsmacked by how easy and delicious this low-carb dish was. I marinated top sirloin to tenderize it, then followed the recipe closely. Once the chopping is done, this dish comes together quickly.  Opat1008Asbury Park NJ2/28/2022Explore Bon AppétitDinnerOne-Pot MealsWeeknightEasyNut-FreeGluten-FreeSteakBeefMeatBroccoli RabeVegetableCheeseMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Kendra Vaculin"]}