{"id": "cdbc5e8ba1403a48f115981d94e1b61e", "url": "https://www.bonappetit.com/recipe/chickpea-noodle-soup", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "Vegan Chickpea Noodle Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChickpea Noodle SoupBy Sarah JampelMarch 7, 20224.9(15)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food styling by Susan Ottaviano.  Prop Styling by Maeve SheridanEmailPinterestPrintEmailPinterestPrintNutritional yeast is the ingredient behind irresistible popcorn, creamy vegan pasta sauce that doesn’t make you miss the Parmesan (quite as much), and—in this recipe—a super-flavorful vegetarian soup that comes together in just about 30 minutes. When nutritional yeast is dissolved into water and reduced with onions, garlic, and ginger, it creates a deeply savory broth in very little time. Miso adds complexity (and, of course, saltiness)—use 1 Tbsp. if you want a lighter broth or 2 Tbsp. if you want something more robust.The other components of this recipe are chickpeas—some are fried for a crunchy topping, while the rest get super tender as they bubble away in the broth itself—and noodles. You can use dried or fresh noodles. If using fresh noodles, like yakisoba, ramen, or pan-fry noodles, use 16 oz. and simply add them to the broth for the final minute or so to warm them through. If using dried noodles, like udon, use one package (between 8–10 oz.) and cook them separately while the soup simmers so they don’t absorb all the luscious broth.The final component—and what rounds this out into a complete meal—is broccolini. Sweet and vegetal, it makes a particularly nice addition because its legginess imitates the long noodles. If you can’t find it, however, feel free to use another quick-cooking green, like thinly sliced bok choy.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonLadle$8 At AmazonSlotted Spoon$13 $10 At AmazonMicroplane Grater$16 At AmazonCan Opener$14 At AmazonIngredients4 servings¼cup vegetable oil215.5-oz. cans chickpeas, rinsed, divided1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more¼cup nutritional yeast, plus more1large onion, finely chopped12\" piece ginger, peeled, finely grated4garlic cloves, finely grated1–2Tbsp. chickpea miso or yellow miso18–10-oz. package dried udon or other wheat noodles or 16 oz. fresh wheat noodles (such as yakisoba, ramen, or pan-fry noodles)8oz. broccolini, halved lengthwise if thick1tsp. (or more) unseasoned rice vinegarCilantro leaves with tender stems (optional) and chili oil (for serving)PreparationStep 1Heat ¼ cup vegetable oil in a large heavy-bottomed pot over medium-high. Pat dry a heaping ½ cup rinsed chickpeas (from two 15.5-oz. cans) and add to pot (stand back to avoid pops and splatters). Cook, stirring often, until chickpeas are golden brown with crisp outer shells, about 3 minutes. Remove pot from heat. Using a slotted spoon, transfer chickpeas to a plate, leaving oil behind. Season chickpeas with kosher salt and nutritional yeast; set aside.Step 2Return pot to medium-low heat. Add 1 large onion, finely chopped, and cook, stirring often, until softened and translucent, about 3 minutes. Add one 2\" piece ginger, finely grated, and 4 garlic cloves, finely grated, and cook, stirring, until fragrant, about 1 minute. Add ¼ cup nutritional yeast and 1–2 Tbsp. chickpea miso or yellow miso (see headnote) and cook, stirring to coat, 30 seconds. Add 6 cups water, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and remaining chickpeas and bring to a boil. Reduce heat, partially cover, and simmer gently, stirring occasionally, until flavors have melded, 15–20 minutes.Step 3Meanwhile, if using dried noodles, cook one 8–10 oz. package dried udon or other wheat noodles in a medium pot of boiling salted water according to package directions. Drain and rinse under cold water.Step 4Add 8 oz. broccolini, halved lengthwise if thick, to broth and cook until bright-green and tender, about 2 minutes. Add cooked noodles or 16 oz. fresh wheat noodles and cook until heated through (and cooked, if using fresh noodles), about 2 minutes. Remove from heat and stir in 1 tsp. unseasoned rice vinegar. Taste soup and season with more salt and vinegar if needed.Step 5Divide soup among bowls. Top with cilantro leaves with tender stems (if using), chili oil, and reserved chickpeas.How would you rate Chickpea Noodle Soup?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis was absolutely delicious! I used white miso (2 Tbsp) because that is what I had on hand, but otherwise followed the recipe exactly. It was filling without being heavy and the chili oil was excellent for finishing to give it some heat without overpowering the flavors. We loved it and will definitely be making this again (and again!)AJRaleigh, NC3/18/2022We all loved it! The flavor has the right amount of umami to make it extremely cravable. I will definitely be adding this to our soup rotation. AnonymousBoston3/10/2022Good clean taste but flavour was quite mild. Might have been the miso I picked. Will add more next time.SarahVictoria, BC3/10/2022This is unbelievable. Possibly best vegan ramen I’ve ever had. I have never left a review before in my life.AnonymousSeattle3/8/2022Explore Bon AppétitDinnerSoupSoups and StewsVeganVegetarianHealthyishEasyNoodlePasta & NoodlesChickpeaBeanVegetableSimmerWeeknight MealsNut-FreeNutritional YeastOther IngredientsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-07", "author": ["Condé Nast", "Sarah Jampel"]}