{"id": "cdbd62abdf1d47ce168d75df2e6bee2f", "url": "https://www.bonappetit.com/story/cumin-pork-stew-recipe", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "This Silky Stew Solved My Dinner Party Cooking Chaos | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Silky Stew Solved My Dinner Party Cooking ChaosThe warming pork- and cumin-laced main course is about to become your main squeeze.By Elyse InamineOctober 24, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethFacebookTwitterEmailI’m not sure what it is, but whenever I cook for a group, I tend to go overboard. Like that time I thought it would be a great idea to invite 25 people to my apartment (I live in Manhattan!) for Christmas tamales. Or during the last family vacation, when I volunteered to cook dinner for all 13 members—my in-laws, siblings’ significant others, and grandma included—out of our AirBnB in Honolulu. So many roast chickens, so little oven space. Clearly, I love the adrenaline rush, that slight terror of wondering if I can pull it off, and the general drama of it all. But in the end, I spend more time frenzied in the kitchen than with the people I actually want to hang out with.Thankfully, Claire Saffitz has a solution: This new recipe for a meaty pork stew, fragrant with earthy cumin and tinged with chile-powered heat. The trick is that you make everything the night before your big shindig—browning the pork shoulder; toasting the garlic, onions, cumin, and chiles de árbol; and gently simmering everything with some good ole tap water until you’ve got some porky liquid velvet and a home smelling like some kind of wonderful. Then you shove it all in the fridge for an overnight slumber party, which is brilliant for two reasons: 1) it allows all these flavors to really meld together, and 2) it means all you need to do the day of the party is reheat the stew, get the toppings together (more on that below), set the table, and actually be present.The full spread\nPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethWhen I made this stew for a group of friends, they went H.A.M. on all the fixings: Crushed corn nuts and chicharrones to add a bit of crunch; an extremely easy red cabbage slaw for a splash of acid; hot sauce to amp up the heat already coursing through the liquid; and charred wedges of avocado and sour cream to make the stew even more velvety—and straight-up addictive. So don’t skimp on these. Leaving them arranged for your friends to DIY is part of the fun too.And for once, I could actually partake in the fun, and not just while watching everyone go back for seconds. As invigorating as stressed-out, adrenaline-fueled cooking can be, I think I like this path way better.Get the recipe:Silky Pork and Cumin StewServe this huge pot of flavorful stew as the centerpiece surrounded by fixings that guests can pick and choose to build their own bowls.View RecipeExplore Bon AppétitRecipePork ShoulderStewWinterFallRead MorecookingWhat’s Better Than Chicken Stew? Chicken Stew Topped With Crispy Chicken SkinBy Hilary CadigancookingThis Kielbasa and Cabbage Stew Is the Comfort Food You Need This SeasonBy Alex BeggscookingOxtail and Red Wine Stew So Luxurious, You'll (Almost) Want to Bathe in ItBy Jesse SparksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-24", "author": ["Condé Nast", "Elyse Inamine"]}