{"id": "cdc154b3146e7beef9ca54e7fd0e4b3b", "url": "https://www.bonappetit.com/story/anthony-bourdain-taught-me-to-travel", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "Anthony Bourdain Showed Me How to Travel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAnthony Bourdain Showed Me How to TravelThere was real reward in his unbridled curiosity for places more honest than famed. For Alex Delany, the notion was a revelation.By Alex DelanyJune 25, 2019FacebookTwitterEmailPhoto by Tannis Toohey/Toronto Star via Getty ImagesFacebookTwitterEmailAnthony Bourdain means a lot of things to a lot of people. He was an illuminating representative for service industry workers. A catalyst for writers trying to take a leap and tell their story. An imperfect but honest voice for those struggling with addiction. But for me, Bourdain was something else: He was the insightful, irreverent pleasure seeker who taught me how to travel.To be clear, I never met Bourdain, who passed away in June of last year. My connection was made in the same way it was for millions of others: through television.I first started watching No Reservations during my Freshman year of college. I’d turn it on after a day of classes or an ill-advised Tuesday night party, and keep my bloodshot eyes glued to my laptop screen until I’d fade off. Just a few hours later I’d be back in class, staring at Photoshop, thinking about Brazilian open-air markets, Thai noodle shops, and Parisian cafés like I’d somehow made the journey overnight. Bourdain made me believe that I had, or at the very least, that one day I would.A lifelong fan was born, and I devoured whatever he put out. I loved how in The Layover he’d openly mock the touristy, well-tread travel recommendations made by the show’s producers and act on his own preferences instead. (On climbing the tower at Notre Dame: “No. No you shouldn't. You should walk past it.” On visiting Philadelphia: “There will be no cheesesteaks and there will be no film that shall never be mentioned.”) In Parts Unknown he pushed into deeper, more ambitious investigative and political directions, but he was still having his most important conversations over cigarettes and beer.That’s because Bourdain knew better. He knew he didn’t have to see the things he was supposed to see to understand the places he was visiting. He’d rather sip amaro on the edge of a tiny Roman palazzo than enter the Colosseum. He’d rather eat seafood with with friends and activists on a Molokai beach than visit whatever Hawaiian landmarks were printed on its postcards. The insights he gleaned, and the commentary that followed—blunt, funny, and beautiful—delighted and inspired me. There was real reward in his unbridled curiosity for places more honest than famed. For me, the notion was a revelation.For a man who said loud things, he was, on screen, a quiet traveler. He didn’t show up to a city demanding immediate satisfaction. He never chased stars or long lines or the restaurants that topped the lists. He simply went where the locals were, and let a place reveal itself to him, through lazy dinners, beer-and-a-shot combos, conversations with staff and strangers, walks down unmarked streets. He spent his time eating and drinking, and the city he was in would always show him something extra.Last year, I was sitting by myself in a booth at Al-Ameer restaurant in Dearborn, MI, beaming at a bowl of ful mudammas (fava beans), a plate of tabbouleh, and the largest kebab platter I’d ever seen. I’d taken a 20-minute drive to the outskirts of Detroit to eat a late lunch at this legendary Middle Eastern restaurant—which was, at 3 p.m., mostly empty. As I ate, I listened to one of the few occupied tables next to me, filled with portly, gravel-skinned men in their sixties and seventies.They worked for GM and Ford, and as they ate, I heard tales of shutdowns, bailouts, glory days, and rapidly changing neighborhoods. As the group got up, one man gave an, “It is what it is,” shrug and another thanked their server in practiced Arabic stained in Michigan accent. I watched the shrugger leave the restaurant, open the door to his Impala, roll down the windows, and putter away.I took more from that moment than I did driving through the remnants of the old Packard Plant or snapping photos in front of the Joe Louis monument. (No disrespect to the heavyweight champ.) I showed up for lunch with my eyes and ears open, and because of that, I now know more than I had before I’d sat down for lunch in Dearborn.There was a time when I wouldn’t have, a time when I would have felt the pressure to spend my day in places that carried reputations as mandatory stops. But now, I almost never travel that way. I know that being present and attentive in a seemingly ordinary setting—maybe one that smells of cumin, olive oil, and grilled flatbread—can prove to be more valuable. Anthony Bourdain taught me that.Explore Bon AppétitAnthony BourdainFirst PersonRead MorecultureRemembering Anthony Bourdain, Tony, Who Felt Like Everyone’s FriendBy Andrew KnowltoncultureHow Anthony Bourdain Came to Be Anthony BourdainBy Anthony BourdaincultureAnthony Bourdain’s Childhood PhotosGallery16 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-25", "author": ["Condé Nast", "Alex Delany"]}