{"id": "cdce0a7aa997b03a772db42d6674046e", "url": "https://www.bonappetit.com/story/nicolas-cage-pig", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "If You Kidnap Nic Cage’s Truffle Pig, He Will Come For You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf You Kidnap Nic Cage’s Truffle Pig, He Will Come for YouBut is his performance as a chef convincing? We break down every food scene in Pig to find out.By MacKenzie Chung FeganSeptember 2, 2021FacebookTwitterEmailDavid Reamer, Courtesy of NEONFacebookTwitterEmailFirst there was Taken, a film in which ’90s A-list actor Liam Neeson—now grayer, wearier, dad bod-ier—embarks on a violent quest to save his kidnapped daughter. Then there was John Wick, a film in which ’90s A-list actor Keanu Reeves—weathered by personal tragedy—embarks on a savage crusade to recover his stolen Mustang. Both have spawned successful franchises, and yet audiences have long been left to wonder: Wouldn’t this be more compelling with a food angle?Our wait is over. Pig, available now on Amazon Prime, stars Nic Cage as a chef turned recluse on a quest to find his kidnapped truffle pig.Pig is divided into three chapters (or should I say courses?), each named after a different dish. The first, “Rustic Mushroom Tart,” opens on a scenic river deep in the woods of Oregon. Nic Cage, looking objectively like hell, plunges his utility knife into the mossy ground and brings the soil to his mouth. Cage’s character, Rob, is, you see, a chef, and the curiosity of a chef’s palate is unbound by traditional wisdom like “scallion cream cheese doesn’t go on a cinnamon raisin bagel” or “don’t eat dirt.” Cage summons Pig, a strawberry blonde scene stealer who, off-screen, goes by the name of Brandy, and the two set out into the woods to hunt for truffles.Mushrooms in hand, Cage returns to his off-the-grid cabin to make lunch. It is here, at minute four, as Cage begins to assemble the pastry for his rustic mushroom tart, that we must begin to suspend our culinary disbelief. Cage has made a well in a pile of flour—a technique used to contain liquids like buttermilk or eggs—and confoundingly drops pats of butter into the center. He then picks up a palmful of fat and flour, molding it with his palms into a tight ball. “If he’s making pie crust, he can’t be manhandling his dough like that,” warns senior food editor Christina Chaey, who questions whether Cage’s hygienic practices are up to health code. “That butter is going to melt from the heat of his hands. Doesn’t he want flaky layers?”What Cage wants is to be left alone, a point he makes abundantly clear the next day to his slick Camaro-driving truffle dealer. But after nighttime intruders abduct Pig and leave Cage bloodied and unconscious (their poetic weapon of choice: the cast-iron skillet Cage used to sauté mushrooms over an open fire), he has no choice but to leave his hermitage and embark on his quest, one that will require him to growl lines like, “They took my pig,” “Derrick, who has my pig?” and “I. Want. My pig back.”Like a bedraggled Michelin-starred Odysseus, Cage must voyage to locations across Portland, passing test after test to glean information about Pig’s whereabouts. He descends into a subterranean fight club where restaurant workers bid to beat the living shit out of big name chefs, telling his dealer turned sidekick, “Whatever happens, just stay back.” (Cage’s face, already bloody and bruised from the cast-iron skillet, takes on the appearance of raw chopped steak and stays that way for the rest of the film.) He visits his former pastry chef to procure one of her famous “salted baguettes.” He dines at the city’s hottest new hyper-local modernist restaurant, where he chastises the chef—a former prep cook at Cage’s shuttered restaurant—for cooking deconstructed scallops bathed in Douglas fir smoke rather than the simple, honest British pub food he used to love. He explains what a persimmon is to a small child.His journey leads him to the mansion of Portland’s truffle kingpin, where Cage must cook as if Pig’s life depends on it, which it does. “The first thing I see is him washing his hands, so good for him. I take back what I said about his hygiene earlier,” comments Chaey as Cage prepares his station. He tenderly lays some type of small bird—a pigeon?—on his cutting board and begins butchering with his chef’s knife. “That is not the knife I’d use,” Chaey remarks. “He seems to be applying gradual pressure with his palm on the spine of the knife, whereas I’d use blunt force with a cleaver. To cut cleanly through bone and gristle, you want a wa-CHA!”Spoiler alert: Although Cage’s culinary magnum opus moves his pig’s captor to tears, he is, alas, too late. Pig has snuffled her last truffle. The impact of this, we learn, is inconsequential to Cage’s livelihood. He doesn’t need Pig to find truffles—he can do it on his own. Why, then, has he risked life and limb to find her? “I love her,” he murmurs.Cage’s off-screen love of animals is well-documented. He once owned a pair of cobras who routinely tried to kill him. He currently has a pet crow, Huginn, who flaps around a 16-foot geodesic dome. In an interview with GQ, he says that his performance in Pig required no acting—he merely had to imagine what it would be like to lose Merlin, his Maine coon.Cats seem to hold a special place in Cage’s heart. In 2010 he went on Letterman and talked about how he and his high school cat, Louis, loved doing psychedelic mushrooms together. “He would stare at me,” Cage told Letterman, “and I had no doubt that he was my brother.”Stream Pig, starring Nicolas Cage, on Amazon Prime VideoExplore Bon AppétitCultureMoviesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-02", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}