{"id": "cdcf1384d34362022d36d412469960c2", "url": "https://www.bonappetit.com/story/vegan-creamed-spinach", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "This Vegan Creamed Spinach Recipe Will Fool ALL the Dairy Lovers at the Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Vegan Creamed Spinach Recipe Will Fool ALL the Dairy Lovers at the TableDon't tell Aunt Peggy what the secret ingredient is.By Aliza AbarbanelNovember 8, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailThese days, everyone comes to the Thanksgiving table with a dietary restriction. We bend over backwards trying to accommodate with gluten-free pies and vegan turkeys, all while trying to please our tradition-loving relatives too. (It's just not Thanksgiving without mashed potatoes, we agree.) Rather than spending time and money on extra food, we think the best strategy is to make dishes that everyone can eat and love, like this creamed spinach with a secret omission: There's no cream.So creamy and comforting, it could double as a blanket.\nPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaDairy-free creamed spinach isn't just possible. It's rich, creamy, and packed with flavor. The secret? Homemade tofu cream. We promise it works: Purée some drained silken tofu in a blender and you’ll get a sauce that’s as smooth and silky as heavy cream. (Just skip the extra-firm stuff, which won’t break down nearly enough.) And because tofu and spinach aren’t exactly known for being packed with flavor, senior food editor Andy Baraghani adds brightness with sautéed ginger, chile, ginger, and scallions. These aromatics aren't traditional Thanksgiving flavors, but they add just enough heat and layers of flavor.This recipe has the best healthyish intentions, calling for a hefty two pounds of mature spinach—not baby spinach—which holds its shape well and has bigger crunchy stems. It will seem like an absurd amount of spinach but, as always, those leafy greens will dramatically shrink down. Add the tofu cream as soon as the spinach is wilted and bright green—not even Popeye wants overcooked spinach.Once that sautéed spinach is bathed in a creamy sauce punched up with flavorful aromatics, it becomes a side totally deserving of a spot on a crowded Thanksgiving table. And unlike nearly everything else on the menu, this dish stays on the stovetop—so you can save the oven space for the bird. And if your cousin unexpectedly shows up with his vegan roommate in tow, or Uncle Jim forgets his lactose pills, you can get this from the kitchen to the table in ten minutes flat. Now that’s something to be grateful for.Bring on the spinach:Vegan Creamed SpinachA Healthyish take on classic creamed spinachView RecipeExplore Bon AppétitHealthyishVeganThanksgivingSpinachSideRead Morecooking58 Healthyish Thanksgiving Sides to Round Out Your TableGallery58 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-08", "author": ["Condé Nast", "Aliza Abarbanel"]}