{"id": "cdd0cfd04d65df40c4df13eb483b8834", "url": "https://www.bonappetit.com/recipe/chicken-and-beans-stir-fry", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "Chicken and Green Bean Stir-Fry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken and Green Bean Stir-FryBy Chris MoroccoJuly 24, 20194.6(53)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis fast miso-curry paste and handfuls of charred green beans and peas transform skinless, boneless chicken breasts into a highly craveable dinner.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonParing Knife$10 At AmazonMicroplane$16 At AmazonCutting Board$10 At IKEATongs$13 At AmazonWooden Spoon$6 At AmazonIngredients2 servings2garlic cloves, thinly sliced1Tbsp. soy sauce1Tbsp. white miso1tsp. curry powder1tsp. finely grated ginger3Tbsp. extra-virgin olive oil, divided1lb. skinless, boneless chicken breastsKosher salt¼tsp. sugar12oz. trimmed string beans, sugar snap peas, and/or snow peas½cup fresh or frozen baby peas, thawed2scallions, thinly slicedPreparationStep 1Mix garlic, soy sauce, miso, curry powder, ginger, and 1 Tbsp. oil in a small bowl; set aside.Step 2Slice chicken breasts crosswise into ½\"-thick strips. Season with salt and sprinkle with sugar. Heat 1 Tbsp. oil in a large nonstick skillet over medium-high. Cook chicken in a single layer, undisturbed, until well browned, 2–3 minutes. Turn and continue to cook just until exterior of chicken is opaque (it won’t be cooked through and the second side won’t get much if any color, and that is fine!), about 30 seconds longer. Transfer to a plate.Step 3Cook beans and remaining 1 Tbsp. oil in same skillet over medium-high heat, tossing often, until beans are bright green and lightly charred in spots, about 2 minutes. Transfer to plate with chicken. Reduce heat to medium. Add reserved curry paste and cook, stirring constantly, until paste darkens and garlic softens, about 1 minute. Add peas and ½ cup water. Return chicken and beans to skillet and cook, tossing occasionally, until sauce is reduced by more than half and thickens, 2–3 minutes.Step 4Transfer chicken and vegetables to a platter. Top with scallions.How would you rate Chicken and Green Bean Stir-Fry?Leave a ReviewTell us what you thinkReviews (31)Back to TopTriangleThis was great. I am allergic to peas so I made a version with eggplant instead. Also used ground pork because that's what I had. Would make again!AngelaPalo Alto, CA2/15/2022Tasted great and left the green beans still very crunchy. I enjoyed the live video cook-along. It was well-paced, I didn't feel rushed at all.TerriCictoria, BC Canada6/15/2021Two of us made this recipe side-by-side last night during the cook-along live. All the diners liked it - but it wasn't fantastic. I should have read the reviews and doubled the sauce. We found the dish a little drab as the sauce didn't give enough oopmh.   The flavors were very good, but because there wasn't enough sauce, it ate dryJanisBoca Raton, FL6/11/2021Haven't tried the recipe yet, but just wanted to comment on the \"chef\" making the recipe on your video.  He's a nice looking guy, but I hope his cooking is better than his diction.  If it were not for subtitles and visuals, I couldn't understand some of his mumbling and sloppy diction.DUH!Brooklyn, NY6/4/2021I make it all the time, I just double most of the ingredients for the curry paste. Super tasty and easy! Sarah New York 4/15/2021I really liked this dish, super easy and delivious. Would probably add more veggies next time.Mayrav EstrinBrooklyn, NY3/4/2021\nReally delicious! As it was recommended to double the sauce, I did. Loved how easy it was to make and the overall taste. You can definitely switch up the vegetables, as I couldn't get my hands on snap peas, green aspergus also did the trick! \nWould highly recommend!! LorrainebrennIstanbul2/2/2021I used to be a research scientist, and this recipe gave me war flashbacks of one of the worst experiments I have ever run. That experiment was a cauchemar because I killed my instincts and followed the instructions on a protocol I'd inherited. \n\nThe problems started with the chicken: \"Velvet it, Sharma!\" every instinct screamed, but I stuck to the protocol. \n\"Introduce some acid, a**hole!\" I railed at me. But, I stuck to the protocol. \n\"How about some heat, you bland-a** b*tch-burger!\" I berated the self. But, I stuck to the protocol. \n\"You know you like the sauce thiccc, so what the f*ck?\" I implored my person. But, I stuck to the protocol. \n\nThe end result is a sauce so sapless and beige that it might as well be flat miso-flavoured La Croix, grey beans, limp and lachrymose, as if dosed with Canal Street sildenafil and a chicken so chewy that you might feel like a ruminant who a made a meal out of an avian friend because times is tough. \n\nI don't blame Chris Morocco, no. There's no accounting for taste, after all. I blame myself for sticking to the protocol. Like in that catastrophe of an experiment, I knew what I should have done but I (you guessed it) stuck to someone else's protocol. A mistake I shan't be making again. \n\nInterferonGuy 1/22/2021Love this recipe!! I didn't have any miso so I subbed with hoisin sauce and it was delicious!! I also doubled the sauce and added 1 tsp of corn starch to the 1/2 cup of water at the end. It made the sauce thicker and just perfect over rice.DebbyLos Angeles, CA11/6/2020Great recipe! Completely agree with other reviewers re: doubling the sauce but that's the only modification! Definitely double the sauce! Otherwise, delicious and easy!Andrew EckertNew York City10/23/2020Love this recipe, \nEasy and delicious, for Adults and kids! I didn't have have any of the green beans but substituted it with asparagus and broccoli. Amazing! Only thing I would change is double the sauce! AnonymousIstanbul10/17/2020We liked this recipe! It is super flexible, and it was a great way to get a lot of greens! We doubled the sauce as some comments suggested. Next time, we will thaw the peas in the microwave in the water that we’ll eventually add in - it took a long time for the curry to heat back up and reduce once we added in the cold water. Make sure to include the sugar, as it helps to brown/caramelize the chicken more quickly, and without it you will over-cook it. AnonymousBoise10/10/2020Love this recipe. I swap chicken out and add steamed-then-seared carrots for a vegan version. AnonymousNew Jersey9/24/2020A pound of chicken for two people?LillypillyAustralia 8/7/2020Loved this recipe! While we were eating it we discussed all the variations we could do to it. Also going to double the sauce because we like it saucey. Melissa KaykoBrooklyn8/5/2020Explore Bon AppétitStir-FryCurryChicken BreastChickenPoultryMisoCondiments, Sauces & PastesPeaVegetableGreen BeanSugar Snap PeaSpringQuickEasyOne-Pot MealsWeeknight MealsMainDairy-FreeNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-24", "author": ["Condé Nast", "Chris Morocco"]}