{"id": "cdf3ff6960de3bd0463d506dbc483c58", "url": "https://www.bonappetit.com/story/pork-shoulder-steaks", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Pork Shoulder Steak Recipes That Are More Delicious and Way Cheaper Than Pork Chops  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Most Delicious (and Cheapest) Pork Chop Isn’t a Pork Chop at AllThis new recipe is twice as delicious and half as expensive as any pork chop you have had or ever will have. Things are going to be different from now on.By Amiel StanekJuly 26, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailA few weeks back, in honor of my dear friend Max’s birthday, I made this new recipe for Pork Shoulder Steaks with Grilled Mustard Greens from the June/July issue of Bon Appétit. And in order to fully grasp the unspeakable glory of this dish, I need you to go to an Imaginative Place with me. Cool? Cool.Picture the biggest, meatiest pork chop you’ve ever seen, hot off the grill and blessed with the most magnificent of crusty-smoky sears. As you start slicing it into wide, wobbly, perfectly-pink ribbons, you whistle quietly to yourself—each slice is zebra-striped with beautiful striations of sweet, sweet pork fat, marbling like you’ve never seen, guaranteeing that each and every bite will be as juicy and porky as the last. Your friends come to investigate once they catch wind of what’s going on in the kitchen, and when you sneak them a bite they moan with pleasure. “What kind of pork chop IS THIS?” They demand. And that’s when you drop the bomb.“This actually isn’t a pork chop at all—it’s a pork shoulder steak. And it’s twice as delicious and half as expensive as any pork chop you have had or ever will have. Things are going to be different from now on.”See, the thing about this recipe is that it’s more than “really, really good,” it’s paradigm-shifting. It is bold and it is brash and it will make you a better cooker of meats and a better consumer of pork. Here’s why.First, there’s the dry rub. If you’re not on board with the whole marinades-are-mostly-bullshit, dry-rubs-rule thing, this should convince you. Instead of bathing the pork in some messy mixture of different liquids that aren’t ever going to penetrate beyond the surface of the meat, you rub it down with a crushed up mixture of toasted fennel seeds, mustard seeds, peppercorns, and cinnamon that form the basis of an intensely aromatic, complex crust. Nice!Then there’s the cut. Unlike your classic pork chop, which is cut from the loin of the pig, these pork shoulder steaks are cut from a hunk of boneless shoulder, aka Boston Butt. (Fair warning: You’re probably not going to find these packaged and ready to go in the pork section of the supermarket. Which means you need to either a) ask your butcher to cut ¾-inch steaks from a Boston Butt or b) buy a Boston Butt and cut it against the grain into said ¾-inch steaks yourself, which is really not a big deal.) It’s an extremely affordable cut that most people cook low-and-slow until it’s fall apart tender and shreddy—think pulled pork and carnitas—but that doesn’t mean that it has to be cooked that way. It has a lot of intramuscular fat, often referred to as “marbling,” which means it takes well to hot-and-fast grilling the same way a ribeye steak does, juicy and full of meaty flavor.Another great pork shoulder steak recipe, cooked in a cast iron instead of on the grill. Try it!\nPeden + MunkAnd then, to top it all off, there’s the temperature. You are absolutely forbidden to cook these pork shoulder steaks past a juicy-pink medium—that’s what you need to do in order to ensure that they’re tender and flavorful. If you cook these pork shoulder steaks all the way to well done, they’ll be dry and gross. No, you won’t get sick if you stop cooking them at 145; the worst thing that’s going to happen is that you’re going to feel sick to your stomach thinking about all the times you overcooked pork in your life. Pink pork = living.So...yeah. Buy some pork shoulder steaks. Rub them down with fragrant spices and plenty of salt. Grill them over medium for five to seven minutes until they’re crusty on the outside and irresistibly pink and juicy on the inside. Grill some marinated mustard greens afterwards to serve as a side, if you want. And get ready to have your summer grilling turned upside down.Get the recipe:Pork Shoulder Steaks with Grilled Mustard GreensNormally you want to braise a pork shoulder—but we’re making a case for throwing it on the grill, with a hell of a spice rub.View Recipe4 more recipes starring pork shoulder steaks:Maple-Habanero Glazed Pork SteaksBefore you panic about the habaneros—we've got a trick in this recipe that mellows out the spice. A lot.View RecipeGochujang Pork Shoulder SteaksThe centerpiece of Korean barbecue is the meat, but it doesn't have to be steak.View RecipePork Shoulder with Pineapple and Sesame BroccoliWhile pork rib chops would be fine for this recipe, thin shoulder steaks or blade chops have more fat, meaning they’ll stay ultrajuicy even after a hard sear.View RecipePork with Nuoc ChamThis all-purpose sauce will go with any protein and doubles as a great dressing for summer salads.View RecipeReally nerd out on pork with this:Explore Bon AppétitPork ShoulderSummerGrillRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-26", "author": ["Condé Nast", "Amiel Stanek"]}