{"id": "ce041fb37bde96b54b296b7db8675d23", "url": "https://www.bonappetit.com/story/rinsing-pasta-or-noodles", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Should You Rinse Pasta? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIs It Ever Appropriate to Rinse Pasta or Noodles?Hint: If the answer were “no,” we wouldn’t have this whole article!By Sarah JampelMarch 17, 2021FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailI promised myself I would stop using my parents' cooking habits as fodder for articles when I reached a certain age. Fortunately, that age is 102.While I didn't know it at the time, my parents—bless them, truly—committed many “crimes” against pasta when I was growing up, including adding oil to the cooking water and rinsing it with water from the tap as it sat in the colander. Drizzling oil into the water—supposedly to ensure the noodles wouldn't stick together—made the pasta extra slippery, while rinsing them under a running faucet was even more of a guarantee that no sauce could stick.See, rinsing noodles removes starch from their surface, thereby making it more difficult to get any kind of sauce to cling. In our household it didn't matter—we ate the pasta plain (which is a story for another time, or never). But if our goal had been to marry the noodles with sauce—say red pesto or brown butter or cream and peas or oil sizzled with garlic and anchovies—that rinse would have been highly counterproductive.None of this is to say you should never rinse your noodles. Pray tell, what rules in life are so hard and fast? If you’re making a dish that will be served chilled or at room temp—think cold soba, rice noodles, pasta salad—you do want to rinse so that you get toothsome (sorry) individual strands rather than one big gummy clump.Certain types of noodles benefit from a rinse in almost all applications. In her book Japanese Home Cooking, Sonoko Sakai recommends rinsing soba and udon. “Even if I serve it hot,” she told me, “I like to rinse it in cold running water to remove the surface starch and give you a good palate feel that's not slimy.” She will even go so far as to soak her soba in ice water, which firms them up for a chewier texture.So rinse sometimes, rinse wisely, but don't rinse like my parents.Cook, rinse, don't repeat:Romesco Pasta Salad with Basil and ParmesanThis pasta salad holds up well at room temperature and has a flavorful, punchy romesco sauce.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-17", "author": ["Condé Nast", "Sarah Jampel"]}