{"id": "ce0b7c8e0b3520267ab68cb6f8b6c3e7", "url": "https://www.bonappetit.com/story/chinese-new-year-menu-simone-tong", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "A Chinese New Year Menu All About Family, Good Fortune... and Pork Belly | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking3 Recipes from Simone Tong’s Chinese New Year MenuLittle Tong Noodle Shop chef Simone Tong shared three recipes that will bring everyone around the table, folding dumplings, and filling the New Year with as much good luck as possible.By Simone Tong February 12, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Anna Billingskog, Prop Styling by Heather GreeneFacebookTwitterEmailSimone Tong, chef and owner of Little Tong Noodle Shop in New York, shared some of her Chinese New Year recipes with us—prosperity salad, pork belly, and shrimp dumplings—but in reality, her table has more than 20! We’ll let Simone take it from here.All of China comes together because they have this one single thing that they dream about, which is Chinese New Year. Whatever hardship or unfortunate things or great things you’ve been through, you always hope the next year is better. Because to us, it’s more than a celebration. It’s a moment to get rid of all the bad, unfortunate things—and bring more good fortune into the next year.On New Year’s Eve you’re supposed to deep clean. And then take a shower. (On New Year’s Day you’re not supposed to do any cleaning because if you get rid of anything, that means you’re also getting rid of all the good fortune.) We look at the Chinese Zodiac—we take that thing a little more seriously than what’s on the websites—and we study our animal signs. This year, which begins February 16 and ends March 2, will be Year of the Dog. According to my mom, it's supposed to be a great year. Whatever you do in those 15 days, you want to keep bringing as much good luck as you can. Which means giving people, and kids, money in red envelopes; visiting your elderly, trying to help them out. And then it also means cooking a lot of good food.Photo by Chelsie Craig, Food Styling by Anna Billingskog, Prop Styling by Heather GreeneThe reunion dinner, on New Year’s Eve, is the biggest celebration. We’d all gather in my grandparents’ house. It gets very crowded. My aunties, uncles, mom, and my grandparents always cooked—usually 20 different dishes! Fish, pork, vegetables, everything that we can find from the land, sea, and air. The more the better. For dessert, we eat tang yuan, sticky rice balls filled with black sesame paste and served in a sweet soup. In China, every single province, every village, every region, has different dishes and styles. There’s alcohol and flowers, fruits, cheese. And fireworks. After midnight we do a lot of fireworks and firecrackers.But as kids, we looked forward to Chinese New Year because we got money. When I was a kid, that’s the only pocket money I would have. I got a Walkman in 1989, when I was seven years old. I was so cool walking around with my Sony Walkman. Then around 1995, I got a Discman. It was always about music, at least for me. I also got some Nike shoes with the air pumps, and new clothes, a new haircut, to show all of my friends. We were obsessed with American brands. When I turned 18, I could go buy beer, explore parties.The higher you toss this prosperity salad—the better your luck will be in the new year.\nPhoto by Chelsie Craig, Food Styling by Anna Billingskog, Prop Styling by Heather GreeneBy celebrating Chinese New Year every day, we also hope to get the dragon out of sight. We don't want it to eat our children! They’re supposed go to your house or villages, your roads and festivals, to grab whatever they see because they’re hungry. We close the door, get the firecrackers going to make the dragon go next door. And we have lots of food, so we can just stay at home, cook, play Mahjong, watch TV—just like Thanksgiving. But Thanksgiving on steroids, because it’s 16 days.The superstition is that people don’t die during Chinese New Year. It’s the lowest rate of death—people wait until after, when their kids have gone back home. It's always about harmony, unity, getting together, being a family. Whether you’re overseas or in another city, you always want to go home during Chinese New Year to visit your grandparents and parents. It’s the only time you get to reunite with where you come from. Whether you’re a tribe, a town, a village, a household in the city, a tiny little apartment in the city, it doesn’t matter, as long as you’re together. It doesn’t matter if you bring home anything or nothing at all. Hopefully you bring home a boyfriend or girlfriend. The Chinese view is about prolonging this ancestry. Our biggest celebration is so serious!When I came to UNC-Chapel Hill, North Carolina for college, I couldn’t go home because Chinese New Year fell in the middle of the semester. I’d celebrate with my non-Chinese friends and cook for them—chicken salad, pan-seared wontons, but I also make this shrimp and pasta. Shrimp and pasta was my signature dish in college.I came to New York in 2010, and every restaurant I’ve worked for I always make it a point to tell every non-Chinese cook, “Hey, we’re celebrating 15 days of Chinese New Year.” So every day I make sure I tell them Happy New Year number seven, number four, number eight. They get sick of it, but I’m making the fried dumplings and making sure they’re enjoying this good, auspicious festival. I have to put money in the red pocket and give it to them because I think it's good luck for me and it will bless them for the entire year. My staff are mostly from the Bronx, they’re not Chinese, but I‘m going to shower them with generosity and luck.What’s on the MenuProsperity Salad (Yusheng)The higher you toss the salad with your chopsticks, the more luck you'll bring into the new year.View RecipeProsperity Salad (Yusheng):This salad only really pertains to overseas Chinese, like Singaporeans or Malaysians who are Chinese. We lift the salad really high with chopsticks with about 20 people around a round table. But that salad is very, very important because we want to lift up the spirit. The higher you raise your chopsticks to mix the salad, the better luck you’ll get for the coming year. We eat this throughout the 15-day celebrations, and especially on the seventh day which is known as Ren Ri 人日 (commonly known as “every person’s birthday”).This recipe is a Cantonese-style raw fish salad made with various shredded vegetables and served with assorted toppings, a sweet plum sauce and slices of raw fish (usually salmon sashimi, mackerel, or bass). The word for “raw fish” is yúshēng, but because the character for fish (魚) resembles its homophone “abundance” (余), “yúshēng” is interpreted as meaning an increase in abundance. Therefore, the raw fish in this dish symbolizes of abundance, prosperity, good fortune, and vigor.Red-Braised Pork Belly (Hong Shao Rou)Simone Tong's red-braised pork belly is a must-have on Chinese New Year. You can see why.View RecipeRed-Braised Pork Belly (Hong Shao Rou):This traditional braised pork belly dish is a crowd-pleaser for any special occasion, and the bright red color symbolizes good luck. At home it’s usually eaten with other Chinese New Year dishes over white rice. But it’s also a great topping for noodles, lettuce, tortillas, and buns.Shrimp DumplingsDuring Chinese New Year, eating (and making) dumplings symbolizes unity, togetherness, and harmony.View RecipeShrimp Dumplings:We also have dumplings, especially in the north of China. Dumplings symbolize unity. Everybody gathers around the table to make dumplings. One family, regardless of how poor or wealthy, sitting under one roof eating dumplings, is happiness from within. In the North, they’ll also put coins in the dumplings. If you bite it—this is very old fashioned—you’re the luckiest person.Starting on February 15, Little Tong Noodle Shop is serving a special Chinese New Year dish each night for 16 days. We’ve got our eyes on the red-braised pork belly being served February 18, the Wagyu mixian noodles on February 20, and tea-smoked duck on February 27.As told to Alex BeggsExplore Bon AppétitPork BellyChineseDumplingsChinese New Year Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Simone Tong"]}