{"id": "ce2e629d984a40d5b217a8d5bb9f3d4b", "url": "https://www.bonappetit.com/story/a-skeptic-tries-ketchup", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "A Skeptic Tries: Ketchup | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Skeptic Tries: KetchupHow a vile, disgusting, and absolutely adolescent prank almost ruined the condiment for me.By Sharrona PearlFebruary 15, 2022FacebookTwitterEmailIllustration by Brittany Holloway-BrownFacebookTwitterEmail‘A Skeptic Tries’ is a series examining our food resistances and what happens when we try them anyway. Next up, writer Sharrona Pearl rediscovers the simple pleasures of ketchup.I didn’t always hate ketchup. As a kid I squirted it with abandon, drowning my french fries and hot dogs in red puddles. The slimy condiment was fun to eat and I didn’t care that it masked the flavor of everything it touched. In a way that was the point. But there’s a dramatic divide in my life when it comes to ketchup: Before, when its grossness was kind of fun, and After, when all I could think of when I looked at it, or smelled it, or even imagined it, was blood. Menstrual blood, to be exact.The year was 1990. I was 13 and spending eight weeks at Camp Ramah in Ontario, Canada. Along with the 11 girls in my cabin, I decided to go bunk-hopping late at night—through the wooded ravine behind our hill to the boys’ camp. Our motive was simple: vengeance. Our mechanism: mess. And our medium: ketchup, something all summer camps have in abundance.The week before, while we were away on an overnight camping trip, the boys had gone on an infamous panty raid, stealing our underwear and stringing it up on their outdoor laundry line for everyone to see. Now they were away on their camping trip. We had to retaliate and we wanted to show them, in as direct a way as possible, exactly why 13-year-old girls need their underwear.Given that our nervous mothers had sent us with enough extra tampons and menstrual pads to supply an entire Lilith Fair, we had plenty to work with. Armed with our supplies, we donned our stealth black sweatpants, crawled across the field, and snuck into the boys’ cabins—where we proceeded to go to town. Not only did we soak the tampons and pads in ketchup, we squirted it. We slathered it. We sprayed it until each bunk looked like its own crime scene. It was vile, disgusting, and absolutely adolescent. And I could never look at ketchup the same way again. What was once a sauce had become a secretion.My ketchup-free life didn’t feel like any kind of sacrifice. I became a vegetarian at 13 (that same summer, incidentally), and so my only grilling options were precooked tofu dogs or hard, flat, greige-colored rounds masqueraded as “veggie burgers.” Not even ketchup was going to bring them back from bland oblivion. And the rest of my veg-heavy meals rarely needed the condiment. I dipped my fries in mayonnaise. I enjoyed tomato sauce (only guilty by association) atop spaghetti. Mustard was my grilled cheeses’ BFF.What was once a sauce had become a secretion.Then, 30 years later, the Impossible (burger) happened. By 2018 the vegetarian alternatives I fed my own family had come a long way—they were no longer sad substitutions but truly delicious options that even meat lovers were buying into. I began to crave the actual taste of veggie burgers and dogs as much as the nostalgic ritual. I wasn’t just slapping a misc. disk between the much more appealing bun anymore but savoring the flavors.As I watched my kids eagerly load their burgers—with cheese, and lettuce, and maybe avocado, and definitely ketchup—I got a little…regretful? A little wistful. Maybe I was jealous. Even though the viscosity still struck a visceral chord, and even though the condiment was no less redolent of a particular secretion, I wanted to try again.So one day I gave a tentative squeeze. I spread, sparingly but substantially. And then I tasted. It was a revelation. That first bite of burger was almost crunchy, with a seared exterior that soon melted into a juicy, tangy, and shockingly meaty inside. Each chomp delivered with it a hit of ketchup. My mouth watered. Then my eyes watered. Probably my kids were wondering if Imma was finally losing it. In a way I was. As the sweet umami-packed tang took over my senses, I spiraled back decades—past a montage of ketchup-devoid scenes—to the Before times. It was exactly as I remembered: kinda gross, kinda amazing, and virtually impossible to stop eating.As it turns out, unlike teenage retaliation, the marriage of ketchup and burger is a wise and wonderful choice. While the burger was my gateway, adult me learned that the salty-sweet substance is the perfect complement to piping hot french fries, crispy onion rings, and oven-baked vegan nuggets. Look, I’m not about to slather ketchup on my pasta (blasphemy!) or put it on my latkes or eggs. That red bottle still has no place at my breakfast table. And I firmly believe its application should enhance rather than cancel the neighboring flavors.But now that burgers are a part of my menu, ketchup is a part of my burgers. And while those patties have been bloodless since I was 13, these days I’m very happy to add a bit of sticky red sauce.Put some ketchup on it:Easiest-Ever Grilled Veggie BurgersAn impossible assignment: a from-scratch veggie burger that can go right from the mixing bowl onto the grill without falling apart. We found a way!View RecipeExplore Bon AppétitA Skeptic TriesCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-15", "author": ["Condé Nast", "Sharrona Pearl"]}