{"id": "ce319ec64b6e0883bbe2a21d00e2fd58", "url": "https://www.bonappetit.com/story/restaurants-we-loved-2018", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "The 22 Restaurants That Turned Us Into Dedicated Regulars in 2018 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe 22 Restaurants That Turned Us Into Dedicated Regulars in 2018We can’t shut up about our new favorite restaurants.By The Bon Appétit StaffDecember 14, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailSo many restaurants, so little time. Isn’t that how the saying goes? Well, it might as well if you’re dining out as much as we are.We’re constantly looking for the next big thing that sometimes we miss out on the long-loved icons we should have already visited (a Hawaiian staple serving up sour, sticky poi!), the  gems hiding in plain sight (a sublime steakhouse in the Connecticut suburbs!), and even the buzzy new ones (a much-trafficked wine bar in Brooklyn!).Thankfully, this year we made sure to visit. Again. And again. Now it seems like every time we’re eating out, it’s at the same spots. Specifically these ones. Here, our favorite, new-to-us places that we added to our dining rotation in 2018. Four Horsemen, Brooklyn“I usually have a rule against going out to eat on weekends in Brooklyn—the crowds!—but I've found myself bending for the incredible prix-fixe Saturday-and-Sunday-only lunch at Four Horsemen in Williamsburg time and time again. (I also have a rule about going to Williamsburg specifically on weekends, so a whole lotta rule-bending going on.) A mere $28 gets you three courses, a slab of homemade bread, AND dessert, which means you’ll have ample excuse to pad the check out with a bottle of amazing natty wine. Rules were meant to be broken, right?” —Amiel Stanek, senior editorInstagram contentThis content can also be viewed on the site it originates from. Helena’s Hawaiian Food, Honolulu“I’m very ashamed to admit this, but after about 20 trips to Hawaii, I finally made it to Helena’s, the grande dame of native Hawaiian food, in 2018. For the last 72 years, the restaurant has been supplying locals, tourists, and people who wished they were locals (like me) with staples of the cuisine: pipikaula, jerky-like beef that you rip off the bone with your teeth; lomi lomi salmon, cured cubes tossed in a pico de gallo-like salad; squid luau, taro leaves stewed down with coconut milk and little calamari nubs; and sticky poi, so sour and tangy it makes you pucker and go back for more, like the weirdest palate cleanser. It’s food that’s storied and soulful, a slow burn compared to the click-bait-ification of poke. So, the next time you’re in Honolulu, don’t be like me and make sure you get to Helena’s ASAP.” —Elyse Inamine, digital restaurant editorInstagram contentThis content can also be viewed on the site it originates from. Res Ipsa, Philadelphia“A restaurant I can't stop thinking about and cannot wait to go back to is Res Ipsa in Philadelphia. Res Ipsa was on our top 50 list in 2017, and it took me over a year to actually make it there, which was a huge mistake on my part. I haven't stopped dreaming about the perfectly chewy pastas, simple but cool vibe, or the incredibly friendly staff. I'm so excited to grab a few bottles of fun natural wine, and make a wholeeee night out of it. It's BYOB!” —Emily Schultz, social media managerInstagram contentThis content can also be viewed on the site it originates from. Cascabel, San Antonio“Every year I find an excuse to visit San Antonio, and every year I am dazzled by the vibrancy of that city's dining scene. There are so many places to love but, this past visit, I fell for one of SA’s more old-school spots: a Mexican restaurant called Cascabel. I visited on a rainy Sunday, and was immediately charmed by 1) the colorful murals on the walls and 2) the amuse bouche of fideos (slinky noodles in the chicken-iest chicken soup) that every guest gets. I mean, I could have just eaten bowls and bowls of the fideos and been happy. But instead I feasted on chilaquiles soaked in salsa verde, and squash blossom quesadillas topped with crumbled cotija cheese, and black beans that tasted like they had been stewing for days. I have been thinking about this meal for months and months. I can't wait to go back next year. Hopefully sooner rather than later.” —Priya Krishna, contributing writer Instagram contentThis content can also be viewed on the site it originates from.June, Brooklyn“There are a lot of reasons I don't ever want to move out of Cobble Hill, Brooklyn, but my proximity to June definitely ranks high on that list. The food is thoughtful, playful, and changes often (with some mainstays, like the fantastic little gem salad, evolving from season to season), which means there’s always something new to try. The natural wine list is full of fun bottles (chilled red! Skin-contact! Sparkling orange!), and the staff knows their shit when I’m looking to try something new. The space’s close quarters makes it a perfect spot to catch up with a friend or low-key celebrate over a carafe (or five). It's where I went to fete a few major moments this year, including my engagement and a new job—this one!” —Sasha Levine, senior editorInstagram contentThis content can also be viewed on the site it originates from. Fat Dan’s, Indianapolis“My family took me to Fat Dan’s when I was home recently—we needed to go to a pro Chicago sports bar to watch the Cubs game! It’s Windy City–style deli food, done right. (Plus, they have great craft beer on rotation!) The Dirty Tots are my favorite: They come piled with smoky pulled pork, scallions, cheese sauce, and housemade hot sauce. Now when I’m home, I always go to Fat Dan’s—even when baseball season is over.” —Kate Fenoglio, associate production managerInstagram contentThis content can also be viewed on the site it originates from. Bar B, New York City“I live in the West Village and there's this cute standing bar called Bar B on 7th Avenue. It’s from the same owner from Basta Pasta, and I’m slightly obsessed with them too. (You probably know Basta, but if not, it’s a Japanese-owned Italian restaurant that's been here since the ’90s. Obsessed.) Anyways, I love the vibes in Bar B. Everyone is so friendly and happy, the small plates are delicious, and the wine and Aperol Spritz are fantastic! It’s super easy to pop in for a drink and bite and be on your way!” —Michele Outland, creative directorInstagram contentThis content can also be viewed on the site it originates from. N7, New Orleans“When I went to New Orleans for my 30th (!!) birthday, we went to N7 three times. I’d never felt so seen by a restaurant. I could eat there every day for the rest of my life and die happy (or full of mercury from all the tinned fish, hard to predict). The wine is divine, the atmosphere is like a sexy secret garden, the fresh seafood and fried bar snacks all pull my heartstrings. Ugh, I want to get on a plane and go back right now.” —Alex Beggs, senior staff writerInstagram contentThis content can also be viewed on the site it originates from. Reel M Inn, Portland, OR“After visiting Portland, Oregon, at least once a year for the past five years, I FINALLY made it to Reel M Inn, one of the great dive bars in not just PDX but the United States of America. I truly did not believe that the fried chicken could be as good as everyone—and by everyone, I mean the Ace's Donald Kenney—said it was, but it is so worth the excruciating wait. I can't believe I've been missing out on this for years.” —Julia Kramer, deputy editorInstagram contentThis content can also be viewed on the site it originates from. Better Luck Tomorrow, Houston“I'm obsessed with this little joint in Houston called Better Luck Tomorrow. It's from the same people behind Oxheart and Theodore Rex, and I'm in love with the massive shelving system behind the bar lined with neon lights. It's going to be my go-to watering hole whenever I’m back home. Cool vibes, maddeningly delicious bites like spaghetti sandos, and pasta Tuesday (!!) make the technicolored bar feel simultaneously familiar and brand new.” —Jesse Sparks, editorial assistantInstagram contentThis content can also be viewed on the site it originates from. Talula’s, Asbury Park, NJ“I go to the Jersey Shore most weekends in the summer with my family. They have their own go-to pizza spot, so I hadn’t been to Talula’s...until I found myself in Asbury Park without the whole fam this past July. It's pretty packed (clearly I'm late to the party!), but the Neapolitan pizza is so worth the wait. The crust is thin and charred in all the right places, and though some people find it controversial to put honey on pizza, the Beekeeper's Lament with soppressata, mozzarella, and local honey is a pizza I’d eat weekly. I love it because even though it’s trying to be a ‘hip’ Neapolitan restaurant, it can’t shake its laidback Jersey Shore vibe.” —Elaheh Nozari, e-commerce editorInstagram contentThis content can also be viewed on the site it originates from. Bernie’s, Brooklyn“Walking into Bernie’s in Greenpoint is like entering a mash up of a suburban Pizza Hut circa 1992 and a classic, old school NY steakhouse. That is to say, it’s perfect. There are tiffany lamps hanging above oversized crimson red booths, and you are greeted with a warm welcome every time without fail. The menu is a roundup of extremely well-executed American classics. Think: a ginormous large-format Caesar salad, a classic wedge topped with a huge slab of bacon, buttery clams casino, shrimp cocktail in a parfait glass, or a double patty burger. It’s the first restaurant that pops into my head when I just want some really good food in a place with really great vibes. The embrace is so good, they make you feel like family. —Molly Baz, senior associate food editorInstagram contentThis content can also be viewed on the site it originates from. Cellar Door Provisions, Chicago“I went to school in Chicago, where I subsisted mainly on a diet of frozen custard and Lou Malnati’s deep dish pizza. But when I returned to visit friends this summer, I fell hard for the transcendent pastries and ultra-seasonal dishes at Cellar Door Provisions. The “no-vegetables-in-Chicago” trope isn’t exactly true, but they never tasted as good as this. Their small menu is seasonal, giving me an excellent reason to return again and again (although maybe not in winter) to see what thoughtful dishes are popping up.” —Aliza Abarbanel, editorial assistantInstagram contentThis content can also be viewed on the site it originates from. Pyramids Halal Meats, Syracuse, NY“Pyramids Halal has become my go-to lunch spot when I'm visiting family in Syracuse. Hani Mahmood runs the butcher shop while Tatiana, his wife, makes the incredible home-cooked lunches on the side. Everyday she prepares the most incredible beef gyro using a special blend of Egyptian spices. Hailing from Russia and Egypt, respectively, she and Hani relocated to Syracuse in 2004, and she's inherited a lot of cooking traditions from her in-laws.” —Michelle Heimerman, visuals editorInstagram contentThis content can also be viewed on the site it originates from. Konbi, Los Angeles“I stalked Konbi like an ex on Instagram for months before I actually went. But on a recent trip to my hometown of L.A., I got to experience it IRL. There’s the jammy egg salad sandwich that I could happily eat for lunch every day. The unassuming-yet-delightful turnips with toasted rice, sesame, and lemon. And the chocolate croissant featuring an obscene amount of flaky layers. If I lived in L.A., I’d, well, live there.” —Rachel Karten, senior social media managerInstagram contentThis content can also be viewed on the site it originates from. David’s Cafe, New York City“I don’t understand why no one knows about David’s Cafe! My friend Jamie Feldmar took me here and we were pretty much the only people eating. Chef David Malbequi is French, so you’ll find cheap (but good) house wine and a raclette special that’s what dreams are made of. But Malbequi is best known his burger—and it may be my favorite in the city right now.” —Andy Baraghani, senior food editorInstagram contentThis content can also be viewed on the site it originates from. Barbarie’s Black Angus, Danbury, CT“I recently became obsessed with this totally suburban steakhouse near my boyfriend’s hometown of Bethel, CT, called Barbarie’s Black Angus. It’s the only place in town where you actually need a reservation, and it’s always poppin’. I’ve heard the steaks are the best in Connecticut, but I go there for the grilled swordfish and the sides: roasted sweet potatoes, brussels and bacon, a skillet of mac and cheese that could be an entree for two. Yes, the portions are big, but in a high-quality, you-want-to-eat-the-leftovers way. I believe in fully embracing one’s time in the suburbs—eat like a local and such—and for me that means a trip to this steakhouse. LOL!” —Amanda Shapiro, senior editorInstagram contentThis content can also be viewed on the site it originates from. SRV, Boston“SRV is where I go when I want to eat a bunch of small bites. The Northern Italian/Venetian spot in the South End is not billed as a small-plates restaurant, but they have a sub-menu of actually affordable—in the $2 to $4 range—cicchetti. I order a lot as an excuse to sample things I might not normally order, like olives in the castelvetrano fritte, stuffed with pork sausage and montasio cheese; giant corona beans in a soffritto vinaigrette; my first beef tongue, served with tonnato and gribiche (a twofer); and tempura blowfish tail with grappa sauce (whoa). But I will eat anything they put on crostini, from duck mousse to salt cod on black bread.” —Alyse Whitney, associate editorInstagram contentThis content can also be viewed on the site it originates from. The Admiral, Asheville, NC“There’s a lot I love about Asheville (the Moog synthesizer headquarters! Basement record sales! The most microbreweries per capita in America!), but this West Asheville restaurant is one I’ll always go back to. The cinder block building’s vibe is part dive bar, part destination-worthy dance party, and part chef-driven restaurant. And like so many other places in Asheville, it delivers on each without being smug about it. I don’t know if it’s the drinks named after Rolling Stones deep cuts, the miso-glazed chicken with tatsoi, or the moody velvet curtains, but it sure feels like someone has been peeping my Pinterest page.” —Tommy Werner, video producerInstagram contentThis content can also be viewed on the site it originates from. Via Carota, New York City“I was late to the Via Carota party. I went for the first time in January, and then went many more times after that. I sat at the sunny bar for a solo lunch of risotto and the most ethereal panna cotta on a chilly Wednesday and it warmed me down to my frozen toes. I found my salad soulmate in the spring pea salad months later, and shared it with some of my favorite people for my birthday in May. Over the summer I invited a man who I thought for a minute could be my human soulmate to dinner, and when he was unimpressed, I knew it wouldn't work out between us. But it's the verdue section of the menu that keeps me coming back: salads and sides that seem so simple in concept but are executed just so... all served in a space that feels always feels tumblingly buzzing and warm despite the long waiting list that quickly adds up, the service remains calmly attentive.” —Anna Stockwell, senior food editorInstagram contentThis content can also be viewed on the site it originates from. In Bloom, St. Paul, MN“I moved away from the Twin Cities a decade ago, but I would move back just for the restaurant scene, which keeps getting more interesting the longer I'm away. Several times a year, however, I'll map out an eating plan weeks in advance of family visits, and I'll always end up in Minneapolis. Not this year. In Bloom has lured me across the Mississippi River several times to St. Paul. It's located inside the hip Keg and Case Market, a former brewery, and you know you've arrived when the scent of oak burning from the open-fire cooking hits you. It smells and feels like you're hanging out in a cabin in northern Minnesota (albeit a more modern one). The menu is filled with game meats like pheasant and venison, with local ingredients including wild mushrooms and berries sprinkled throughout. It's the food I've been thinking about lately as winter approaches, and I'm missing home.” —Bao Ong, research managerInstagram contentThis content can also be viewed on the site it originates from. Suraya, Philadelphia“I've been to Philly four times in the past year, and I've had lunch at Suraya three of those times. The man'oushe and the labneh and the hummus and the ful madammas and the kafta kebabs and every other thing on the menu of comforting, immensely flavorful Lebanese food all make that two-hour bus ride well worth it. That, and my parents who live nearby, of course. Duh. Love you, Mom. Love you, Dad.” —Alex Delany, associate editorInstagram contentThis content can also be viewed on the site it originates from.Explore Bon AppétitRestaurants + TravelRead MoreLifestyleYou Still Have Time to Order This Beautiful Cookie Box For ChristmasBy Sarah JampelcultureThe Formula for a Memorable Holiday PartyBy Adam RapoportsponsoredGifts for the Food Lover Who Has EverythingBy NespressoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-14", "author": ["Condé Nast", "The Bon Appétit Staff"]}