{"id": "ce403f684c2840f8bd114c8dc9930b7c", "url": "https://www.bonappetit.com/story/the-ultimate-pizza-road-trip-of-the-northeast", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "The Ultimate Pizza Road Trip of the Northeast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredThe Ultimate Pizza Road Trip of the NortheastPack your napkins and hit the road. Pizza is waiting for you.By AutotraderFebruary 18, 2020FacebookTwitterEmailTalula'sMICHAEL PERSICOFacebookTwitterEmailPizza is a hot topic in the Northeast. Competition is steep between New York City and Boston alone, and that doesn’t even include the college towns along the way. (Looking at you, New Haven.) What better way to taste some of the most buzzed-about, fussed-over, vehemently debated pizza than on a road trip? This comprehensive list takes a knee––and a slice––at some of the hottest heavy hitters, newcomers, and all-around standouts in the American Northeast.First Stop: PhillyPhiladelphia is teeming with sights worth seeing, enticing plenty of road trippers with historical landmarks and museums, but its pizza scene is equally as legendary. Like the city itself, the pizza contingency is a mix of traditional, old-world joints and Instagram-friendly newbies, but one must-stop? Santucci’s. It’s been around since 1959, and was first made famous for its square pies. While you may be tempted by old-world comfort dishes like short rib gravy fries with provolone whiz, you can’t leave The City of Brotherly Love without a signature Santucci’s pie.Talula's\nMICHAEL PERSICOA Slice of JerseyFrom Philly, head east into New Jersey and hit the coast. There, Pete & Elda’s has been serving their famed thin-crust pizza in Neptune City for more than 50 years. Those who finish an XXL pizza––which is 18 inches in diameter––win a free t-shirt. But nearly everyone who’s ever been to the Asbury Park area will tell you that going to Talula’s is nonnegotiable. Their pièce de résistance is high-quality, seasonal, and sustainably grown ingredients in a space with a hip, casual aesthetic and a cool beachside menu. You could order the shaved brussels sprout salad, but this is a pizza tour, remember? Next, make your way north into Jersey City for Razza, the wood-oven pizza known for excelling at both bread––homemade and milled in nearby Clifton––and toppings, which are handpicked right down to the salt.Since you’re scooting around several states, be sure you’ve got a solid set of wheels to get you there. Before you even begin your pizza sojourn, take a look at Autotrader, which is the most complete online car shopping destination. They save you time (which we all know: is money) and they make the car buying process easier for you.  What could be better? And with all the stops you’ll want to make in and around New York City, a reliable ride is imperative––because that’s exactly where you’re going next.Emmy Squared\nNo Contest in New York CityThere is no disputing the multitude of memorable slices in and around the New York City metro area. There’s legends like Lucali, Mark Iacono’s famed Carroll Gardens mainstay that’s so accustomed to overflow that their website preemptively explains that guests should “Show up before 5. Put your name on the list. Go have a drink.”  Make your way back to North Brooklyn and put in your name at Ops, the new-wave, jam-packed, no-reservations Bushwick joint with freshly baked sourdough-crust pies. Emmy Squared in neighboring Williamsburg, and now in the East Village and Upper East Side, brings trendy, square Detroit-style pizzas to NYC crust lovers, while the Lower East Side’s Una Pizza Napoletana is easily one of the best Neapolitan pizza places below 14th Street.The Notables of New HavenOn your way from NYC to Boston, you’ll drive right past New Haven, known for a certain Ivy League college and, naturally, its pizza. Because every good college town needs a reliable pizza scene. At Sally’s Apizza, this storied spot has been using the same coal-fired oven for their handmade pies for 80 years. And for those seeking a new-age pie with a trendy twist, BAR New Haven serves classic and eclectic pies (like bacon and mashed potato pizza) at a space that’s part pizzeria, part brewery, and part dance club. With this much going on, how could one ever find time to study?BAR New Haven\nThe Best of BostonWhile Bostonians can be passionate about a lot of things (baseball, coffee, traffic), they thankfully can agree on some of the city’s most famous pizzerias. You can’t pass through without stopping at Regina’s, founded in 1926 in the North End by Luigi D’Auria but passed on to the Polcari family in 1956. The heritage empire prides themselves on a century-old dough recipe, specially crafted sauce, aged whole milk mozzarella, and always-fresh toppings. On the other side of the aisle is Santarpio’s. What started out as a bakery in 1903 has evolved into one of the city’s greatest pizza landmarks serving some of the tastiest New York-style pizzas this side of Massachusetts.If you’ve committed to driving across several states for the best pizza in town, you want to be confident that you’ve found the right car to get you there––and at a fair price. That’s the beauty of Autotrader. With the largest variety of cars and Kelley Blue Book Price Advisor on listings, rest assured that you’re getting the most trusted pricing on your next vehicle. While this can’t be said for all things, when it comes to buying a car, you can have it all. Or should we say, you can have your pizza and eat it, too.Explore Bon AppétitPizzaRoad TripRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-18", "author": ["Condé Nast"]}