{"id": "ce4939d45979d5744e4c92d0c0267264", "url": "https://www.bonappetit.com/story/compost-at-home", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Turn Kitchen Waste Into Garden Compost, There's Never Been a Better Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusThere's No Better Time to… Start CompostingSome people adopted a pet. I got a composter.By MacKenzie Chung FeganApril 8, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. Today: Ground yourself with an at-home composting ritual.Things I looked forward to a month ago: Date night at a new restaurant. Parties at a friend’s house. A vacation to somewhere warm and beachy.Things I look forward to now: Bulk fermentation. New growth from my tarragon plant. And most especially, composting.Without irony, I tell you that tending my 37-gallon backyard composter is a true highlight of my day. I nurture the rotating drum like a favored pet, feeding it the day’s bounty of egg shells, coffee grinds, and vegetable peels. I peep in at the kitchen scraps and damp newspapers, willing them to transform into fertile loam. How, I wonder while earnestly googling the optimal ratio of green-to-brown material, did my life go from happy-go-lucky urbanite to full-blown homesteader so quickly?Like many other middle-class, childless Brooklynites, my housemates and I were accustomed to relying on the conveniences of the city. We ate out when we didn’t want to cook, dropped by the butcher on the way home from work to pick up one or two things, occasionally ran out of dish soap due to a lack of forethought. But as the coronavirus grew closer and closer to home, a shift occurred.“What’s the best way to rig up an irrigation system on the roof?” my fiancée Margaret mused one morning while I was brushing my teeth. “How many pounds of dried beans do we have?” asked our housemate Max, whom I had never known to express much interest in bean-related matters. Both Margaret and Max grew up Mormon, the descendants of hardy Utah pioneers who persevered through swarms of locusts and seasonal drought. It was as if the impending crisis was erasing decades of soft, secular city living, returning them to their frontier roots.We went to Fairway to stock up on the essentials, and I watched with amusement as Max and Margaret switched into Mormon autopilot. Contemporary church protocol is informed by the hardships faced by early pioneers; in a pamphlet entitled “All Is Safely Gathered In,” the Church of Jesus Christ of Latter-Day Saints encourages its members to have, at minimum, a three-month supply of food with a focus on “staples such as wheat, rice, pasta, oats, beans, and potatoes that can last 30 years or more.” (I pointed out to Margaret that potatoes don’t last thirty years. “No, but potato pellets do,” she replied.) We had plenty of rice at home, so I didn’t think we needed another five-pound sack. It went in the cart anyway. Max returned from the cleaning supplies aisle juggling laundry detergent, Lysol wipes, and an enormous jug of Windex. Even in a crisis, Heavenly Father expects clean windows.And then the deliveries started to arrive at our house—tomato plants, five-gallon buckets, potting soil, irrigation tubing, enough dill seed to sow 256 feet. I found myself starting to lean into our new Little House on the Eastern Parkway lifestyle. I made and canned three pints of chutney. I drew up pantry lists and freezer lists. I procured a sourdough starter. And, after researching the pros and cons of bins and tumblers, I bought a composter.Max says looking at a pantry full of lentils and grains brings him a sense of comfort and security. This is perhaps a weird thing to say, but I now feel the same way about composting. At a time when so much feels out of control, the closed system of compost feels grounding. I put in banana peels and dead leaves. I rotate the drum like a giant bingo cage. I wait. It’s only been a few weeks—too soon for things to start really breaking down, especially with the cold weather we’ve been having—but I peek at it anyway, convincing myself that it looks a little more compost-y than the day before. If I follow the right steps, I know that something valuable will be created out of waste, ready to nourish our nascent garden.What will our lives look like months from now when our first tomatoes are ready for harvest? I hope, of course, that restaurants will be open, people back at work, the specter of sickness no longer hanging over our city. But even if that’s the case, I think we won’t cast aside these new old habits so quickly. We’ll garden. We’ll cook at home more often. We’ll compost. I can’t get behind potato pellets, but the rest of homestead life isn’t so bad.Buy it: FCMP Outdoor Tumbling Composter, $77 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitBasicallyThere's No Better Time CoronavirusRead MoreLifestyleHow to Stop Making Excuses and Start Composting AlreadyBy Aliza AbarbaneltechniquesCompost in the CityBy Bridget MoloneyLifestyleWant to Reduce Your Waste? Do This First. By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-08", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}