{"id": "ce872dd45cee9e19925b6b2b9f2d1408", "url": "https://www.bonappetit.com/city-guides/los-angeles/venue/marugame-monzo", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Marugame Monzo Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlos angelesMarugame MonzoPerfectly chewy, handmade udon in Little TokyoFacebookPinterestTwitterEmailRen FullerGO: for one thing: Marugame Monzo’s fatty, dense noodles. Yes, it’s worth the wait.ORDER THE: udon, of course. You can’t go wrong with really any of them—as intensely as the noodle cooks are about rolling out and chopping the thick stands to order, they’re equally intense about the soup they pair the noodles with. But our favorites are the simple ones, like hot kake with pops of fried tempura dots and sea urchin cream.THE VIBE IS: efficient. There’s not much ambiance—dark wood chairs, dark brown leather booths, yellowish lighting—but you don’t really mind when you’re slurping as much of those heavenly noodles as you possibly can. The staff is quick to get your order in (and you out) since there’s a constant line out the door, but they’re attentive and easy to flag down.PRACTICAL STUFF: Open every day: Monday to Friday, 11:30 a.m. to 2:30 p.m. and 5 p.m. to 10 p.m., and Saturday and Sunday, 11:30 a.m. to 10 p.m.—Elyse InamineRen FullerWE ALSO LOVENight + MarketThai street food, Sunset Boulevard-styleJitladaDefinitely the best Thai food in L.A., and likely the whole countryRiceBarEverything’s coming up rice bowls in downtown L.A.Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-10-02", "author": ["Elyse Inamine"]}