{"id": "ce97c16f0787b82bbd7ac1c08b8a35e2", "url": "https://www.bonappetit.com/story/never-fail-sweet-spicy-sambal-pork-noodles", "year": 2019.0, "month": 3.0, "day": 5.0, "content": "These Spicy Pork Noodles Gave Me the Craziest FOMO | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Sweet-Spicy Pork Noodles Gave Me the Craziest FOMOHearing other people rave about them was making me nuts. I knew I needed to make these spicy pork noodles ASAP.By Emily SchultzMarch 29, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I have FOMO. Like, extremely bad. (That's Fear Of Missing Out, Mom!!!) It’s the reason I stay up way too all the time, spend money on things I don't need, and stalk other people's Instagram vacations way too often. But FOMO has its advantages. For instance, it brought these spicy and sweet sambal pork noodles into my life. Allow me to explain.When a recipe gets developed at BA, the food editor assigned to that story holds formal tastings for all of the people involved in that story. Everyone gives their feedback, the developer makes their tweaks, it gets tested again, and everyone tastes the improved version and gives their sign-off. After that, it goes to a cross-test, a process in which someone else in the Test Kitchen cooks through the recipe to make sure the instructions are clear and easy-to-follow. After everyone working on the story has tasted, the leftovers will usually sit on a long table, available for any hungry souls who may be passing by.For about a month, my colleagues would not shut up about how incredible Chris Morocco’s spicy-sweet pork noodles were. The folks involved in the story counted down the minutes until his tastings. And for those four weeks I monitored the Slack channel we use for tasting invites obsessively, trying to time a casual trip to the test kitchen so that it coincided perfectly with the appearance of the leftovers. But there were none. Every time I went down, my mouth watering thinking about those noodles, they were always gone.The recipe finally dropped on a Friday morning a few weeks back, and I relived the torture yet again. “You could literally just spoon the sauce directly into your mouth,” someone would wail. “Wow! Remember tasting those?!” They wouldn't stop rubbing it in. So you know what I decided to do that night? (Although “decided” isn't the best word, seeing as my FOMO had completely taken the reins.) I marched over to my favorite supermarket in Chinatown, grabbed the goods, and booked it home to make the damn pork noodles.And yeah, they were as good as all of my extremely lucky and annoying coworkers said they were—and easy to make, too. First, you add half of the pork and break it up into big chunks. It’s important not to move it around too much, because you want the underside to brown and develop flavor, rather than just get grey. Once you feel confident about the browned pork, add in your garlic, ginger, sugar, and remaining pork to the pot. (Chris told me the reason for separating the pork into two batches is because you’ll never have a pot big enough to brown the entire two pounds of pork at once, so it was more important to him to develop deep flavor and rich color on half of it, rather than getting mediocre browning on all of it.)Sambal oelek, a fermented chile paste, lends plenty of spice and depth to the sauce.\nThen you add tomato paste and basil. You stir around the tomato paste until it darkens in color, which will also indicate that the raw tomato flavor will be cooked off. After that happens, you can add in sambal oelek, soy sauce, vinegar, and water and let that thicken and reduce for about 40 minutes. The result is a rich, ruddy, crazy-flavorful sauce that tastes like the love child of Italian bolognese and Thai pad kee mao, and it was every bit as amazing as everyone said it was.And the rest is really up to you. I’ve spooned the mixture over jasmine rice for dinner, or steamed bok choy for a dinner party-worthy side dish. My coworker Molly even made lettuce cups with it! But the first time I made it I tossed it with ramen noodles, just like the recipe says, so I could have the same experience I'd missed out on all those weeks. And, of course, I immediately sent a photo of it to all of my coworkers—it was their turn to be jealous.Get the recipe:Spicy-Sweet Sambal Pork NoodlesFull-on explosive flavor in under an hour.View RecipeExplore Bon AppétitBasicallyNever FailPorkSambal OelekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-29", "author": ["Condé Nast", "Emily Schultz"]}