{"id": "ce9fd7c38eb2ab9b88d1674d3a4358f6", "url": "https://www.bonappetit.com/recipe/pork-chop-cacciatore", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Pork Chop Cacciatore Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssuePork Chop CacciatoreBy Anna GassOctober 19, 20214.1(19)Read ReviewsTriangleEmailPinterestPrintPhotograph by Julian Cousins, Food styling by Adriana PaschenEmailPinterestPrintEmailPinterestPrintCacciatore (meaning “hunter-style”) is an Italian wine-and-tomato-based braise traditionally prepared with whatever game was caught that day. This version from Heirloom Kitchen author Anna Francese Gass uses bone-in pork chops that are cooked quickly to keep them juicy, paired with a tangy-sweet cacciatore-inspired sauce. Serve with a loaf of crusty bread to sop up all the tomatoey goodness.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonInstant-Read Thermometer$35 At ThermoworksLarge Basting Spoon$16.37 At AmazonTongs$13 At AmazonWooden Spoon$6 At AmazonIngredients2 - 4 Servings25–6-oz. bone-in pork rib chops1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus moreFreshly ground black pepper1tsp. dried oregano2Tbsp. extra-virgin olive oil, divided1red bell pepper, ribs and seeds removed, coarsely chopped1small onion, coarsely chopped2garlic cloves, smashed1Tbsp. double-concentrated tomato paste¾cup red wine128-oz. can diced tomatoes1Tbsp. drained capers2sprigs oregano, plus leavesCrusty bread (for serving)PreparationStep 1Pat pork chops dry with paper towels. Season on both sides with salt and pepper; sprinkle all over with dried oregano.Step 2Heat 1 Tbsp. oil in a cast-iron skillet over medium-high. Cook pork chops, undisturbed, until just starting to brown, about 3 minutes per side. Transfer to a plate.Step 3Reduce heat to medium and add remaining 1 Tbsp. oil to pan. Cook bell pepper, onion, and garlic, stirring often with a wooden spoon, until onion is softened and golden, about 4 minutes. Add tomato paste and cook, stirring often, until vegetables are coated and paste is darkened slightly, about 1 minute. Add wine, scraping up any browned bits. Reduce heat to medium-low and simmer gently until wine is reduced by a little more than half, about 5 minutes.Step 4Mix in diced tomatoes, capers, 2 oregano sprigs, and remaining 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt and cook, stirring occasionally to prevent sticking, until sauce is slightly thickened, 18–22 minutes.Step 5Nestle pork chops into sauce and add any juices that have collected on plate. Spoon a bit of sauce over pork and simmer gently until meat is cooked through and an instant-read thermometer inserted into the thickest part registers 145°, 6–8 minutes.Step 6Divide chops and sauce between plates. (Cut meat from bones and thickly slice if dividing among 4.) Top with oregano and serve with bread.How would you rate Pork Chop Cacciatore?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleMegan, I'm a long time cast iron cooker. It is best not to cook acidic food in a cast iron skillet that is newly seasoned. If it's an old, old one like some of mine it won't hurt to cook acidic food in it for a short period of time but I wouldn't let it sit for long after cooking. Nor would I cook a long simmered acidic sauce in cast iron. It's not that it harms the pan, but the iron can leach out, which is not bad for you but can make your sauce taste metallic.\n\nAt least that's what I was always told by my Mother and Grandmother (who's cast iron skillets I have and still use....)\n\nJust an aside here, when I was a kid and had to clean up the kitchen I put Momma's cast iron skillet in the dishwasher ('cause I was lazy) more than once and it suffered no ill effects. I AM NOT recommending that anyone do that, this was an OLD, extremely well seasoned pan. I wouldn't do that now to save my life, but she never knew and I still have that skillet.....Lisa BooneAthens, GA11/15/2021Megan, I think the relatively short cooking time won't do any harm to the cast iron pan. But I also think you should get everything out of the pan and rinse it thoroughly (and put it back on the burner to dry) while you let the pork chops rest for a minute or two before eating.Dan from CT11/14/2021I haven't tried it but was under the understanding that you shouldn't cook acidic sauces like tomato based ones in cast iron pans. Megan Auckland, NZ11/13/2021First...I NEVER cook a pork chop without Brineing it for at  least four hours. Additionally, if you want to serve tomatoes over them, simply slice a plate full of Cherry Tomatoes and fry them with the onions, capers, and garlic. I will agree about the crusty bread, but then again, that should be served with EVERY meal you eat....sorry BA, you dropped the ball on this one.Gary StroupeFort Bragg, California11/13/2021Sort of a big \"MEH\".  Nothing really melds.....it's a pork chop with a pile of tomato sauce.   WAY too much sauce for the pork indicated.   Pass.maestromooreNYC11/13/2021The highlight of this recipe is the excellent \"cacciatore\" sauce. I added more capers as I love the stuff and also some mushrooms (added along with onion). The chop, however, did not blow me away. I feel like the 5 minutes of cooking in the sauce, post-sear, rendered the chops tougher and dryer than they should be. As this last cooking is too short for the sauce to impart any flavor to the pork itself, I will try to cook the chop entirely (BBQ, cast-iron or even better sous-vide) and assembling everything on the plate. I served the pork on a bed of simple roasted root vegetables. Would try again!FelixMontreal11/10/2021Explore Bon AppétitPork ChopPorkMeatBraiseDinnerTomatoVegetableCast ironWeeknightEasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Anna Gass"]}