{"id": "ceab7f62026db028409a13365dcbc29c", "url": "https://www.bonappetit.com/story/snow-days-pizza-bites", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Snow Days Grain-Free Pizza Bites Are Deliziosi | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Grain-Free Pizza Bites Are DeliziosiThey’re chewy, gooey, and packed with organic veggies and mozzarella.By Ali FrancisJuly 2, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!If you grew up on frozen pizza rolls, you’re gonna love Snow Days’. They’ve got all of the same salty, tomatoey, gooey goodness, with an ingredient list that reads more like a salad: olive oil, carrot, sweet potato, spinach, apple cider vinegar, and tomato. In comparison with regular store-bought pizza rolls that have, like, 60 ingredients (I stopped counting somewhere between titanium dioxide and modified corn starch), Snow Days pizza bites are made from just 21—all of which are entirely recognizable and totally delicious. They come in sausage, buffalo chicken, veggie white, and classic cheese pizza flavors, and since trying them I’ve spent every Friday afternoon lazing on the lawn with a bowl o’ bites and an Aperol spritz, channeling snow day vibes in the summer.Founder Jason H. Karp was diagnosed with several autoimmune diseases in his 20s, which motivated him to create a pizza bite free of grains, gluten, artificial ingredients, and preservatives. As someone who used to run a gluten-free cannabis baking company, I understand how difficult it is to produce structurally sound and texturally delightful foods sans wheat flour—but I genuinely loved the pizza bites’ cassava flour dough. After eight or nine minutes in a 400°F oven (heed Snow Days’ instructions; I overcooked mine the first time and they burst like tiny, marinara-filled balloons), the bites returned crispy on the outside and chewy on the inside. Perfetto!Because they are nugget-size, my only gripe is that once you start eating them, it’s basically impossible to stop. But fellow pizza connoisseur Elizabeth Gilbert, while preparing to part with her sun-drenched Roman apartment in Eat Pray Love, once declared the denial of harmless pleasures a moot point: “The easiest, most fundamentally human way to say it is that I have put on weight,” she wrote of her sabbatical spent gorging pizza, pasta, and a particularly dreamy-looking asparagus and egg situation. “I exist more now than I did four months ago.”Photograph by Emma FishmanGrain-Free Pizza Bites, 2-Pack$35 at Snow DaysExplore Bon AppétitHealthyishHealthyish Loves ItShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-02", "author": ["Condé Nast", "Ali Francis"]}