{"id": "ced5dffc703979c100686fbeda77f973", "url": "https://www.bonappetit.com/story/all-chianti-is-my-kind-of-chianti", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "All Chianti Is My Kind of Chianti | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAll Chianti Is My Kind of ChiantiBA’s wine editor has a not-so-guilty pleasure.By Marissa A. RossApril 16, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.My husband refuses to go to Little Italy with me because we always end up eating at the first restaurant featuring an adorable old man outside with a thick accent, a mouthful of flattery, and a promise of Chianti. Yes, I’m a sucker, and I don’t care. The food is never as good as my husband’s (my mother-in-law is from Emilia-Romagna), but it’s not about the food. It’s about the Chianti.Chianti begs to be poured from straw-woven fiasco bottles in the company of oversize Sophia Loren portraits. The glasses are always too small or too big but somehow just right. Simply the color of “red wine,” Chianti often smells and tastes just as nondescript (despite the multitudes its patron-saint grape Sangiovese possesses). Sure, it has the potential to be earthy and romantic, its flavors of cherry and plum ringing with acidity like the strings of a mandolin. Or it can just be table wine.And that’s how I prefer it: to pour it, to drink it, to talk over it with hands flailing. To let it take me back to childhood dinners at Vince’s Spaghetti in Ontario, California, where my father washed dishes as a kid. To laugh about how I had no idea Buca di Beppo was a chain, and called every day to get hired as a host in high school because The Godfather was my favorite movie (the only R-rated one I was allowed to watch), I knew all of Dean Martin’s hits by heart, and I had a “tight five” comedy routine about my nonna’s house ready for theatrical kitchen tours. To reflect on how I didn’t appreciate the crowds my grandfather drew when he’d hijack the piano at Nordstrom to play Liberace’s Italian medley. To remember all the things I don’t when I’m sitting at my own dining room table, dissecting the latest bottle from the Loire or discussing that morning’s NPR talking points.Maybe that’s why I love drinking Chianti at restaurants. It always brings me back home.Marissa Ross is Bon Appétit's wine editor.Explore Bon AppétitRestaurantsItalian AmericanWineRed SauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Marissa A. Ross"]}