{"id": "cef43346d2565a0aa82c2719f33ca8dc", "url": "https://www.bonappetit.com/story/dont-buy-horse-carrots", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "If You're Buying Horse Carrots I Feel Bad for You, Son | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You're Buying Horse Carrots I Feel Bad for You, SonYou're better off with 99 small carrots than a ginormous one.By Alex DelanyApril 10, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Pearl JonesFacebookTwitterEmailHave you ever watched a horse movie? Seabiscuit? Black Beauty? Any movie with horses in it? If you answered yes, you will be familiar with the concept of \"horse carrots.\" There’s always a scene where the stablehand or trainer or whoever takes a huge carrot and feeds it to a horse. A truly massive, audibly crunchy carrot, appropriately sized for a horse. That is a horse carrot.Human beings eat horse carrots too. You can buy them at almost any grocery store. They’re usually sold loose, by the pound, in a big bin. You might walk by and pick one up and say something like, Wow, this is a large carrot! You probably know what I’m talking about. And it can be tempting to buy these monstrous carrots—it definitely seems efficient. You only have to peel one carrot instead of four! They're easier to butcher! But here’s the thing: You should always avoid the big carrots and opt for the smaller ones instead.When it comes to vegetables, bigger is almost never better, and this is particularly true with carrots. Those horse carrots have higher starch levels, more water, less flavor, and minimal natural sweetness. They are a shade of what a carrot should be. They’re more impressive when it comes to size, but when it comes to flavor, you’re getting almost nothing.And we use that natural sweetness for establishing a base flavor in a wide variety of dishes. If we’re using carrots in a mirepoix (that combination of chopped vegetables that chefs sweat out to start soups and the like), we’re expecting them to do the heavy lifting in the sugars department. You won’t get that base layer of flavor if you use a horse carrot. You’re really just adding moisture and starch. And if carrots are the star of the dish, well, you get the picture.The smaller the carrots, the bigger the flavor.\nPhoto by Chelsie Craig, Food Styling by Dana BonaguraSo what kind of carrots should you buy? If you’re the intuitive type, you’d say, The smaller ones! And you’d be right. To be clear, I’m not talking about bagged baby carrots. You shouldn’t buy those either. I’m talking about the reasonably-sized, slender carrots that usually come in a bunch, sometimes with the green tops still attached. These carrots tend to be sweeter, with a more concentrated carrot flavor. Whether you’re using them in soup, baking them into a cake, roasting them to eat as a side, or just snacking on them with a little yogurt dip.We should all be riding the small carrot wave. It’s going to make your food taste better, and that will make you happier. I’m just looking out for your happiness. And the horses! They need carrots too. Leave the horse carrots for the horses. That's how things should be.Yup, you should use small carrots in cake too:Basically Carrot Loaf CakeThe most casual-cool carrot cake of all time.View RecipeExplore Bon AppétitBasicallyCarrotRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-10", "author": ["Condé Nast", "Alex Delany"]}