{"id": "cef9ae3d9714f6f28f942c048e98fde3", "url": "https://www.bonappetit.com/recipe/spicy-soft-tofu-and-seafood-stew", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Spicy Tofu and Seafood Stew Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueSoondubu (Spicy Soft Tofu and Seafood Stew)By Sohui KimFebruary 12, 20195.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelEmailPinterestPrintEmailPinterestPrintThis fiery, bubbling Korean broth is a powerhouse mixture of alliums, kimchi, gochugaru, and briny, fresh seafood. Gochugaru has a sweet, bright pepper flavor and is much less spicy than your run-of-the-mill crushed red pepper flakes, so you can use a lot.Ingredients4 servings1Tbsp. grapeseed or extra-virgin olive oil½small onion, finely chopped2scallions, white and pale green parts only, thinly sliced2garlic cloves, finely chopped½cup chopped Napa cabbage kimchi with juices3Tbsp. gochugaru (coarse Korean hot pepper flakes)3Tbsp. soy sauce114-oz. package silken tofu8large shrimp, peeled, deveined4oz. squid, bodies and tentacles separated, bodies cut into ¼\"-thick rings8mussels (5–5½ oz.), scrubbed, debeardedKosher salt or fish sauce1large egg yolk*Cooked rice (for serving)PreparationStep 1Heat oil in a large saucepan over medium. Add onion, scallions, and garlic and cook, stirring often, until vegetables are very soft but not browned, 8–10 minutes. Add kimchi and juices and cook, stirring constantly, 1 minute (just to concentrate the flavor). Add gochugaru, soy sauce, and 2 cups water. Increase heat to medium-high and bring to a simmer. Cook just until flavors come together, about 5 minutes.Step 2Add tofu (try to keep it in one piece; using a big spoon is an easy way to remove it from the package), then surround with shrimp and squid, and finish with mussels. Cover and cook just until shrimp are opaque and mussels open, about 2 minutes. (Try to avoid stirring so tofu doesn’t break up.)Step 3Remove stew from heat; taste and season with salt or fish sauce if needed. Top with egg yolk just before serving. Serve with rice alongside.Step 4*Raw egg is not recommended for the elderly, pregnant women, children under four, and people with weakened immune systems.How would you rate Soondubu (Spicy Soft Tofu and Seafood Stew)?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis is a great recipe! Tastes authentic and very easy and straightforward to make. Only adjustment for me is that i cut down soy sauce to 1 tbsp and add 1tbsp of fish sauce. Less salty and less soy sauce flavor which i enjoy. \nAnonymous7/7/2020Why are there no other reviews of this yet?! This recipe is quite simply amazing. Have I made it properly yet? No. But the fact it’s good even with a few substitutions is a sign - and the sign says ‘You should make this!’. Couldn’t find gochugaru so substituted 1 TBSP of dried finger chilli flakes the first time, and 1 TBSP regular chilli flakes the second time I made this. Both delicious. I also didn’t have quite the range of seafood - but just prawns was delicious, and Korean seafood dumplings was also a great substitute. Plus or minus tofu, it’s all good. AnonymousLondon12/2/2019Explore Bon AppétitStewSoups and StewsKoreanEast AsianAsianTofuOther IngredientsShrimpShellfishSeafoodSquidMusselWinterMainDairy-FreeNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Sohui Kim"]}