{"id": "ceff7ad7f7f1e6b90e1ddaaaa7aed3b5", "url": "https://www.bonappetit.com/story/why-clean-haircare-is-hard-to-find", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "Why Good, Clean Hair Care Products Are So Hard to Find | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy a Good, Clean Haircare Brand Is Hard to FindClean makeup is having its heyday, so why aren't there more options for our strands?By Deanna PaiJune 11, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailYou can’t swing a Cuyana tote these days without knocking a paraben-free, phthalate-free, mineral oil-free, certified-clean lipstick out of someone’s hand, but when was the last time you thought about clean hair care?“Clean” is a catchall term that, like its cousin “natural” doesn’t actually mean anything; the FDA most definitely isn’t policing what’s in these products. That being said, clean beauty most often indicates that a makeup, skincare, or fragrance formula was created without certain ingredients. In haircare, what’s considered problematic is a little fuzzier.While some hair-care ingredients, like sulfates and silicones, can affect your hair and scalp health (more on that later), others may be hazardous for your entire body, with the  potential to disrupt or mimic hormones. Though hair is dead and contact with skin is minimal, they’re enough enough to alarm some who choose to err on the side of caution.“The clean haircare market is underdeveloped compared to skincare, makeup, and even fragrance,” says Michelle Connelly, director of merchandising and planning at clean beauty retailer Credo Beauty. That’s not for lack of trying.  Sulfates, particularly sodium lauryl sulfate, are one of the best-known ingredients to get the boot from haircare formulas. While they were good at removing oil—key for shampoos—some thought that these cheap detergents could strip moisture and color from hair. (This is contested by some derms and hairstylists, for what it’s worth.) Aveda was one of the first to ditch these ingredients, and by 2009, L’Oréal Paris was offering two lines branded as sulfate-free. Other brands, like Davines and Rahua, were designed from the start to be sulfate-free.More recently, silicones, such as dimethicone, have been a target. Often used in conditioners and smoothing serums to prevent frizz, enhance shine, and make hair easier to detangle and style, they give hair a slippery texture. But critics say that these synthetic molecules may build up on strands, leading to breakage and preventing moisture from absorbing.But silicones and sulfates are easy pickings when you factor in preservatives, which are more serious causes for alarm. Parabens, for instance, may not only irritate sensitive scalps, but research shows they also mimic estrogen. Triclosan, an antibacterial ingredient already banned from toothpaste, is still alive and well in shampoo. (The sticking point? Preservatives are typically required for hair products, which are exposed to heat and steam and create a bacteria free-for-all.) And beyond preservatives, phthalates, common solvents often listed innocuously as “fragrance” on ingredient lists, also act as hormone disruptors.Not surprisingly, ingredient choices matter even at the salon level. “For me, it’s important to let clients know what the company stands for,” says Leonardo Manetti, hairstylist and co-owner of Ion Studio, the New York-based flagship salon of natural hair brand Davines. “[That’s through] transparency around the ingredients in their products, where they harvest ingredients, and what that means for the health of the individual and the health of our planet. I look for what kind of preservatives they use and, of course, no sulfates or parabens.”The big challenge, though: These ingredients are tough to replicate. Take sulfates. “When the whole sulfate-free movement began years ago, it was difficult to formulate those products,” says cosmetic chemist Al-Nisa Ward. “There weren’t as many ingredients for sulfate-free formulation as there have been in recent years.” It was hard to recreate the luxurious lather most associate with shampooing—a signature of sulfates—and increase the viscosity of the formula, Ward explains. Both created a major challenge to getting consumers to use them. I first tried a clean, sulfate-free shampoo in 2013, and while I was on board with the primarily plant-based formulation, I hated how the shampoo seemed to disappear on my hair and left it feeling straw-like and dry.And there’s no real, “clean” replacement for silicones, though Ward mentions that certain plant oils can reduce frizz and offer similar smoothing abilities. Part of the problem is that there are far fewer ingredients available to include in a shampoo formula. “The palette of natural and non-toxic ingredients is much more limited [for hair] than, say, face or body care, so it makes formulation that much trickier,” says Emily Doyle, cofounder of clean-beauty brand Ursa Major. The formulation of the brand’s shampoo and conditioner took two years as a result.Ursa Major's shampoo uses coconut-derived surfactants to get that luscious lather.\nPhoto by Alex LauBeyond the lack of natural substitutes, it’s also harder to formulate good, clean products for hair because hair isn’t a living organism. “Whatever you apply on the skin reacts with a live substratum,” explains Laura Luciani, the international scientific communication manager at Davines. “Hair being dead, you must use ingredients that are performing without any additional help.” The ingredients have to stand on their own, which can be a tall order.Even when there are suitable ingredients, they can come at a cost. “As a direct brand, we have been able to spend six times what other brands are spending on ingredients,” says Hillary Peterson, founder of True Botanicals, who replaced sulfates in the brand’s hair care offerings with a gentler, coconut-derived surfactant. The brand also invests in whole essential oils to round out the experience of hair-cleansing—versus more affordable natural isolates, which can create engineered versions of essential oil—and that’s not cheap.Still, not everyone agrees that these ingredients are necessarily bad for you. While, yes, things aren’t looking good for phthalates, other ingredients are a little more nuanced. “‘Sulfates’ and ‘silicones’ are huge categories,” explains Mia Davis, the director of mission at Credo. “There are dozens of each, and though they're related enough to be in the same chemical class, they might have different functions and concerns. One chemical maker might be using a much safer manufacturing process than its peers.” In reality, few people are actually sensitive to sulfates, and there’s not a ton of evidence to support that they dry out hair. And they can be made in a sustainable, eco-friendly manner, explains Davis, which means they could be a good thing.Like most clean-beauty categories, haircare is still a work in progress. And experts see opportunities beyond the ingredient list. “I’m looking forward to seeing how the clean haircare market will bring new innovative products that address sustainability concerns, like the amount of water and packaging used by conventional formats,” says Connelly. That’s one upside of clean beauty’s loose definition: There are plenty of areas left to explore.Explore Bon AppétitHealthyishNatural BeautyTrendsRead MoreLifestyleThis Clean-Beauty Foundation Is Made For People Who Don't Like FoundationBy Deanna PaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-11", "author": ["Condé Nast", "Deanna Pai"]}