{"id": "cf081266a3f9f3541e04d7f1221284ca", "url": "https://www.bonappetit.com/recipe/bibb-lettuce-wraps-with-sambal-shrimp", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Spicy Shrimp Lettuce Wraps Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueSambal Shrimp Lettuce WrapsBy Molly BazJuly 10, 20184.3(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintIf you purchase frozen peeled, deveined shrimp, they’ll come with their tails taken off, which is totally fine for this recipe. If you want to grill instead, thread the shrimp onto a skewer after marinating.Ingredients4 servings½cup hot chili paste (such as sambal oelek)¼cup honey¼cup unseasoned rice vinegar4tsp. toasted sesame oil, divided1½lb. large shrimpKosher salt1–2Tbsp. vegetable oil2Persian cucumbers, thinly sliced into roundsFlaky sea salt2heads of Bibb lettuce, leaves separated, covered, chilled½cup mint sprigs½cup crushed salted, dry-roasted peanutsPreparationStep 1Whisk hot chili paste, honey, vinegar, and 2 tsp. sesame oil in a small bowl to combine. Season shrimp lightly with kosher salt and place in a resealable plastic bag. Pour in half of marinade and seal bag. Transfer remaining marinade to a small bowl and set aside for serving. Let shrimp sit at room temperature, turning the bag occasionally to ensure even coating, 10–15 minutes.Step 2Remove shrimp from marinade, allowing excess to drip back into bag, and transfer to paper towels to drain. Heat 1 Tbsp. vegetable oil in a large cast-iron skillet over medium-high until shimmering. Working in batches and adding another 1 Tbsp. oil along the way if the skillet is looking dry, arrange shrimp in skillet in a single layer and cook undisturbed 2 minutes (the marinade will have darkened in color and some of the sugars in it will have started to caramelize). Turn shrimp over and cook 30 seconds. Transfer to a platter.Step 3Arrange cucumbers on platter next to shrimp; season with sea salt and drizzle with remaining 2 tsp. sesame oil. Arrange lettuce leaves and mint sprigs on platter so that each component is visible and easily accessible. Place crushed peanuts in a small bowl and set out next to platter along with reserved marinade (for spooning into wraps).How would you rate  Sambal Shrimp Lettuce Wraps?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThese are the changes:\n1 T Worcestershire (can also use Tamari or Soya Sauce, instead)\n1-2  T grated ginger\n1 T finely minced lemongrass (can use same amount of lemongrass paste to save time)\nJuice of 1 large lime\nThai Basil, Cilantro in addition to Mint - minced and added to cooked shrimp /prawns\n\nMarinade can be used with other proteins, including Tofu or with grilled vegetables.\nCan also be used on noodleslipsticklibrarianVANCOUVER, BC CANADA6/30/2019I've made this exactly as directed and it is very versatile and a good base for alterations.\nWithout additions or changes it is a bit one dimensional.\nFor this, I give it 3 stars. lipsticklibrarianVANCOUVER, BC CANADA6/30/2019My husband loved this dish. It was very easy to make and had a lot of flavor. I think the shrimp would have even more flavor if grilled. I will definitely be making this again.ShetterleyWesley Chapel, FL9/24/2018Explore Bon AppétitWrapShrimpShellfishSeafoodLettuceLeafy GreensVegetableCucumberQuickEasyWeeknight MealsOne-Pot MealsMainDairy-FreeGluten-FreeHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Molly Baz"]}