{"id": "cf0c19e51d4270dbe9f228ffba70b9bd", "url": "https://www.bonappetit.com/story/wilson-tang-nom-wah-coronavirus-effects", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "For Wilson Tang of Nom Wah in NYC's Chinatown, It’s Business as Usual | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersculture“If I Can Eat in Chinatown, So Can You”Wilson Tang, the owner of Nom Wah Tea Parlor in Manhattan’s Chinatown, isn’t letting fear stop him from supporting his neighborhood. By Wilson Tang, as told to Elyse InamineMarch 5, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailEditor’s note, 3/15/2020: A lot has changed since this story was first published, and so have the recommendations from the Center for Disease Control. New advisories around decreased restaurant capacity have driven many businesses around the country to close, and beginning tonight, Nom Wah Tea Parlor in New York City has decided to shut its doors temporarily. The restaurant’s owner Wilson Tang tells us that this was not an easy decision and that he appreciates all the support he and the restaurant have received in response to this article since it was first posted earlier this month.About a month ago, a friend sent a group text: “Anyone free for lunch tomorrow at Nom Wah? Would love to support Wilson’s business while his sales have been down.” Wilson is Wilson Tang, the owner of Nom Wah Tea Parlor, the iconic dim sum joint in Manhattan’s Chinatown, and my neighbor in the Financial District. In the wake of coronavirus (COVID-19), New Yorkers are still taking the subways and working in big office buildings—yet many have chosen to avoid Chinatowns in Brooklyn, Queens, and Manhattan. Like many Chinese businesses across the country, Nom Wah has suffered since the news of the outbreak. In response, Wilson has been broadcasting the effects of this news on his Instagram, showing his guaranteed-line-outside business now empty and championing his neighbors with posts of his meals captioned with #supportchinatown. Yesterday, I hopped on the phone with Wilson to talk about coronavirus, its implications for his business and his community, and how he’s moving forward. —Elyse InamineI don’t even know where to start. Earlier this week, the New York Times came out with an article [about the first coronavirus case in New York state] that used an image of Nom Wah as the lead photo. People assumed that the case had to do with the restaurant, that the person who started coronavirus lived above us. That misinformation traveled quickly around Weibo and WeChat. My DMs and Facebook messages were filled with this nonsense. Everyone on the block was talking about it. We emailed, texted, tweeted at multiple people at the Times to take the photo down. It’s gone now, but if you search “Nom Wah” and “coronavirus,” that photo still comes up. That hurts my business.Just like any other person, I’m reading the news, listening, and doing my thing. I don’t get caught up in the frenzy and try to stay positive. But we did start monitoring our sales once news of coronavirus came out. We typically take a decline after Lunar New Year. But this decline was sharper. Month to month, week to week, we’re down about 40 percent in sales. It’s one of the slowest quarters we’ve had in a long time. Chinese people aren’t going out to eat. They’re staying home. They’re worried.That doesn’t mean we’re a ghost town. On weekends, that means you’re not waiting in a line for an hour; you can just walk right in. On weekdays, we’re full for lunch, but we’re just doing one turn, not two or three. That’s because, for better or for worse, our restaurant [clientele] is diverse. It’s funny because I’m often told that I’m not authentic enough because I cater to white people. At this moment, I’m like, thank god we have a diverse clientele because it’s white, Black, and Latino people who are coming.Nom Wah’s home on Doyers Street, in Manhattan’s Chinatown.\nPhoto by Laura MurrayXenophobia is a real thing. I feel it. I feel those weird moments, like a few days ago when I dropped off my kids for their gymnastics class. I got extra stares, as if I don’t get them already, being a six-foot-five Asian guy. But the Sinophobia stuff—the fear of Chinese people specifically—is worse. And right now, it’s Chinese people being afraid of other Chinese people. And that’s really hard.A lot of my cooks are older and we have this relationship, where they can come to the States to work for 10 months, then take two months off in China. That’s the shift they do. Now they can’t go home, and there is a sentiment of negativity among them because they know there is hardship there.I’ve been using #supportchinatown, which was created by the Chinatown Business Improvement District, and doing my part as a community leader to squash the fear. If I can eat in Chinatown, so can you. But there’s only so much I can do as one person. I’m just trying to get people on the bandwagon. The businesses that are suffering the most are the mom-and-pop spots in Flushing and Sunset Park—not my restaurant.Our doors are open until an authority tells us otherwise. We’re taking the proper cautionary steps—reminding our staff about thorough hand washing procedures, putting hand sanitizer at the counter for customers, constantly wiping down all surfaces (bathroom faucets, door handles, etc.) with bleach. We let out our staff early because things are slow. We’re focusing on what we need to do. I’m still optimistic. There is no way to be proactive in this way—only reactive. But I’m not going to stop my life. For us, it’s business as usual.Explore Bon AppétitRestaurantsChineseNew YorkFirst PersonCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-05", "author": ["Condé Nast", "Wilson Tang", "As Told To Elyse Inamine"]}