{"id": "cf13dbaac54af0697c3be923c45f56c6", "url": "https://www.bonappetit.com/recipe/tteokbokki-spicy-korean-rice-cakes", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "Tteokbokki (Spicy Korean Rice Cakes) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTteokbokki (Spicy Korean Rice Cakes)By Catherine YooJuly 25, 20194.6(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintIt’s impossible to resist the flavor-texture combo of this supremely satisfying Korean snack food—a riffable dish found as often in street food stalls as in home kitchens. In this version, we sear the chewy rice cakes until the outsides are crisp before tossing them in the spicy-sweet gochujang sauce. Bok choy is unorthodox, but its crisp-tender texture is a welcome addition. And while fish cakes are totally optional, we recommend taking a trip to the freezer section of your favorite Asian supermarket to explore all the different kinds.Ingredients6 servings3medium to large dried anchovies12x2\" piece dried kombu¼small plus 2 large onions, sliced8garlic cloves, 2 smashed, 6 thinly sliced8oz. assorted frozen odeng (Korean fish cakes)⅔cup gochujang (Korean hot pepper paste)2Tbsp. soy sauce1Tbsp. gochugaru (coarse Korean red pepper powder)¼cup canola or vegetable oil1lb. cylindrical rice cakes (about 2½\" long), cut in half crosswise on a diagonal1medium head of bok choy, bulbs cut into ¼\" pieces, leaves sliced into 1\" pieces2scallions, thinly sliced on a diagonal, divided3large hard-boiled eggs, halved lengthwise2Tbsp. toasted sesame seeds, crushedPreparationStep 1Bring anchovies, kombu, ¼ small sliced onion, 2 smashed garlic cloves, and 3½ cups water to a boil in a small pot. Reduce heat to medium-low and simmer at least 15 minutes and up to 45 minutes (the longer the stock simmers, the more flavor it will have).Step 2Strain anchovy stock through a fine-mesh sieve into a glass measuring cup; discard solids. Return stock to pot and heat over medium. Add fish cakes and simmer until just heated through, about 5 minutes.Step 3Meanwhile, mix gochujang, soy sauce, and gochugaru in a small bowl.Step 4Heat oil in a large skillet over medium-high until hot. Add rice cakes and cook, turning occasionally, until crisp, about 5 minutes. Add remaining 2 sliced onions and 6 sliced garlic cloves and cook, stirring, until softened, about 2 minutes. Add gochujang mixture and cook, stirring occasionally, until combined and fragrant, about 1 minute more.Step 5Add 2½ cups anchovy stock along with fish cakes to rice cake mixture and stir to combine. Bring to a boil, then reduce heat to low and simmer, stirring occasionally, until sauce is thickened and rice cakes are tender, about 5 minutes.Step 6Add bok choy and half of scallions and toss until well combined, adding more anchovy stock by the tablespoon to thin if needed. Cook, tossing occasionally, until bok choy is wilted, about 2 minutes.Step 7Transfer tteokbokki to a platter. Top with eggs, sesame seeds, and remaining scallions.How would you rate Tteokbokki (Spicy Korean Rice Cakes)?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis recipe is missing a key ingredient, some sort of sweetener! Oftentimes, sugar or rice syrup is used to sweeten the dish. Tteokbokki is sweet and spicy dish.AnonymousLos Angeles, CA11/20/2020This turned out unbelievably good! I used a larger bag of rice cakes (2.5 lb) and decided to throw em all in and yeah, it was pleeenty of spice with the 2/3 c gochujang. I wasn't feeling bok choy and instead chopped up a small head of savoy cabbage which went great. Tasty and I have plenty of leftovers!kmarxmarxchicago, il9/30/2020To say this is hellish spicy is an understatement. My eyes were streaming while I ate as quickly as possible so as not to prolong the agony. I recommend adding some Greek yogurt to the sauce if you find yourself in the same predicament, and have a bowl of ice cream at the ready. I would make it again, but would omit the chili flakes. The dashi stock is magical; it’s responsible for the success of the dish. Didn’t have the fish cakes so just added leftover ground beef and it was wonderful. Ground pork would probably be even better.CincyGalCincinnati6/7/2020This tasted as delightful as the picture, and was just as fun to make!! Spicy, sticky, and squishy. This recipe was really easy to follow and I was very pleased with the results. I added a little brown sugar to the sauce and did bok choy on the side instead. clairejSan Diego5/11/2020So spicy! Definitely coughed and started crying when I took the first bite, but got used to the spice by the end of it. This recipe is really easy, with a big flavor pay off. Most of the work is cutting things up, the rest is just the occasional stir. I didn't make a special trip to the store for this, I was using what I had, so I used a few oil packed anchovy filets in the broth instead of dried anchovies, omitted the gochugaru (which probably would have killed me anyway because I'm a spice lightweight), and left out the fish cakes (although they would have been really good). It all comes together very quickly, around 30-40 minutes total if you put together the broth first and simmer it for 25 minutes while you prep everything else and get started cooking the rice cakes and aromatics. abbyrnkn4422AL9/21/2019Explore Bon AppétitKoreanEast AsianAsianBok ChoyLeafy GreensVegetableKorean Rice CakeNoodlePasta & NoodlesQuickWeeknight MealsMainLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-25", "author": ["Condé Nast", "Catherine Yoo"]}