{"id": "cf1cc713288df4ead0dfdeb00edb8ee2", "url": "https://www.bonappetit.com/story/cecilia-chiang", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Cecilia Chiang Turns 90: The Woman Who Inspired Decades of Chinese-American Restaurateurs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 99-Year-Old Woman Who Inspired Decades of Chinese-American RestaurateursCecilia Chiang took a whirlwind trip to New York for her 99th birthday and we got to tag along for dinner.By Priya KrishnaOctober 3, 2018FacebookTwitterEmailPhoto by Heather StenFacebookTwitterEmailTwo days before her 99th birthday, Cecilia Chiang is holding court with a dozen or so friends and family members at a long blond wooden table. Everyone is gathered for dinner at the Greenwich Village outpost of the fast-casual bing and noodle joint, Junzi Kitchen. The space is minimalist and plant-filled, the lighting is a little harsh, and the table is outlined by young customers wearing Adidas sneakers and white baseball caps who keep strolling in to pick up take-out orders, unaware they’re in the presence of restaurant royalty.The setting feels appropriate for Chiang’s birthday party in a way. Without her, Junzi Kitchen—launched in 2015 by a couple of Yale students—likely would not exist. In fact, any of your favorite regional Chinese restaurants owe their presence at least partially to Chiang. Her San Francisco restaurant, The Mandarin, opened in 1961 amid a sea of stereotypical, chop suey–slinging spots and forever changed the makeup of Chinese restaurants in the U.S.At 99 (technically 98, since the party is happening just before her birthday), Chiang certainly does not look her age, or like someone who spent multiple decades in the rough-and-tumble of the restaurant industry. Dressed in a striped black shirt and tailored black pants, her short hair neatly combed back, and large lustrous pearls dangling from her neck and ears (plus two dazzling rings on her fingers), she is a vision of poise. She walks delicately but purposefully, talks slowly but eloquently, and has a jubilant, full-bellied laugh.If you’ve read anything on Cecilia Chiang, you’re probably familiar with her legendary origin story: how she escaped the Japanese invasion of China in 1942 and walked six months to a relative’s place in Chongqing, then fled China for Japan during the communist revolution, went to visit her widowed sister in San Francisco in 1960, tried to lend some money to two friends for a restaurant while there, and then was forced to take over the lease and move to the Bay Area permanently after the friends backed out and the landlord refused to return her money. She would reluctantly turn that tiny space into The Mandarin—a beautiful banquet-style restaurant serving the sophisticated Mandarin and Sichuan food (beggar’s chicken, smoked tea duck) from her upbringing with excellent service, a far cry from the homogeneous spots that suffused Chinatown. “I wanted high-end,” she says. “When I looked at Chinatown, I was really embarrassed. It was mostly chop suey and dragons and gold—so gaudy. And no tablecloths, no service, no carpets.” The Mandarin was an impeccably designed space, with bamboo, perfectly ironed white tablecloths, and elegant-looking artwork hanging from the walls.Photo by Heather StenThe restaurant industry was especially tough back in the ’60s for a woman, she says, especially a Chinese one. “People were very rude to me,” she says. “They gave me a hard time because I didn’t speak the language; because I was a woman, I had to pay cash every time.” People thought Chinese restaurants were “greasy and dirty,” she says, so distributors were hesitant to work with her. Even more isolating was the fact that because of her education and upbringing, she spoke a different dialect and didn’t dress like most other Chinese restaurateurs in the area, making it hard to find a community.But thanks to the ingenuity of The Mandarin and Chiang’s bubbly demeanor, community soon found her. The restaurant earned a fan base that included heavy hitters like James Beard (“So tall and…,” she puffs up her cheeks to indicate Beard’s largesse), Williams-Sonoma founder Chuck Williams, and Julia Child. One day a young chef named Alice Waters walked into the restaurant, adored the food, and convinced Chiang to launch cooking classes, where Waters, Child, and Jeremiah Tower all came to learn about Chinese cuisine early in their careers.That was Chiang’s first taste of mentorship, something that would become a central theme of her career, for both chefs like Waters and young Chinese-American restaurateurs who sought to follow in her footsteps.Photo by Heather StenOne of Chiang’s early mentees was her son, Philip, who, inspired by The Mandarin’s success, co-founded P.F. Chang’s, a destination for more casual, affordable Chinese cuisine in 1993. Later on she helped pastry chef Belinda Leong with her celebrated San Francisco bakery, B. Patisserie, and then eventually Ming Bai, Yong Zhao, and Wanting Zhang, who, with Junzi Kitchen, envisioned bringing unfussy, regional Chinese cuisine to the fast-casual realm.At the start of dinner, the 25-year-old Junzi Kitchen chef, Lucas Sin, nervously tells Chiang how he consulted his own mother about what to cook for her that night, and then a parade of dishes arrives: tomatoes glazed in pat chun vinegar with shiso and watercress; smashed cucumbers with sesame and red amaranth; chun bing, skinny pancakes served with sides of chili-spiked beef shank, braised pork hock, garlic chives, and soy-scrambled eggs and leeks; and a comforting noodle soup of tomatoes and scrambled eggs. It’s simple food, more Chinese home cooking than Chinese banquet, and Chiang absolutely loves it.She lifts up a few of the garlic chives with her chopsticks. “See?” she points. “Simple food, little oil, no MSG.” She opens up the basket of chun bing, and gingerly picks one up. “This one has texture, it is hand-rolled,” she says of the soft, bouncy crepe. “This is very good.”She discusses a few of the restaurants she has visited on her trip to New York: the Park Slope trattoria, Al Di La, which she enjoyed; the Jean-Georges restaurant, JoJo, where she found the decor very tasteful; and Eleven Madison Park where “the food is good,” she says of the hallowed restaurant, “but I think people exaggerate too much.” Apparently, as soon as she walked in, one of the chefs saw her and gestured to the entire staff to come meet her. “That was kind of exciting,” she admits.Chinese-American restaurateurs have it a lot easier now, she says. “They are well-educated,” so it is easier for them to navigate the industry; they understand the importance of investing in good design, quality ingredients, and smart team members. She shows off her hands, which are quite wrinkled and crooked from arthritis—badges of honor, she says, from all the cooking, scrubbing, and dishwashing she did by herself for years.What hasn’t changed, though, she adds, is the issue of harassment. She has been following the #MeToo movement’s impact on the industry, and asserts that when she was growing up in China, “this happened all the time in show business, but Chinese ladies didn’t say anything,” she says. “It is good that women are speaking out now.” She remembers being a younger woman trying to go to the bathroom and being grabbed by a man from behind. “They really are a bunch of monsters!” she says, recounting a few of the men who have been brought down by harassment allegations. She shakes her head in dismay.As she continues to taste the various dishes at her birthday dinner, her famously sharp palate is still as on point as ever. She can identify the exact herbs in the tomato salad, and the ingredients in the noodle broth. She inspects the julienned pieces of ginger for uniformity. She breezily sips her Chenin Blanc and leans across the table to toast with her friends. “People always say, ‘You probably don’t eat much,’” she says.  “But I tell them that I eat three meals a day regularly. Also, I drink! I have Champagne, and I enjoy it!”As the party begins to wind down and the last course comes out (a bowl of red fruits, to symbolize prosperity), Chiang, unprompted, tells everyone that she is a Buddhist and therefore she is frequently asked whether she believes in a second life (she does). So, someone asks: What would she want to be in her next existence?She pauses for a brief but weighty moment, as if to reflect on the 99-year scope of her life, and then laughs.She loves people, and she revels in hard work, so the answer seems obvious to her: “I think I would still like to be in the restaurant business.”Explore Bon AppétitChefsRestaurantsChineseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-03", "author": ["Condé Nast", "Priya Krishna"]}