{"id": "cf2342caf220692561ee1087749003a4", "url": "https://www.bonappetit.com/story/cbd-chocolate-breast-cancer", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "How CBD Chocolate Changed My Life After I Was Diagnosed with Breast Cancer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow CBD Chocolate Fueled My Fight Against Breast CancerBattling breast cancer has been the fight of my life. But I have a secret weapon.By Taria CamerinoOctober 1, 2018FacebookTwitterEmailIllustration by George WylesolFacebookTwitterEmailI have always had the unholy ability to work unrelenting hours. I could open and close restaurants, pull 30-hour shifts with a broken leg, turn chaotic kitchens into well-oiled machines. I could do it because I love food, and more than that, I love the people who make food their profession, who give so much of themselves to create and share meals with perfect strangers. I love the guests, the farmers, the spice merchants, even the critics. This kind of deep-seated dedication can sometimes make a person feel she has supernatural powers. Like she’s unstoppable even. Until one day she isn’t.My cooking career began at age 17. I worked in cafés, apprenticed under a French pastry chef in Florida, studied in France, ran the opening corporate pastry program for all of Ford Fry’s restaurants in Atlanta, helped design the menu for the Tate Modern’s restaurant in London. I became obsessed with chocolate and opened an underground confection shop called Sugar-Coated Radical, then closed it down after a robbery and shifted my focus to savory. By August 2017 I was working as culinary director for Atlanta’s Ladybird Grove & Mess Hall—developing menus, hiring staff, creating a training manual—when suddenly the executive chef left and I was asked to take the role. Okay, I said. I can do this. Then came more executive chef roles for the joint opening of two new concepts from the same owner: Muchacho and Golden Eagle. Okay, I said again. I’m strong. I can handle this too. I can handle anything.Taria Camerino at the farmers' market.\nPhoto by Allie Royce SobleI’d ignored the pain under my arm for months, pushed through, kept quiet. I had a kitchen to run, two more to open, sons to raise, no time. But then one night, alone, drained of energy after a long day of work, I checked. Just check, Taria. That’s when I realized, it’s not my arm. It’s my breast.When I discovered the lump, everything became transparent, even my own body. I knew something was wrong, but I didn’t know how to understand it. So, I went back to work. I opened the restaurants. I ignored the pain for another month. Until finally I couldn’t. “I don’t want to leave you,” I told my sous-chef as we pushed through dinner rush, 15 hours into my workday, “but if I don’t go home right now, I just might die.” It took another month to get an appointment with the doctor.Mammogram. Ultrasound. Diagnosis. Breast cancer, Stage 1.It’s a funny thing, being reminded of one’s own fragility. Especially in a restaurant kitchen, which is a hard place to be vulnerable. But I’ve always led with my vulnerability; that’s how I make food that’s poignant. And the good news was, we caught it early. So no surgery, no chemotherapy; just pills every day. “Whatever it takes, you gotta do this,” my staff told me.Memory loss. Vertigo. Nausea. Seizures. A ministroke.I was exhausted beyond comprehension. I had to leave my job. There was no position I could hold, and I’d lost my motivation to cook, even for my family. I couldn’t drive myself to the market or stand for longer than 30 minutes. Worst of all, I’d lost my sense of taste: produce picked that morning, fresh-baked bread—the taste had changed, weakened. What was the point of getting out of bed? I pulled inward, disappeared from everyone, unable to bear the thought of people seeing me so broken.I’ll never work in restaurants again—my body won’t allow it. But now when people say how sorry they are that I got sick, I just smile.Back when I was a 20-something pastry chef, working with chocolate every day was the norm. But it wasn’t until I went into chocolate-making full time that I discovered the power of sourcing. I remember the day it happened: A woman showed up at the door of my shop with a bag of cacao she’d grown on her ten-acre farm in Ecuador. “Could you use this?” she asked. It was raw and rough, not viable by American standards. But I opened the bag, just to smell it, to take a little taste.I got light-headed. This was like nothing I had ever experienced: hibiscus, goat’s milk, sunset, fresh rain. I tasted life. “It’s funny you say that,” she replied. “At the farm, we sit under the hibiscus flowers and watch the sunset every evening.”I spent the next 15 years traveling the world, working with any chocolate I could get my hands on. Cacao orchards in Vietnam, micro-farms in El Salvador. Sleeping on sidewalks and floors, spending all I had in the pursuit of more knowledge and more chocolate. In Japan I studied wagashi, traditional sweets made from plant-based ingredients and served with tea, with one of the world’s few female wagashi masters. I used cacao in my creations, despite my teacher’s insisting it was not traditional. Boiled adzuki beans sweetened with sugar, mochi, rice flour—those were the norm. Not cacao.Eventually I managed to change her mind with the care I took in sourcing, the spiritual nature of my approach. She asked me to teach her how to work with chocolate, and we spent hours each day touching, tasting, grinding. The aroma filled the kitchen, permeated our living quarters. We went to bed with the scent of cacao, and we woke to it.When I returned home in 2013, I was changed. More human, more whole. Developing a relationship to people by way of their cuisine is the most profound way to know them.Fast-forward to 2018, five months after the diagnosis. I’d opted to try an intensive dose of CBD, 1,000 milligrams a day, along with the pills the doctor prescribed. It was working, or starting to, enough that I could dabble in the kitchen again—baking simple things like cookies and brownies. Then one morning I woke up with a realization. I needed to make chocolate again. I needed to smell it, to taste it, to be in a room surrounded by it.Luckily I happen to have one of these rooms in my house. Eight feet by 12, piled with chocolate from all over the world. The room had sat unused for months as I lay in bed. But that morning I returned, started to explore again. What if I mixed the chocolate with the CBD? Worth a try. I was already making CBD tinctures and extractions, combining them with adaptogens like ashwagandha and valerian: herbs and roots with medicinal properties that Chinese and Ayurvedic healers have used for centuries. Why not combine them with chocolate?I started by grinding the cacao into a paste for ganache. Raw agave for sweetness. Cocoa butter for creaminess. The going was slow, just a few hours a day rather than my usual 16, but the process was the same: crack, grind, temper, mold. It took four tries to get it right, but when I did, a revelation: a bittersweet dance between cacao and agave, like a kiss from Ixcacao, the goddess herself. A spread-on-toast kind of medicine.It’s the process—it’s using my hands again—that’s bringing me back to life. I can see crystals forming and moving and shifting as I temper the chocolate, raising and lowering its temperature. These crystals become my body. I am healing. I am feeling like myself again, which tends to make me feel invincible. You know, like I can do anything. Even beat cancer.Today my cancer is in remission. And my little chocolate-meets-CBD experiment went pretty well. People were interested; they asked for samples—ganache and tinctures and mints—then came back offering money for more.Logo. Website. Packaging. Production.Five weeks later I had a company. When you’ve spent your life running restaurants, you know how to work systems. The night of the launch, I left exhausted but feeling like I’d found a reason to be alive, to stay alive. I named the company Alchimique because this process is a manipulation of the elements: of many things becoming another thing. A thing that never existed before. A thing that’s strong enough to heal even me.This illness has taken permanent shape in my body: weight gain, distortion, pain. I no longer move in the same way, speak in the same way. I’ll never work in large-scale restaurants again—my body won’t allow it. But now when people say how sorry they are that I got sick, I just smile. I tell them how, strange as it may seem, this sickness has brought me home, to my most precious place. I get to make chocolate every day, and it is magic.Explore Bon AppétitHealthyishCannabisChocolateAtlantaChefsessayRead MoreLifestyleWe Taste-Tested Five CBD Chocolates and It Was Extremely RelaxingGallery5 SlidesBy Maggie LangeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-01", "author": ["Condé Nast", "Taria Camerino"]}