{"id": "cf2f72a9b49c7005d3616d5cbab3705b", "url": "https://www.bonappetit.com/recipe/endive-cups-with-blue-cheese-celery-and-croutons", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Endive Cups with Blue Cheese, Celery, and Croutons Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesEndive Cups with Blue Cheese, Celery, and CroutonsBy Lauren SchaeferApril 19, 20184.5(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintEating your veggies is a lot easier when there's cheese and fried bread involved. If you're not a blue cheese person, any firm, flavorful cheese—think Parm or aged cheddar—would slay here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAPlatter$29 At AmazonMedium Skillet$60 At AmazonSpatula$12.99 At AmazonPaper Towels$13.45 At AmazonPlate$55 At Bon Appétit MarketMedium Bowl$17 At AmazonSpoon$24.69 At AmazonBox Grater$13 At AmazonIngredients4 servings2large endives2slices sourdough bread¼cup plus 2 Tbsp. extra-virgin olive oil, divided, plus more for drizzling½tsp. kosher salt, divided1celery stalkFreshly ground black pepper½lemon13-oz. piece hard blue cheese (such as Bayley Hazen Blue)PreparationStep 1Slice root ends off 2 endive. Separate larger leaves and arrange on a platter; save smaller inner leaves for a salad some other time.Step 2Remove crust from 2 slices bread, then tear bread into ¼\" pieces (you should have about 3 cups bread).Step 3Heat ¼ cup oil in a medium skillet over medium until shimmering. Add bread and reduce heat to medium-low. Fry bread, tossing occasionally with a spatula or slotted spoon, until golden brown, 3–5 minutes.Step 4Transfer croutons to a paper towel-lined plate; season immediately with salt and set aside to cool.Step 5Quarter 1 celery stalk lengthwise, then slice crosswise (you want a fine uniform dice here). Transfer celery to a medium bowl.Step 6Add croutons, remaining 1 Tbsp. oil, ¼ tsp. salt, and a few grinds of pepper to bowl. Squeeze lemon over and toss to combine.Step 7Spoon celery mixture into base of endive leaves.Step 8Using the medium holes of a box grater, grate 3 oz. blue cheese over endive.Step 9Top with an extra drizzle of oil and a few grinds of pepper.How would you rate Endive Cups with Blue Cheese, Celery, and Croutons?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI couldn't find endives at the store, so I used radicchio which was pretty successful. I also hate blue cheese so I substituted a sharp white cheddar and it was really good. Highly recommend!AnonymousColumbia, SC1/11/2020Explore Bon AppétitEndiveChicoryLeafy GreensVegetableBlue CheeseCheeseQuickEasyStarterNut-FreeVegetarianDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-19", "author": ["Condé Nast", "Lauren Schaefer"]}