{"id": "cf3f0198f1a69ff18979078d9120231b", "url": "https://www.bonappetit.com/recipe/larsens-lobster-rolls", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Larsen’s Lobster Rolls Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueLarsen’s Lobster RollsBy Betsy and Kristine LarsenApril 14, 20203.5(2)Read ReviewsTriangleEmailPinterestPrintPhotographs by Elizabeth Cecil, food styling by Danielle PattavinaEmailPinterestPrintEmailPinterestPrintIf you can find culls (lobsters that are missing a claw), buy them. It’s worth saving some money when you’ll be breaking down the lobsters and pulling out all the meat anyway. This recipe is from Larsen’s Fish Market, a tiny little seafood shack in the tiny little fishing village of Menemsha, Martha’s Vineyard.IngredientsMakes 651¼ lb. lobsters, preferably culls¼cup mayonnaise2celery stalks, finely chopped6hot dog bunsPreparationStep 1Pour water into a large pot to come 3” up the sides. Cover and bring to a boil. Add lobsters, reduce heat to medium, and re-cover pot. Steam lobsters 15 minutes. Using tongs, remove lobsters from pot and transfer to a large bowl. Pour in ice water to cover; let cool.Step 2Break off lobster tails. Pull off the flippers and use your thumb to push the tail meat up and out of the shell from the bottom (like a push-up pop). Crack claws with the back of a knife and remove meat. Chop tail and claw meat into ½” pieces and place in a medium bowl. Mix in mayonnaise and celery; season with salt and pepper. Divide lobster salad among buns.Step 3Do Ahead: Lobster salad can be made 2 days ahead. Cover and chill.How would you rate Larsen’s Lobster Rolls?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI have only tried one lobster roll besides this one, and let me tell you, it wasn't half as good as this little piece of heaven.AnonymousSpain5/15/2020Larsen’s is known for their hot butter drawn roll. They don’t serve chips on the side and the food is served on a crate not a laquered wood table. No need to blow up a local spot.Lindsay.rappaport4/23/2020Explore Bon AppétitSandwichNew EnglandAmericanLobsterShellfishSeafoodSummerMainDairy-FreeNut-FreeSteamLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Betsy", "Kristine Larsen"]}