{"id": "cf5806482d75387f8049e952e9f14e4f", "url": "https://www.bonappetit.com/story/a-fried-chicken-sandwich-you-can-actually-make", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "A Fried Chicken Sandwich Recipe You Can Actually Make at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBehold: A Fried Chicken Sandwich Recipe You Can Actually Make at HomeNo fuss. No muss. Just crispy, juicy chicken thighs on Sriracha mayo-slathered buns.By Julia KramerMay 22, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmail“What’s better than good?”This is my husband Zach’s favorite thing to ask me whenever I’m stressing out about having people over. It’s a rhetorical question, which he always answers the same way:“Good enough.”An example: Caramelizing onions for an hour, folding them into sour cream, and snipping some chives on top: That’s good. Microplaning a clove of garlic into a bowl of yogurt and adding a couple pinches of salt, for a dip that takes all of two minutes to assemble: That’s good enough.“Good enough” is far from an insult; it’s an accomplishment. It’s actually better than good because it gets you from point A to point B via a faster and easier route, and when all is said and done, you still got to point B. This philosophy is exactly how I would describe, in the best possible way, this most recent Basically recipe from senior food editor Claire Saffitz: The Basically Fried Chicken Sandwich.One important thing to know about Claire is that she does not usually do good enough—it's just now how she operates. She is actually the mind behind BA’s Best Fried Chicken Sandwich, which has about 500 steps that earn it that title. You brine the chicken, you put celery seeds in the mayo, and you do a triple-dredge, dipping the chicken thighs in a seasoned flour/cornstarch mixture, then in seasoned buttermilk, then back in the flour. The recipe has 28 ingredients, and that’s assuming you don’t pickle your own cucumbers. It is, without a doubt, the finest fried chicken sandwich you could ever make at home. (But in all likelihood, well, won't.)But sometimes, you don’t need to make the ultimate fried chicken sandwich. You want to get from point A (fried-chicken sandwich desire) to point B (fried-chicken sandwich consumption) via the fastest possible route, preferably the one that doesn’t involve using and then washing every bowl (and bowl-like object) in your kitchen. There's the best fried chicken sandwich you could ever possibly make—and then there's the best fried chicken sandwich that you will actually make. And that's what really matters.What is it about a squishy seeded bun that pulls it all together?\nThis is how you get there. Boneless, skinless chicken thighs hang out in a Ziplock with some rice vinegar and soy sauce while you bring a big pot of oil up to 350°F. (All right, herein lies the rub: A fried-chicken sandwich cannot be made without frying.) Instead of a triple-dredge, this recipe take a cue from karaage—Japanese fried chicken—and the marinated thighs simply get tossed in regular old cornstarch. The essential move here is making sure you’ve shaken off as much of the marinade from the chicken as you can before it goes in to the bowl with the cornstarch, so that it forms a dry, white outer coating. If you drip in some of that rice vin and soy sauce, you run the risk of ending up with a sludgy coating, which won’t crisp up in the oil. (It happens of the best of us, and by that I mean, this is exactly what I did the first time around.)Now here’s the thing, my fellow students of achievement-culture: This chicken is not intended to be the crunchiest, most shatteringly crisp thing you’ve ever eaten. But when juicy, seasoned, coated-and-crisped chicken is what you want on a Thursday night, it's more than good enough. There is really only one key (besides not messing up the cornstarch dredge, as Yours Truly did) to making that happen: The oil you fry in has to be actually 350°F. Like, you actually do need a deep-fry thermometer or an instant read thermometer. And you actually need to wait, like, probably 15 minutes for it to get to that temperature. And you actually need to watch the thermometer once you drop all the little chicken thighs in there, because it will actually drop considerably, and you’ll need to raise the flame to get it back to that sweet spot.And actually, I don’t know why I was allowed to write this post, because I didn’t do any of those things, including own a deep-fry thermometer, and this is perhaps the reason why, even on a second attempt, my chicken wasn’t quite as crispy as I wanted. But when I put it on a toasted sesame-seed bun spread with Sriracha mayo, neatly piled on some cabbage slaw, and tucked that breaded chicken thigh on there, the resulting sandwich stimulated the same pleasure-inducing synapses as it would have had I gone through all those brining and three-bowl dredging and pickling shenangians. It was, as Zach would say, better than good.Get the recipe:The Basically Fried Chicken SandwichEverything you want in a crispy chicken sandwich, with none of the fuss.View RecipeExplore Bon AppétitBasicallyFried ChickenChickenSandwichRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Julia Kramer"]}