{"id": "cf683f3dc8dfb46423abf3e42c353fe5", "url": "https://www.bonappetit.com/recipe/mama-rosas-lasagna-de-carne", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Mamá Rosa’s Lasagna de Carne Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueMamá Rosa’s Lasagna de CarneBy Elizabeth AcevedoNovember 23, 20213.9(22)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman. Food styling by Pearl Jones.EmailPinterestPrintEmailPinterestPrintCooking the annual New Year’s Eve lasagna de carne “was always Mami’s territory—until the year I had no choice but to take over,” writes author Elizabeth Acevedo in this essay. In a time of uncertainty in her family, she learned to make the lasagna to “grasp onto a bit of comfort and routine.” This Dominican lasagna packs a wallop of flavor from herby sofrito, which cooks with the ground beef until toasty and caramelized. Stick to regular dried lasagna noodles; they offer a toothsome texture that no-boil noodles can’t match.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At Amazon13x9\" Baking Dish$20 At AmazonOven Thermometer$7 At AmazonLadle$27 At AmazonParchment Paper$3 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients8 - 10 ServingsMeat Sauce½red bell pepper, coarsely chopped1small onion, coarsely chopped1plum tomato, coarsely chopped4sprigs cilantro2sprigs parsley5large black olives, pitted5garlic cloves2tsp. Italian seasoning1tsp. drained capers, rinsed½tsp. ground cumin¼tsp. freshly ground black pepper1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, plus more1Tbsp. extra-virgin olive oil2lb. ground beef chuck (10% fat)1Tbsp. tomato paste2bay leaves124-oz. jar marinara sauceAssemblyKosher salt3garlic cloves, smashed½tsp. Italian seasoning8oz. dried lasagna noodlesExtra-virgin olive oil (for greasing)1lb. ricottaFreshly ground black pepper12oz. low-moisture mozzarella, coarsely grated (about 3 cups)PreparationMeat SauceStep 1Purée bell pepper, onion, tomato, cilantro, parsley, olives, garlic, Italian seasoning, capers, cumin, black pepper, and 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt in a blender until sofrito is mostly smooth.Step 2Heat oil in a large pot over medium-high. Cook beef, tomato paste, bay leaves, and sofrito, breaking up meat and stirring often, until liquid is evaporated and meat is starting to brown, 20–25 minutes. Remove from heat and stir in marinara sauce. Season sauce with salt if needed.Do Ahead: Sauce can be made 3 days ahead. Let cool; cover and chill.AssemblyStep 3Place a rack in upper third of oven; preheat to 350°. Bring a large pot of salted water to a boil; add garlic and Italian seasoning. Cook noodles, stirring often, until very al dente, about 4 minutes (noodles will finish cooking in oven). Drain noodles and stack flat in layers, separated by parchment; discard garlic.Step 4Lightly oil a 13x9\" baking dish. Spread a heaping cupful of sauce in dish. Lay a single layer of noodles over sauce. Spread 1 cup sauce over noodles. Season ricotta with salt and pepper; evenly spread half of ricotta over sauce. Scatter one third of mozzarella over top. Repeat layering process. Finish with remaining sauce, followed by remaining mozzarella. Cover with a lightly oiled piece of foil; set on a rimmed baking sheet (to catch drips).Step 5Bake lasagna until bubbling around the edges, 40–45 minutes. Increase oven temperature to 425°. Uncover lasagna and continue to bake until top is golden brown, 15–18 minutes more. Let sit 15 minutes before serving.Do Ahead: Lasagna can be baked 3 days ahead. Let cool; cover and chill. Reheat in a 250° oven.How would you rate Mamá Rosa’s Lasagna de Carne?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleMy husband and I liked the lasagna. I followed the recipe exactly except for adding a few more noodles. I liked the meat to cheese ratio; many standard lasagna recipes are too cheesy for my liking. My teenagers were surprised by the smell (one kid thought we were having a Mexican dish based on aroma coming out of the kitchen) and they immediately tasted the cilantro. Jenn LNYC1/17/2022Fabulous recipe.  All the proportions were right and the taste was wonderful.I added a 5 oz bag of shredded parmesan.  I'm sending two portions over to my dear friends to celebrate New Years day.\n Marion Laguna Beach1/1/2022The meat sauce is really good. I feel there just isn't enough for the recipe. The same with the mozzarella, too little for the layers. \n\nIf I make again I will adjust to have more sauce. \n\nThank you for the recipe. \nJoshMinneapolis, MN12/26/2021Overall super yummy recipe! Easy to follow and a new twist on classic Italian flavors. It took my husband two days to figure out there was cilantro in it. I added a layer of cooked spinach to the recipe, super nostalgic ingredient for me. Will be making again. Bree HansonLos Gatos, CA12/9/2021This recipe is terrific and will become the NYE special. My son was diagnosed as paranoid schizophrenic 30 years ago and chose to take his life in 2000. It was, and continues to be traumatic for our family, however, I believe this lasagna will be a small savior added to our memory bank. \n\nThank you, Elizabeth. Anonymous12/5/2021Very tasty, will certainly make again.  Wish BA would tell us about the pans they use in the pix !!   That pan is cool looking.DrewRichmond, VA12/2/2021So delicious. It was gone within the half hour. Make sure you really cook the chuck until the liquid has evaporated and it’s crumbly and crispy. Enjoy!NatMiami12/2/2021what makes this especially good is the heartfelt Dominican family reference.   AnonymousSanta Barbara11/30/2021Explore Bon AppétitLasagnaPasta & NoodlesDinnerGround BeefBeefMeatRicottaCheeseMozzarellaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Elizabeth Acevedo"]}