{"id": "cf7aa221cd2c96c5e052f523e866b76c", "url": "https://www.bonappetit.com/recipe/whole-roasted-cauliflower-with-curry-tahini-sauce", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Whole Roasted Cauliflower with Curry Tahini Sauce Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDWhole Roasted Cauliflower with Curry Tahini SauceSponsored by The Spice HunterFacebookPinterestTwitterEmailMake 1 head cauliflowerCauliflower on its own can incite an explosion of opinions, with preferences ranging from roasted to raw or spun into a soup. But this simple and easy prep––first steamed, then roasted beneath a blanket of curry butter and served with a side of tahini sauce––will have you adding this recipe to your side-dish favorites. The kicker comes from flavor-rich Curry Seasoning: a blend of more than a dozen spices including cumin, turmeric, coriander and chile pepper.PrintIngredientsCurry Cauliflower1 head cauliflower (2 lbs)4 tablespoons unsalted butter, melted1 tablespoon The Spice Hunter® Curry SeasoningKosher saltFlaky sea saltTahini Sauce1/2 cup tahini1/3 cup cold water1/2 cup lime juice1 small garlic clove, minced1 teaspoon The Spice Hunter® Curry SeasoningRecipe PreparationPreheat oven to 425 degrees.Set a steamer basket over 1-inch of boiling water in a large pot. Add cauliflower, cover, and reduce heat to a simmer. Steam cauliflower until just tender when pierced with a knife, about 20 minutes.Melt 4 tablespoons of butter. Whisk 1 tablespoon of curry seasoning into the melted butter.Using 2 slotted spoons or a mesh spider, lift cauliflower from steamer basket, leaving water in basket, and transfer cauliflower to a 9-inch pie dish. Season with salt and brush the curry butter all over. Roast, rotating the dish halfway through, until golden, about 40 minutes.Meanwhile, using a food processor or whisk, blend the tahini with the cold water, lime juice, garlic and curry powder until combined and lightly whipped. Season with salt and pepper.Season cauliflower with flaky sea salt and serve with tahini sauce.Sponsored by The Spice HunterGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredThe Spice HunterMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["The Spice Hunter"]}