{"id": "cf7f40bfd2cec89cddeb46ba6689f294", "url": "https://www.bonappetit.com/recipe/smoky-carrot-dip", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Carrot Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueSmoky Carrot DipBy Ochre Bakery, Detroit, MISeptember 17, 20194.7(63)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintWe had to have this dip recipe from Ochre Bakery in Detroit, No. 4 on our 2019 Hot Ten list. Sweet and smoky roasted carrots are blended with chickpeas, almonds, lemon juice, garlic, and herbs. It’s the perfect companion to seeded crackers or good bread. Make sure the carrots are tender to their core before you pull them from the oven for the smoothest possible texture.IngredientsMakes about 3 cups½cup skin-on almonds2lb. carrots, trimmed, peeled2Tbsp. plus ½ cup extra-virgin olive oil; plus more2½tsp. kosher salt, divided, plus more2garlic cloves½cup canned chickpeas3Tbsp. (or more) fresh lemon juice1tsp. freshly ground black pepper¾tsp. hot smoked Spanish paprika½cup coarsely chopped parsley, plus leaves for servingPreparationStep 1Preheat oven to 350°. Toast almonds on a rimmed baking sheet, tossing halfway through, until slightly darkened and fragrant, 8–10 minutes. Let cool; set aside.Step 2Cut any thick carrots in half lengthwise, then slice all carrots crosswise into 4 pieces. Toss on a parchment-lined baking sheet with 2 Tbsp. oil and 1 tsp. salt. Spread carrots out evenly on baking sheet and roast, stirring once or twice, until very tender and starting to shrivel and brown (but not char), about 1 hour.Step 3Transfer carrots to a food processor; add garlic, chickpeas, lemon juice, pepper, paprika, chopped parsley, ½ cup oil, 1½ tsp. salt, and reserved almonds. Process, adding more oil as needed, until mixture is almost completely smooth. Taste dip and add more lemon juice and/or salt if needed.Step 4Transfer dip to a small bowl, drizzle with more oil, and top with parsley leaves.Step 5Do Ahead: Dip can be made 1 week ahead. Cover and chill.How would you rate Smoky Carrot Dip?Leave a ReviewTell us what you thinkReviews (25)Back to TopTriangleExcellent recipe! Will make again, for sure!AnonymousMichigan2/11/2022Wonderful recipe!! I made this for parties, my friends took home whatever was left over!LE RubinLos Angeles11/17/2021Delish! Used Tahini instead of the almonds so used less evoo. I added lemon zest & more lemon juice than called for as it needed a bit more acid to balance...1.5 cloves garlic (still a bit too much raw garlic taste for me)...I should’ve added some cold water to smooth out & loosen a but more but all & all really really good. The smoked paprika is a must as it really compliments the sweetness of the carrots. I added some crushed red pepper for a bit of spice since my smoked par prima was not hot. \nServed with mini cukes wedges & Mary gone crackers super seeds. Tu2Hammond, IN5/30/2021Delicious!! Used an extra clove of garlic, raw cashews and almonds (because I ran out of almonds), a healthy handful of parsley, a bit of extra paprika. Next time I would add some water to thin versus the extra olive oil. It was smooth and delicious - a huge hit!CatherineLake Orion, Michigan5/28/2021Oh my gosh this was amazing!!! Thank you. I added more water and used a blender, dip was a little chunky. I added an extra clove of garlic but followed recipe as stated. We had it with toasted nan and soup. Would be delicious with an assortment of veggies- a crowd pleaser for sure... can't wait to serve it to friends or family.JennyNew Castle, DE2/2/2021I am surprised by all of the good reviews here. This one came out alright but was not easy to make. It was incredibly dry and I had to add significantly more oil than a 1/2 cup. The sweetness of the carrots did not blend well with the smoked paprika. A few people I served this to were pleased but I would only make again with modifications. Anonymous12/27/2020Has anyone use a blender for this opposed to food processor?AnonymousChicago, IL12/24/2020With a few tweaks it was WONDERFUL.  I had to add another full can of chickpeas, more garlic, more lemon juice and more olive oil as the recipe was far too salty for me and my family.  Next time, I will cut the salt in half...but I'll still add more garlic, it's so good :)  Tiffany FMalibu, CA12/22/2020Made this dip to bring to friends with \"seedy oat crackers\" and it was a big hit.  Came out very smooth in the vitamix.AnonymousVancouver BC10/14/2020Delicious! Perfect to use up the carrots I got in my CSA. I used celery greens (also CSA) in place of the parsley with success. Great alternative to hummus.sarahbear518Seattle, WA7/31/2020Someone asked about subbing for almonds - I only had pine nuts so used these instead. I think it actually came out better than when I made with the almonds (texture was less coarse this go round). I also almost tripled the garlic and upped the paprika 25%. SO GOOD CAN'T STOP EATING IT. Favorite way to eat it so far is spread on toasted sourdough and topped with a fried egg and everything bagel seasoning. AnonymousHouston, TX4/20/2020Holy crap this is good! \n\nI needed to use up carrots that were languishing in my crisper. I didn’t have parsley so I used cilantro, didn’t have whole almonds so I toasted some ground ones although I imagine pistachios would be fine. Now I need to decide what I am having it with. AnonymousCanada4/19/2020Question:  Has anyone tried to substitute another nut for almonds or altered in any way?\nAnonymousColumbus Ohio4/13/2020Because I bought 2 five pound bag of carrots, I decided to try this. It's a WINNER!!! I love it warm and could eat it right out of the food processor. So good! I made 2 other dips and this one was the winner. \nwinelover813Los Angeles4/9/2020This dip is amazing and wonderfully versatile. I'm (thankfully) on day 3 of leftovers and just had a little lunch burrito with this dip, some other raw veggies and chalula hot sauce. so good - will definitely be making this again. AnonymousNew Orleans3/30/2020Explore Bon AppétitDipCarrotVegetableAlmondNutChickpeaBeanSnackStarterVeganVegetarianDairy-FreeGluten-FreeHealthyishRosh HashanahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Ochre Bakery", "Detroit"]}