{"id": "cfa6ec9a9a152cee04ef40dc0cebe9c7", "url": "https://www.bonappetit.com/recipe/seafood-boil", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "The Shouldn’t-Be-This-Easy Seafood Boil Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueThe Shouldn’t-Be-This-Easy Seafood BoilBy Lauren SchaeferMay 25, 20213.8(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintWhile I love a come-one, come-all, once-a-year extravaganza featuring a comically oversized pot and bushels of sea creatures, an intimate, Dutch-oven scaled affair is a lot more manageable—and can happen a lot more often. You can pull off this seafood boil on a weeknight, packed with any quick-cooking veg you’ve got—think snow peas, broccolini, carrots, and favas. Serve with white rice for sopping up that delicious jus. —Lauren Schaefer, Kitty’s Market, Hudson, NYThis recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonSlotted Spoon$13 $10 At AmazonMicroplane Grater$16 At AmazonIngredients4 - 6 Servings2Tbsp. vegetable oil13\" piece of ginger, peeled, finely grated2garlic cloves, finely grated¼cup yellow miso2Tbsp. unseasoned rice vinegar2Tbsp. mirin3Tbsp. soy sauce½tsp. kosher salt4Tbsp. unsalted butter2tsp. shichimi togarashi or Old Bay seasoning, plus more for serving3baby sweet potatoes, sliced ¾\" thick1lb. mussels2ears of corn, quartered crosswise4scallions, dark green and white and pale green parts separated, finely chopped8oz. green beans, trimmed1lb. shell-on extra-large shrimpLime wedges (for serving)PreparationStep 1Heat oil in a heavy pot over medium. Cook ginger and garlic, stirring often, until slightly golden, about 1 minute. Quickly whisk in miso, then gradually add vinegar, mirin, soy sauce, salt, and 3 cups water, whisking until no lumps remain and increasing heat if needed to maintain a simmer. Whisk in butter and 2 tsp. shichimi togarashi. As soon as butter is melted, reduce heat as needed to maintain a simmer. Add sweet potatoes, cover pot, and cook, until potatoes are just tender, 8–10 minutes. Using a slotted spoon, transfer sweet potatoes to a large platter or rimmed baking sheet.Step 2Add mussels to pot, cover, and cook until opened, 1–2 minutes. Using slotted spoon, transfer to platter with sweet potatoes, discarding any mussels that don’t open.Step 3Add corn, white and pale green scallion parts, green beans, and shrimp to pot, cover, and cook until shrimp are bright pink and corn and green beans are tender, about 4 minutes. Using slotted spoon, transfer to platter and top with dark scallion greens. Serve boil with lime wedges.How would you rate The Shouldn’t-Be-This-Easy Seafood Boil?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleEasy, delicious and easily fed 6 people. We added halibut and substituted snow peas for the green beans. We are camping so just served it all in the pot as a soup with a baguette. \n\nDebbie ReynoldsChico8/25/2021its good.Anonymouslondon england 7/16/2021Explore Bon AppétitCornVegetableCarrotFava BeanBeanSweet PotatoPotatoMusselShellfishSeafoodShrimpGreen BeanSummerQuickEasyOne-Pot MealsWeeknight MealsMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Lauren Schaefer"]}