{"id": "cfa7f11d16db6847345aaca754d80b5c", "url": "https://www.bonappetit.com/story/beef-noodle-soup-shyboyz-club", "year": 2020.0, "month": 9.0, "day": 5.0, "content": "Every Beef Noodle Soup Tells a Story. And Shy*Boyz Club Has Some Stories. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsEvery Soup Tells a Story. And Shy*Boyz Club Has Some Stories.Chefs Eric Sze and Lucas Sin both make Chinese beef noodle soup—but they are nothing alike.By Meryl Rothstein and Jesse SparksSeptember 30, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis article is part of our series on how restaurants changed in 2020, and why we've never loved them more. Click to see all the stories.At their NYC restaurants and joint pop-up, Shy*Boyz Club, chefs (and friends) Eric Sze of 886 and Lucas Sin of Junzi Kitchen cook as a way to explore Chinese food’s past, present, and future and to celebrate the cuisine’s diversity. “China has thousands of years of history, 50-something ethnic minorities, and one of the largest diasporas in the world,” Sin says. “‘Chinese food’ could mean anything.” Case in point: beef noodle soup, which varies in most every detail depending on who makes it.Photo by Emma Fishman, Illustration by Naomi OtsuThe Clear Choice“Clear brisket broth is near and dear to my heart; I ate it at least once a week as a kid in Hong Kong. I’m a huge proponent of how subtle and elegant it is. My approach is in line with the style from Chaozhou, a city north of Hong Kong.”Rice Noodles Get It Done“I use rice noodles—they aren’t extruded or pulled; they’re cut, which means that the surface is very slippery. The Chinese word for it is hua, which is often translated as ‘slippery’ or ‘silky.’ They’re really, really good for slurping, especially when you’re slurping at high speeds.”Dig That Daikon“In Hong Kong daikon is the traditional vegetable. It’s braised, and the sweetness of the daikon lends itself to the sweetness of the broth. It doesn’t need sugar or soy sauce or anything to let it shine.”Short Rib, Big Deal“In the U.S., we often think of brisket as one cut, but in Hong Kong, there are at least three, the best of which is called hang lam, which is basically boneless English short rib. It becomes fall-apart tender.”Photo by Emma Fishman, Illustration by Naomi OtsuRich Broth Is Boss“I boil beef femur and shinbones, oxtail, and beef neck and add chicken bones for extra flavor, then add apple, celery, and an absurd amount of tomatoes. I toast spices like cinnamon and angelica root, and caramelize doubanjiang. Plus soy sauce for savory notes. If I had to trash-talk, I’d say Lucas’s Cantonese broth is very vanilla as opposed to flavorfully rich.”Wheat Wins“I use wheat noodles because of the large number of Shandonese and Shanghainese immigrants who migrated to Taiwan after the Chinese civil war. That was their preference, and modern Taiwanese cooks obviously inherited their preference. Some things you just don’t mess with.”Greens With a Kick“I stir-fry preserved mustard greens, a traditional Hakka condiment, in garlic, chile, and sugar. It’s a brief but necessary break before you dive back in for more soup.”Give Shanks“At my first restaurant I used short ribs—it was a real show-offy dish. But as I got more homesick, I wanted to go more traditional. In Taiwan farmers would plow the fields while beef shanks simmered in broth at home. When they came back it was tender.”Explore Bon AppétitSoupBeefRestaurantsChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-30", "author": ["Condé Nast", "Meryl Rothstein", "Jesse Sparks"]}