{"id": "cfac832aa90ac3463bd06779a5107618", "url": "https://www.bonappetit.com/recipe/tomato-toast-with-chives-and-sesame-seeds", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Tomato Toasts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueTomato Toast with Chives and Sesame SeedsBy Andy BaraghaniJuly 10, 20184.8(37)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintFor this tomato toast recipe, be sure to sprinkle the chives, sesame seeds, and flaky salt with abandon.Ingredients4 servings 1garlic clove, finely grated½cup mayonnaiseKosher salt½lemon4¾\"-thick slices country-style bread, toasted3medium tomatoes, thinly sliced2Tbsp. finely chopped chives2tsp. toasted sesame seedsFlaky sea saltFreshly ground black pepperAleppo-style pepper (for serving; optional)Extra-virgin olive oil (for drizzling)PreparationStep 1Mix garlic and mayonnaise in a small bowl. Squeeze about 1 tsp. juice from lemon half into bowl; season with kosher salt. Hang on to lemon.Step 2Spread a generous layer of seasoned mayonnaise over toast; shingle a few tomato slices on top. Sprinkle with chives, sesame seeds, sea salt, black pepper, and Aleppo-style pepper. Finely grate some lemon zest from reserved lemon over and drizzle with some oil.How would you rate Tomato Toast with Chives and Sesame Seeds?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleAbsolutely delicious!  I followed the recipe exactly as stated (always do this the first time) and was very pleased.  I’ve also made it with grilled sourdough bread - a nice, tasty bonus.  And I’ve made some bite-sized appetizers, using a cookie cutter to cut small rounds of bread, which I toasted, and then used smaller-diameter tomatoes to fit the tops of the rounds.  My guests raved about them - and they were easy to eat.  Double bonus: Any leftover mayo spread works great on sandwiches too!  DougPalm Springs and Vancouver7/9/2021It was great on sourdough with avocado instead of mayo. Thx for the simple and yummy recipe.Nana BobanaAustin, TX6/29/2021You should try it with oversized English muffins.\nTomnorthern VA5/30/2021So good. Had a lot of these ingredients and needed to use them up. Made some adjustments, I just used EBTB in place of salt and sesame seeds. Didn't have chives, but had some leftover cilantro. Yum! Will definitely be making again. AnonymousSaint Louis, MO4/9/2021I rarely review recipes but I had to leave one here because this was simply phenomenal! I added some mashed avocado on top of the mayonnaise as well. Definitely going to be making this a lot!Anonymous9/6/2020This is divine! It's hot and I didn't feel like cooking.  Just wanted something light and tasty and this fit the bill to a T!  It's so flavorful, fresh and delicious.  And it's adaptable.  We didn't have chives so I used shallots, and we didn't have aleppo pepper so I used a tiny bit if cayenne mixed into paprika.  I could eat this daily it's so delicious!!  Addictive.  jenrmanleyLos Angeles8/3/2020Best tomato toast out there - we’ve been making this for the past few summers about 2x a week and we never get sick of it. Highly recommend! AnonymousBoston, MA7/30/2020Favorite Tomato Toast of Life. Period.anitaneetsMontreal8/25/2019I LOVE this recipe.  Have been making it for two summers now and everyone falls in love with it.  It's a great light lunch, or an appetizer.  Can't get enough!!!  I prefer sourdough bread, but really any decent bread will do.Betsy EricksonVienna, VA8/23/2019This is THE greatest tomato toast there is.AnonymousAtlanta, GA8/12/2019I have eaten this every day since my new girl tomatoes started ripening. Pro tip: sub the salt and sesame seeds for Everything But the Bagel seasoning and maybe you will lose your mind over this combination like I have. sjsouthworthPoint Richmond, CA8/7/2019As far as I'm concerned this is The Only Tomato Toast. Yes it's got a bunch of different ingredients and YES they are worth it to include, but if you don't have them then the star players here are that mayo, lemon zest, aleppo pepper and SALT. I have waited all spring and early summer to be able to make these again. I have put it on my instagram stories so much my friends associate me with this toast now. Try it on rosemary bread or with a touch of honey as another reviewer suggested!AnonymousHouston, TX8/5/2019I. Love. This. Dish. So. Much. As someone who did not have much of an appreciation for tomatoes before this, I certainly do now. I tried it several weeks ago for the first time, and went back to it today. This is an easy go-to on a Saturday morning for something warm and acidic and rich and satisfying. AnonymousSalem, Oregon11/3/2018This.  Just this. I grew up in the Lowcountry of GA and SC where tomato and mayo sandwiches reign in the summer.  I've always kept it low-key and simple (i.e., if it takes more than 5 min, you're not doing it right).  This definitely takes longer, but was #worthit, and if you do it right, you can shorten the process for re-runs of this sandwich later...because you are probably going to want it.  I doubled the batch of the lemon-garlic-mayo to keep on hand in the fridge (BLT, anyone?), which was really the more time-consuming part.  Pulling the rest of the ingredients together in the time it takes the bread to toast was totally do-able.  I didn't have Aleppo-style pepper, so subbed in another one, and skipped the olive oil b/c I didn't think it needed it (it didn't, IMO).  Also used sourdough.  Pretty epic.  And definitely my weeknight go-to til summer is over---which here, isn't until Thanksgiving, lol.AnonymousHouston8/19/2018Okay, I have to caveat this by saying that I've never been the biggest fan of mayo, but that I *am* the biggest fan of Andy. So that's why I tried this recipe, which I totally *hated.* Like, threw it away because I just couldn't eat it. That said, if you like mayo, give it a try. But if you don't, this won't convert you. AnonymousNew York8/12/2018Explore Bon AppétitToastPlum TomatoTomatoVegetableSummerQuickEasy5 Ingredients or FewerSnackStarterDairy-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Andy Baraghani"]}