{"id": "cfb3ed1d266e9c988d55f81d81bc9391", "url": "https://www.bonappetit.com/recipe/banana-cream-pie-3", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Banana Cream Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueBanana Cream PieBy Chris MoroccoOctober 15, 20194.4(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintA showstopping peanut-studded banana cream pie with sky-high whipped cream. Roasted peanuts pull double duty in the graham cracker crust and sprinkled over the topping, keeping the bananas from making this pie excessively sweet.Ingredients8 servingsCrust9whole graham crackers¼cup salted dry-roasted peanuts½tsp. kosher salt6Tbsp. unsalted butter, meltedFilling and Assembly½cup granulated sugar¼cup cornstarch2large eggs3large egg yolks3cups whole milk2tsp. vanilla extract½tsp. kosher salt, plus more2Tbsp. chilled unsalted butter4large ripe but firm bananas, sliced ¼\" thick2cups heavy cream¼cup powdered sugar¼cup chopped salted dry-roasted peanutsPreparationCrustStep 1Place a rack in middle of oven; preheat oven to 350°. Using your hands, crush graham crackers into a food processor; pulse until finely ground. Add peanuts and salt and pulse a few times until incorporated but with some flecks of peanut remaining. Pour in butter and pulse just until mixture holds together when squeezed in your palm.Step 2Press mixture firmly and evenly into the bottom and up the sides of a standard 9\" pie dish using the bottom of a flat measuring cup or glass. Bake until golden brown,12–15 minutes. The crust will most likely have slumped down toward the bottom of the dish; remove from oven and press crust back up the sides while still hot. Return to oven and bake until browned, about 5 minutes longer. Let cool.Step 3Do Ahead: Crust can be made 3 days ahead. Store tightly wrapped at room temperature.Filling and AssemblyStep 4Whisk granulated sugar and cornstarch in a large saucepan to combine. Add eggs and egg yolks and whisk vigorously, making sure to get into corners of pan, until smooth and pale. Whisk in milk, vanilla, and ½ tsp. salt.Step 5Place saucepan over medium heat and bring to a simmer, whisking often and making sure to get into corners of pan, 8–10 minutes (mixture should be bubbling and thickened). Reduce heat and continue to simmer, whisking constantly, 3 minutes. Let pudding cool 5 minutes, whisking every minute.Step 6Add butter to pudding and whisk until melted and fully incorporated. Add bananas and stir once to incorporate. Scrape filling into cooled crust; smooth surface. Chill until cold and set, at least 2 hours and up to 1 day.Step 7Using an electric mixer, beat cream, powdered sugar, and a pinch of salt in a large bowl until soft peaks form. Spoon whipped cream over filling, swirling as desired. Top with peanuts.Photo by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiHow would you rate Banana Cream Pie?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleCan someone clarify what a “whole” graham cracker means? Does it mean a square of cracker, like one would use for a s’more, or a rectangle which is two squares? I ask because they are packaged both ways, depending on the box of crackers purchased. And obviously, the difference between 9 squares or 9 rectangles would be significant. \n\nI love this filling recipe but have ended up using a crust recipe from another source because of this uncertainty. \n\nJust a suggestion for BA, an additional measurement, either in cups or grams, would be extremely helpful to include as part of the recipe. Thank you!GHSan Jose, CA3/2/2022My boyfriend made this for me for my birthday and it was absolutely flawless. He is by no means a baker and said the recipe is foolproof. It’s my new favorite thing. Cannot recommend it strongly enough. There were no issues with the filling fitting in our standard glass pie plate.MarvPortland, ME4/28/2021More often than not I find banana cream pie is overly sweet and mushy- this pie is just the opposite. I love the salty notes and crunch from the peanuts, and the custard is just sweet enough. I have made this multiple times and it always comes out perfectly. I make it gluten free by using gluten free graham crackers and the recipe works just as well. Jessie Minneapolis, MN2/28/2021This was a nice pie. Not too sweet and a nice balance of salt. I had no issues with the quantity or texture of the custard as some reviewers had. I will definitely make this again. Jim in Pittsburgh Pittsburgh, PA2/22/2021Hi, could I make this in a tart pan instead?? Anonymous12/29/2020Such a wonderful recipe-- I made it exactly as said above. You most likely will need a slightly deeper pie pan, which I had on hand. As for issues with a runny/scrambled egg mixture, it may have been on higher than medium or wasn't whisked fast enough. I found that it thickened immensely around the 6 minute mark of the 8-10 min specified in the recipe. It cooled and thickened to a lovely pudding texture at which I whipped in my butter and bananas. \n\nAmazing job, Chris! I will be sharing this at the Thanksgiving dinner table this year with some additions of fresh strawberry on top. :)AnonymousSan Diego, CA11/25/2020pretty good! definitely use a larger than average pie pan though. the filling to crust ratio was offAnonymous9/4/2020I added a quarter cup of sugar to the crust because I like it a little sweeter. Also, instead of mixing the bananas and the custard together, I recommend putting a layer of custard, then a layer of bananas, then the rest of the custard, then another layer of bananas. This makes it more similar to a classic pie that you would find in a diner/burger joint. Everyone went crazy over this pie. Great recipe. Anonymouslos angeles 5/31/2020I ignored the instruction that the bananas should be firm, and used my soft banana-bread-ready bananas. That was a mistake. The filling was delicious but when we ate it all put together, my family said they didn't like the banana slices in it. (I mentioned that basically it's a vanilla custard pie without them.) Another night in the fridge and the pie was watery and falling apart. I assume this was also because the bananas were too loose. Next time I'll try a traditional banana cream pie.AnonymousLos Angeles5/29/2020FABULOUS dessert! First time making a banana cream pie and it turned out perfect, everyone loved it.  Making again this weekend but will use the sour cream trick to make the whipped cream more stable.AnonymousWashington State5/27/2020Hi, I made it in a 6’’ pan and I only needed half of the ingredients, it turned out perfect but I would recommend you to put a little bit of sour cream into the whipping cream so that it holds better and for longer.Vane MazaGuadalajara, México 5/10/2020So delicious!  Like others have said, it's not too sweet, which I love in a dessert.  Definitely use a larger pie pan, or make 2/3 the amount of the filling.  I didn't have peanuts so I used walnuts in the crust which worked out very well.  I layered the bananas in the crust instead of stirring them into the filling, and added a hefty sprinkle of 95% dark chocolate chopped fairly fine which brought a nice extra layer to the flavor.wren.meredithEugene, Oregon5/1/2020This recipe is full of flavor, yet not heavy on the sugar. Filling is a LOT, so use a deep dish pie plate. A showstopper recipe, both in appearance and flavor! I will definitely make again....and again.CookingwithdiannaMinnesota4/15/2020The custard mixture turned into a liquidy scrambled eggs when cooked at medium. Any ideas why? The crust turned out amazing, but seems like the medium heat cooking recommendation is too high.AnonymousSan Francisco, CA4/13/2020SO so so good. this was my first banana cream pie and it was and really quite easy to make. not too sweet, perfect balance of salty and sweet. i had some crust issues, my crust burnt around the edges the first time- i had to remake it with some tin foil around the edges and it was better- still a little well done. i also had some proportion issues. for some reason had SO much leftover filling and whipped cream. enough for another pie. my pie dish may have been too shallow, so definitely go w a deeper one, or even a size up from 9\" and make a little more crust. Anonymousbrooklyn 4/13/2020Explore Bon AppétitPieDessertAmericanBananaFruitGraham CrackerOther IngredientsFallVegetarianBakingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Chris Morocco"]}