{"id": "cfb380846e879669c04652e350e0ff4e", "url": "https://www.bonappetit.com/story/stefano-diaz-the-meat-wagon", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Stefano Diaz Is Building a Better Butcher Shop | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsStefano Diaz Is Building a Better Butcher ShopThe Meat Wagon is all about showing up for employees, farmers, and the community.By Sara B. FranklinMay 26, 2021FacebookTwitterEmailPhoto by Mike FallonFacebookTwitterEmailIn Person of Interest we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Stefano Diaz, whose butcher shop in Kingston, New York, is working to better serve its employees and community. Stefano Diaz initially didn’t really want to open his own butcher shop. The culture was overwhelmingly white, cisgender, and male, and the work was exhausting. He knew this because he experienced it firsthand after nearly a decade of working in the food industry. And that time allowed Diaz to reflect deeply on how he wanted to operate his own business, not just for himself, but for his employees, his farmers, his customers, and his community. That led him to start The Meat Wagon in Kingston.At his fledgling shop, Diaz is focusing on creating his ideal butcher shop—one that has a safe, sane work culture for employees and farmers and welcomes everyone in Kingston’s richly diverse community. He sees butcher shops as a place of relationship-building, something needed now more than ever. Here Diaz explains how he fell in love with the craft, the systemic issues of the industry that made him step away, and what he’s doing to change butchering for the better.At my first job, post-culinary school, my chef brought in whole pigs and showed me Italian seam butchery, which relies on knives—no saws—and uses the animal’s entire muscles. From the moment I held the fillet knife and made my first cuts, I was hooked.I went all in on butchery, working my way up to become the head butcher at Fleishers in Kingston, New York. The shop was a community anchor. After it closed in March 2017, people asked me, “When are you opening your own shop?”I was reluctant. I left restaurants because of the toxic culture. Butcher shops had better vibes, hours, and pay, but they can be intimidating. That world has a strong cisgender white maleness, and I’m trans and not white.But I loved the craft. In 2018 I started The Meat Wagon as a mobile butchery. Then someone told me about a landlord looking to open a butcher shop. He wanted to fill the void Fleishers left. He just needed a butcher.I opened the brick-and-mortar shop in January 2021. It feels different than most butcher shops—here I make my own rules. I’ve set boundaries with the pace, hours worked, and expectations from my customers and farmers. My pig farmer and I text about the health of the animals and our own mental health.Kingston is diverse, both in terms of ethnicity—we have a lot of immigrants—and socioeconomics. The neighborhood we’re in is a food desert and has many working-class folks, but it’s rapidly gentrifying. So it’s important that we take EBT [electronic benefit transfer] because everyone deserves good meat.I want people to come in regularly, and I genuinely want to hear about their day. I want the queer community to feel comfortable and seen. Butcher shops are personal—they become part of people’s lives.Explore Bon AppétitPerson of InterestInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-26", "author": ["Condé Nast", "Sara B. Franklin"]}