{"id": "cfb6a260280e685726d06db93ac21f04", "url": "https://www.bonappetit.com/recipe/coffee-hazlenut-biscotti", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Coffee-Hazelnut Biscotti Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueCoffee-Hazelnut BiscottiBy Carla Lalli MusicDecember 1, 20204.7(81)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Sue LiEmailPinterestPrintEmailPinterestPrint“When I was growing up, biscotti was a hard sell,” says Carla Lalli Music. “Compared with all the other holiday cookies, the rock-hard one that you dipped in licorice-flavored liqueur was grouped under Things Adults Like That Make No Sense. Now that I’m grown, though, I’ve embraced biscotti as the anti-gooey-chewy cookie that can be packed with my preferred dessert flavors: coffee, chocolate, and nuts. Mine come out crisp but tender, and they’re sturdy enough to dunk in amaro, bourbon, or cold milk—because even in adulthood, I don’t understand sambuca.” An extra egg yolk and plenty of butter help these biscotti stay tender even after being baked twice.IngredientsMakes about 22⅔cup blanched hazelnuts3large eggs2Tbsp. instant espresso powder or instant coffee powder2cups (250 g) all-purpose flour2tsp. baking powder1tsp. Diamond Crystal or ½ tsp. Morton kosher salt½cup (1 stick) unsalted butter, room temperature1cup (200 g) sugar, plus more for sprinkling2tsp. coffee extract or vanilla extract3oz. coffee-flavored chocolate or semisweet chocolate, coarsely choppedPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Toast hazelnuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool, then very coarsely chop. Reduce oven heat to 325°.Step 2Separate yolk from 1 egg over a small bowl to catch egg white. Place yolk in another small bowl. Set egg white aside for brushing dough. Crack remaining 2 eggs into bowl with yolk. Add espresso powder and beat with a fork to combine and dissolve.Step 3Whisk flour, baking powder, and salt in a medium bowl. Using an electric mixer on medium speed, beat butter and 1 cup (200 g) sugar until light and creamy, about 2 minutes. Scrape down sides of bowl, then add egg yolk mixture and coffee extract; beat just to combine. Scrape down sides of bowl and beat until smooth. Add dry ingredients and mix on low speed to combine. Add hazelnuts and chocolate and mix just to evenly distribute. Divide dough evenly between 2 parchment-lined baking sheets. Run your hands under cold water, then shape each dough mound into a 5\" square about 1\" thick. Beat reserved egg white with a fork until foamy and brush over loaves (you won’t need all of it). Sprinkle very generously with sugar.Step 4Bake loaves, rotating baking sheets top to bottom and front to back halfway through, until firm in the center and starting to crisp at the edges, 30–35 minutes. (They will spread quite a bit as they bake.) Transfer baking sheets to wire racks; let loaves cool 15 minutes.Step 5Working one at a time, carefully transfer loaves to a cutting board. Using a serrated knife, slice ½\" thick. Arrange biscotti cut side down on baking sheets and bake, rotating baking sheets top to bottom and front to back halfway through, until dry and crisp, 30–35 minutes. Transfer baking sheets back to racks and let biscotti cool.Do ahead: Biscotti can be baked 1 week ahead. Store airtight at room temperature.How would you rate Coffee-Hazelnut Biscotti?Leave a ReviewTell us what you thinkReviews (29)Back to TopTriangleGreat base recipe, but I really didn't get much of the coffee flavor. Could have been the brand I used maybe? This recipe still made a good nutty chocolate chip biscotti though 🤷🏻‍♀️AnonymousBoston, MA12/24/2021Okay guys I've made biscotti for several years and this one once again was an easy recipe to make. I followed it and I have a few comments to make. It is a good biscotti however I would suggest that you make your loaves much longer than 5 in square because after my biscotti cooked it was 8 in in length which is a little bit long for biscotti. And I want to thank whoever said to use that electric knife because you are an angel. I dug out my old electric knife and it works like a charm ladies no problems. However because I did not want an 8 in biscotti I simply cut them in half and then put them on the tray for my second baking. Now you're saying that's not going to be as pretty well that's true but I also dipped my biscotti in chocolate on that end. So it was a nice trade-off. Also it is so simple if you will simply transfer your parchment paper with your biscotti on it to your rack let it sit a little bit and then take a metal spatula and loosen it a little bit and you can very easily transfer your biscotti using your parchment paper as a guide over onto your chopping board. No problem there I did not find that mine was too delicate. Now for the flavor I did do what one lady suggested and I put two tablespoons of cocoa into my batter and I will say that it probably helped. It is not an extremely strong flavor as I thought it would be when I tasted it raw but it is a good flavor. And of course being dipped in chocolate always helps. Enjoy your baking ladiesGranny7Paducah, KY12/15/2021Hello\nCan I substitute the dry espresso coffee crystals with real espresso coffee, very short, and if so, must I increase the flour or other dry ingredients?\nThank you for getting back to me soonest. I plan to make these on Thursday as holiday giveaways.\nMerci!\nMarie Fabiola BOLDUCMontreal, Québec CANADA12/8/2021These are just very dry cookies without the crunchy character of biscotti and the flavor is bland.  I followed the recipe using espresso powder, vanilla extract, regular semisweet chocolate and hazelnuts.  I've made biscotti many times but wouldn't make this recipe again.  AnonymousQueens, NY12/5/2021I swapped walnuts for hazelnuts because I never can find hazelnuts at the store and these still rocked. Great for seasonal cookie boxes. That espresso powder really packs a punch. AnonymousCulpeper va11/21/2021I had high hopes for this recipe and it exceeded my expectations! My friends think these are the best biscotti ever.\nThis recipe won't disappoint if you like coffee & chocolate.Liz Bsouthampton, ny9/25/2021I made these recently, and they are absolutely fantastic! I had no problems at all with the recipe. They are light, crunchy, and the flavor is heavenly. Well worth the work involved! I had never made biscotti, so this was a first effort, and definitely I'll be making them again. The combination of flavors is just perfect. Best recipe ever!Ingrid H.Eugene, OR9/24/2021These cookies are fabulous!  My fiancé says these are the best cookies I’ve ever made and I make a ton of cookies.  Will be making these for years to comeKarenSScottsdale, AZ6/27/2021I've never made biscotti before, but I was really impressed by these. I added a couple tablespoons of cocoa to the batter (and probably more chocolate chips than what was called for), but otherwise followed the instructions. I didn't find that they spread a ton. I probably could have done both loaves on one of my large rimmed baking sheets. I pulled the loaves out after 30 minutes on the first bake, and they were brownie-like in the center, but crisp on the edges. Left them for 33 minutes on the second bake and they came out crisp but tender. Will absolutely make again! AnonymousCanada4/14/2021I made this recipe twice.  The first time I did not have the espresso powder or the coffee flavoring. I used Lake Champlain cocoa powder and vanilla flavoring. .I t was very good. The second time I had all the espresso powder and the coffee flavoring. They were fabulous!  Easy to follow and nice looking and quite delicious.  I used a variety of dark chocolate, one with sea salt great taste.AnonymousShadyside, Ohio2/28/2021Added a chocolate drizzle on top which made them even better!Anonymous1/29/2021These turned out great with gluten/dairy free adaptations using Namaste flour and earth balance butter. I also subbed 1 shot espresso for the instant coffee as I didn’t have it on hand (a different reviewer mentioned this working as well), and I upped my flour by about 1/4 cup to make up for the extra liquid. I otherwise followed the recipe exactly as written and it turned out great!AnonymousSt Paul, MN1/25/2021I loved this recipe.  I collect biscotti recipes and this is now my new favorite.  I finished them with a drizzle of melted white chocolateMariaConnecticut1/11/2021I was a bit dubious when I baked them because they spread a ton, more than biscotti recipes I've made in the past, but when I sliced them up to do the second bake, they just turned out longer and skinnier - but super tasty. The long skinniness actually makes it easier to dunk and bite without feeling like I need to unhinge my jaw to bite one. I subbed almond slivers because I didn't have hazelnuts and added some almond extract. Flavors look great and they look beautifully toasty with slivers of chopped chocolate. Definitely making again.CorinneCalifornia1/4/2021I loved how light and crunchy these turns out.  Forming them was a bit different than what I usually do, but I really like how long they were.  L and LAlbuquerque12/27/2020Explore Bon AppétitCookieDessertItalianEuropeanHazelnutNutCoffeeAlcohol & Other DrinksSnackBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Carla Lalli Music"]}