{"id": "cfcbde4486bbfbd5284a9069b5554bca", "url": "https://www.bonappetit.com/recipe/green-curry-lentil-soup", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Green Curry Lentil Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueGreen Curry Lentil SoupBy Christina ChaeyFebruary 9, 20214.7(224)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis soup packs in all the ingredients that would make your doctor happy (Lentils! Sweet potatoes! Leafy greens!) but is bolstered by fiery Thai green curry paste to keep things interesting. Store-bought Thai curry pastes can vary widely in flavor and intensity from brand to brand (we tested this recipe with Maesri), so there are also lots of aromatics like onion, ginger, and garlic to ensure there’s plenty of flavor to balance the earthy lentils.Ingredients4 servings2Tbsp. virgin coconut oil1small onion, chopped2garlic cloves, finely chopped11\" piece peeled ginger, finely chopped1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more¼cup Thai green curry paste1medium sweet potato, peeled, cut into ½\" cubes¾cup brown or green lentils4cups low-sodium chicken or vegetable broth113.5-oz. can unsweetened coconut milk, shaken well4cups (loosely packed) baby spinach leaves½tsp. (or more) fish sauceSmall handful cilantro leaves with tender stems and lime wedges (for serving)PreparationStep 1Heat oil in a large saucepan over medium. Add onion, garlic, and ginger; season with salt. Cook, stirring often, until onion is translucent and starts to soften, about 3 minutes. Add curry paste and cook, stirring and scraping bottom of pan constantly, until paste is fragrant and slightly darkened and mixture starts to stick to pan, about 3 minutes.Step 2Stir sweet potato and lentils into onion mixture, then add broth and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt and bring to a boil. Reduce heat to a simmer and cook soup, stirring occasionally, until sweet potatoes are cooked through and lentils are tender but not mushy, 20–25 minutes.Step 3Add coconut milk to soup; return to a simmer. Add spinach and fish sauce and cook just until spinach is wilted, about 30 seconds. Taste soup and season with more salt and/or fish sauce if needed.Step 4Ladle soup into bowls and top with cilantro. Serve with lime wedges.How would you rate Green Curry Lentil Soup?Leave a ReviewTell us what you thinkReviews (57)Back to TopTriangleSo delicious. It was easy to prep, put together and serve. It was also very pretty in the bowl, with the sweet potatoes and spinach adding color and contrast. I followed another reviewer's suggestion to use full-fat coconut milk. It was nice and creamy but I don't know what it would be like with the lite version. I also agree with other reviewers to cook the lentils for about 10 min. before adding the sweet potato. Nicely seasoned, not overly spicy and full of flavor. SuzanneDaly City, CA2/27/2022So good! I'm glad I read the reviews and let the lentils cook for 15 mins before adding the sweet potato as everything was cooked and nothing mushy. I used green beans in place of the spinach and thoroughly enjoyed it. Great easy recipe - a keeper, thanks!Anonymous2/26/2022Enjoyed the soup and liked that it was quick. Next time I will add the sweet potatoes about 15 minutes after the lentils and will use more curry paste. Now I just have to remember to look at my review. Tina DDenver , CO2/23/2022Just made this. Overall pleased, but my MaePloy curry paste is super spicy and kind of overwhelms, even with rice. Will try again with 1/2 as much. Love the combo of ingredients. Jaimee Tahoe, CA2/23/2022I just made this. word to the wise-- go full fat coconut milk sigh sigh sigh. How did I convince myself to use the light version? Still good, but it would be better, and worth it. MeghanPhiladelphia, PA 2/22/2022This was so incredible. I happened to have a package of Trader Joe’s pre-cooked lentils on hand, so I followed the recipe but added the just-right lentils after the sweet potatoes were tender. Additionally, I added some coconut palm sugar to balance out the heat from the green curry. It was very subtle in its sweetness. I also added slicer Keeney and some diced bell pepper. Neither of these vegetables changed the already fantastic flavor, but just helped me use up what I had in the fridge. I will make this again and again. I am also entering it in a cook-off this coming Thursday. Of course, I will credit Bon Appetite and the recipe developer. Anne Texas2/20/2022I made this recipe today and loved it! so hearty and delicious. I had it over white rice and had a very wholesome meal! Very easy to make. I didn't have just baby spinach in my fridge, but a salad mix that mostly contains baby spinach with arugula, baby lettuce. I used that instead of just spinach! tasted amazing Next time planning to add more veggies and some kale for extra bite!MBMaryland2/19/2022Wonderful!AnonymousMn2/14/2022Absolutely DELICIOUS. The reviews are right, the sweet potato cooks more quickly than the lentils. Other than that, it was perfect. Make this tonight!LisaConnecticut2/11/2022Oops, this was  verging on too salty- probably my curry paste- reminder to self not to put any salt in until I control for that. I like the hyped up flavor with the virtuous lentils. Thought it def needed a hit of sugar though, so tossed in about a tablespoon of palm sugar since I have it on hand. Subbed green beans because am out of spinach unexpectedly. Hopefuilly it will reheat nicely.KVLos Angeles2/8/2022This was a hit for us! Really excellent. Per reviews, we did add a little more curry paste than it calls for. I also added extra veggies just to make it more filling & healthy. We added a sliced bell pepper & sliced carrots in addition to what is already called for. It is flavorful and creamy! And you feel like you just ate something very wholesome and nourishing. AnonymousSouth Carolina2/1/2022This was so delicious, creamy and satisfying!  We all loved it and it came together quickly!  Can't wait to eat the left overs!!Amy.BDoylestown, PA1/25/2022Really comforting and delicious! I subbed sweet potatoes for carrots as suggested by someone else and used the whole can of curry - had a great kick. Will be making again!Brittany Rose Denver Co1/25/2022Love, love this recipe. I don't use the fish sauce and it is still divine!LeslieCalifornia1/22/2022This is my second winter of making this soup regularly and we just love it. It's so easy to prepare and so cozy, delicious, & satisfying. I keep a can of green curry in my pantry at all time, just so I can throw this together as needed. I'm sure it's delicious in all the variations people talk about but I am a fan of the OG. Recently, I've found this is a great vehicle to use up that leftover rice I always seem to have in my fridge but that is very optional. I make this if I'm running low on groceries & want to avoid takeout. Or I'm running late & need something fast. Or, I need something that is vegetarian and gluten free. Fills so many needs at my house. AnonymousSeattle, WA1/19/2022Explore Bon AppétitSoupSoups and StewsSpinachLeafy GreensVegetableSweet PotatoPotatoBrown LentilLentilGreen LentilEasyWeeknight MealsOne-Pot MealsMainDairy-FreeGluten-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Christina Chaey"]}