{"id": "cfcedbdf68fb1a05a4136cb9d63db790", "url": "https://www.bonappetit.com/story/tunde-wey-immigrant-marriages", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "Chef Tunde Wey’s New Dinner Series Seeks to Wed Immigrants with American Citizens | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureChef Tunde Wey’s New Dinner Series Seeks to Wed Immigrants with American CitizensWith his newest project, the food activist takes on the country’s current immigration policy.By Brooke ShumanJanuary 30, 2019FacebookTwitterEmailPhoto by Akasha RabutFacebookTwitterEmailChef Tunde Wey wants his diners to fall in love. On February 8 and 9 in Pittsburgh, just before Valentine’s Day, he’ll be setting the mood with low lights, soft music, a spicy broth with big chunks of yam, and a dating profile for each of his 16 guests: age, education, gender identity, gender preference, dealbreakers, whether you can prove you are a U.S. citizen—and if you’re interested in marrying an immigrant. Oh, and there’s a prize. Anyone who opposes the United States’ current immigration policy is encouraged to donate funds toward the initiative, which will then be gifted to the first couple to wed within 90 days of the dinner.Is this a gimmick? Is it even legal? Wey, a food activist, chef, and Nigerian immigrant who spent 10 years living undocumented in the United States, is not too concerned. His purpose with the initiative, entitled Marriage Trumps All, is to start a conversation about the nature of citizen rights in America and the nearly 11 million undocumented people living, working, and paying taxes in this country without them—and then do something about it.Why this dinner now?Well, my marriage is a transnational marriage. My wife and I had to go through this process—we just came out of this three weeks ago [on January 7]. We got married, and after four years, I was officially validated by the U.S. government and immigration services. So this project is very personal in that it has been my experience to think about how we use these institutions to advocate for the sort of society we want.I did a dinner on immigration in the spring of 2017, around that time when Deferred Action for Childhood Arrivals (DACA) was being threatened by the current president, to talk about what we had to do individually to create the sort of country we wanted to see. Everybody agreed on the issue: “Yes, immigration as currently practiced in the United States is discriminatory and prejudiced.” But the missing piece was, well, what do we do? So I looked at my life. I looked at how immigration had affected my life, and how marriage had affected my life. I came to the conclusion that that’s what folks could do: You could fall in love with somebody who was different from you as a way to enshrine true difference as a principle in this country.Political change via blind date?Marriage as a tool of social transformation is important. There’s a legacy of that in America—the Loving ruling [1967], which legally recognized interracial marriages, and the challenges to the Defense of Marriage Act (DOMA) [overturned in 2013], which paved the way for same sex marriage. I think there’s opportunity to extend that legacy through a project like this.Wey in his home in New Orleans.\nPhoto by Akasha RabutWould you call yourself a romantic?[Laughs] I don't know.I generally like to keep things sexy [with my dinners]—the aesthetic, low lights, nice music, that kind of stuff. Everything else is going to be up to the diners. The extent that love matches will happen will be up to the individuals who are open to falling in love with somebody they met at a dinner on a f*#%ing Friday night in Pittsburgh.So you’re hoping other people can benefit from the system. What are the chances, you think, that people will actually fall in love?I feel like at least one couple will find love. It's very possible.Before becoming a permanent resident, you were living and working in the States undocumented. How did that experience influence this project?This whole project is basically a reflection of my experience being undocumented, my experience striving for documentation, my experience going through the immigration system. I needed to [wait]; I needed my immigration journey to be over. Now I have more emotional bandwidth to talk about immigration without being worried about the repercussions.Being undocumented is not sexy. There are a variety of indignations, small and large. There is a persistent fear that you live with of being deported, fear of being harassed, fear of being dislocated. There are material consequences in that your physical person can be detained at any time. You're not legally entitled to representation. These are physical fears, but there's also the psychological effect of living that way. You can't work. You can't open up. Your whole life can be taken from you.There’s a competition element to the dinners. The first couple to get married takes home, I don't want to say a cash prize because it just really sounds like The Bachelor, but that is kind of what it is.Cash gifts are a huge part of marriages. You're starting a new life and you need a certain financial cushion. If you are a transnational couple, you are doubly challenged: the immigration process costs money.Part of this is to encourage everybody to participate—if you don't want to get married or are already in a relationship, then you can contribute $10 or a thousand dollars, whatever you feel like. Everybody has an opportunity to create a society that rejects and rebuts this current regime of fear and othering.Is that possibly…fraudulent?No, there's nothing fraudulent about this. The dinner series is explicitly for people who are single and want to get married. If this is fraudulent, then so is The Bachelor, so is 90 Day Fiancé, so is Tinder, so is everything else. The routes to relationship-making and love connections have changed. The internet and mass media are dictating how these connections are made. The intent is for people who want to fall in love to do so. The immigration benefits would be incidental.Photo by Akasha RabutWhat’s the hardest part for you in getting people to confront these issues?I recognize that these systems are intractable. I can see it playing out in the room. I can see it playing out with white people, with folks who have class privilege, with men. Any sort of system of power that is intent on maintaining its power is not going to give up that power, right? I know that, yet I'm still doing the work that I'm doing.This dinner series is about finding a way to create parity between immigrants and U.S. citizens. It's never going to happen. Being a United States citizen literally has more cache than being a Nigerian citizen. I hate it because I'm Nigerian, and I want my life to be just as valuable as everybody else's lives. I want everybody's lives to be equally valuable, but that's not what it is, as we can see. But the purpose of my dinner is to create circumstances where this is true.How does the food fit in?I think it'd be strange if there weren't food—something to eat, something to drink. It's a social lubricant in the room and in the space. I am interested in pointing out [our] complicity, which we tend to acknowledge, but there seems to be very little that we do in terms of actually subverting the systems that we complain about. This dinner is about wielding our cultural and social institutions in a different way.What will you be cooking?Akara, which is a bean and bell pepper fritter, battered and deep-fried in oil. I’ll probably make a date chutney as a dipping sauce. A soup with plantains and African yams called Epuru. It’s a spicy broth that has all sorts of aromatic and pungent spices in it. Ekpang nkukwo, basically grated yams wrapped in a cocoyam leaves stewed in palm oil and other spices, is [typically] served with seafood. I’ll substitute with mushroom (enoki and trumpet) for texture. They’re all aphrodisiacs [in Nigerian cuisine].I cook Nigerian food because it’s the food that I grew up on and the food that I’m most familiar with. I am hoping that if I serve Nigerian food, I can dislocate people’s idea of food by giving them something different, something that didn’t require too much pondering. I’m trying to use my food to reeducate Americans about how food should be.This conversation has been edited for clarity and length.Marriage Trumps All is co-presented by the August Wilson Cultural Center and City of Asylum as part of the Familiar Boundaries. Infinite Possibilities exhibition. To reserve your place at one of the dinners, submit a dating profile here.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-30", "author": ["Condé Nast", "Brooke Shuman"]}