{"id": "cfd1848384ac9aa4e56c45236ec826c7", "url": "https://www.bonappetit.com/recipe/burnt-carrots-with-cbd-brown-butter", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "Burnt Carrots with CBD Brown Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBurnt Carrots with CBD Brown ButterBy Chris MoroccoApril 29, 2019EmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintLarge carrots are ideal for this recipe since they’re big enough to get crispy-charred on the outside but stay just-tender and meaty inside. We developed this recipe using a 1,000 milligram (mg) bottle of Lily CBD. It's part of the Healthyish Guide to Cooking With, Eating, and Truly Enjoying Weed in collaboration with Broccoli. Click here to read more about how to make cannabis delicious.Ingredients4 servings1lb. large carrots (about 3 fat ones), cut into ½\"-thick rounds1Tbsp. extra-virgin olive oilKosher salt2small shallots, cut into ¼\" rings16\" square sheet of nori, torn into bite-size pieces1small garlic clove, crushed3Tbsp. unsalted butter½tsp. CBD oil2Tbsp. fresh lime juiceFlaky sea saltPreparationStep 1Place a rack in top third of oven; preheat to 450°. Toss carrots and olive oil on a large rimmed baking sheet. Season with kosher salt. Roast carrots until lightly charred around the edges and just-tender in the center. 15–18 minutes. Let cool slightly.Step 2Meanwhile, cook shallots, nori, garlic, and butter in a small saucepan over medium heat, stirring often, until butter is browned and nutty-smelling and shallots are golden, 6–7 minutes. Add CBD oil and stir to combine.Step 3Transfer carrots to a plate. Spoon butter dressing over. Drizzle with lime juice and season with sea salt.How would you rate Burnt Carrots with CBD Brown Butter?Leave a ReviewTell us what you thinkExplore Bon AppétitCarrotVegetableCannabisHerbs & SpicesSideGluten-FreeNut-FreeVegetarianHealthyishRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-29", "author": ["Condé Nast", "Chris Morocco"]}