{"id": "cfd8d201475b48cde4bb7f23d1d91acd", "url": "https://www.bonappetit.com/story/jonathan-gold", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Jonathan Gold Was the Food Writer Who Made Us Love Food Writing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsJonathan Gold Was the Food Writer Who Made Us Love Food WritingAdam Rapoport on the Pulitzer-winning LA Times food critic, who passed away on July 21st.By Adam RapoportJuly 22, 2018FacebookTwitterEmailPhoto by Charley Gallay/Getty Images for SiriusXMCharley GallayFacebookTwitterEmail\"The first responsibility of any great restaurant is to keep you in the bubble, the soft-serve cocoon of illusion where you forget the world exists for anything but your pleasure. And the newly redesigned Spago, from the moment you toss your keys to the valet to the moment you stagger back out again, gives good bubble.\"If you are lucky enough to have made a living as a food writer these past several years, you've spent many hours reading Jonathan Gold, shaking your head with a dumb grin.Gold, the LA Times food critic who passed away yesterday at age 57 from pancreatic cancer, was the kind of writer who fellow food writers weren’t jealous of—they just loved to read him. No hating; just admiration. He won a Pulitzer in 2007 and was nominated again in 2011, and we all knew he deserved it. He wrote in a way that so many of us simply couldn’t.“Soft-serve cocoon of illusion”...“Gives good bubble.”Are you kidding me?! I would've paid my own way at dinner to have written those lines.But when Gold reviewed Wolfgang Puck’s iconic Spago in 2012 for the LA Times, that was just Gold being Gold.And his lede paragraph led only to even more choice lines:\"The thick prime rib steak sings with the flavors of blood, age and char; the tagliatelle with white truffles perfumes half the observable universe when its glass dome is whisked away. Sommeliers beam at the brilliance of your wine selection as if it weren't the sixth bottle of that Austrian Riesling they'd sold that evening. There is important art on the walls, including a photograph of a shattered cellphone the size of Pau Gasol, and a painting you could swear you saw at an Ed Ruscha retrospective, and while the music may tend toward the sort of '80s rock your meathead younger brother may have stashed on his iPod, at least you are not picking at your hearts of palm salad to the beat of hotel-lobby electronica.\"When he wanted to, Gold could drill down on the details of a dish and its ingredients, satisfying nitpicking food-industry types and proving his bona fides. But he could also name check a seven-foot Lakers’ power forward and LA’s most famous living artist in the same sentence, engaging his millions of readers in a way his competition couldn’t.Back in the 2000s, when I was an editor at GQ, I asked Gold to write a short piece for a package on restaurants around the world that were worth flying for. At the time, he was writing a monthly restaurant review column for Gourmet, where his wife Laurie Ochoa was executive editor. I was warned by pretty much everyone, including Laurie, that I would either never get the text or that it would come in so late I’d have to hand deliver it to our printing plant down in Kentucky.Sure enough, after several trying-not-to-sound-panicky emails to Ochoa, Gold’s piece on a trattoria in the hills of Italy arrived at the 11th and a half hour.We shipped it immediately, as it was. It didn’t need any editing.See more: Jonathan Gold Is the Reason I Write About FoodRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-22", "author": ["Condé Nast", "Adam Rapoport"]}