{"id": "cfdf8302095450b63590e1eb94fbc163", "url": "https://www.bonappetit.com/story/orange-hands", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "Do you suffer from “orange hands”? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDo You Suffer From “Orange Hands”?If so, please consult a doctor.By Alex BeggsMarch 9, 2019FacebookTwitterEmailPhoto by Alex Lau, Styling by Andy BaraghaniFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Something healthyI didn’t cook much during the week, but on Sunday I did make a ton of lentils, and these roasted sweet potatoes with burst cherry tomatoes, using gochujang instead of harissa. I was too lazy to make the arguably very easy lentil dressing, instead I just mixed cooked lentils with some chopped shallot I mellowed out in red wine vinegar, plus olive oil and salt. A filling, healthy lunch before spending my afternoons testing cookies as Chris Morocco slowly develops...BA’s BEST CHOCOLATE CHIP COOKIES.Get the recipe: Black Lentil and Harissa-Roasted Veggie BowlCarla’s cooking lessonsI’m so excited about Carla Lalli Music’s new cookbook, Where Cooking Begins , which is one of those I can give to everyone I know, universally, no matter what level of cook they are. The recipe ingredient lists are separated by pantry items you already have versus what you need to buy, meaning each recipe only seems like it’s two or three ingredients. We have a preview and a few recipes on the site you should check out—Carla said a lot of people are making the crispy lamb (“probably because of the cheese”). Not included in this list of excellent cooking tips (make those sweet potatoes!) is the one Carla taught me last year: life is too short for uncomfortable shoes.Where Cooking Begins is available for pre-order now, so you should do that!  It comes out March 19.ByeThe biggest news this week was that Mario Batali, after several accusations of sexual misconduct, is no longer a shareholder in his restaurant group. At first you’re like, oh wow, actions have consequences. But then Eater asked B&B Hospitality some follow-up questions‚ most of which are answered with a squirmy no comment, that reveal a more complicated reality. “What was the sum total paid out to Batali for his stake in the restaurant group?” No comment. “What were his profits on the sale?” Same. Per the New York Times, he’s now spending most of his time at his lake house in Michigan. Per the New York Times Facebook comments, many people are still unaware of the accusations. “Hopefully he opens new restaurants on his own!” writes one. “This man has something to hide. There's no doubt in my mind its black mail,” reads another. Oof.Welcome to the bulk lifeI live with my great aunt, who decided to join Costco this month—FYI, Costco has really affordable hearing aids. I was psyched about this decision, because I love being prepared for anything (and what do you know: Costco sells a nuclear fallout shelter kit for $6,000!) On my first trip, I picked up: a jug of Kirkland extra-virgin olive oil ($15), a 6-pack of GT’s kombucha ($15), a year’s worth of Bounty select-a-size ($21), a 2.2-lb. bag of roasted salted almonds ($12), a 3-pound slab of salmon ($24), and probiotics that seemed like a good idea at the time ($25 for 80!). Sadly, no Kirkland jeans. What else did I miss?You can take some stuff with youIn the name of “budgets” and “modern media” we’re moving our offices down 10 floors this week, to desks ⅓ the size. We were only allowed to pack one box of stuff, so there was a lot of purging, a charity conference room sale, and plenty of whining. What made it to your one box? I asked around. “I have three different versions of Jacobsen salt,” bragged Emily Schultz. Cristina Martinez is going with a pepper grinder and a bag of Reese’s Thins. “Olive oil and honey...desk medicine,” said Brad Leone. Speaking of medicine, Molly Baz is packing Tums, while Alex Delany’s got amaro. Hilary Cadigan, Amanda Shapiro, and Zoe Sessums all mentioned peanut butter. Meryl Rothstein, Sarah Jampel, and I have our precious tea stashes—minimum six varieties. Carey Polis said: “Za'atar! Because you never know when you’ll be eating lunch and there will be a za'atar emergency?!?!?” “My roasted chickpeas coated with asafetida from Patel Brothers!!!!!” said Priya Krishna. “Man do they make my breath stink but they are extremely delicious.” Anyone unmentioned is probably bringing flaky salt. 🙄Unnecessary food meme of the weekI can’t believeI want a tofu press now?Unnecessary food feud of the weekDelany stood up from his desk and said: “Someone needs to write about ‘orange hands.’” That person is me. “Orange hands” is the made-up but real condition in which your hands get a tacky white film from peeling an orange or clementine or Cutie or whatever. “It’s the citrus oils,” explained Delany, a doctor. “I like it!” said Carla Lalli Music, who celebrates nature. “I just eat them in the bathroom, problem solved,” chimed in Amiel Stanek. “Wait, so then do you flush the peels?” I asked. “Oh, I don’t flush,” said Amiel. “It’s nature’s perfume!” enthused Amanda Shapiro. Priya Krishna disagrees: “Have straight up stopped bringing clementines in for lunch because of this.” “My hands feel sticky yet dry at the same time,” said Elyse Inamine. “When the white stuff gets under your fingernails,” fumed Adam Rapoport. “Maddening.”“But you know what’s worse?” provoked Amiel. “Butternut squash hands!” Schultz shuddered at her desk and let out a quivering EwwWwwwWwww: “I’m sorry, I have to chop off my hands now.”Explore Bon AppétitBeggs NewsletterRead MorecultureThe Best Etsy Stores for Hunting Vintage PyrexBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-09", "author": ["Condé Nast", "Alex Beggs"]}