{"id": "cff1ed6bb89028f75088f0331152a4db", "url": "https://www.bonappetit.com/story/your-perfect-margarita", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "The Perfect Margarita is the Margarita That Tastes Best to You—Here's How to Get There | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is the Summer You Make Your Perfect MargaritaWhat, that's not high on your summer bucket list?By John deBaryJune 4, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah MortonFacebookTwitterEmailThe margarita is special in the pantheon of classic cocktails. Like the venerable daiquiri, it’s primal enough that it can be made from commonly-found ingredients yet has enough complexity to offer endless possibilities for riffing and customization. The core recipe—tequila with triple sec and lime juice—is forgiving for beginners but with enough room for experimentation that seasoned pros can add their own touches of flair.There are a lot of riffs and variations of the classic margarita recipe, but as long as you have a shaken drink with tequila, lime, and orange liqueur, you are safely in Margaritaville.As someone who likes a more spirit-forward margarita, my go-to recipe is:1 ¾ oz. tequila¾ oz. lime juice¾ oz. orange liqueur¼ oz. agave syrup (equal parts agave nectar and water)Combine everything in a shaker, add ice, and shake vigorously for 15 seconds, strain into a coupe or rocks glass with ice. Salt rim optional. Garnish with a lime wheel.But knowing how to adapt, whether to your environment or to the people you’re making drinks for, is one of the most important tools available to you as a drink-maker. There are a ton of levers to pull when deciding the ultimate fate of a drink so that you won’t be caught off guard if you’re with a group of people who love sweet drinks or who insist on using a bottle of mezcal they just discovered. Here are six key ways you can dial in your margarita to make it your perfect margarita (or, you know, your friends’ perfect margarita):Tequila tweaksThe taste of any given tequila is influenced by how much time it spent aging in oak barrels. Blanco tequila is bottled without spending any time in oak, Reposado tequila sees up to three months in oak barrels (usually ex-bourbon casks), and Añejo tequila is aged up to a year in barrel. All tequilas offer a base level of roasty vegetal notes, but blancos give a bright, sparkly sheen to cocktails, whereas reposados and anjeos add a layer of warmth and spice. The bottle you pick out can change the entire vibe of your drink.A warning: You really do want to stick to tequilas that have “100% de Agave” and “Hecho en Mexico” on the label. This is how you know the tequila is made from only agave and is high quality. Other tequilas, known as “mixtos,” can be made from up to 49% non-agave spirit and usually are full of unappetizing additives. It is worth the splurge to get good quality tequila.Additionally, feel free to replace a portion of the tequila with mezcal, the smoky agave spirit of which tequila is a specific subset. Start out by subbing out ½ oz. and feel it out from there. You can even get really wild and sub in non-agave spirits like gin or Bourbon.Sweet or dry, strong or weak?For a drier margarita, ditch the agave syrup; or, on the other end of the spectrum, make your drink sweeter by upping the agave syrup to ½ or even ¾ oz. For something less strong, try equal parts tequila, lime, and triple sec (1 ½ oz. each). It’s always worth it to play around with measurements and find where your personal preference is. Remember, just because someone else wrote it down in a recipe does not mean you have to like it.Orange liqueur switchesFor a fresh, vibrant margarita, use a triple sec like Cointreau, a French liqueur made with bitter and aromatic orange peels. For something a little richer, perhaps with more of an autumnal vibe, use Grand Marnier, a Cognac-based liqueur. Blue Curacao is also an extremely valid option.To salt, or not to salt?Salt makes everything taste better. But if you don’t feel like going through the work of salting the rim (it’s a pain for a big crowd or when you’re using disposable cups), you can simply add a pinch of salt to your shaker before shaking. One of salt’s wonderful qualities is that it can cancel out some bitterness from the orange liqueur and lime juice to enhance the sweet, fruity notes of the drink.Up or on the rocks?The weather is usually my guide: If it’s hot out, I go for ice, otherwise, straight up is my preference. Ultimately, it’s a very personal choice and neither is wrong.Topping offBubbles make everything better. Sparkling wine, seltzer, even beer are great augmentations, especially if you want to lean more towards refreshing than strong. Margarita recipes are relatively forgiving and will not be thrown off balance with the addition of an ounce or two of something sparkling, but if you want to add an additional ¼ oz. of agave syrup to compensate for the added dilution and return a bit of body to the drink, go ahead.More tequila, please:4 Easy Tequila (and Mezcal!) Cocktails, No Margarita Mix in SightGive these majestic agave spirits the respect they deserve.View StoryJohn deBary is a former/semi-retired bartender, author of Drink What You Want: The Subjective Guide to Making Objectively Delicious Cocktails, the creator of a line of zero-proof botanical drinks, Proteau, and the co-founder and Board President of Restaurant Workers’ Community Foundation.Explore Bon AppétitCocktailAlcohol & Other DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-04", "author": ["Condé Nast", "John Debary"]}