{"id": "cffb308d26d0a329238f072d88fb13b0", "url": "https://www.bonappetit.com/story/leak-proof-containers-airplane-travel", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Airplane Food Storage Container Ideas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture5 Leak-Proof Containers for Safely Stowing Your Airplane FoodIf you’re going to bring a grain bowl on the plane, do it the right way.By Elaheh NozariMay 10, 2018FacebookTwitterEmailFacebookTwitterEmailAside from the small minority of travelers who love airplane food, most of us just tolerate it and snack on tiny bags of pretzels until we land. Bringing your own food is one step on the journey to mastering the art of eating on the plane. The second, and arguably as important, is how you pack it. Without the right storage containers, the granola you made the night before might spill all over the aisle before you get to enjoy it. Here are five leak-proof travel containers that’ll keep your airplane food safe, sound, and ready to eat.Rubbermaid Clear Plastic ContainersGrain salads are too pretty to be stored in opaque containers. Show off your plane food prep game and pack your herby bowl of farro, olives, and lemon in this crystal clear plastic container whose leak-proof lid will leave your carry-on free of any vinaigrette spillage.Buy it: Rubbermaid Brilliance 3.2-cup plastic container, $35 for pack of 5 on AmazonTwist-Top Stainless Steel JarsHaving a 6 a.m. flight doesn’t mean you have to forgo your morning oatmeal or chia pudding for overpriced airport alternatives. Pack your breakfast in these twist-top stainless steel jars—put your main in the 8-ounce jar, and accouterments like nuts, seeds, and dried fruit in the smaller 4-ounce ones.Buy it: LunchBots Stainless Steel Jars, $11 for 4-ounce and $13 for 8-ounce on AmazonStainless Steel Airtight ContainersThese airtight containers are durable enough for long trips and come in a variety of sizes, so there’s no snack they can’t store for those long international flights. Why wait to be served airplane nuts when you can pack your own mixed variety?Buy it: Onyx Stainless Steel Airtight Containers, from $50 for a set of 3 on Food52Aluminum LunchboxSome of us only need a peanut butter & jelly to keep us sated mid-flight. For those simple, all-purpose sandwich cravings, get this aluminum lunchbox that’ll keep everything in place, no matter how soft the bread is.Buy it: SIGG Aluminum Food Box Plus S, $35 on AmazonGlass & Silicone Food StorageIf you’re a glass container loyalist, fear not—you don’t have to risk a shattered glass situation should TSA handle your belongings a little aggressively. This glass container has silicone webbing that protects the vessel from breaking so you get all the benefits of glass (no leaching chemicals!) without the risk of breakage.Buy it: Lifefactory 2-Cup Glass Food Storage, $13 on Amazon1 / 18ChevronChevronQuinoa Bowl with Lentils and Mustard VinaigretteView RecipeAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitShoppingTravelRead MorecultureThey Would Know: The Best Containers for Leftovers, According to Test Kitchen EditorsBy Elaheh NozaricookingThese Meal Prep Containers Will Motivate You to Bring LunchBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-10", "author": ["Condé Nast", "Elaheh Nozari"]}