{"id": "d000ec3fb200d51351d8dcd0c96dc80a", "url": "https://www.bonappetit.com/story/pressure-cooker-coconut-short-ribs", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "How to Make Pressure-Cooker Short Ribs in 1 Hour | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow I Turned Slow-Roasted Short Ribs Into Pressure Cooker Short RibsOur new recipe called for 5 hours of slow roasting in the oven, but I didn't have the time. So I made it happen in an hour.By Alyse WhitneyFebruary 22, 2018FacebookTwitterEmailPhoto by Marcus Nilsson, Food Styling by Rebecca Jurkevich, Prop Styling by Angharad BaileyFacebookTwitterEmailEven the most hands-off recipes can throw a wrench in your weekend plans. I bookmarked our new short ribs slow-roasted in coconut milk to make on a lazy Sunday at home, and then I realized I had a Broadway show smack in the middle of the day. That didn't leave 5–6 hours to stay home and babysit my oven.So after some Googling around to figure out how to convert a recipe from oven-roasting to pressure cooking, I discovered that these pressure cooker short ribs could be tender and ready in about an hour. (You should cut to “about ⅓ of the standard cooking time,” according to Melissa Clark,  New York Times columnist and author of Instant Pot cookbook Dinner in an Instant.)Since the flanken-style short ribs I had were only about ¾\" thick when the recipe called for 1½–2\" thickness, I went for 1 hour at high pressure on my Crock Pot multi-cooker. (Looks and works just like an Instant Pot, but costs $30 less—$69.99 at Target.) I stood the ribs up so they were shingled across the bottom of the pot and nine ribs (3 lbs.) fit snugly. There was no searing needed—just 10 minutes of prep to blitz grated lemongrass and ginger and chopped red chile, shallot, and garlic with a can of coconut milk and 1 Tbsp. curry powder in a blender. I poured the coconut milk mix over the ribs, cooked for an hour, and then let the pressure release naturally so the meat didn’t toughen. I was nervous they’d need more time, but they were perfectly tender; when I lifted a piece of short rib out of the pot, it fell apart in my tongs and the bones fell out immediately.You could make soy sauce-marinated short ribs in a pressure cooker too.\nAlex LauIn the oven for so many hours, the liquid reduces and caramelizes into something that resembles a sticky, jammy glaze. The pressure cooker doesn’t do that without one quick extra step. While I shredded the meat, I let the sauce reduce on sauté mode in the pressure cooker for about 10 minutes and made some rice. After cooking down a bit, it resembled traditional Indonesian beef rendang that this recipe is based on: beef coated in thick, saucy, curry-spiced coconut milk with subtle sweetness and kick of spice.Short ribs aren’t typically a weeknight meal, but this pressure cooker-adapted recipe makes it possible. And it holds up the next day—I packed shredded short ribs, sauce, and rice together in pint containers for way-above-average meal prep. It could also help take the pressure off while hosting a spontaneous dinner party, or save you if you forgot about an anniversary dinner until 2 hours before. Whoever you make it for, they’ll go coconuts.Ready to make it? Get the recipe:Short Ribs Slow-Roasted in Coconut MilkIn this riff on Indonesian beef rendang, the meat is cooked in coconut milk until it breaks up into gloriously rich jammy solids and delicious fat.View RecipeAnother way to eat short ribs—with pasta!Explore Bon AppétitShort RibRoastpressure cookerInstant PotRead MorecookingThis Is the Weirdest-Best Way to Cook Short RibsBy Carla Lalli MusicpromotionsWine-Braised Short Ribs, Meet Our Friend PastaBy Alex DelanytechniquesHow to Grill Short Ribs in 10 MinutesBy Andrew MilneRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-22", "author": ["Condé Nast", "Alyse Whitney"]}