{"id": "d004763d50898e2306e275febf9b475d", "url": "https://www.bonappetit.com/story/mojo-picon", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "Mojo Picon Is the Spicy, Garlicky Sauce That Will Enliven Nearly Any Bland Ingredient | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFiery and Garlicky, Mojo Picón Is a Potato's SoulmateThis Canarian sauce can wake up nearly any bland ingredient.By Valerio FarrisJune 2, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah MortonFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.As a paella instructor at a cooking school for tourists in Barcelona, I learned to coax onions, peppers, and garlic into an amber sofrito and to blend and strain shrimp heads for a broth that tasted like the bottom of the ocean. But while most tourists arrived eager to learn the secrets of paella-making, it was the snacks, which we laid out for them to pick at as they cooked, that held my attention.Next to plates of buttery jamon and meaty green olives, we placed bowls of papas arrugadas, small boiled potatoes with splotches of red sauce flashing brightly against their dull and salty skins.The crayon-red topping was mojo picón, a sauce that hails from the Canary Islands, a Spanish archipelago of eight main islands off the coast of northwest Africa. There are two main varieties of the simple garlic- and oil-based condiments known as mojos: picón, which is spicy and red, and verde, which is herbaceous and green. While each is made from a simple, straightforward, and variable formula, it’s the mojo picón that has motivated me to pull out my mortar and pestle on multiple occasions.Missing their mojo!\nAlex LauAnd yeah, a mortar and pestle is the key to mojo magic. I tried a version in a blender and, while it technically works, it also tends to oversimplify the sauce. You can still make mojo in a blender—just be careful to stop mixing before the sauce becomes completely smooth. A little texture is your friend here!To start, mash 1 tsp. ground cumin, 1 tsp. sweet Spanish paprika, 2 cloves garlic, and 2 chiles, stems removed,  in the base of a mortar and pestle until a thick paste forms. I used 2 fresh cayenne chiles from my backyard, but you can also use red guindillas, red jalapeños, or chiles de árbol, depending on what’s available to you. The same amount of dried chiles would also work. Once it’s all combined into a paste, add 1 Tbsp. sherry vinegar and mash to combine.Now for the emulsion: As you continue to grind, drizzle in 1 cup olive oil, pausing every few seconds to allow the oil to fully incorporate before continuing. What should emerge is a smooth sauce that’s more homogenous than a chimichurri and a bit chunkier than a purée. Most importantly, it should be brutally red. Go ahead and salt to taste. More than a pinch or two shouldn’t be necessary. The green version subs out the peppers for a handful of cilantro and veers less spicy.Both mojos are best spooned over a plate of golf-ball-sized potatoes boiled in salty, salty, salty water, but mojo picón is intensely versatile in its applications. I’ll make a big batch to store in a jar in my fridge for a week or two, spooning it over blanched cauliflower or roast chicken or grilled fish.During my time in Barcelona, I’d make mojo with my Canarian roommate Omaira, mashing a batch to eat with our lunch. “Mojo picón reminds me so much of the Canary Islands,” she told me. “It reminds me of the volcanoes on the islands because of its intense color and flavor, and of the sea because we eat it with salty potatoes or fish.” I no longer live in Barcelona, but sometimes a taste of mojo picón helps me forget that.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-02", "author": ["Condé Nast", "Valerio Farris"]}