{"id": "d008ceb4a3a733e88285c906861af935", "url": "https://www.bonappetit.com/story/brothy-seafood-chowder", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "A Brothy Seafood Chowder Recipe That Eases the Way from Summer to Fall | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Brothy Seafood Chowder Recipe That Eases the Way from Summer to FallAlison Carroll's dairy-free chowder is a perfect memory of a summer spent in Maine.By Alison CarrollSeptember 28, 2018FacebookTwitterEmailPhoto by Jay CarrollFacebookTwitterEmailJuly 1st is my tipping point. That’s when the daily temperature of the high desert exceeds 100 degrees and the only respite is pool-hopping and a cold drink at the Joshua Tree saloon. For me, it’s not summer until I’m in the Atlantic Ocean, more specifically the briny, bracingly cold waters of coastal Maine. So around the 4th of July, I get one last desert cannonball in for the summer and say goodbye to friends, pack up the car with a few audio books on cue, and starting heading east to the furthest point on the map.These annual cross-country drives have become a tradition for the three of us—myself, my husband Jay, and our pup Lefty. We pick two or three points on a map to pause for a minute. For this trip, the stops are to check in at our newly renovated hotel, El Rey Court in Santa Fe, and visit family in Oberlin and Philadelphia. In between, we drive like hell, pausing at the Whole Foods and good small-town health food stores, or for a quick, delicious bite in cities like St. Louis or Nashville.Alison Carroll manning the grill in late summer.\nPhoto by Jay CarrollOnce we’re east of the Mississippi, it’s big big bottleneck until we pop out across the border into Maine and see that wonderful sign welcoming us to Vacationland, “the way life should be.” We spend the first 24 hours eating our way through Andrew Knowlton’s list of Portland spots, then we head up the coast toward the Blue Hill peninsula. We stop at the Brunswick Farmers Market for homemade miso and onigiri, beet and fennel probiotic shots, and a dulse seaweed laced kraut to go with the nasturtium and rosé sausages. I live in California, and still nothing comes close to the produce of Maine farmers markets during summertime for me. The Maine ground is weather-beaten and frozen for the lion’s share of the year, but for these glorious, brief summer months, the loamy soil thaws and earns its bounty of husk cherries, wild blueberries, mushrooms, and supremely perfect tomatoes. The only other things I need to eat well are a corkscrew, a sharp knife, a box of Morton salt, Wonder Valley olive oil, and some chile peppers from New Mexico. We load up a case of wine at the Blue Hill wine shop and settle into our downeast life for the next month or so.I grew up on the East Coast and there’s an urgency to summer here that I don’t feel out west, to make every moment count because it’s so fleeting. My summertime youth was spent recklessly sun tanning, eating ice cream every day, and feeling true anguish over a rained-out weekend. I feel that summer hourglass here in Maine, pushing me to jump off rocks and swim every day and spend each night tending the open fire of a grill to eat my weight in lobster and not miss a moment. There is an abundance of extremely fresh, inexpensive seafood here, an embarrassment of riches coming from our landlocked desert home. I split lobsters in half and grill them with a herb brown butter spooned in the cavity of the tails, I make a big paella over the beach with local mussels and clams and garlic scape aioli, and, as the end of summer draws in with nights getting colder, I make a huge pot of fennel and fish stew. I squeeze every drop out of summer before we head back home, an easy 50 hours of driving away.Make this and dream of July:Brothy Seafood ChowderThe homemade stock makes all the difference in this flavorful, savory, perfectly smooth chowder.View RecipeRead MorecookingOn Breaking Food Rules and Learning to Cook the Food You LoveBy Alison CarrollRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-28", "author": ["Condé Nast", "Alison Carroll"]}