{"id": "d02448aab9b90f2be96a8d87dda29b03", "url": "https://www.bonappetit.com/story/cloudforest-chocolate-bee-pollen", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "This Bee Pollen Chocolate Bar Is Striking and Not-Too-Sweet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’d Happily Eat This Bee Pollen Chocolate Bar as a Daily SupplementIt’s less effective than straight-up bee pollen but infinitely more delicious. By Aliza AbarbanelFebruary 12, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.If you’ve ever frequented a bougie smoothie shop or gotten lost in a Whole Foods, you’ve probably spotted bee pollen. Bees make the golden pellets from foraged pollen to feed to their babies while humans looking for the next big superfood use it to top acai bowls, multigrain porridges, and other brunch staples. Go figure. The slightly sweet, musty-in-a-good-way granules are high in antioxidants and thought to help ward off seasonal allergies, which is why I stashed a jar in my pantry to zhuzh up my oatmeal last year. But after several months of forgetting to sprinkle it on anything, I realized there’s only one way I would actually consume bee pollen: when encased in chocolate.It looks like a bee but tastes like fruity chocolate.\nEmma FishmanThis realization came to me when BA’s deputy editor Julia Kramer handed me a bar from Cloudforest, a bean-to-bar chocolate company based in Portland, Oregon, and helmed by Ecuadorian chocolatier Sebastian Cisneros. He merges single-estate Ecuadorian cacao with a lineup of ingredients that reads like a millennial Willy Wonka fever dream—palo santo, Pop Rocks, black sesame, pimentón. It’s all exciting, but I’m especially fond of the bee pollen, which is harvested by Jacobsen Co. Honey, a hive program operated by Jacobsen Salt Co that works with sustainable beekeepers in the Pacific Northwest.The contrast between fruity pollen and creamy milk chocolate is undeniably delicious—even for someone like myself who proudly swears allegiance to the dark side (of chocolate). It certainly doesn’t count as a supplement, but it’s just about the only kind of sweet I’m willing to gift this Valentine’s Day.Buy it: Cloudforest Bee, $8 at CloudforestAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendChocolateShoppingRead MorerestaurantsI Have Been to Pastry Heaven and There Are Rainbow CookiesBy Alex PastronRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-12", "author": ["Condé Nast", "Aliza Abarbanel"]}