{"id": "d043800c6a0c93180122db2541850802", "url": "https://www.bonappetit.com/story/italians-mad-at-food", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "The “Italians Mad at Food” Twitter Account Is Too Real to My Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe “Italians Mad at Food” Twitter Account Is Too Real to My LifeItalians are exceedingly proud of their culinary traditions. And why shouldn’t they be? These people invented pizza.By Carla CicconeMay 7, 2018FacebookTwitterEmailFacebookTwitterEmailLike many Italians, I was raised to love good food and tell stories about it.Here’s one.My nonna, dad, and aunt crossed the Atlantic on a boat from Italy in 1953. Dad was four and my aunt was six. They ate well on that journey: pasta, minestrone, eggs, and bread that was crunchy on the outside, soft on the inside. When they docked in Halifax, Nova Scotia, an attendant handed my aunt a sandwich—a slippery slice of ham between two pieces of mushy white bread. She started crying. “It’s cake!” she sobbed, knowing on some level that the culinary standards she had enjoyed so far had been left behind on the boat she stepped off of.In fact, many Italians who immigrated to Canada around that time started calling the locals mangia cakes, meaning “cake eaters,” because whenever they pulled out their lunches, there it was: soft, perfectly shaped white bread that looked, to those whose bread was brown and crunchy on the outside, like dessert. Since before Italy was a nation, Italians have been mad at food that is not good or at least not their particular region, city, or hamlet’s version of good, and I hope they stay that way forever.Italians are also exceedingly proud of their culinary traditions. And why shouldn’t they be? These people invented pizza. Thanks to the internet, Italians are quickly discovering what North Americans—namely food content creators like Tasty and Tastemade (and yes, even Bon Appétit)— are doing to their beloved dishes, and they’re not happy about it.Twitter contentThis content can also be viewed on the site it originates from.A magnificent and highly entertaining Twitter account called Italians Mad At Food is documenting the best of Italians commenting on abominations of their national cuisine. These are emotional, over-the-top reactions generally written in Google-translated English or just shoddy regular English because internet comments. They’re usually along the lines of “YOUR ‘PASTA’ BELONGS IN THE GARBAGE ALONG WITH YOUR PRESIDENT.” These people are way too dramatic and need to calm down because it’s only food, and I am absolutely one of them.Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.This may seem excessive, but trust, it’s warranted. I cannot stress enough how much better Italians are at food than the rest of us. I once met a two-year-old in Italy who knew more about food than I, a grown woman, do. Her name was Laura and she cut up crespelle all by herself, told me its ingredients, and delicately ate her pieces with a fork, adding that she’d like a side of verdure, per favore (“greens, please”). Of course, little Laura didn’t get this way on her own. She reminded me of a scene from the show Jamie’s Great Italian Escape, in which Jamie Oliver attempts to make pasta by hand, fails, and gets schooled by a six-year-old who is much better than he is (start at 13:13). Like most Italians in Italy, these kids are taught from birth that food is life and life is food, to always treat food like your favorite dinner guest and get really mad about it when it’s not perfect.Italians are the Kanye Wests of food, basically.Twitter contentThis content can also be viewed on the site it originates from.You might be thinking, Why do these crazy people care about this food on the internet if they don’t have to eat it? Valid point, but to be Italian is to be nosy, stubborn, and insanely judgmental when it comes to all kitchen matters. Disrespecting their food is like disrespecting their mothers and grandmothers and ancestors. They must rage-watch these videos and tell you why they shouldn’t exist. Does this mean that North Americans are lazy, cultureless hacks who wouldn’t know good food if it hit them in the face? Not entirely, but because Americans generally haven’t been exposed to this level of food fanaticism and perfection, and what’s available on this continent is blander, junkier, saltier, and uglier, it can be hard to comprehend why Italians care so much about food.Twitter contentThis content can also be viewed on the site it originates from.To them, watching Americans make terrible versions of their food and calling it Italian is like looking at the Ecce Homo painting after that woman in Spain attempted to restore it and calling it great art. They grimace, they gasp, they get full-body cringes. So they’ve taken to scolding us like children who have been very bad and need to learn a thing or two.Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.When people try, in the comments and in life, to defend things like one-pot-pasta, in which a dry pasta like fettuccine is placed in a pot containing an unfathomable mix of chicken broth and milk before it is even boiling, they’re not only making themselves look sad, they’re actually hurting Italian people.Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.According to Italians Mad At Food, there are an extraordinary amount of Italians mad about what is being done to pasta, specifically, and I am here for it.Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.Even when it’s not made in one pot or boiled in milk, pasta is constantly disrespected in North America. I’ve been lying to people about their pasta for my entire life. There usually comes a time in my friendships when one will say, “you’ll love the food at this new restaurant, it’s authentic Italian,” or “Logan makes the best pasta sauce, you have to try it.” I’ll try it, and I’ll lie about it and tell you it’s good. Never, ever think you can impress an Italian with your version of Italian food.Twitter contentThis content can also be viewed on the site it originates from.Italians, renowned for overabundant passion and enthusiasm, know the one place not to overdo it is in the kitchen. Less is more, and simplicity is one of the reasons why food tastes better in Italy than it does anywhere else. Their sauce is always kept simple, which is something that is often lost in translation in North American kitchens. The idea is that if your ingredients are the freshest and the best, you don’t need a lot of them to make the sauce sing. A little onion, some strained San Marzano tomatoes, a bit of salt, pepper, and basil and basta. The order of ingredients is also important, which is one reason this Bon Appétit video recipe for Pietro’s chicken Parmesan got more than a few Italians riled up. No one attempting Italian cuisine is immune to their wrath.Fettuccine Alfredo is a hot-button food item for the IMAF. Is it Italian because it was invented by an Italian named Alfredo? Some concede yes, others yell no! One thing is certain, though: Heavy cream and butter have no place in pasta.Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.Another dish Italians get up in arms about is carbonara, a Roman meal traditionally made with egg, Pecorino, guanciale, and pepper. It became popular with American officers after the Allied liberation of Rome in 1944. They took it home with them and, depending on whom you ask, ruined it.Twitter contentThis content can also be viewed on the site it originates from.Lasagna, often mutilated, rarely duplicated, has her honor defended too.Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.The misrepresentation of mozzarella is an endless source of frustration for the angry Italians.Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.Of course, no list of crimes against Italian food would be complete without mention of a serial offender known as Hawaiian “pizza.” (Pizza in quotes for the mad Italians.)Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.Italian anger at pineapple on pizza holds a special place in my heart because I suffered through eating it at many birthday parties in Calgary (which is Canada’s Dallas, except really cold), despite knowing it was a mortal sin. My desire for friends outweighed my duty to uphold the sanctimonious culinary standards of my parents’ homeland. (I’m sorry.)Twitter contentThis content can also be viewed on the site it originates from.It’s not just Hawaiian pizza that burns us up. It’s also the North American propensity for dumping layer upon layer of toppings on a pizza, which they do not do or understand in Italy.Twitter contentThis content can also be viewed on the site it originates from.Italians Mad At Food is the full expression of a lifetime of repressed food rage, and quite frankly, following it has been a joyous and liberating experience. And if you try boiling pasta in milk in front of me, I’m calling the police.Twitter contentThis content can also be viewed on the site it originates from.There is a right way to make fettuccine Alfredo. Food director Carla Lalli Music shows us how:Explore Bon AppétitTrends + NewsItalianPastaRead MoreFettuccine AlfredoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-07", "author": ["Condé Nast", "Carla Ciccone"]}