{"id": "d04d2721ec76b535ea4f0332c0b7f36e", "url": "https://www.bonappetit.com/story/kiribath", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "Sri Lankan Kiribath is Creamy, Velvety, and Made With 3 Ingredients (Coconut Milk, Rice, and Salt!) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSri Lankan Kiribath is Creamy, Velvety, and Made With 3 IngredientsMake it for the Sinhala and Tamil New Year, a special occasion, or just because it's delicious.By Zinara Rathnayake April 10, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.My mother, who worked as a school teacher, didn’t have time to cook for us during the week. But when the weekend arrived, Amma woke up early to prepare kiribath, Sri Lankan milk rice, for me.Creamy and velvety, kiribath is rice cooked in coconut milk. Being two of the main ingredients of the island’s cuisine, rice and coconut milk also symbolize prosperity. Because of that, kiribath is a ceremonial dish, prepared on celebratory days: the first day of a new job, a new school term, weddings, birthdays. On the day of Sinhala and Tamil New Year, celebrated mid-April, many Sri Lankan households prepare kiribath at an auspicious time of day, determined each year by an astrologer, to enjoy with traditional sweetmeats.For Amma, kiribath was also her weekend special. Once cooked, she would lay the coconut milk-infused rice mix on a plantain leaf from her garden until it set and cooled. Amma cut this mixture into diamond-shape pieces before plating it for me. Understandably, weekends became my favorite time, when I’d watched morning cartoons while feasting on Amma’s kiribath. I loved it both sweet and savory, devouring kiribath with a ripe banana or with a spicy onion relish called lunu miris that’s made of dried red chiles, a pinch of sea salt, and lime.Now that I travel and live in different places across Asia, I’m often far away from my parents’ home in the village. When I long for those childhood weekends now—the happy memories with my mother and a taste of home—I cook kiribath on a gas stove with store-bought coconut cream. My mother, though, used a clay pot over an earthen fire to cook kiribath. Sometimes I use a large pan to lay my mixture flat, cutting it into diamond shapes. Other times I spoon it out for eating.Here’s how I adapted my amma’s kiribath: Take 1 cup rice (use any short- or medium-grain white rice) and wash it thoroughly. Place washed rice in a saucepan or a cooking pot. Add ½ tsp. salt and 2 ½ cups water and bring to a boil on medium heat. Cover and let it simmer on low heat until it absorbs all the water and the rice is soft, about 20–25 minutes.Next, you need coconut milk. For this, my amma grated coconuts and squeezed the coconut meat with a little water to prepare thick coconut milk. But don’t worry. You can use store-bought coconut milk. Measure 2 ½ cups coconut milk, add it to the rice, and stir well. (Store-bought coconut cream gives kiribath a rich creamy flavor and texture, similar to my amma’s homemade coconut milk, but if you aren’t a fan of strong coconut-y flavor and richness, stick to canned milk.)Simmer on low heat for about 15 minutes, until the rice is thick and creamy. At this point, your rice should be fully cooked. After some time, you will see that it starts to become slightly porridge-like and the rice sticks together—that’s the texture you are looking for.Pour the mixture onto a shallow plate or a pan. Flatten it out using a spoon, spatula, or parchment paper. Let it cool. While it will set firmly, the coconut milk keeps the interior creamy. Once set, use a knife to cut it into square or diamond-shaped pieces.There is no correct way to eat kiribath—you can enjoy it warm or cold, sweet or savory. This three-ingredient dish pairs well with spicy chicken curry or vegan cashew curry, but you can also eat it with some palm jaggery sprinkled on top for something sweet. When I’m home with my parents, my father makes katta sambol—a spicy red chili paste—for my mother’s kiribath served warm.When I miss my parents now, I cook kiribath. There doesn’t have to be a particular reason to celebrate—the opportunity to feel the warmth of my childhood home is occasion enough.Zinara Rathnayake is a writer based in Asia who covers food, travel, and culture.Explore Bon AppétitIt's That SimpleSouth AsianRiceCoconut MilkCoconut CreamCoconutRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-10", "author": ["Condé Nast", "Zinara Rathnayake"]}