{"id": "d04f33c9fe4594288651b3eab3e93e7e", "url": "https://www.bonappetit.com/story/why-do-eggs-have-double-yolks", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "What's the Reason for Double Yolks Eggs? An Investigation. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy Do Some Eggs Have Double Yolks? An Investigation.They’re called double yolkers, and honestly, they’re fascinating.By Mari UyeharaMarch 27, 2018FacebookTwitterEmailPhoto by Brad LeoneFacebookTwitterEmailSupermarkets have become a microcosm of humankind attempting to enforce order over nature. Aisles upon aisles showcase the fruits of the land processed into uniform shapes and sizes. Even in farmers’ markets we expect to find rosy red apples presented free of wormholes or ravages of the wild. So, it is somewhat of a surprise when the unusual triumphs over uniformity, say finding a heart-shaped potato or two carrots intertwined as one in a produce bin. That’s the case if you’ve ever cracked open an egg and two yolks fell out into the bowl. What a delight. Unlike your Valentine’s spuds, however, it’s a more common uncommon occurrence. Is there a reason? To find out, I called up prolific chicken writer Gail Damerow, author of multiple books on the subject, including Storey’s Guide to Raising Chickens, which an American Poultry Association member called ”exhaustingly thorough.”Damerow, who operates a family farm in Tennessee, is so familiar with the phenomenon that she can spot them without cracking open an egg and uses a common nickname for them: “double yolkers.” In fact, in her time raising chickens, she’s also seen a triple yolker. And, according to the Guinness World Records, the world’s largest chicken egg, which was nine inches in diameter and had five yolks. Guinness World Records aside, the greatest number of yolks found in a single chicken egg is said to be nine. Yep, nine yolks in one egg. Must have been quite the omelet.To understand the rich miracle of the double yolker, one must understand the biological process of egg-making. “It takes 25 hours to make one egg,” says Damerow. “When a hen is hatched, they come into the world with a certain number of ova—it’s like a bunch of grapes that hangs from the backbone.” There comes a time in every young hen’s life when she is mature enough to lay eggs, and when that time comes, the ova grow one at a time until it’s the size of a yolk. Then it breaks away from the ovary, like an all-black-clad teenager bound for college, traveling through the oviduct, leaving the ovaries to the outside world. As the yolk moves through the oviduct, glands secrete the albumen, a.k.a. the egg white, and the substance to form the shell, a somewhat similarly sticky experience to a college dorm. And then, lo and behold, an egg is laid.There’s been no close observation of the creation of double yolkers being made inside chickens, à la a microscopic Dennis Quaid in Innerspace. But the working theory is that they are forged when ovulation occurs too rapidly or when one yolk catches up with another slow-moving yolk in a hen’s oviduct.There are two different kinds of chickens that most commonly lay an egg with two yolks. On occasion, they’re laid by heavy-breed hens, for which the habit of making double-yolk eggs is an inherited trait. However, heavy-breed hens are not typically used for commercial egg laying because they don’t lay many eggs. In all likelihood, if you find yourself with a double yolker, it came from an egg-laying pullet, a young hen, specifically under a year old.Pullets typically produce smaller eggs when she first starts laying, around the size of pigeon’s and sometimes their eggs will have no yolks at all. Damerow knows that she’s got a double yolker on her hands when a pullet produces an egg the size of one from a mature hen. “With a pullet, the mechanics of the production cycle aren’t working in sync yet,” says Damerow. “It’s like a toddler stumbling around and not yet well-coordinated.” So if you find yourself with a double yolker, think of it as the gift of an amateur hen’s early work, like the joyful scribbled drawings of a toddler but more nutritious.Related: How to Buy the Best Eggs PossibleWe’ll never get sick of eggs:Explore Bon AppétitEggRead Morerecipes91 Egg Recipes That We Always CraveGallery91 SlidesBy Bon Appétitrecipes19 Fried Egg Recipes to Top Everything You MakeGallery19 SlidesBy Alyse Whitneyrecipes54 Healthy Egg Recipes for Breakfast, Lunch, and DinnerGallery54 SlidesBy Nico AvalleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-27", "author": ["Condé Nast", "Mari Uyehara"]}