{"id": "d0509a35134bb663c95b47cf7989b0e4", "url": "https://www.bonappetit.com/story/meditation-myths", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Meditation Tips to Get You Started and Keep You Going Toward Inner Peace | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle5 Things People Get Wrong About MeditationThink nothing's happening when you sit down to meditate? Think again.By Aliza AbarbanelJune 26, 2018FacebookTwitterEmailFacebookTwitterEmailAs a quietly anxious person who spends a great deal of time thinking about self care—and significantly less time actually practicing it—meditation has long seemed the answer to achieving a healthier mental state. I'm not the only one who feels this way: We're searching for tranquility online, in meditation studios, and in buses parked in Midtown Manhattan. Apps like Headspace and newcomer Calm have raised over $30 million in funding. So, why has every honest attempt to \"clear my mind\" ended with planning that night's dinner?In search of answers (and some stress relief), I called up Jennifer Taylor and Jamie Leigh Kreshock of The Shift, a multifaceted mindfulness app with sound baths, yoga poses, guided meditations, and other tools designed to cultivate awareness in daily life. It turns out, I was wrong about all those failed attempts to \"clear my mind,\" and a lot of other people are too. Here they break down the five myths they hear most—and provide some meditation tips for becoming a more mindful person. I’m officially out of excuses.“I can’t clear my mind”Meditation can take many forms, each with a unique intention, but Taylor notes that mindfulness meditation is not about getting rid of all thoughts. “Your brain is designed to think, and the goal is not to stop the mind but to recognize thoughts without running away from them,” she says. “It’s about bringing the mind into a focused point of attention in the present moment.\" If you find yourself planning dinner or wistfully imagining a dreamy vacation in Portugal in the middle of a session, acknowledge that your mind has wandered and bring yourself back to the present (and your meditation practice) by drawing a breath. Also don’t be too hard on yourself. It happens to everyone.“I don’t have enough time to meditate”Most people can’t dedicate an hour a day to mindfulness. And that’s okay! The key is consistency: Taylor stresses that building a daily practice, even for just five minutes, is more effective than meditating for an hour every once in a while. “There’s no day when you don’t have five minutes when you’re on Instagram or scrolling through something on your computer,” says Taylor. “It’s basically like your daily hygiene—you brush your teeth and you floss your mind.” Try meditating after waking up or before bed, but don't be afraid to squeeze it in whenever you have a free moment. “Part of my own practice in being compassionate with myself is acknowledging that my schedule looks different,” she says. “I’m not a routined person, so the most important thing to me is to find the time in my day somewhere, and sometimes that’s five minutes and sometimes that’s an hour.”“I’ve been meditating but nothing is happening!”“The point of meditation is not to have a big experience, and that’s hard for us to wrap our heads around,” says Taylor. “Meditation is really about cultivating a greater sense of intimacy with yourself. It’s about building a relationship where you’re observing the patterns of your own mind.” In other words, you’re probably not going to reach enlightenment. (But if you do, call us!) Just remember that it’s called a meditation practice for a reason—it takes time and practice to feel the effects.“I’m bad at meditating”Time for some real talk: You might never be “good” at meditating, and that’s okay. “You can practice every single day and you will have days where you wiggle around like a 4-year-old on your seat because you can’t get it together, and that’s because it’s just life,” says Kreshock. In other words, the struggle is part of the process. (Yes, this is a very zen perspective. But it’s true!) “One of the things that has been most helpful to me in my own practice has been recognizing that it’s okay to have a full range of emotions,” says Taylor. “It’s more important for me to sit on my mat for five minutes a day, observe what’s happening in my mind, and just allow it to be what it is without acknowledging whether it’s bad or good.”“I’m not the kind of person who can meditate”You don’t have to chill in salt caves or go to daily yoga classes to make meditation part of your life. You just have to want to start. As a corporate lawyer and co-founder of The Shift, Kreshock uses her own past as a reluctant meditator to prove this point. “There is powerful data—you don’t have to believe in the esoteric if you don’t want to,” says Kreshock. “Meditation puts our brain in a state of being where we are calmer, our blood pressure is lower, and the pace of our thoughts is more helpful. If for no reason than you don’t want to take your third different kind of blood pressure medication, you should think about where you can put your physical body in a way to achieve better performance.”For more meditation tips, check out their app.Explore Bon AppétitHealthyishTrendsRead MoreLifestyleI Spent an Entire Day on a Meditation Bus and It Was Very, Very QuietBy Rachel Sugar Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-26", "author": ["Condé Nast", "Aliza Abarbanel"]}