{"id": "d05b18297b37367ad13beb3e688982c2", "url": "https://www.bonappetit.com/recipe/glazed-sweet-potatoes-with-lentils", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "Glazed Sweet Potatoes With Lentils Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueGlazed Sweet Potatoes With LentilsBy Chris MoroccoOctober 12, 20204.4(90)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintTearing the sweet potatoes isn't just fun—it creates more surface area to char and lacquer with a spicy maple-soy glaze.  And good news for meal-preppers: You can roast these sweet potatoes and marinate your lentils five days ahead.Ingredients4 Servings2large or 3 medium sweet potatoes (1½–2 lb. total)1cup lentils, preferably black beluga or French greenKosher salt6Tbsp. extra-virgin olive oil, divided4Tbsp. unseasoned rice vinegar, divided4scallions2Tbsp. pure maple syrup1Tbsp. soy sauce1Tbsp. white miso1tsp. toasted sesame oil1tsp. mild red pepper flakes, plus more for servingCoarsely chopped toasted pistachios (for serving)PreparationStep 1Preheat oven to 425°. Roast sweet potatoes on a rimmed baking sheet until tender, 45–55 minutes. Let cool 10 minutes.Step 2Cook lentils in a medium pot of boiling salted water until tender but not falling apart, 20–30 minutes. Drain; let cool 10 minutes.Step 3Toss lentils in a medium bowl with 4 Tbsp. olive oil and 2 Tbsp. vinegar. Season with salt.Step 4Trim scallions and cut crosswise into 3\" lengths. Slice each piece into very thin matchsticks. Place in a small bowl and pour in cold water to cover; set aside.Step 5Whisk maple syrup, soy sauce, miso, sesame oil, 1 tsp. red pepper flakes, remaining 2 Tbsp. vinegar, and ¼ cup water in a small bowl. Set glaze aside.Step 6Heat remaining 2 Tbsp. olive oil in a large nonstick skillet over medium-high. Slice or tear sweet potatoes into 2\" pieces; cook, turning, until deeply browned on several sides, 5–7 minutes. Remove from heat and add reserved glaze (it may spatter a bit). Set over medium heat; cook, spooning glaze over, until thick enough to coat a spoon, about 1 minute.Step 7Scrape sweet potatoes and glaze onto a platter. Drain scallions; pat dry. Toss two thirds into lentils; spoon around potatoes. Top with nuts, remaining scallions, and more red pepper flakes.Step 8Do ahead: Sweet potatoes can be roasted and lentils cooked and dressed 5 days ahead. Let cool. Cover and chill separately.How would you rate Glazed Sweet Potatoes With Lentils?Leave a ReviewTell us what you thinkReviews (37)Back to TopTriangleAbsolutely Delicious. Made a speedy version to avoid heating the oven: boiled the sweet potatoes instead of roasting. Used avocado oil instead of sesame because I didn’t have any, that will have messed with the flavor. It was still delicious. I would imagine it would be even better if I’d roasted the potatoes first. Wow! I’d love to know the origins of this flavor combination. Thank you Chris for a delicious meal. Sarah BTucson, AZ8/22/2021It only allows me to leave five stars…I agree with “This was food.”AnonymousCA6/24/2021This was good! I wasn't sure how it was going to turn out, but was impressed. Super filling and healthy. I roasted the potatoes for 40 minutes, and they were the perfect firmness. I sliced for just an easier and less messy process. I think the only thing I would change would be the amount of sesame oil in the glaze — it was strong and took over, but that just might be my own personal taste. Will definitely make again! LizzieMonterey, CA6/4/2021really delicious! will be adding this to the regular rotation. i only roasted the potatoes for 30 min and they tore perfectly but didnt turn to mush.teresa los angeles, ca3/16/2021Fantastic combination of flavors. Served this as a side to a Sunday Brunch with Crustless Spinach Quiche.   Layers and layers of flavors, each distinct.  Filling - will enjoy leftovers.     Recommend not precooking sweet potatoes, but definitely prepping lentils in advance.  Lentils had sufficient time to absorb the sauce but sweet potatoes were mushy.  I would also ever so slightly undercook the sweet potatoes when you first roast them, although my guests loved them this texture, they quickly lost shape and became mush in the skillet something a bit firm potato wouldn’t do.  Followed the remainder of the recipe exactly as indicated.  Absolutely wonderful.  SheilaBerlin, NJ2/21/2021Delicious! Made this for the first time last night and we absolutely LOVED it! My store only had dried red lentils and Melissa's Steamed Lentils (which are brown) so I went with the Melissa's ones. I can't imagine this would taste any better using black or French green, tho. Thanks for a great new way to enjoy sweet potatoes - and lentils!annbbConnecticut2/18/2021Loved most of the flavors, but will omit the scallions next time-much too strong.  My sweet potatoes were basically a mush, so will have to figure out what went wrong with those when I make this again (and I will, I defiitely will).  Surprising how much flavor the lentils take on with just that minimal seasoning.  Really good!AnonymousArlington Heights, IL1/25/2021First time I made this I made only the potatoes. Flavours were great but my very tender-roasted potatoes didn't really crisp up/brown so the glaze wasn't really a glaze, it kind of soaked into the potatoes. Still delicious though. Second time I made the whole dish, this time my potatoes did brown - I think I put in too little oil the first time, apparantly it's also important to follow oil-measurements in recipes, ha - and the glaze was soooo perfect and sticky and delicious. I see people saying they doubled the glaze, which seems a bit much to me. The lentils I could do without, I think they need a little more and they're not worth the fuss with the ice bath. CarlyAmsterdam1/14/2021Hmm.  The flavors were very good but my sweet potatoes were basically a sweet potato hash.  I would forget the  scallions.  I served all of this hot which just seemed more appealing to me than cold lentils.  I was really looking forward to the glaze and it just didn't happen.  But ... I will try again - and if it turns out better, I will report in.KatharineStockholm, Sweden12/3/2020Great recipe!!! \nMade just the sweet potato part tonight for Thanksgiving. So good. Doubled the sauce, cause, why not? Jennifer K11/27/2020Wow we love this recipe ! it has become a weekly staple. I prefer to slice the sweet potatoes in about 1\" discs. I tried the tearing technique and prefer just slicing. Delicious ! Nicoleportland, or11/20/2020The first time I made this, the glaze cooked off pretty quickly. The other night I doubled the amounts for the glaze, and had plenty, which really allowed the flavor to come through more than my first time. I think next time maybe I'll try 1 1/2? But I really love this recipe.Emily F.Oakland, CA11/19/2020Amazing! I've made this on repeat the last few weeks. The flavors are delicious, and it seems very healthy. \nTakes some time but it's super easy. I followed the recipe exactly and don't think it needs any tweaking.Lindsey KCambridge, MA11/17/2020Fantastic recipe! Seemed relatively healthy and very delicious. AAnjellySanta Cruz, CA11/13/2020Holy moly this is delicious.  If you need to feed four people, you'll need to double the recipe.  AnonymousArlington, VA11/12/2020Explore Bon AppétitSaladSweet PotatoPotatoVegetableFrench LentilLentilBlack LentilMainSideVegetarianDairy-FreeVeganHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-12", "author": ["Condé Nast", "Chris Morocco"]}