{"id": "d07a4ae8c2c1b42227470af92f17c577", "url": "https://www.bonappetit.com/recipe/marinated-tofu-with-brussels-sprouts-and-farro", "year": 2021.0, "month": 1.0, "day": 1.0, "content": "Marinated Tofu With Brussels Sprouts and Farro Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2021 IssueMarinated Tofu With Brussels Sprouts and FarroBy Devonn FrancisJanuary 1, 20213.4(75)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThe soul of this recipe comes from the ginger and tamari marinade that gives crispy tofu a sweet and savory winter coat. Use firm tofu, which will soak up the flavors quickly, then sear it to get those browned edges while keeping it soft and tender inside. Get a head start by cooking your grains a day or two before (farro, like its relative freekah, holds up well in the fridge for a few days). In the spring, try swapping the brussels sprouts for raw cucumbers.Ingredients4 servings1cup semi-pearled farro or cracked freekeh, rinsedKosher salt114-oz. block extra-firm tofu11½\" piece ginger, peeled, finely  grated2Tbsp. tamari or low-sodium soy  sauce1Tbsp. fish sauce1tsp. ground cumin6scallions, coarsely chopped12oz. brussels sprouts, trimmed,  halved through stem end4Tbsp. vegetable oil, divided½ lemon⅓cup coarsely chopped parsley or cilantroPreparationStep 1Preheat oven to 425°. Toast farro in a large wide pot over medium heat,  stirring often, until golden brown, about 4 minutes. Remove from heat and pour in cold water to cover grains by 1\"; season generously with salt. Set pot over medium-high heat and bring water to a boil. Reduce heat and simmer, skimming foam from surface, until grains are tender but still have some bite, 25–30 minutes. Drain farro and return to pot off heat; cover to keep warm.Step 2While farro is cooking, cut tofu lengthwise to create 2 wide, flat slabs.  Pat dry with paper towels to remove as much moisture from surface as possible. Arrange in a single layer in a large shallow bowl.Step 3Whisk ginger, tamari, fish sauce, and cumin in a small bowl to combine. Pour half of marinade over tofu and gently turn to coat evenly.Step 4Toss scallions and brussels sprouts with 2 Tbsp. oil and remaining marinade on a large rimmed baking sheet to coat well; season with salt. Spread out vegetables to ensure everything cooks evenly and roast, tossing halfway through, until deeply browned in spots, 20–25 minutes.Step 5Finely grate zest from lemon over vegetables, then squeeze juice over. Add parsley and toss well to combine.Step 6Heat remaining 2 Tbsp. oil in a large nonstick skillet over medium-high. Working in batches if needed, cook tofu, undisturbed, until dark brown and very crisp, about 2 minutes. Carefully turn over and cook on other side until dark brown and very crisp, about 2 minutes. Transfer tofu to a cutting board and slice as desired.Step 7Divide farro and tofu evenly among bowls. Scatter brussels sprouts mixture on top.How would you rate Marinated Tofu With Brussels Sprouts and Farro?Leave a ReviewTell us what you thinkReviews (28)Back to TopTriangleRead the reviews and tripled the marinade.  Unfortunately, a lot of it burned on my sheet pan while roasted the veggies (I added broccoli to the brussels) so glad I reserved some.  I also finished it with sesame seeds which added a nice flavor.  Didn't feel like toasting the farro was necessary either.  I cook tofu regularly and am always looking for new ideas, but felt this one was a lot of work and didn't quite hit the mark.  Anonymous1/12/2022I'm so glad I read the comments before attempting this recipe. I tripled the marinade and it was the perfect amount for both the tofu and veg. Overall, I thought this was an ok recipe. I think adding heat to the tofu would have been a good idea because the meal was kind of one note through.MelLos Angeles, CA1/11/2022I made this almost exactly as the recipe is written, with the exception that I had pressed tofu already, which I used. I should have read the comments, as I agreed the marinade was just barely enough and could/should be at least doubled. I also think if could have used some chili-garlic sauce or red pepper flakes. The final dish was dry so I used sriracha to solve that (and add some spice). The scallion greens roasted much faster than the brussels and whites—I’d probably add them later or cook on the stovetop instead. Would also cook the tofu for longer and/or add cornstarch to help it get crispy.ElizabethDenver, CO11/24/20212 stars.  I wish I'd checked the comments, first!  Definitely lacking in...something.  I'm guessing more marinade would have made this feel a little more 'tied together', but as it is I felt like I made three separate elements that I served together.  I like cumin, but if I made this again, I'd probably leave it at 1 tsp and then double the rest of the marinade ingredients.  Anonymous3/9/2021The flavors are spot on but the marinade barely covers the tofu let alone covers the veggies.  You need to make at least double if not triple the marinade to let the flavors blend.  Overall a good dish tho, assuming you know how to handle tofu.SpencerCleveland2/26/2021After pressing one inch slabs of extra firm tofu, I cubed it and marinated it. This marinade barely covered my tofu, so when I packed the leftovers for lunch (I made farro and roasted sweet potato to go with the tofu) I needed to make a little sauce to give this dish some flavor. The marinade wasn’t vibrant and , honestly, wasn’t flavorful at all. However, maybe because I pressed the tofu and then cubed it, I was able to get a decent crisp from frying. \nOverall, this recipe does not factor in tofu noobs. I at least know a little bit about tofu and was able to make this work. Jane Doe 1/27/2021Agree wholeheartedly with the other critical comments here. I made this recipe last night and it was very tasty, but this recipe does not seem like it was properly developed or tested and required much modification to turn it into a workable dish.\n\nI have been making tofu, one of my favorite foods, for close to 40 years. I'm not sure the recipe author has much experience with tofu, because there are a lot of things that need to be done differently. Extra firm tofu can't be marinated or cooked as a cutlet with just a pat dry with paper towels. It needs to be pressed between layers of dish cloths or paper towels with a cookie sheet and teakettle full of water placed on top for at least 15-20 minutes. Using super-firm tofu is a better bet, but even then I would still try to remove moisture for more time than the recipe calls for.\n\n I can also say definitively that a slab of tofu, especially one as large as a full 1/2 block, is never EVER going to turn \"dark brown and crisp\" with a 2 minute cook time per side. Never. I cooked for about 5 minutes per side and flipped 3 or 4 times, for a grand total of perhaps 15 minutes per batch. Even then, the tofu had a browned exterior but was not crisp. You're not going to get crisp tofu unless you coat it in something.\n\nAgree with the others that the marinade was woefully little. I easily doubled the marinade and still ended up glugging a bunch of tamari and fish sauce directly onto the tofu in the marinade dish. You must at least double or even triple the marinade. I made extra and added some sesame oil and rice vinegar to cook up into a sauce to ladle over the dish, which was essential in my opinion.\n\nOverall, the recipe is a keeper, but be prepared for on the fly heavy modification to make it work. Bon Apetit, you need to do better.ErikBrooklyn NY1/26/2021Tofu was the best tofu I have ever eaten! The marinate made just enough for one block of tofu, but I just served it on some farro and some simple roasted squash and drizzled an apricot soy salad dressing over it all. 10/10! Thanks so much, Devonn!CriVancouver Canada1/25/2021I agree 100% with the other reviewers that said the marinade was not enough to coat the Brussels and also marinade the tofu. We really enjoyed the Brussels sprouts and green onion, but found that the tofu did not actually crisp - even with a hot pan and oil, and like others said, it was not enough marinade. We added some additional soy sauce to the brussels. Most of the “crispy tofu” recipes that we normally make involve using corn starch, or baking the tofu, and I think if we were to make this again that is probably what we would do. Also, we always press our tofu for at least 20-30 minutes to get the water out, which we did even though the recipe doesn’t say to. Since I felt the dish would be quite dry, I made a quick rice wine vinegar/soy sauce dressing to pour over it, and we served it with sriracha. Overall, a bit of a miss - we are avid BA subscribers and more than half of our weekly dinners come from BA. Most of our repeat dishes are BA recipes. I was surprised to be disappointed with this one! Leah Bellingham, WA1/21/2021Per the reviews, I doubled the marinade, and added a teaspoon of sambal and a tablespoon of brown sugar. I also doubled the  brussels sprouts so the double batch of marinade did go over more stuff as well. I didn't find the marinade-then-fry technique worked for my tofu. I think next time I would either just fry first to get nice and crispy and then toss in the sauce, or just cube up small and marinade and heat in a pan for a more soft tofu sauce situation. I sliced the white part of the onion and cooked with the tofu, and used the green part as garnish. I used lime instead of lemon and just squeezed over my plated bowl, and used cilantro instead of parsley. Lots of changes I realize but it was still a good jumping off point and I enjoyed my finished product! SarahBerkeley, CA1/19/2021Simple to put together and pretty filling. Used cilantro over parsley and made the marinade x1.5 \n\nAdding the lemon zest and juice to the veggies brighten up the flavors. \nI pressed the tofu for at least an hour  to get most of the water out, which may have helped it pick up all the flavors from the marinade. Cécile1/19/2021My wife, toddler son and I really liked this, and we normally eat meat.TravisPortland, OR1/19/2021I made this per recipe and it was not great. Lacking in flavor and texture. Disappointing for a Bon Appetit recipe. Adding spice helped but only a little. Sam Baltimore, md 1/18/2021I made the recipe exactly to instruction in spite of review recommendations because I wanted to see what the issue with it could be. I didn’t include parsley though. Overall, the marinade is missing sweet and heat. The cumin adds warmth but it overpowers the ginger instead of adding balance. I’m not sure how parsley would fit into the rest of the flavor profile going on here. It’s a good concept though. I know this is meant to be Healthyish, but I think a Tbsp of honey or brown sugar would have really woken this dish up. I added dry gochugaru to the veg after tasting and I think it helps lift it. The tofu instructions don’t seem to match what’s pictured.BreeHouston1/17/2021Wish I had read the recipe first. Not a great recipe overall, the mix isn’t quite right. Although the Sprouts came out great. Definitely agree with other reviews that the marinade was not great not to mention you need about 3x the amount. Made this + the Tamarind chicken form the February edition and overall a little disappointing! LivMontreal. Canada 1/15/2021Explore Bon AppétitRice and Grain BowlFarroRice & GrainsFreekehTofuOther IngredientsBrussels SproutVegetableFallWeeknight MealsEasyMainNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-01", "author": ["Condé Nast", "Devonn Francis"]}