{"id": "d0823d55b2772ea014063581e6f77814", "url": "https://www.bonappetit.com/recipe/raw-butternut-squash-ribbon-salad", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Raw Butternut Squash Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueRaw Butternut Squash Ribbon SaladBy Anna StockwellSeptember 18, 2018EmailPinterestPrintPhoto by Alex Lau, food styling by Sue LiEmailPinterestPrintEmailPinterestPrintYes, you can eat butternut squash raw: Thinly shave it into ribbons and marinate it in a zesty dressing and it’s a refreshing and fun new side recipe for your fall table.Ingredients4 servings1small Fresno chile, seeds removed, thinly sliced2garlic cloves, finely grated2tsp. finely grated orange zest5Tbsp. fresh orange juice2Tbsp. white wine vinegar1Tbsp. extra-virgin olive oil2tsp. kosher salt1medium butternut squash (about 2 lb.), peeled¼cup unsalted, roasted pumpkin seeds (pepitas)PreparationStep 1Whisk chile, garlic, orange zest, orange juice, vinegar, oil, and salt in a large bowl to combine. Using a peeler, slice lengthwise strips off long neck of squash to make long ribbons until you have 8 cups (9 oz.). Add to bowl with dressing and toss to coat. Let sit, tossing occasionally, at least 30 minutes and up to 1 hour to tenderize and marinate.Step 2Toss in roasted pumpkin seeds, then using tongs, transfer to a serving platter; discard any excess dressing left in bowl.How would you rate Raw Butternut Squash Ribbon Salad?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladAmericanCalifornia CuisineButternut SquashSquashVegetableOrangeCitrusFruitFresno ChileChilePumpkin SeedSeedFallWinterSideRawDairy-FreeVeganVegetarianGluten-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Anna Stockwell"]}