{"id": "d08af7ddf470be5fa9bbc1caaa94fc34", "url": "https://www.bonappetit.com/recipe/baked-oatmeal-with-warm-cranberry-apple-sauce", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Baked Oatmeal Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBaked Oatmeal with Warm Cranberry-Apple SauceBy Anna StockwellNovember 13, 20183.7(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintThis baked oatmeal is the make-ahead breakfast your holiday plans need—it’s easy to execute and feeds a crowd. Substitute coconut oil and your favorite alternative milk to make this dairy-free.Ingredients6–8 servingsOatmeal5Tbsp. unsalted butter or virgin coconut oil, melted, divided3cups old-fashioned oats1cup pecan halves½cup pumpkin seeds (pepitas)½cup skin-on sliced almonds2tsp. ground cinnamon1½tsp. kosher salt¼tsp. ground cardamom4¼cups whole milk, unsweetened almond milk, unsweetened coconut milk beverage, or unsweetened oat milk¼cup honey1large egg, beaten to blend2tsp. vanilla extractCompote and Assembly3apples, preferably a mix of varieties so you get lots of texture and flavor, peeled, cut into 1\" pieces½cup fresh cranberries¼cup honey13\" cinnamon stick¼tsp. kosher saltHeavy cream, yogurt, or coconut yogurt (for serving; optional)PreparationOatmealStep 1Preheat oven to 350°. Brush a 2-qt. glass or ceramic baking dish with 1 Tbsp. melted butter.Step 2Mix oats, pecans, pumpkin seeds, almonds, cinnamon, salt, and cardamom in a large bowl. Whisk milk, honey, egg, vanilla, and remaining 4 Tbsp. butter in a medium bowl. Pour milk mixture over oat mixture and stir to combine. Transfer to prepared pan.Step 3Bake oatmeal until liquid is absorbed and top is golden brown, 35–40 minutes. Let sit 10 minutes before using.Step 4Do Ahead: Oatmeal can be baked 3 days ahead. Let cool, then cover and chill. Reheat, covered in foil, in a 350° oven until warmed through, 15–20 minutes.Compote and AssemblyStep 5Bring apples, cranberries, honey, cinnamon, salt, and 2 cups water to a boil in a medium saucepan over medium heat. Reduce heat to medium-low and simmer, stirring occasionally, until compote is thick and saucy, 35–40 minutes.Step 6Divide oatmeal among bowls. Top with compote. Serve with cream alongside (if using).Step 7Do Ahead: Compote can be made 3 days ahead. Let cool, then transfer to an airtight container and chill. Rewarm in a medium saucepan over medium heat, adding more water to thin if needed.How would you rate Baked Oatmeal with Warm Cranberry-Apple Sauce?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleDoes BA not test their recipes? WAY too much liquid in both the oatmeal and compote- I wish I would have read the reviews. It doesn’t look anything like the picture, as I ended up with pink applesauce and soupy oatmeal. Anonymous11/18/2019Not tasty. Sauce turns to mush really quickly, maybe don't add the apples until the last possible second?leylusha4/9/2019Made this but heeded the comments about too much liquid! Used hazelnut milk and ghee to make it dairy-free and included 2c of \"milk\" instead of the suggested 4 1/2c. Came out like a dream and I was able to cut into squares, wrap in parchment paper, and eat on my way to work. Anonymous1/14/2019With sautéed apples and greek yogurt, it tastes like a healthy deconstructed apple pie. I made this with half almond milk- half regular milk, topped with toasted, caramelized walnuts and heavy handed with the spices... Just scrumptious!! I ate the entire pan in two days. Fricken delightful. moo cocoBrooklyn1/4/2019Made this exactly as written. At 40mins baking, the oatmeal was still soupy. Not sure what I did wrong but it never absorbed the 4 1/4 cups of milk even after another 20mins or so. Golden top sure. But soupy underneath. Tasted good and I’ll reduce the milk content next time. Anonymous12/3/2018My family loved this!!! I don’t care for oatmeal and I loved it.  We can’t wait for the weekend to make it again.  Delicious! BHFFlorida11/26/2018I haven't made the recipe yet.  On Wednesday I had Baked Oatmeal at the Refectory Cafe in Durham, North Carolina.  It was amazing.  They said that they made it the night before and let it sit overnight to soak up the liquid ingredients and then baked it with peaches the next morning. I would love that recipe.  Have you ever made it using that technique?  Could this recipe be adapted to be made that way?AnonymousVirginia Beach11/24/2018Explore Bon AppétitAppleFruitCranberryBerryOatRice & GrainsYogurtOther IngredientsDairy-FreeGluten-FreeVegetarianHealthyishThanksgivingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-12", "author": ["Condé Nast", "Anna Stockwell"]}