{"id": "d093ac9d8367af2aab26b69ca67b504e", "url": "https://www.bonappetit.com/story/spaghetti-al-limone", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "Spaghetti al Limone Is the Creamy, Lemony Pasta You Need in Your Noodle Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Creamy, Lemony Pasta You Need in Your Noodle LifeSpaghetti al limone is here to take your cacio e pepe’s place on the weeknight pasta shelf.By Alex BeggsSeptember 24, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailSpaghetti al limone is one of those recipes whose name is more complicated than its preparation. (That is, if you don’t speak Italian. Sorry @Italiansmadatfood!) What we have here is a classic Italian dish of pasta in a lemon-cream sauce. Heavy cream. The good stuff.Recently, editor in chief Adam Rapoport had the pappardelle al limone at I Sodi in New York, a Bon Appétit staff favorite Italian restaurant/pasta temple, and honestly, he wouldn’t shut up about it. What makes it so special? “Butter,” he told me. Yet it feels lighter than heavy cream sauce, he added, while another staffer called it “alfredo for people in denial.” Digital director Carey Polis is maybe the biggest fan: “I mean, this sounds ridiculous but I really do feel this way: I lived in Italy for a year where I ate a pretty absurd amount of pasta, but I can’t think of one I crave or love more than the pappardelle al limone from I Sodi.” She wrote a book blurb for a plate of pasta, people! Sometimes we fixate on meals like this. We realized we didn’t have a recipe, and needed one ASAP. Molly Baz was assigned to develop it, coincidentally tweaking small factors—the shape of the pasta, the amount of lemon zest—so we had to keep trying it, over and over.Instagram contentThis content can also be viewed on the site it originates from.But at its core, it’s as simple as cacio e pepe, an uncomplicated weeknight dinner that sustains and comforts. That’s a nice way of saying GIMME THE CARBSSSSS. Our sauce is the zest of a whole lemon (crucial for the unique, bright acidity of the final product), ¾ cup heavy cream, and butter. It emulsifies with some pasta water (the secret to restaurant-glossy pasta at home, another obsession of ours), and once you add the al dente noodles, it gets even creamier with the incremental addition of Parmesan. A final squeeze of lemon juice at the end “makes the fat...pop,” explained Molly, which, uh, is a good thing. It brightens up the supremely creamy sauce and the touch of acidity is what keeps you coming back for twirl after twirl. Don’t skimp on the salt to keep the balance in check.Technique-wise, I talked to Molly about the line in the recipe about the cream sauce “tightening up,” which is a bad thing. Translation: When a cream sauce cools, it thickens and loses its sauciness (like me at the fifth hour of your wedding). So you might end up using more starchy pasta water than usual to make up for that. Save two cups of pasta water to be sure!A note on noods: We tested with pappardelle, but found different brands were inconsistent, some thicker than others, shorter than others. A short noodle isn’t as satisfying to twirl into the sauce, and some thinner noodles broke into pieces in the thick sauce. We went with De Cecco spaghetti (our favorite), but any long noodle option will work. Follow your heart.Get the recipe:Pasta al LimoneThis creamy lemon pasta recipe is luscious and amply cheesy, but still bright and fresh. Best part: You can make it for dinner in just 15 minutes.View RecipeExplore Bon AppétitPastaWeeknightLemonCreamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-24", "author": ["Condé Nast", "Alex Beggs"]}