{"id": "d0997a0dad934a9cab12f7075ccefea4", "url": "https://www.bonappetit.com/story/samosa-tart", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "Your Next Party Deserves This Flaky, Cheesy Samosa Tart | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Next Party Deserves This Flaky, Cheesy Samosa TartOne of the world’s greatest handheld pastries goes large format.By Kendra VaculinOctober 14, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I’m a sucker for cute stuff, particularly any big thing made small. There’s something undeniably fun about those shrink-rayed butternut squash (they call ’em Honeynuts, awww!), two-bite apple pies, and cocktail pigs in a blanket. It’s rarer, however, for things to go the other direction. Probably because Honey I Shrunk the Kids-ing a quiche into something tiny is easier and more normal than, say, making a macaron the size of your face or a basketball-size arancini. On the rare occasion that small food can successfully go large format, it feels festive and special. Big food? Oh, yeah: That’s party food.Mumbai Modern, a new cookbook by Amisha Dodhia Gurbani, which comes out November 2, is full of fun twists on Indian home cooking, utilizing bright flavors and comforting ingredients in delicious ways. “Vegetarian recipes inspired by Indian roots and California cuisine” reads the book’s subtitle, and the produce-laden recipes deliver on that promise. Think pear and chai masala cinnamon rolls, paneer skewers in a cilantro-peanut pesto, and what Gurbani calls the “Ultimate Mumbai-California Veggie Burger,” which, wow, sign me up. But in flipping through the book the first time, the recipe that sent me to the grocery store immediately was for a cheesy samosa tart.Mumbai Modern$35 at AmazonThis tart is exactly as delightful as it sounds: all of the flavors of a samosa, plus a layer of melty Fontina cheese, blown up to party-size proportions. With the help of a sheet of frozen puff pastry, it’s relatively easy to make and almost impossibly buttery and flaky, exactly the kind of thing I’d be thrilled to find next to the charcuterie plate. From the dough up, it boasts a layer of caramelized onions, the aforementioned cheese, a spiced potato-and-pea mixture, and an array of toppings and finishing touches: fresh cilantro, sweet pomegranate seeds, a green cilantro-mint chutney, and a tart tamarind-date chutney. (If your neck is sore from nodding affirmatively to every additional layer, same.) It’s a riot of flavors and textures, ping-ponging from sweet to herby to savory to gooey to crisp to saucy. And because it’s one flat, square tart as opposed to a whole bunch of folded, stuffed, and deep-fried pastries, it’s the kind of thing that’s doable in the hour before your guests arrive.Gurbani’s original recipe makes two 10-inch samosa tarts, which, when cut into small squares, is ideal for a big gathering. But we scaled the recipe down to just one, which easily serves eight people as a party appetizer, or four if you decide to make the dang thing for dinner (have done it and can confirm, it’s a great plan). If you want to work ahead, you can make many of the components—the caramelized onions, potato-and-pea filling, and herby green chutney—a day in advance, and assemble and bake the tart right before you plan to serve. When your guests ask what this magical, flaky, fully loaded dish is, you can go ahead and tell them: It’s a samosa...gone big.Get the Recipe:Samosa Tart With Caramelized Onions and FontinaWhen you're not up for deep frying, bake a samosa's spiced potato filling into a buttery, flaky bed of puff pastry instead.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-14", "author": ["Condé Nast", "Kendra Vaculin"]}