{"id": "d09d97d08d29291d8bfd230267f68acd", "url": "https://www.bonappetit.com/story/misfit-foods", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "Misfit Foods Founder on Quitting a Successful Food Company at the Age of 25 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Started a Successful Food Company in College. By 25, I Had to Quit.My life as an entrepreneur left no space for me to confront my depression.By Ann YangJuly 15, 2019FacebookTwitterEmailIllustration by Clay HicksonFacebookTwitterEmailAnn Yang is the co-founder of Misfit Foods, the company she started in college with her best friend Phil to turn ugly produce into delicious food and  fight climate change in the process. She recently decided to leave the company in order to prioritize her mental health. Here, she reflects on depression, class struggle, and the myths of entrepreneurship.Seven months ago, the stress of being an entrepreneur hit its breaking point and I decided to go to therapy.  On a consultation call, a therapist asked me if I had considered whether or not I was depressed. As someone who has built a career and reputation around being unusually charismatic, I had not.The word “depression” felt heavy and viscous in my mouth. I had misguided stereotypes around what depressed people look like, and I didn’t think I fit very well into them. I really like talking about feelings. I am the unofficial therapist in my social group, the one who can learn the entire life story of the bartender in a few minutes. I felt like if I admitted that I was depressed, my community would think that I wasn’t grateful for all the people and opportunities in my life. I hung up and scheduled another appointment. It was one of the best decisions I’ve ever made.I have depression, but I didn’t know that I had depression. The most important part of the previous sentence is that I didn’t know that I had depression. My life as an entrepreneur had not left space for me to think seriously about my mental health.  And that’s what I want to talk about, how in the mythology of entrepreneurship—the intoxicating idea that you can build things and start things and be liberated from a “normal” day job—can bring on and normalize feelings of loneliness and stress. I’ve since learned that entrepreneurs are 30 percent more likely than the average person to experience depression, and I get why. Ninety percent of startups fail. Even if you’re successful, you’re spending other peoples’ investment money, you’re responsible for the livelihood and paychecks of your employees, and it’s difficult to not let your own self worth fluctuate with the highs and the lows of the company.I have never felt more existentially nauseous and more 25 years old in my entire life.For me, depression was a slow downward slope, punctuated with enough other emotions that I didn’t notice the slide. Last summer, in the sticky heat of August, my co-founder Phil and I decided to stop juice production, our first product line, to focus on products that had a larger impact on people’s diets and the planet. After raising a second round of financing, we moved our company, Misfit Foods, from DC to New York to be geographically closer to our investors and partners. I had just turned 25, and the weird side project that we started in a college apartment was finally taking off.It was a time of transition, a noticeable inflection point during which I began really grappling with growing up in a low-income household and the contours of being a female founder of color. My parents are Chinese immigrants who grew up in the wake of the Cultural Revolution. They came to the United States to go to graduate school and to give me a better future. In a way, their lives as immigrants has been one large and beautiful entrepreneurial project.Money was always tight, but, at school and with friends, I learned to act as if I it weren’t. When I was a senior in high school, I was awarded the Gates Millennium Scholarship, a program created by Bill and Melinda Gates to send high-potential, low-income kids of color to college. My college counselor was surprised when I told her that I met the income requirement to apply for the scholarship; she had always thought of me as upper-middle class. When the local newspaper interviewed me, I was both honored and ashamed; the article meant being public about my families' financial struggle.My complicated relationship with money followed me into my career. It was hard for me to abandon this scarcity mentality and think like an entrepreneur, to dream up bigger possibilities for yourself and the world, far beyond the basic stability that many immigrant parents want for their children. When I moved to New York, I was overwhelmed to learn how many entrepreneurs in my social circles are independently wealthy. I realized that, to succeed, I’d need to change the financial legacy of my family; my earning potential was a game of much higher stakes than many of my peers.  This realization led to deep, intense bouts of anxiety.I was also at odds with my body. I’d struggled with my weight for nearly my whole life until finally, after moving to New York, my doctor identified a metabolic condition that partially explained why my BMI didn’t match my active, vegetable-forward lifestyle. She told me that the stress of being an entrepreneur probably played a large factor in my weight gain and that I needed to slow down. In the next three months, I lost thirty pounds through treatment, and I grappled with how my weight had affected my personality. Societal expectations of Asian-American women would render me porcelain skinned, petite, and quietly thoughtful. I am the opposite, tall, dark, loud, and all breasts and hips. Was I charismatic because I felt like I had to win people over that way instead of with my larger, brown body?Both my brain and my body were telling me that what I was doing was unsustainable and I tried to ignore it for a long time.In retrospect, both my brain and my body were telling me that what I was doing was unsustainable and I tried to ignore it for a long time. I love Misfit. I grew up with the company, and Phil is my best friend. But I knew that my depression was affecting the company and him as my business partner. So over a series of incredibly compassionate conversations, on the phone, over coffee, walking outside, we decided that I needed to leave for the sake of my mental and physical health. I couldn’t drive at top speed and navigate at the same time.Deciding to leave Misfit felt like watching a new family move into your childhood home. Or running into an ex on the street and realizing that their eyebrows scrunch in a way that you don’t recognize anymore. Or hearing a song play in a restaurant and feeling a wave of nostalgia. But it also felt like I was choosing myself, valuing myself enough to work through the things that hurt and become who I wanted to be.I have never felt more existentially nauseous and more 25 years old in my entire life. I sold part of my ownership back to the company so I could financially afford to take a break to rest and reflect. I can be on my parents’ health insurance until I’m 27, so my therapy costs $5 a session as a result. I read a lot of books. I run outside. I cook for friends. I take odd jobs. I travel alone, and I ask myself the uneasy question of how I wanted to spend my day without obligations to anyone else.I have really hard days, but there have been zero moments when I’ve regretted being open about my depression. It’s important to me that people know the real reason why I left my company, even though my closest mentors said I could keep it vague. Talking about my depression has opened up doorways to so many other meaningful conversations. I’ve talked with complete strangers about therapy, with women about overcoming imposter syndrome, with investors about how to better support underrepresented founders. I don’t know what shape my career will take from here, but I no longer believe the myths about entrepreneurship that I once did. I’ve seen the toll that this lifestyle can take on one’s mental and physical health. I’m learning how to fight for and protect those parts of myself, and I hope that, by being honest and vulnerable, I can help others do the same.Explore Bon AppétitHealthyishessayRead MoreLifestyleHow Cooking Made Me See My ADHD as a Talent Instead of a ShameBy Isabelle O'CarrollRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-15", "author": ["Condé Nast", "Ann Yang"]}