{"id": "d0a5e4937f54db171e91c03f22cbe17e", "url": "https://www.bonappetit.com/story/zucchini-doesnt-have-to-be-sad", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "Zucchini Doesn't Have to Be Watery and Sad | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingZucchini Doesn’t Have to Be Watery and SadI cook it down 'til it's the best version of itself.By Adam RapoportJune 18, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Judy ManciniFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.If you’ve ever wondered what to do with all that zucchini piled up at the farmers market, this pasta is what.It’s the kind of dish you really can’t screw up. And it will make all the zucchini haters out there (paging Carla Lalli Music) demand to know how you transformed a relatively bland, somewhat watery vegetable into something so deeply flavorful and—while I really don’t like this word I’m gonna use it anyway—truly unctuous.The trick is to cook down the chopped-up zucchini until it’s almost unrecognizable, or what David Chang might refer to as “ugly delicious.” In the case of this recipe, the more ugly, the more better. (Please see my iPhone photo, below.)Lately, I’ve been describing the texture of the finished dish as “sludgy,” though you may want to follow the lead of Chris Morocco, who developed the recipe, and call it “jammy.” In this age of the jammy egg, everyone likes jammy.Want this letter before it hits the website? Sign up for our newsletter!Garlicky oil and a liberal amount of salt infuse the zucchini (or yellow summer squash) with flavor, while pasta water and grated parm finish it off. I also like to add a knob of butter at this point because, well, butter.In Chris’ recipe, the zucchini takes on depth thanks to a generous amount of fresh basil, another farmers market staple this time of year. But I take my cue from Ruthie Rogers of London’s River Cafe, who cooks a similar dish. She opts for fresh mint, stirring in a handlful while the zucchini cooks down, and then another handful, just before serving, once the pasta is incorporated into the sauce.My only other deviation from Chris’ recipe is timing. Chris calls for about 15 minutes of cooking time for the zucchini; I go for double that. I want my zucchini extra sludgy—excuse me, jammy.Get the recipe:Summer Squash and Basil PastaSautéed squash eventually gets jammy and saucy if cooked long enough, ideal as a way to coat big pieces of pasta.View RecipeExplore Bon AppétitZucchiniPastaAdam NewsletterRead MorecookingThis Marinated Zucchini Situation Is My Favorite Thing About SummerBy Emily SchultzLifestyleThis Sweet and Spicy Grilled Squash Goes Out to All the Vegetarians at the BarbecueBy Aliza AbarbanelcookingThe Kinda-Healthy Kale Pasta I Can Always Count OnBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-18", "author": ["Condé Nast", "Adam Rapoport"]}