{"id": "d0b8c39359dc505223f249db19db5b4c", "url": "https://www.bonappetit.com/story/heads-of-the-table-2021", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Heads of the Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHeads of the TableBy The Bon Appétit Staff & ContributorsSeptember 14, 2021FacebookTwitterEmailIllustrations by Jordan AwanFacebookTwitterEmailI’m not sure how much longer it’ll be normal to say this—or how much longer I’ll even need to—but it’s been a weird year. I’m not talking about 2020, the year that nearly broke the restaurant industry (and all of us). I’m talking about 2021, the Not Yet New Normal. I still do that mental calculation with my mask at restaurants—do I wear it at the table? On my way to the bathroom?—and reading about restaurant openings (and closings) feels like whiplash. And yet it has also been a year of rebuilding, of hard work, of tough conversations, of big change. It flickered as a glimmer of hope in one of the world’s darkest years.It didn’t feel fair—or logistically feasible—to do our annual rundown of America’s best new restaurants after such a weird year. So instead we’re honoring the restaurants, people, and organizations that gave us hope, with a brand-new awards list: Heads of the Table. They are the ones that sprang up (or quickly recalibrated) in the pandemic to help their communities and others in the industry who needed it most. We’re choosing these people and places not because they’re making the best food (though we’d argue that they are and we have recipes that prove it) but because they are giving opportunity to formerly incarcerated people, fighting for fair wages, and feeding their neighbors in personal and respectful ways. It’s inspiring and exciting, and it gives me hope that 2022 will be a kinder, more equitable, more delicious, and much less weird year for restaurants—and the rest of us. —Elyse Inamine, restaurants editor2021’s Heads of the Table:The Legislator: Francesca HongThe Guardian Angel: Restaurant Workers’ Community FoundationThe Second Chance Supporter: Down North PizzaThe LGBTQ+ Hub: UrsulaThe Food Waste Hero: Sullivan Scrap KitchenThe Egalitarian: Reem’s CaliforniaThe Local-est of the Local: Farm ClubThe Hospitality Hero: Lucille’s and Lucille’s 1913The Chinatown Champion: Send Chinatown LoveThe Back-of-House Advocate: No Us Without You LAThe Somm Savior: The United Sommeliers FoundationThe Better World Builder: The LEE InitiativePhoto by Adam HesterThe chef-turned-politician, legislating a more just economy in Madison, WisconsinAs the co-chef and co-owner of Morris Ramen in Madison, Wisconsin, I realized as soon as the pandemic hit that the government had failed the restaurant industry. There were no economic safety nets to catch us or others when our doors closed. Many of my fellow industry folks couldn’t afford the rent anymore; federal support grants were an uncertainty; and making profit was incredibly difficult under stay-at-home orders. We were left largely to fend for ourselves. I knew that something had to change. So I ran for office as a state representative for the 76th district of the Wisconsin State Assembly last year. And I won. —Francesca HongRead Francesca Hong’s essay about how working in restaurants has shaped her agenda in office.Illustration by Jordan AwanA national nonprofit reforming the restaurant industry now and for the futureThe 2016 election led hospitality pro John deBary to think deeply about public policies that could adversely affect restaurant workers. So with his former colleague Alex Pemoulié, he founded the Restaurant Workers’ Community Foundation, which distributes grants to a network of nonprofits aimed at resolving long-standing problems deeply ingrained within the restaurant industry, including mental health, racial injustice, gender inequity, and wage disparity.When statewide shut downs began in March 2020, RWCF raised over $7 million in COVID-19 crisis relief grants for individual restaurant workers and for restaurant operators through zero interest loans. And following last summer’s racial justice movements, it formed the Racial Justice Fund in recognition of grassroots Black- and brown-run organizations already addressing industry-wide inequities. “This organization was founded by restaurant workers who really just wanted to make sure that the industry was hospitable for all,” says RWCF’s new executive director, Kiki Louya. —Angela Burke, writer1 / 8ChevronChevronPhoto by Emma Fishman, Food Styling by Rebecca Jurkevich, Prop Styling by Sophie StrangioPhoto by Isa ZapataGiving formerly incarcerated people a chance to thrive in PhiladelphiaDown North Pizza is about dope food: Detroit-style pizza that’s nostalgic and reminds people of Pizza Fridays as a kid. But it’s also about training, hiring, and housing people like me. I am 35 years old and I have spent 12 years in the penitentiary. No one gives you a crash course into returning to society after that. What I’m trying to do is create a place for our guys to be free, to be who they are. To have a good ol’ time. Sometimes we dance on the line. We know that not everyone will get us, but not everyone comes from where we come from. —Michael Carter, executive chef, as told to Elyse InamineRead about how Michael Carter’s time in prison shaped his perspective on the justice system, and how he’s found purpose in the Down North kitchen.Photo by Emma FishmanA safe haven and creative space in Brooklyn for the queer communityWhen Eric See closed the Awkward Scone in June 2020, he considered leaving New York entirely. “I took a road trip with my dog to figure out my next moves,” he recalls, “but when I came back to Brooklyn, I was buoyed by all the community-building I was seeing during a summer of protest.” He had to stay.In need of cash, See did two pop-ups at Claire Sprouse’s Hunky Dory—but instead of focusing on the baked goods he was known for, See designed a menu closer to home. “I decided to lean into my New Mexican heritage and serve Hatch chile burritos and sopapillas,” See says. His pop-ups were a wild success and soon he was converting a small storefront into a permanent home for Ursula, a New Mexican café named after his grandmother. Soon lines of breakfast burrito seekers were snaking down the sidewalk on any given morning.With buzz building around Ursula, See considered how to pay it forward. “Hunky Dory granted me an opportunity to launch a new business,” explains See, “and I wanted to do that for my queer community.” Starting in February, See invited six LGBTQ+ chefs to stage a pop-up at Ursula, and he was adamant that the guest chefs keep whatever revenue they made since Sprouse did the same for him.The series launched with See’s friend Woldy Reyes, who had lost much of his catering business during the pandemic. “Eric gave me a safe space to test out my concepts and share my food,” Reyes says. Part of that safety stems from the fact that Ursula’s staff is overwhelmingly queer. “I’ve worked in kitchens before that have been highly toxic—transphobic, homophobic,” says Hender Gonzales, who works as a sous-chef at Ursula and also participated in the pop-up series, showcasing the Peruvian street food of their youth. “Eric gave us space to dictate the kind of culture we want.”What started as a six-chef series has become an ongoing project as word about Ursula’s pop-ups spreads. “Ursula is built on the idea of being in community, not just existing within a community,” says See. “Our queerness is rooted in mutual care and support, and we’ll continue to be here for our queer and trans family as long as the need is there.” —MacKenzie Chung Fegan, senior commerce editorGet the Recipes:Picarones With Fig Chancaca Syrup\nTry eating just one of these picarones, doughnut-like Peruvian confections that are drenched in a fig-flavored syrup.\nPhoto by Emma FishmanEric See's Breakfast Burritos\nThis breakfast burrito recipe from Eric See requires shredded hash browns and New Mexico chiles.\nPhoto by Emma FishmanBibingka Waffles\nGlutinous rice flour gives these coconutty waffles (inspired by the Filipino cake bibingka) their delightfully chewy texture.\nPhoto by Emma FishmanPhoto by Justin WalkerA delicious way to fight food waste in DenverTerence Rogers wasn’t always so scrappy. When he started his pop-up turned catering company TBD Foods in 2014, his focus was more on sourcing quality local ingredients than on using them up. But after an internship at Blue Hill at Stone Barns in Pocantico Hills, New York, where he worked with cooks from around the world and learned more about sustainability, his outlook changed. Realizing he could bolster both the environment and his bottom line by using every last bit of his ingredients, he started a weekly sandwich pop-up with leftovers from TBD Foods. His food got such rave reviews that he opened Sullivan Scrap Kitchen with co-owner Holly Adinoff (they’re married) in Denver last summer. “At the end of the day, it’s about reducing food waste, but it’s also about adding more flavor to each dish,” Rogers says. “By taking the time to extract more flavors, it helps out the environment and allows us to put out better food for our customers.” Here he breaks down the leave-no-ingredient-behind ethos in one of his mainstay dishes: the seasonal gnocchi. —Allyson Reedy, writerPhoto by Justin WalkerThe GnocchiRogers sources russet potatoes from Strohauer Farms, frying the skins for nachos and scooping the fluffy insides for gnocchi. He folds leftover or bruised herbs, like fall sage, into the dough for an extra layer of flavor.The Mushrooms“We wanted something substantial and hearty and rich without having meat in it,” Rogers explains. Enter the ’shrooms, sourced from local purveyors Hazel Dell and Mile High Fungi, cold-smoked and seared hard to add a crispy element to the dish; they top the gnocchi, while the stems are thrown into risottos and veggie burgers.The PestoKale leaves may be the star of TBD Food’s kale salad, but its hardy stems shine in this sauce. Rogers dehydrates and grinds them into a flavor-packed powder and also blanches them. Both are blended with roasted pumpkin seeds, confit garlic, olive oil, salt, and a splash of white balsamic vinegar for an unconventional but clever pesto.The Topping“We try to stay away from using microgreens. They’re beautiful, but they go bad so fast,” Rogers says. “So we grate just a little Pecorino Romano cheese and black pepper to finish it off.” When the cheese is used up, its rind adds umami to soup, rice, and grits.Photo by Andria LoTurning restaurant employees into owners in the Bay AreaIn many ways the pandemic was divine intervention. It disrupted my business, so we had to change quickly to keep my employees working and the kitchen open. For years I had been dreaming about transforming my restaurant, Reem’s California, into a worker-owned cooperative. When the pandemic hit I understood the time to change was now.My restaurant has always been about the people, from its employees to our neighbors to the local ecosystem of farmers and vendors. It’s inspired by bakeries I visited in Syria and Lebanon; they were places of refuge for communities experiencing political disruption. But after I opened two locations of my restaurant, I realized I had become a “boss” in the restaurant industry. I was essentially the middle person between the forces of capitalism and workers struggling to survive.So I created Sumoud, a one-year apprentice program for workers at Reem’s California, through a fellowship with Emerson Collective, an organization focused on social change. Sumoud is an Arabic word that means “steadfast resilience,” and is used to describe Palestinians in their struggle to survive and in their resistance to ongoing colonization and erasure. Through this program we bring our own knowledge and experiences of working in restaurants to unlearn the systems that have harmed us and reimagine the kind of industry we want to achieve. With input from community partners, we’re figuring out what collective leadership, participatory governance, and shared ownership looks like in this new era. We’re learning about business growth and self-care through the lens of justice, particularly language justice, which means everyone’s voices and ideas are represented and respected. We have interpreters at all our meetings so people can fully express themselves in the language they feel most comfortable speaking. By next spring my hope is to sell Reem’s to graduates of Sumoud, so they will become founding worker-owners of the restaurant. We hope that Sumoud serves as a catalyst for more restaurants to become worker-owned.The pandemic made me realize I didn’t have to be alone in saving my restaurants. Partnering with my employees has allowed me to build a stronger foundation for the future. —Reem Assil, chef and founder, as told to Nanette Deetz, writerCourtesy Farm ClubThe low-key delicious future of farm to table in Traverse City, MichiganTell you what business not many people are getting into these days: farming. Yet something about sustainability and permanent soil-stuck-in-fingernails drew Nic Theisen to it. He and his wife, Sara, own Loma Farm with restaurateurs Gary and Allison Jonas, and together they opened Farm Club last year (yes, that one) in Traverse City, Michigan. They built a restaurant-market-bakery-brewery that puts the region on the menu, a place for neighbors and tourists to eat the local-est of local food in a laid-back space against the beautiful backdrop of Leelanau County. All employees work a weekly farm shift to get to know the produce they serve—and I hear they even like it. But what makes Farm Club so special is that it takes an arguably pretty bougie concept—farm-to-table—and makes it approachable, low-key, and familial. That means no tasting menu, no waiting list, no ingredients revealed from under a smoking cloche. We’re sitting on a picnic table, looking out at some onion stalks, having a few cold beers while kids kick a soccer ball around. More of this, please. —Alex Beggs, senior staff writerRead Alex Beggs’s full report on the least pretentious farm-to-table restaurant you’ve ever seen.Photo by Emma Fishman, Food Styling by Rebecca Jurkevich, Prop Styling by Sophie StrangioA Houston restaurant (and nonprofit) carrying on the family tradition of hospitality“Master of her craft and fearless entrepreneur.” That’s how chef Chris Williams describes his great-grandmother, Lucille B. Smith, a pillar of her community who was famed for her biscuits and generosity. The desire to be like Lucille is what powers Williams, his Houston restaurant Lucille’s, and his nonprofit that arose out of the pandemic, Lucille’s 1913. Editor in chief Dawn Davis talked to Williams about feeding his community in a personal way and how his restaurant group is growing.You were running a popular restaurant, serving refined Southern cuisine with global influences, when the pandemic hit. What did you do?We knew that a lot of restaurants were going to furlough their team. We kept 99 percent of our staff, but they didn’t want to sit there and chill and get paid. So we started feeding first responders in our neighborhood using profits from the restaurant. The first 20 days or so, we did close to 3,000 meals. Our efforts were met with plenty of gratitude. Then we got the bug.You got the bug to serve your community, like your great-grandmother, which caught the eye of José Andrés and his nonprofit World Central Kitchen (WCK)?Exactly. WCK wanted to feed the community in Sunnyside, which is where a lot of my father’s family lives. The volunteers were giving them Philly cheesesteak wraps, but they weren’t interested. That gave me an idea: I’d design my own menu for 30 days. I’d make them meals that had dignity, meals that spoke directly to their palates. It was as if I were cooking for my own grandparents. WCK funded us for two weeks, and from there we grew organically.Once we started letting customers know that our restaurant profits went toward helping others, we started to see an uptick in business.Now that the pandemic has eased, what are you focused on now?I created Lucille’s Hospitality Group, which includes my nonprofit, Lucille’s 1913. For example, when we could only do outdoor dining in Texas, we offered our huge patio to different bars. They took over our outdoor space, and 100% of the sales (minus taxes and liquor costs) went directly to those bars. We put close to $53,000 directly in their pockets. We ate all the costs, but we were thinking about sustainability and how we can help others—not making a profit.We’ve also started a fermentation lab where we make deconstructed chowchow with cabbage, green tomatoes, and carrots. At the lab, we employ refugees from around the world and teach them culinary skills. And we still do meal distribution on our own and with other organizations such as Beyoncé’s partnership with Bread of Life.Our one-year anniversary for the nonprofit was on August 27, which was also our ninth anniversary for the restaurant. We’ve come full circle.Make Chris Williams’s roast chicken with root vegetables, an homage to how his great-grandmother tirelessly fed her community, and a reflection of his restaurant Lucille’s.Photo by Isa ZapataPhoto by Isa ZapataMaking Chinatown more resilient in New York City“We’re focused on mom-and-pop merchants in Chinatown that are being forgotten,” says Justin McKibben, founder of Send Chinatown Love, a volunteer-run organization that’s helping businesses in NYC’s Chinatowns get back on their feet. Many of these places didn’t have big social media followings, let alone a functioning website. As the world eased into digital living early in the pandemic, they struggled to stay afloat. McKibben asked friends on Instagram if they wanted to help, and began a concerted effort to not just fundraise for these Chinatown businesses but to strengthen them through consulting on business development, such as creating websites and onboarding them onto food delivery apps. So far, their 50-person-plus team has helped 26 restaurants (and other Chinatown businesses) keep their doors open. “They combine their knowledge they have about social media and understanding of English with love and empathy for the community,” says Ruth Li, the co-owner of BocBoc Chicken Delicious in Elmhurst, Queens. “That is very powerful.” —E.I.Hear more from Ruth Li about how Send Chinatown Love helped her business survive.Photo by Dondre StuetleyPutting back-of-house workers firstIn the beginning of the pandemic, all the restaurant GoFundMes were focused on helping front-of-house workers, but not many people were helping workers in back-of-the-house, especially those who were undocumented, who receive no help from the government. They’ve given their lives to the industry, and we felt that we had a social responsibility to help them. We’re going on our 19th month in operation. We’ve been feeding over 1,600 families in Los Angeles, primarily back-of-house workers. We move 160,000 pounds of food every week, paid for by individual donors and foundation grants or donated. We’re going to keep doing this for as long as we can. We’re nothing without our people. —Othón Nolasco and Damián Diaz, founders of No Us Without You LA, as told to Esther Tseng, writerIllustration by Jordan AwanSupporting and strengthening wine professionals across the countryChris Blanchard, treasurer and cofounder of the United Sommeliers Foundation (USF) and Northwest regional manager of Opus One Winery in Oakville, CA: On March 17, I received two phone calls from friends—sommeliers panicked about just being laid off. I texted Cristie and said, “We need to help our community.”Cristie Norman, USF president and cofounder and lead sommelier at Delilah in Las Vegas: I told him we should start a GoFundMe page, and we immediately began calling wineries, as well as other industry connections. We had no idea that this would snowball into The United Sommeliers Foundation.Blanchard: With vice president Erik Segelbaum and secretary Jon McDaniel, our mission is to provide a support network for the sommelier community. The sommelier is the first to get laid off when money is tight—and the last to get hired back. We wanted to provide cash to out-of-work sommeliers to pay for medical bills, rent, gas, groceries, and other basic needs.Norman: Raising $1 million seemed like something unattainable when we first set up USF.Blanchard: But we reached that goal a year after our inception. We’ve been able to help more than 1,000 sommeliers so far with these funds. This organization will be here for the long term; in April we filed for 501(c)(3) status. Our goal for the future is to continue to provide assistance to restaurant wine workers while also giving them career advice and acting as a spokesperson for them so others can understand just how important their work is. They play a key role in a restaurant: They write schedules, handle opening and closing, clear plates, wash dishes, anything that a restaurant needs. It’s been so rewarding. So many folks sent us notes. To help even a little bit is so beautiful and fulfilling. —Interview by Elsie Yang, writerPhoto by Isa ZapataSupporting restaurants, farms, and the next generation in Louisville, KentuckyEdward Lee is the chef-owner of Louisville restaurant 610 Magnolia, and Lindsey Ofcacek is the restaurant’s wine director. The pair had a clear focus when they started The LEE Initiative in November 2017: to connect Kentucky women early in their restaurant careers with established chefs, with the hope of elevating them to future leadership positions. But when the pandemic hit, they immediately expanded its scope. “Chef and I realized really quickly that we had all of these people who work here at 610 Magnolia and all of this food,” Ofcacek said. So they began to support those in immediate need (out-of-work restaurant workers, independent restaurants, and local farms) while continuing to build young cooks of color through the McAtee Community Kitchen (mentee Zyrann Hibbitt and the community kitchen’s chef Nikkia Rhodes are pictured above) and women in the industry into culinary leaders. —Michael Phillips, writerRead Edward Lee’s essay on how independent restaurants are still struggling to find workers and source ingredients—and why he’s still hopeful.More Stories from Heads of the Table:How Michael Carter’s time in prison shaped his perspective on the justice system and gave him purpose at Down North Pizza in Philadelphia.Why Farm Club in Traverse City, Michigan, is the least pretentious farm-to-table restaurant you'll ever visit.When COVID brought NYC restaurants to a halt, Send Chinatown Love helped Ruth Li’s restaurant survive.Restaurants are still struggling, but chef Edward Lee is optimistic about what’s to come.During the pandemic, Francesca Hong went from chef to politician—and she’s not done fighting for food workers.Lead Editor: Elyse InamineCreative Directors: Rachel Lasserre and Michele OutlandPhoto Editors: Tina Anderson, Michelle Heimerman, Dondre Stuetley, Elizabeth Jaime, and Allie WistArt & Design: Alex Madrid and Christa GuerraProduction: Nico AvalleFood Editors: Chris Morocco and Kendra VaculinRecipe Editors: Liesel Davis and Jonathan MilderSocial: Urmila RamakrishnanCopy & Research: Greg Robertson, Brian Carroll, Marissa Wolkenberg, Joseph Hernandez, Akkida McDowell, and Esther TsengSpecial Thanks: Amanda Shapiro, Sonia Chopra, Sasha Levine, Nick Traverse, Meryl Rothstein, and Dawn DavisExplore Bon AppétitRestaurantsCoronavirusFuture of RestaurantsHeads of the TableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "The Bon Appétit Staff"]}