{"id": "d0be5a74ccc04d2812779dc41c45fd4b", "url": "https://www.bonappetit.com/story/5-female-chefs-who-continue-to-inspire-chicagos-food-scene", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "5 Female Chefs Who Continue to Inspire Chicago’s Food Scene | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored5 Female Chefs Who Continue to Inspire Chicago’s Food SceneIn a city turning out some of the world’s most notable cuisine, these female visionaries are leading the charge.By Choose Chicago May 24, 2019FacebookTwitterEmailFacebookTwitterEmailChicago’s reputation as a food city has been exploding for decades. Local chefs who’ve grown up with the city, as well as transplants who’ve put down roots, have been accumulating a steady roster of James Beard Awards and Michelin stars. The buzz around the city’s best this or that reaches far beyond the metropolitan limits, making Chicago one of the most inviting and exciting foodie destinations to visit and explore. That reputation, however, wouldn’t be what it is without the trailblazing women staking their claim in a male-dominated industry. Meet some of the city’s most extraordinary female chefs who are bringing acclaim, innovation, and diversity into the food city that’s proud to have something for everyone.Sarah Grueneberg, MonteverdeChef Sarah Grueneberg | Photography: Matt HaasTexas native Sarah Grueneberg arrived in Chicago to work under Tony Mantuano of Spiaggia (and eventually other powerhouse pasta-makers like Missy Robbins). To further her repertoire of Italian cuisine, however, she wanted to be hands on––in Italy, which is where she had the idea to open a made-to-order pasta place. When she returned, she opened Monteverde with friend Meg Sahs; it has received a barrage of awards since its opening in 2015, including a top 50 finalist among Bon Appetit’s “Best New Restaurants.”Fresh Pasta at Monteverde | Photography: Matt HaasThe beating heart of the space is the pastificio, which translates to “the place where the pasta is made.” Sheets, noodles, and all sorts of shapes are churned out as the team prepares dough, crafts silhouettes, and creates delicate bites, soon to be artfully plated. In 2017, Grueneberg received her first James Beard Foundation Award. Oh, and if you recognize her face, it could be from any number of television appearances, including Top Chef: Texas.Beverly Kim, ParachuteChef Beverly Kim | Photography: Matt HaasChicago native and Top Chef finalist Beverly Kim worked in kitchens for 20 years before she opened her own spot. Parachute, the restaurant she opened with her husband, Johnny Clark, is the result of decades of skill and passion. The couple combined their American backgrounds with Kim’s Korean roots––and included influences from France, Morocco, and China, for good measure––spinning out one of the most eclectic yet familiar, and sought-after dining experiences in town.Bing Bread at Parachute | Photography: Matt HaasParachute has three consecutive Michelin stars, was a Bon Appétit “Hot Ten” pick, and was a James Beard Award winner for “Best Chef: Great Lakes” in 2019. Featuring everything from potato bing bread (which is stuffed with melted scallions and bacon bits, topped with sesame, and served with sour cream-butter) to Nduja and kimchi fried rice with squid, the Parachute menu is just another example of the breadth of Chicago’s top-notch culinary scene.Stephanie Izard, CabraChef Stephanie Izard | Photography: Matt HaasEver since she became the first female chef to win Top Chef in its fourth season, Stephanie Izard has become synonymous with Chicago cuisine. Though the Chicago-area native was raised in Connecticut, attended university in Michigan, and went to culinary school in Arizona, she returned to her birthplace to begin her career. Her first restaurant, Scylla, opened in Bucktown in 2004––before her television debut. Since then, Stephanie has been at the helm of a multitude of ventures: Girl & The Goat, Little Goat Diner, and Duck Duck Goat.Tiradito at Cabra | Photography: Matt HaasHer newest adventure is Cabra, which means “goat” in Spanish. This Peruvian rooftop concept in the Hoxton Hotel is a departure from her usual Chinese and Korean flavors, but with profiles equally as bold. Chef Izard received a James Beard Award for her work at Girl & The Goat.Carrie Nahabedian, BrindilleChef Carrie Nahabedian | Photography: Matt HaasFor 18 years, Carrie Nahabedian’s NAHA, which garnered seven Michelin stars and a James Beard Award, was a mainstay among the city’s top restaurants. Her other acclaimed restaurant, Brindille, is a Parisian bistro which is not only a reflection of her favorite spots in Paris, but has also become known as “a return to chef Carrie’s culinary roots,” serving elevated classics like the buzzed-about dover sole meunière.Dover Sole at Brindille | Photography: Matt HaasThough she’s dotted the globe along her culinary journey, with stints in Atlantic City, Los Angeles, and throughout Europe, it was her hometown to which she returned to open her pièce de résistance. Chicago is also where she got her culinary start, at 17 years old, under the late Fernand Gutierrez at The Ritz-Carlton Hotel. Now Nahabedian and her cousin-turned-business partner, Michael Nahabedian, are in the process of opening another new restaurant. But don’t wait for the reveal to get a taste of Chef Carrie’s cuisine. Brindille’s inventive French fare will not disappoint.Diana Dávila, Mi Tocaya AntojeriaChef Diana Dávila | Photography: Matt HaasAt age 10, Chicago native Diana Dávila was already working in her parents’ taqueria. She began her professional career at her family’s upscale restaurant, Hacienda Jalapeños, and attended culinary school in Oaxaca, Mexico, but she branched out. She worked under Ryan Poli at Butter. She was the first cook, alongside Guiseppe Tentori, at Michelin-starred BOKA.Mushroom Flautas at Mi Tocaya Antojeria | Photography: Matt HaasAfter a stint in D.C. working under Jackie Greenbaum, Dávila returned to Chicago to open Cantina 1910. Now, with Mi Tocaya Antojeria (a term of endearment meaning “my namesake”), she is crafting the Mexican cuisine that was passed down to her through her family––dishes from childhood that lingered in her memory from summers spent in La Huasteca. Bright, bold, and distinct flavors, like those in her signature Peanut Butter y Lengua, are what garnered Antojeria a spot as one of Bon Appétit’s “Top 50 Best New Restaurants.” It’s beef tongue cut into cubes, grilled like a kebab, and topped with an herb reminiscent of cilantro and a sauce of roasted garlic, chiles de árbol, cured tomatoes, with peanuts. Authentic, delicious, and unique––just the way Dávila always imagined it.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-20", "author": ["Condé Nast", "Choose Chicago"]}