{"id": "d0bffd6ee2d8ef83053e0b10f6c6240f", "url": "https://www.bonappetit.com/recipe/tropical-trifle-with-coconut-and-rum", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "Tropical Trifle  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueTropical Trifle With Coconut and RumBy Carla Perez-Gallardo and Hannah BlackJanuary 7, 20205.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThe high-low tension of this very healthyish dessert—fresh tropical fruit and chia seeds paired with dollar-a-sleeve cookies—is peak Lil’ Deb’s Oasis, says co-chef-and-owner Carla Perez-Gallardo. She uses Thai coconut milk brands like Aroy-D: naturally sweet and free of stabilizers.Ingredients4 servings113.5-oz. can unsweetened coconut milk3Tbsp. chia seeds2tsp. granulated sugar½tsp. vanilla extractKosher salt2Tbsp. dark rum2Tbsp. fresh lime juice2Tbsp. light brown sugar2ripe mangoes, cut into pieces2ripe but firm bananas, sliced1star fruit, sliced4oz. Marie biscuits or Nilla wafersPreparationStep 1Combine coconut milk, chia seeds, granulated sugar, vanilla, and a pinch of salt in a medium bowl. Cover and chill pudding until thickened, at least 2 hours and up to 12 hours.Step 2Meanwhile, combine rum, lime juice, brown sugar, and a pinch of salt in another medium bowl. Add mangoes, bananas, and star fruit and let sit, tossing occasionally, at least 10 minutes and up to 1 hour.Step 3Coarsely crush biscuits and divide half among 4 glasses. Top with half of fruit mixture and liquid, then half of pudding. Repeat layers with remaining ingredients.How would you rate Tropical Trifle With Coconut and Rum?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleGreat recipe! Didn’t have Nilla or Marie cookies at home so I substituted them with some roasted pecans and it tasted really nice. Would recommend increasing the amount of sugar in the pudding by 1tsp if you have a sweet toothanushkaiyerSingapore 5/6/2020Made this with gluten free ginger snaps and it was delicious.  I cut up the bananas and mango smaller than in the pic and served one slice of the starfruit on top.  I would have served right away though....the cookies got mushy.  Everyone loved it regardless!  carin1Long Beach, CA1/26/2020Am i missing something or does the pudding not have to be brought to a boil ? Mine hasn't set at all after 12 hours.AnonymGERMANY 1/23/2020DELICIOUS! Subbed pears for bananas and shortbread for the tea biscuits. My new go-to for a simple, not too sweet dessert! Our vegan guests loved it. Great base for whatever fruit combinations you can imagine. AnonymousAustin, TX1/13/2020Explore Bon AppétitFruit DessertDessertCoconut MilkOther IngredientsChiaSeedMangoStone FruitFruitBananaDairy-FreeVeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-07", "author": ["Condé Nast", "Carla Perez-Gallardo", "Hannah Black"]}