{"id": "d0ce1dae28cb440cc15a66001d682418", "url": "https://www.bonappetit.com/recipe/chrissy-teigen-thai-soy-garlic-fried-ribs-recipe", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Chrissy Teigen’s Thai Soy-Garlic Fried Ribs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueChrissy Teigen’s Thai Soy-Garlic Fried RibsBy Chrissy TeigenSeptember 18, 20184.5(3)Read ReviewsTriangleEmailPinterestPrintPhotographs copyright © 2018 by Aubrie Pick. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House LLC.EmailPinterestPrintEmailPinterestPrintMaking ribs at home can be sooooo intimidating. Pretty much every rib recipe involves hours of smoking or slow-baking and, in the end, I’m saying, ‘I could have just ordered these from Uncle Andre’s.’ (That’s one of our favorite L.A. BBQ spots. #nospon #notpaidforthat.) Anyway, enter Pepper Thai with the perfect solution: Fry the ribs! These Thai fried ribs are so easy! Just a few ingredients and a few minutes and you have hot, juicy ribs with a soy-garlic-rubbed Thai twist. Fry some ribs for your next football party. Your friends will leave happy even if the other team scores all the home runs. Reprinted from Cravings: Hungry for More. Copyright © 2018 by Chrissy Teigen. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House LLC.Ingredients2–4 servings1rack baby back pork ribs (12–14 ribs), separated into individual ribs2Tbsp. soy sauce7garlic cloves, finely chopped1tsp. freshly ground black pepperVegetable oil (for frying; about 2 qt.)PreparationStep 1Place ribs in a large bowl. Add soy sauce, garlic, and pepper and toss to coat. Let stand at room temperature.Step 2Heat oil in a large heavy pot over medium-high until a deep-fry thermometer registers 370°. (Or test oil by throwing in a little piece of bread or some breadcrumbs; if they sizzle immediately but aren’t burning, you’re ready.) Working in batches, fry ribs until just cooked and well browned, 3–4 minutes. Return oil to 370° between batches and try to skim out any stray bits of garlic so they don’t burn in the oil and make it taste like burnt garlic.Step 3Transfer ribs to a platter and serve plain or with your favorite hot sauce alongside.How would you rate Chrissy Teigen’s Thai Soy-Garlic Fried Ribs?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangle@siraphyn you can use www.bonappetit.com/recipe/spicy-thai-dipping-sauce/\nIt’s a pretty standard Thai hot sauce, you can also substitute the Thai chili’s for a Product: \nMomoya rayu chili oil with fried garlic \nWhich is really tasty and pretty spicy, that will give you the best “sauce” to match that picture ChicChefAmandaAtlanta, GA 8/28/2020This looks amazing, however those measurements don't equal the amount of \"sauce\" in that bowl. There is a comment for using your \"favorite hot sauce\" but I'd like to know what she uses? It would be great to have the full and actual way she prepares it, including the sauce.SiraphynIrvine, CA9/18/2018Explore Bon AppétitRibsSouthernAmericanThaiSoutheast AsianAsianPork RibPorkMeatQuickMainDairy-FreeNut-FreeKetoDeep-frySuper BowlFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Chrissy Teigen"]}