{"id": "d0e022d559797ca28e2612a150ed8e12", "url": "https://www.bonappetit.com/story/never-fail-green-miso-soup-recipe", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "The Miso Soup Recipe That Can Actually Satisfy Me for Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Only Miso Soup Recipe That Can Actually Satisfy Me for DinnerMost soups have me raiding the kitchen 30 minutes after my last slurp. But not this noodle-y, herb-packed exception.By Sarah JampelFebruary 23, 2018FacebookTwitterEmailFacebookTwitterEmailWelcome to Never Fail, a semi-regular column where we wax poetic about the recipes that never, ever let us down. This week: the miso soup recipe that contributing web editor Sarah Jampel just couldn't live without.I can’t tell you the number of times I’ve laughed friends and loved ones straight out of the kitchen for suggesting I eat soup for dinner. Soup?! For dinner?! I'm laughing right now just thinking about it!While not quite as outrageous as cookies for breakfast, soup for dinner is, for me, always a straight slide to cereal, macaroni and cheese, and popcorn for dessert. After a draining day, I have no faith that soup—especially one that’s, er, mostly water—can replenish what I’ve lost. Soup with dinner? Sure. Soup for dinner? That’s almost as preposterous as a dinner smoothie.Well, I'd like to introduce you to the soup that changed my mind, showed me the light, gave this old dog a new trick. This green miso soup from senior food editor Claire Saffitz has the scaffolding of the classic—dashi, miso paste, wakame—but becomes a full meal with the addition of soba (I see you, starch!), edamame (protein, hello), and so many herbs (a sufficient salad, I’d say). It’s also ready in under an hour, with enough hands-off time that I can take a quick nap as I wait.Dashi, you are not dinner—yet.\nPeden + MunkHere’s how it happens. As soon as I get home from work, I climb on the counter in order to fish the kombu and wakame from the high-up area of my pantry that I call “Seaweeds I’ve Collected Over the Years.” This is the most (and only) physically-taxing part of the whole affair. (If you don’t have a seaweed section, you likely have a much more streamlined pantry than I do. Buy some seaweed: It’ll last in a cool, dark spot in your kitchen for practically ever.)Before I’ve even shed my coat, I get the kombu soaking in water. Since it hangs out there for 25 minutes, I now have plenty of time to change into sweatpants, feed the begging cats, and gather the other ingredients I'll need: bonito, miso, frozen edamame, noodles, and herbs.I’m still 20 minutes away from a flavorful dashi (next steps: adding the bonito, bringing to a simmer, and letting it steep), but I use this as an opportunity to get lost in Instagram prep all the other ingredients: wash and chop the herbs, prep the wakame, which also needs a 15-minute soak, and bring a pot of water to a boil for the soba.A 15-Minute Pantry Soba That's Fancy Enough for CompanyYou could also skip the broth altogether.\nView StoryNow that the dashi is done, and the wakame is plump, all that’s left to do is boil and rinse the soba (this halts the cooking process and washes away the excess starch that would otherwise turn the noodles into a gummy nest), return the strained broth to the heat, and add the edamame and wakame. And—most importantly and satisfyingly—the miso! Our star.Claire, who’s got four other miso soups up her sleeve, recommends mellow white miso (she likes the South River Brand, and I trust her—she makes puff pastry in her free time, for crying out loud). She also has a super smart method for incorporating the paste while avoiding any clumps: Dollop it into a small sieve, then submerge the set-up in the warm soup and whisk until the miso melts through the holes. Any problematic bits  will be caught in the net.These Soft-Boiled Eggs Are the Most Consistent Thing in My LifeSmashed on toast, soy-marinated for ramen, and maybe eaten out of egg cups if I'm feeling fancy.View StoryStir in the herbs, ladle the soup over the soba pile, and there you have it—a soup that actually constitutes dinner. If you are on protein parole, you could add cooked shrimp, silken tofu, a jammy egg, or a fillet of delicately steamed white fish (how dang lovely). This soup would also gladly welcome mustard greens or kale (just spoon the hot broth over top and watch ‘em wilt), sautéed mushrooms, cooked kabocha squash, a squeeze of lime juice, or a splash of fish sauce. Chile oil, why not?Look how far I’ve come! Now here I am, suggesting that you eat soup for dinner. So what if I still ate some popcorn for dessert? But I promise I did not reheat any leftover mac and cheese.Get the recipe:Green Miso Soup With SobaNutty, buckwheat-based soba noodles add some heft to the classic miso broth.View RecipeExplore Bon AppétitMisoJapaneseSoupNever FailDinnerBasicallyRead MorecookingThis Soba Noodle Salad Has Seen Me at My Worst—and Made Me BetterBy Aliza AbarbaneltechniquesDon't Mess Up Miso Soup. Avoid These Common MistakesBy Rochelle BilowRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-23", "author": ["Condé Nast", "Sarah Jampel"]}