{"id": "d0e0106a9a474aaf7bfda9ca4da96dbf", "url": "https://www.bonappetit.com/story/my-kitchen-is-small-but-i-swear-its-mighty", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "First Basically Letter From the Editor | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Kitchen Is Small But I Swear It’s Mighty The very first letter from the editor.By Sarah JampelApril 8, 2020FacebookTwitterEmailPhoto by Sarah Jampel FacebookTwitterEmailEvery week in our letter from the editor, you can read what Basically editor Sarah Jampel is cooking, baking, and ruminating obsessing over. If you want this in your inbox before it hits the site, sign up for our newsletter.Hey Basically readers,I hope you’re hanging in there (that’s my greeting to everyone these days, but I promise I mean it), and welcome to this new newsletter (new-sletter?) from me, Sarah Jampel, the editor of this nook of the internet.Okay, so why a newsletter from Basically now? Like many of you, I’m finding myself in my two-person-absolute-max-capacity kitchen for more hours of the day than ever. It was always the place I spent the majority of my weekends, but now it has a magnetic pull all hours of all days. If I’m not cooking, I’m tidying. If I’m not tidying, I’m washing dishes. If I’m not washing dishes, I’m “wandering through” (that is, deliberately visiting) to “check in” on one of my projects—yogurt setting, sourdough rising, kombucha fermenting, beans/cashews/lentils soaking—and procrastinate answering emails.I’ve griped about the size of the space and the quality of the appliances, but this week, I’m just amazed and grateful for what it has produced. I’m sure some of you are feeding so many more mouths in even tighter quarters. I applaud you. I bow to you!In this newsletter, I’ll cover a range of topics large and small, in the hopes of providing you with ways to put your kitchen (however tiny), your ingredients, and your cascading hours to happy use.Want this letter before it hits the website? Sign up for our newsletter!One Good Tip...You Don’t Need a Salt Cellar, But You Do Need a Salt DishCounter space is precious, but my salt dish earns its keep. If I had to lug a box of salt off the shelf every time I wanted to season something, I’d never do it. With salt available at my fingertips, I’m about 1,000 times more likely to reach for it, making it 1,000 times more likely the food will taste better. Put your salt (kosher, of course) in a plastic half-pint container or a little bowl—you definitely don’t need something special. Whatever the vessel, make sure it’s wide enough that your thumb and first two fingers can grab big pinches.My New Favorite Way to Eat...Sweet PotatoesNo kitchen of mine has ever been too crowded for a pile of nature’s sweet orange (or white or purple) starches. They last forever and I never get tired of finding new ways to eat them. This week, I roasted a bunch whole, then leaned on them for nearly every lunch. For this one in particular, I cut them in half, then seared their cut sides in butter until golden-brown. I dressed them with lime juice, parmesan (weird, I know), Greek yogurt, and dill, the only herb I had.Photo by Sarah Jampel Moment Of Appreciation For...A Good Old-Fashioned Card GameWhenever I need to anchor myself to a room other than the kitchen, my husband gets out the deck of cards, and we dorks play a round or two of 66 (a.k.a. Paderbörnern), a two-person game that’s popular in Eastern Europe. It’s distracting, competitive, strategic, time-consuming, and screen-free (except that we taught ourselves to play by watching YouTube videos). When we’re bored of that, we break out Bananagrams.This Week I’m Going To…Prepare for Passover by covering matzo in copious amounts of butter, sugar, and melted chocolateParticipate in a quarantine recipe exchange, where I’ll email a friend-of-a-friend a recipe and magically receive 36 in return (email me at eatbasically@gmail.com and I’ll loop you in. Or start your own Google doc cookbook)Peel garlic while I’m Zooming for easy access later (thanks for the idea, Christina Chaey)Buy a mask from a company that will donate a mask to healthcare workers, like GIR, Frogmouth, or Hedley and BennettMake scrambled eggs for dinnerSee you here next week!Random P.S.In my house, we’ve been fiercely debating the question of whether banana bread is distinct from banana cake? My husband is convinced we’ve been eating banana cake under the guise of “bread” all along, but I think that banana cake is airier, with a tight, springy crumb, and typically frosted. Send your thoughts to eatbasically@gmail.com.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-08", "author": ["Condé Nast", "Sarah Jampel"]}