{"id": "d0e8c31e2b2d48f020567d4a5a93fdfa", "url": "https://www.bonappetit.com/story/rose-sangria-never-fail", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "I Have to Stop Myself From Drinking Rosé Sangria Like Water | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Have to Stop Myself From Drinking Rosé Sangria Like WaterYeah, you're going to want to double this recipe.By Aliza AbarbanelJune 21, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I found sangria during a dark time. Literally: It was December in Chicago, and my first real winter. In the great tradition of college students improving on cheap alcohol, people were coping with the sub-zero temperatures by spiking boxed wine with bourbon, cinnamon sticks, and orange slices. Think mulled wine vibes, only even sweeter and also cold. I wasn’t a fan.Fast forward to last year, when a pinkish pitcher packed with cucumber slices and mint appeared in the Bon Appétit Test Kitchen. Dangerously drinkable, this was rosé sangria—a far cry from the collegiate version.Kat Boytsova’s recipe steers clear of syrupy-sweet sangria territory not only by starting with rosé instead of a bottle of red or white. She swaps out chopped fruit for refreshing cucumber; replaces warming spices with a tangle of mixed herbs; and tops it off with fizzy citrus soda, which cuts back on the sweetness. Oh, and there’s ½ cup bianco vermouth for an extra kick. I drank an inappropriate amount for 2 p.m. on a workday, then immediately started plotting an occasion to make a pitcher of my own.The opportunity came just a few weeks later, when I was home visiting my family in L.A. It was the perfect scene for sangria: my family was gathering in the sunny backyard with Bossa Nova Civic Club on low in the background. I sliced up a few cucumbers into spears, then smashed one up with a rolling pin to release allll the cucumber juice for maximum spa water vibes. I took an equally aggressive approach with the herbs, smacking a bundle of lemon thyme and mint against the cutting board until the kitchen smelled like an essential oil party. Then everything went into the prettiest pitcher I could find and chilled out just a little less than the recommended 3 hours.I poured the sangria into frosty ice-filled glasses and topped off with a splash of citrusy Limonata and a pretty little sprig of herbs. Even the staunchest sangria skeptics were tempted into trying a glass, and soon the pitcher was drained.Next time, I’ll make double.Let’s all make rosé sangria:Rosé All Day SangriaWe like to think of this refreshing sangria as spa water but with a little buzz!View RecipeExplore Bon AppétitRosePitcher DrinksCocktailSummer DrinksSangriaNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-21", "author": ["Condé Nast", "Aliza Abarbanel"]}