{"id": "d0ecdba539d75ca2b4ddae0f2ab3cf96", "url": "https://www.bonappetit.com/recipe/red-lentil-soup-with-preserved-lemon", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Red Lentil Soup With Preserved Lemon and Crispy Garlic Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRed Lentil Soup With Preserved Lemon and Crispy GarlicBy Zaynab IssaFebruary 14, 20224.4(16)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaEmailPinterestPrintEmailPinterestPrintSimple doesn’t have to mean boring—case in point, this red lentil soup that’s topped with crispy garlic chips and chile-infused oil and that comes together in just about 40 minutes. Preserved lemon, a pantry superstar if there ever was one, adds a brightness that cuts through the rich, stewy lentils. Because preserved lemons can vary in salt and acidity depending on the brand, you’ll want to adjust the amount of salt and lemon accordingly. As for the herbs, dill and basil work especially well in this soup, but you can use any tender herbs you have on hand. And if the toppers feel too involved for a Wednesday night (I get it!), feel free to spoon over a bit of your favorite store-bought chili crisp instead. —Zaynab IssaAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLodge 6-Quart Dutch Oven$115 $80 At AmazonLadle$27 At AmazonSlotted Spoon$13 $10 At AmazonSmall Saucepan$155 At AmazonIngredients4–6 servingssoup2Tbsp. extra-virgin olive oil2medium onions, chopped4garlic cloves, finely chopped12\" piece ginger, scrubbed, finely chopped2tsp. ground cumin¾tsp. ground turmericFreshly ground black pepper½preserved lemon, rinsed, seeds removed, finely chopped3Tbsp. double-concentrated tomato paste8cups good-quality low-sodium vegetable or chicken broth2cups red lentils, rinsedGarlic chips and Assembly2Tbsp. extra-virgin olive oil4garlic cloves, thinly slicedKosher salt1tsp. Aleppo-style pepper1cup torn mixed tender herbs (such as basil, dill, cilantro, and/or parsley), plus more½preserved lemon, rinsed, seeds removed, finely chopped (optional)PreparationSoupStep 1Heat 2 Tbsp. extra-virgin olive oil in a large Dutch oven or other heavy pot over medium. Cook 2 medium onions, chopped, 4 garlic cloves, finely chopped, and one 2\" piece ginger, scrubbed, finely chopped, stirring occasionally, until onions are softened, 6–8 minutes. Add 2 tsp. ground cumin and ¾ tsp. ground turmeric and stir to coat onions. Season with freshly ground black pepper. Add ½ preserved lemon, rinsed, seeds removed, finely chopped, and 3 Tbsp. double-concentrated tomato paste and cook, stirring often, until tomato paste is darkened in color, about 4 minutes.Step 2Add 8 cups good-quality low-sodium vegetable or chicken broth and 2 cups red lentils, rinsed, and bring to a boil, skimming foam from surface as needed. Reduce heat to medium-low, partially cover, and simmer, stirring occasionally, until lentils are very tender and soup is almost creamy, 35–45 minutes.Garlic chips and AssemblyStep 3While the lentils are cooking, heat 2 Tbsp. extra-virgin olive oil in a small saucepan over medium. Cook 4 garlic cloves, thinly sliced, stirring often, until golden and starting to crisp, about 3 minutes; remove pan from heat. Using a slotted spoon, transfer garlic chips to paper towels, leaving oil behind. Lightly season garlic chips with kosher salt. Stir 1 tsp. Aleppo-style pepper into infused oil in pan and set aside.Step 4Remove soup from heat and stir in 1 cup torn mixed tender herbs (such as basil, dill, cilantro, and/or parsley). If soup is too thick, thin with water. Taste and add up to ½ preserved lemon, rinsed, seeds removed, finely chopped, if desired (you may find the soup lemony enough as it is). Season with more salt if needed.Step 5Ladle soup into bowls. Top with garlic chips and more herbs and drizzle over reserved pepper oil.How would you rate Red Lentil Soup With Preserved Lemon and Crispy Garlic?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis was delish. Hearty, interesting, versatile. I make daal a lot so this felt similar to me. I made it almost as written, except double the garlic (duh), and made it in my instant pot (15 high pressure then natural release). I felt like the amount of preserved lemon was just right, not overpowering. Finished with chopped cilantro. Would be good with a dollop of Greek yogurt. KatePortland OR3/9/2022Love all your recipes and have subscribed to the magazine for 30 years. This month's Red Lentil Soup and Spicy Shrimp Scampi are some of the best recipes ever. Your website and videos are wonderful tools, but please, please fix the print capability. For environmental reasons alone, the recipes need to be reduced to fit on only the space they need and actually print–stripping out advertisements, pictures, videos, etc. This is done by other food websites so I know it can technically be done. I'm not the only avid supporter of your magazine who has expressed this opinion. Please help with this problem because it detracts from the professional nature of your website and  from our being able to purchase the ingredients and prepare the new, flavorful BonAppetit recipes! Jan V.Central Pennsylvania3/8/2022I liked this! It was infinitely better after sitting overnight. I do think the preserved lemon flavor got a bit lost in this and would increase it. I didn't find the garlic chips necessary, but really loved the Chilli oil and would double that next time. I only had dill so added some chopped green onion which was great! I'd would also consider mint  as an alternative. My biggest gripe was it was a bit too watery and I would probably reduce the stock to 6 cups next time. Alyssa Carson City, NV3/2/2022I love good recipes like this one but I am surprised when people publishing recipes don’t know that extra virgin olive oil should not be cooked with. If anyone cares about their health, and I would think that people making these good recipes would be amount those people, it’s well known in food science that extra virgin olive oil makes free radicals which are not good for us when heated. Lighter olive oil is what we should cook with, saving extra virgin olive oil only for dipping and finishing off a dish that’s finished cooking, to add a little flavor. I’ve seen this knowledge repeated by Italian cooks on food shows where they are in Italy, so it’s not just American food science that  has published this for quite some time now. Cook with light olive oil for your heath. Save your extra virgin for dressings and dipping.\nAnonymousNJ2/27/2022I was surprised by the level of flavor that this soup had.  I'm used to making Turkish red lentil soup (mercimeck corba), but this seemed to really bring a depth of flavor.  \n\nI didn't have preserved lemon on hand, but diced a quarter of a fresh lemon and salted it, as well as a dried lime instead. \n\nCheese tortillas were a good pairing to make a full meal. Anonymous2/19/2022Explore Bon AppétitDinnerEasyWeeknight MealsSoups and StewsSoupVeganVegetarianDairy-FreeNut-FreeGluten-FreeRed LentilLentilVegetableSimmerMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-14", "author": ["Condé Nast", "Zaynab Issa"]}