{"id": "d0f43258a258e5f23f9f6cdbc67f6776", "url": "https://www.bonappetit.com/story/pepsico-bubly-all-natural-sparkling-water", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "PepsiCo Unveils New Line of \"Bubly\" All-Natural Sparkling Water | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePepsiCo Unveils New Line of 'Bubly' All-Natural Sparkling WaterFeaturing eight fruity flavors and extreme marketing toward millennials.By Andrea ParkFebruary 9, 2018FacebookTwitterEmailPepsiCoFacebookTwitterEmailLife can be tough for millennials who love cracking open a chilled can of seltzer but can't stand the admittedly kitschy watercolor design of LaCroix cans. Fortunately for those sparkling water–loving minimalists, PepsiCo is here with yet another option. This week, the beverage giant unveiled its brand-new line of \"Bubly\" sparkling water, which comes in cheerful, brightly colored cans decorated with rounded minimal text and cartoony bubbles in coordinating colors dotting either end of the can, perfect for the sophisticated seltzer seeker.According to a press release, each can features a \"unique smile\"—differentiated by things like lipstick, mustaches, and stuck-out tongues—and \"personal message\"—\"I feel like I can be open around u,\" \"hold cans with me,\" and \"love at first phssst,\" among others—on the side of the can, and a teeny greeting like \"hey u,\" \"hiii,\" or \"yo\" on the pop tab.  Inside each can is one of eight flavors: limebubly, grapefruitbubly, strawberrybubly, lemonbubly, orangebubly, applebubly, mangobubly, and cherrybubly. The entire line is all-natural, with no artificial flavors, no sweeteners, and no calories.\"We created bubly to provide consumers with a great-tasting, flavorful, unsweetened sparkling water in a fun, playful, and relevant manner that is unlike anything we've seen in the sparkling water category today,\" Todd Kaplan, vice president of PepsiCo's \"water portfolio,\" said in a statement. What, you don't have a water portfolio?PepsiCo's take on seltzer will be available in both the typical 12-ounce can, as well as 20-ounce bottles, and will hit grocery store shelves later this month. Bubly marks the latest expansion of the company's \"water portfolio,\" which began with the 2017 launch of LIFEWTR still bottled water. We're glad they've been consistent with the lack-of-vowels branding, otherwise, how would we know it's hip and modern? No word yet on a partnership with Michael Bublé, but we'll wait. We'll wait.PepsiCoExplore Bon AppétitTrends + NewsSeltzerTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-09", "author": ["Condé Nast", "Andrea Park"]}