{"id": "d1174057e77dc480e27b737f068bd609", "url": "https://www.bonappetit.com/story/how-to-support-restaurants-this-election-year", "year": 2020.0, "month": 11.0, "day": 1.0, "content": "How to Practically and Specifically Help Restaurants This Election Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseHow to Practically and Specifically Help Restaurants This Election YearShoppingBA MarketMerch ShopMoreChevronStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopVIEW THE SERIESElection 2020How to Practically and Specifically Help Restaurants This Election YearFrom building support for the Restaurants Act to amplifying Black-owned food businesses, here are some ways to advocate for the restaurant industry.By The Bon Appétit StaffNovember 3, 2020FacebookTwitterEmailIllustration by Julia DufosseFacebookTwitterEmailThis is one of the most important elections in modern history—one that will have ripple effects in the restaurant industry and beyond for generations to come. Yes, we are still in a pandemic, but there are a lot of ways to mobilize for restaurants this election season. And no, not all of them require picking up the phone and calling strangers. You can work at a polling station, invite friends on a Zoom call to talk about important issues at hand, and more—and there are a number of organizations that will make these actions super easy to do, which we’ve included below and will keep updating throughout the month. It’s never too late to start advocating, and we’ll be right there with you.Know what’s at stake for the industry this election and get involved.Francesca Hong, chef-owner of Morris Ramen in Madison, Wisconsin, and a Democratic candidate running for Wisconsin’s 76th State Assembly District, shares what’s at stake for the restaurant industry this election. Here are five actionable takeaways from Hong:Call your senators and demand they pass the Heroes Act, which now includes the Restaurants Act and will help support over 11 million workers employed by independent restaurants.All of us in the service industry have the opportunity to share our customer service talents at the polls this November—masked up and distanced, of course. Become an official poll worker and take part in ensuring a fair and accurate voting process. Oh yeah, and you get paid!Engagement is the first step to organizing and you can start by signing up to work the voter assistance hotline, which helps folks vote from the convenience of home, and sharing how they can save our industry.Every vote matters. Every vote is critical. Every vote should be counted, but there are leaders in Wisconsin trying to suppress the vote, especially in BIPOC and immigrant communities. The people in these communities are crucial players in the restaurant industry, and it’s important to make sure their voices are heard and keep lawmakers focused on helping independent restaurants build back stronger. Join the state voter protection team and make sure our voices are heard.Understand the needs of your community, then act. Aisha “Pinky” Cole is the founder and CEO of Slutty Vegan ATL, a growing burger chain in Atlanta that draws hours-long lines for its crave-worthy plant-based fast food. Now she’s using her success and platform to care for her community and get out the vote. Below are her tips for making a difference in your own community this election season and beyond:Locate food deserts in your area, then support charities that increase access to healthy, affordable food in low-income areas, like the Food Empowerment Project.Donate to organizations that fund women-of-color-owned food and beverage businesses, like New Voices Fund.Discover, support, and amplify Black-owned restaurants by using apps, like Black and Mobile and Eat Okra.Bank Black—investing in Black-owned banks means investing in Black communities. Black-owned banks offer the same services as larger institutions, but with more one-on-one customer service to guide Black restaurant owners through bookkeeping, payroll, and funding opportunities like PPP loans.Donate to the Pinky Cole Foundation, which funds financial literacy education and mentorship programs for teens and young adults nationwide, helping the fast-food workers of today become the entrepreneurs of tomorrow.Advocate for mental health resources for restaurant workers. Jezabel Careaga, the owner of Jezabel’s Café in Philadelphia, thinks the debate around health care is ignoring a glaring crisis that’s affecting millions in the restaurant industry and beyond: mental health. In this Q&A with Priya Krishna, she explains why it’s hard for restaurants to offer it, what she’s doing to fill in the gap, and what advocacy looks like now—with two clear takeaways for readers: Visit the National Alliance on Mental Illness to learn how to contact your policymakers to advocate for mental health resources. NAMI is not industry-specific, but it is the nation’s largest grassroots mental health organization dedicated to advocacy, education, support, and public awareness so the millions of Americans (and their families) affected by mental illness can build better lives—including restaurant workers.Get certified in the mind-body-medicine program through the Center for Mind-Body Medicine and learn how to help others deal with personal trauma.Join out-of-work restaurant workers as they get out the vote and rebuild their industry. When the pandemic suddenly halted in-person dining, millions of restaurant workers were out of a job, at the mercy of GoFundMe donations and gift card purchases for income. As the country has slowly reopened, some have gone back to work—but many of those who still haven’t are using the time off to mobilize politically. They’re writing letters to voters, text banking, phone banking, and signing up to be poll workers—all emboldened to make change within their industry and to get involved in the election more broadly. For this reported story, Krishna interviewed a number of out-of-work restaurant workers, and here they share specific ways to help their cause:Follow The Chaad Project, an organization rooted in making the Chicago restaurant industry a more equitable place to work. (Lorraine Nguyen)Donate to Fair Fight, an organization started by Stacey Abrams that fights for free and fair elections for all. It is mainly based in Georgia, but its message is spreading nationally at a rapid pace. (Lauren Guild)Check out the League of Women Voters, which has been protecting and helping defend democracy for 100 years. The League works to get resources and information to voters in a nonpartisan way. Head to its website to find information relevant to your voting experience, fund the organization, or join a local chapter. (Vanessa Rao)Donate to Collective Nameless, an organization started by chefs in New York to combat food insecurity around the city, specifically in Black and brown neighborhoods. (Marjorie Nuñez)Support Indigenous farmworkers, who need the restaurant industry as much as the industry needs them.The food industry’s future is at stake this election season, and few are more at risk than farmworkers. First, there’s the pandemic and the susceptibility to infection, with workers living and working in crowded spaces and without access to PPE. Second, a fire season that has become synonymous with the grape harvest season, filling the air with toxic ash and smoke. Third, the election. An overwhelming majority of farmworkers cannot vote because they are undocumented—yet their wages and protections hang in the balance. In this deeply researched story, writer Esther Teng explains how farmworkers, especially Indigenous ones, are affected by this election; how advocacy groups are stepping in to fill the gap; and what actionable steps we can take as diners to help these essential workers: Donate to relief funds that financially support farmworkers, such as the Sonoma County Grape Grower’s Association Farmworker’s Resiliency Fund and UndocuFund.Support Indigenous unions and interpretive groups that provide organizing and language services for Indigenous farmworkers, such as Familias Unidas por la Justicia; Movimiento Cultural de la Unión Indígena; and Centro Binacional para el Desarrollo Indígena Oaxaqueño.Research the Farm Workforce Modernization Act, the bipartisan bill that passed the House of Representatives but has stalled in the Senate. It marks a clear path to citizenship for undocumented farmworkers and expands the H-2A temporary work visa program.Research the Frontline At-Risk Manual (FARM) Laborers Protection Act, which would mandate sick leave and increase hourly hazard pay.Research the Heroes (Health and Economic Recovery Omnibus Emergency Solutions) Act, which would supplement aid to the undocumented workers left behind in the CARES Act and include a $120 billion restaurant revitalization fund.Research the Asunción Valdivia Heat Illness and Fatality Prevention Act, which would provide protections not just for farmworkers but across all occupations when faced with extreme heat on the job.Write the Department of Labor to protest against its H-2A program changes, which include further slashing farmworkers’ wages and reducing labor protections.Explore Bon AppétitRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-07", "author": ["Condé Nast", "The Bon Appétit Staff"]}