{"id": "d11f821b5622ba0f53781c2fb264049d", "url": "https://www.bonappetit.com/recipe/apple-crumble-bars", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "Cheesy Apple Crumb Bars Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSuspiciously Cheesy Apple Crumb BarsBy Sarah JampelOctober 13, 20194.4(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintWhen we were brainstorming our ideal apple dessert, two classic supporting ingredients came to mind. No, not cinnamon and caramel! Sharp cheddar cheese and buttery Ritz crackers. But after trying (and failing) to achieve a cheesy taste that came through even after baking, we had a thought: Why not harness the super-powered cheesiness of cheese crackers instead? Incorporating Cheez-Its into the dough results in a toasty, buttery flavor that your friends will be able to identify as deliciousness, but not necessarily as cheesiness. (Trust us, we did a blind taste-test!) The crisp crust, which also turns into the crumb topping, comes together in the food processor, and a finished slice is as beautiful as a slice of pie—but way easier.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketRound Cake Pan$12.99 At AmazonHeavy-Duty Aluminum Foil$10 At TargetFood Processor$49 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEASmall Bowl$13 At AmazonForkGlass Measuring Cup$19.99 At AmazonLarge Skillet$84 At AmazonIngredientsMakes 12 wedges¾cup (1½ sticks) cold unsalted butter, divided, plus more for pan1½cups (105 g) Cheez-Its1½cups (190 g) all-purpose flour, plus more for dusting¾cup plus 3 Tbsp. sugar, divided¾tsp. kosher salt, divided2large eggs2lb. (about 4 medium) Pink Lady or a mix of Pink Lady and Granny Smith apples1lemon½cup apple ciderPreparationStep 1Place a rack in middle of oven; preheat to 375°. Line a 9\" round pan with foil, pressing it so that it hugs the sides. Leave about 2\" overhang—you’ll use that to lift the bars out later. Grease foil with unsalted butter. (Lining with foil makes it a cinch to lift out your bars for easy slicing. But if you prefer not to use it, butter generously and then cut out wedges straight from the baking pan.)Step 2Make the streusel: Pulse 1½ cups Cheez-Its, 1½ cups all-purpose flour, ¾ cup sugar, and ½ tsp. kosher salt in a food processor until a fine, light orange mixture forms and no visible Cheez-Its remain.Step 3Cut ¾ cup (1½ sticks) cold unsalted butter into small pieces. The easiest way to do this is to slice once lengthwise, then turn butter block on its side and slice lengthwise again. Now that you have 4 long butter columns, keep them stacked and cut crosswise. Cute butter cubes! Add butter to food processor and pulse until pea-size pieces of butter remain. Scoop out 1¼ cups Cheez-Its mixture and set aside—you’ll use this for the crumb topping.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Time to make the shortbread crust: Separate 2 large eggs, placing yolks in a small bowl; reserve whites for another use. (Those yolks are going to give this portion of the dough the moisture and fattiness it needs to come together into a crisp, sturdy base.) Mix with a fork just to break up yolks. Add egg yolks to remaining Cheez-Its mixture in food processor and pulse to incorporate. Continue to pulse in 10-second increments until dough starts to hold together in big clumps (this will take 5–6 increments, and the machine will start to make a different noise when you reach the stopping point).Step 5Scatter dough clumps in prepared pan, using lightly floured hands to gently press it into an even later. Poke all over with the tines of a fork.Step 6Bake crust until dry to the touch and edges are starting to brown, 18–22 minutes.Step 7Meanwhile, make the filling. Cut 2 lb. (about 4 medium) Pink Lady or a mix of Pink Lady and Granny Smith apples around the core into 4 sections each. Lay apple chunk on its flat side and thinly slice (you’re aiming for ⅛\"—but really, the slices should be thin but not paper-thin). You should have 8 cups total.Step 8Juice 1 lemon (you should have 2 Tbsp.) into a measuring cup. Add ½ cup apple cider and remaining ½ tsp. kosher salt and stir to combine.Step 9Transfer apple slices to a large skillet and heat over medium-high (no need to add butter or oil, as the apples are going to release their juices). Sprinkle remaining 3 Tbsp. sugar over and cook, tossing frequently, until sugar melts, about 1 minute. Pour in apple cider mixture and bring to a simmer. Reduce heat to medium and cook, stirring occasionally and gently, until apples are very tender (if you’re using half Granny Smith, those pieces will start to break down) and almost all of the liquid has boiled off (you’ll want 1 Tbsp. or so remaining in the pan), 8–10 minutes. Let cool slightly.Step 10When both the crust and apples are cool enough to handle, transfer fruit and any leftover goop to pan. Spread evenly, then press gently to compact apples (this will make the bars easier to slice and eat). Sprinkle reserved streusel over (for bigger clumps, squeeze the streusel in your hands as you crumble).Step 11Bake bar until topping is firm, toasty-smelling, and darker in color, 35–40 minutes.Step 12Let cool in pan, then use foil overhang to carefully transfer to a cutting board. Using a sharp chef knife or a long serrated knife, cut into 12 triangles. Cover and store in the fridge for up to 4 days.How would you rate Suspiciously Cheesy Apple Crumb Bars?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleCaveats: it’s not apple season, I didn’t have any pink ladies, and I only had Simply Apple apple juice. That said, I really loved how simple and delicious the crust is. It was a hit, although my kid sister described the crust as “burnt Cheetos.” I think pink ladies would make the difference in balancing the sweet and the salty. Also, I only have a 3 cup food processor, so I used a blender to crush the cheezits and incorporated everything else with my hands. It worked perfectly!KalzoneCountAnn Arbor, MI7/10/2020Did anyone else have issues with them being sloppy when they came out of the pan? I cooked\nMine for 45 minutes and they kind of fell apart when I cut themAnonymousNew York5/5/2020This recipe was so yummy and easy to make! The crust definitely holds up well and adds some saltiness to the sweetness of the apples. I used a mix of pink lady and Granny Smith and the apple part was good too--definitely just the right level of sweetness.AnonymousPhoenix, AZ12/11/2019The crumble/crust mixture is delicious and I would honestly eat it on its own. The smell of the crust while baking convinced my wife to try the finished product even though they vehemently hate cooked apples. I do think that someone who is well-versed in cheez-its would be able to tell the crust and crumble contains cheez its because they lend a flavor that you really only find in... cheez its. But I don't think that's a bad thing! Unfortunately, the apples themselves are quite bland. I used 50% granny smith 50% pink lady. They taste like plain apple sauce and the texture is approaching apple sauce as well. If I were to make this again I would give the apples more of an apple pie treatment by macerating them with spices and more sugar than the recipe calls for and then reducing that liquid with the apple cider. AnonymousCA11/16/2019So this recipe is about the crust and the apples --- which is good because I totally forgot to grab the  lemon and cider for the filling. I substituted 1T apple cider vinegar for the lemon juice -- 1/4c Grand Marnier, 1/4c   Havana Club and 1T vanilla (plus a healthy dash of cinnamon - because at this point - why not?!) for the cider and reduced the mixture for significantly longer than the 8-10m suggested ------- but after all that it was delicious and the crust was really the star!\n\n\n\n--- also I used Annie's cheddar squares (slightly more mild and less salty) detroitpaigeMichigan11/15/2019Very easy to make. The apple filling was especially good - half granny smith and half honey crisp (I used a little more than 2 lbs. total). I hoped to taste more of the cheese from the crackers, however, the sugar seemed to overpower it a bit. Next time, I will reduce the sugar in the crust by at least 30%.  Cooked in a 9\" springform pan with the crust on the bottom and sides.  The bottom of the pan was lined with parchment paper that I greased.AnonymousNew London, PA11/11/2019These were just as good as apple pie but without all of the work. \n Perfect amount of salt and I did not find them too sweet. TX11/9/2019Good, but a tad sweet. I’d definitely cut back on the sugar next time.teehansNew York, NY10/24/2019Spectacular! My new favorite way to enjoy Cheez Its. This received rave reviews. The perfect balance of flavors. Will absolutely make again. AnonymousMiami10/21/2019The Cheez-Its pulled me in. Ultimately I didn't really enjoy the final product. Was very rich, overpoweringly sweet. Like the flavors were dialed up to 12.\n\nI might try apples that were more subtle than the tart granny smiths we used. Also, standard crust underneath and cheddar based streusel might dial it back enough to balance it out.Kyle.B3Albuquerque10/21/2019I went out and bought a food processor just for this! Well, sort of. I've been wanting one anyway and this was a great excuse! I love anything cheddar and apple so I knew these were going to be a hit for me. I used a mixture of granny smith and honeycrisp. I'll definitely be making these again!! AnonymousHouston, TX10/21/2019Kezzab,  Cheez-Its are snack crackers with cheese baked in.  Crackers are about 1\" x 1\" (2 1/2 cm x 2 1/2 cm).Matthew Nousakohio10/20/2019I just used a 9\" springform pan with buttered parchment paper on the bottom.  After blind baking the crust, I buttered the sides, added the prepared filling, and baked it on a half sheet of parchment paper (in case it oozed, which it didn't).  Matthew Nousakohio10/20/2019I live in Australia. What are cheez-its?kezzabAustralia Sydney10/20/2019These were fun to make and super tasty! The cheez-its added a nice savory-ness to the crust, and the crust to apple ratio was just right. I definitely recommend using the combination of apples. I used granny smith and honeycrisp (my store was out of pink lady) and it turned out great. The bars didn't last 24 hours in my house, and I'm making it again this weekend!aslockeNashville, Tennessee10/17/2019Explore Bon AppétitCookieDessertBar CookieAmericanAppleFruitFallEasySnackNut-FreeBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-13", "author": ["Condé Nast", "Sarah Jampel"]}