{"id": "d127b46b03d2b2d5e34bfcd695d6903d", "url": "https://www.bonappetit.com/recipe/slow-cooked-halibut-with-garlic-cream-and-fennel", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Slow-Cooked Halibut with Garlic Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueSlow-Cooked Halibut with Garlic Cream and FennelBy Andy BaraghaniSeptember 18, 20183.8(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintWhen garlic is cooked gently in plenty of fat (in this case, cream), it becomes something else entirely—an elegant shadow of its raw self. Tacky cloves go silky and sultry, warm and welcoming. For this recipe, cod and pollock are both great alternatives for the halibut.Ingredients4 servings2small fennel bulbs, fronds reserved, bulbs cut into ½\"-thick wedges8garlic cloves, thinly sliced4cups heavy cream1Tbsp. plus 3 tsp. kosher salt, divided; plus more1½lb. skin-on halibut fillet, patted dry1small lemon½cup extra-virgin olive oilFreshly ground black pepperPreparationStep 1Preheat oven to 250°. Place fennel in a large saucepan wide enough to fit fish comfortably. Add garlic, cream, and 1 Tbsp. plus 2 tsp. salt. Place over low heat and cook, stirring occasionally, until fennel is just tender, 12–15 minutes (do not let cream come to a boil). Remove from heat.Step 2Season fish with remaining 1 tsp. salt. Using tongs, carefully slip fish into pan (it should be mostly covered). Transfer to oven and cook fish, uncovered, until flesh easily flakes with a fork, 18–22 minutes.Step 3While the fish is cooking, finely chop reserved fennel fronds and place in a small bowl (you should have about ½ cup). Cut ends off lemon; discard. Place lemon upright on one end and cut lemon into four lobes, working around the center as you would an apple and leaving core and seeds behind. Finely chop lobes (peel and all) and transfer to bowl with fennel fronds. (You should have about ⅓ cup.) Squeeze juice from core over fennel fronds; discard core. Drizzle in oil and toss mixture to combine. Season fennel oil with salt and lots of pepper.Step 4Break fish into large pieces and divide among shallow bowls. Divide garlic and fennel among bowls and ladle some garlic cream on top; spoon fennel oil over.How would you rate Slow-Cooked Halibut with Garlic Cream and Fennel?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleThis recipe was indulgent, delicious and couldn’t be easier. I will absolutely make this again. I halved the recipe to make for two people; I think you could cook 4 pieces of fish in the same amount of liquid. I had no fresh fennel so used broccoli, yellow squash and fennel seeds and it worked wonderfully. For the topping I used lemon juice, crushed fennel seeds, some fresh dill and olive oil. Definitely agree with the previous comments that the salt in the cream was a bit much but that’s easy enough to adjust next time! anyahdVirginia6/25/2020this is a lovely preparation.  heeding the advice of others, i only used 1 tablespoon of salt in the cream but lightly sprinkled some salt onto the halibut.  i did cut the fennel into smaller pieces than the recipes recommends and even with that i slow cooked it on the stovetop at least twice as long.  the bake time for the recipe seems off as well.  i baked for 18 minutes at 250 degrees but the fish was not even close to being cooked.  i upped the temp to 300 for another 10 minutes and then upped it to 350 for another 100 minutes until it was done.  the end result is delicious though.  the richness of the cream is tempered by the fennel frond and lemon oil.  this is a definite repeater!AnonymousOrange, CA3/31/2020I found this way too salty even after cutting the amount by half.  My suggestions are ( besides cutting back on salt - just taste the fennel cream as it cooks and salt to taste) are: cut fennel into thin wedges (1/2 inch is too thick); add some julienned red pepper to sauce before putting fish in oven ( for colour); use an organic lemon as you are eating the peel; consider including some prawns or other shellfish.\nAlso I would like to add some dry white wine to the cream sauce - does anyone have a suggestion as to how/ when to do this so the sauce doesn’t curdle?Anonymous5/8/2019Tried this out as a way to cook fish that wasn't fry/splatter on the stovetop. It's a nice low and slow method. I read about the salt from other reviews, and did as suggested, limiting it to about 1Tbsp for the whole recipe (though I halved the rest of the ingredients for just 2 servings), and we thought it needed more salt! We ended up salting the cream a lot after the fish came out. The cream is so fatty it really needs some salt, IMO. Anyway, ymmv with salt. I used Diamond Kosher, for what it's worth. I also used Cod, which worked as a nice (and cheaper) substitute. The fennel wasn't cooked enough IMO but I don't think I cooked it long enough at first (my bad)- keep in mind that it won't cook that much more in the oven.  The only thing I wish was different was that the cream was thicker and more sauce-like. I guess I could cook it down after the fish is done, but as is it's very milk-like and while it does coat a spoon it's not very cream-thick. We serviced this over potatoes and you really had to work get some sauce to stay on them. Overall, I'd make this again - can't really go wrong with garlic cream and an easy fish recipe!AnonymousCalifornia3/8/2019Agree w/other commenters re: 3x cooking time and confusion about lemon instructions - used a quarter of a preserved lemon in lieu of salt so can't comment on salt amounts, but I wouldn't risk it as described based on others' experience!AnonymousZurich10/27/2018This was incredibly delicious & lush & would make a show-stopping dinner party entree...with a few cooking notes: the amount of salt really is too much, and that's coming from a salt-lover (who used kosher salt as directed). I served the dish over boiled baby potatoes to mitigate the saltiness, and they, along with fish & fennel were great, but the creamy soup was too salty to enjoy spooned up on its own. Suggest limiting to maximum of 1 tbsp salt for the entire recipe, & trust your instincts. Also it's the fennel more than the fish that's \"slow-cooked:\" poaching fennel in cream at a temperature low enough to forestall the cream boiling took at least 3 times as long to reach tenderness as the recipe suggested. Finally, I don't advise including a short length of stalk when you slice the fennel wedges. It looked pretty in the photo, but those bits of stalk will just never get tender.AnonymousSan Francisco10/18/2018This was delicious, and as another commenter noted, perfect for a keto diet.  I think the fish could very easily be substituted for another, cheaper variety with little difference in the end product, as I found it mostly contributed texture (and protein!) more than any particular flavor when up against fennel and garlic like this.  Concerning the saltiness some readers complained of, I'll admit to just eyeballing it rather than measuring, and it came out perfect for my taste even with adding the salt in all three stages of the recipe, as called for.  I did use kosher salt, and I likely used somewhat less than the recipe called for, but you know your palette better than anyone else, and it's always easier to add more at the end than to take out too much.\n\nSide note: I also had no idea what you were talking about with respect to the lemon.  I just ended up cutting it into quarters length-wise and cutting out the centermost part of the lemon with seeds, then chopping the remainder.AnonymousArlington, VA10/14/2018Just writing this to offset the wise guy who one-starred the recipe twice without even making it. The dish sounds great for this time of year.Anonymous10/14/2018This was a tiny bit too salty for me too (I’d consider halfing the amount called for and adding more back to the finished dish if needed), and took much longer to cook the fish than the recipe stated, but otherwise I loved it. I used 1 pint heavy cream and 1 half and half (because that’s what I had) and the sauce was still very rich and creamy. I’d definitely make this again.AnonymousDenver10/14/2018Then again, if you don't care about health....tomgunnnapa,cali10/14/2018Haven't tried it and real apprehensive- 1qt cream! Halibut $25/#?\nI'm a pro, and I will wait to see other reviews. Sounds like an easy, rich failure- taste and $$ wisetomgunnnapa,cali10/14/2018This is a perfect different and upscale dish especially for someone who eats a keto lifestyle.  I thought the instructions for the lemon were slightly confusing, some pictures would be great.  Otherwise this was delicious.  I put a full tablespoon of Redmond Kosher salt in with the fennel and cream.  I also, based upon another review, salted the fish and the oil without having saltiness issues.  I think you just have to be careful what size your salt crystals are and to remember that Kosher salt is usually bigger.  The lemon in the oil is divine and gives you nice little chewy chunks that burst with lemon flavor as a contrast to the creamy rich garlic cream sauce.AnonymousUtah10/7/2018Yikes. The amount of salt in this recipe was absolutely overwhelming. It overpowered the 8 large garlic cloves that I used, and overpowered the taste of the fennel bulbs. I know it would be delicious if I had added much less. The fish was cooked perfectly, and the fennel oil was very pleasant, however neither myself nor my spouse could get over how salty the cream was. All other flavors were just overrun. \n\nI would very likely make this recipe again, only next time I would cut the salt down to a bearable level.Anonymous9/29/2018Explore Bon AppétitAmericanHalibutFishSeafoodFennelVegetableGarlicOne-Pot MealsMainNut-FreeGluten-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Andy Baraghani"]}