{"id": "d13ace767b2711f24bfcfd3c085fb5ff", "url": "https://www.bonappetit.com/recipe/german-apple-cake", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "Buttery German Apple Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesButtery German Apple CakeBy Olaf KlutkeApril 4, 20184.5(36)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintThis gorgeous cake was unanimously crowned the best of the best from this year’s Readers’ Choice Week recipe submissions. We love the simple method to get that professional shingled look without having to layer each individual apple slice. Make sure the butter is truly room temperature, or it will be difficult to bring the dough together. Read more about the family story behind the cake, which was passed down (in memory! Not written down!) through three generations, beginning with one resourceful German grandmother. It’s also known as Versunkener Apfelkuchen, meaning German apple cake.Ingredients8 servings½cup (1 stick) unsalted butter, cut into pieces, room temperature, plus more for pan¼cup plain fine breadcrumbs⅔cup granulated sugar1Tbsp. finely grated lemon zest1tsp. baking powder1tsp. kosher salt1cup all-purpose flour, plus more for dusting1large egg, lightly beaten1tsp. vanilla extract3Tbsp. apricot preserves3medium, firm apples, such as Pink Lady or Honeycrisp½cup powdered sugar3Tbsp. fresh lemon juiceUnsweetened whipped cream (for serving)Special EquipmentA 10\"-diameter springform pan with removable bottomPreparationStep 1Preheat oven to 350°. Grease bottom and sides of springform pan with butter, then coat with breadcrumbs, tapping out excess.Step 2Whisk granulated sugar, lemon zest, baking powder, salt, and 1 cup flour in a large bowl. Create a well in the center and add egg, vanilla, and remaining ½ cup butter. Using a fork and working in a circular motion, stir until dough starts to form large clumps. Using lightly floured hands, knead very gently in bowl until dough comes together in one large, soft mass (you may need to add a little bit of flour to dough to keep from sticking to your hands).Step 3Still using lightly floured hands, press dough into bottom of springform pan, then press into an even layer with the bottom of a dry measuring cup or mug, sprinkling a little flour over dough if it starts to stick to measuring cup. Spread apricot preserves in a thin layer over surface of dough with a small offset spatula.Step 4Peel and quarter apples. Cut core out of each quarter and arrange apples flat side down on cutting board. Make thin parallel crosswise slices in each quarter, taking care not to cut all the way through so apples stay in one shingled piece. Arrange apple quarters in concentric circles over entire surface of dough, trimming to fit if necessary (you may have a few extra pieces).Step 5Bake cake, rotating pan halfway through, until apples and crust are golden in color, 55–60 minutes (apples will not be completely tender, but that’s intentional). Let cool 15 minutes.Step 6Meanwhile, place powdered sugar in a small bowl. Gradually pour in lemon juice, whisking constantly until a thick but pourable glaze forms.Step 7Remove sides of springform pan. Lightly brush top and sides of cake with glaze. Let cool completely before transferring to a platter. Serve with whipped cream alongside.How would you rate Buttery German Apple Cake ?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleJust removed from the oven, looks great. Will be tasting tonight. A little concerned about the butter/flour ratio. Glad I covered the bottom of the pan with foil. There was some butter residue that oozed out of the spring form pan which would have made for a smokey oven.BeePort Murray, NJ10/8/2021Absolute favorite, recommended by a friend!Susie GiannoniBeacon, New York8/28/2021I saw this cake on Twitter in the middle of a sleepless night and was gratified to see it again in the morning. So, grandbabies all in place for virtual education, I threw this together quickly and easily in the following manner: (1) I buttered my 10 inch springform and dusted it with King Arthur's gluten-free flour then tapped the pan upside down into the sink releasing a lovely dusting of flour reminiscent of the snow we were supposed to see this morning (2) I put a stick of butter in the microwave for 1 minute on time defrost, and set about tossing a cup of King Arthur gf self-rising flour, 2/3 cup sugar, 1 egg, a smattering of lime juice, and a capful of vanilla into a bowl then plopped the perfectly softened butter into the mix and mashed it all together with a fork until it was well mixed, then kneaded it slightly into a ball. It was easy to easy that the softer the butter got, the softer the dough until it wouldn't have been nearly as manageable if Id done it by hand, besides which I thinking the fork method might add a little flakiness. (3) I pressed the dough mixture into the bottom of the pan, then took a large metal spoon and smooth the surface before plunking down 3 tablespoons of orange marmalade on top and smoothe it across the top with the same spoon, which looked very promising. (4) I then scored with my curved paring knife the apples I had peeled, cored, and halved previously (except the last one when I decided it was simpler to just slice away parts as near to the core as possible) and arranged them on the surface, pressing them down slightly atop the batter. Now, as I type this I smell the luscious apple aroma as the cake bakes. I wish I could add photos as I took one before baking and will take another when it is done. I plan to simply dust the top with confectioner's sugar instead of preparing the glaze and serve with whipped cream left over from Thanksgiving's pumpkin pie. Now, we wait for the verdict... [Interlude: with 20-30 minutes left to cook it is so beautiful! The dough has risen around the apples and the marmalade has paled to a thin glaze. Will be checking again in 10 minutes or so to see if I need to cover the top with foil as many reviews mentioned the glaze burns easily.] Never did have to add foil; it was beautifully browned at about 50 minutes. Now dusted and resting... Cut and eaten, \"This is goood!\" said one grandchild. Buttery and flavorful, the flavors mingle delightfully. Start watching 45 minutes in and gauge doneness by browning, not the clock. We will definitely make this one again and again.NanaNashville, TN, home of wondrous Warner Parks and Natchez Trace Parkway11/30/2020Versunkener Apfelkuchen does not mean \"German apple cake\" in German. It means \"sunken apple cake.\"LChicago, IL11/25/2020Cake was delicious but it is very important to put it on a cookie pan as the butter on sides of pan melts and oven starts to smoke and a mess is left to clean up.!   Surprised no one else has mentioned this.Carole Rochester, MN10/22/2020I love this cake! It is really flavourful with the preserves, lemon zest and apples and the texture is amazing too. We ate almost half of it while it was still warm and it was such a delightful treat. BUT: my springform is bigger than 10 inches, so I had to double the amounts to fill it. This was also because the dough turned out extremely soft and sticky, and impossible to kneed or manipulate by hand. I actually liked the height it gave the cake (I feel like only one batch would have made a very thin cake?). Regarding the salted butter debate below: whether or not it is traditional, I (a person who loves salt!) think this cake has plenty of salt as is and wouldn't recommend adding more. I will definitely be making this again, perhaps with a little less sugar and a little less lemon zest, to let the apples' natural taste and sweetness shine more. AnonymousBelgium10/21/2020I followed this recipe almost entirely with a few changes (vanilla sugar instead of vanilla extract, almond flour instead of breadcrumbs because it was all I had to hand - like it was suggested by someone in the comments - and a little less lemon glaze than what was called for) and it is definitely a step up from your standard German Apfelkuchen with the apricot and lemon flavours playing up nicely with the apple (I will say it was still a bit too lemony for me). \nA few things to note, though. I found it impossible to knead this by hand or handle it at all, even though I kept adding flour it remained impossibly sticky, so I would recommend avoiding using your hands altogether. This is especially frustrating when the amount of dough is already so little and it makes for such a short cake. Secondly, when I went to turn the springform around at around the 30 minute mark, the cake was almost done baking, apples already cooked all the way through. And it's also true, as someone said, that the apricot will burn easily, so keep an eye on it or cover the cake and let it continue baking before this happens.AnonymousGermany10/20/2020Love this recipe! Easy and very adaptable. Because of the season I used fresh Rhubarb and Strawberry jam instead, though I think any fresh fruit would work well.  Not too sweet.\n\nNeeded to use the full 60 mins. Make sure to watch the edges, the jam will burn easily.AnonymousPennsylvania6/6/2020I'm not sure what happened, but I took it out of the oven after an hour, and it was almost raw in the middle. I baked it for another 30 minutes, until the outer edge started to almost burn, and the middle was still only just set. I don't think I did anything wrong, and I don't think I've ever baked any cake for 90 minutes, let alone one that is an inch tall. But honestly, it was still so delicious that I will be making it again and experimenting with baking temp and time. AnonymousCanada4/21/2020I made this exactly to recipe and it was freaking delicious. I do think next time I will fan out the apples a bit so they cook more evenly and the cake is easier to serve up without making a mess. But other than that, it's a quick and simple, beautiful cake that tastes amazing. It's sure to impress at a party without stressing you out. Pro-tip I learned on hassle backing - place a chopstick on either side of your apple then slice across. The chops block your knife from going all the way through, allowing you to move a bit quicker. DanniellahT2T 2B811/17/2019My apple tree produces an abundance of little green apples that I wouldn't want to eat plain, but they make great juice and pies. My freezer is full of juice now, so I wanted to make a cake. Being gluten free, I had to substitute gluten free bread crumbs and I used Bob's Red Mill 1 to 1 Gluten Free Baking Flour. I also used Erythritol instead of sugar. This cake turned out great. I will definitely be making this again and again.littleangelOracle, Arizona6/11/2019Marvelous - exactly per the recipe, right down to whipped cream on the side.  Can't imagine making any kind of adjustment.  Needed the full 60 minutes to finish.  Wife and I consumed half of it at one sitting - took extreme restraint to save some for today!  This will be my new \"impress the guests\" desert!  Making another one for Christmas. Dinner.scorpianPhoenix12/17/201855 minutes turned out to be too long for my oven,  I burnt the cake! However, the cake itself was great. It was a lot denser than expected but the lemon zest and vanilla really shine through ( I added vanilla sugar). Would definitely make this cake again!Anonymous12/11/2018Anonymous from San Francisco,\nHave you ever spent any time in Germany? I was born and raised there and came to the US when I was 23. Trust me, my mother was an avid baker and she nor anybody I knew ever used salted butter.Why would you? You can always add salt if you feel the need for it, but no German recipe at the time and before EVER used salted butter! As the other German woman stated.......it wasn't even available. So please cool your ..........and add your salt if you like that. This recipe has extra salt listed, using salted butter too would be too much.Munich,  Germany12/5/2018Anonymous is wrong Germans use unsalted butter we do use less sugar than Americans\nI'm a German immigrant and the first time I had salted butter was in the USA\nsonja17Dallas,Texas via Frankfurt Germany12/3/2018Explore Bon AppétitCakeDessertGermanEuropeanAppleFruitNut-FreeBakingRosh HashanahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-04", "author": ["Condé Nast", "Olaf Klutke"]}