{"id": "d160471e37bfbfc33150ad6cb5243273", "url": "https://www.bonappetit.com/story/tandem-bakery-rye-shortbread-cookies", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "Avoid Sugar Overload and Make Rye Shortbread Cookies from Tandem Bakery  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLooking to Avoid Sugar Overload This Holiday Season? Tandem Bakery Has the Cookie for YouBriana Holt's rye shortbread cookies are just the right amount of savory-sweet.By Sasha LevineDecember 21, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailWe’ve been flipping for Tandem Bakery ever since Andrew Knowlton crowned Portland, Maine, the restaurant city of the year in August. He loved the place so much, he recommended visiting every morning of your trip. There were too many things of baker Briana Holt’s to try: biscuits with jam and butter, black pepper plum pies, chocolate-malt cakes, blue cheese and olive scones, brioche stuffed with kimchi, eggs, and cheddar... At this big-ticket confection counter, it would be easy to miss the unremarkable stack of brown, round coins about the size of your palm. But it would be a mistake if you did.“It took the rye shortbread cookie a long time to catch on,” Holt says by phone, at home with a cup of Kava tea. “I workshopped the recipe hard, as a personal quest to honor my favorite grain. I had to defend it to the death. But I believed in it wholeheartedly. People are sometimes unwilling to try something simple.”Ooooh, the display!\nPhoto by Peter Frank EdwardsHer patience paid off, and the unassuming cookie has its own cult following among bakers, locals, and pastry tourists—those who swoon for its nutty, earthy flavor, nubbly texture, and understated richness. (I can vouch: I hadn’t been at my post at Bon Appétit for one whole week before I started receiving requests to have the recipe tracked down.) It’s the one people bring up the most when she’s out in the wild, Holt says, where people whisper a compliment as if it were a secret handshake. “To me it’s the kind of cookie where you don’t know why you like it, but you just keep eating it,” she says. “It’s not the belle of the ball, but it’s sooooo good.”So good, that we had to get the recipe. And just in time too. Sure the holidays are for colorful sugar and edible glitter, but we’re all for throwing something a little unexpected, and lot less sweet, into the mix too.Photo by Chelsie Craig, Food Styling by Kate BuckensHolt, who has a thing for savory pastries, developed the cookie around her love of rye and its nutty, tangy flavor. “It’s a really old grain that’s used a lot in Nordic and Eastern European cooking, which is a heavy combo of where my people are from,” she says. Pairing the aromatic flour with lots and lots of butter felt like the right way to highlight its best attributes, so shortbread was the obvious answer. To top it off, she rolls the batter in black sesame seeds—“they’ve got this oily richness that adds an extra luxury,” she says.While the bakery uses organic stone ground dark rye flour that’s as freshly milled as she can get it, Holt assures any rye flour will do. They use coarse, stone ground rye flour.  “It allows the nutty flavor of the rye to really shine through while the texture of the cookie is more rustic,” she says. “Finer or more sifted rye will result in a cookie that has more ‘snap’ than ‘crumble.’ It’s a subtle difference.” Most important though, is the butter. She recommends any low moisture, high fat kind you can find (she likes Plugra 84 percent), which helps build both a decadent full-fat flavor and the overall structure of the cookie: Less moisture means more crispness. This is your excuse to spring for the $6 brick, she says. “It’s a time not to skimp!”On the left, baker-goddess Briana Holt.\nPeter Frank EdwardsBut what makes these cookies a true hero during holiday mayhem is that they improve with age. “We bake them the night before. They sit and dry out, and they’re so much better in the morning,” she says. “Shortbread is made to stick around. They’re made to get better.”If their status as a cult classic wasn’t reason enough to jump on the bandwagon wagon, that certainly is.Get the recipe:Rye Shortbread CookiesFor these shortbread cookies, the flavor deepens and the texture improves with time.View RecipeExplore Bon AppétitPortland MaineCookieholiday2018Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-21", "author": ["Condé Nast", "Sasha Levine"]}