{"id": "d16e5876a1ba9c35ca4f2bd2195c7f3d", "url": "https://www.bonappetit.com/story/loving-butter", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "A French Woman's Guide to Unabashedly Loving Butter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA French Woman's Guide to Unabashedly Loving ButterAs a French kid growing up in the U.S, I realized that the language gap was nothing compared to the food gap.By Charlotte PalerminoMay 23, 2018FacebookTwitterEmailPhoto by Danny KimFacebookTwitterEmailEver heard of the saying “feet in two worlds?” Replace feet with stomach and you’ll have a pretty accurate representation of my childhood. I’ve never been either fully French or fully American; I’ve always landed somewhere in between. My sister and I would spend summers on the southwestern coast of France with my mom’s family, and the rest of the year we’d be in New England suburbs with my French mom and second-generation Italian dad.  Along with the language gap I quickly discovered another divide, in food culture.In the US, food was either good or bad. Good foods were generally considered to be low in fat and taste, whereas bad foods were the kind my family regularly ate: cheese, bread, starches, nightshades, eggs. We’d eat vegetables of course, and our food rarely came from boxes or bags. In America, I’d been taught to count my calories and reduce my fat intake at the expense of joy. Staying “healthy,” or, “on trend,” was considered prudent both at school and on my block.In France no one gasped if you ate bread and butter for breakfast and then had some cheese for lunch. No one told you fruit has too much sugar, or that mushrooms are high in carbs. If the conversation around losing weight ever came up it was simple — eat less. No fads, no powdered or canned smoothies, no get-skinny-quick tricks. Food was blessedly uncomplicated.As a kid trying to fit in, I learned to accept “healthy” food at my American friends’ houses with a smile; covertly tossing things I hated, like my mortal enemy, Go-Gurt. At lunchtime, I’d whip out Roquefort and butter tartines, alienating entire lunchrooms and prompting nuns to offer me healthier options, like low-fat tomato soup. Fresh from a trip to France, I was once asked by a friend’s mom asked what I wanted to eat. I joyfully shouted my latest discovery; jambon beurre—a heavenly mixture of cultured butter, baguette, and thinly sliced Jambon (ham) de Paris. Her response? “I can’t believe your mom would let you eat that, it’s so unhealthy.”Claims that my family was unhealthy or destined for cardiac arrest felt like an attack on my mom, me, and a culture I’d grown to love. My mom worked a full-time job, one of the ways I’d get to spend time with her was in the kitchen. To me, she was a magician. She’d take the most ordinary ingredients and transform them into the best things I’d ever eaten. Take flour and butter. You want pastry? Add water. Want a thicker sauce? Cook it and make a roux. Want a sauce that will change your life? Add milk to that roux.In the ‘80s, the USDA released the first of many “dietary guidelines for Americans” firing the first shot on the war on fat. For decades, the USDA kept up the mantra of choosing “a diet low in fat, saturated fat, and cholesterol.” While the intention of the USDA was probably not to hockey stick my intake of Chips Ahoy! 100-calorie packs, that was the result. Fast forward a few decades and the USDA has since reversed many of its recommendations. In their latest handbook, they stepped back from one of their most vehement recommendations—strict limits on dietary cholesterol. Cholesterol, the demon behind all the “bad foods” of my American childhood—cheese, butter, full-fat products—is now no longer a “nutrient of concern.” Neither is coffee (3-5 cups a day), eggs (no limits), or skipping breakfast.As I entered my later teenage years, education around “health” became synonymous with staying thin, which, as we know, isn’t an indicator of health. My “indulgent” eating was the source of constant commentary from peers and strangers. I’d whip out a pizza my dad made the night before at my lifeguarding gig and be informed that I wouldn’t maintain my “figure” with that kind of eating. Relative strangers would whisper warnings to “be careful” with my butter to bread ratio, better yet, just skip it. The only thing that dodged condemnation would be steamed vegetables, a protein bar, or, a 100-calorie snack bag.To me, that logic has always been flawed. To resent food is to deny one of life’s most basic privileges and pleasures. Personally, obsessing over food and its calories doesn’t feed anything other than my anxiety. Like the tiny sunglasses trend, I’m dubious of anything deemed “in or out,” particularly when it has direct implications for my health. One thing I’ve learned is that eating isn’t about being good or bad, it’s about eating, preferably with a group of close friends. I’ve been lucky to eat well and learned how to cook from a young age. I’m not a doctor, but I recommend everyone enjoy the meals they have left, and, pending any allergies, preferably with a side of baguette, cultured butter, and a healthy slice of Roquefort on top.Explore Bon AppétitHealthyishFranceTrendsRead MoreLifestyleWhole Wheat Is No Healthier than White Bread, Food Scientists ClaimBy Ali RosenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-23", "author": ["Condé Nast", "Charlotte Palermino"]}