{"id": "d1753d2f6f2e7969a892bba0c8954410", "url": "https://www.bonappetit.com/story/soy-braised-short-ribs-for-winter", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "I Made Soy-Braised Short Ribs Because It's Still Winter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Made Soy-Braised Short Ribs Because It’s Still WinterBig meat, small sides.By Adam RapoportMarch 12, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelFacebookTwitterEmailThe calendar will tell you that spring starts next Wednesday, but we all know that’s a myth. At least it is here in the northeast, where it’s not uncommon for us to get snow the first week of April.So, when my friends Mike and Missy from D.C. texted last week, saying they’d be in town Saturday night and would we want to get dinner, my mind went to short ribs, a cold-weather favorite that few dinner guests can resist.But I didn’t want to do the same, reliable version I always make; I wanted to try something different. I wanted the Red Wine and Soy–Braised Short Ribs on the cover of the March issue of Bon Appétit.Chef Sohui Kim developed the recipe, riffing on a version she serves at her Brooklyn restaurant The Good Fork. The braising technique is familiar to any home cook—sear the meat, sweat some aromatics, add liquid, see you in three hours.The flavor profile sings of Kim’s Korean-American childhood, of soy and mirin and ginger and garlic. The method itself doesn’t stray too far from my usual recipe, but the flavors got me to think differently about what I wanted to pair with it.Photo by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelI leaned toward a much more banchan-like approach to sides—crisp, bracing vegetable dishes that would complement the richness of the braised beef.Flicking around our site, I immediately targeted the Crunchy Gochujang Fennel. I love fennel, and I couldn’t resist the notion of it slicked with Korean hot chile paste and spiked with ginger, garlic, and toasted sesame seeds.The other day I was watching Samin Nosrat on Salt, Fat, Acid, Heat chop and salt cucumbers to serve alongside her version of soy-braised short ribs, and it got me thinking of our cucumber and celery Tiger Salad, a recurring favorite of mine.Staying within that same flavor family, but wanting something hot, I picked up some beautiful baby bok choy at the market. Just before I brought the ribs to the table, I simply sautéed the bok choy, adding a splash of water to help the vegetables steam while cooking.Alex LauFinally, short-grain white rice, which I somehow almost always screw up. I either make it too mushy or too al dente or too...whatever. This time, I somewhat successfully followed our advice for a pot of perfect steamed rice, but I think I just need to admit that it’s time to invest in a Zojirushi rice cooker.Oh, one last thing about the short ribs. If you have time, make them a day—or at least several hours—in advance. You’ll want to be able to skim most of the fat from the pot, which is a lot easier to do once it has cooled.Don’t worry, the ribs will still be plenty rich enough—no matter what season it is.Get the recipes:Red Wine and Soy–Braised Short RibsCrunchy Gochujang FennelTiger SaladGarlicky Bok ChoySteamed Japanese RiceExplore Bon AppétitAdam NewsletterRead MorerestaurantsGjusta Is My Quintessential, Never-Miss L.A. SpotBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-12", "author": ["Condé Nast", "Adam Rapoport"]}