{"id": "d19430246b0b8aedc76d05735b8ce2ef", "url": "https://www.bonappetit.com/story/how-to-grill-corn-on-the-cob", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "How to Grill Corn on the Cob | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoptechniquesFor the Love of Cob, How Should I Grill My Sweet Corn?A comprehensive guide to buying, grilling, and zhuzhing your summer bounty.By Ali FrancisSeptember 3, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailI love grilled corn so much. Why? Because it’s part of that broad group of foods with natural handles: Bananas! Empanadas! Cookies! Sweet corn is evolutionarily designed to be eaten with your hands, which in these trying times, is pretty much the best thing ever. New me is all about the simple things in life.This summer I traded city living for an extended lake sojourn with my fam and had, well, a lot more time (and charcoal) on my hands. Time to find and buy the best corn! Time to fire up a grill and char those ears into oblivion! Time to painstakingly extract the requisite kernel debris from my teeth! And, importantly, time to research the history of this miraculously sweet and juicy summer delicacy.So, who invented grilled corn? Where did it come from? And how can we make and use our cobs while they’re ripe for the pickin’?The relationship between corn and the Americas goes back millennia, to when it was first domesticated by Indigenous people in Mexico, about 6,600 BCE. Though the exact date is unknown, the first iteration of grilled cobs, elote, was also invented in Mexico. The iconic ears, spread with mayonnaise, Cotija cheese, chili powder, and lime, are now sold all over the country (and beyond) as a portable snack.Indigenous people taught European colonists to grow this native grain, and from there corn spread to pretty much every corner of the globe. In Japan you might find elote-esque, okonomiyaki-inspired cobs: grilled corn slathered with Kewpie mayonnaise, yakisoba sauce, furikake, bonito flakes, and scallions. Blackened ears basted with a garlicky soy paste and a sweet chili sauce are a favorite at night markets in Taiwan. And at street carts throughout India, you can get bhutta, roasted corn on the cob seasoned with lime, salt, and chili powder.There are truly endless ways to customize those charred and beloved kernels. But first: How to grill corn on the cob.All right, let’s go. How do I choose the right cob for the job?The first step on your journey to burst-in-your-mouth grilled corn is all about selection. Here are a few key things to remember:Try to buy locally grown corn. Why? The fresher the cob, the sweeter the kernels. Local corn is more likely to have been recently picked and has definitely spent less time banging around the back of some dusty freight train chugging across the country.Look for fresh husks. Those leafy layers should be green and wrapped tightly around the cob with none of them breaking or falling off.Avoid buying corn with dry silk. I’m talking about the straggly tuft at the top of each cob. It should be glossy. Super dry silk is a sure sign of corn that’s past its prime and so is silk that’s too moist and starting to mold.Feel for ripeness. Run your fingers along the outer husks to ensure the rows of kernels seem neat and tight like...little teeth. Whatever you do, please don’t peel back the husks—that’s a serious farmers market faux pas.Does the variety of corn I buy matter?You always want to buy sweet corn. The good thing is that, assuming you’re shopping at a store or market for humans—and not a livestock supply shop, which sells field corn for animals—you’re good.So, how do I store my corn before grilling?Whoa, hold up. Corn loses sweetness and degrades in quality hella fast. So you’ll want to eat your cobs as soon as possible—like, the day you bring them home. Not up for grilling at this very moment? Store them (husks on!) in the fridge for 5 to 7 days.Okay, okay—I’m ready to grill. How do I cook these suckers?You have a couple of options here, depending on your affinity for draaama (i.e., grill marks). The good news is that neither of them requires soaking (brining you cobs in salty water) and husking (removing the green leafy exterior) is totally optional. So here we go:Option 1: husks onFor that still-juicy, just-grilled smokiness, prep your grill for medium-high heat. Lay your ears (still in their husks!) straight on the grate and grill, turning occasionally, until the outer leaves are evenly charred. This should take around 16 to 20 minutes, depending on your grill model. Want more color? Just loosen those husks slightly before grilling. Don’t sweat it if the leaves get charcoal-colored and brittle—that’s what you want, because they’re protecting the kernels while imparting big smoky flavor. Once the cobs are cool enough to handle, you can pull the husks and silk right off.Option 2: husks offIf it’s high-octane grill marks you’re after, you should know that you won’t get more than a few spots using the aforementioned charring method. But if you refuse to settle for anything less, follow these steps with husked and silked corn. Make sure the grill is smoking hot, then cook the naked cobs (oiled or not is fine) for around a minute per side—long enough to get some color, short enough to retain moisture and c.r.u.n.c.h.How should I dress my juicy cobs?Now for the fun part. The secret to really memorable corn—the kind that can silence an entire backyard of slippery-fingered humans—lies in what you spread on your grilled ears (lol) afterward. While there’s absolutely nothing wrong with slicking your cobs with unsalted butter and calling it a day, lacing a stick or two with herbs and spices before slathering is very fancy and fun! It should go without saying that salt is assumed in all of these combos:Cayenne pepper + fresh chivesCanned chipotle chiles + lime juiceMiso + sesame seedsSpring onions + shichimi togarashi + crushed red pepper flakes6 Tbsp. harissa paste + ½ cup finely chopped mint½ cup finely chopped tender herbs + ½ tsp. finely grated lemon zestWhat if I’m cob averse?My childhood self can commiserate with how not-fun it is to have chunks of corn stuck between your teeth. Luckily for us, cutting char-kissed kernels off the cob is a fine move. Toss them in a choose-your-own-adventure salad. Amp up your corny cacio e pepe with the fresh grilled stuff. Make the best salsa of your dang life, then use it to top your grilled hot dogs. And you can really never go wrong with smoky grits (corn two ways!). Just don’t toss those cobs—save them for corn milk!On a corn kick now? Live your truth:1 / 41ChevronChevronBeef Stir-Fry with Green Beans and TomatoesView RecipeExplore Bon AppétitCornGrillSummerGrill BarbecueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-03", "author": ["Condé Nast", "Ali Francis"]}