{"id": "d1b9b67ac1d06dc4a5ff7037ff508ed6", "url": "https://www.bonappetit.com/recipe/ina-garten-chocolate-pecan-scones", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "Ina Garten’s Chocolate Pecan Scones Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueIna Garten's Chocolate Pecan SconesBy Ina GartenOctober 29, 20183.7(75)Read ReviewsTriangleEmailPinterestPrintPhoto by Quentin BaconEmailPinterestPrintEmailPinterestPrintOkay, I have a thing about scones. When they’re good, they’re light and flaky and full of flavor. Be sure to use really good chocolate that you dice by hand so there are puddles of melted chocolate when you bite into them. And trust me, 4 tsp. of Diamond Crystal kosher salt may sound like a lot but it makes all the difference. Cold bits of butter in the dough ensure flaky scones. When the heat hits the bits of butter, the water in the butter turns to steam and makes the dough rise.Reprinted from Cook Like a Pro: Recipes & Tips for Home Cooks. Copyright © 2018 by Ina Garten. Photographs by Quentin Bacon. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House LLC.IngredientsMakes 14–168oz. coarsely chopped bittersweet chocolate, such as Lindt (about 1½ cups)1cup chopped pecans3Tbsp. plus 4 cups all-purpose flour, divided, plus more for dusting2Tbsp. baking powder4tsp. kosher salt2Tbsp. sugar, plus more for sprinkling1½cups (3 sticks) cold unsalted butter, cut into ½\" pieces1cup cold heavy cream4extra-large eggs, lightly beaten1extra-large egg beaten with 2 Tbsp. water or cream (for egg wash)Special EquipmentA 3\"-diameter round cookie cutterPreparationStep 1Arrange racks in top and bottom third of oven; preheat to 400°.  Line 2 sheet pans with parchment paper.Step 2Combine chocolate, pecans, and 3 Tbsp. flour in a small bowl.Step 3Using a stand mixer fitted with the paddle attachment, beat baking powder, salt, 2 Tbsp. sugar, and 4 cups flour on low speed to combine. Add butter and, with mixer still on low speed, beat until pea-sized pieces of butter remain.Step 4Pour cream into a glass measuring cup, add eggs, and whisk until combined. With mixer still on low speed, pour cream mixture into butter mixture and beat just until blended. Add chocolate mixture and beat just until combined (the dough will be very sticky).Step 5Turn out dough onto a well-floured work surface and knead a few times, dusting with flour so dough doesn't stick to surface, until chocolate and pecans are well distributed. Flour your hands and a rolling pin and roll dough ¾\"–1\" thick. You should see lumps of butter in the dough. Cut dough with 3\" cutter. Place rounds on prepared pans. Reroll scraps, cut out more rounds, and place on prepared pans. Brush tops with egg wash and sprinkle with sugar.Step 6Bake scones, rotating pans top to bottom halfway through, until tops are lightly browned and insides are fully baked, about 20 minutes. Serve warm or at room temperature.How would you rate Ina Garten's Chocolate Pecan Scones?Leave a ReviewTell us what you thinkReviews (36)Back to TopTriangleVery delicious, light, flaky, lightly sweet scones. These turned out perfectly. I used Diamond Crystal Kosher Salt, 4 tsp as called for, and these are not too salty at all. I did also add a tsp of vanilla because I was nervous based on previous reviews. I don’t know if others are using a different type of salt and/or salted butter as well, which made them too salty? If you’d like or are expecting a sugar bomb, these definitely aren’t for you, but we found them to be delicious. LauraSt Paul, MN1/16/2022Great scones. I didn't put enough chocolate in but they were still good. I like that they are not so sweet. STNiagara Ontario. 10/25/2021Thankfully I read the reviews mentioning the saltiness of this, so I only used 1.5 tsp of kosher salt. They came out perfect! Also, I used the 72% cacao Ghirardelli bars, and that was the perfect level of bitterness without sacrificing sweetness. Really liked these. Only docked it a star because I had to doctor it some.CameronWilliamsburg, VA10/19/2021I watched the video with Ina and Carla, so I was aware that these aren’t meant to be sweet. After reading reviews I decided to tweak the recipe. I halved the kosher salt and doubled the sugar as well as did half 60% bittersweet chocolate and half semisweet. I would say that these are more like a delicious biscuit rather than a scone. Super buttery, savory and just a little bit of sweet. I will make these again, but I I think I’d lessen the salt even more, add more sugar, and use semisweet chocolate for all of the chocolate. CandaceEugene, OR9/19/2021I was looking forward to a sweet scone. I should have looked closely at the recipe - that there was very little sugar in there & bitter-sweet chocolate & I went for 78% cocoa - should have gone for a much sweeter chocolate. The scones were flaky, beautiful texture but sadly just not sweet. Will add more sugar next time. AnonymousSouth Africa7/18/2021I tried to leave 1 star but the recipe wouldn't allow anything less than 5. These are way too salty. My mom requested I make them for Mother's Day and was so excited, and we're probably going to have to throw them out. The ingredients in the printable recipe should not simply say \"kosher salt.\" Extremely disappointed.Anonymous5/9/2021These were great! Made exactly as the recipe stated except I did not use the pecans. (Don’t like them).  \nIf you use kosher salt as the recipe calls for its not salty. Do your research on salt people. Kosher salt is lower in sodium than iodized/table salt and doesn’t have that awful taste that table salt has. Salt enhances the all the flavors. Kosher Salt LoverVirginia 4/3/2021Great recipe  I cut salt in half.  Here is a great tip\nFreeze butter and grate with a cheese grater.  I gifted some and was told the were the best they ever had.  Also added vanilla paste and a little extra sugar and large sugar crystals on top of egg wash thank you InaAnonymousTraverse City MI2/7/2021I’ve made enough of Ina’s recipes to know that you only use about 1/3 the amount of salt she calls for, I mean 4 tsp?!!  Anyway these were a decent scone, flakey and crisp but I also agree the amount of butter was too much. TomPhiladelphia PA1/30/2021Texture was fantastic, but I agree with the other comments about the salt. I always make a recipe as is the first time, but I would cut the salt in half!! May try doing a mix of bittersweet and milk chocolate to increase the sweetness. If not for the salt these would have been perfect.Anonymous12/28/2020First, the problem I had :\nI'm kind of a salt fiend. I use exclusively Diamond Crystal Kosher salt. I was really expecting 4 tsp to be the right amount of salt, but honestly, I found them a little salty. By no means inedible, but salty. In bites with chocolate, it was a good amount of salt, but not every bite had chocolate in it, and chocolate free bites were quite salty, and really did remind me of a salty biscuit. The next time I make them, I will either reduce the salt to 3 tsp and add a couple more tablespoons of sugar to the dough, or just add a few more tablespoons of sugar, leaving the salt as written and see which I prefer.  \nThe good: \nThe scones are very light, and come out really nice and flaky. They're very buttery. The sugar and egg wash on top makes a really pretty crust that is nice to crunch through. The tip to rotate the pans is really good. Make sure you use a sharp cutter and flour it. If you don't have a round cutter I would honestly just use a knife and cut squares, because a dull one will compress the layers and make it harder for them to rise. I'll be making them again, but with the salt/sugar balance adjusted to my taste. AbbyRAlabama10/10/2020These were delicious!  It’s kind of sad how many bad reviews there are because they used the wrong type of salt - you MUST USE DIAMOND CRYSTAL KOSHER SALT!!!  The difference in concentration of saltiness varies on the type and brand of salt you use.  For example, 4 tsp. of table salt are going to be MUCH saltier than 4tsp. of kosher or sea salt.  Also, I used 3 bars (2 &1/2 cups) of 70% and 78% cacao Lindt chocolate instead of pecans because I wanted something really chocolatey.  I would recommend putting a GOOD amount of sugar on top of the eggwash because the chocolate was so dark it needed some sweetness, plus there was hardly any sugar in the actual dough.  I would 100000% make these again they were amazing and not too salty or buttery like others have said.Anonymous7/30/2020They were okay, but not the best. Chop the pecans pretty small, otherwise they are just hot and a weird texture when you bite into a fresh scone.lu.s6/26/2020Much too salty, wish I would have halfed the amount of salt and added sugar as a replacement for some sweetness. I was expecting a sweeter scone but instead had a savory, over-salted biscuit. Anonymous4/28/2020I havled this recipe and it came out perfectly! I added diamond crystal salt as directed and didn't find it too salty at all. I used extremely cold butter, cream, and eggs and there was no excessive butteriness or greasiness when they came out. I mixed Lindt 85% and 70% chocolate and sprinkled demerera sugar on top, the end result was a very balanced and delicately sweet. AnonymousWashington DC4/15/2020Explore Bon AppétitSconePastriesDessertChocolateOther IngredientsPecanNutSnackBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-29", "author": ["Condé Nast", "Ina Garten"]}