{"id": "d1bb0022d8a5560aff1d46f064025098", "url": "https://www.bonappetit.com/story/billie-jean-king-dinner-party", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "Billie Jean King’s Dream Dinner Party Has an Open Door Policy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBillie Jean King’s Dream Dinner Party Has an Open-Door PolicyThe tennis star would order Indian takeout and invite…everyone.By Dawn DavisAugust 24, 2021FacebookTwitterEmailIllustration by Joana AvillezFacebookTwitterEmailWelcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.Billie Jean King is familiar with the concept of a small dinner party. In fact, in her new autobiography, All In, she describes hitting with Rod Laver and Margaret Smith as the “real-time version of that party question, ‘If you could have dinner with any three people in tennis history, who would you choose?’” And yet, when I asked her nearly that exact question, she didn’t want to pick just three people. Or rather, she couldn’t. She’s too interested in what makes other people tick to leave anyone out. So welcome, instead, to Billie Jean King’s Dream Open House.I have to ask: When it comes to food, which is best—Wimbledon, the Billie Jean King National Tennis Center, or Roland-Garros?Wimbledon has strawberries and cream and the strawberries are at their best [that time of year]. I always liked [Roland-Garros]. With French food, can you go wrong? Oh, my God, that bread. At the U.S. Open, I’m thinking of the hot dogs.Say you’re hosting your dream party. Who would cook? I don’t cook. And my partner doesn’t cook. But we are champions of takeout. We live in New York City and are very big on supporting small family restaurants. I usually order from Swagat, this local Indian place. I eat there sometimes five days a week. I love the salmon [which is marinated in ginger, yogurt, and garlic] and the cauliflower.Would you do takeout for the dinner party? We’ll choose a private room in a restaurant if it’s business-related. I’ve got the Billie Jean King Leadership Initiative, which is nonprofit, and also Billie Jean King Enterprises, which is for-profit. I want to make lots of money so I can invest it back into communities that need it. But if it’s just for fun, yes, takeout from Swagat at our apartment.What’s the vibe? At home it’s laid-back. We have to work a lot and that’s when you get dressed, wear makeup, the whole nine yards. So this is casual. I love Italian Deruta dishes. I’ve had them forever, in different patterns.If you could only invite three people, who gets invited? Other tennis players?No, I don’t think about players. I think about science. I’d invite Sally Ride. She’s passed now, but she was the first American woman astronaut back in ’83 and a good friend. I love Walter Isaacson’s book on Leonardo da Vinci. Every time I go up on an airplane, I say, “This one’s for you, Leonardo!” Amanda Gorman would be fantastic. Greta Thunberg too. Also Ellen Ochoa. She’s an engineer and the first Hispanic woman to go out in space. Nelson Mandela. And then I tell you, who I absolutely love and I don’t have the courage to call ’cause I’m such a wimp is Nikole Hannah-Jones with her “1619 Project.” That was amazing. The Obamas, Jackie Robinson and his wife, Rachel. My dad played against Robinson in California! And—I have to interrupt you here or else we won’t have room for the other questions. —Bayard Rustin, James Baldwin. And Susan Williams. In fifth grade, she’s sitting next to me and says, “You want to play tennis?” Back then I asked, “What’s that?” Every morning I do a gratitude list, and I always thank Susan.You’ve been a leader in pay equity in sports and a mentor to generations of female athletes. At the dinner, someone asks about leadership style and what traits characterize successful people. What do you say? Relationships are everything to them, they keep learning how to learn, and they are problem solvers and innovators. Traits you have yourself, Billie.Explore Bon AppétitDream Dinner PartyInterviewsCultureRead MorecultureMindy Kaling Would Only Have One Guest at Her Dream Dinner PartyBy Dawn DaviscultureStacey Abrams on the Secret Ingredient to Great CheesecakeBy Dawn DavisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-19", "author": ["Condé Nast", "Dawn Davis"]}