{"id": "d1c8394f3b89edd410892b8c0f81d7a3", "url": "https://www.bonappetit.com/story/bjornqorn-bagged-popcorn", "year": 2019.0, "month": 8.0, "day": 5.0, "content": "All Hail BjornQorn, the (Still) Reigning King of BA’s Office Snack Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAll Hail BjornQorn, the (Still) Reigning King of BA’s Office Snack TableWe’ve got unlimited access to artisanal pastries and Test Kitchen treats, yet this is always the first to go.By Aliza AbarbanelAugust 30, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.In a surprise to exactly nobody, the BA office has a pretty spectacular snack selection. Our snack table—what, your office doesn’t have a designated area?—offers up everything from souvenir seedy rye loaves to Test Kitchen treats, but nothing causes a stir quite like BjornQorn.Made by a Minnesota corn farmer’s son named Bjorn and his liberal arts school roommate (truly, you can’t make this up), BjornQorn is popcorn that’s been popped with solar power and liberally (see what I did there?) dusted with nutty-salty nutritional yeast like some sort of healthyish—but no less potent—Dorito dust. Carla Lalli Music—who’s basically the patron saint of making your own stovetop popcorn—says BjornQorn is the only packaged popcorn worth buying. It even scored a mention in our 2018 food yearbook, a rhapsodic compilation of the best things we ate that year. (And yes, true to form, the PDX/Silver Lake set has long loved it too.)Even after a solid year of showing up in the office, BjornQorn still reigns supreme in our hearts and stomachs, probably because it’s impossible to stop eating after a single handful. I’ve attempted to mimic the stuff at home, armed with a packet of microwavable popcorn and a jar of Bragg’s nutritional yeast, but it just doesn’t compare.The cult status of BjornQorn makes it perfect for picnics, parties, and surreptitious movie theater snacks, which is why I hoard bags at my desk. Still, it’s rare they ever leave the premises. It doesn’t even have to be on the snack table—if someone spots that cheerful yellow logo peaking out of my tote bag, it’s as good as gone.Buy it: BjornQorn, $43 for a dozen 3 oz. bagsAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendSnackHealthy SnacksShoppingproductRead MorecultureI’d Like to Induct Olympia Provisions’ Pepperettes Into the Salty Meat Snack Hall of FameBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-30", "author": ["Condé Nast", "Aliza Abarbanel"]}