{"id": "d1d37148dbaa949ca24914442aee351d", "url": "https://www.bonappetit.com/story/kyoto-coffee-shops", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Kyoto Coffee Shops That Will Turn You into a “Coffee Person” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eatThese Kyoto Coffee Shops Will Turn You into a “Coffee Person”Spots serving up A+ lattes took me to neighborhoods I would have otherwise missed.By Rachel KartenJanuary 23, 2019FacebookTwitterEmailPhoto by Rachel KartenFacebookTwitterEmailI’m definitely not a “coffee person.” I typically don’t go out of my way to try a new shop, or geek out over a specific blend. I drink it to be productive. But on a recent trip to Kyoto, after reading about how stellar the city’s coffee scene was, I decided to be that person. You know, the kind who walks a mile or two for a good cup, cares about whether or not the beans are roasted in-house, and stalks Instagram to see where the locals go. Plus, I knew I was going to be jet lagged as hell and would need it. So I did some research (turns out Japan drinks a lot of coffee), starred a bunch of spots in my Google Maps, and got going. Here are the shops that served up A+ lattes, and brought me to neighborhoods I wouldn’t have otherwise visited.I am a person who takes photos of their latte art now!\nPhoto by Rachel KartenWEEKENDERS COFFEEDown an alley, and through an hourly parking lot you’ll find Weekenders Coffee. If you aren’t looking for it, you won’t find it. But after weaving through some parked cars, you’ll see a white townhouse with its wooden door slid open to a small espresso bar. They roast their own beans (a thing I now care about), and use a La Marzocco for their espresso drinks (a thing I now kinda care about). It’s right near the definitely-worth-visiting Nishiki Market, so plan to hit this spot before or after. But be advised: The coffee shop is closed on Wednesdays and there’s limited seating.Yes, that's the view from the Arashiyama location of % Arabica.\nPhoto by Rachel Karten% ARABICAA small chain with 30 shops across 11 countries (and more in the works), I specifically sought out the location in Arashiyama. Sure it’s a bit outside of the city, but it’s nestled between the Arashiyama Mountains, Ooi River, and Togetsukyo Bridge, and to call it picturesque would be an understatement. There was a line out the door when I arrived at around 10 a.m. (it’s near Tenryū-ji, a UNESCO World Heritage temple, and the Arashiyama Bamboo Grove), and wins the award for “Most Tourists” out of all the coffee shops I visited. But the latte was great, and it properly fueled my day of weaving through selfie sticks.Dream picnic situation at Wife&Husband.\nPhoto by Rachel KartenWIFE&HUSBANDThis spot made me the kind of person who BIKES to a COFFEE SHOP, which feels pivotal to my rebrand as a “coffee person.” The small shop, close to the Kamo River bike path, is Instagram famous (just look at it!) for renting out picnic kits (cute seating included) for customers to take to the nearby river. I opted against this and sat inside their tiny, antique-filled shop instead. The coffee (which they roast in-house) was amazing, but the cheese-and-honey milk bread toast I ordered along with it was one of the most delicious things I ate in Kyoto. Oh, and yes, it’s owned by a husband-wife team.Walden Woods is a decidedly not-cozy coffee shop.\nPhoto by Rachel KartenWALDEN WOODSThe neighborhood around Walden Woods feels quiet and isolated, and for a moment you’ll swear you missed it. But then you’ll see it: A stark white shop that looks like an Apple store selling lattes. Bare and minimalist—downstairs there’s just the bar; upstairs there’s cement, bleacher-like seating with no tables—it’s decidedly anti-cozy, but it serves a mean iced matcha latte.The matcha kakigōri at Pass The Baton is a thing of beauty.\nPhoto by Rachel KartenPASS THE BATONThis is cheating, because I didn’t actually get a latte here, but because this vintage store serves coffee and tea in small shop in front, it still counts. Instead, I showed up for the enormous matcha kakigōri: a mountain of shaved ice topped with matcha syrup and condensed milk. Think fluffy shaved ice with layers of bright, borderline-bitter matcha syrup balanced out by a sweet, thick drizzle of condensed milk. Yeah, more coffee shops should have kakigōri. And probably vintage stores too.Explore Bon AppétitJapanTravelRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-23", "author": ["Condé Nast", "Rachel Karten"]}