{"id": "d1d485a51f85043d31b1ceffc5509a06", "url": "https://www.bonappetit.com/story/flatbread-dinner-ideas", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "If You Have Leftovers and a Flatbread Recipe, You’ve Got Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You Have a Semi-Full Fridge and Some Flatbread, You’ve Got DinnerThousands of flatbreads. Endless ways to top them. Here we go!By Emily SchultzSeptember 14, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Aneta Florczyk FacebookTwitterEmailWhenever I need a quick and easy meal, I turn to flatbread, specifically this yeasted yogurt flatbread. Similar to naan, all it needs is flour, water, salt, yogurt, and yeast and—boom—you’re halfway to dinner. I cook each little round in a hot cast-iron, then top it with whatever is in my fridge. I’ll pile on lemony yogurt and rotisserie chicken, or I’ll use it to scoop up this Persian omelet—because who needs cutlery when you have flatbread? It’s the perfect vehicle for any meal. And there are as many ways to customize fluffy flatbread as there are flatbreads themselves.Flatbread is the all-embracing term describing a wide range of breads that are, you guessed it, flat. The main ingredients are flour, water, and salt. Some are leavened, like pita, but most are not. For their simplicity and versatility, flatbreads are beloved around the world: You can find them baked in an oven or a tandoor (à la naan), fried in hot oil like Native American fry bread, or cooked over heated stones and covered in hot ash like khubz al-jamri, ash bread made in Middle Eastern Bedouin communities.So yeah, there are So. Many. Flatbreads. Which means there are so many ways to make the most satisfying yet simple meal centered around cottony-soft flatbread. So, to keep my meals on point, I asked the pros how they flatbread. (Uh, yeah, it’s a verb now.)Turn It Into Breakfast (or Pizza)“Yep, Indians know flatbread,” says Meherwan Irani, the chef-owner behind Chai Pani Restaurant Group in Asheville and Atlanta. “In addition to five to six styles of naan, there are a myriad versions of parathas, bhakris [millet-flour flatbread usually cooked over an open flame], puris [mini flatbreads that puff up in oil], and a variety of restaurant-style ‘fancy’ breads such as tandoori roti, rumali roti, kulcha, and so on.” The most common flatbread served in Irani’s house is roti, which comes together with some flour, water, and a drop of oil. A quick hit on the frying pan, a smothering of ghee, and a few scrambled eggs is what breakfast looks like on very good days.Another rendition Irani loves to make? Desi pizza, a throwback from his college days: “A flaky paratha is smeared with Maggi ketchup, blanketed in grated Amul processed cheese, and then topped with bell peppers, corn, serranos, and julienned red onions.” After a short stint in a toaster oven, he’s got a nostalgic combo of “sweet-spicy-tangy-cheesy-guilty-pleasure.”Make It the Backdrop for Peak ProduceSkyler Mapes co-owns EXAU olive oil, which produces olive oil in Calabria, so her flatbreads lean Italian. With the help of Gwenyth, her sourdough starter, she makes focaccia or (in a pinch, she uses leftover pizza dough). While the dough is rising, she’ll slice and salt a few cherry or Roma tomatoes, tear up some basil, and let the lot marinate in her olive oil. Then, once the flatbreads are cooked, she’ll top them with her marinated veg. Presto!Go SweetLena Sareini is the former pastry chef at Selden Standard in Detroit, so of course her flatbreads walk the line between sweet and savory. “I live for the classic combination of tangy labne; a seasonal fruit preserve, such as apricot; and a sprinkle of za’atar and sea salt!” she says. If Sarieni is feeling festive, she’ll also drizzle her flatbreads with olive oil and pomegranate molasses for a flavor combo she just “can’t get over.” Oh, and her flatbread of choice is a special pita–naan hybrid that ferments for 24 hours to develop a lot of flavor before it’s baked in a wood-fired oven.Explore Bon AppétitFlatbreadRead MoreWhole Wheat ChapatisGrilled Naan and Tomato PartyMan'oushe with Za'atar Oil, Tomatoes, and CucumberRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-14", "author": ["Condé Nast", "Emily Schultz"]}