{"id": "d1d8d8e72942322e9836858a5221e938", "url": "https://www.bonappetit.com/story/how-to-beat-a-hangover-chicago-style", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Amanda Shapiro On How to Beat a Hangover, Chicago-Style | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Beat a Hangover, Chicago-StyleA dispatch from the morning after Superpowered Chicago.By Amanda ShapiroJuly 19, 2018FacebookTwitterEmailGiant's onion rings with chili salt and parmesan. Photo by Alex LauFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Hi from Chicago,Where I'm still swooning—and nursing the teensiest hangover—from last night's Superpowered dinner at Mott Street honoring Ashley Novoa and the Chicago Period Project.This dinner felt particularly special because of all the amazing women it brought together. Besides Ashley and chef Bridget Vanaman, of course, there was Ashley's sister-in-law Shelby Allison who happens to be the founder of a super cool platform for women in the beverage industry called Chicago Style. Her team brought in a fun and amazing sommelier, Danielle Norris, to do wine (and sake!) pairings. Homecoming panelists and Chicago ladies-about-town Abena Boamah and Lauren Ash showed up in style. And Tania Cordova, from the Transformative Justice Law Project, spoke movingly about her mission to overturn stringent name-change laws in Illinois, which prevented her from fully transitioning for over 12 years.I probably definitely didn't need that last frozen cocktail at Lost Lake, but I've found that AM runs are the best cures for PM indulgences. I hopped on a bike share and got myself to the Lakefront trail, where I ran a liiiittle further than I meant to. Luckily Cellar Door Provisions was there for me in all my sweat-streaked, red-faced glory. Turns out that roasted apricots with labneh and a couple of masa dumplings in berbere sauce are also good hangover cures.My last stop is Giant later tonight, where I'll be closing out my trip with a a plate of marinated zucchini...and an order of onion rings. Chicago, I like like you.Until next week,Amanda ShapiroHealthyish editorP.S. Have a healthyish thought, wish, or desire? Email us: healthyish@condenast.com.Explore Bon AppétitHealthyish NewsletterChicagoessayRead MorecultureIf you're not putting food in your hair, are you really LIVING?By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-19", "author": ["Condé Nast", "Amanda Shapiro"]}