{"id": "d1e0638453f0298887917e07e42b1a51", "url": "https://www.bonappetit.com/story/flower-essence-therapy", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "How I Got Into Flower Essence Therapy (And What It Even Is) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I Got Into Flower Essence Therapy (And What It Even Is)I went peak 'woo' and it paid off.By Adriana VelezAugust 7, 2018FacebookTwitterEmailIllustration by Fran CaballeroFacebookTwitterEmailFlower essence therapy is about as woo as you can get. It involves not actual flowers but their essence. That essence helps you open yourself up to messages and insights that are there in plain sight, you just have to get out of your own way to understand them. See what I mean? Woo as F. But, as someone who speaks often with my houseplants—out loud—flower essence therapy makes some kind of sense to me. Plants are living things with constantly transforming energy: propagating, germinating, shooting up, blossoming, dying, decomposing, starting over again.I’ve been going through a transformative growth period myself. I’m about to get married for the second time. I’m changing careers, altering my parenting strategy for my suddenly teenaged son and managing my shifting hormones. With so much movement in my life, I felt like I needed a new way to ground and understand myself, this new person I’m becoming. So, at the suggestion of a trusted and well-grounded friend, I reached out to Aki Baker at MINKA Brooklyn, a center for healing and holistic living. Aki practices reiki, is an integrative spiritual coach...and a flower essence therapist. I went to see her at the beginning of this year, not knowing what to expect.We began with a reiki session to center me (i.e., help quiet my monkey mind so I can be present). The flower essence therapy started off very much like traditional therapy, except we sat on colorful floor cushions and sheepskin. Aki and I talked about what was going on in my life.This is my second marriage, and at midlife it’s a commitment made with wild optimism. My partner and I are complicated people with heavy baggage, and nothing dredges up your issues like an impending wedding. So my optimism had been dancing with fear, anxiety, and doubt.What would the flowers reveal? Aki lay out a set of cards, each with a photo of a different flower. Then she had me look them all over. “Pretend you’re at a party,” she prompted. “Which flowers do you want to have a conversation with? Which flowers do you not want to talk with?” Situations like this bring out the overthinker in me. But I was relaxed from the reiki. I breathed and chose the images that most appealed to me, and those that seemed, for some odd reason, repellent. These choices were surprisingly clear.Aki gathered my choices and told me a story about the flowers. Much like tarot cards, each flower is associated with certain traits. Rock water, for example, is all about being more flexible, spontaneous, and going with the flow, while dune primrose is about mothering myself and feeling gratitude for maternal influences in my life. The flowers I was averse to may represent issues I’m avoiding but need to address.Aki put droplets of essence from my flowers—both the friends and the foes—into a bottle. (Flower essences are typically made by soaking flowers in distilled water.) I was to take four drops of this concoction four times a day until I ran out.While taking the flower essence, I was supposed to pay attention, to look out for subtle changes or messages, synchronicities, shifts in relationships, solutions to problems, and meaningful dreams.Even for someone who’s not particularly woo, these regular nudges to be mindful and to focus on specific themes were a powerful cognitive exercise. Little by little, those flower essences began to infuse my relationship with my partner—sometimes in scary, uncomfortable ways.During a month when I was working on speaking my truth and maintaining my boundaries—taking yarrow (self regard), centaury (saying “no”), and scarlet monkeyflower (speaking my truth), my partner and I started arguing more. It was like I was stress-testing our relationship. How much truth could he stand to hear from me? How much truth could I bear to hear from him? We started seeing each other more clearly, revealing what we’d been protecting all these years. I worried that our relationship wouldn’t survive.Next session, I shifted my focus to trust—specifically trusting myself more—with aspen (confidence in meeting the unknown), star tulip (inner intunement), and scotch blossom (optimism for the future). I became more aware of how hyper-vigilant I am over any threat to my ways of doing things. I tried an experiment, acting as if there were no threats. There were no looming disasters. We argued less, and the conflicts we did have passed over quickly like thunderstorms.Following a third session with almond (connecting with a source of light), cherry blossom (joy and openness), and wild rose (life force and more joy), I leaned into a new lightness in my relationship and my life in general. I saw more fruitful placements for setting boundaries—like around my time. I saw how those boundaries created more space for freedom, agency, and joy. Spring came and I was suddenly drawn to the scent of roses, which were everywhere. I fell in love with my partner again.By midsummer, we were back in tumult.It started with some teenage shenanigans my son got into that triggered an explosive conflict between my partner and me. Our murkiest, most difficult issues rumbled up to the surface like terrifying sea monsters, forcing us to deal with them all before the big day. And by “our” I include my son, too. My parenting, my partner’s step-parenting, my son’s growing pains, our ways of handling conflict, our fears, our defenses: I wasn’t sure our little three-person rowboat of a family would make it this time. We were a month away from the wedding. I called out an SOS to Aki.“Hadn’t I dealt with this a few months ago?” I asked her. “Hadn’t I already faced what I needed to face, seen what I needed to see?”But that’s the nature of this kind of work. Aki describes it as peeling an onion. You’re always working your way deeper. Sometimes you need a less-direct route to get there. Sometimes you run over the same ground but in a different way. And that’s exactly what I was doing—what we were doing.In the time between reaching out to Aki and our next session (via Skype this time), my partner and I resolved our conflict. Now I’m seeing our limitations and weaknesses more clearly, and they are formidable. But I also realize we already have everything we need to move forward: clearer sight and a willingness to stay with discomfort and conflict and keep working together.After our session, Aki sent a new bottle labeled “Grounded Knowing” with cerato (intuition), columbine (radiance), and clematis (focused presence). Maybe, in the end, I didn’t need flower essences to rescue my relationship and save the wedding. But I’m taking them daily still because the ritual keeps me mindful, and that’s a quality I’ll continue to need.Explore Bon AppétitHealthyishTrendsRead MorecultureAshwagandha Couldn't Cure My Burnout Lifestyle—Here's What DidBy Adriana VelezRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-07", "author": ["Condé Nast", "Adriana Velez"]}