{"id": "d1e45295915a088e6f76a5726179e6e8", "url": "https://www.bonappetit.com/story/dumpter-diving-doughnut-bread-pudding", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "When Life Gives You Too Many Doughnuts, Make Day-Old Doughnut Bread Pudding | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen Life Gives You Too Many Doughnuts, Make Day-Old Doughnut Bread PuddingWe can all thank my “freegan,” dumpster-diving, liberal-arts-school friends for this one. By Amiel StanekOctober 16, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Pearl JonesFacebookTwitterEmailBon Appétit editor at large Amiel Stanek has spent years trying to help readers get dinner on the table as quickly and efficiently as possible. So when he gets to cook for himself, he likes to slow things down and be a little...extra. This is Not So Fast, a column dedicated to his favorite ingredient: time.My favorite ingredient is anything I have too much of. Necessity may be the mother of invention, but sometimes “necessity” is the product of abundance, not scarcity. A cardboard box brimming with tomato seconds from the farmers’ market. Fall apples piling up at the base of a friend’s tree. The black trash bag full of day-old doughnut your housemate dragged out of the dumpster and deposited in your kitchen. I love the urgency that toomuchness inspires, the need to cook and experiment and deal with it all right now—and to gather all of your friends for a giddy, impromptu feast, because lord knows you can’t eat it all yourself.\nOkay, yes, I’ll get back to the dumpster doughnut bit. When I was in college, I knew a lot of kids—punks, burners, and Greenpeace types alike—who did a lot of dumpster diving. For the uninitiated, this semi-legal activity usually entails rooting around in the garbage behind food businesses in search of items that, while “perfectly good” (a subjective term), have been discarded for reasons that range from the somewhat-sensible to the absurd.As such, it wasn’t uncommon for someone to walk into the communal area of a co-op or group house and upend a backpack full of free food—barrels of cheese puffs that were a day past their sell-by dates, dented containers of hummus, entire cakes that had been in the bakery case a day too long—before a hungry hoard of (probably stoned) college students. And when one friend in particular discovered that a certain national doughnut and coffee chain always deposited their unsold pastries into clean bags separate from all the other refuse and kindly placed said bags on top of their dumpsters, well, you get the picture. We were up to our ears in free, slightly stale doughnuts, crullers, and bear claws. And so doughnut bread pudding was born.We’ll take a bag of the glazed yeasted ones, please!\nEmma K. MorrisBread pudding is one of my all-time favorite desserts, in no small part because it feels like a scrappy magic trick—you start with stale bread that nobody wants to eat, add a few basic ingredients, and end up with a steamy, special-feeling homemade dessert. It’s also infinitely variable, and takes on the unique character of whatever baked product serves as its base. I’ve served mild, milky versions made with white sandwich bread, tangy sourdough-based ones, and eggy variations made with challah, all to great effect. But nothing raises eyebrows and elicits quite the same delight as one made with doughnuts.The idea alone has a scintillating tinge of the forbidden, dessert made from dessert, conceptually naughty like pork cooked in milk or scrambled chicken eggs topped with fish eggs. But conceptual appeal aside, bread pudding made from doughnuts is also fucking good. The fried dough lends a unique, nutty flavor to the finished pudding, and it has a tender, eggy texture that reminds me of a great clafoutis. It’s rich, it’s sweet, it’s unapologetically over-the-top, and even skeptics will have a hard time turning down seconds. (It’s worth noting that it’s impolite to serve people dumpstered food without informing them of its provenance beforehand; consent is king.)While you can certainly make a successful doughnut bread pudding with whatever type of doughnut you like, I find that it’s best to stick with yeasted doughnuts that have been finished with a simple glaze or dusting of sugar. Cake doughnuts (the denser ones) tend to be too crumbly for my taste, and elaborate frostings and sprinkles feel like a bridge too far. And while it’s delicious in its most basic form, topped simply with cold cream or yogurt to cut through all that sugar, it’s also phenomenal cooked with a bit of jam or preserved. Not only does it evoke jelly doughnuts—my personal favorite—but using a not-too-sweet jam made from tart berries adds a welcome hit of acidity to an otherwise low-tone dish.And no, obviously, you don’t need to drag a Santa-sized bag of doughnuts out of the garbage in order to make this beyond-simple dessert. You can make it with any doughnuts—bought or borrowed—so long as they have had a day or so to lose some of their moisture and stale somewhat. (Staling fresh ones yourself in the oven is also an option.) I will say, however, that this unnamed doughnut and coffee chain still makes a practice of separating their unsold, perfectly good doughnuts from all of their other trash and placing them conveniently atop the rest of the refuse at the end of the day. Not that I’ve checked.Get the recipe:Day-Old-Doughnut Bread PuddingIt’s rich, it’s sweet, it’s unapologetically over-the-top, even skeptics have a hard time turning down seconds.View RecipeExplore Bon AppétitNot So FastDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-16", "author": ["Condé Nast", "Amiel Stanek"]}