{"id": "d1f45275444113fda0c7afe24163434d", "url": "https://www.bonappetit.com/recipe/pasta-e-fagioli", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Pasta e Fagioli Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssuePasta e FagioliBy Carla Lalli MusicDecember 7, 20184.7(126)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Carla Lalli MusicEmailPinterestPrintEmailPinterestPrintThe key to a soup with fully developed savory flavor starts with the soffritto—a mix of aromatic vegetables that are slowly cooked in the first stage of cooking. Take your time sweating down the vegetables until they are completely softened before letting them take on any color. You’ll be surprised by how much volume they lose and how much liquid they release and by how much unquantifiable richness they lend to the final dish, which is nothing more than a combination of humble ingredients. Reprinted With Permission From Where Cooking Begins. By Carla Lalli Music, published by Clarkson Potter, March 2019All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonMicroplane$16 At AmazonLarge Pot$55 At AmazonColander$11 At AmazonWooden Spoon$6 At AmazonIngredients4–6 servings8oz. dried medium white beans (such as cannellini), soaked overnight if possibleKosher salt4carrots, scrubbed, coarsely chopped1leek, white and pale green parts only, halved lengthwise, coarsely chopped6garlic cloves⅓cup extra-virgin olive oil, plus more for drizzlingFreshly ground black pepper1smoked ham hock115-oz. can whole peeled tomatoes1bunch Tuscan kale, ribs and stems removed, leaves torn1–2Parmesan rinds (optional)2bay leaves8oz. small pasta (such as ditalini)Finely grated Parmesan, crushed red pepper flakes, and crusty bread (for serving)PreparationStep 1If you haven’t soaked the beans, do a power soak: Place beans in a large pot, cover with water by 1\", and bring to a boil over high heat. As soon as the water comes to a boil, remove pot from heat, stir in a palmful of salt, cover pot, and let beans sit 1 hour.Step 2Pulse carrots, leek, and garlic in a food processor until finely chopped. Heat ⅓ cup oil in a large pot or Dutch oven over medium. Add chopped vegetables, season generously with salt and pepper, and cook, stirring often, until vegetables start to sweat out some of their liquid, about 4 minutes. The goal at this stage is to slow cook the soffritto until the vegetables are very soft but have not taken on any color. Reduce heat to medium-low, cover pot, and cook, stirring every 5 minutes or so and reducing heat if mixture starts to brown, until vegetables are softened and juicy, about 15 minutes. Add ham hock and cook, uncovered, stirring and scraping bottom of pot every 5 minutes, until soffritto is starting to brown in places and has lost at least half of its volume, about 10 minutes more.Step 3Add beans and their soaking liquid, tomatoes, and kale; season with salt and pepper. Bring to a boil, then add Parmesan rinds (if using) and bay leaves. Reduce heat to medium-low and bring to a gentle simmer. Cook soup with lid askew, adding water (or stock, if you have it) as needed to keep beans submerged by 1\", until beans are very tender, 1–3 hours, depending on size and age of beans. Fish out and discard Parmesan rinds. Remove ham hock and use a fork to pull meat off the bone. Return meat to soup; discard bone and any large pieces of fat.Step 4Cook pasta in a large pot of boiling well-salted water, stirring occasionally, until very al dente, about 3 minutes less than package directions. Drain pasta and add to soup, then taste and season with more salt and pepper if needed. (Do not try to skip a step by cooking the pasta in the soup. The noodles will absorb all the available liquid and the liquid will be thick and gummy.)Step 5Divide soup among bowls. Top with Parmesan, drizzle with oil, and sprinkle with red pepper flakes. Serve with bread for dunking.How would you rate Pasta e Fagioli?Leave a ReviewTell us what you thinkReviews (72)Back to TopTriangleVery good, even for us toothless types. The dreaded crusty bread should be avoided, though.GummyAustin, TX2/25/2022I really enjoyed this. It is incredibly seasoned with the addition of the Parmesan rind and ham hock. Plus, all that work of cooking down the soffrito is totally worth it. I used navy beans but think I’ll go with the suggested cannellini beans next time as they are bit more hefty. Yum, yum! KimSan Diego2/22/2022Great recipe. A little different than my grandma's pasta e fagioli, but still delicious. I used pancetta instead of a ham hock because it was what I could find (grandma used pig's feet, but ugh!), and added a couple of tbsp tomato paste to the veggies after they were sauteed and caramelized it, then followed the recipe. Like others, cooked the pasta separately and added to the bowls (easier to freeze w/o pasta). Grandma would have loved it.CharlesDanville, CA2/16/2022Made this without the pasta because I forgot to pick some up.\nIt still ended up awesome. Also I didn't shred up the ham hock. I just left it in the pot.\ndefiantly will make again.steveohio1/26/2022Excellent recipe. A few modifications: I used half leek, half onion. I couldn’t get a ham hock so we kept it vegetarian. The flavor was still fabulous; Parmesan rind makes a big difference. No food processor so went with small dice, which worked fine. Added some butter to the soffrito. Saved a bit of time by pressure cooking the beans in salted water for ten minutes in my Instant Pot. Added the beans and their cooking water to the rest of the ingredients and let the beans cook the rest of the way to pick up all the flavors. Skipped the extra oil on top, but grated Parmesan was a must! As always I served the pasta separately so that the leftover soup didn’t end up with soggy pasta. Sara BBoston, MA12/5/2021I made this after reading the recipe thoroughly in Carla's book as well as watching the video. The depth of flavor I developed using Carla's tips was incredible. This recipe will be added to my all-time favorites list and will be on rotation all winter! \n\nRecipe notes:\n1.  I added celery and a small fennel bulb to the sofrito\n2. I added about 2 cups of chicken stock to Step 3 (also adding about the same amount of stock 2 more times during the cooking). In total I simmered this for 3 hours and it was perfect!\n3. I added a few sprigs of rosemary and thymeWhitneySeattle, WA1/17/2021SO good and worth the time & attention!Dei1/16/2021Fabulous recipe. I followed it closely and it was a hit for the whole family, got a big thumbs up from the 4yo. Very much looking forward to leftovers tomorrow!JohnSeattle, WA1/10/2021This is an excellent recipe. That being said, I did make a mistake and ended up with a very salty version which  I amended with some water but still is on the salty side. I did the power soak described in the recipe p bc I forgot to soak my beans the night before. Doing the power soak as written, adds a lot of salt to the recipe. You don’t notice it until after you have salted your sofrito as well and added your ham hock. I should have taken it into consideration. Live and learn. I’ll just drink lots of water and wine and enjoy. Will definitely make again.Scargosun Philadelphia, PA1/4/2021This is truly one of my favorite recipes of all time. The flavors are incredible, and it's a lot of fun to make. There's something so satisfying about a pot of something delicious simmering for hours on a cold day. I power soak beans a few hours before I start on the soup, and it always works out well. I suggest making a batch of BA's best Pesto and drop a hefty tablespoon on your soup when it comes time to serve. Nom. Leigh Washington, DC12/2/2020This reminds me of the dish that my Nona Poli made for me when I lived with her for a year when I was a child. Absolutely delicious. Nona did not use kale, rather she grew Chard and it was all I knew. If the chard looked decent at the market today, I would have used it. \n\nThe market did not have a smoked pork hock so I subbed bacon- Nona used to use pancetta. I cut back on oil as a result. Also, Nona used to rotate/ change the soaking water a couple times. She said it causes less digestive gassing. \n\nWhen I make this again, I will par cook the beans. I had to boil the soup for well over two hours to cook the beans. \n\nThanks Carla for helping me bring back some great memories!!DougTrail, BC, Canada11/20/2020This adapts beautifully to a slow cooker. Cook the sofrito in a pan, scrape it into the insert of slow cooker; proceed with the remainder of the recipe, except adding the kale. Cook on HIGH for 3-4 hours, or LOW for 5-6 hours. You may need to stir periodically. About 30-45 mins before you plan to serve, add the kale. Taste for seasoning and adjust accordingly.  I add a minimum amount of salt at start, as the Parm rind and ham hock and canned tomatoes and stock will also add to the total saltiness of the dish.Stilettos in the KitchenVancouver, BC Canada11/18/2020This was sooooooooo good oh my god. I doubled the recipe and it came out great. No food processor, so chopping double the veggies took some time but it was worth it! Subbed 1 1/4 white onions for the leek.\n\nThe sofrito took about 40 minutes to cook down to where it was browning and extremely flavorful. Watching it cook down was very satisfying :) Used a 28oz can of whole tomatoes that I tore apart w my hands. For beans, I used great northern, power soaked for about 1.5 hours, had them simmering for about 30 minutes as well because I was worried they wouldnt be done in time. No ham hock, just used two parm rinds. Had to stop boiling after 1.5 hours (dinner time) but the beans didn't get as creamy as I wanted. I was using veg stock to top the beans off but after adding 2 cups, I became worried about how salty it was getting, so just used water after that. Added quite a bit and the salt eventually evened out. I'm glad I salted at every step of the way (so I can keep tweaking) but make sure to taste often too to avoid over-salting. Added kale right before serving. Made pasta in separate pot, did NOT combine with the soup per other reviews – just combined in individual serving bowls.\n\nEven after doubling the recipe, this only made 7 servings.R10/14/2020LOVE this recipe. I'm vegan so I use vivera bacon and nooch instead of parm. And a lil miso cuz for extra umami. AnonymousLondon9/23/2020This is really good, and I made it almost exactly as indicated. I ended up adding about a litre of chicken stock (I didn't dump in the bean soaking water) and that was barely enough. In fact, the pasta keeps soaking up the liquid, so after going back to the pot there was almost no liquid left at all. This happens with basically any soup that has pasta in it, so no surprise. But don't cook the pasta short of al-dente as the recipe says; it's ok for pasta in soup to be on the soft side, and besides, it's just going to soak up all your yummy soup anyway (as if you had put it in uncooked) so cook it until actually al-dente and you'll be happier. If you plan to eat it again next day, the ultimate pro-tip is to cook it with more liquid than you think you want, then remove about a third of the liquid before you add the pasta. Eat half. Next day, warm it up and add the reserved liquid for good-as-new!Ed HawcoMontreal9/15/2020Explore Bon AppétitSoupSoups and StewsStewItalianEuropeanCannellini BeanWhite BeanBeanVegetableKaleLeafy GreensCanned TomatoTomatoDitaliniPasta & NoodlesMainNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-07", "author": ["Condé Nast", "Carla Lalli Music"]}