{"id": "d1f8c8d558a357c4363aa5fecc416a9d", "url": "https://www.bonappetit.com/story/cometeer-coffee", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "Cometeer Coffee's Flash-Frozen Capsules Are Revolutionizing the Way I Drink Coffee | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Flash-Frozen Coffee Is Revolutionizing My MorningFor coffee connoisseurs looking for a quick fix, it doesn’t get any better than this.By Emily WilsonFebruary 21, 2022FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I am happily addicted to caffeine. Most mornings I’ll brew a pot at home with beans, usually medium roasts with notes of chocolate or caramel, sourced from whatever coffee shop I was at when I was due for a refill. But when I’m on deadline or wake up groggy from a late night out, grinding beans and making fresh coffee feels like an insurmountable task. Instant coffee isn’t an option for me—I guess you could call me a coffee snob—so when a friend told me about Cometeer, I was immediately curious.The Massachusetts-based company makes frozen coffee capsules by grinding beans at peak freshness, brewing them at 10 times the strength of normal coffee, then flash-freezing the results into concentrated pods for easy home melting. Developed by a team of MIT chemists and engineers, Cometeer’s proprietary extraction technology considers factors such as oxidation, grind size, and roast level to achieve the best-tasting coffee, which is then plunged in a liquid nitrogen bath to lock in the flavor. And they work with some of the country’s top roasters like Counter Culture out of Durham, Equator from San Francisco, and New York’s Joe Coffee.Photograph by Emma FishmanCometeer Mixed Box$64 $60 at CometeerI ordered a mixed box of 32 Cometeer coffee capsules. When they came in the mail a few days later, I boiled a pot of water, popped an icy brown puck into a mug, and poured the hot water over the frozen concentrate. Not only was the cup of coffee delicious, but as I made my way through the various roasts in my box, I was able to notice the nuances of body and flavor in each variety.“I’ve been in this business for 20 years, and we love to wax about how coffee should be appreciated like wine, but there’s always been this inescapable elephant in the room, which is that you do not need to brew your own wine,” says Kyle Glanville, founder of Go Get Em Tiger in Los Angeles, one of Cometeer’s roasting partners. For Glanville, Cometeer eliminates the barrier for people to enjoy high-quality coffee at home. Since melting a capsule with hot water doesn’t require any equipment or skill, he says Cometeer’s process is a “profound step forward” for brewing specialty coffee in their own homes.Cometeer coffee pods can also be utilized in a number of other ways. Once you run a sealed capsule under warm water, you can use it in any K-cup compatible machine (like a Keurig), combine it with cold water or milk for iced coffee or a latte, pour it over ice cream to make an affogato, or shake it with vodka, simple syrup, and ice for an espresso martini. Better yet, Cometeer is a more sustainable option than typical coffee pods: the aluminum packaging is recyclable and the company composts all of their used grounds.Keeping Cometeer in my freezer hasn’t changed my entire attitude towards coffee. I still hit my neighborhood coffee shops a few times a week, buy beans, and brew coffee fresh. But it has made it easier than ever to enjoy a great cup of coffee. That’s true when traveling too. Although I’ve yet to take Cometeer on the road, the company promises that the pods taste great for up to 24 hours after they’ve been thawed. And at under one fluid ounce per pod, they’re TSA-approved, so you can take them on the plane. Next time I’m headed somewhere where the coffee situation is unpredictable, Cometeer is coming with.More highly-caffeinated content from BA’s Coffee Week:The Best Ways to Make Coffee, According to BaristasThis Reusable Coffee Filter Means I Never Worry About Running OutThe Coffee to Water Ratio That Makes a Perfect BrewYou Should Add Spices to Your Coffee GroundsExplore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-21", "author": ["Condé Nast", "Emily Wilson"]}