{"id": "d2075009a99dc94fb8bf14fa04ac7a26", "url": "https://www.bonappetit.com/story/claire-saffitz-gourmet-pop-tarts", "year": 2020.0, "month": 4.0, "day": 5.0, "content": "Claire Is Making Gourmet Pop Tarts And She Wants You to Test Them | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingClaire Is Making Gourmet Pop Tarts and She Wants You to Test ThemFor the first time ever, we’ve got the recipe right here...By The Bon Appétit StaffApril 29, 2020FacebookTwitterEmailPhoto by Claire SaffitzFacebookTwitterEmailSince launching her hit YouTube series Gourmet Makes in 2017, BA contributor Claire Saffitz has put a homegrown spin on over three dozen store-bought treats from her childhood. That includes everything from Doritos to Warheads, Twix to Girl Scout Cookies (catch the behind the scenes here!). Utilizing (and often destroying) just about every tool in our Test Kitchen, she swaps out unheard of processed chemicals for natural ingredients, flavoring our favorite name-brand snacks for a more...grown-up palate.These days, while working from her NYC apartment without access to the Test Kitchen’s stores of painstakingly sourced ingredients and equipment, Claire is revisiting her favorite recipes from the series and modifying them to suit her home kitchen—and yours, too. For the first time, we’re posting the recipe so you can cook along with her and share your experiences with us... and the millions of other people who watch the show.Watch Claire make Gourmet Pop Tarts the first time around, back in the BA Test Kitchen (we miss you!)\nBelow, you’ll find her at-home version of her Gourmet Pop Tarts, which reimagine the pastries with a softer, flakier pie dough, fresh strawberry jam, and handmade crunchy sprinkles—all packaged to fit right in your toaster. (Watch the OG episode here!)For a chance to be featured in an upcoming episode, follow the recipe below and send a video to gourmetmakes@gmail.com showcasing your final product, explaining how well they turned out, or any snags you hit along the way. Please keep videos to 60 seconds and send in mp4 or .mov form. Submissions accepted through Wednesday, May 6!Gourmet Strawberry Pop TartsMakes 9Use any store-bought jam you like instead of our homemade strawberry filling. Heck, you can even use store-bought puff pastry and sprinkles as well to make these a lighter lift.IngredientsPastry Dough2½ cups (313 g) all-purpose flour4 tsp. granulated sugar1 tsp. kosher salt1 ¼ cups (2½ sticks) chilled unsalted butterFilling2 10-oz. packages frozen strawberries⅓ cup granulated sugarPinch of kosher salt1 tsp.  vanilla extractFinely grated lemon zestFresh lemon juiceSprinkles1 large egg whitePinch of kosher salt2 cups powdered sugarOrange, red, pink, green, and yellow food coloringAssemblyAll-purpose flour (for dusting)1 large eggPinch of kosher salt2 cups powdered sugar½ tsp. fresh lemon juice½ tsp. vanilla extractInstructionsPastry DoughWhisk flour, sugar, and salt in a large bowl to combine. Toss butter in dry ingredients  to coat, then working quickly, grate butter on the large holes of a box grater into the bowl. Toss grated butter to coat, then, using your fingers, work  butter into dry ingredients, smashing until the largest pieces are about the size of a lentil.Tossing constantly with a fork, drizzle in ⅓ cup plus 1 Tbsp. ice water, then using your hands, lightly toss the mixture several times to distribute water evenly. Knead dough in the bowl with your hands until it comes together into a smooth mass with no spots of dry flour remaining. Transfer dough to a sheet of wax paper or plastic wrap and pat into a ½”-thick square. Wrap tightly, pressing out air, then roll over dough with a rolling pin in both directions, forcing it into the corners of the wrapping  to make a tightly compacted square. Chill at least 2 hours and up to 36 hours ahead.FillingPreheat oven to 250°. Combine  strawberries, granulated sugar, salt, and 3 Tbsp. water in a large saucepan and cover. Bring to a simmer over medium heat, uncovering and stirring occasionally, until berries are softened, about 5–8 minutes. Remove from heat and purée with a hand blender, leaving a bit of texture if you like (or, transfer to a standard blender and blend, then return to the saucepan). Return to a simmer, uncovered, and cook,  stirring often with a heatproof rubber spatula, being sure to scrape the sides and bottom of pan, until filling  is thick enough that you can see the bottom of the pot for a second when you scrape the spatula across, 10— 15 minutes.Scrape filling  onto a large rimmed baking sheet lined with a silicone mat and spread into a thin, even layer. Bake, stirring every 15 minutes with spatula, until it becomes a thick paste that holds its shape (it should resembles tomato paste), 45–60 minutes. Let cool, then transfer filling to a small bowl and stir in vanilla. Add lemon zest and juice to taste.Do ahead: Filling can be made 1 week ahead. Cover and chill.SprinklesWhisk egg white and a pinch of kosher salt in a medium bowl until foamy. Add powdered sugar a little bit at a time, whisking constantly and vigorously until you have a thick, smooth, opaque white icing (depending on the size of your egg white, you might not need all the sugar). Divide icing among 5 small bowls and, working one at a time, add food coloring a drop at a time, stirring with a spoon, until you have the desired color. Repeat until you have all 5 sprinkle colors: orange, red, pink, green, and yellow. Spread each color icing in an even strip across a sheet of parchment paper, making  as thin a layer as possible. Slide parchment paper onto a baking sheet and let sit at room temperature until icing has dried and hardened completely, at least 12 hours.Peel icing off of  parchment paper and break into smaller pieces with your hands. Place the pieces inside a resealable plastic bag and seal, pressing out any air. Beat the bag lightly with a rolling pin to pulverize the icing into tiny sprinkles. Transfer the sprinkles to a fine mesh sieve and shake to remove any tiny, dust-like particles; discard. Pass sprinkles through a colander or slotted spoon, reserving the pieces that fall through and returning any larger pieces that don’t to the bag and breaking up further with rolling pin. Repeat the double-sifting process until you have very small, relatively uniform sprinkles. Transfer to an airtight container, cover, and store at room temperature until you’re ready to assemble pop tarts.Do Ahead: Sprinkles can be made 1 week ahead.AssemblyPreheat oven to 300°. Unwrap dough and cut in half. Re-wrap one half and return to the refrigerator. Roll out remaining dough on a lightly floured surface to about 14x10” rectangle. Transfer to a baking sheet lined with parchment paper.Using a ruler, lightly score straight lines on dough to make a 3x3 grid (you should have 9 rectangles each measuring about 4½” long and 3¼” wide (don’t cut all the way through the pastry). Using the ruler, measure and lightly score another set of lines ¼” from the inside of each rectangle (think of it as making a slightly smaller rectangle inside each of the 9 rectangles. Chill dough until firm, 10–15 minutes.Remove scored dough from the refrigerator and divide cooled filling among rectangles (about a slightly heaping tablespoonful each). Using a small offset spatula or a spoon, spread filling in an even layer so it fills up to the lines of the smaller rectangles (you’re leaving the ¼” border exposed). Transfer to the refrigerator to chill. Roll out second piece of pastry into a 14x10” rectangle the same way as the first, then prick it all over with a fork.Crack egg into your hand, letting egg white fall into a medium bowl. Place egg yolk in a small bowl and beat to blend. Set egg white aside for making icing. Remove pastry with filling from the refrigerator and brush egg yolk over pastry, working around the filling. Drape the second piece of pastry over top, aligning the slabs and pressing out any air pockets. Press firmly around filling to seal pastry (take care to avoid the filling though). Use a bench scraper to cut down between rectangles to make nine 4½x3¼” pop tarts; discard any scraps. Space pop tarts evenly on baking sheet. Chill until pastry is firm, 10–15 minutes.Bake pop tarts until golden underneath and puffed but still pale on top, 30–35 minutes. Let cool on baking sheet.Add salt to reserved egg white and whisk until foamy. Add powdered sugar a little bit at a time, whisking constantly and vigorously until you have a smooth, opaque white icing that falls off the whisk in a slowly dissolving ribbon (depending on the size of your egg white, you might not need all the sugar). Fill a disposable pastry bag or a resealable plastic bag with about 2 Tbsp. icing and snip a very small opening from the end or a bottom corner. Pipe thin, even rectangles of icing on the surface of each pop tart, leaving about ¼-inch border. Transfer any icing left in bag back to the bowl, then whisk in lemon juice and vanilla. Whisk in water a few drops at a time if needed to make the icing a bit more fluid but still thick and opaque. Working with 1 pop tart at a time, drizzle about 1 tsp. icing inside the icing rectangles and use your finger or a toothpick to cover entire icing rectangle in a thin, even layer (add more icing if needed). You should have a smooth, even application of white icing. Before the icing starts to set, top pop tarts generously with sprinkles. Let sit at room temperature at least 1 hour to let the icing set before serving.Do Ahead: Pop tarts can be made 3 days ahead. Store airtight at room temperature. After icing has had 24 hours to set, you can reheat in a 300° oven until warmed through, 5–8 minutes.Explore Bon AppétitPastryGourmet MakesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-29", "author": ["Condé Nast", "The Bon Appétit Staff"]}