{"id": "d227d49e9cf466cc2a7a8ef37c574aa1", "url": "https://www.bonappetit.com/recipe/grain-salad-with-pickled-onions-and-herbs", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Grain Salad with Pickled Onions and Herbs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGrain Salad with Pickled Onions and HerbsBy Dimes, NYCOctober 8, 20184.6(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Chris Morocco, Prop Styling by Bea ChastkaEmailPinterestPrintEmailPinterestPrintFreekeh is green wheat with a slightly smoky flavor we love, but any whole grain you have on hand will work. This recipe from Dimes is part of Healthyish Superpowered, a dinner series honoring female activists and chefs across the country, in partnership with Caviar.Ingredients4 servings1small head of broccoliKosher salt1small bunch of Tuscan kale1½cups whole or cracked freekeh (from one 9-oz. package)½cup raw pistachios½red onion, very thinly sliced½garlic clove, finely grated5Tbsp. extra-virgin olive oil3Tbsp. fresh lemon juice2Tbsp. drained capers1tsp. crushed red pepper flakes1tsp. fennel seeds, finely groundFreshly ground black pepper½cup basil leaves, coarsely chopped½cup cilantro leaves with tender stems, coarsely chopped½cup mint leaves, coarsely choppedPreparationStep 1Cook broccoli in a large pot of boiling salted water (leave florets attached to stem so it’s easier to get in and out of the pot) over medium-high heat just until crisp-tender, about 2 minutes. Transfer to a paper towel-lined plate. Cook kale (again, leave on the stem to cook it) by dipping into the water just long enough to let the color turn bright green, about 10 seconds. Transfer to plate with broccoli; reserve pot of water. Let vegetables cool, then squeeze out any excess water.Step 2Cook freekeh in salted water in reserved pot at a rolling boil, stirring occasionally, until al dente, 20–25 minutes for cracked freekeh or 40–50 minutes for whole. Drain freekeh well, transfer to a medium bowl, and let cool until just warm.Step 3Meanwhile, preheat oven to 350°. Toast pistachios on a rimmed baking sheet, tossing once, until golden brown, 5–8 minutes. Let cool; set aside.Step 4Combine onion, garlic, oil, lemon juice, capers, red pepper, and fennel in another medium bowl; season with salt and black pepper. Let dressing sit until ready to use.Step 5Cut broccoli florets off of stems and thinly slice stems. Cut kale from stalks and coarsely chop. Add vegetables to freekeh in bowl and toss to combine.Step 6Add basil, cilantro, and mint to dressing; season again with salt and black pepper, if needed.Step 7Add half of dressing to freekeh along with reserved pistachios; season with salt and toss to combine. Spoon remaining dressing over.Step 8Do Ahead: Freekeh can be cooked 5 days ahead. Let cool, then transfer to an airtight container and chill. Dressing (without herbs) can be made 1 day ahead. Cover and chill.How would you rate Grain Salad with Pickled Onions and Herbs?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleWonderful recipe! I used farro instead of freekah, left out the capers and fennel and added edamame. Everyone in house enjoyed.Savannah Pear8/3/2021Easy to modify.  Left out the basil, used mixed grain rice in place of freekeh and used onions I had picked the other day and lancinato kale I had massaged will oil earlier in the week.  Fresh and healthy. Jen D Scottsdale, AZ1/15/2021Absolutely delicious. Made it for the family and it was a huge crowd pleaser. Followed the directions closely except I used farro instead of freekeh and needed to add a bit more lemon juice (because I like the kick). Would 100% make again.AnonymousLos Angeles, CA6/22/2020This is the perfect spring/summer side dish. I made a few minor adjustments based on what I had in my pantry, but this recipe is great for that. I swapped farro for freekeh, massaged kale for tuscan, fresh fennel fronds for seeds, sunflower seeds for pistachios, brussel sprouts for broccoli, and ditched the capers. I also used sweet onions that I had pickled separately for another recipe. Will definitely be making this again.AnonymousNew Jersey5/5/2020Tasty and healthy lunch time recipe. I pre-soaked my freekeh as well for a couple of hours, so it was quick to throw together. I've got another two servings at least left, so a good \"packed lunch\" for lockdown. The dressing seems very lemony but once it's dressed the green veg and grains, it's the right balance! Yum!AnonymousLondon, UK4/24/2020Very tasty and flavorful. Didn't have mint and substituted pumpkin seeds for pistachios because that's what I had on hand. Really nice mixture of textures and flavors. I ended up doubling the dressing because this makes a lot of salad! The red onion was a bit strong so I might leave them out next time.AnonymousCalifornia 1/28/2019Explore Bon AppétitSaladAmericanCalifornia CuisineBroccoliVegetableKaleLeafy GreensFreekehRice & GrainsBasilHerbs & SpicesMintSideMainDairy-FreeVegetarianVeganHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-08", "author": ["Condé Nast", "Dimes"]}