{"id": "d22af514e3576a4927f1926611713e42", "url": "https://www.bonappetit.com/story/streecha-new-york-city", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "My Favorite Sausage Is Served at Streecha New York City, a Ukrainian Joint Under a Chiropractor's Office | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Favorite Sausage in NYC Is Served at a Ukrainian Joint Under a Chiropractor’s OfficeIt is not fancy. It is not ambitious. It’s just salty, fatty, stick-to-your-bones good.By Alex DelanyJanuary 10, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.If someone told you to...meet them outside a chiropractic clinic...duck down a set of concrete stairs...enter through a door that leads to the basement of said chiropractic clinic...bring cash...to get some sausage...you might call them crazy. So please, get it over with. Call me crazy. Because that’s exactly what I want you to do. I want you to go to Streecha, one of Manhattan's great treasures and the Ukrainian Village’s most unexpected spot for excellent grilled sausage and stewed cabbage.The lighting in the long basement room is harsh and fluorescent. The table cloths are vinyl. The silverware is plastic. The TV is usually turned to an Eastern European news network. And if you go after the Ukrainian church down the street ends its service, there will be a line. And that’s only part of what makes Streecha wonderful.Volunteer chef Dmytro Kovalenko—who came to New York six years ago after fleeing the violence in his home country of Ukraine—doesn’t charge more than seven bucks for anything on the menu, and it’s all cooked and served by his all-volunteer staff. On offer are staples like potato-stuffed varenyky, borscht, and rose jam doughnuts, and daily specials like shredded cabbage and pork salad, fried potato pancakes, and wheat berries with poppy seeds and honey. But the holy grail is the kovbasa, a creamy on the inside, charred and snappy on the outside pork sausage that’s made around the corner at the East Village Meat Market, with almost jammy cabbage accompanied by a sliced sandwich bread and a packet of spicy mustard. A single bite will revive or inspire any soul in any state. It’s salty, fatty, stick-to-your-bones good.So grab your cash, watch your head on the stairs, and come meet me under the chiropractic clinic.Go there: StreechaExplore Bon AppétitHighly RecommendNew York CitySausageRead MorerestaurantsI've Never Had Vegan Food This Rich, Savory, and...PolishBy Allie WistRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-10", "author": ["Condé Nast", "Alex Delany"]}