{"id": "d22cfc0f219a0e99273c8b5438229a46", "url": "https://www.bonappetit.com/story/garlic-confit-condiment", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "This Garlic Confit Is the Most Versatile Condiment In My Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFrom Now On, I Will Always Have a Jar of Garlic Confit in my FridgeMeet our new favorite condiment.By Emma WartzmanOctober 10, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie TheodorouFacebookTwitterEmailI am not a person whose refrigerator overflows with jars of homemade goods—you know, those pickled vegetables, bright canned jams, or fermenting condiments inspired by Brad Leone’s fermentation station down in the test kitchen. Don’t get me wrong: I’ll slice some red onion and cover it with acid if a recipe tells me to. But I’m not certainly not keeping things around in jars, and the truth is, I’ve never felt the need to. Until now.I would like to swim in jars and jars and jars of Herby Garlic Confit, one of the many new recipes (if you can even call it a recipe) from our recent deep dive into garlic and all its stunning versatility. There’s an elegant fish bathed in garlic-infused cream, a roast chicken with halves of garlic heads tucked into the baking dish, a pantry pasta studded with olives and smashed cloves. And while each of those called my name, it was the humble garlic confit that called it loudest of all.Ready for the oven.\nPhoto by Alex LauThe recipe requires only three ingredients—garlic, olive oil, and a hearty herb like rosemary, thyme, and/or bay leaf—and with gentle heat and time, together they create something deeply flavorful, extremely usable, and generally worth having around. After about an hour-and-a-half in the oven, I was left with tons of sweet, jammy cloves just waiting to be pushed out of their papery skins and—bonus!—the most gloriously infused garlic olive oil I have ever tasted.The only labor-intensive part of the process is pulling apart four whole heads, but to be honest it’s not that labor-intensive because you don't even need to pull the cloves out of their skins. In fact, those skins act as a protective layer so that the insides become exceptionally soft, but when jarred, they don’t squish and lose their shape. After separating, it’s as simple as putting everything in a baking dish, covering it with foil, and letting it hang out in a low-temperature oven while the best smell in the world wafts through your home. After you jar the cloves, they’ll last for about two weeks in the refrigerator, which is plenty of time to consume them all and the liquid gold that surrounds them.Up close and personal.\nPhoto by Alex LauI, for one, ate a large majority of the cloves smeared on fat pieces of toast. I also squeezed out a few to slather on a rotisserie chicken I picked up at the grocery store. But the possibilities abound. Try mashing them into store-bought mayo for an even better sandwich or as dip for crudite. Or stir them into mashed potatoes. As for the garlicky oil, you can use it as a marinade for olives and feta for an impressive party appetizer—if you’re the kind of person who likes to serve an impressive party appetizer. Or you can do what I did and use it to fry up some crispy chickpeas to eat all by yourself. If somehow you've managed to leave any juice left at the bottom of the jar, whisk it into a salad dressing for the best of your life.After that, if you're smart, you'll quickly proceed to make another batch.Get the recipe:Herby Garlic ConfitSpread it on grilled bread, mash it into store-bought mayo, or stir into mashed potatoes.View RecipeExplore Bon AppétitGarlicCondiment/SpreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-10", "author": ["Condé Nast", "Emma Wartzman"]}