{"id": "d234a6d155061972e1de9ad0cd1e4e47", "url": "https://www.bonappetit.com/story/eating-alone-together", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "All I Want To Do Is Eat Alone (Around Other People) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusAll I Want To Do Is Eat Alone (Around Other People)Quarantining with a husband who can cook is no sacrifice, but what I wouldn’t give to sit at a restaurant in Chinatown, slurping up a giant bowl of noodles all by myself.By Scaachi Koul April 27, 2020FacebookTwitterEmailPhoto by Alex Lau FacebookTwitterEmailThis story is part of the Healthyish Guide to Being Alone, a series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.It’s funny how the disruption of your typical routines make you miss things you never even considered before: getting stuck in a boring conversation at a party, having someone brush up against you at a museum and not being terrified for your own mortality, getting drunk enough to share a cigarette with a stranger. For me, it’s only been in the last few weeks that I’ve really thought about how much I miss one thing in particular: eating alone in public.This small but ever-present joy combines all the things I love most: eating, gawking at strangers, and being left alone. It’s vastly different than drinking alone at bars, which men often use as an invitation to talk to me about things like my cuteness (I know, Steven) or where exactly my apartment is and whether they can come to it. I’m also not big on participatory events, so I have no interest in concerts or theater or any other public functions that I could feasibly do alone, with others.All I really want is to sit with a big bowl—all foods are best served in bowls, this is not up for debate—and watch the world drift by. Sometimes I read, or sometimes I just enjoy watching two strangers fight at a nearby table. (Here’s a helpful tip: Put in headphones so they think you’re not listening to them, when, in fact, that is the only thing you are doing.)I know how lucky I am to be riding out this quarantine order with someone I love who’s a great cook and spends most evenings making me inventive and comforting dishes. Hearty stir-frys, steak au poivre, pasta with tons of garlic, nicoise salad with as many eggs as I ask for—my husband can make nearly anything I’d request. His food is always perfect, a version of his love that I can devour, but sometimes, I don’t want food to be love. I just want one little solo activity, proof of my own control, a place where I can set whatever rules I want.His food is always perfect, a version of his love that I can devour, but sometimes, I don’t want food to be love.I miss eating many of these exact dishes in the quiet din of a restaurant, after the lunch rush or whenever I choose, alone, pawing at a book and pretending I’ll read it, then listening to a podcast about 2 Live Crew instead.Last week, I texted Adrian, my foodiest food-food friend, who’s also struggling with our quarantine orders. Adrian loves an expensive steak but will also eat an alarming amount of meat (I mean, I think it was meat?) -centric Dominos pizza if presented with it. Adrian and I once went to Miami with some friends, and on the day we left, he had six meals, including two separate dinners: an overpriced airport fish and chips platter then, about 45 minutes later, a vegan corn-and-peppers wrap on the flight. His digestive system is a puzzle and a marvel. Earlier this week, when I inexplicably bought about 50 chicken wings, my husband asked me, “Did you think Adrian was coming for dinner or something?”Adrian understands me. “Love a walk and eat,” he replied when I asked him if he also missed eating alone. “Dripping all over yourself. Like a sandwich on the way home.” He too just wants to devour something in plain view of others, like it’s evidence that we’re all alive. Eating is a simple ritual, but it’s one that reminds us of our own buoyancy and insistence upon living. Right now, it would be especially nice to have that kind of a reminder when everything feels so bleak.What I think about the most these days is Pho Hung, a little but formidable restaurant in Toronto’s west Chinatown. I haven’t lived there in a year and a half, but when I did, I’d eat at Pho Hung a few times a month at minimum. For around $25 all-in (Canadian, so like, what, three American confederate dollars?), I could get a giant pho ga, fresh rolls, and a beer. When I’d go alone, they’d seat me by a window where I could slurp my soup, ruin the front of my shirt (instead of merely eating like an adult woman, I simply stopped wearing “nice” shirts there), and be ignored by all the staff. The restaurant isn’t too far from a few college campuses, so there’d always be a young couple sniping at each other. Dinner and a show.I left every meal at Pho Hung feeling physically full and emotionally replenished: an hour of time alone with my favorite meal, a big batch of noodles and broth, and the strict restaurant rule that you cannot take any of the soup home. I’d eat it all and be so full that I’d have to waddle home, right on the brink of discomfort. Later, when I would return to my husband, I felt renewed and ready for the next evening, when maybe we could have a meal together. Distance makes the heart fonder; eating alone is a reminder of how nice it can be to eat with someone.That was the magic of the solo noodle soup. Adrian calls it “a brain bath.” I call it rebirth.I’m not sure when Adrian and I will get to return to our soups—separately, of course, at Pho Hung—but I have to trust that it’ll happen for us eventually. One day soon, we’ll be together in being alone, just how we like it. Until then, we’ll have to keep finding ways to eat alone when it’s impossible: him, hiding in his basement with a bowl of rigatoni, and me, gnawing on stale baguette while sitting in my dry tub, waiting for some kind of good news.Explore Bon AppétitHealthyishHealthyish Guide to Being AloneCoronavirusessayRead MorecultureLeading a Virtual Dance Party Is What I'm Living For Right NowBy Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-27", "author": ["Condé Nast", "Scaachi Koul"]}