{"id": "d23412d05e07166cec738ecc0538aa2c", "url": "https://www.bonappetit.com/story/best-dish-washing-tools", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Best Tools for Hand Washing Dishes - Sponges, Gloves, Soap, and Dish Rack | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking8 Tools to Make Washing the Dishes a Little Less MiserableThey can't make dishwashing fun, but they can make it better.By Sarah JampelApril 10, 2020FacebookTwitterEmailPhoto by Ted + Chelsea CavanaughFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Want to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: how to wash the dishes.Because many of us are cooking a lot more than usual, many of us are cleaning a lot more than usual, too. And even if you have a dogmatic system that works for you, the drudgery of dish-washing can make the already-exhausting task of cooking even more so.But don’t despair (you have no choice!). These eight products might not make you look forward to doing the dishes (who are we kidding), but they will make the process a little less painful. And right now, that’s good enough:Photo by Ted + Chelsea CavanaughA sponge you won’t forget to replaceThe official sponges of the BA Test Kitchen, these never get stinky. You’ll know it’s time for a fresh one when the design on the top fades.Photo by Ted \\+ Chelsea CavanaughSkura Style Sponge (Set of 4)$15 at AmazonPhoto by Ted + Chelsea CavanaughThe heavy-duty dish towelSmall, thin towels are great for tucking into an apron, polishing drying glasses, and standing in for cloth napkins, but when it comes to the dal that bubbled over, or the cup of coffee you accidentally knocked, you need a super-absorbent towel that will get the job done.Photo by Ted \\+ Chelsea CavanaughWilliams Sonoma Classic Logo Towels (Set of 4)$20 $16 at Williams SonomaPhoto by Ted + Chelsea CavanaughGloves that keep your hands bone-dryThese gloves are durable yet flexible, and the folds prevent water from dripping down your wrists. Read more about why we love them here.Photo by Ted \\+ Chelsea CavanaughCasabella Waterblock Gloves$8 at AmazonPhoto by Ted + Chelsea CavanaughAll-natural soap that gets the job donePlant-based, biodegradable, and refillable, this dish soap is gentle on skin but tough on grease.Photo by Ted \\+ Chelsea CavanaughCommon Good Dish Soap (16 Oz.)$9 at Common Good$14 at AmazonPhoto by Ted + Chelsea CavanaughThe all-purpose grub-cleanerIf there’s a stain that just won’t fade, try this near-magical cleaning powder, which will make your pots, pans, and baking sheets glitter anew.Photo by Ted \\+ Chelsea CavanaughBar Keepers Friend$8 at AmazonPhoto by Ted + Chelsea CavanaughThe strong but gentle scrubberMade of durable waterproof palm fibers, it pulls off burnt crusties from your cast iron without damaging it. It’s also great for cleaning vegetables. Read more about how to put it to use here.Photo by Ted \\+ Chelsea CavanaughKamenoko Tawashi Scrubber$9 at East Fork$7 at AmazonA dish rack you’ll want to show offCan dish racks be cute? Minimalist-chic and just big enough, it contains drips, is easy to wipe clean, and won’t take up too much counter space.Yamazaki Home Wood-Handled Dish Rack$78 at Food52Photo by Ted + Chelsea CavanaughThe actual book on dishwashingPeter Miller’s carefully laid-out dish-washing strategy will help you find the joy (seriously!) in dish-washing. It also makes a great gift (i.e. hint) for your messy roommate/partner/teenage child.Photo by Ted \\+ Chelsea CavanaughHow to Wash the Dishes By Peter Miller$15 $12 at Amazon$14 at BookshopAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitCleaningShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-10", "author": ["Condé Nast", "Sarah Jampel"]}