{"id": "d237e59caa365c0e4b8ecdea43010f39", "url": "https://www.bonappetit.com/story/just-buy-it-metal-nesting-bowls", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "These Nesting Bowls Are a Kitchen Prep Lifesaver | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Metal Nesting Bowls Are a Kitchen Prep LifesaverAnd I can give you about 100 other reasons why you should buy them. (Okay, five other reasons, but still.)By Emma WartzmanAugust 9, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWhen I was little I had a set of Russian nesting dolls that I would stack and unstack with all the care in the world, truly delighted by how perfectly they fit together. Now, at the ripe age of 26, I have a set of nesting stainless steel mixing bowls that I am equally, if not more, delighted by.Is it lame to take so much pleasure in such a simple, mundane set of kitchen equipment? Maybe. But not a day goes by that I don't pull out at least one of my six stainless steal nesting bowls. (Okay, maybe a day, but you get the idea.) The largest is perfect for tossing a giant grain salad that I can eat throughout the week. The mid-sized ones are just right for mixing together dry ingredients when I bake. Smaller ones are there for me when I’m whisking together a dressing of some kind. And the tiniest bowls are perfect for prepping out smaller quantities of ingredients like grated garlic, ginger, or dried spices.The thing is, not only are these bowls workhorses in the kitchen, but they're also an indispensable part of any dinner party I throw. Someday I hope to own a dazzling array of beautiful serving bowls that I can feel proud to bring to the table, but at this point I supplement my small supply of aesthetically-pleasing ceramics with these stainless steel vessels. (I like to think of them as \"industrial chic.\") Whether it’s a big green salad at the center of the table, or a few dips laid out as appetizers, these bowls are there for me.Plenty of room to toss, toss, toss those lettuces.\nTED CAVANAUGHMy reasons for delighting in them don’t stop there, though. In my Brooklyn apartment, space is a hot commodity, so their nesting ability straight-up rules. Imagine! SIX bowls in the space of one! They are unbreakable, which I know because I have dropped them more times than I can count, and they can go straight into the dishwasher and come out as shiny and new-looking as they day I bought them (or, if you don’t have a dishwasher, they are truly the easiest to clean by hand). A whole set of costs a painless $25 on Amazon, which is as much as I know you would spend on a few drinks out on Saturday night, or a mani/pedi, or a refill on your bus pass. And they last a hell of a lot longer than any of those things.Convinced yet? Good. Mix, nest, and be merry.Just Buy It: Stainless Steel Mixing Bowls, Set of 6, $25 on AmazonAnd make a Caesar salad to celebrate!Lazy Caesar SaladNo raw egg yolk, no problem. All the flavor you love in the classic in a quarter of the time.View RecipeExplore Bon AppétitBasicallyShoppingMeal PrepRead MorecookingThe Best Bread Knife Costs $22 But Is Worth Its Weight In Gold. GOLD!By Alex BeggscookingThe Best Kitchen Towels Cost Less Than $1 Each, So Stock UpBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-09", "author": ["Condé Nast", "Emma Wartzman"]}