{"id": "d23a994334947c16a7e0a8322e637904", "url": "https://www.bonappetit.com/recipe/chorizo-and-calabrian-chile-stuffing", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Chorizo and Calabrian Chile Stuffing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueChorizo and Calabrian Chile StuffingBy Rachel GurjarOctober 19, 20215.0(16)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food styling by Susie Theodorou, Prop styling by Sophie LengEmailPinterestPrintEmailPinterestPrint“I personally gravitate toward a holiday stuffing with a more classic flavor profile, but I’m also a firm believer that a little bit of spice improves most things. That’s why I incorporated meaty bits of spicy-tangy Mexican-style chorizo and a handful of fiery Calabrian chiles into this stuffing recipe. The heat these ingredients bring is fairly subtle, just enough to activate your taste buds in between bites of roast turkey and rich green bean casserole, and keeps you coming back for more.” —Rachel Gurjar, associate food editorAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Straight-Sided Skillet$290 $199 At Amazon13x9\" Baking Dish$20 At AmazonSlotted Spoon$13 $10 At AmazonWooden Spoon$6 At AmazonIngredients8 Servings12-lb. loaf country-style bread, cut into 1\"–1½\" pieces2large eggs2½cups low-sodium chicken broth4Tbsp. extra-virgin olive oil, divided4fresh chorizo sausages (about 1 lb.), casings removed1medium onion, finely chopped6garlic cloves, finely chopped5celery stalks, finely chopped10drained oil-packed Calabrian chiles, thinly sliced, or 1 Tbsp. crushed red pepper flakes½cup (1 stick) unsalted butter, cut into pieces1Tbsp. finely chopped rosemary1Tbsp. finely chopped sage½cup chopped parsley, plus more for serving1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, dividedPreparationStep 1Preheat oven to 250°. Arrange bread cubes in a single layer on 2 large rimmed baking sheets, dividing evenly, and bake, tossing occasionally, until dried out, about 1 hour. Let cool, then transfer to a very large bowl. Increase oven temperature to 350°.Step 2Whisk eggs and broth in a medium bowl to combine; set aside.Step 3Heat 1 Tbsp. oil in a large skillet over medium-high. Cook sausages, stirring and breaking into small pieces with a wooden spoon, until browned and cooked through, 5–7 minutes. Using a slotted spoon, transfer to a plate.Step 4Heat remaining 3 Tbsp. oil in same pan over medium. Add onion, garlic, and celery and cook, stirring often, until softened but without taking on any color, 6–8 minutes. Add chiles and butter and cook, stirring often, until butter is melted, about 2 minutes. Stir in rosemary and sage and cook, stirring, until fragrant, about 1 minute.Step 5Remove skillet from heat and return sausage to pan. Add ½ cup parsley and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt and stir well to combine. Scrape mixture over bread in bowl and mix well to combine. Pour reserved egg mixture over and fold gently until thoroughly coated. Stir in remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt.Step 6Transfer stuffing to a 13x9\" baking dish and pack stuffing down into pan with spatula or your hands. Cover dish with foil and bake stuffing until bubbles appear around the edges (you may need to peek under the foil), 30–35 minutes. Increase oven temperature to 425°. Uncover stuffing and continue to bake until top is golden brown and crisp, 20–25 minutes longer. Let sit 10 minutes.Step 7Top stuffing with more parsley just before serving.How would you rate Chorizo and Calabrian Chile Stuffing?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThis is the only stuffing I will ever make from now on. I've made it twice so far. Absolutely delicious flavor - the parsley, Mexican chorizo, and chilis are perfect together. My supermarket only had a jar of \"chopped\" Calabrian chilis. I used about 1.5 Tbsp, but I like spicy so next time I would use more (maybe 2 or 3 Tbsp). ChrisDelaware3/9/2022Delicious.  My husband made this for thanksgiving and we were all a little skeptical (he never cooks).  However the stuffing was excellent and there were no leftovers.  Many of the guests said it was their favourite.  A must make. AnonymousOrange, California1/5/2022Really delicious!!! Made mole this year instead of plain roasted turkey and this was a fun, decadent, side!MeauxDenver12/4/2021Delicious. Made with Trader Joe's Italian Bomba Fermented Calabrian Chiles and it was a perfect solution when I couldn't find the oil-packed ones. A big hit on the Thanksgiving table. KimiyoLos Angeles11/29/2021Great recipe, and \"custardy\" texture comment was spot on.  Will make again with less pepper flakes or sub aleppo instead of red chile.  Good as written, but very spicy compared to rest of standard Thanksgiving fare.MooseNRH, Texas11/26/2021Awesome. This came out so well. I couldn't find Calabrian chiles in a pinch but subbed crushed red pepper per the recipe's instruction. This got solid reviews from people @ the friendsgiving and I found myself craving the leftovers.Anonymouswashington, dc11/14/2021Explore Bon AppétitThanksgivingChileVegetableChorizoSausageMeatStuffingDinnerSideRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-15", "author": ["Condé Nast", "Rachel Gurjar"]}