{"id": "d2475ae940e25b3d66c292f3239b95f3", "url": "https://www.bonappetit.com/recipe/smashed-green-beans-with-lemony-sumac-dressing", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Smashed Green Beans With Lemony Sumac Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueSmashed Green Beans With Lemony Sumac DressingBy Sohla El-WayllyOctober 20, 20203.6(22)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintBlanch, smash, and marinate the green beans in advance so they have time to soak in the bright lemon and sumac dressing. “If you can’t do it ahead, it’s not worth doing,” says Sohla El-Waylly. This recipe is part of Sohla’s Thanksgiving-for-two-or-maybe-eight feast, see the full menu here.Ingredients4 - 6 Servings¼cup extra-virgin olive oil¼cup raw pumpkin seeds (pepitas)Kosher salt, freshly ground pepper1lb. green beans⅓cup fresh lemon juice2tsp. sumac or 1 tsp. finely grated lemon zest1medium Asian pear1cup (lightly packed) parsley leaves with tender stemsPreparationStep 1Cook oil and pumpkin seeds (or use reserved cleaned seeds from Winter Squash Bharta) in a small saucepan over medium-high heat, stirring occasionally, until oil around seeds is sizzling and seeds are golden, about 4 minutes. Strain pumpkin seeds through a fine-mesh sieve into a small bowl; set oil aside. Transfer pumpkin seeds to a plate; immediately season with salt and pepper. Let cool.Step 2Working in batches if needed, cook green beans in a large pot of boiling salted water until bright green and crisp-tender, about 2 minutes. Using a slotted spoon, transfer to an ice water bath as you go.Step 3Whisk lemon juice and sumac in a large bowl; season with salt and pepper. Gradually stream in reserved oil, whisking constantly until incorporated. Working with 5–7 green beans at a time, line up beans and trim stem ends. Smash with a rolling pin to split open. Cut beans into 1\" pieces and transfer to bowl with dressing. Toss to coat and let sit at room temperature at least 1 hour or cover and chill up to 12 hours.Step 4When ready to serve, cut pear into ½\"-thick wedges, then halve crosswise. Add to green beans along with parsley and half of reserved pumpkin seeds; toss well. Top with remaining pumpkin seeds.How would you rate Smashed Green Beans With Lemony Sumac Dressing?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleI made tweaks of necessity, energy, and taste:\n*bottled lemon juice (lazybones plus lemons are pretty expensive right now)\n*no pears (I ordered one and they were out so it got cancelled)\n*swapped walnuts in for pepitas, and cooked them with a little ras el hanout - this melded really well with the sumac\n*did not marinate (thanks to the other reviews' warnings about the color change); just toss and eat\n\nI didn't know green beans would make popping sounds when you blanch them, so that was a neat discovery. I'd make this again with little variations until I got it down pat.BeckySeattle, WA2/13/2022Don't make this!!! Normally I'm pretty forgiving with recipes with the  thought that maybe it's just not to my taste or I didn't make it to the recipe. I followed it to the letter except  I didn't let it soak overnight  I tossed and served and yet it was still too lemony....no other flavors came through, not even the sumac. It was a waste of  a pound of organic  green beans and a not inexpensive  asian pear. I had to toss it in the garbage and I hate wasting food. DeeSacramento,  CA11/21/2021Honestly, didn’t love this. Didn’t even like it, frankly - as others have said, the lemon is overpowering and the beans turn an unappetizing yellow. This was my first go at using sumac, but I’m hesitant to try it again as I didn’t not love the flavor of the dish. Green beans are my favorite vegetable, and unfortunately I’ve found an application of them that I really dislike. Anonymous12/3/2020Made this as a side for our Thanksgiving meal. I cut down the recipe to half since we're just a family of 3 this year. We all really enjoyed this dish, especially amongst otherwise very heavy and buttery Thanksgiving dishes. I didn't have sumac but used some Lebanese zatar (which contains sumac) to replace it. I followed the recipe and let the beans marinated in the fridge for 1 hr before finalizing it. It didn't turn color at all as some others have said, but the leftovers I had did turn color overnight. I still ate it for lunch the next day and the beans were still crunchy. I think this would also make a great side dish for a BBQ!SagigirlDenver CO11/29/2020If you want to waste a perfectly good Asian pear, make this dish of mushy yellow beans! Everyone at the table thought this was awful. Cmon, Bon Appetit—did you test this?!Liz MooneyHaddonfield, NJ11/29/2020This would get five stars with one tweak: I would NOT marinade the green beans in advance; instead toss it all together right before serving.\n\nThe dressing itself is quite delicious. But after just a few hours of marinating, the lemony tanginess overpowered the green beans' freshness (and I normally love tangy foods). Everyone at the table was puckering up, and this dish got thrown away.\n\nAnd on an aesthetic note - when you marinate green beans in acid, they turn yellowish/brown, similar to the color of canned green beans. It's clear the photo example was not marinated per the recipe, which is misleading. You may not care about the aesthetics, but know it won't look like the picture.AnonymousLos Angeles, CA11/28/2020Overall quite good, though I’d make some tweaks to make it again. There seemed to be way more dressing than was necessary, so it pooled; I think this could be done with 2x the beans. Also, we let the beans sit for about an hour, and the acid changed the color from bright green to yellowy - didn’t affect the flavor, but bummer for presentation! And lastly I think I’d add some soy sauce to the dressing next time for a little more salt and flavor. Overall a tasty side though, and excellent for cutting through a very rich meal. Drey11/26/2020Very good but a bit of an odd combo - I would suggest adding even more pear.RachelNashville11/20/2020Could you trim and slice the green beans before cooking them (just smash them afterwards)?ArvidMaryland11/11/2020Explore Bon AppétitSaladGreen BeanVegetableSumacHerbs & SpicesFallSideDairy-FreeGluten-FreeVeganVegetarianHealthyishThanksgivingRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Sohla El-Waylly"]}