{"id": "d252f1604385f945730880d96f910452", "url": "https://www.bonappetit.com/story/strawberry-granola-crisp-recipe", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Make This Strawberry-Granola Crisp for Mother's Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake This Strawberry-Granola Crisp for Mother’s DayOn the holiday that may as well be called National Brunch Day, Deb Perelman advises skipping the endless mimosas in favor of breakfast at home.By Deb PerelmanMay 8, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie TheodorouFacebookTwitterEmailWelcome back to Picky Eaters’ Club, where Smitten Kitchen’s Deb Perelman reveals what she actually cooks for her two kids.At the top of the “Awesome Things to Do with Kids” list, right up there with taking long airplane rides and attending scholarly museum lectures, is going out to eat. There’s nothing small children are better suited for than going to restaurants where they’re expected to stay seated, order unfamiliar food, wait patiently for it to arrive from a backlogged kitchen, and then spend an hour or so eating it while making small talk.Which is why, since we had kids, special occasions when we previously might have gone out for a celebratory group meal are now spent cooking instead. You can make all the noise you want and nobody will hiss-shush you through clenched teeth. You don’t have to surrender your phone so your kids can watch Play-Doh videos in order to be able to converse with the family and friends you came out to see. And you never spend incomprehensible amounts of money for what is too often overcooked eggs and flabby bacon. At home our bacon is always crisp.Ever since we came to our senses, I’ve made Mother’s Day brunch for our extended families. Ostensibly it’s my gift to the mothers, but it’s secretly my gift to me. Being able to relax, let my kids be kids, and make the food that delights me is vastly more enjoyable than hoping my Bellini won’t arrive flat. I often make fruit crisps and crumbles, which I find to be a perfect brunch food, especially when the sugar is kept in check and the oat topping channels granola with olive oil, almonds, and maple syrup. I like to serve it warm or at room temperature with a dollop of yogurt; it’s a huge hit with adults and kids. Leftovers—if they exist—become a weekday breakfast that happens to be delicious cold from the fridge too.Get the recipe:Strawberry-Granola CrispBecause this crisp is barely sweetened, leaning into in-season berries instead of added sugar, it's a perfectly acceptable brunch or breakfast.View RecipeExplore Bon AppétitStrawberryCrispMother's DayPicky Eaters’ ClubRead MorecookingA Cheesy, Bready Dinner to Please the Pickiest Eaters in Your HouseholdBy Deb PerelmancookingThis Garlic Bread Is the Secret to Converting Bean HatersBy Deb PerelmancookingNo Picky Eater Wants to Eat Broccoli—Until You Add KetchupBy Deb PerelmancookingThese Spinach Artichoke Melts Are Where Dip Meets Grilled CheeseBy Deb PerelmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-08", "author": ["Condé Nast", "Deb Perelman"]}