{"id": "d265a960ba90e182bb9639070a7c42df", "url": "https://www.bonappetit.com/story/lamb-chops-for-dinner", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "It's Lamb Chops and Greek Salad for Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIt’s Lamb Chops and Greek Salad for DinnerLessons learned through a perfect meal.By Adam RapoportOctober 8, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.You cook, you learn—or at least you hope to.I did a bit of both this past Saturday night when Andy Baraghani came over for dinner.The first thing I realized—which I guess I kind of knew but never really thought about—is that if you have friends who love to cook, let them cook. Instead of asking them to bring a random bottle of wine, have them bring the makings of a dish that fits your menu. We all know that the best part of a dinner party is when you’re all hanging out in the kitchen cooking and drinking, so why not lean into that moment?For dinner, I splurged on some beautiful looking lamb chops, while Andy hit up the farmers market for a Greek salad and just-harvested potatoes.About that salad: Just because it’s early October doesn’t mean summer is completely over, even in the Northeast. Andy showed up with a riot of tiny, sweet-as-candy cherry tomatoes, which served as the base of a new-look Greek Salad that he developed for our August issue. No diner-style chopped up iceberg here. Instead a tangle of arugula, sweet red grilled peppers and, yeah, maybe we forgot to add the feta, but I’m not sure we needed it.Want this letter before it hits the website? Sign up for our newsletter!I learned my lesson the hard way when it came to the lamb chops. I bought some beautiful rib chops—you know, the kind that are cut from rack of lamb and are passed around at fancy country club weddings. Whenever I grill these over high heat, in order to get them nice and crispy but still medium-rare on the inside—I inevitably cause a raging inferno due to all that fat on the chops. They basically get incinerated and blackened and all smoky (not in a good way). From now on, I’m either going to be like my mom and crank up my broiler and throw the chops on a sheet pan, top rack, or I’m going to sear them off in a cast iron skillet (no flare ups!), with my hood cranked on high.Finally, those potatoes. Lesson: Why do I not always make crispy, smashed potatoes? Couldn’t be easier. Boil some smallish, thin-skinned potatoes, like Yukon golds, in well-salted water until just tender. Let cool a bit. Then flatten each one on a sheet pan, drizzle with a generous amount of olive, toss and salt, and slide into a 500-degree oven till all crispy and crunchy and gorgeous. You can be fancy like Andy and serve them atop a swoosh of homemade aioli, or get like Molly Baz and whip up a walnut dressing to go on top (watch her do it here). But, honestly, if you give me crispy, salty potatoes with some indoor-cooked lamb chops and a nice salad, I’m all good. Lesson learned.Get the recipes:New-and-Improved Greek SaladThe method for marinating the feta is also a good trick for other fresh cheeses—try goat, mozzarella, or paneer.View Recipe Lamb Chops Scottadito with Charred Cherry TomatoesView Recipe Crispy Smashed Potatoes With Walnut DressingAnd on top? A condiment made up of walnuts, anchovies, garlic, and red pepper flakes that’s the ultimate umami bomb.View RecipeExplore Bon AppétitAdam NewsletterLambPotatoSaladRead MorecookingBroccoli Bolognese Is an Anywhere, Anytime PastaBy Adam RapoportcookingSteak and Potatoes Night in AmericaBy Adam RapoportcookingThe Anatomy of the Perfect Breakfast TacoBy Adam RapoportcookingIt’s Time to Get Back to the KitchenBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-08", "author": ["Condé Nast", "Adam Rapoport"]}