{"id": "d2788cc2d922db1e33b9a8df2ad08ced", "url": "https://www.bonappetit.com/recipe/simple-ribollita", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Simple Ribollita  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSimple RibollitaBy Molly BazJanuary 20, 20194.7(205)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Jennifer OphirEmailPinterestPrintEmailPinterestPrintThe only thing better than soup with bread? Soup that not only has chunks of bread in it, but crunchy croutons on top as well. This (vegetarian!) Italian classic is about as comforting as it gets, packed with hearty greens, meaty beans, and plenty of rich olive oil and umami-packed Parmesan. A note on that cheese: If you've been throwing out your Parm rinds all these years, that stops right now. The rind is full of flavor, and makes a great addition to any broth-y, stewy situation.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonVegetable Peeler$10 At AmazonColander$11 At AmazonDutch Oven$80 At AmazonWooden Spoon$6 At AmazonLadle$8 At AmazonIngredients4–6 servings1large onion3medium carrots2celery stalks8garlic cloves2bunches Tuscan kale1small wedge of Parmesan with rind128-oz. can whole peeled tomatoes½loaf crusty country bread (about 10 oz.)⅓cup extra-virgin olive oil, plus more for drizzlingKosher salt114-oz. can cannellini beans¾tsp. crushed red pepper flakesPreparationStep 1Place a rack in middle of oven; preheat to 450°. Time to prep your veg! You are going to make a mirepoix, which is just a fancy French word for the combo of chopped onions, carrots, and celery that form the flavor base for a lot of European dishes. First, cut 1 large onion in half through root. Peel and discard skins. Finely chop and transfer to a medium bowl.Step 2Wash, peel, and trim 3 medium carrots. Cut in half (or in quarters lengthwise if they’re large), then cut crosswise into ½\" pieces. (You can also just chop the carrots down into coins if you don't mind larger pieces of veg in your soup.) Add to bowl with onion.Step 3Chop 2 celery stalks crosswise into ½\" pieces. Add to bowl with the rest of the mirepoix.Step 4Smash and peel 8 garlic cloves with the back of your knife. If any of them are left more or less intact after that initial smashing, give them another good wack with the back of your knife so they really open up and start to break apart. Add to bowl, also.Step 5Strip stems from 2 bunches Tuscan kale and discard. Wash if they're gritty or you really care about washing vegetables, then tear leaves into 2\" pieces; set aside.Step 6Cut rind off of 1 small Parmesan wedge; set aside.Step 7Place 28 oz. canned tomatoes and their juices in a strainer set inside a medium bowl. (You need that bowl to collect the juice, which you're going to use later—don't throw it out!)  Squeeze tomatoes and crush them with your hands while leaving them submerged in their liquid so they don’t squirt.Step 8Tear ½ loaf crusty country bread into 1½\" pieces.Step 9Heat ⅓ cup extra-virgin oil in a medium Dutch oven or heavy pot over medium. Add bowl of mirepoix and 2 tsp. salt and cook, stirring occasionally, until vegetables are softened but not browned, 8–10 minutes.Step 10Lift strainer full of tomatoes and give it a few shakes to remove any liquid. Add tomatoes (but not juices!) and cook, stirring occasionally, until some of the rawness is cooked off, about 10 minutes. Giving those tomato solids a chance to caramelize before adding the liquid back in helps to add a lot of flavor to the stew. (Remember: Reserve the juices, you’re going to use them!)Step 11While tomatoes are cooking, drain and rinse 14 oz. canned cannellini beans in the strainer you just used, then add to pot along with Parmesan rind, tomato juices, ¾ tsp. red pepper flakes, and 4 cups water. Bring to a simmer.Step 12Add kale in two additions, stirring often and allowing to wilt in between.Step 13Add about one-third of torn bread (no need to measure, just eyeball it) and cook, stirring occasionally, until coated and warmed through, about 5 minutes more. Taste and adjust seasoning.Step 14Remove from heat. Place remaining torn bread chunks on top of stew. Drizzle generously with olive oil.Step 15Transfer pot to oven and bake stew until thick, bubbling, and bread is golden brown on top, 10–15 minutes.Step 16Ladle stew into bowls, drizzle each generously with olive oil, and grate lots of Parmesan over.How would you rate Simple Ribollita?Leave a ReviewTell us what you thinkReviews (77)Back to TopTriangleHaving spent a lot of time in Tuscany, I have two comments:\n\nThe French call the onion-celery-carrot mixture of aromatics \"mirepoix\", but the Italians have their own word for it: \"Soffrito\" (2 \"fs\"-- \"sofrito\" spelled with1 \"f\"-- is Spanish, and slightly different.).  Sometimes fennel is substituted for the celery; sometimes garlic is added, but not necessarily.  \n\nAs for tomatoes: Tuscans do not use them all that much, and they are not traditional in \"la vera ribollita toscana\".  If you must add them, use only the solids-- DEFINITELY NOT TOMATO JUICE!  That's the stuff they serve tourists, and it is not authentic.Bill McKenneyAlexandria Virginia2/10/2022I came across this recipe this morning and made it this afternoon. It was AMAZING. When I first described it to my husband, he was very unsure of adding bread into the liquid. After I made it, the bread in the stew was his favorite part. The bread really absorbs the flavors and turn into (basically) a dumpling. This recipe is amazing and I’ll definitely make it agin. I used only 1 bunch of kale, added an additional can of beans, and used veggie broth instead of water as other reviews stated. SOO GOOD!! And it was pretty simple to make. Thank you very much!KarenAppleton, WI1/29/2022Stale miche half. No freezer space. I tried this recipe despite thought of soggy bread repulsing me, and man I'm glad I did. This is SO delicious and easy to make. Hands down a cold-weather weekday staple. Molly for the win!AynsleyMontreal, QC 1/28/2022Making this for the second time tonight! Some of the reviews had me nervous about soggy leftovers but they were delicious last time. Actually the flavors melded even more overnight. I personally like the crispy croutons more than the soaked bread so I'll skip the part of stirring the bread in this time. Subbing half the water for chicken broth worked great last time - this time I'll try all 4 cups of veggie broth to keep it vegetarian. I added a little fresh basil on top. Lots of imported cheese, fresh baked bread, and a good olive oil and you'll be in heaven!! Thinking about trying adding sausage, but the flavor of the veggies is so perfectly balanced as.GigiOakland, CA11/9/2021Mo salt? In the process of cooking it now. Will taste it when ready. If I think it better with salt, then I'll add some.\nAntoinette Zanon10/25/2021This dish is excellent and especially love the video how-tos. I had just purchased some borlotti or cranberry beans and had cooked them in the oven with rosemary, garlic, olive oil and water. Added the beans to this dish along with some of the wonderful bean broth and all the other ingredients including crusty sourdough with olives. Seriously, wow, just wow.GSusiePhilly, PA9/24/2021Tonight will be my 15th time making this soup - yes, I've been counting. My roommate has declared it his favorite of everything I've cooked.\n\nIt has a lovely flavor, chunky texture, and is great for a meatless dinner. Smashed garlic? Iconic. I have made it my own with a few modifications - three cans of beans instead of one, low sodium vegetable broth instead of water, and spinach instead of kale - but the foundation of the recipe is the best, and I've used it as a base for other soups/dishes.\n\nPS - My newfound addiction to Parmesan cheese wedges started with this recipe.VeronicaChicago, IL6/24/2021I followed this recipe almost exactly -- my only additions were a splash of red wine before the beans and rind went in (an Aglianico that paired perfectly, if you're looking for ideas), and a lot of black pepper because that's what my taste buds said. It was SO delicious. If I were to do things differently next time, I would be mistaken. Thanks Miss Baz. Courtney T.Minneapolis, MN4/28/2021It was so good! Even two days later with saturated bread, like dumplings.MJoPort Townsend, WA3/25/2021Great little soup with a lot going on! The only thing I would change is that I might add more cannellini beans; I'm doing meatless March, and I want to make sure I'm getting adequate protein. vanessaUtah3/11/2021We used lots of home cooked Marcella beans from Rancho Gordo and added a splash of white wine.\n\nBEST FOOD EVERMichelle3/3/2021FAMILY FAVE\neverybody loves thisTAYTAYNew Orleans2/19/2021This soup was easy to make and was delicious.  It was great for several days.  I’m making it again today.KDogNJ1/24/2021This was a success! Didn't have any crusty bread to hand, so I served it with the flatbread to the side rather than adding it into the stew. No modifications other than that! Delicious, simple, hearty, and seasonal - honestly, what else could you ask for in these bleak times.Two DotsUK1/7/2021Having lived in Florence for quite some time eating ribollita at least once a week, I was pleasantly surprised by how much this reminded me of the ones I had while living in Florence. Use a good chicken stock instead of water and use green Swiss chard.AnonymousManhattan, NYC12/4/2020Explore Bon AppétitSoupSoups and StewsItalianEuropeanKaleLeafy GreensVegetableTomatoCannellini BeanWhite BeanBeanParmesanCheeseFallWinterEasyMainNut-FreeVegetarianSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-20", "author": ["Condé Nast", "Molly Baz"]}