{"id": "d283fc9be6ecc9fe4f9bbea444e1a04f", "url": "https://www.bonappetit.com/story/kale-mushroom-strata-for-kids", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "A Cheesy, Bready Dinner to Please the Pickiest Eaters in Your Household | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Cheesy, Bready Dinner to Please the Pickiest Eaters in Your HouseholdHow does Smitten Kitchen’s Deb Perelman convince her two kids to eat mushrooms and kale for dinner? (Hint: The answer involves bread and cheese.) In her new column, the author explains.By Deb PerelmanOctober 25, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Molly BazFacebookTwitterEmailSometimes I think that people are on to me when I talk up a new recipe I made for dinner.“But did your kids eat that?”\n“No, did they really?”\n“Even the toddler, Deb?”And then I have to mumble the truth, which is that the toddler wasn’t hungry because she had already eaten three raspberries and a Cheerio.I’m exaggerating, but only a little. I have two kids. My nine-year-old son, Jacob, is the easy one. He’s a pretty normal fourth-grader, which is to say he’d still choose pizza, tacos, or spaghetti over most other things (who wouldn’t?). But he’s curious enough, so my husband and I can often talk him into trying new dishes, like, without bribery.Then there’s my daughter, Anna. She’s three and she is, frankly, the child I had coming after years of cooking whatever I wanted and having everyone go along with it. She likes...I wish I could tell you. There was the time she demolished a lamb chop. She ate a stuffed pasta shell last week, once she’d scraped off the sauce and emptied the shell of its contents. And that wasn’t even a bad Tuesday night. She’s immune to reason, to negotiating, to begging. But I’m about to tell you something that sends shock waves through parent friends and will absolutely result in a phone call from my mother-in-law when she reads this:I won’t go back to the kitchen and make another meal if my kids don’t like what I’ve cooked.Illustration by Jordan AwanI don’t aspire to unlock the Meanest, Most Terrible Mom Ever badge for refusing to be a short-order cook or to turn dinner into a battle of wills. I take this stance because I love cooking and want to protect this love by not burning out from preparing three dinners a night.What I do instead sounds radical but shouldn’t be: I cook what I crave, then tweak as needed to convince the kids to come along for the ride. I try to limit the number of ingredients I suspect they’re going to push back against to one—two, tops—per meal, because there’s no worse feeling than coming to the table and seeing nothing that you like to eat. I’d rather try to sell them on something I’m really excited about because I know it’s delicious than wear myself out making food that so zaps my cooking joy that I don’t want to make dinner again until they’re in college.This strata—essentially a savory bread pudding—was a recent success. Whenever I can, I like to treat meat as an accessory rather than the centerpiece. But kids are not renowned for their enthusiastic consumption of heaps of vegetables, so I home in on the ones I know they like. When all else fails, I blanket everything in melted cheese. I try to use more nutritional breads, like a whole wheat sourdough, and a greater portion of vegetables (there’s over a pound of greens and leeks in here) than anything else. The eggs provide protein, the cheese creates an irresistible bronzed lid, and the entire thing makes phenomenal leftovers reheated in the oven, which feels like winning the lottery.My daughter ate five whole bites of this before she realized what she’d done and shoved the rest away. This, my friends, is what we consider a home run.Get the recipe:Cheesy Kale and Mushroom StrataHere's how to convince kids to eat mushrooms and kale for dinner.View RecipeDeb Perelman is the author of two best-selling cookbooks inspired by her beloved blog, Smitten Kitchen.Explore Bon AppétitCooking For KidsWeeknightPicky Eaters’ ClubRead MorecultureThe Smitten Kitchen Is Back, and the Kitchen’s Still TinyBy Alex BeggsCreamy Tomato Soup with Cheese ToastiescookingThe Chicken Katsu Recipe Every Kid (and Adult) Will LoveBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-25", "author": ["Condé Nast", "Deb Perelman"]}