{"id": "d28d213d039ad32592fa9129d063ac2a", "url": "https://www.bonappetit.com/story/the-baking-step-you-can-skip", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "Why You Don't Really Need to Sift Flour  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Baking Step You Can (Pretty Much Always) SkipAnd even better, you won't have to wash your fine-mesh sieve. By Michelle LopezOctober 23, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl Jones FacebookTwitterEmailYou’ve probably come across a recipe that asks you to sift an ingredient (usually flour, cocoa powder, or confectioners’ sugar) before starting. But in my book Weeknight Baking,  I rarely call for sifting ingredients—and especially not flour. Why? Well, I think that sifting flour is often a waste of time.Traditionally, recipes ask you to sift ingredients as a way to aerate them and guarantee consistency between cup measurements, since cups of unsifted flour will vary widely in weight depending on how tightly the flour was packed in the bag. Back in the day, when wheat milling techniques weren’t as streamlined as they are now, flour was ground to inconsistent sizes, which lead to temperamental results. Sifting the flour helped promote consistency in recipe results by removing the larger particles that could potentially result in densely textured baked goods or even ones that would sink in the middle.But modern techniques have improved significantly since then. Now,  most commercial flour is refined and clump-free, meaning there’s no real need to sift it. (You should, however, use a kitchen scale to ensure that your cups of flour aren’t way heavier than the recipe developer’s.)That being said, take a look in the bag or container of flour before you start. If your flour has been sitting untouched for several months, then yeah, you’ll probably need to sift it. (The easiest and fastest way to do this is with a fine-mesh sieve: Invest in a large one, plop it over a big bowl, and dump the ingredient that needs to be sifted into it. Use a whisk to stir until the ingredient completely passes through the bottom of the sieve, lump-free.)But there’s a shortcut, too: Store your flour in a large, airtight container instead of its original bag. Use a fork or whisk to stir the flour before measuring it.And finally, if you’re making a dessert with an incredibly light batter that needs to be folded, by all means, sift your ingredients—it will make them less dense and easier to incorporate. But, if you’re working with a batter that can be mixed with an electric mixer, most of those flour clumps will likely work themselves out in the mixing process. Nice how life—and baking—just works itself out sometimes, right?Adapted from the book Weeknight Baking by Michelle Lopez. Copyright © 2019 by Michelle Lopez. Reprinted by permission of Simon & Schuster, Inc. All Rights Reserved.Explore Bon AppétitFlourDessertBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-23", "author": ["Condé Nast", "Michelle Lopez"]}