{"id": "d29ba79ef284eec7e2e11d21c7cd357f", "url": "https://www.bonappetit.com/story/roast-your-store-bought-gnocchi", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "Stop Boiling Your Store-Bought Gnocchi—Roast or Fry Them Instead | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingStop Boiling Your Store-Bought Gnocchi—Roast or Fry Them InsteadThink crisp and golden-brown—not waterlogged and gummy. By Sarah JampelJune 9, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeFacebookTwitterEmailWhile I’ve added a handful of new-to-me products to my pantry over the years—tomato achaar from Brooklyn Delhi, lemon-saffron marmalade from BRINS, oat milk baking chocolate from Raaka—the fundamentals remain the same: There’s a bin for pasta, a bin for seaweed, a bin for cans of coconut milk and chickpeas, a bin for condiments, a bin for chocolate, and a bin for beans and pulses. The bins stay the same!But in the year 2021, against all odds, I eked out a little space (and disrupted my careful organization) for store-bought gnocchi, a product I hadn’t consumed in decades. For years, I believed—wrongfully!—that because store-bought gnocchi paled in comparison to fresh gnocchi, it wasn’t worth buying. Instead, I’d save that fluffy, melt-in-your-mouth gnocchi experience for meals out or unstructured Saturdays when I had time to boil and rice potatoes before hand-shaping the dough into tens of tiny dumplings. (FWIW, ricotta gnocchi is much easier to manage.)This all changed when I learned from the brilliant recipe developer Ali Slagle that I was making a false comparison. Instead of judging store-bought dumplings against homemade ones, I should consider them a different ingredient entirely—and cook them accordingly.When you boil store-bought gnocchi like you would fresh, they have a tendency to get waterlogged and gummy. But, as Ali taught me, when you cook them in the oven or on the stove, with a bit of oil to facilitate browning, they crisp on the outside and stay chewy and soft in the middle, sort of like pan-fried Korean rice cakes or yaki mochi.In this recipe for Crispy Sheet Pan Gnocchi, the gnocchi get golden-brown in a hot oven, and a couple pints of cherry tomatoes, which roast alongside, burst in the high heat to form a low-maintenance sauce that prevents the dish from being too dry. Shelf-stable gnocchi—the kind you’ll find vacuum-sealed in the pasta aisle—work just as well as the boxes in the refrigerated section near the fresh noodles. The texture will vary slightly depending on the exact brand and style of gnocchi you use, but it’s simple to adjust the cook-time accordingly.No matter what store-bought gnocchi you use, they’re not feather-light or pillow-soft as the best potato gnocchi ought to be—but, in the end, that’s exactly the point.Sheet-Pan GnocchiThis gnocchi (Is it pasta? Is it a salad?) with a jammy cherry tomato sauce takes just 25 minutes and one pan.View RecipeExplore Bon AppétittechniqueBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-09", "author": ["Condé Nast", "Sarah Jampel"]}