{"id": "d29e71b6788c61a6b042191bd363ab81", "url": "https://www.bonappetit.com/story/4-globally-inspired-winter-dishes-made-for-staying-in", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "4 Globally Inspired Winter Dishes Made For Staying In | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored4 Globally Inspired Winter Dishes Made For Staying InWhile nothing says winter hibernation like a good ‘ole casserole, you can only tolerate so many one-pot meals. However, with the right spices, fresh ingredients, and Campbell’s® soup and Swanson® broth on hand, it’s easy to transform a traditional winter dinner into a global feast you don’t have to leave your house for. What’s even better: These dishes make amazing leftovers, too. Ready to mix things up?By Campbell'sJanuary 28, 2019FacebookTwitterEmailFacebookTwitterEmailSmoky Green Chicken PozoleForget the burritos and hard-shell kits when you’re craving something south of the border. This Mexican stew is made with flavorful Swanson Chicken Broth and finished with a dash or two of smoky mezcal. If you’re looking for something a little heartier, add beans and top it off with a colorful array of radishes, cabbage, chopped onion, cilantro, and lime.Sticky Pomegranate & Ginger ChickenGather your friends for game night and wow them with this robust, Persian-inspired dish made with a base of Swanson Chicken Stock, onion, and ginger. After braising the chicken thighs, serve with pomegranate seeds, jalapenos, and cilantro. It’s the perfect marriage of flavor and texture. As for your friends? They may not leave.Creamed Green, Mushroom, & Corn Slab PieYou don’t have to be from down south to appreciate this hearty dish that combines fresh veggies and leeks with another homemade favorite: Pie. This nourishing, savory mélange is easy to make (and easier to eat). Just mix your vegetables with Campbell’s Condensed Cream of Mushroom Soup, pour it into your rolled-out pie crust, and bake.Vietnamese Braised Short RibsGet the global flavor of your favorite pho without leaving the comfort of home. Onion, ginger, carrots, cilantro, and fish sauce enhance the finish on these short ribs. Braised in Swanson Beef Stock with Vietnamese aromatics, then served over rice and topped with carrots and fresh herbs, it’s the perfect meal for curling up on the couch this winter.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-28", "author": ["Condé Nast"]}