{"id": "d2ad913fcd8c2bf3a1a3ea05609549ea", "url": "https://www.bonappetit.com/story/elizabeth-acevedo-mama-rosa-lasagna", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Lasagna De Carne: Despite the Heaviness I Carried, I Kept Stirring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDespite the Heaviness I Carried, I Kept StirringCooking the annual lasagna de carne was always Mami’s territory—until the year I had no choice but to take over.By Elizabeth AcevedoNovember 23, 2021FacebookTwitterEmailPhotograph by Emma Fishman. Food Styling by Pearl JonesFacebookTwitterEmailThis is All on the Table, a column featuring writers we love sharing stories of food, conflict, and community.It was my job to trim the ruffled edges off the boiled lasagna sheets. My mother—a cook so particular she once remade the chicken at a friend’s dinner party because it looked “too pale”—does not abide by anything but straight-edged pasta. “It’s the only way to get an even texture,” she’d say, and that was important when it came to lasagna de carne, the centerpiece of our family’s annual New Year’s Eve feast. From a young age I considered cooking to be Mami’s domain and hers alone. Oh, I’d chop beets for the ensalada rusa and grate carrots for the macaroni salad, but I was just following orders until she turned her back and I could return to my novels and video games.Every New Year’s Eve my father would buy almonds and chestnuts, a well-worn nutcracker at the ready. There would be ice-cold beers and Manischewitz, his preferred holiday wine. With Mami’s alchemy filling the air—garlicky tomatoes smothered in bubbly cheese—we’d begin getting ready. Hair in rollers, button-down shirts, a family of pomp and circumstance even if the only place we’d party was our tiny two-bedroom in Morningside Heights. We greeted the new year as a unit: eyes on the TV, incense in the air, stomachs full.Then came New Year’s Eve 2009. The year we unbecame who we’d been. Back home in New York for winter break, I was with a few sorority sisters when my eldest sibling called: My brother Rob was in the hospital. He’d had another episode.For over a year we’d all watched as Rob struggled. He’d become silent. Fascinated with dark rooms. Full of angry, baseless accusations. He was never violent, but harm comes in many forms. Doctors from New York-Presbyterian told us that they believed it was paranoid schizophrenia.We are a Dominican-ass family, quite superstitious. Pennies on our foreheads to stop nosebleeds. Sacraments to guarantee entry to heaven. My mother still strongly believes dreams tell us when someone’s going to die. But we had no experience dealing with mental health.My parents called 911 on December 30. I joined them at the hospital, then went home while they handled the paperwork. The kitchen was in disarray; Mami had been preparing beef for the lasagna when things got hectic. She’d managed to get it into the fridge, but that was all.I don’t know why I did it. We did not have much to celebrate. There were no chestnuts, no music. Perhaps I thought the only thing holding us loosely together was the idea of a better day, a better decade, better care that might result in better health for a beloved. Perhaps I just wanted to scramble toward normal, grasp onto a bit of comfort and routine. So I tried to remember the basic steps: the boiling, the removal of crinkles, the vamping up of jarred tomato sauce. The layers and layers. Alone, I stacked my grief. I cooked through tears. By the time my mother returned from the hospital, I was elbow deep in ground beef.Standing by the door she watched me with unseeing eyes. So I asked for advice—just to say something, to coax her into familiarity. I asked about the base and she told me to add cilantrico. She talked me through puréeing the garlic. She told me to put un poquito de salsa de tomate here, to make sure the last layer had a perfect capa of mozzarella.Some time before midnight my father turned on the TV. I wore jeans, pomp and circumstance forgotten. Maybe Mami had on lipstick, but I doubt it. I couldn’t tell you if the lasagna tasted good, or if I tasted it at all. I do remember not having mastered the ability to cook ground meat without clumps and that it showed in my layers. But my mother ate her serving without critique…or recooking. Then she packed some in Tupperware to take to my brother.Watching a relay race I’m always drawn to the moment when the two racers run side by side. That second before the baton gets passed is magical: liminality suspended, a seamless dance begun, letting someone else do the sprinting while you catch your breath. New Year’s Eve wasn’t supposed to be a metaphor, but there we were: me holding my hand over my mother’s and a big metal spoon, breathing deeply and encouraging each other to hold on, to keep stirring. There was a new decade to greet, and despite the heaviness we carried as we entered it, we would need to be well-fed.Get the Recipe:Mamá Rosa’s Lasagna de CarneThe secret to lasagna de carne that packs a wallop of flavor? An herby sofrito that cooks with the beef until toasty and caramelized.View RecipeExplore Bon AppétitAll on the TablecookingCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Elizabeth Acevedo"]}