{"id": "d2b053d7c7f23839edc10387d3a7346b", "url": "https://www.bonappetit.com/story/how-to-find-a-cbd-product-that-works", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "How To Find a CBD Product That Works | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHow To Find a CBD Product That WorksBy SoRSEMarch 12, 2020FacebookTwitterEmailFacebookTwitterEmailImagine this scenario—you’re scanning the beverage aisle at your local grocery store. Between the cold brew coffee and sparkling waters, a new drink catches your eye with “CBD” emblazoned on the front. You remember hearing a lot about it and the purported health benefits. You’re curious, but you don’t really know where to start when it comes to understanding why or how you should be using CBD.For an ingredient that is believed to have healing abilities and help with anxiety, it can be stressful finding a CBD (cannabidiol) product that fits your lifestyle while delivering the desired effect. CBD has taken the wellness industry by storm, but not without a lot of questions. Because CBD has the potential for healing, precision and care must be taken in how it’s processed and packaged. Because CBD is a relatively new ingredient, that means that from a product development standpoint, the industry isn’t as familiar with it, leaving regulators and consumers in the dark at times.If you’ve ever wondered why you can’t feel anything after trying one CBD drink but feel great after sampling other brands, here are a number of factors that contribute to that. Inconsistency in consumer experience has sparked a movement to bring more transparency and quality control to CBD. How does someone separate the brands that work from those that don’t? From determining the appropriate dose to the best product to deliver it, here’s how to buy a CBD product that works.Look at the doseThe first thing you should be exploring is what dose might work for you. Everyone has an Endocannabinoid System (ECS), a molecular system responsible for regulating functions in the body, including immune response, communication between cells, appetite, and metabolism. Because each of our ECS’s are different, everyone needs a different dose. In addition to dose, the consistency a product can deliver is important. This consistency is heavily dependent on the infusion method of the CBD in the finished product. When trying CBD drinks and even tinctures, you may see instructions like “Shake before consuming.” This means that the CBD is not evenly dispersed, leading to a different experience and effect on your ECS every time you consume. When buying CBD products, particularly beverages, look for a brand that uses water-soluble CBD and hemp emulsions. What this means is that the CBD is converted from an oil to a water-soluble formula that disperses evenly throughout the finished good, leading to a reliable chill.Understanding bioavailabilityIf you’re new to the CBD game, chances are you haven’t heard about bioavailability. Bioavailability measures how much of the product’s intended active ingredients make it into your bloodstream for you to feel an effect. This is particularly important for CBD due to the fact that if your body doesn’t absorb it, you won’t receive the intended benefits. CBD is an oil and can take one to two hours to have an impact if ingested in that form. Emulsion technology breaks oil down into small particle sizes for even dispersal, which allows for greater absorption in the intestinal tract for maximum bioavailability, so consumers experience the effects of cannabinoids as early as eight minutes after ingestion. According to Scott Riefler, Certified Food Scientist and SōRSE Technology’s Chief Science Officer: “If you want to feel the effects of CBD or any other cannabinoid more quickly, you need to look for products using water-soluble emulsion technology. CBD and other cannabinoid-infused products have to deliver more quickly because consumers are eager to feel the effects.”How to know what products are using water-soluble emulsion technologyHow can you tell if a brand is using emulsion technology? As mentioned earlier, a beverage with the instructions that say “Shake well” may not be using a shelf-stable CBD solution. It’s important for the formula to remain homogenous, i.e. not look like a separated vinaigrette. If you can see separation, it’s likely not going to deliver an even dose from beginning to end. Typically, when a product is encapsulated, you will see “water-soluble cannabinoids” or “emulsion technology” on the label. The best-case scenario is the brand is transparent, sharing the encapsulation method they use. An example of this would be SōRSE Technology’s “Powered by SōRSE” seal. SōRSE is an industry leader in safety, quality, and stability on finished goods. Michael Flemmens, the VP of Technical Business Development for SōRSE, explains that “When you are buying a product that is ‘Powered by SōRSE,’ you are guaranteed safe ingredients, accurate dosing, and consistency in experience backed by over 150 years of food and beverage experience.” While all SōRSE ingredients are listed in the finished goods’ ingredient list label, SōRSE makes it easy to dig deeper on quality, safety testing, and documentation.Understanding the difference between isolate, full, and broad spectrum CBDAnother piece of the CBD label puzzle is knowing the difference between the different types of hemp-distillation processes. CBD comes from the hemp flower, and like any flower, it has a range of chemicals and fragrances within it. CBD is one of many chemicals in hemp that can trigger a response within your ECS. There are three ways to distill the CBD extracted from the hemp flower and then use it in a product:  isolate, broad spectrum, and full spectrum. The easiest way to think about this is Vitamin C. A Vitamin C supplement will contain only that single chemical: Vitamin C. An orange not only contains Vitamin C, but a host of other minerals and fragrances that can impact its nutritional value. A CBD isolate is just like Vitamin C; it’s an isolated compound. Most clinical studies you see use CBD isolate, as scientists need consistency. Broad spectrum is everything in the hemp plant including its terpenes (fragrance) and potentially minor cannabinoids except for the THC, which is taken out. Full spectrum has everything in the plant in addition to a small amount of THC -- under 0.3%. You can’t get “high” from full spectrum, but if drug testing is a concern, it's not worth the risk.In terms of taste, due to the flavors being maintained in the distillation process, full spectrum and broad spectrum will have an earthy flavor. When it comes to wanting a true “full spectrum” effect with minor cannabinoids like CBG, CBN, and CBC in addition to THC, the amount you have in a “full spectrum” completely depends on the quality of the hemp strain. While full spectrum and broad spectrum in theory means the product has a range of compounds, you always need to check a Certificate of Analysis to be sure.Look for COAsFinally, when buying CBD products, do your homework and check brands for their documentation. Certificate of Analysis (COAs) should be industry standard, but many brands do not share batch-level analysis. COAs include potency testing, ensuring the dosage is correctly represented on packaging; microbial testing; and any other ingredients in the product. For example, many brands will claim “full spectrum” while only containing CBD. Where does one find a COA? Typically on the company’s website and according to New York’s latest hemp bill, soon every product will have a QR code for consumers to scan and see where their products are traced. Mike Schmitt, Regulatory Manager at SōRSE Technology, notes, “CBD products like Mad Tasty publish their COA so the consumer can rest assured that they’re getting what they paid for.” Schmitt also explained that in sharing COAs and third-party testing, public trust can be established in this emerging market. If a brand won’t share a COA, find a brand that’s transparent.Until more regulation or self-imposed transparency becomes industry standard, you’ll need to do a little research if you want to make sure your CBD product works. For things like beverages, where much is based on how the CBD is made, processed and formulated, not everything on shelves will provide the same experience. Hopefully, after following these steps, you’ll never have to ask yourself, “Did I get the CBD I paid for?”Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-11", "author": ["Condé Nast"]}