{"id": "d2b1cf27992dafb9075fc059344b4f39", "url": "https://www.bonappetit.com/story/all-about-tempeh", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "What Is Tempeh, Where Does It Come From, And How Can You Use It In Your Cooking? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTempeh Is More Than a Versatile Superfood—It’s Also a Way of LifePan-fried or deep-fried, battered or braised, simmered or steamed, tempeh can do it all.By Lara LeeJune 4, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah MortonFacebookTwitterEmailWhenever I lack inspiration in the kitchen, I reach for tempeh (“tempe” in Indonesian). This versatile fermented soybean cake is multi-dimensional; when deep-fried it transforms into crunchy, nutty-flavored bites of umami that even my toddler, on his fussiest of days, gobbles down. But most of all, tempeh represents Indonesia for me, the place where my dad was born, a taste of my heritage.What is tempeh and where is it from?Tempeh (pronounced “tem-pay”) has been hailed as a superfood for some time, but for many people, the cultured soy-based protein remains largely unfamiliar. In Indonesia, where tempeh originated, however, it’s widely used across the full culinary landscape, a celebrated staple that is part of the everyday diet.Tempeh can be traced back 400 years (and possibly more than 1,000 years!) to the island of Java, where it holds great cultural significance. Considered “the pride of Indonesia,” according to culinary expert William Wongso, tempeh is an accessible and cheap source of protein for Indonesians in a country where meat is not eaten daily due to its expense and is typically reserved for ceremonious occasions or restaurant meals. In its place, Indonesians consume seven kilograms of tempeh per person annually, served day to day with a combination of tofu, vegetables, rice, sambal, and seafood.For a period of time after Indonesia’s independence from the Dutch in 1945, tempeh’s popularity waned. In President Sukarno’s famous speech to the new country, he declared, “We are a great nation, we are not a tempeh nation,” using tempeh as a metaphor for weakness and capitulation. For decades following, tempeh was looked down upon by the Indonesian upper class, but over time it regained its former glory.How is tempeh prepared and what does it taste like?Tempeh is enjoyed in a variety of ways: deep-fried, pan-fried, battered, stir-fried, grilled, steamed, boiled, simmered.Deep-frying tempeh amplifies its prized umami flavor and savory meatiness, making it a versatile ingredient that works across multiple cuisines and food cultures. When eaten as a traditional snack in Indonesia, tempeh is always deep-fried. Tempe goreng is marinated in ground coriander and garlic before being deep-fried; it’s best served with the hot chile condiment sambal or with whole Thai chiles on the side. Keripik tempe, or “tempeh chips,” are dusted with rice flour and tapioca flour, then seasoned with a spice paste of candlenuts, kencur, coriander seeds, and garlic. Kering tempe combines deep-fried tempeh with a sticky glaze of spices, makrut lime leaf, palm sugar, and crunchy peanuts, a moreish snack that preserves tempeh for up to a month in an airtight container.Tempeh is mashed or blended with other ingredients to become a fritter (before being deep-fried, of course) in mendol tempe and perkedel tempe. And for tempe mendoan, thin slices of tempeh are coated in a spice paste–infused batter, then deep-fried.Tempeh can also be pan-fried rather than deep-fried. For my version of tempe manis, I pan-fry tempeh, then glaze it in a spicy kecap manis and palm sugar–sweetened sauce fragrant with chile, garlic, shallots, bruised lemongrass, and makrut lime leaf. In her book Indorock, Dutch-Indonesian food writer Vanja van der Leeden suggests making tempeh “rocks”: Crumble the tempeh into small bits, pan-fry in hot oil until browned, then combine with lime, garlic, ginger, kecap manis, peanut butter, sambal, and maple syrup for a sticky, finger-licking combination with incredible crunch.In addition to being fried in oil, tempeh can also be simmered so that it acts as a sponge, soaking up marinades and sauces while imparting its nutty earthiness. In tempe bacem, the tempeh is simmered in a fragrant palm sugar broth before being deep-fried, locking in texture and flavor. Another favorite is sayur lodeh, where the tempeh is simmered and served softened in a stew combined with vegetables, coconut milk, and a turmeric-gold spice paste.Aged tempeh (tempe semangit) has the funky, ripe aroma of Camembert cheese. In East and Central Java, aged tempeh is ground into a paste and combined with spices and coconut milk to create sambal tumpang, a strong-flavored sauce that’s drizzled over boiled vegetables.Tempeh is also fast becoming a favorite food of the plant-based community, where it is added to salads, noodles, tacos, sandwiches, and stews or combined with spices and marinades to become tempeh bacon and tempeh burgers.Pan-fry tempeh, then use it to top noodles, salads, grain bowls, etc., etc., etc.\nPhoto by Alex Lau, Food Styling by Sue LiHow is tempeh made?The production of tempeh is a time-honored tradition and its unique flavor is a result of fermentation. With a little know-how, you can even make your own fresh tempeh at home. To make tempeh, soybeans are washed, brought to a boil, soaked overnight, hulled, cooked for 45 minutes to 1 hour, drained, and cooled. Then the soybeans are mixed with a fungus known as Rhizopus oligosporus that grows on Javanese hibiscus and teak leaves (you can also purchase a starter), although there are many Rhizopus strains that can be used to make tempeh. The soybeans and starter are typically wrapped in banana leaves or plastic bags and then fermented for 24–48 hours. During fermentation, the beans bind together with mushroom mycelium that grows from the starter fungus, becoming a dense, smooth network of white fibers that transforms the tempeh into a firm and solid cake.You can purchase both fresh and pasteurized tempeh (I’ve listed some of my favorite producers below). Pasteurized tempeh is made by introducing high heat, which stops the fermentation process and deactivates spoilage bacteria to slow deterioration, but there are differences. Fresh tempeh, white in color, is the kind you will find in Indonesia and from artisan producers. It tastes livelier, with a creamy, meaty texture and a brighter mushroomy flavor. Pasteurized tempeh, on the other hand, is tan in color and the flavor is more subtle and a little more bitter. But whereas fresh tempeh is at its best for 3–5 days, pasteurized tempeh has a longer shelf life, which means it’s more widely available. Both work well in tempeh recipes, but if you can source fresh, it is worth seeking out.What makes tempeh so nutritious?Tempeh is the world’s richest plant-based source of vitamin B12 and shares the same high protein content as beef. It’s also highly digestible compared to other soy and bean products because the fermentation process enables nutrients to become more soluble (in other words, it gives you all the good stuff without the gas). In addition, it’s low in saturated fat, has no cholesterol, and contains fiber, iron, and all eight essential amino acids (the building blocks of protein).A way of lifeThis cultured soy-based protein might finally be gaining the cult status it deserves with food writers and food bloggers, but for Indonesians, tempeh is a way of life (and has been for centuries). “Tempeh is my blood,” Rustono, a Javanese tempeh producer in Kyoto, Japan, nicknamed the King of Tempeh, told me. As Wida Winarno, the founder of the Indonesian Tempe Movement, put it, she “needs a lifetime to talk about tempeh.”I wholeheartedly agree. The more I learn about this ancient food, the more I want to cook with it. “The mould in tempeh breathes and grows, so Indonesians who make it take care of it like their children,” Rustono told Good News From Indonesia. I myself have just ordered my first make-at-home tempeh kit from The Tempeh Man, and I’m ready to tuck my soybeans in tight and for tempeh to become my way of life.Where to buy tempehWhile it’s likely that you can find tempeh from large-scale producers at your local grocery store, there are also smaller artisan tempeh makers across the U.S. (and the globe) whose products are worth seeking out:Squirrel & Crow Tempeh, Portland, ORBarry’s Tempeh, New YorkBeCultured Tempeh, MiamiArto Moro Tempeh, Gainesville, FLThe Brinery, Ann Arbor, MIMaui Tempeh, Hawai'iChaotic Good Tempeh, RichmondBOStempeh, BostonNyonya Lucy’s Tempeh, OklahomaKITA, AustinKnosh Tempeh, MontrealProtempeh, U.K.Tiba Tempeh, U.K.The Tempeh Man, U.K.Tempt Me Tempeh, U.K.Rusto’s Tempeh, Japan (also Mexico)iniTempe Bali, IndonesiaReady, set, cook tempeh!Sambal Goreng TempeToasty, nutty fried tempeh coated in a caramelized spice paste—plus lots of vegetables for good measure.View RecipeLara Lee is an Indonesian and Australian chef, writer, and caterer. Her first cookbook is ‘Coconut & Sambal.’Explore Bon AppétitSoysoybeanIndonesianTempehBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-01", "author": ["Condé Nast", "Lara Lee"]}