{"id": "d2b2b2568304cb4c42b1fbc66362106a", "url": "https://www.bonappetit.com/recipe/soy-and-scallion-tofu-bowl", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Soy and Scallion Tofu Bowl Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueSoy and Scallion Tofu BowlBy Chris MoroccoFebruary 9, 20214.5(91)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintTadashi Ono’s Soboro Beef—cooked ground meat seasoned with sake, mirin, and soy sauce—from our December 2015 issue inspired this simple approach to turning (grated!) tofu into a filling lunch in minutes.Ingredients2 - 4 servings114-oz. block firm or extra-firm tofu, drained2Tbsp. vegetable oil2garlic cloves, smashed1Tbsp. toasted sesame seeds, plus more for serving1tsp. Aleppo-style pepper or ½ tsp. crushed red pepper flakes, plus more for serving3scallions, chopped into 1\" pieces3Tbsp. soy sauce2Tbsp. mirin (sweet Japanese rice wine) or 1 Tbsp. pure maple syrup2Tbsp. unsalted butterCooked white rice (for serving)PreparationStep 1Squeeze tofu over a bowl to expel as much water as possible (don’t worry if it starts to break apart). Grate on the large holes of a box grater; set aside.Step 2Heat oil and garlic in a large nonstick skillet over medium. Cook, turning once, until garlic is golden, about 3 minutes. Add 1 Tbsp. sesame seeds and 1 tsp. Aleppo-style pepper and cook, stirring, until fragrant, about 30 seconds. Add tofu, increase heat to medium-high, and cook, tossing occasionally and breaking tofu apart with a wooden spoon, until it begins to crisp in spots, about 5 minutes. Stir in scallions, soy sauce, mirin, and butter and cook until liquid is almost completely evaporated, about 3 minutes.Step 3Divide rice among shallow bowls and spoon tofu mixture over; top with more sesame seeds and Aleppo-style pepper.How would you rate Soy and Scallion Tofu Bowl?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleDelicious!  Liked the texture of the tofu after grating and cooking.  I did press my block of extra-firm tofu all day to get out any excess moisture, but followed the rest of the recipe exactly.LaurieFairport, NY1/3/2022This was surprisingly good. I'm a vegetarian, and have used a lot of different methods of cooking tofu so that it's flavorful and not watery, and this was the easiest and one of the best. I'd use this method again for different flavor profiles (cumin and spices for tofu tacos, maybe).Anonymous12/10/2021I loved this! I love tofu so I'm always looking for more tofu recipes to try.  I added gochujang, hoisin for a little more flavor plus I used red chili flakes bc that's what I had. Omg it was soooo good! I'm definitely making this again!Fia Oakland, CA 9/1/2021LOVE this!  I follow the recipe exactly, except that I dice my green onions smaller because I just don't like them to be \"noticeable\" in the finished dish.    I drain FIRM tofu in a mesh strainer for several hours before using the grater.  The result is a very fine crumbled texture - similar to what other reviewers have described as \"meaty\".  I agree that it could likely be used to fill a dumpling!   I've been keeping some in my fridge regularly for a tasty post-workout snack that won't upset my stomach and keeps the hunger pangs away while I am making dinner. Have made this every week since the recipe was published! 2RalphsPhiladelphia, PA8/25/2021So simple but so delicious! I used gochugaru instead of the Aleppo pepper. I would advise adding the spices/sesame seeds after the tofu as they burn rather easily. AlexGreenville, SC8/21/2021Very lovely flavors as written. The butter really was delicious. No Aleppo pepper  so used  Korean chili flakes but next time might try Szechuan pepper flakes. Stirred in  quickly blanched sugar snap peas and left over broccoli.LynnNYC8/3/2021Delicious! Suspiciously easy! That quick, weeknight tofu dish I’ve been dreaming of. Modifications I experimented with to excellent results: slipping the tofu between two heavy cutting boards and cloth in the morning so it’s nice and dry by dinner time. Mincing a heaping handful of shiitakes and a thumb of fresh ginger and sautéing them with the tofu for extra flavor and nutrition (agree the tofu had to fry about ten minutes or more to get to a crispy state). Topped with Fly By Jing Sichuan Chili Crisp, toasted peanuts, cilantro, wrapped up in lettuce leaves and served with a heap of garlic long beans. No more blocks of forgotten tofu going bad in the fridge. Thanks, Chris! MorganWoodstock, NY7/5/2021One of my favorite week night dinners, I serve it over crisp tender string beans and top with chopped peanuts. No carb needed. So delicious. AnonymousNJ7/2/2021Great recipe for any weeknight meal. After reading the comments about flavour, I added a heaping tablespoon of hoisin sauce to up the flavour profile. I used chilli pepper flakes in the pan and also topped with a bit of Sambal Oelek. For lunch the next day, it all 'fried' up well in a pan. A very easy recipe to add more veggies. \n\nPS - I used medium-firm tofu, squished it all day to remove the liquid, and just crumbled it up with my hands. Ali MarieVancouver, BC4/28/2021Alright this is delicious! An easy dinner that can truly be on the table in less than 30 minutes no problem. I do like the box grater texture but agree with the other commenter that a whole bunch of scallions is the way to go. A squeeze of hoisin sauce never hurts either. We like this with broccoli or really any other veg you’ve got on hand! LindsayVancouver, BC4/28/2021This was VERY delicious and super simple,  and my 8 and 10 yo loved it!  I agree with others that the tofu must be very dry to 1 - make the grating possible (otherwise it is the same result to crumble by hand) and 2 - achieve a crispy end product.  I added a dash of sesame oil, sautéed some snap peas to put on the side and topped it with crushed peanuts and chili crunch.  Excellent.AAmielDenver4/15/2021What an inventive way to use tofu!  The scallions tend to disappear so I used the whole bunch.  Well-browned mushrooms might be a welcome addition.  We had this for dinner and it was simple and delicious.  Will make again.Bon Appetit fanAshland, OR4/1/2021SO GOOD and so easy! I loved this box grater method. This recipe is simple and easy to customize with your own sauce/seasoning preferences. I added a little fish sauce, lime, and cilantro to the mix. Literally my favorite tofu dish I've made, and I'm a vegetarian so I've eaten a lot of tofu!! It has a very meaty texture that I've been missing with vegetarian food.AmandoBrooklyn, NY3/27/2021My boyfriend & I found this quite tasty. And it’s easy which always makes it better! I browned my tofu for longer than it said (but we both like stuff extra brown & crispy). I also added a diced red bell pepper & a diced carrot! It was great leftover for lunch. Nice & light. AnonymousSouth Carolina 3/21/2021Absolute disaster.Anonymous3/21/2021Explore Bon AppétitRice and Grain BowlAsianJapaneseEast AsianScallionOnionVegetableTofuOther IngredientsRiceRice & GrainsEasyQuickWeeknight MealsOne-Pot MealsMainVegetarianHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Chris Morocco"]}