{"id": "d2bc3ca6fa0e6d2b108a27f35c6ba2ff", "url": "https://www.bonappetit.com/story/the-simple-is-best-stuffing-we-make-year-after-year", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "The Simple Stuffing Recipe BA Editors Make Year After Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Simple-Is-Best Stuffing BA Editors Make Year After YearI'd be happy with a stuffing-only Thanksgiving, TBH. By Emily SchultzNovember 22, 2019FacebookTwitterEmailPhoto By Christopher TestaniFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.There are objectively good things in this world, like the first warm day of spring or glancing up from the restaurant table to see the server bringing your food. Then there are subjectively good things, based on your personal preferences. (Mine just so happen to be the episode of Jersey Shore where they go on vacation to Riccione, Italy and biting into a still-warm slice from Scarr’s, if you wanted some examples). A factually good thing versus something you as an individual can’t get enough of. And when it comes to objectively good versus subjectively good in the realm of Thanksgiving, this stuffing falls into the objectively good category. (If you don’t believe me, just ask the legion of other BA staffers who have been making this stuffing year after year.)First, let’s start with the fact that it gets cooked outside of the bird. When you cook stuffing in the bird, it’ll never get crispy. And while it’s true that stuffing is all about that wonderful custardy, soggy texture, I’d like to argue that the soggy is nothing without the crunchy—a bite of both is, objectively-speaking, perfection. Because you bake this one uncovered for the last 40 minutes, the top layer of craggly pieces of torn bread crisp while the middle of the stuffing remains custardy.Speaking of that custardy inside, it happens because of eggs and lots of broth. I’m not going to sit here on my broth-covered throne (it’s damp up here!) and tell you I’ve only made this stuffing with homemade stock. I’ve used the box stuff—and it works! But if you are planning ahead, make some chicken broth this weekend and store it in your freezer until it’s stuffing time.And as for the other stuff? It’s onion and celery cooked in butter until lightly browned, then mixed with sage, parsley, rosemary, and thyme—some objectively Thanksgiving-y herbs. So essentially, a lot of extremely simple ingredients get thrown together to make the best stuffing, and for that you can’t be anything but objectively happy to scoop even more onto your almost-too-full Thanksgiving plate.Get the recipe:Simple Is Best DressingThis easy stuffing recipe, or dressing if you prefer, will be a staple on your Thanksgiving dinner menu for years to come. View RecipeExplore Bon AppétitThanksgivingStuffingNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-22", "author": ["Condé Nast", "Emily Schultz"]}