{"id": "d2bdd0cc6ad8e554f53497e48b6851b5", "url": "https://www.bonappetit.com/recipe/roast-chicken-and-carrots-with-mustard-and-thyme", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Panko-Crusted Roast Chicken Thighs with Mustard and Thyme Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssuePanko-Crusted Roast Chicken Thighs with Mustard and ThymeBy Jenny RosenstrachJanuary 9, 20184.7(40)Read ReviewsTriangleEmailPinterestPrintBobbi LinEmailPinterestPrintEmailPinterestPrintWho isn’t looking for a quick-to-make, easy-to-love dinner for busy weeknights? This roast chicken recipe will become one of your MVPs.Ingredients4 servings ¾cup panko (Japanese breadcrumbs, read more about other ways to use them here)4tablespoons unsalted butter, room temperature¼cup Dijon mustard2tablespoons thyme leaves, plus 3 sprigs8skin-on, bone-in chicken thighs, patted dryKosher salt, freshly ground pepper1pound medium carrots, scrubbed, cut into 3-inch pieces, halved lengthwise if thick2tablespoons extra-virgin olive oilPreparationStep 1Place a rack in highest position in oven; preheat to 450°. Place panko in a small bowl. Mash butter, mustard, and thyme leaves in another small bowl with a fork (it will be a little lumpy). Season chicken thighs on both sides with salt and pepper. Arrange skin side up a rimmed baking sheet and smear all over skin side of thighs. Working with 1 piece at a time, firmly press chicken, skin side down, into panko so crumbs adhere. Place back on baking sheet skin side up.Step 2Arrange carrots and thyme sprigs around chicken and drizzle with oil; season with salt and pepper. Toss to coat and bake until carrots are tender and chicken is cooked though, 25–30 minutes.Step 3Heat broiler. Broil chicken and carrots just until panko is golden brown and carrots are tender and browned in spots, about 2 minutes. Transfer to a platter and pour pan juices over top.How would you rate Panko-Crusted Roast Chicken Thighs with Mustard and Thyme?Leave a ReviewTell us what you thinkReviews (26)Back to TopTriangleThe skin doesn’t crisp at all and that is a huge bummerMariana NunesNew York 12/1/2021Super quick!! Love the flavors. Thinking about trying it with boneless, skinless breasts since the skin doesn't get crispy and I hate next-day chicken skin. The carrots get AMAZINGLY charred and flavored; I might double or triple the amount next time.\n\nHeads up, I think the steps should be reversed and you should drizzle the carrots with olive oil before adding the chicken to the tray (we tossed the carrots in a separate bowl).JSChicago, IL4/19/2021Loved this dish.  Easy instructions to follow, very easy to make, and an ideal 'working from home quick lunch of 5 mins to prep and leave it in the oven for 25mins, what could be easier?\nI roasted some broccoli to the pan too so had multiple veg, so it became a 1 tray meal with even less washing up.  Who said working from home was less productive???AnonymousSingapore2/18/2021wondering what temperature to bake at?AnonymousNew York City2/2/2021seems to be missing cooking time for thighs? just 2-3 minutes?AnonymousSt Augustine, FL1/31/2021We used thin cutlets (chicken breast) for this recipe, as my partner isn't a fan of thighs - it turned out perfectly! Honestly one of our new favorite recipes, and we will defnitely be making this again.SaraDenver, Colorado1/28/2021Making this for my family tonight and don’t see when I add the mustard and nutter mixture! Yikes help- looking forward to trying this \nJane11/16/2020So so so good - savory and satisfying.  Will definitely make again!Marissa T. Tempe, AZ11/10/2020Delicious meal, as I’m not into thighs, I used breast instead, turned out really well, especially the char on the carrots.AnonymousVictoria, Australia 8/21/2020Great! I made it, used Emeril's seasoned panko, other than that the same.  It was great!KitDay55Chicago 4/29/2020....also cut the excess flapping skin off. Just needs one layer on top, not all of that extra skin hanging off the sides...AnonymousNY, NY4/10/2020This will be a staple. Very tasty and flavorful. Didn’t brown as well with the broiler, but will try to make it slightly closer to the flame next time. My broiler isn’t great, so I have to be cautious. Def will add more carrots and thyme next time but will need to compensate with a bigger pan, so they all get that glaze. Will also try the recommended spices in the reviews below because I like flavor, but it didn’t need it on the first try. I didn’t have the recommended amount of butter, so I substituted with organic and cage-free Mayo for the remainder. AnonymousNY, NY4/10/2020Ok.  I think I have the solution.  This recipe is a definite go-to.  Easy crowd pleaser.  Couple tweaks: yes, up the ante on herbs, I agree.  But what really put this next level was to sear the chicken skin on a cast iron skillet, let cool down a bit and do everything else recommended.  That chewy flesh issue had to be addressed.  I, personally, have never needed the broil option, and quite frankly all it does is toasts the panko and not the skin, but that's going to depend on each person's ovens.  But it really is a great and easy recipe.Philly3/26/2020One more thing. Make extra carrots because I too was eating them off the roasting pan before I served them. This will become a staple. Good for dinner or dinner party. Just double or triple recipe. Made stuffing (dressing) to go with it. Soooo good MarcorOakland ca1/27/2020Just made this. Pumped up the spice and herb content and because my thighs were large cooked an extra 15 minutes. Did not use broiler but mixed carrots with kosher salt and olive oil then placed them around chicken and drizzled seasoned oil from carrots over chicken before roasting. I have two words: easy - delicious MarcorOakland California 1/27/2020Explore Bon AppétitChicken ThighChickenPoultryCarrotVegetableQuickEasySheet-Pan DinnersWeeknight MealsMainDairy-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Jenny Rosenstrach"]}