{"id": "d2c826f1f64e4a115d7266f771f16ded", "url": "https://www.bonappetit.com/recipe/chicken-lentil-soup-with-jammy-onions", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Chicken-Lentil Soup With Onions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueChicken-Lentil Soup With Jammy OnionsBy Andy BaraghaniDecember 26, 20194.7(134)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis soup coaxes big flavors from a short ingredient list. Be patient while browning the onions and garlic: They're essential to adding depth to the finished dish. This recipe is part of the 2020 Healthyish Feel Good Food Plan, a ten-day headstart toward eating well all year long. Ingredients4 servings4skin-on, bone-in chicken thighs, patted dryKosher salt¼cup extra-virgin olive oil1large onion, thinly sliced6garlic cloves, thinly sliced1cup red lentils, rinsed1tsp. ground turmericFreshly ground black pepper½cup finely chopped parsley2Tbsp. fresh lemon juicePlain yogurt (for serving)PreparationStep 1Lightly season chicken thighs all over with salt and set aside.Step 2Heat oil in a medium pot over medium-high. Add onion, season with salt, and cook, stirring occasionally, until golden brown, 12–15 minutes. Add garlic and cook, stirring often, until garlic is golden and onion is deep golden brown and lightly charred around the edges, about 5 minutes. Remove pot from heat and transfer onion and garlic to a plate with a slotted spoon; set aside for serving.Step 3Return pot to medium-high heat; pour in lentils and sprinkle turmeric over. Cook, stirring a few times, until fragrant, about 30 seconds. Add reserved chicken and 6 cups water; season generously with salt and some pepper. Bring to a simmer over medium-high heat. Reduce heat to medium-low; cook, stirring occasionally, until chicken is cooked through and lentils are tender, 20–25 minutes.Step 4Using tongs, transfer chicken to a cutting board; let cool slightly. Shred meat with 2 forks or your hands; discard skin and bones. Return shredded chicken meat to pot and add parsley. Remove from heat and stir in lemon juice.Step 5Ladle soup into bowls; drizzle with yogurt and top with reserved onion mixture, dividing evenly.How would you rate Chicken-Lentil Soup With Jammy Onions?Leave a ReviewTell us what you thinkReviews (79)Back to TopTriangleI have probably made this 15 times since this recipe was published. Such big, perfect flavor for such a simple recipe with so few ingredients! The only change I generally make (as do many other reviewers) is to brown the chicken thighs either before getting the onions in or between the onions and toasting the lentils. I usually also add considerably more lemon. So so damn good. MarissaNY1/7/2022Loved it! Only added 3-ish cups of water and went off script for spices ZanderWashington, DC1/4/2022Made this tonight and it was really good!  I did make a couple of substitutions:\n\n- used 2 chicken quarters (leg and thigh) instead of 4 thighs\n- subbed out some of the water for chicken broth. \n\nNext time I might actually add more water as it is very thick (I don't know what that other reviewer who said it's too much was thinking, unless they forgot it or supposed to be soup). \n\nAlso, next time I'll double the amount of onions.  \nJessicaToronto10/23/2021I just love this soup, have made it 10+ times. I usually use 4 cups of chicken broth and 2 cups of water instead of all water, reduces the need to season with a lot of salt. AnonymousEureka CA3/31/2021I just made this for the 3rd time. I gave it 5 stars because it was fantastic exactly as written. I can't stand when people give a recipe 5 stars after they've modified it to their own liking. That's like giving yourself 5 stars, but not the recipe. So, like I said, delicious just as is, and I ate the leftovers every day for lunch until it was gone. Buuuuut....because it reminded me a bit of Indian lentils I make from time to time, I did start adding a little curry, garam masala, and cayenne the last 2 times and yum! What makes this so good is the chicken thighs! I almost always use breast meat, but the tenderness of the thigh meat is amazing, and I'd never substitute breast with this. However, this last time I made it I did use boneless-skinless just to save time and thought it would be healthier and it was still just as good. I highly recommend this recipe with or without changing it.Kari-Anne L.Coeur d'Alene, ID2/14/2021all in all, this is very good, but I made a few modifications that I think make it easier and more flavorful. Rather than make the onions separately, I just caramelized them in the rendered chicken fat and incorporated them into the soup. This gave it a slight French onion soup vibe and more depth to the broth. Also rather than water I used home made stock. Couldn't really taste the turmeric but you could add almost any spice you desire in this. also good to add in any greens you want should you feel the urge.CaroBrooklyn, NY2/10/2021Why are there so many BA recipes that involve adding insane amounts of water? I used 4 cups and still felt like it was too much, I will probably use 3 next time. As other readers did I also browned the chicken thighs first, then cooked the onions in the chicken fat. Also added about 1 tbsp grated ginger and some red pepper flakes. Came out really good just needed some tweaking ! AnonymousBrooklyn, NY1/6/2021Solid, but not fantastic--needs a bit more oomph in terms of flavor/spicing--the bites that don't have the onion topping in them don't have a ton of flavor, so it's probably worth adding some garam masala or something in with the turmeric. I browned the chicken thighs ahead and then cooked the onions and garlic in a mixture of oil and rendered chicken fat, but I should have at least doubled or tripled the onions as well.Anonymous11/8/2020I had forgotten how quickly this recipe comes together! So simple and so, so good. I quadruple the amount of onions I make because they are absolutely delicious, they totally make the meal.AnonymousEl Salvador10/29/2020yes it was delicious!therelzoe9/4/2020This is the THIRD time I'm making this, it's been one of my favorite quarantine meals. I seriously just think about this soup sometimes. It's definitely a pleasantly surprising dish, I didn't expect it to be so good. I sometimes don't want soup for dinner because I don't think they feel like full dinners, but this soup is incredible. So incredible that I'm writing a review for a SOUP RECIPE, like the oldest person on earth. Ashley RoshitshBirmingham, AL8/30/2020So easy! I wanted to make this a little heartier to eat for lunches during the week, so I toasted a can of chickpeas with the onion to add at the end as a topping. It was delicious! Besides that addition, I would highly recommend making just as it is.AnonymousAustin, Texas7/21/2020I almost always have a batch of this soup in the fridge or freezer! It’s one of my favourite BA recipes! Easy, delicious and works super well to freeze and store! \nI usually use boneless, skinless chicken thighs for convenience!AnonymousSweden5/11/2020I love this recipe and I’ve made it many times. It’s SO good and easy. I streamline the process by caramelizing the onions in a separate pan, while the Lentils/chicken cook in a pot (vs waiting for the onions to finish before cooking the chicken).  AnonymousOntario, Canada 5/2/2020I'm not a heavy user of tumeric, so I was intrigued to try this recipe. I followed exactly as written and found the soup flavorful and filling. However, I was not a huge fan of the heavy taste of the tumeric. When I make this again...and I will....I will substitute the tumeric with a curry powder which may give it better complexity and balance. AnonymousThe Quiet Corner of CT4/27/2020Explore Bon AppétitSoupSoups and StewsChicken ThighChickenPoultryOnionVegetableRed LentilLentilOne-Pot MealsMainGluten-FreeNut-FreeHealthyishSimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Andy Baraghani"]}