{"id": "d2d3695b73a94ca9d661230d50bb2693", "url": "https://www.bonappetit.com/story/sugar-to-your-meat", "year": 2021.0, "month": 10.0, "day": 5.0, "content": "You Should Be Adding Sugar—Yes, Sugar!—to Your Meat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Should Be Adding Sugar—Yes, Sugar!—to Your MeatSalt too.By Kendra VaculinOctober 29, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailYou know all about seasoning your protein with salt before cooking it. You’ve got kosher salt on deck, you know to pat everything dry before you get to sprinkling, and you aren’t shy with your three-fingered pinches. You’re well aware that a good dusting now means you’ll have to season less later, as the salt will penetrate the meat and let its natural flavor shine.But did you know there’s another staple ingredient hiding in your pantry that could take your seasoning game to the next level? It works with any protein, adapts to any flavor profile, and a little goes a long way. We’re talking, of course, about sugar.My introduction to seasoning meat with sugar came in the form of a once-a-year tradition: the dry brine for a Thanksgiving turkey. Along with salt, sugar (either brown or white granulated) is a dry-brine must-have, essential both for its browning capabilities and flavor-enhancing properties. Breaking out the sugar is my favorite way to ensure that my turkey comes out perfectly tender and golden brown every November.But it took making the Salt-and-Sugar Pork Rib Chops from Carla Lalli Music’s new book, That Sounds So Good, to remember that the same technique could be employed elsewhere and often to great success. Seasoning your protein with a small pinch of sugar in addition to salt is a simple, speedy trick with big returns. Here’s why:It’s the secret to quick browning.Developing the perfect brown crust on the sides of your steak or pork chop can be a labor of love. It takes time for that delightfully textured outermost layer to form, and any shifting or peeking throws the process off course.But a little bit of sugar sprinkled over your protein before it hits the pan is the fast track to the color you’re hoping to achieve. The sugar caramelizes in the heat, easily creating a brown crust that you might otherwise have had to wait twice as long for, during which time you’d risk overcooking the insides. (Do keep an eye on the heat and don’t use more than a small pinch, however, because sugar is liable to burn.)It’s a natural tenderizer.Sugar starts working on your cut of protein long before it hits the pan. It helps to keep the meat tender, especially the longer you let it sit before cooking but even with a much shorter rest time (a few minutes for these chops compared to a couple days for a turkey). Carla recommends using 1 teaspoon sugar with 2 teaspoons kosher salt in her recipe, to season 1 pound of pork rib chops—you can scale up or down accordingly as needed.It’s—duh—a little sweet.While the salt in your dry brine or grill rub highlights and showcases the flavor of the meat itself, the sugar adds a little something extra. It’s not enough sweetness to make your steak taste like meat candy—it’s more of a subtle hint that plays well with the savoriness of beef or pork and works especially well with bitter or acidic accompaniments. Carla serves her chop with radicchio, mustard, and a tiny drizzle of honey to heighten the sweetness even further; the result is a balanced bite that comes together all in one pan—muuuch faster than a Thanksgiving turkey.Pour some sugar on these:Salt-and-Sugar Pork Rib ChopsCarla Lalli Music's ingenious shortcut for perfectly browned pork chops is the weeknight dinner cheat code we all need.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-29", "author": ["Condé Nast", "Kendra Vaculin"]}