{"id": "d2e40a806918d87580b276adcc0e5e04", "url": "https://www.bonappetit.com/story/berthas-kitchen-charleston-photos", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Inside the Lunch Rush at Bertha’s Kitchen, a Soul Food Institution | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsInside the Lunch Rush at Bertha’s Kitchen, a Soul Food InstitutionThe Charleston restaurant has been passed down from mother to daughters, and their buzzing energy fills the room with love.By Chase QuinnJune 6, 2018FacebookTwitterEmailBertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.There’s an empty chair in the center of the action at Bertha’s Kitchen, the Charleston soul food institution that’s been serving hot plates of collard greens, fried chicken, and lima beans since it opened in 1981. The chair, humble and threadbare black leather, was where matriarch Albertha Grant watched over and instructed her children as they prepared for the lunchtime rush. What began as a home-cooked operation on one stove in a motel became a neighborhood restaurant fueled by unconditional love (and plenty of fry oil), winning the James Beard Award for America’s Classic in 2017. Grant passed away in 2007, and now her children own the place. But Bertha’s spirit fills the bright blue dining room where her portrait hangs on the wall in a gilt frame. One steamy May afternoon, not even the clap of storm clouds could keep the faithful away. As trays of barbecued pig’s feet, oxtail, yams, and smothered pork chops passed us by, we stuck around for an afternoon.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/Redux“The first time I met the special friend in my life was at Bertha’s,” says Cynthia Sweeney, Charleston native, retired teacher (pictured far right). “We are both seniors and we weren’t looking for anybody in our lives. He had just gotten off from work. I saw him get out of his vehicle in a rush. Just playfully I said, ‘I see you trying to rush and get in front of me’ because I know the line gets long sometimes. He said, ‘Actually, I’m rushing so I can open the door for you.’ That was three years ago. We’ve been with each other ever since.”Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxKabriera Singleton, daughter of Linda Pinckney and one of Bertha’s granddaughters, serves up fragrant bowls of collard greens, her hands adorned with eye-catching gold bangles and pearlescent-tipped nails.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/Redux“One day Ms. Bertha was leaving to go and I stopped her,” says Mamie Cooper, Charleston native, retired, mother of two, grandmother to six, “I said ‘Ms. Bertha, your food is so good. Did your mother teach you how to cook?’ She said ‘No, not really. My mother didn’t teach me all of that. A lot of that I learned on my own.’ I said, ‘Well, your food is exceptional. It has me coming back for more.’ That was over 15 years ago.”Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxThe $8 meat-and-three: A plate of barbecue chicken, macaroni and cheese, collard greens, and cornbread.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxWhissette and LaTonta Wright are visiting from Charlotte and don’t have time to waste on mediocre food: “We were led to Bertha’s out of frustration. Every time we come [to Charleston], we always end up at some of the more touristy, froufrou kinds of places. We order the fried chicken, collard greens, butter beans, and rice, and it actually tastes like my grandmama made it. Everything is like it was when I was growing up. We can’t duplicate that kind of cooking now. We’re two generations removed from my grandmama, and this just tastes like home.”Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxDuring morning prep, the chefs focus on the task at hand.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/Redux“We’re family-orientated,” says Julia Grant, one of Bertha’s three daughters and the restaurant’s current owner, “We know a lot of people in the area, and we have a lot of regulars who come in all the time. It’s common courtesy that keeps them coming back. We’re nice to people; they are nice to us. It’s not hard for a stranger to come in and say what they want and feel welcome.”Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxBertha’s walls are covered in family memories. Here, a portrait of Bertha with her three daughters, Julia Grant, Linda Pinckney, and Sharon Coakley, painted by a family friend, warmly greets customers as they come inside.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxThe energy is fast and bustling as soon as the doors open, with Bertha’s staff feverishly writing down and calling out orders in a language all their own. It’s hard for the untrained ear to understand, but with years of practice, Bertha’s staff understand one another perfectly without missing a beat.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/Redux“The first time I came to Bertha’s was for a political meeting,” says Rodney Williams, Charleston native. “I am a former city councilman for the city of Charleston. Bertha’s is still known as a political hub where you can find out what’s going on around town. I always see someone I know.”Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxThree generations of mothers, daughters, and staff pose proudly in front of a large family portrait that hangs in pride of place on a wall covered in photos and awards—a memorial to the woman and family legacy that makes Bertha’s so unique.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxThroughout the day the perpetual line at Bertha’s becomes a crossroads for familiar faces, friends, family, and neighbors—many of whom have been coming to Bertha’s for years—to exchange greetings, news, condolences, and hugs.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxBy 1 p.m. staff come from around the counter to take orders on the backs of Styrofoam containers to help move the line along. The scrape of metal dishware and the chatter of eager customers rises above the sound of the torrential rain outside.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxOur lunch: baked macaroni and cheese, collard greens, lima bean soup, okra, and cornbread.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxOwner Julia Grant won’t be found sitting in a back office somewhere. She remains on the front lines at Bertha’s from open to close, serving up smothered chicken and combo plates every day without fail.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/Redux“I patronize this place because I have a crew,” says Alonzo Wright, the owner of a drywall and construction company (wearing the Bluetooth earpiece above), “we come here and buy a lot of food. And they are warm-hearted people. They have that mentality that just makes you want to keep coming back. I’m the type of person, it don’t matter if I come in here covered with sheetrock, dust. It doesn’t matter if I have ten different colors of paint on me. It doesn’t matter. That’s how they know me. I always have that attitude, that happy spirit, no matter what’s going on. I could go wake a graveyard up.”Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxLinda Pinckney, one of Bertha’s three daughters, says:  “It always gets to me when I think about where we started and where we are now. I think about all the hard work my mom did and the hard work my sisters put into it. Our mother’s spirit is what gets us up in the morning.”Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxMen gather out front of Bertha’s to shoot the breeze.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxMaestro Julia Grant stirs the pot.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxFor many of their customers, Bertha’s is their first stop from the airport. Sometimes people literally have their luggage.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxNo meal is complete without a Styrofoam cup of Bertha’s sweet and tart lemonade or Southern sweet tea to wash it down.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxA square of cornbread gets wrapped like the gift it is.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxBertha confers her blessing from a portrait that hangs on the wall where orders are picked up.Bertha's Kitchen, Charleston, SCPhoto by Peter Frank Edwards/ReduxKabriera Singleton recites Bertha’s weekly menu offerings like steps from a spellbook she’s learned by rote. “One of our regular customers, Mr. George, likes the restaurant so much,” says Singleton, that “he’ll come early before the rush to help unload the truck and fill the ice chest.”And after the last meal was marked, filled, packed, and paid for, we were on our way. But tomorrow, we knew, Bertha’s would be there.Chase Quinn is a writer in Charleston.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Chase Quinn"]}