{"id": "d2eba29b0a01bda60094118d6f2e6a10", "url": "https://www.bonappetit.com/story/mitsuwa-marketplace-new-jersey", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "The Best NYC Day Trip Is to Mitsuwa Marketplace in New Jersey | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best NYC Day Trip Is to a Japanese Grocery Store in New JerseyMitsuwa has everything I need.By Rachel KartenOctober 1, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Day trips make living in New York City, well, livable. In the summer, an afternoon at Rockaway Beach in Queens distracts me from the fact that I spend the majority of the season sweating on the subway platform. And in the fall, going upstate to Storm King in Cornwall, New York, is a necessary reminder of what fresh air is. But my favorite, any-season day trip in NYC is to Mitsuwa, a Japanese grocery store in New Jersey.Living in NYC isn't so hard when Mitsuwa (and its incredibly crispy tempura) is just a bus ride away.\nThe small chain of supermarkets (there are 11 total across the United States) feature both a food court and a grocery store—a rare but crucial double whammy that makes the hour-long bus ride from Port Authority to Edgewater, NJ, worth it. The move when you get to Mitsuwa is to take a lap around the food court to scope out the 15 or so restaurant stalls, order lots of different bites, and then browse/shop the aisles of the supermarket while you digest. Here’s a list of some of my favorite things to eat and buy there.Shatteringly crispy strips of pork katsu from Wateishoku KanedaShrimp tempura with sweet soy dipping sauce from Tendon HannosukeOnion-y fish cakes from Amo-ChinmiMiso ramen with a handful of scallions from worth-the-wait Santouka RamenDried shiitake mushrooms, umeboshi, yuzu gummy candies, onigiri, and all the pickles from the supermarketLiterally anything else that looks good to youSo while my trips to the Rockaways or upstate New York serve their purpose certain times of the year, the joy of a huge supermarket in suburbia filled with all my favorite foods is forever.Go there: MitsuwaExplore Bon AppétitHighly RecommendGroceryNew JerseyJapaneseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-01", "author": ["Condé Nast", "Rachel Karten"]}