{"id": "d2ee218e597b4c65ebf935f886289ce8", "url": "https://www.bonappetit.com/recipe/steak-with-grilled-scallion-salsa-verde", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "Steak with Grilled Scallion Salsa Verde Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesParty Steak with Grilled Scallion Salsa VerdeBy Anna StockwellJune 17, 20194.5(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintSkirt steak is our favorite choice when grilling for a crowd for two reasons: it feeds many and cooks in a jiffy. We like to pair it with a sauce with a kick, but for a milder taste, de-seed your chiles before chopping.Ingredients8–10 servings6garlic cloves, finely grated¾cup plus 3 Tbsp. sherry vinegar or red wine vinegar3lb. skirt steak, cut into 5\" piecesKosher salt1Tbsp. plus 2 tsp. sugar1¼cups extra-virgin olive oil, plus more for grill2large bunches scallions (about 30 scallions)2Fresno chiles, seeds removed if desired, finely choppedPreparationStep 1Whisk together garlic and ¾ cup vinegar in a large bowl. Season steak all over with 1 Tbsp. salt and 1 Tbsp. sugar; transfer to marinade and turn to coat. Let sit, turning occasionally, 10–15 minutes.Step 2Prepare a grill for medium-high heat; oil grate. Grill scallions (making sure to arrange them perpendicular across grates so they don’t fall through), turning occasionally, until charred and softened, 6–8 minutes. Transfer to a cutting board and let cool slightly.Step 3Grill steaks until charred and an instant-read thermometer inserted into the thickest part registers 120°, 3–4 minutes per side for medium-rare. Transfer to cutting board and let rest 10 minutes.Step 4Meanwhile, trim roots from scallions and thinly slice. Transfer to a medium bowl and add chiles and remaining 1¼ cups oil, 3 Tbsp. vinegar, 1 Tbsp. salt, and 2 tsp. sugar and mix well to combine. Taste and season with more salt if needed.Step 5Slice steak against the grain into ¼\"-thick strips. Arrange on a platter and spoon some scallion salsa verde over. Serve additional salsa verde alongside.How would you rate Party Steak with Grilled Scallion Salsa Verde?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleReally nice flavor, but the skirt steak I used was very tough.  Loved the scallions but next time I would let the meat marinate longer.  tomaMichigan 5/10/2021This was amazing!! I agree with the other comments below, use 1/4 cup of olive oil. For the salsa verde I used 2 Tbsp red wine vinegar + 1 Tbsp rice wine vinegar.\n\nI made it for a dinner party, and was nervous because I did not test out the recipe in advance. It was absolutely DELICIOUS!!! This is the perfect party steak. \nAnonymousNew York8/1/2020Is there a video for this Recipe? AnonymousNew York 8/10/2019Enjoyed this. Couple of things. ... never found a bunch of scallions that numbered 15, and we go through a lot of scallions. Red wine vinegar was a bit heavy for our taste; substituted rice wine vinegar with a splash of red wine and cut the sugar in half. AnonymousPhoenix7/17/2019We've made this twice and it was delicious. But agreeing with the below--I didn't use the indicated amount of oil--WAY too much in my view. Delicious!AbbygorLos Angeles7/15/2019Great recipe, for flank steak as well! I also used less olive oil, probably around 1/3c and it was fine. I would grind up the sauce next time, either in a food processor or mortar and pestle.AnonymousOregon7/8/2019Is the amount 1¼ cups extra-virgin olive oil really that much? Please advise asap \nAnonymousTN7/2/2019Dear lord this steak could convert a vegan. SO SO GOOD! ilacosseMinnesota6/27/2019This was very good! I   served it with flour tortillas and beans. That said, the thought of dumping over a cup of olive oil into the salsa and then that over the meat seemed nuts. Is that a typo? I  used 1/2 cup olive oil and that was more than sufficient. The general rule of thumb when cooking with peppers is the whatever the recipe calls for, they won't have it at your supermarket. I   subbed serrano peppers for Fresno. It was just fine!AnonymousLos Angeles6/23/2019Explore Bon AppétitSteakBeefMeatScallionOnionVegetableSpringSummerQuickEasyWeeknight Meals5 Ingredients or FewerMainDairy-FreeGluten-FreeNut-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-17", "author": ["Condé Nast", "Anna Stockwell"]}