{"id": "d2fc0a37fa8497da50dac28faef8f13f", "url": "https://www.bonappetit.com/story/spikedseltzer-dr-laura-catena", "year": 2018.0, "month": 6.0, "day": 5.0, "content": "Dr. Laura Catena Talks Wine, Entrepreneurship, and “Accepting the B-Minus” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredDr. Laura Catena Talks Wine, Entrepreneurship, and “Accepting the B-Minus”By SpikedSeltzerJune 29, 2018FacebookTwitterEmailCatena ZapataFacebookTwitterEmailThe founders of SpikedSeltzer believe in embracing their passions and listening to their intuitions. They are the original hard seltzer with a clear, crisp, and refreshing flavor made with natural cold-pressed fruit essence and purified water, after all. Their symbol is the mermaid—or Siren—a symbol that alludes to the spirit of inspiring women. In 2018, SpikedSeltzer will partner with women who live their life like a boss through food, travel, and spirit, and who have followed their inner sirens to establish brands fueled by their passions.Dr. Laura Catena will tell you that her philosophy is called, “accepting the B-minus,” which translates to knowing when to stop being a perfectionist about everything. But when you see her list of accolades and accomplishments—it’s hard to believeCatena is often called the face of Argentine wine. She’s a fourth-generation Argentine vintner and works as the managing director of Bodega Catena Zapata, her father’s 100-year-old-plus winery. She started working with the company in the early 1990s when wine buyers loved the product but couldn’t sell the wine. No one knew what Malbec was at the time. Catena then knew it was time to follow her siren song. “I wanted to help my father, our family, and my country, Argentina. That is why I first started working for Catena. But then I fell in love with farming, with the traditions of winemaking, and with the science and art of it all.” In 1995, she founded the Catena Institute of Wine, which is dedicated to using science to preserve nature and culture, and to elevate Argentine wine.Catena ZapataShe explains that because of the high altitude and cool climate in Mendoza, which lies in the foothills of the Andes, their Malbec is what she passionately calls the perfect wine: big aromas, complex flavors, soft tannins, and not too much alcohol. And she says that although Argentina has been making wine since the 16th century, it wasn’t until the last decade or two that they became known outside of the country. “When I present our wines to people around the world I feel like I am carrying our flag, like I am helping my country and my wine region, and that makes me very happy and proud.”The call to make wine was strong, but Catena follows a literal siren, too. She studied biology at Harvard and then went on to medical school at Stanford and works as a part-time emergency room physician in San Francisco. She explains that, like winemaking, medicine is an art and a science. “There is a lot of pattern recognition that is necessary for being both a great doctor and winemaker; walking into a patient’s room and knowing how sick a person is by just watching them talk and breathe requires the same kind of skill as knowing if a young wine will age.”When Catena is not making wine, practicing as a physician, and raising her family, writing has become a passion. Her first book, Vino Argentino: An Insider’s Guide to the Wines and Wine Country of Argentina, is on its third edition. Her most recent book, Gold in the Vineyards, has been a success in Argentina. She says, “I write better when I am drinking good wine.”She surrounds herself with women from across the globe who are equally caring and passionate. And being a soccer mom is possible, too, even if you’re the woman who seems to do it all. “Because I travel so much for work, on weekends when I am not working in the hospital, I enjoy watching my daughter Nicola’s soccer games—the life of the soccer mom, cheering with other parents, is one of my favorite things.”Catena ZapataFor an entrepreneur who wears so many hats, her “B-minus philosophy” helps to remind her that it's okay not to be perfect. “I need to be an outstanding doctor and a great winemaker, but if my kids are late for school or if I forget to pack a lunch when they have a field trip, I have learned to forgive myself. There is often nothing good to eat at our home (although there is always good wine), so my kids have learned how to cook and order take-out.”For Catena, it’s about doing what she loves and surrounding herself with other passionate people—and when you do that—work can be incredibly fun and rewarding. And she shares her passion with others. “I love seeing young people grow, both at the hospital where I have taught for 20 years and at the winery where I am a mentor to so many. I love being a mother to my own children but also a mother of sorts to the many young people that I have mentored at the winery and at the hospital for over two decades.\"And when it comes to that whole grading system—her siren song is a solid A-plus.To find out more about SpikedSeltzer, including retail locations, visit SpikedSeltzer.com.Explore Bon AppétitWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-28", "author": ["Condé Nast"]}