{"id": "d2fd8559ef8bde6c97956bc04bb57176", "url": "https://www.bonappetit.com/story/may-2020-issue", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "We've Got New Recipes to Transport You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWe’ve Got New Recipes to Transport YouOur May issue is live—in a different time than planned.By Adam RapoportApril 21, 2020FacebookTwitterEmailPhotographs by Laura Murray, food styling by Rose Daniels and Yia VangFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Ever since editors have been writing editor’s letters, editors have been turning them in late. We’ve got too much on our plates, we tell our colleagues. Too many meetings. No time to write. And whatever other excuses we can drum up to explain our lack of productivity.Want this letter before it hits the website? Sign up for our newsletter!When I should’ve been writing my editor’s letter for the May issue, the lot of us were at 1 World Trade Center, clicking away on our laptops, dipping into the BA Test Kitchen to make espressos and nibble at whatever was set out on the tasting table. In other words, we were going to work—which is what everyone was doing, right?But when I (finally) sat down to write it, it was Thursday, March 19. I was at home, having just logged off of yet another Zoom meeting. Simone, Marlon, and I were on Day 6 of self-isolation due to the coronavirus. Now, as I type this weekly newsletter to you on April 20, that May issue has finally arrived in print. Here’s what I wrote, one month ago today:It’s hard to imagine how we’ll all be doing by the time you read this letter mid-April. We know things are going to get worse before they get better. And that’s difficult to process.But I also know that I’m incredibly heartened by how everyone on the BA team has responded to this crisis. We have figured out on the fly how to reinvent our jobs as we work remotely. We’re now filming our wildly popular YouTube videos in our own apartments, selfie style. We’re recording our podcast without a studio but with just as much enthusiasm, opinion, and yes, spirited bickering. We’ve banded together to raise funds for and call attention to a restaurant industry that has been decimated this past month.And yes, we’re still making a magazine. All of the content in our May issue was shot, written, and edited before COVID-19 turned our lives upside down. It was supposed to have been our Travel Issue. But as my boss, Anna Wintour, pointed out, perhaps splashing the word TRAVEL across the cover in all caps right now might not be the move. Hard to argue with her. But the stories behind the cover still shine. The recipes from Minneapolis’s Union Hmong Kitchen—which, by the way, were some of the best things we’ve tested all year—will be a boon to every home cook in America. Same with chef Ashleigh Shanti’s breakfast indulgences at Benne on Eagle in Asheville, North Carolina. And as the weather warms, I recommend trying Andy Baraghani’s easy-breezy produce-driven dishes that he cooked up last summer during an Ojai escape.Benne biscuits from Asheville’s Benne on Eagle.\nPhoto by Emma FishmanReally, what we all need now more than ever is escape. I hope this Recipes to Transport You issue can provide just that. At the moment, turn to it for cooking advice and inspiration. Dog-ear the recipes you’re aching to make. And when it’s finally time for all of us to break free, use this issue as we originally intended it—as your all-caps guide to TRAVEL.Explore Bon AppétitAdam NewsletterRead MorecookingThere's No Better Time to… Make Yourself a Hot BreakfastBy Sasha LevineCoronavirusWhat To Do When Your Girlfriend Gets Sick? Make SoupBy Cameron EspositocookingHow to Make Do With Some Smart SwapsBy Carla Lalli MusicCoronavirusWhat to Know About Shopping and Cooking During CoronavirusBy Jesse SparksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-21", "author": ["Condé Nast", "Adam Rapoport"]}