{"id": "d2feda7272a1395fe69af4adcd245df1", "url": "https://www.bonappetit.com/story/always-make-peach-lassi-sorbet", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "I Will Never Make Ice Cream, But I Will Always Make This Peach Lassi Sorbet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoptest-kitchenI Will Never Make Ice Cream, But I Will Always Make This Peach Lassi SorbetIt takes 10 minutes to make and is basically as healthy as a smoothie.By Christina ChaeyJuly 24, 2018FacebookTwitterEmailPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailI generally don't get dessert when I go out to restaurants—I'll take a neat amaro over a fancypants foam-and-quenelle number any day. But if there's an ice cream, gelato, sorbet, or semifreddo on the menu, I'm 100% ordering it. (And if it's the lavender frozen yogurt at Olmsted in Brooklyn, I'm ordering two.)However, I absolutely refuse to make any of the aforementioned frozen desserts at home. I will never be the kind of person who owns, much less uses, an ice cream maker. I've convinced myself ice cream and its cousins are too \"difficult\" or \"fussy\" to recreate at home. But senior food editor Andy Baraghani's Peach Lassi Sorbet with Crushed Blackberries—which calls for seven ingredients and zero ice cream machines—was out to prove me very, very wrong.This recipe is the definition of low-effort, high-reward (it's also not technically a sorbet since it has dairy in it, but who cares!)  It's 80% frozen peaches, bolstered by a few dollops of Greek yogurt, a splash of vodka, honey, and salt. That's it! It's basically a smoothie! Dump everything into a food processor or blender and blitz-blitz-blitz, scraping down the sides every so often with a spatula for maximum smoooooth, until you end up with a luscious Creamsicle-colored mixture that \"someone\" might actually end up eating a quarter of as they scoop the mixture into a loaf pan. Pop the pan in the freezer and a few hours later, voil`à—dessert! When I asked Andy about how everything gets so creamy without churning, he told me it's all about that smidge of vodka (don't worry, you can't taste it at all), which prevents the sorbet from getting too icy and makes it easier to scoop.Because Andy always feels the need to make things a little extra, there are also crushed blackberries spooned on top, which you could omit but they're so good, you won't want to. The berries first hang out with a bit of lemon juice and honey until they get juicy and syrupy, and all those punchy tart flavors cut through the rich yogurt and sweet honey in the sorbet. I'm sure this would have been even more amazing had I had the foresight to ripen, slice, and freeze my own perfect farmers' market peaches instead of using the bagged frozen kind, but hey, we can't all be Andy.I recently made scallop aguachile and shrimp-pineapple tacos for a dinner party, but it was this sorbet that my friends couldn't stop raving about. I served it in little bowls with the berries spooned on top. But by the end of the night we found ourselves pulling the loaf pan back out of the freezer and diving into the remains, scrounging with our spoons for every last bite, the best dinner-party move of all.Get the recipe:Peach Sorbet with Crushed BlackberriesTurn juicy-sweet peaches into creamy sorbet, no ice cream maker required. View RecipeExplore Bon AppétitSorbetDessertSummer DessertsPeachBlackberryGreek YogurtRead MoreOrecchiette with Buttermilk, Peas, and PistachioscookingThe Healthyish Drink of the Summer is HereBy Amanda ShapirocookingThis Salad Has a Few of My Favorite Things (Burrata, for One)By Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-24", "author": ["Condé Nast", "Christina Chaey"]}