{"id": "d308bbfb02a3dc7964ba5994c546199d", "url": "https://www.bonappetit.com/recipe/chicken-tomato-pulao", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Chicken Tomato Pulao Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken Tomato PulaoBy Shayma Owaise SaadatSeptember 27, 20203.6(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrint“A classic yakhni pulao is meticulously prepared by simmering basmati rice in an aromatic chicken, lamb, or goat broth,” says recipe developer and food writer Shayma Owaise Saadat. “Pulao is prepared in a myriad of ways, and goes by a variety of names in countries ranging from Iran to Afghanistan and India to Kazakhstan. I learned to make this dish from my aunt Nilofer, and I borrowed some of her techniques and spices to create my Pakistani-style pulao. In my version, chicken thighs are simmered in a spiced tomato base along with rice and whole spices like cinnamon and bay leaf. As a nod to my Persian ancestry, I added one of my favorite Persian pantry staples, lemon omani (a.k.a. limoo omani), a dried lime with a sour, musky, complex flavor profile. The beauty of this one-pot dish is that you can use other types of meat, and if you are a vegetarian, you can substitute chickpeas. This pulao is lovely with a side of cucumber raita, a Shirazi salad, or aam ka achar (mango pickle). Whatever your condiment or side dish of choice may be, I recommend eating the rice scooped up with your fingers.”All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Bowl$17 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonMeasuring Spoons$10 At Bon Appétit MarketCan Opener$14 At AmazonScissors$17.95 At AmazonMeasuring Cups$18 At Bon Appétit MarketLarge Pot$55 At AmazonTea Kettle$34 At AmazonMesh Sieve$13 At AmazonSpoon$24.69 At AmazonIngredients4 Servings2cups high-quality basmati rice (such as Daawat, Zebra, or Zafrani Reserve)1½lb. skin-on, bone-in chicken thighs (4–6)½medium red or yellow onion2garlic cloves12\" piece ginger128-oz. can peeled whole tomatoes¼cup grapeseed or vegetable oil1tsp. ground cumin½tsp. hot smoked Spanish paprika¼tsp. ground turmeric2tsp. Diamond Crystal or 1 tsp. Morton kosher salt, divided½tsp. crushed red pepper flakes1bay leaf13\" cinnamon stick1lemon omani (dried black limes), or ½ lime, halved¼bunch cilantroA note on ingredients and equipment:Feel free to use fresh tomatoes here—use three quarters beefsteak tomatoes (avoid plum tomatoes). If you are unable to find lemon omani, you can use ½ fresh lime. It won’t be a perfect substitute for dried lime, but you’ll get some sour notes from the juice as well as a more intense flavor from the zest and pith. Use a large wide pot: Changing the pot size may affect the cooking time of the rice.PreparationStep 1Place 2 cups high-quality basmati rice (such as Daawat, Zebra, or Zafrani Reserve) in a medium bowl and pour in cold water to cover. Using your hands, agitate rice, then pour off water, leaving rice behind. Repeat process until water runs almost clear, about 3 times. Pour in more cold water to cover rice by 2\". Let soak at least 30 minutes and up to 4 hours; rice should swell. (Soaking softens the rice and reduces cooking time.)Step 2Remove skin from 1½ lb. skin-on, bone-in chicken thighs (4–6), using a paper towel to help grip the skin if needed. Place chicken in a small bowl; set aside. Discard skin.Step 3Using a chef’s knife, thinly slice ½ medium red or yellow onion. Smash, peel, and finely chop 2 garlic cloves. Scrape skin from one 2\" piece ginger with a spoon. Slice ginger into planks; stack 2 at a time and cut into matchsticks; line up matchsticks and cut crosswise into tiny squares.Step 4Using kitchen shears, cut one 28-oz. can peeled whole tomatoes into pieces right in the can (it’s less messy this way). Alternatively, you can chop up tomatoes, then place in a bowl with their juices.Step 5Heat ¼ cup grapeseed or vegetable oil in a wide heavy pot over medium-high. Cook onion, stirring, until golden, 7–9 minutes. Add garlic and ginger and cook, stirring, until golden and fragrant, 2 minutes. Be careful not to burn the garlic.Step 6Add 1 tsp. ground cumin, ½ tsp. hot smoked Spanish paprika, and ¼ tsp. turmeric to pot and cook, stirring constantly, until fragrant and blended, about 2 minutes. Add tomatoes, bring to a simmer, and cook, stirring constantly, until sauce darkens and thickens, about 5 minutes. Sauce should look jammy but not reduced and dried out.Step 7Bring a kettle or small saucepan of about 4 cups water to a boil. Add chicken thighs to pot with tomatoes and cook, stirring occasionally and scraping bottom, until thighs start to turn opaque, about 5 minutes. Add 1 cup boiling water to loosen tomato sauce, then add 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, ½ tsp. crushed red pepper flakes, 1 bay leaf, one 3\" cinnamon stick, and 1 lemon omani (dried black limes), or ½ lime, halved (if using lime, squeeze in juice, then add wedges). Cover pot and reduce heat to low; simmer chicken turning halfway through, 20 minutes.Step 8Drain soaked rice and add to same pot along with 2½ cups boiling water and remaining 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt. Stir well. Cover pot with a kitchen towel, place lid on top, and securely tie corners of towel to lid handle with kitchen twine. (This ensures the towel traps condensation, preventing water from dripping back into the pot.) Reduce heat to low and cook, undisturbed, 15 minutes. (You’ll see steam coming out the pot—that’s a great sign! Though you may be tempted to remove the lid and check on the rice, please don’t: The steam will escape and the rice will remain raw.) Remove pot from heat and let sit 10 minutes before removing lid.Step 9Meanwhile, coarsely chop leaves and tender stems from ¼ bunch cilantro.Step 10Remove lid and gently scoop rice and chicken onto a platter with a slotted spoon, starting from edge to ensure less breakage of delicate grains. Top with cilantro.How would you rate Chicken Tomato Pulao?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleGreat recipe but too many unnecessary steps. Cutting tomatoes with scissors give me a break. Just use cut tomatoes. Added more ginger and garlic, cut the rice to 1 cup and reduced the water proportionately. Don’t need to boil the water just put it in it’s already boiling! The cloth and string a bit much also just cover and don’t peek. \nExcellent dish however!TomCalifornia 1/16/2021Same as review below, totally confusing writing. I’m in the middle and now what? First recipe where I experience this ever lol. No proof reading, Or at least addressing the comments?Anonymous11/19/2020These have to be the poorest instructions I've ever read on BA. Starting with Step 7 in which one is to cook the chicken in 4 cups of water, there appears to be a conflation of the tomatoes sauce/masala and the chicken liquid.  To which am I to add the cup of water and the salt, red pepper flakes, lime, bay leave, and cinnamon stick?  And then how do the chicken and rice get together?  I assume in the tomato masala. \nI'm on my own here trying to make it work, but I will definitely NOT recommend this recipe as you have written it.  Mary EllenSalt Lake City11/16/2020Easy and delicious but subtle. I used lundberg basmati and it didn’t swell so I had to cook a little longer. I also used 8 thighs which made for a good chicken/rice ratio. I used ground black lime and a bit more ginger. I will definitely make again. New York NY11/3/2020This is a lovely dish. Probably too much rice for the chicken -- i'll probably add an extra thigh or two next time -- but I'm sure it will be delicious tomorrow as leftovers. I found the flavors subtle and balanced. I doubled the garlic and added more salt but otherwise followed exactly. And it came together easily.. Not a lot of fuss.AnonymousBrooklyn, NY10/31/2020I agree @Toasted_Nuts! But just reading the recipe, I think there is something fundamentally wrong with the proportions of the measurements. The numbers just do not add up, and I do not see how this can work.\nChina / Austria10/29/2020A simple rice & chicken dish with great flavour! I'll definitely make this again but I think it's time to add metric measurements to the ingredients. For real. I ended up with a ton of leftover rice from this because apparently the converter I used was faulty. I don't even dare attempt baking recipes because of this. Hope I find some good leftover rice recipes on here or elsetoasted_nutsRomania10/20/2020Heyy, I'm sure this is a great recipe and all but there's an error with the web page I can't see the preparation instructions. Super annoying as I've already bought all the ingredients! Will have to go somewhere else to follow their recipe.AnonymousNew Zealand10/14/2020Made as recipe called for with sub for regular lime and addition of rendering chicken fat from skin and some chicken broth instead of water as other. I made this recipe in my big Le Creuset. While the steps are simple enough, in my opinion, this recipe requires a lot of standing by the stove time, and I was not too impressed by the results. It's a comfy, homey dish, but the flavors were not strong enough for me (I want MORE tomato flavor, more SPICE flavor!). Maybe pulao flavors are supposed to be more subtle? Anyways, was hoping for a little more pizazz for a little less effort. And maybe this dish would be better with the various accoutrements listed above, but which I did not include. AnonymousHouston, TX10/12/2020Delicious! Used some powdered ginger (in addition to the fresh) and some ground cinnamon (in lieu of the stick). I also rendered the chicken fat from the skin instead of discarding it, and then used that fat plus a tbsp of evoo i'd used to render out the fat for my oil base. (Does this satisfy you, angry anti-skin on chicken thigh reviewer below?!?!? ;P) Also tossed in a makrut lime leaf instead of bay because I had it on hand. Thanks for the tasty recipe, Shayma!Anonymouswashington dc10/7/2020This was wonderful. I added a bone-in chicken breast because I'm not crazy about thighs. I also substituted chicken broth when water was listed as an ingredient to give the dish more flavor. Otherwise I loved all the herbs and spices and the rice was perfect by the time the dish was done cooking. My adult son and daughter-in-law loved it! Thank you!vashonbarb6804Vashon Island, WA10/4/2020I'm Turkish and living in Turkey and although we do use spices & herbs, it's never in such an abundance as in Pakistani/Indian/Iranian/and-that-whole-area thing. So, I wondered how my hubby and 10-yo son would like this. They Loved it!!!! with a few tweak (no fresh ginger, no lime - subbed with a few drops of lemon, no cilantro (Cilantro tastes like soap to me), no basmati rice (just regular Turkish rice) and addition of carrot sticks and red bell pepper cubes), I made this almost to a t. The smell as it was cooking was heavenly! Thank you so much helping me broaden hubby's palate :) AnonymousAnkara, Turkey10/1/2020Why is this so dumb? Why not just say but skinless thighs?Anonymous9/30/2020Explore Bon AppétitPilafPakistaniSouth AsianAsianChicken ThighChickenPoultryRiceRice & GrainsCanned TomatoTomatoVegetableMainDairy-FreeGluten-FreeNut-FreeRamadanDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-27", "author": ["Condé Nast", "Shayma Owaise Saadat"]}