{"id": "d31306cacd2eed67429ec964471a6557", "url": "https://www.bonappetit.com/recipe/simple-marinated-short-ribs", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Simple Marinated Short Ribs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueSimple Marinated Short RibsBy Chris MoroccoJuly 9, 20194.2(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWhen you’re not in the mood to do much work, you need a marinade that does the work for you.Ingredients4 servingsVegetable oil (for grill)2lemongrass stalks, trimmed, tough outer layers removed1serrano chile3garlic cloves11\" piece ginger, peeled1Tbsp. dark brown sugar1Tbsp. extra-virgin olive oil1Tbsp. fish sauce1Tbsp. soy sauce1¼lb. boneless short ribsKosher salt2scallions, thinly sliced½cup cilantro leaves with tender stemsSesame seeds and lime wedges (for serving)PreparationStep 1Prepare a grill for high indirect heat (for a gas grill, leave one or two burners off; for a charcoal grill, bank coals on one side); oil grate. Using a Microplane, finely grate lemongrass, chile (seeds and all!), garlic, and ginger into a medium bowl. (Alternatively, you can chop very finely, then mash to a paste using the side of your knife.) Add brown sugar, oil, fish sauce, and soy sauce and mix well.Step 2Season ribs with salt and add to bowl. Turn as needed to coat completely. Let sit at least 10 minutes and up to 2 hours. (If marinating longer, wait to fire up the grill.)Step 3Grill ribs over hottest part of grill, moving to cooler zone as needed if browning too fast, until well browned, about 5 minutes per side. Transfer to a cutting board and let rest 10 minutes before slicing.Step 4Transfer ribs to a platter and top with scallions and cilantro and sprinkle with sesame seeds. Serve with lime wedges for squeezing over.How would you rate Simple Marinated Short Ribs?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis is a Five-Star Recipe. It's super simple - just roughly chop the marinade ingredients and throw them in a food processor or blender and let that do the work. I use boneless beef short ribs and let them marinate 12-24 hours (the beef can handle the relatively gentle marinade so it's a great \"make-ahead\" meal). The flavor is amazing and perfect for warm nights and grilling. I make this at least once a month in the spring and summer. BmoreBrianBaltimore6/11/2021This was a fabulous recipe.  I did brine the meat for about an hour before marinating.  The result was a wonderful beefy \"steak\" with a lovely crust.  I am making it again for Labor Day.caster4california8/31/2019Explore Bon AppétitShort RibBeefMeatLemongrassHerbs & SpicesSummerQuickEasyWeeknight MealsMainDairy-FreeGrillingPassoverFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Chris Morocco"]}