{"id": "d31d721114c15b5bc1ac8e42982b4f51", "url": "https://www.bonappetit.com/recipe/spicy-steak-salad-wraps", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Steak Salad Wraps Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueSpicy Steak Salad WrapsBy Molly BazJuly 10, 20185.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThese adobo-marinated steak wraps have a delightful garnish: Corn nuts. Their primary role here is to add salt, crunch, and sweet toasty flavors to each bite. Corn chips, Fritos, or even kettle-style potato chips would be excellent understudies.Ingredients4 servings2garlic cloves, finely grated1¼tsp. sugar3Tbsp. adobo (from a can of chipotles in adobo), divided3Tbsp. fresh lime juice, divided3Tbsp. extra-virgin olive oil, divided1lb. skirt steak, cut crosswise into 3 equal pieces¾tsp. kosher salt, plus moreFreshly ground black pepper¾cup plain Greek yogurt2small or 1 large head of iceberg lettuce, leaves separated, covered, chilled6radishes, trimmed, thinly sliced, covered, chilledCilantro leaves with tender stems and lime wedges (for serving)½cup lightly crushed corn nutsPreparationStep 1Whisk garlic, sugar, 2 Tbsp. adobo, 2 Tbsp. lime juice, and 2 Tbsp. oil in a small bowl to combine. Season steak with salt and pepper and place in a large resealable plastic bag; add marinade. Seal bag and massage steak to coat. Let sit at room temperature 15 minutes, or chill, turning bag occasionally, up to 4 hours.Step 2Whisk yogurt, remaining 1 Tbsp. adobo, remaining 1 Tbsp. lime juice, and ¾ tsp. salt in a small bowl; set aside for serving.Step 3Remove steak from marinade, allowing any excess to drip back into bag, and lightly pat dry with paper towels. Heat remaining 1 Tbsp. oil in a large cast-iron skillet over high until just beginning to smoke. Cook steak, turning occasionally, until deeply browned and an instant-read thermometer inserted into the thickest part registers 130° for medium-rare, 4–8 minutes, depending on the thickness of the meat. Transfer steak to a cutting board and let rest 10 minutes before slicing against the grain.Step 4Arrange steak, lettuce, radishes, cilantro, and lime wedges on a platter or a couple of plates so that each component is visible and easily accessible. Place corn nuts in a small bowl. Serve with reserved spicy yogurt for spooning into wraps.How would you rate Spicy Steak Salad Wraps?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleA great marinade, yogurt sauce, and suprisingly refreshing! I added some of the chopped chipotle peppers from the can for extra spice in the sauce. A MDenver, CO2/21/2022For this recipie, I used my new sous vide circulator and cooked the meat at 133 for 4 hours before quickly searing it. The meat was melty and perfectly cooked through!\n\nYou can also find corn nuts at trader joes and Fresh Thyme market, if you have one nearby. Totally worth it. My kids loved the taste and crunch!Meli500Indianapolis8/1/2018Did I go to five stores to finally find Corn Nuts? Yes. Was it worth it? Yes. I REGRET NOTHING. Pro tip - look at a gas station! Crushed them a little more than \"lightly\" and they are so perfect with this! Delish, way to go with another winner BA. kmarxmarxchicago8/1/2018Another tasty option is to use French's crispy fried onions with Blue cheese crumbles!AnonymousSarasota, FL7/19/2018Explore Bon AppétitWrapSteakBeefMeatLettuceLeafy GreensVegetableEasyWeeknight MealsMainGluten-FreeNut-FreeHealthyishSearLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Molly Baz"]}