{"id": "d3409c4bdf7d4ec242af4f4e91240602", "url": "https://www.bonappetit.com/recipe/slow-cooked-winter-squash-with-sage-and-thyme", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Slow-Cooked Winter Squash Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueSlow-Cooked Winter Squash with Sage and ThymeBy Claire SaffitzAugust 14, 20184.8(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintDouse squash in lots of oil and let it slow-roast to golden-deliciousness in this hands-off dish.Ingredients6 servings1lb. delicata or acron squash, halved lengthwise, seeds removed, sliced crosswise ½\" thick½head of garlic2sprigs sage2sprigs thyme½cup extra-virgin olive oil¾tsp. kosher salt1Tbsp. white wine vinegarPreparationStep 1Place a rack in middle of oven and preheat to 350°. Toss squash, garlic, sage, thyme, oil, and salt in a shallow 2-qt. baking dish to combine.Photo by Chelsie Craig, food styling by Claire SaffitzStep 2Turn garlic cut side down, then roast vegetables, tossing 2 or 3 times, until golden brown, very tender, and edges and cut sides are crisp, 60–70 minutes. Let cool slightly, then add vinegar and toss to coat.How would you rate Slow-Cooked Winter Squash with Sage and Thyme?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis was SO delicious, truly one of the top tier squash recipes. Followed to a T with delicata, just added more salt at the end. AnonymousReno, NV10/15/2021Great recipe! I used acorn squash and used 1/2 cup oil as directed. Squash absorbed almost all oil and tasted great. I didn’t use vinegar but still tasted great. Very aromatic. briggitazFlorida11/23/2018Lovely, luscious delicata!  I used 1/4 cup oil and that was plenty.  The herbal flavors were great. One problem with the recipe - if you use delicata and try to toss it, as instructed, it falls apart!  So don't toss. Also, it is soft and ready before (or if it ever) gets crisp.  One hour was plenty.  Warning - the garlic, upside down, sticks and makes a caramel-y mess that is difficult to get off the spoon, let alone the dish.AnonymousVermont9/21/2018Explore Bon AppétitAmericanDelicata SquashSquashVegetableAcorn SquashSageHerbs & SpicesFallWinterSideVegetarianVeganNut-FreeGluten-FreeDairy-FreeHealthyishRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Claire Saffitz"]}