{"id": "d35eb6b5b32c67378f11ca4f23f1cc55", "url": "https://www.bonappetit.com/story/tahini-brownies-instagram", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Gluten-Free Brownies Took Over Our Instagram Feed Last Weekend and It Rocked | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleChocolate-Tahini Brownies Took Over Our Instagram Feed Last Weekend and It RockedYou can't. Stop. Swirling.By The Healthyish TeamJanuary 29, 2018FacebookTwitterEmailProcessed with VSCO with ke1 presetPhoto by Ashley MartiFacebookTwitterEmailThis weekend, our Instagram feed's usual mix of Echo Park Craft Fair memes and Fiona the hippo photos was disrupted by a tidal wave of Healthyish's gluten-free chocolate-tahini brownies.  We're not complaining: Who doesn’t want to look at beautiful brownie pictures all day?Now, these gluten-free brownies haven't quite reached the level as Alison Roman's viral chocolate chunk shortbread cookies, but we have faith in the power of that beautiful tahini swirl.  Here are some of our favorite batches so far...now, can someone please save us a couple squares?Cat, plants, and brownies?! Looks like @cariesfork had a pretty perfect weekend.Instagram contentThis content can also be viewed on the site it originates from.Hey @taradonnephoto, we’ll take an end piece and a middle piece...you know, for comparison purposes.Instagram contentThis content can also be viewed on the site it originates from.@Chefmarynolan’s description of these babies as a peanut butter brownie/cream cheese brownie hybrid has us drooling.Instagram contentThis content can also be viewed on the site it originates from.And don't worry @ladyofthecanyon, flour and butter bakers are welcome here. This is a safe space.Instagram contentThis content can also be viewed on the site it originates from.@LocalHaven has already made these brownies once—and round two is looking pretty damn great. Fingers crossed, batch #3 is already in the oven.Instagram contentThis content can also be viewed on the site it originates from.BA associate social media manager @empschultz knows that that we’re riding a tahini swirl wavelength.Instagram contentThis content can also be viewed on the site it originates from.And, yeah, @curlycrew2387 is definitely going to have some happy coworkers.Instagram contentThis content can also be viewed on the site it originates from.Now, stop drooling and go make a batch of your own:Gluten-Free Chocolate-Tahini BrowniesDavid Lebovitz’s timeless gluten-free brownie recipe inspired our own GF take on classic fudgy brownies with a modern, sweet tahini swirl.View RecipeExplore Bon AppétitHealthyishDessertHealthy DessertsBrownieTahiniTrendsRead MorecookingThese Gluten-Free Tahini Brownies Are Annoyingly GoodBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-29", "author": ["Condé Nast", "The Healthyish Team"]}