{"id": "d365e6d9a376e23c7ea1e265631dcc7f", "url": "https://www.bonappetit.com/story/never-fail-spicy-grapefruit-shandy-recipe", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "This Shandy Recipe Is the Only Shandy Worth Drinking, IMHO | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Spicy Grapefruit Shandy Is the Only Shandy Worth Drinking, IMHOMost beer-juice combos are extremely lame—but this one makes me feel alive.By Emily SchultzJuly 20, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Picture it: The birds are chirping, the bees are buzzing, the sun is shining. You’re unfolding your picnic blanket to lay down in the freshly cut grass. You connect to your Bluetooth speaker and put on the highly-curated Park Playlist you made just for this occasion. One by one, your friends come join you, each bringing something. A crudités platter, perhaps? A savory fruit salad? As they crack open the cheap beer they just snagged at the bodega and pour it into their mason jars (this is a no plastic picnic), you pull something out. It’s in an unassuming growler. No, it’s not a hopped lager with brettanomyces yeast aged in oak barrels—it’s a funky-tart mixture of grapefruit and pickled ginger juice, and it’s going to turn your beer into the most fabulous and park-appropriate shandy you’ve ever had.Let’s all identify the elephant in the room, and that elephant is that shandies are usually...not good. (In case you missed the boat, shandies are a combination of light beer and some kind of juicy, non-alcoholic thing, often lemonade. Most of the time people mix them themselves, over ice, but pre-mixed and bottled versions—which are fully disgusting—have been all over the place in the last few years.) It’s the \"beer\" your uncle who non-ironically wears dad jeans and socks with sandals pulls out at his summer BBQs. They taste like a watered-down versions of the powdered lemonade you grew up making for lemonade stands, mixed with a weak-sauce lager. Sign me the opposite of up. But! That’s why it's sweet that we are big cool adults who can make their own ACTUALLY TASTY shandy recipe now!The first time I had this mouth-puckering concoction was at Basically editor Amiel Stanek’s house when we were all over for brunch. We were all very much hungover. He filled tall glasses with ice, poured in a big splash of a combination of grapefruit juice, pickled ginger, and lots of black pepper, and then filled them the rest of the way with the cheap beer we had brought over. As we all sipped on this punchy hair-of-the-dog, we were suddenly able to hold a conversation and enjoy the daylight. It’s just what we needed.Now is not the time for fancy barrel-aged beers—when you're making this shandy recipe, keep it light, and keep it cheap.\nMatt DuckorAfter discovering this perfect brunch cocktail, I decided this was a good formula for all day drinking activities. Diluting an already low ABV drink would ensure a picnic that didn’t end in bad decisions or naptime. Because I was taking this to go, I made it in a beer growler, but by all means make it in a pitcher for your in-home brunch party too!I started by pouring grapefruit juice into the growler via a funnel. Then, I chopped up some pickled ginger, (also called sushi ginger if you’re trying to locate it at a grocery store!), and poured some of the pickled ginger brine out to mix up with the grapefruit juice. I put a pinch of salt into the growler and cracked pepper into a small glass bowl to pour that into the growler. I tightly sealed it up with the lid and shook it up, rather than giving it the vigorous stir that Amiel suggests in the recipe (the neck of the growler was way too small to fit a spoon into). I packed it up in my cooler, brought it out to the picnic I was having with my friends, and enjoyed the day. No dad jeans, no bad shandies, and no blackout friends in sight.Get the Recipe:Spicy Grapefruit ShandyThis sweet-tangy mixture transforms even the cheapest beer into a refreshing party-worthy cocktail.View RecipeExplore Bon AppétitCocktailNever FailBeerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-20", "author": ["Condé Nast", "Emily Schultz"]}