{"id": "d3663fbb6805ad54ee069cc768a003b7", "url": "https://www.bonappetit.com/story/buttermilk-cornbread-stuffing-recipe", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "A Buttermilk Cornbread Stuffing Recipe That’s All-Around Homemade | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCornbread Stuffing That Doesn’t Dry Out Like an Old SpongeWe optimized this recipe as a savory, unapologetically moist stuffing for soaking up all your Thanksgiving sins.By Alex BeggsNovember 7, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailI’m going to tell you right off the bat: there are no shortcuts here. No cheat codes. No timesavers. No boxes of Jiffy stacked up like overdue library books. To make the best damn cornbread and sausage stuffing you need to first make excellent homemade cornbread. And we won’t budge about it. Return those overdue library books! Get some good cornmeal and a fresh pint of buttermilk, and let’s do this thing.Reporting for duty.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiThe Cornbread PartWhen Molly Baz was developing this classic Thanksgiving side recipe, she knew she’d need to go all out to make sure this version was the best it could possibly be. Bon Appétit Test Kitchen standards are normally high—but for this holiday, they’re higher than the freshly inflated Snoopy balloon at the Macy’s Thanksgiving parade. First, she’d have to develop a cornbread recipe that’s moist, not-to-sweet, and easy to slice and toast. This is cornbread specifically meant for stuffing, with less sugar than usual. By making homemade, you get to control the moisture and sugar levels, whereas so many cornbread stuffings made from a mix or store-bought cornbread can turn out mushy and pudding-like. We want actual bites of cornbread. The recipe is pretty simple: flour, cornmeal, buttermilk, sugar, salt, pepper, baking powder, eggs, butter. You can make it a day or two ahead, or just let it cool before the next part.Future cornbread croutons.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiThe Toasted Cornbread PartThe cornbread is cut into cubes and toasted in the oven until it begins to dry out on the outside—it takes close to an hour. They’re sort of like cornbread croutons, and if it seems counter-intuitive after making that fresh cornbread, trust us: We don’t want that mush! Toasting guarantees that the layer on top gets a crispy exterior, while the stuff inside will soak up all the stock and sausage goodness, also known as: perfect harmony.Lovely.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiThe Sausage PartyCook up some hot or sweet Italian sausage, followed by the aromatics—onion, celery, garlic, rosemary, salt, and red pepper flakes—and then collard greens in all that sausage fat. Cream and chicken broth join in to continue softening the greens, and then everything gets mixed together with the sausage, plus some eggs, and the cornbread. The whole mixture sits for five or ten minutes to allow the cornbread to absorb the good-good (official term), and since we toasting it earlier, it won’t disintegrate to baby food in the process. Fret not!The Oven PartHalf of the cook time is under foil so the cornbread on top won’t burn. But we want golden-brown crispy crunch, so remove the foil for the second half and keep a close eye!The Happy PartIs when you eat it.Get the recipe:Cornbread Stuffing with Sausage and Collard GreensYour whole kitchen is about to smell like a buttered corn muffin. You can thank us later.View RecipeExplore Bon AppétitThanksgivingCornbreadSausageSideStuffingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-07", "author": ["Condé Nast", "Alex Beggs"]}