{"id": "d36c1b9c9c0feaf54a71d82d24e9549d", "url": "https://www.bonappetit.com/recipe/sweet-potato-grits", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Sweet Potato Grits Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueSweet Potato GritsBy Kia DamonAugust 9, 20213.9(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Oriana Koren, food styling by Lillian Kang, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrintEdna Lewis once said, “People should really leave grits alone.” And we won’t argue with the queen, but in this recipe from Kia Damon (featured in Bryant Terry’s book Black Food), roasted sweet potato adds an earthy element and a creamy, custardy texture to grits. Damon suggests eating them with fried catfish, shrimp smothered in bacon gravy, mushrooms simmered in red curry, or “as our ancestors intended, with just a simple pat of butter.”All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronImmersion Blender$100 At AmazonLarge Saucepan$60 At AmazonMesh Sieve$13 At AmazonGlass Measuring Cup$19.99 At AmazonIngredients4 - 6 Servings1large sweet potato (about 1 lb.)3cups unsalted chicken broth1½cups whole milk1cup stone-ground white or yellow grits4Tbsp. unsalted butter, plus more for servingKosher salt, freshly ground pepperPreparationStep 1Place a rack in middle of oven; preheat to 400°. Wrap sweet potato tightly in foil and bake on a small rimmed baking sheet until a knife slides very easily into flesh, 35–45 minutes. Let cool.Step 2Bring broth and milk to a simmer in a large saucepan over medium heat.Step 3Meanwhile, place grits in a medium bowl. Pour in cool water to cover and gently swish grits around with your hands until chaff separates and rises to surface. Using a spider or small fine-mesh sieve, skim chaff from surface and discard. Drain grits in a fine-mesh sieve. Repeat process 2 more times.Step 4Whisk grits into broth mixture, making sure there are no clumps. (It’ll look like you have too much liquid, but the grits will expand into creamy goodness as they cook.) Cook, still over medium heat, whisking often, until thick and creamy but with a little bite, 25–30 minutes.Step 5Unwrap sweet potato and peel. Transfer flesh to a medium bowl and mash until creamy and smooth (you should have about 2 cups). Add to grits and blend with an immersion blender until incorporated. (An immersion blender yields the creamiest grits, but you can use a standard blender; carefully blend sweet potato and grits, then transfer back to pan.) Stir 4 Tbsp. butter into grits; season with salt and pepper.Step 6Transfer grits to a large shallow bowl; top with a pat of butter and season with more pepper.Adapted with permission from Black Food: Stories, Art, and Recipes From Across the African Diaspora by Bryant Terry (4 Color Books). Copyright © 2021.\n\nBuy from Amazon or Bookshop.orgHow would you rate Sweet Potato Grits?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThe BEST GRITS me and my family has ever had!!!!!!EbonyPittsburgh 10/14/2021Easy & delicious, I'll make over & over, this recipe is a keeper.AnonymousMahwah 9/5/2021Add a little cinnamon and top with good maple syrupAnonymousPortage, IN.9/1/2021Omit the chicken broth. Sweet potatoes grits butter little sugar it may taste like sweet potato pie gritsBridget fordRiverhead New York8/11/2021Ok we love grits but hate the idea of blending the texture out of them.  Yuck.AnonymousSouth of the south8/10/2021Not a \"GRITS GAL\" but SOLD!!! What are the NUTRITIONAL CONTENTS of this delicious delicacy?? Calories, fiber, sodium, sugar grams etc?MimiiMaryland8/10/2021Explore Bon AppétitSoul FoodAmericanSouthernSweet PotatoPotatoVegetableGritsRice & GrainsEasySideGluten-FreeNut-FreeSimmerBreakfastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-09", "author": ["Condé Nast", "Kia Damon"]}