{"id": "d37dfb42338df5ddaac70c52867e293f", "url": "https://www.bonappetit.com/story/best-food-and-drink-gifts-under-50", "year": 2021.0, "month": 11.0, "day": 3.0, "content": "17 Cheap Christmas Gift Ideas For People Who Love Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopshopping17 Food, Bev, and Entertaining Gifts for Under $50Fiery chili oils, colorful coasters, and a flip phone made out of cheeseBy MacKenzie Chung FeganNovember 15, 2021FacebookTwitterEmailPhoto by Yunhee Kim, Prop Styling by Christopher WhiteFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.You can do better than a Starbucks gift card. You can. I am speaking directly to you, person googling “cheap Christmas gift ideas.” A budget-friendly holiday gift doesn’t have to mean a peppermint bath bomb or novelty key chain or a scented candle (which, I would argue, is an extremely personal gift you should only present to someone with whom you share olfactory intimacy). This holiday season give your loved one the gift of not having to drop off that chenille scarf at the nearest Goodwill. I will help you! Below you’ll find unique gift ideas for the food lovers on your shopping list, none of which is over 50 bucks. Several are even under $20. There’s an elegant and minimalist olive oil carafe, a cookbook for the fungi-obsessed, and chili oils galore. Nothing here strike your fancy? There’s always a waffle maker.Resin CoastersIconic Italian architect and designer Gaetano Pesce has works in the permanent collections of MoMA, the Pompidou Center, the Met, and—soon—the living room of your Uncle Marcos. These hand-poured resin coasters, which Pesce designed in the ’90s and come in an array of colors, look like melted Jolly Ranchers.Resin Coasters$25 at Coming Soon New YorkSorelFull of warm spices like clove and ginger, this ruby-hued liqueur is a spin on sorrel, a Caribbean hibiscus drink with roots in West Africa. Founder Jackie Summers, who grew up steeped in the culinary traditions of his Bajan grandparents, is the first Black person to hold a distilling license post-prohibition, and this low-proof (15% ABV) labor of love has been years in the making. We think it’s a perfect component for a wintry punch.Sorel Liqueur$40 at ReserveBarCedar Fish Trivet<places hot sushi bake right here>Cedar Fish Trivet$10 at JINENPura MachaSalsa machas are oil-based condiments that combine chiles with, often, nuts or seeds, and you can count on these three varieties from Masienda (we also love its masa) to add heat, depth, and texture to everything from eggs to tamales. The guajillo, cranberry, and hazelnut variety will liven up even the blandest holiday bird, while the revelatory arbol, nori, and sesame blend pulls inspiration from Japan.Pura Macha$18 at Masienda$18 at Weee!Supra Endura Beeswax Food WrapsFor the sustainably minded cook, these reusable food wraps made with organic cotton and beeswax can replace plastic wrap—and they’re pretty enough to gift to the person who loves their coffee pods and single-use water bottles without it feeling like a pointed comment.Supra Endura Beeswax Wraps$24 at Anthropologie$24 at Supra EnduraOodaalolly x Kasama Rum ChocolateOodaalolly’s small batch chocolate, made with Filipino cacao, is infused with Kasama’s small batch rum, which is distilled in the Philippines from local sugar cane. The trio—an excellent stocking stuffer—contains a 70% dark chocolate bar, a creamy and coconutty milk chocolate, and an actually good white chocolate studded with dried pineapple. Even better: A portion of proceeds go to a Manila-based orphanage and shelter.Oodaalolly x Kasama Rum Chocolate$24 at Kasama RumCell Phone Made Out of CheeseGather ’round, youths. Before the iPhone we played Snake on our Nokia bricks and coveted our best friends’ Motorola Razrs and took big bites out of our flip phones made of cheese. The perfect gift for your BFF 4eva, this limited edition work of cheddar cheese art is completely edible.Flip Phone Made Out of Cheese$50 at WhispsAcid League Vinegar KitI’m hard pressed to single out one of these four vinegars as the best of the gift set, but I will say that the spicy, vegetal Garden Heat variety punches up a Bloody Mary. If that’s not holiday self-care, I’m not sure what is.Big League Vinegar Kit$49 at Acid LeagueFly by Jing Sichuan Salsero SetFly by Jing’s chili crisp is in such heavy rotation in my house that it rarely leaves the table—but thanks to my salsero spoon, it looks like a purposeful part of my home decor. A baseball-size marble sphere serves as the handle for a wooden spoon. Pop the spoon in the jar and the orb acts like a lid for your chili crisp (or other shelf-stable condiment). Buy just the spoon or a set that comes with a jar of Fly by Jing for your little sister who never got that rock tumbler she always wanted.Fly by Jing Sichuan Salsero Set$45 at Fly By JingJunto Oil BottleYou can’t very well keep that three-liter tin of Frantoia on your counter. Instead, decant your olive oil into this handsome terracotta bottle, which is ribbed for your aesthetic pleasure.Junto Oil Bottle$25 at Finnish Design ShopGlow-in-the-Dark DinnerwareWe’ve weighed in on our favorite ceramic plates and bowls for dinner parties, but this is by far our favorite dinnerware for raves. Under normal light this glass set is a transparent chartreuse, but cue the black light and they glow Slimer green.Vaseline Glass Dinnerware$40 at Coming Soon New YorkPeanut Butter for DogsWho needs Netflix when you can watch your dog trying to figure out how to get frozen peanut butter out of the kong? But grocery store varieties are loaded with sugar, salt, and additives that your pooch doesn’t need. Big Spoon’s Coconut Chia Wag Butter contains just three ingredients—peanuts, chia seeds, and coconut—that are full of healthy proteins and fatty acids without the filler.Coconut Chia Wag Butter$9 at HiveMẹ’s Way Chili SauceThis list contains not one but three different chili oils hailing from various countries, so for extra credit consider throwing them all in a gift basket with a dozen eggs. Mẹ’s Way differs from the others in its use of fish sauce, which lends a deep umami note to the hot peppers and fried garlic. It’s available in 8- and 16-oz jars. Get the 16.Mẹ’s Way Chili Sauce$26 at Me's WayBolé Road Tea TowelThese gorgeous striped kitchen towels, which come in warm sunset tones or shades of blue, are woven in Ethiopia from 100% cotton. You can never have too many.Afar Tea Towel$45 at Bolé RoadFishwife Smoked Tinned FishA fancy car with a big bow on the hood? Sure, if you like that kind of thing. High-qual tinned fish? Now that’s a gift. Fishwife’s beautifully packaged smoked salmon, trout, and tuna are the ultimate luxe-yet-cheap Christmas gift and are delicious in pastas, on toast with soft scrambled eggs, or eaten straight out of the tin with a squeeze of lemon.Smoked Trout (Pack of 3)$27 at FishwifeMushrooms in the Middle CookbookWe featured Smallhold’s mushroom grow kit in last year’s gift guide. If your apartment mushroom farm is still operational and you’re running out of ideas, this book—which includes a recipe for Creamy Mushroom Phyllo Pie by our own Christina Chaey—will spark your imagination. Proceeds will be donated to the Fungi Foundation, which exists.Mushrooms in the Middle Cookbook$30 at SmallholdThe Rounds Savory CookiesThe first ingredient in these savory biscuits is butter. Ma’am, you have my attention. Wrapped with a festive silk ribbon, each box comes ready to gift and contains 45 crumbly bite-size rounds in assertive flavors like Parmesan olive, Gruyère date, and—my favorite—anchovy scallion.Rounds$38 at The RoundsExplore Bon AppétitGift GuidesGiftsShoppingWhat To BuyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-15", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}