{"id": "d37d71e0a1c6ece83c1697e06f362c1b", "url": "https://www.bonappetit.com/story/bring-the-margaritas-home-for-cinco-de-mayo", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Bring the Margaritas Home for Cinco de Mayo | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredBring the Margaritas Home for Cinco de MayoThe Original Margarita with Cointreau plus four thrilling variations by Bon Appétit Editors. By CointreauMay 1, 2020FacebookTwitterEmailPAUL H. CHRISTIAN, YTC STUDIOSFacebookTwitterEmailWith Cinco de Mayo just around the corner, it’s hard not to feel a little stir-crazy reminiscing about tacos and margaritas past. But there’s no reason to despair when you can bring the fiesta to your own home kitchens.There’s no better way to recreate the feeling of Cinco de Mayo at home than with The Original Margarita recipe. The Original Margarita was created by Dallas socialite Margarita Sames who mixed her two favorite spirits - Cointreau and tequila - together with lime juice while vacationing in Acapulco back in 1948. Crafted from a blend of all-natural sweet and bitter orange peels, Cointreau is beloved worldwide for its highly aromatic and perfectly balanced orange flavor. It is essential for any home bar.The premium orange liqueur is highly versatile and can be mixed with essentially any spirit to make a more elevated cocktail. In the first video below, Bon Appétit's Carla Lalli Music and Rick Martinez get together over Zoom to prep for Cinco de Mayo. Carla crafts The Original Margarita - Cointreau, tequila, and lime juice - and Rick puts his riff on the original recipe, the Mora Picosa. This spicy blackberry riff gets its kick from the chile de árbol. In the following video, Molly Baz makes The Original Maragarita straight from her own kitchen on Cinco de Mayo.Scroll down for The Original Margarita recipe and more twists on The Margarita from Bon Appétit chefs, including Carla's recipe for a Salt and Smoke Margarita - punchy with olives and mezcal - and Alex Delany's recipe for a Full-Citrus Marg, which gets its citrusy flavor from Cointreau (orange), lime, and grapefruit. Rick shares his recipe for the Mora Picosa. Molly then joins the party with a Spicy Celery Marg, which uses the leafy vegetable for a refreshing take on the classic.The Original MargaritaRecipe by: CointreauThe Original Margarita,\nPaul H. Christian,YtC StudiosMakes 11 ounce Cointreau2 ounces blanco tequila1 ounce fresh lime juiceCombine all ingredients in a shaker and add ice. Shake and strain into a salt-rimmed rocks glass. Garnish with a lime wheel.Salt and Smoke MargaritaRecipe by Carla Lalli MusicSalt and Smoke Margarita,\nPaul H. Christian,YtC StudiosMakes 11 ounce Cointreau1 ounce mezcal1 ounce fresh lemon juice1 teaspoon honey2 dashes orange bittersToasted sesame oil, for drizzlingKosher salt; freshly ground pepperLemon wedge2 brined green olives, such as CastelvetranoPour some kosher salt onto a small plate; add a few cranks of black pepper and stir to combine. Rub lemon wedge lightly over rim of a rocks glass. Press rim of glass into salt-and-pepper mixture. Fill glass with coarsely cracked large ice cubes. Thread olives and lemon wedge onto a skewer; set aside.Combine Cointreau, mezcal, lemon juice, honey, and bitters in a cocktail shaker; season with 3 cranks of black pepper. Fill shaker with ice and shake vigorously until outside of shaker is very cold and frosty, 30 seconds. Strain through a fine-mesh strainer into prepared glass. Season with a crank of black pepper and drizzle with sesame oil. Garnish with reserved skewer.Full-Citrus MargRecipe by Alex DelanyFull-Citrus Marg,\nPaul H. Christian,YtC StudiosMakes 1¾ ounce Cointreau2 ounces tequila blanco1½ ounces fresh ruby red grapefruit juice½ ounce lime juice2 tablespoon grapefruit zest¼ cup kosher salt2 tablespoons chile flakesGrapefruit peel, for garnishLime wedge, for garnishMix salt, grapefruit zest, and chile flakes in a small bowl until evenly incorporated. Empty onto a small, flat plate. Rub the rim of the glass with a lime wedge and reserve for serving. Dip the rim of the glass into the salt mixture and fill with ice. Set aside.Add the Cointreau, tequila, grapefruit juice, lime juice, and a pinch of kosher salt to a cocktail shaker. Fill the shaker with ice, cover, and shake hard until the outside of the shaker becomes frosty and too cold to grip, about 45 seconds.Strain the Margarita through a Hawthorne strainer or a slotted spoon into prepared glass. Garnish with a lime wedge and strip of grapefruit peel.Mora Picosa (Spicy Blackberry)Recipe by Rick MartinezMora Picosa,\nPaul H. Christian,YtC StudiosMakes 11 ¼  ounces Cointreau2 ounces tequila reposado¾ ounces fresh lime juice1 lime wedge6 blackberries, divided1 chile de árbol1 mint sprigKosher saltCayenne pepper (optional)Place some salt and a pinch of cayenne on a small plate and mix to combine. Rub rim of an old-fashioned or rocks glass with lime; dip in salt. Fill with ice and set aside.Combine 4 blackberries, chile de árbol, mint, tequila, Cointreau and lime juice in a cocktail shaker. Fill the shaker with ice, cover, and shake vigorously until the outside of the shaker is very cold, about 20 seconds.Strain cocktail through a Hawthorne strainer or a slotted spoon into reserved glass. Garnish with remaining blackberries.Spicy Celery MargRecipe by Molly BazSpicy Celery Marg,\nPaul H. Christian,YtC StudiosMakes 1¾ ounce Cointreau2 ounces fresh celery juice1½ ounces tequila blanco¾ ounce lime juice½ ounce agave syrup¼ serrano chili, stem and seeds removed, coarsely choppedKosher saltLimes wedges, for rim and garnishCelery leaves, for garnishPlace some salt on a small plate. Rub the rim of an old-fashioned or rocks glass with lime (reserve for serving); dip the edge of the glass in salt. Fill the glass with ice and set aside.Muddle the serrano chili in the bottom of a cocktail shaker. Add the Cointreau, tequila, celery juice, lime juice, agave and a pinch of kosher salt.Fill shaker with ice, cover, and shake vigorously until outside of shaker is very cold, about 30 seconds.Strain the Margarita through a Hawthorne strainer or a slotted spoon into prepared glass. Garnish with celery leaves and lime wedges.Explore Bon AppétitMargaritaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-01", "author": ["Condé Nast"]}