{"id": "d3b833107dfad21991d135d486402a53", "url": "https://www.bonappetit.com/story/the-one-tool-that-changed-my-relationship-with-tofu", "year": 2021.0, "month": 3.0, "day": 5.0, "content": "The One Tool That Changed My Relationship With Tofu | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe One Tool That Changed My Relationship With TofuI loved tofu, then I found the TofuXpress and my love became total devotion.By Sarah JampelMarch 30, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Being a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner. Next up: Why you should buy a tofu press.Every week I buy a couple of blocks of extra-firm tofu at the store: It's versatile, protein-rich, and relatively cheap (is tofu the vegetarian's boneless skinless chicken breast...?) and I never have trouble finding ways to eat it: I make a big batch of Spicy Tofu Crumbles on Sunday to eat throughout the week, or I pan-fry planks for a vegetarian banh mi, or I simply cube it and douse it in soy sauce and gomasio and spoon it over rice.But my biggest barrier, the hurdle that used to make me reach for eggs or chickpeas instead? Pressing it, a painful-but-often-necessary step in ensuring flavorful, crispy planks or cubes. Doing it by hand is a pain: I'd wrap the tofu in paper towels or dishcloths, place it between two cutting boards, pull the heaviest objects off the shelves to weigh it down, wait a long time, and inevitably have to clean up the puddle that spilled off the cutting board and onto the floor. Even when I did the smart thing—cut the tofu into pieces first, then press it (this creates more surface area and makes for faster water expulsion)—those delicate pieces would inevitably crumble apart. Frustrating! It didn't seem worth it to press, but it also didn't seem worth it to eat flabby, flavorless tofu. What was a tofu lover to do? Buy a tofu press, of course! Photo by Chelsea KyleTofuXpress Tofu Press$45 at Amazon$50 at Williams SonomaWhich is the best tofu press?I found my answer in the TofuXpress, a small tool that made me look forward to pressing my tofu (is that weird?) and greatly increased the likelihood that it would be delicious. The TofuXpress is the neatest, fastest, most efficient (and not to mention visually satisfying) way to press tofu. How do you use a tofu press?Place the entire block in a compartment, then smush it down with a tense spring that applies force from above. You can see the tofu compact in real time: Even after five minutes, you'll notice that it's lost a ton of water, all of which is contained in the box.Why should you press tofu? Okay, okay, but why bother pressing tofu at all? A block of tofu is like a big saturated sponge: Blotting it dry with towels may help the surface crisp and brown, but using pressure to squeeze out the water from the interior produces firmer, chewier, denser, creamier pieces that don't fall apart as you're cooking. Getting rid of all that water also makes space where flavorful sauces and marinades can penetrate and ensures that your tofu won't splatter as dramatically when it hits a pan of hot oil.The drier your tofu, the crispier its edges and creamier its insides.\nWhich types of tofu can you press?It should be noted that not all tofu needs to—or should be—be pressed. Silken tofu, which is meant to jiggle and lean, can be patted dry but shouldn't be aggressively squished or smashed. While pressed blocks of tofu, which can range from medium to super-firm, are made by pressing coagulated soy milk (and, therefore, using the TofuXPress simply continues the process), silken tofu is set but not pressed. It's meant to wobble about; all that water is what makes it custardy and lush. And even when you're working with firm and extra-firm tofu—the kind you'd roast, grill, or fry—not every block needs the TofuXPress treatment: Some high-quality brands are dense enough straight from the package that pressing isn't required (typically, these are vacuum-sealed and made from high-protein soy beans). How long should you press tofu?Most of the time, the tofu I have at home comes packaged in a tub of water and looks and feels like it could benefit from a little added pressure. So when I know I'm making tofu for dinner, I'll put the block into the press as soon as I finish work. By the time I've changed into sweatpants (kidding, I was already wearing them) and prepped some vegetables, the tofu is ready to go. Just fifteen minutes makes a difference! If I have extra time (and foresight) in the morning, I'll stick the TofuXpress in the fridge; when I return to it at night, the tofu block is half its size, primed to be sliced, seared, and sizzled.Oh, and if you're wondering whether you can use the TofuXpress to firm up paneer or weigh down Japanese pickles, I have yet to try it, but I look forward to many Xpress Xperiments in the future.Take the TofuXpress to Flavor Town:Crispy Tofu With Maple-Soy GlazeWhenever you’re cooking tofu, here’s one of our no-fail techniques: Draining the tofu, then squeezing out as much water as possible (without smashing it), is the key to the crispiest cubes.View RecipeEditor's Note: This article was originally published February 26, 2019.Explore Bon AppétitHealthyishTofuVegetarianToolsShoppingThe Not Depressing VegetarianRead MoreLifestyleMarinated Lentils Are Saving My Vegetarian, Protein-Craving SoulBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-26", "author": ["Condé Nast", "Sarah Jampel"]}