{"id": "d3c342af3c317f3bd52dd572911723d2", "url": "https://www.bonappetit.com/story/pasta-shapes-emotional-state", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Pasta Shapes For Your Emotional State | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePasta Shapes For Your Emotional StateFeeling sad? There’s a carb for that.By Carla CicconeMarch 25, 2020FacebookTwitterEmailIllustration by Nadine RedlichFacebookTwitterEmailFeelings, no matter what they are, are always hungry, and pasta, perfected by nonnas who know life, pain, and food, and just want to feed you, is here for all of your feelings. Untold varieties of pasta exist beyond classics like spaghetti and penne, and each serves a different sentiment. Just as a well balanced diet is good for your nutritional health, a well balanced pasta diet is good for your emotional state. So eat pasta, often and a lot, and use this guide to select specific pasta shapes according to your emotional state.Illustration by Nadine RedlichAlfabetoTranslation: alphabetWhen the going gets tough, take it back to elementary school and the ABCs. It’s important and healthy to be able to identify your feelings, to really spell them out. No, really, spell them out...with your food. Alfabeto pasta is like Scrabble for your stomach. Compose some terrible poetry with it, and then eat it.StortiniTranslation: little crooked onesGather round, my little crooked ones. I want to tell you about stortini. You must eat these tiny macaroni when you’re feeling east, west, north or south of normal. Twisted out of shape. Pasta is not meant to right your emotional state, only match it and comfort it.FiliniTranslation: little cat whiskersIf you’ve ever said something along the lines of “I WANT TO EAT YOUR FACE” to an adorable kitten, filini pasta is for you. It’s also for those with imagination because eating filini turns you into a dignified cat detective with a monocle and a penchant for twirling its, you guessed it, little cat whiskers. To be consumed when you are feeling paranoid in a proud way, like you could solve a small crime that happened at your home, such as: which of your two roommates used all of your ridiculously expensive shampoo? Filini is also fine for when you’re feeling like you want to nap for 12 hours during the day and stay up all night chasing shadows.Illustration by Nadine Redlich OrecchietteTranslation: little earsLittle ear pasta is for when you need someone to listen to you complain about petit problems, like that weird look a stranger gave you on the street. Did you know him from somewhere? Was there something on your face? Did he just hate the sight of you? Is he actually in love with you? What was his problem? Who cares? Little ears do.ReginetteTranslation: little queensWHERE THE LITTLE QUEENS AT? Fancy IS a feeling. These wavy ribbon noods let everyone, but namely your stomach, know that you rule. As anyone who’s seen The Crown knows, heavy lies THE CROWN, so if the crushing weight of monarchistic pressure is what you’re actually feeling, the cure is still to mangia pasta.Illustration by Nadine RedlichFarfalleTranslation: butterflyPerhaps the most femme of the pasta shapes, eat butterfly pasta when you’re wanting to feel like Mariah Carey but can’t afford to actually feel like Mariah Carey.Capelli d’angeloTranslation: angel hairYou know that feeling when you look up on an overcast day at the exact moment the sun explodes through a patch of cloud, illuminating the sky with golden halo streams so brilliant, you feel like crying and laughing at the same time, and even if you believe in nothing, you swear to God that was GOD looking at you? THAT’S when you eat angel hair and be one with your heavenly self.SorpreseTranslation: surpriseWhen the ennui gets hungry, you reach for the soprese. It’s a small, ruffled pasta, for frivolous whimsy, and looks like tortellini, but is stuffed with...absolutely nothing. Soprese means surprise and the shocker here is just meaningless air. This is the only pasta to eat when filled with chronic dissatisfaction at human existence.Illustration by Nadine RedlichZitiTranslation: macaroni of the brideZiti is eaten at celebrations of holy matrimony, traditionally. Of course, this doesn’t really matter anymore because it’s been stolen by New Jersey, and is now eaten anytime. Eat it when the Sopranos nostalgia hits, or when you are in New Jersey, feeling anything at all.CappellettiTranslation: little hatsLittle hats pasta date back to the Middle Ages, when aristocrats ate them as a luxury (they’re usually stuffed with meat and cheese). These are chichi hats. When you’re eating alone, or with a toddler or a dog (cats are too judgemental), and feeling droll, it is perfectly acceptable to play with your cappelletti (you know the aristocrats wanted to). You are the auteur of your lunch, so why not conclude your meal play by giving the ends of your silverware fancy, edible headwear and then taking it away violently with your teeth.CavatappiTranslation: corkscrewSometimes, you’re just screwed. Like when a bird poops on you and people say “that’s good luck,” but it’s literally in your eye and you need a tetanus shot. Or when you finally decide to clean under your bed but stub your toe on all the crap you stashed under your bed and immediately give up. Or when your wife leaves you for your best friend. Many different levels of screwed. Embrace it. Eat it.Illustration by Nadine RedlichFregulaTranslation: little fragmentsIt’s happened. You’ve been dumped, sacked, scammed, and need some pasta STAT. Little fragment pasta is for when you’re ready to pick up the shattered pieces of your emotional wasteland, boil them, and eat them.DitaliTranslation: thimblesThimbles protect your fingers from being stabbed when sewing and knitting; let the pasta version do the same for your heart. Use when you’re feeling particularly vulnerable, like after announcing you’re in love with your best friend.RadiatoriTranslation: radiatorA particular pasta feeling, radiatori is for when your heat is broken and you are very cold and also hungry. It will only fix one of those.Illustration by Nadine RedlichAnelliTranslation: little ringsSad no one’s put a ring on it? This pasta pulls double duty as a delicious carb AND a semolina engagement ring. Were these in your SpaghettiOs? Yes, yes they were.MaltagliatiTranslation: badly cutThis is mistake pasta, literally meaning “poorly cut.” When you bomb a job interview because you lied on your resume but you’re a bad liar in person, fall off your bike while riding on a flat road, or submit a final report to your boss full of spelling mistakes because spell check was off and computers can’t be trusted...you are in the mood for poorly made, but still delicious, dammit, pasta. Maltagliati is a reminder that your mistakes don’t define you. It’s what you’re made of that matters.Illustration by Nadine RedlichNuvoleTranslation: cloudsWhether you find yourself in a natural dream-state or use some THC to get there, make the most of your airy optimism by consuming nuvole pasta. Pasta castles in the air—you’ve looked at clouds that way, right? Then they turned into IRL carbs and you ate them.GemelliTranslation: twinsIt’s important to examine a problem from multiple points of view. When you’re troubled and linear thinking just won’t do, reach for gemelli. The best twins complement each other but bring two very different energies to the table—one good, and one evil, ideally. Put a piece of pasta on each shoulder to drive this point home, grab a mirror, and talk to yourself in different voices while you eat gemelli and sort your ish out.Illustration by Nadine Redlich CaramelleTranslation: candyTired: eating a big bowl of candy when you’re sad.Wired: eating a big bowl of candy shaped pasta when you’re sad.PansottiTranslation: potbelliesIs big belly a feeling? Maybe not, but you can feel your big belly while eating big bellies pasta to achieve true inner peace. Pat your tum tum while nom noming these, and become your own personal Buddha.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-25", "author": ["Condé Nast", "Carla Ciccone"]}