{"id": "d3d0915fd75bf01334b766ad004e85d5", "url": "https://www.bonappetit.com/story/a-new-day-for-bon-appetit-video", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "A New Day for Bon Appétit Video | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA New Day for Bon Appétit VideoWe’re back on YouTube.By Sonia ChopraOctober 13, 2020FacebookTwitterEmailFacebookTwitterEmailEvery Tuesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.Why did you join Bon Appétit? That’s the question I’ve gotten the most since I started at Bon Appétit almost two months ago. It’s a big question to answer because there are so many reasons, but I always start by talking about how good the team here is. The staff is so talented and has so many big ideas, and I can’t wait for us to unveil all of them to the world. I also say that I’m here because I love good stories and great recipes and want to share as many of them with as many people as possible, and at BA that means not just on the website but also in the magazine, on our social channels, and across video and all entertainment platforms. Which brings me to today, when we’ve just relaunched our YouTube channel.Over on YouTube, you can see three new videos: One with test kitchen director Chris Morocco cooking through his weeknight meatball recipe; another with a new host, chef Chrissy Tracey, who walks us through her vegan take on fried chicken (using oyster mushrooms!); and a third that features a conversation with chef Marcus Samuelsson, who is our new global adviser, incoming editor in chief Dawn Davis, who starts next month, and me, about our perspective on food and what we hope to bring to BA—and our morning routines. We wanted to debut all three of these videos on the same day because we hope they show our audience—all of you—the breadth of what we are trying to do. We hope to showcase both new and familiar faces, all doing the things they do best: making food and talking us all through it—and having a great time while they’re at it.Want this letter before it hits the website? Sign up for our newsletter!I really hope you like what you see today, over the next few weeks, and into the future. I hope these new videos bring you joy, whether they remind you of your favorite recipes and techniques or teach you something new. Dawn, Marcus, and I are all still extremely new to BA, but we are so committed to learning together with the rest of the staff to get things right. We are looking forward to growing our video program, learning as we go, and trying new things—all rooted in the recipes and food stories you’ve come to know and love on Bon Appétit, but with some new perspectives and a lot of surprises to come. As always, you can let me know what you think at sonia@bonappetit.com.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-13", "author": ["Condé Nast", "Sonia Chopra"]}