{"id": "d3dc98748db5aea9bbf5cee3a64aeb33", "url": "https://www.bonappetit.com/recipe/butter-roasted-halibut-with-asparagus-and-olives", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Butter-Roasted Halibut Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueButter-Roasted Halibut with Asparagus and OlivesBy Alison RomanApril 16, 20195.0(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintOur best tip for cooking fish for a crowd? Slow-roast a single large fish fillet instead of making several small ones—it ensures that the fish is buttery and delicious. Vegetables that are best served crisp-tender are a great accompaniment because they'll be perfectly cooked by the time the fish is finished.Ingredients6–8 servings2bunches asparagus, trimmed, halved lengthwise if thick, divided6Tbsp. unsalted butter7Tbsp. extra-virgin olive oil, divided1tsp. Aleppo-style pepper2½lb. skinless halibut, salmon, or arctic char filletKosher salt, freshly ground pepper2bunches ramps or scallions, trimmed¾cup Castelvetrano olives, pitted, torn¼cup finely chopped chives¼cup fresh lemon juice2Tbsp. coarsely chopped tarragon, plus leaves for servingBoiled small waxy potatoes and lemon wedges (for serving)PreparationStep 1Preheat oven to 325°. Thinly slice one-quarter of asparagus into coins and place in a medium bowl; set aside.Step 2Heat butter and 2 Tbsp. oil in a small saucepan over medium. As soon as butter is melted, add Aleppo-style pepper and remove from heat.Step 3Season fish with salt and black pepper on both sides and place on a rimmed baking sheet. Scatter ramps and remaining asparagus around fish; season with salt and black pepper. Pour butter mixture over fish and vegetables. Give vegetables a toss to evenly coat. Roast, undisturbed, until fish is just opaque in the center and asparagus is bright green and tender, 15–25 minutes, depending on the thickness of your fillets.Step 4Toss olives, chives, lemon juice, 2 Tbsp. tarragon, and remaining 5 Tbsp. oil with reserved asparagus; season with salt and black pepper.Step 5Transfer fish to a platter; top with ramps and asparagus. Spoon some olive mixture over, then scatter tarragon leaves over. Serve with potatoes, lemon wedges, and remaining olive mixture alongside.How would you rate Butter-Roasted Halibut with Asparagus and Olives?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThis is good…really good. I used some beautiful fresh red snapper and followed everything else to a tee. Perfectly cooked and subtly flavoured. We generally use fan forced ovens here in oz but thanks to bon appetit I have discovered a whole new world of cooking without using the fan. It keeps things so moist and tender. An amazing an easy dinner!!Miranda Perth, Western Australia3/26/2022Holy moly- BEST. Halibut. Ever. What an amazing recipe!!! Couldn’t find ramps so used organic green onions- delish. I don’t like tarragon so used fresh Basil instead. Our guests were very impressed. This recipe is a keeper. Don’t question any further, just make this. You’ll love it! JMFort Worth, Texas 3/13/2022Fantastic dish.  Used a bit of fennel instead of tarragon.  Visually lovely and great texture and flavor.  Definitely a keeper. Dmanf3/29/2021Delicious. I did not have Aleppo pepper or tarragon, so I used paprika and ground red pepper and for herbs, I used lemon thyme and rosemary. I did roast the potatoes with the fish. I will make this again.AnonymousNew York11/7/2020The butter with the Aleppo pepper was amazing! I also added some prawns. Tasted excellent. AnonymousTacoma, WA4/29/2020Wonderful!\nAnonymousPortugal4/24/2020Excellent recipe.  Used a thick filet of cod, substituted 1leek instead of the ramps, and skipped the olives. Both fish and vegetables were perfectly done, and the chives and tarragon made for terrific flavor.AnonymousMassachusetts 1/12/2020I've made this twice, successfully both times. The second time I cut the asparagus and spring onions in 2\" pieces, making it easier to serve, though not as lovely. My sister-in-law, a former restaurant owner, said it was wonderful.  I like when a relatively easy dish is spectacular. Next time halibut is on sale, it might make the menu again.ebappelThe Hudson Valley, New York7/2/2019This was so good! I went with cod instead of halibut, red pepper flakes instead of aleppo pepper, and scallions instead of ramps. And it. Was. Delicious. (And a lot cheaper) You can save time if you do all of the topping/ salad prep while the fish roasts. mhdsileskyAustin, TX6/7/2019To \"Anonymous\" in Denver - the recipe is not crystal clear, but the asparagus coins are made from one-quarter of the entire amount of asparagus that you have.  BTW - the coins are raw which was an interesting departure but quite nice.diane oronaPasadena, California5/22/2019Delicious and really easy!! Highly recommend. I was short a couple ingredients and subbed thinly sliced scallions for the chives and dill for the tarragon, but it was super easy and very tasty. Bought baby potatoes and roasted those at the same time as the fish in a separate sheet pan tossed with EVOO+ salt/pepper, would repeat (or do same pan as the fish if I had the space). 5/22/2019\"Thinly slice one-quarter of asparagus into coins and place in a medium bowl; set aside.\" I sliced one quarter of one asparagus stalk, and I'm pretty sure it wasn't right. XD This is good stuff though! I didn't change anything and I don't think that I would, except maybe spice the potatoes up somehow. AnonymousDenver, CO5/13/2019Explore Bon AppétitHalibutFishSeafoodAsparagusVegetableOliveOther IngredientsRampsOnionSpringEasyOne-Pot MealsWeeknight MealsMainGluten-FreeNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Alison Roman"]}