{"id": "d3ea6ac4f7acb1e1051b80421f74f2ac", "url": "https://www.bonappetit.com/recipe/roast-fish-with-curry-butter", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Roast Fish with Curry Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueRoast Fish with Curry ButterBy Chris MoroccoAugust 13, 20194.5(34)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThe slow-roasting method that turns salmon all buttery and luxurious works equally well on the whole wide delicious world of flaky white fish, from cod to haddock. Here we give vegetables a head start in a hot oven before turning the heat way down, laying the fish on top, and letting everything finish cooking together. The result: an entire (healthy!) dinner in one pan. We call for fennel, potatoes, and red onion here, but you can swap in any seasonal vegetable that you love to eat in roasted form. As long as all your veg pieces are roughly the same size, you’re golden. Try: sweet potatoes, carrots, cauliflower florets, or butternut squash.Ingredients4 servings1fennel bulb, sliced1large red onion, cut through root end into 8 wedges1lb. baby Yukon Gold potatoes, halved if large3Tbsp. extra-virgin olive oilKosher salt4Tbsp. unsalted butter2garlic cloves, crushed1½\" piece ginger, peeled, finely chopped1tsp. curry powder1¼lb. piece cod, hake, haddock, or pollockMint (for serving)PreparationStep 1Preheat oven to 425°. Toss fennel, onion, potatoes, and oil in a 3-qt. baking dish to coat; season with salt. Roast, tossing once, until vegetables are browned and softened, 35–40 minutes.Step 2Meanwhile, melt butter in a small saucepan over medium heat. Mix in garlic, ginger, curry powder, and a pinch of salt. Simmer until color intensifies, about 1 minute. Remove from heat.Step 3Season fish with salt and lay on top of cooked vegetables. Drizzle fish with curry butter. Reduce oven temperature to 350° and bake fish until flesh easily flakes apart with a fork, 12–15 minutes.Step 4Serve vegetables and fish with mint scattered over.How would you rate Roast Fish with Curry Butter?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleTasty and easy. I only needed two servings so I used two portions of cod, but without cutting everything else in half. I did this because we like roasted veggies, and because other reviewers suggested doubling the curry butter. I didn't use as many potatoes, but I added 7-8 whole cloves of garlic, the full fennel bulb, two carrots cut in chunks, and 1/2 yellow pepper cut into strips. Just before adding the fish, I tossed about a dozen cherry tomatoes with the other veggies. Yum! I will say that forgot to turn down the oven temperature once I added the fish and that resulted in the fish being a little overcooked. Anonymous7/15/2021This is a great recipe.  Made it exactly like the recipe, but used cilantro instead of mint.  Great flavor and perfectly cooked fish.   Definitely a make-again recipe.RolltideCharlotte NC2/1/2021Fenn-omenal! I always have fennel around because I love it. I was originally going to do a Mediterranean fish bake with fennel, olives and tomatoes-then I found this recipe! I didn’t have potatoes so I used turnips and the combination was lovely. As others suggested I doubled the curry butter and I made rice - which was superfluous but soaked up more of that wonderful curry butter. Easy and delicious. Elizabeth Molinaro“Tip o’ the Mitten” MI1/8/2021MAKE MORE SAUCE — you’re welcome!\nI substituted potatoes for delicada squash and it was MAGICAL... also you’re welcome.\nThis was easy and yummmmmoKylieBrooklyn 11/10/2020This recipe gets points for being so easy. However, this combo of veggies doesn't really do anything special for this dish and they definitely need some extra seasoning. The cod, on the other hand, was perfect. Up the curry powder to a heaping 1 Tbsp, you won't regret it. Since I was using a few smaller filets instead of a single 1+ lb piece I cut the fish cooking time down to 8 minutes and they were perfectly flaky. AnonymousWashington, DC9/27/2020We made this for Sunday lunch. Husband did the shopping, so we used catfish. Only other change here was adding 1.5 teaspoons of currry in the oil I used to toss veggies before roasting. We served with lime wedges for the fish and mustard for the potatoes. So easy to throw together, I will be making this again!AnonymousMinnesota9/13/2020This was really great. I seasoned the veggies with salt and pepper and used elephant garlic in addition to the onion. Also added broccoli to the veggies which turned out really well. I used the suggested amount of butter but more ginger, garlic and curry to boost up the flavor and added a bit of Garlic olive oil. I didn't have any Mint so I used Shadow Benny instead (my personal go to).  So easy to make & it helped to peek my interest again in some of the White fish that is available here.AnonymousBelgium7/20/2020This was really great. I seasoned the veggies with salt and pepper and used elephant garlic in addition to the onion. Also added broccoli to the veggies which turned out really well. I used the suggested amount of butter but more ginger, garlic and curry to boost up the flavor. Such a simple recipe but so good!AnonymousUnited States5/9/2020Excellent. Easy. I use fennel (essential), sweet potatoes and cauliflower in a cast iron pan. I've even substituted chicken breast for the fish, cooking it for at least 30 minutes of the total cook time and nestling it in the veggies. A perfect meal for \"sheltering in place.\" AnonymousPhilly5/1/2020This was yummy. I agree with some others that the veggies were a bit bland compared to the fish.\nI saved the recipe because the curry butter itself is exactly the flavor I'm looking for when I crave curry. I've never been able to get that right before. I've made (double) the curry butter for a few dishes since, unrelated to the original fish and veggies recipe. It goes well with tomato based or coconut milk.brendazzimac8927Victoria BC12/12/2019I would definitely make this again and I already have. Usually I don’t like fish the next day so was surprised on how good it was the next day. Almost better. 😋 Basalt,Co10/24/2019Super easy and pretty flavorful. Perfect for a weeknight meal, but not something I would serve guests. I agree with other reviewers about doubling the curry butter. The veggies were a bit bland. Oh, and I used tilapia. (For what it's worth, my husband and daughter thought it was better than I did.)bridgetjohnson19702292Minneapolis10/17/2019This was a crowd-pleaser in our house and is definitely going into the weeknight rotation.  As others have suggested, I would double the curry butter recipe so as to be able to get more on the veggies (it's that good).  Very easy to make and clean up as well.naphHuntsville, AL10/17/2019covered or uncovered in oven?Anonymous10/2/2019This was a decent recipe, but as someone who's currently getting back to eating better, I'm not sure I would count this as healthy? If you divide this into four servings, as per the ingredients list, it has almost 2 full tablespoons of butter/oil combo per person. I'm all for having variety in your diet (and also eating whatever the hell you want) but it seems pretty high on fat content. I would definitely play around with adding more seasoning/veggies and maybe trying to lighten it up a bit. I feel like I need to try it again since this did receive a lot of other glowing reviews, but I found it to be a bit one note, with that note overwhelmingly being \"grease\". AnonymousNew Jersey9/27/2019Explore Bon AppétitFishSeafoodPotatoVegetableFennelYukon Gold PotatoEasyOne-Pot MealsWeeknight MealsMainHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Chris Morocco"]}