{"id": "d3ecb94775ce334524740af245e47753", "url": "https://www.bonappetit.com/story/asafetida-indian-spice", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Asafetida Is the Spice That Makes My Indian Food Taste, Well, Indian | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAsafetida Is the Spice That Makes My Indian Food Taste, Well, IndianA pinch of funky asafetida makes every other spice come through. Try it!By Priya KrishnaSeptember 12, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Priya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.When my friends and family were testing the recipes for my upcoming cookbook, Indian-ish, the most common source of confusion was not over any instruction or technique, it was regarding an ingredient: asafetida (also spelled asafoetida, and in Hindi, hing).People couldn’t pronounce it. They couldn’t find it in Whole Foods. They were alarmed by its potent smell. But when they did use it, they immediately got it.Asafetida (pronounced phonetically, found online or at Indian grocers like Kalustyan’s) is the most simultaneously misunderstood and sublime ingredient in Indian cuisine. It is essentially a gum extracted from a ferula, an herb in the celery family. It is usually available as a coarse yellow powder and smells like boiled eggs. But don’t be put off by the pungency. When used properly, a pinch of asafetida supercharges every other spice in the pan, like salt but in a funkier way (and without any sodium). I don’t know how else to put it except to say that to me, it makes Indian food taste more Indian.Chelsie Craig Vandevi Asafetida (Pack of 2)$8 at AmazonUnlike turmeric or cumin seeds, asafetida hasn’t yet made it into mainstream food stores. But you can find it at most Indian grocers in small plastic containers for around $4. My family’s go-to brand is Vandevi from India. Its signature bright yellow container has an armor-clad deity on the label and a slide-to-open cap. You can find it on Amazon for around $8.Asafetida was involved in about 90 percent of the dishes of my childhood. It was in the rich tadka (or tempered spices) for my mom’s dal, it was the small but mighty addition to her roasted aloo gobhi, and it was the secret to the addictive depth of her matar paneer. Growing up, I knew my mom was home from work and cooking dinner when I sniffed the burnt-oniony scent of asafetida sizzling in oil from my desk upstairs. And I knew it was my dad cooking dinner when the asafetida smell permeated the house so intensely that I had to move my homework to our farther afield guest room and shut the door. (My dad’s family has a well-documented adoration for asafetida, mostly because it is great for producing farts; this prompted my mom to invent the Hindi-English verb “hing-o-fy” to refer to my dad’s penchant for doubling the asafetida in everything he makes.)This chickpea bar snack from Gunpowder in London uses asafetida with curry leaves and mustard seeds.\nPeden + MunkLet’s talk about how to cook with asafetida. You can’t just sprinkle it like fairy dust atop a finished dish. That would taste very strong and unpleasant. To bring out its ideal level of funk and temper its bitterness, asafetida must be cooked directly into the pan with fat (oil or ghee, usually). To make the flavor truly shine, add it to your other spices (any combination of cumin seeds, coriander seeds, cardamom, and fennel seeds will do the trick) after they’ve tempered in hot oil and let it dissolve for about 30 seconds before mixing into veg, meat, lentils, or rice. That’s how asafetida lends its powerful umami-like punch to any dish.Also relevant to discuss: storage. Part of the reason asafetida gets such a bad rap is that people aren’t storing it properly in an airtight container (even if you bought it in packaged form). This is important! If you don’t, that pungent smell will permeate your cabinet and never go away. Every time I use asafetida, I wipe the lid (in case any powder has spilled onto its sides), make sure the container is properly sealed, and then store it inside a second container. My apartment isn’t that big, so the potential aftereffects of an asafetida leakage could last for months.I am somewhat sad to admit that after a lot of back-and-forth, I made asafetida “optional, but really great” in the recipes where it’s called for in my cookbook. I want the dishes to be accessible, and I didn’t want to discourage people from cooking a recipe based on one ingredient they can’t find in their local grocery store. But let me use this space to officially say: if you can find asafetida, buy it and cook with it. Asafetida is the ringer that makes so many Indian dishes exceptional. It’s a flavor that you can’t pinpoint in a dish or even fully explain but that lingers on your taste buds long after all the other spices. Once you start cooking with asafetida, every Indian dish you eat without it will taste like it’s missing something. And you’ll know why.Explore Bon AppétitIndianishIndianShoppingSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-12", "author": ["Condé Nast", "Priya Krishna"]}