{"id": "d3fce2232250ad32d2457917d2ef4e2e", "url": "https://www.bonappetit.com/story/what-is-coconut-sugar", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "What Is Coconut Sugar, the Alt-Sweetener Taking Over Baking? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Coconut Sugar, the Alt-Sweetener Taking Over Baking?It's  our favorite unrefined sugar for baking, cooking, and sprinkling with wild abandon.By Aliza AbarbanelApril 13, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis story is part of the Healthyish Pantry, a collection of articles breaking down the ingredients we love most. Click here to read the whole guide—then stock up.Taking a trip through the health food store right now is a bit like falling down a coconut black hole, lined with infinite iterations of cult-status probiotic yogurts and tortilla chips. We're not immune either—just check out our roster of coconut-infused mousses, puddings, and curries. When it comes to baking with alt-sweeteners, coconut sugar comes out on top. But what exactly is coconut sugar, and how healthy is it really?First, the basics.Coconut sugar is made from the nectar produced by coconut blossoms (not actual coconuts), which is then boiled and ground to create a granular substance with a texture similar to brown sugar. It is primarily produced in Southeast Asia, where it is used to create desserts like the tapioca-like pudding sago gula melaka and klepon, coconut-coated rice cakes filled with liquid coconut sugar.Why are you seeing it everywhere?Coconut sugar is widely touted as a healthy sugar alternative. Still, it’s important to be realistic: coconut sugar is still sugar. It isn’t a superfood—or even really a health food. However, coconut sugar can be viewed as a healthier alternative to refined sugar. Coconut sugar has a lower glycemic index (GI) ranking than cane sugar, which tracks how foods affect blood glucose levels. Food with low GI values are digested and metabolized at a slower rate, prompting smaller fluctuations in blood glucose and insulin levels, and reducing risk of diseases like type 2 diabetes. We also love coconut sugar’s mild caramel flavor, which rounds out baked goods with a slight earthiness.Responsibly-harvested Nutiva coconut sugar is one of the many brands around.\nPhoto by Alex LauHow should you source it?Coconut sugar should be caramel-hued and granulated, with a texture similar to brown sugar (without any lumps). Many food blogs are fond of mentioning a study by the Food and Agriculture Organization claiming coconut sugar is the “most sustainable sweetener,” but the non-profit GRACE Communications Foundation was unable to verify this claim. However, it is true that coconut sugar is created without cutting down trees, and is usually harvested by small-scale producers year-round. To purchase the most sustainably harvested coconut sugar, look for fair-trade and organic brands at grocery stores or online.How can you use it?Baking with sugar alternatives can be tricky, but coconut sugar plays well with others.“When you have a slate of alternative sugars, you realize coconut sugar is at the front of the pack,” says senior food editor Chris Morocco. Last year, Morocco had the undeniably tricky task of creating three desserts from sugar alternatives. He mastered date sugar chocolate sablés and mango-yogurt pudding sweetened with lucuma, but found creating a citrus crumble with coconut sugar syrup to be the easiest task. “You can use it as a one-to-one replacement for cane sugar, but manage your expectations,” he says. “The result might not be as moist and chewy.”To understand the pitfalls of baking with coconut sugar, it’s important to understand the traditional role of sugar in baked goods. In addition to providing sweetness and flavor, refined sugar helps create structure, moistness, and chewiness. The chemical bond between sugar and water locks in moisture, creating tender cookies that are less likely to dry out.Alt-sugars have a different chemical makeup, which frequently means they lack these useful qualities. In other words, you shouldn’t expect a cookie made with coconut sugar to behave exactly like a cookie made with refined sugar. Still, coconut sugar easily dissolves into simple syrups and creams into butter and eggs. This adaptability makes it easy to sprinkle coconut sugar into your morning latte or whisk it into an agave-like syrup to drizzle over your chia pudding—and that's only the beginning.Buy It: Nutiva Coconut Sugar, $6 for 1 lb on Jet.comBreak out that bag of coconut sugar:Coconut-Chocolate MousseChoose a chocolate that does not exceed 64% cacao for a mousse with the smoothest texture. If you want the mousse to be fully non-dairy, look for a vegan chocolate bar, though the flavor may differ slightly.View RecipeCitrus Crumble with Coconut and NutsThis crumble isn’t just for seasonal citrus; use it on any roasted fruit, oatmeal, or even yogurt.View RecipeCacao and Coconut LatteFor a more caramel-y depth of flavor, toast the coconut flakes first.View RecipeExplore Bon AppétitHealthyishHealthy DessertsCoconutSugarPalm SugarRead MoreLifestyleWhat Is Cacao, And How Does it Relate to Chocolate?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-13", "author": ["Condé Nast", "Aliza Abarbanel"]}