{"id": "d3fd3b7b7c6f5468cfc71141b1723335", "url": "https://www.bonappetit.com/story/lunch-is-the-new-dinner", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Lunch is the New Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLunch is the New DinnerRestaurant recommendations and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroApril 4, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I generally have a no-subway-on-the-weekends policy, but I ended up in the West Village last Saturday, a good 15 stops from my apartment in Brooklyn, and decided to make the best of it. It felt like the first real day of spring: People were drinking spritzes at sidewalk tables, dogs were romping in Washington Square Park, even the traffic cop writing tickets looked happy and relaxed. We ended up at King, which is the perfect restaurant for lots of occasions—work lunches, date nights, parent visits—but I think it’s best on a weekend, specifically in the late afternoon.I’m not talking about b----h, the meal I refuse to name let alone partake in. At King, the daytime menu is the same whether it’s Tuesday or Sunday. There are no bottomless mimosas. You cannot order eggs.We started with a brilliantly pink endive salad with long shavings of ricotta salata and blood-orange wedges. Then came the pasta: a tangle of lemony taglierini streaked with barely wilted arugula. And finally the lombatello, a small, perfectly cooked hanger steak, served with a few spoonfuls of brothy borlotti beans and stems of chard. It was the perfect amount of food for two people (who both skipped breakfast). We ate lazily in the light-filled space. There was no line at the hostess’s desk, no harried servers trying to turn tables. And as the clock pushed toward 4 p.m. we realized: This isn’t lunch. It’s the best way to have dinner on a Saturday in Manhattan.The ride home was a hellscape of delays, but at least we’d gotten the other part right.This Week on HealthyishIs your wellness practice just a diet in disguise? Social scientist Melissa A. Fabello thinks we need to take a second look at all the things we do in the name of “health.” Fariha Róisín talks to the founders of a new kind of healing space in Brooklyn, where all types of bodies can feel at home. And Aliza Abarbanel writes about the low- and no-waste stores cropping up around the city and whether they could be the future of retail...or just an inaccessible trend.My kind of comfort food.\nPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiWhat I’m CookingIt’s been a week of comfort food—broccoli bolognese, lamb meatballs over rice—and Seamless (I dream about my local Indian spot’s Manchurian cauliflower). I have my heart set on this roasted salmon with salsa verde, maybe this weekend, and Priya Krishna’s dahi toast. (If you haven’t ordered Indian-ish yet, get on it!)What I’m ReadingI thought I was going to hate-read this peloton instructor’s work diary, but you know what? I appreciate her hustle. And her commitment to The Bachelor and getting nine hours of sleep. I’m also making my way through The Cut’s marriage series, and the transcript of a couples' therapy session reminds me of Esther Perel’s “Where Should We Begin” in the best way.What I’m WatchingGame of Thrones and only Game of Thrones, because I challenged myself to watch all the seasons I missed before the new one airs. I missed…a lot of seasons. What have I gotten myself into?Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletterNew York CityessayRead MoreLifestyleOn Banning Celery Juice and Getting to SleepBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-04", "author": ["Condé Nast", "Amanda Shapiro"]}