{"id": "d41c8526defddcd2e090e5587f6dfb07", "url": "https://www.bonappetit.com/story/where-to-buy-ancient-grains-online", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "Where to Buy Ancient Grains and Freshly Milled Flours Online | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhere to Buy Ancient Grains and Freshly Milled Flours OnlineStock your pantry, support local mills, and get baking.By Alex BeggsJanuary 26, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by D'mytrek BrownFacebookTwitterEmailGrab the King Arthur off the shelf, get on with your life. That’s how buying flour usually goes for me. I have intense brand loyalty to the tiny flour king. But then I got a copy of Friends & Family co-owner Roxana Jullapat’s fantastic upcoming cookbook (the season’s most exciting release), Mother Grains, and suddenly I needed some spelt flour, STAT.In the February issue of Bon Appétit, we went deep with Roxana on why baking with whole grain flours is more exciting than boring ol’ all-purpose (you’ll always need that on hand, too, because a lot of these other grain flours lack its gluten levels). Whole grains are also better for you—so much fiber—and many are better for the environment too. Why aren’t they right next to the all-purpose flour in the baking aisle, though? I had to track down spelt, rye, buckwheat, and rice flours at a great bulk foods store where I live in Ann Arbor called By the Pound. My farmers market carries local cornmeal! I’m spoiled, and lucky. Depending on where you are, you might have a harder time finding more obscure flours, especially einkorn flour, a type of flavorful wheat that makes nutty, near-savory shortbread that I made over and over this past holiday—recipe here.Good thing the internet exists!These are Roxana’s favorite mills with online stores. When in doubt, Bob’s Red Mill makes a solid handful (sorry, not einkorn) and they’re reliably fresh and consistent. Roxana-approved. (And not sponsored!)Grist & Toll“I have not used better flour in the entire country,” Roxana says. “It’s the mill I recommend the most for their Sonora wheat and spelt as well as their hard white and hard red flours.” Use the tender, tasty Sonoran wheat for pie crust, cakes, and any pastry really. Use the spelt to make these blueberry muffins and the hard white and hard red flours for breads. And good news: They have einkorn! If you pick up some rye flour and a banneton, you can make Roxana’s no-knead beer bread too.©2020Anson MillsTry ALL of the cornmeals. For baking, go with the fine grind for baked goods with delicate, fine crumbs—makes sense, right?—like cakes, cookies, and this ricotta pound cake. (Note: Different cornmeal colors bring different flavors. Try blue! Roxana prefers white in the pound cake recipe: “For me, white cornmeal seems so rare. It’s cool. It has a more subtle flavor, but it’s not lacking anything.” Yellow has a more corn-forward flavor; I like that.) Coarse cornmeal is your cornbread friend: It creates that little bit of crunch and squeak. But don’t stop there. Anson Mills’s “toasted oat flour is my go-to,” Roxana adds. It has an “intense nuttiness,” a sweet cereal-like flavor, and is great in pancakes, these gluten-free apple muffins, and the banana bread in Mother Grains (just preorder it already!). While you’re shopping, you might as well pick up some buckwheat flour to make this chocolate soufflé-like cake, and this Japanese buckwheat to make soba when the mood strikes (Japanese Home Cooking is the cookbook you’ll need for that). Chewy farro? Purple “long lost” beans? Add to cart.Capay MillsCapay has the deep cuts, milled-to-order. You’re here “for rare wheats (like Sonora White flour),” Roxana says. And almost purple blue cornmeal. Bread heads will nerd out over the Red Bug Nouveau, and why shouldn’t they? It produces an airy, wide crumb, so you can hold your slice of bread up to the sun and let the light shine in.Maine Grains“Get the Øland wheat flour, an heirloom from Scandinavia,” Roxana says (then use it as you would whole wheat flour; see below for swapping tips). Maine Grains is a one-stop shop: Pick up some chewy rolled oats to make granola scones, stock up on buckwheat flour, spelt, and then make impulse purchases like sourdough starter, hay straws, and a cute dishcloth knitting kit.Wade’s MillWade’s Mill’s Bloody Butcher cornmeal is an awesome, ancient variety first grown by Native Americans; it gets its name from the red-and-brown specks in the yellow cornmeal. Roxana uses it in her Cotija cornbread in Mother Grains (I made it and can testify to its greatness). Wade’s Mill also sells a variety of whole grain flours, plus some good gift-y baking kits, and you can’t not add on a jar of Traffic Jam.Hayden Flour MillsWe are here for some pasta flour, people. Can’t go wrong with a box of heirloom all-purpose. Roxana’s a fan of Hayden’s semolina as well, which she told me she swaps for cornmeal (semolina is ground-up durum wheat while cornmeal is ground-up corn, so they have similar textures) in the ricotta pound cake recipe, then adds a little anise and orange zest to for an Italian pastry vibe. And speaking of cornmeal, Hayden has a LIMITED EDITION one now! Better get on that.*A note on boldly experimenting with whole grain flours, a thing you should do:Play with these flours in nearly everything you’re baking (bread is trickier). Roxana tries out new flours in chocolate chip cookies and suggests them pancakes or waffles too. A general rule of thumb is to use a ratio of 25:75 whole grain flour to AP flour and work your way up to 50:50. In pie crust, be prepared to add more moisture to hydrate those whole grain flours. Even the tiniest addition of some whole grain flour will deepen the flavor of what you’re baking, and you’ll find it’s hard to go back to plain ol’ all-purpose flour after this.Now go and bake these recipes!1 / 7ChevronChevronRicotta Cornmeal Pound CakeView RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-26", "author": ["Condé Nast", "Alex Beggs"]}