{"id": "d41e0f1b78edc14957402449ef710b50", "url": "https://www.bonappetit.com/story/heidi-swanson", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Heidi Swanson on How Her Own Cookbook Carried Her When Everything Fell Apart | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow My Own Cookbook Carried Me When Everything Fell ApartIn a year of sickness and loss, author Heidi Swanson returned to the food she'd taught so many of us to love.By Heidi Swanson, As Told To Emily WilsonAugust 11, 2021FacebookTwitterEmailPhotograph by Heidi SwansonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When I set out to write my cookbook, Super Natural Simple, I wanted the recipes to be approachable—something anyone could make for dinner that night. So I used a lot of pantry staples. I didn’t get too crazy with ingredients. I settled on a core flavor profile for the savory dishes and, within the baking realm, stuck to a shortlist of whole grain flours. I was hoping to ride the wave between aspirational and weeknight achievable. I never could have known that my life was about to get so chaotic that I'd need those recipes more than ever.My husband, Wayne, and I moved twice in a short period of time, first down to Long Beach from San Francisco and then to a more spacious Spanish bungalow just a block away from the ocean. The pandemic hit shortly thereafter, but, thankfully, most of the work for my book was done, including a good chunk of the photography. Recipes like the California Masala Granola and Miso and Big Raspberry-Rye Cookies remained staples as I powered through edits and weathered the lockdown. Then, in what felt like a split second, my family life imploded.My dad was diagnosed with cancer last summer. As we were coming to terms with the news and familiarizing ourselves with the intricacies of the illness and its treatments, things took a terrible turn for the worse. In September my mom died unexpectedly in the middle of the night. I barely had time to process anything before my dad fractured his neck and I had to do my best to pull it together.Photograph by Wayne BremserMost days were a blur; I was just trying to navigate hospitals, doctor appointments, and my dad’s copious medicines, and to keep from getting COVID-19 while we tried to stabilize things as a family. With our new-ish puppy, Polly, in tow, Wayne and I were making the 400-mile drive from Long Beach to my dad’s house in Northern California so frequently that we used up most of our car’s miles well before its lease was up.When my dad came back from the hospital after his neck injury, he needed 24-hour care. So, along with a slew of other family members, we temporarily moved in with him in October. There were a lot of people under one roof. We had caregivers staying overnight and therapists coming who were also seeing other patients—and we all had to eat. On those chaotic days, I found myself turning to my own cookbook for advice. At a base level, I needed really good family-style recipes that were relatively simple to shop for and easy to prepare. And I had a whole book of them in front of me. So I cooked a lot from Super Natural Simple. We’d “merchandise the fridge” a few times a week so everyone could see what exactly was in the most highly-used appliance in the house (aside from the dishwasher). And we reorganized the pots and pantry so the items we loved (and used) most were up front.My philosophy of using whole grains, seasonal vegetables, and natural ingredients to create vibrant, nutrient-packed, vegetarian dishes is one that I’ve practiced and shared for several decades now; on my blog, 101 Cookbooks, and in my Super Natural series of cookbooks—to which the latest is actually a kind of prequel. Keeping things simple by leaning on the skills and ingredients I’ve come to love was the life raft that buoyed me; it allowed me to feed many mouths with intention, while also working through a scary and unpredictable time.When my dad lost his taste buds as a result of chemotherapy, he wanted to eat crazy spicy food. So I made him bowls of my Peanut Stew with Spinach and Miso, Ten-Ingredient Masala Chili, and a pot of Fire Broth Noodle Soup on the fly, seasoning it with cayenne, ginger, and garlic and loading it with feel-good foods like beans, pasta, kale, and turmeric. The soup helped me, too. Its simplicity, intensity, and freshness were exactly what I craved, and what I needed to keep myself going. Somehow we made it through, but as anyone who's witnessed cancer knows, you're in it for the long haul. It's still hard, and uncertain, but my dad is in good spirits, and his friends can come to visit him now.By spring 2021 Wayne and I were mostly back in Long Beach, but any sort of press circuit for Super Natural Simple took a back seat to trying to regroup. I needed time and space to process. At the same time, I was excited to see how the book was resonating with people on social media and which recipes were becoming fast favorites.In Southern California we finally have the garden plot I’d been waiting a decade for in San Francisco, and we’ve grown favas, lemongrass, hibiscus, tomatoes, shell beans, tulsi basil, and all sorts of other ingredients. I’m also still getting the hang of the general area, cementing a routine of markets to hit. I’ll sometimes go up to the Santa Monica Farmers Market on Saturday mornings. I love Pioneer Cash & Carry, an Indian grocery in Artesia. It’s so much fun to shop all of the different produce and spices, and the two full aisles of pickles and condiments. Dong Mai is a great Asian market that sells Cambodian and Vietnamese ingredients, and down in Orange County there’s Tokyo Central. Exploring all that Long Beach has to offer is helping me feel grounded, and providing some much-needed mental relief since shopping for food and finding new spots is what I love to do.The last year has been so surreal. On one hand, everybody was cooking these really elaborate meals or using the time to learn and build skills in the kitchen. But I was experiencing the opposite effect; a good, wholesome, and simple meal really made a difference during such an emotionally difficult time—both for me and my family. My life over the past year has been so complicated, and I'm still trying to wrap my head around everything that’s happened. In all honesty, I really don’t even know how to talk about a lot of it yet. While I still have those days where I feel out of my depth, I’ve always enjoyed making and sharing food with natural ingredients as a way to connect with people on a fundamental level—and I’m still excited about that.Get the Cookbook:Super Natural Simple: Whole-Food, Vegetarian Recipes for Real Life$28 $22 at Amazon$28 $26 at BookshopExplore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-11", "author": ["Condé Nast", "Heidi Swanson", "As Told To Emily Wilson"]}