{"id": "d43794deed628b2a9d3a80cded1aafd8", "url": "https://www.bonappetit.com/story/20-minute-shrimp-stir-fry", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "This 20-Minute Shrimp Stir Fry is Even More Addictive Than Doritos | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis 20-Minute Shrimp Stir-Fry is Even More Addictive Than DoritosOnly you won't feel bad about eating it for dinner.By Meryl RothsteinJuly 12, 2019FacebookTwitterEmailFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Every time I eat the Shrimp and Basil Stir-Fry—which is quite often—I think about Doritos. It’s not that this weeknight dinner brings to mind Cool Ranch, but rather that the balance of sweet, salty, and spicy is so perfect, it’s as though the same people who engineered Doritos to be addictive had a hand in this recipe. (They didn’t—it was all Andy Baraghani.)So if it’s not Frito-Lay mad science that’s responsible for the hit-every-taste bud-you’ve-got thing, then what is? It’s a marinade that’s a mix of sugar, fish sauce, garlic, and chiles, a super concentrated paste that delivers flavor in record time (that record is 10 minutes).And it's as easy as it is delicious. The recipe uses mostly pantry ingredients, so as long as I have the wherewithal to buy shrimp on the way home (or if by some miracle I have some in my freezer), I have what I need to throw it together. It takes about 20 minutes from the moment I walk in the door until I sit down to eat. And it requires close to zero technical skill, so even if I’m simultaneously sending emails and getting lost in a true crime podcast while cooking, it’s still disproportionately good.All of which makes it an excellent meal for when I’m getting home late from work and I really just didn’t have time to think about dinner—not so unlike a giant bag of Doritos, come to think of it.Better than Doritos:Shrimp and Basil Stir-FryThere’s so much more you can do with your farmers’ market basil than making pesto!View RecipeExplore Bon AppétitNever FailShrimpWeeknightStir-FryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-12", "author": ["Condé Nast", "Meryl Rothstein"]}