{"id": "d44769d00e142b783f1f814aa46db9b3", "url": "https://www.bonappetit.com/story/make-it-personal-a-global-chic-kitchen-for-camila-alves", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Make It Personal: A Global-Chic Kitchen for Camila Alves | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredMake It Personal: A Global-Chic Kitchen for Camila AlvesThe native Brazilian loves color and texture—so why not bring it into the most important room in the house?By Samsung Chef CollectionNovember 8, 2018FacebookTwitterEmailConcept and Rendering by Alexa Hampton and the office of Mark Hampton LLCFacebookTwitterEmailFor mom, model, blogger, and entrepreneur Camila Alves, the kitchen is more than a space to cook. It’s a haven for entertaining friends and hosting family, a place to feed her children, and a full-on test kitchen when developing new recipes for her blog, Women of Today.Ashley Burns PhotographyWhile she’s currently got a large island designed for cooking, chopping, prepping, lounging, and laughing, she wants more from her dream kitchen—a personal touch to reflect her global sense of style. Interior designer Alexa Hampton is, thankfully, no stranger to the art of elevated, eclectic design. She teamed up with Michelin three-starred chef Christopher Kostow to design a space that married fashion and function. Using the Samsung Chef Collection, appliances that have been carefully crafted to complement any home, she could outfit Camila’s kitchen in styles that incorporate chef-inspired features for home cooks—and without sacrificing design.Concept and Rendering by Alexa Hampton and the office of Mark Hampton LLC. Explore the appliances used.“The goal was to make it family friendly and fun, but chic, too,” says Hampton, who said Camila was very involved with the design of her kitchen. “She envisioned beams in the ceiling, bright colors and terracotta floors, Moroccan tile, and the stove in the island.”Alexa integrated a variety of materials, including wood, marble, and butcher blocks. As a world traveler, Camila is fond of picking up vintage pieces along the way. Alexa seamlessly folded these pieces into the design for an added personal touch.To satisfy Camila’s color craving, she imagined bright green cabinets to contrast with the earthiness of the terracotta. “Color can be difficult, because there’s a lot going on,” says Alexa, “but kitchens today allow for that sort of creativity. She made certain the space was designed with plenty of natural light and six barstools to accommodate all the hungry onlookers who might keep Camila company in the kitchen.Concept and Rendering by Alexa Hampton and the office of Mark Hampton LLCFurniture aside, Camila had some requests on the appliances, too. For one, she wanted refrigerators with saloon doors. With all the cooking that goes on in her kitchen, Alexa designed the space so that two could be situated next to one another. With the Samsung Chef Collection 4-Door Flex Built-In Refrigerator, Camila can use the FlexZone™ feature, which switches from freezer to refrigerator depending on your needs. Between her children, her family, her blog, and the occasional party, cold, flexible storage is an absolute necessity.Camila’s culinary lifestyle also calls for two wall ovens. The Samsung Chef Collection Double Wall Oven not only lets Camila utilize each oven with its own set of controls, but also uses Samsung technology to make every meal as stress-free as possible. It’s even got Wi-Fi, so she can control her oven from her phone, from anywhere in the house.With smart appliances that help her balance life’s daily culinary demands and a gorgeous layout that marries style and function, Alexa delivers on a dream kitchen that seamlessly integrates the latest innovations with all the space and style Camila dreams of.Explore Bon AppétitSamsungRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-08", "author": ["Condé Nast", "Samsung Chef Collection"]}