{"id": "d44f696f20a41b82a64e77fa59972a36", "url": "https://www.bonappetit.com/story/spooky-short-ribs", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Last Week at BA: Spooooky Recommendations, Short Ribs, and Scrambled Egg Feuds | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLast Week at BA: Spooky Ideas, Short Ribs, and Scrambled Egg FeudsSenior staff writer Alex Beggs makes a case for fall grilling in her weekly newsletter.By Alex BeggsOctober 1, 2018FacebookTwitterEmailFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Scary stories to stream in the darkRestaurant editor Elyse Inamine turned around in her desk and propped her chin on my cubicle wall. “Have you been listening to ‘Dr. Death’???” She asked. NO, I have not! But she knew the real life horror story of a Dallas neurosurgeon’s evil practices was right up my alley. I’ve been reading softened paperback Louise Penny murder mysteries from the library but I will take a break and check it out soon, I promised. This spiraled into a discussion of everything the staff was consuming other than food, and it turns out we’re all in a dark place right now:Associate editor Alex Delany: Watched ALL of Maniac on Netflix in one rainy day.\nAssociate ed Alyse Whitney: Highly recommends This Is Us, Season 3.\nDigital director Carey Polis: Is watching Forever on Amazon.\nAssociate ed Hilary Cadigan: Is reading There, There by Tommy Orange. “It’s devastating but everyone should read it,” is her review.\nHealthyish ed Amanda Shapiro: Is reading Ottessa Moshfegh’s My Year of Rest and Relaxation. “It’s really dark,” she admitted.\nBasically ed Amiel Stanek: Has gotten into ‘Bundyville,’ which is a podcast on exactly what you think. It “gets really weird,” he added.\nFood director Carla Lalli Music: Is rabidly listening to Slate’s podcast, ‘Slow Burn,’ about the impeachment of Bill Clinton, on her commute.Photo by Alex BeggsBut in between all of this culture, we’re still cooking. Last weekend I grilled the cover story from our June/July issue, Andy Baraghani’s short ribs. I got a few packs of Korean-style short ribs from Applestone butcher (where you can buy meat from a vending machine—cool), and was ready for a challenge. I was wrong! The magazine photo looked like a Dutch masters still life, dappled in metaphoric and literal sunlight, so I assumed the recipe was complicated...but it was a cinch! A blender marinade of chile pepper, lemongrass (I didn’t have), garlic, ginger, sesame oil, rice vinegar, brown sugar, and oil, and then the ribs hit the grill for 2-4 minutes. The heat from the jalapeño nearly disappeared after grilling, leaving these juicy, flavorful short ribs that I wanted to eat by the stack, like pancakes. The final step was cutting some daikon radish, the most suggestive shape at the farmers’ market, and tossing it in a little rice vin. And that was hilariously simple too. I’ll definitely make this again—if not just the marinade. It’s fall grilling season, people!Want this letter before it hits the website? Sign up for our newsletter!America runs on brevityThis week, the artist formerly known as Dunkin’ Donuts dropped its last name. The company is now simply Dunkin’. They serve coffee beverages and round wheels of fried dough frosted in sugar, whatever those are. I wondered who this change poses the biggest challenge for, and I’ve landed on the sign guys. Overworked sign guys across the country put the newspaper down and groaned: Nooooooo! Blast it all! Criminy! (They’re British.) The week ahead looks rough. So many signs to remove. And where will all those banished “Donuts” go? I for one will be checking Craigslist.Broccoli makes a comebackThere are some truths we hold to be self-evident based on Instagram statistics: People love pizza, saucy wontons, seared scallops, glossy pasta...and broccoli? This week we posted some amazing new recipes, like creamy spaghetti al limone and crispy glazed brussels sprouts, but this photo of roasted broccoli and hot honey-ricotta toast garnered nearly 600 comments. Remember that New Yorker cartoon about the kid eating broccoli: “I say it’s spinach and to hell with it!”? Apparently people LOVE broccoli now. If that cartoon was redrawn today, what would it be? I think “kale.”User Daniellewachtler tags her friend and lights a match: “Omg we need this @jross1118 hot honeyyy 🔥🔥”Jewelofcana literally makes an entirely different recipe but her heart is in the right place: “I’ve made this exact recipe without the broccoli, with the obvious addition of prosciutto & arugula. Absolutely delicious. GOOD CALL, BA.”I love the way @johey uses the comments as an opportunity to check in with sweet hippo feet (!!) on the grocery situation at home: “@sweet_hippo_feet do we have a good amount of broccoli left? I wanna pick up some ricotta and a baguette to make this tonight!”PICK IT UP, SWEET HIPPO FEET!One person saw it on Instagram, went to the store, and MADE the recipe all within the span of a few hours. This was definitely a record:MeanwhileVia @tinygentleasiansNew friendsIt was Sasha Levine’s first week at Bon Appétit, replacing yours truly as senior editor on BA.com while I move over to write for BA full-time and really apply myself to this newsletter. I asked Sasha how it went: “Everyone is concerned about rebranding my office”—which was previously labeled “The Panic Room,” she told me. “People have brought my various lamps and lightbulbs to help with the lighting.” What did she think of her new coworkers? “Amiel threatened to lick the salt lamp, but other than that, everyone’s been really nice. Too nice.” Awww!UpdateLoup reopened! I love a good resurrection story.Unnecessary food feud of the weekAfter all of the holiday issues, the food team is in January resolution mode, mentally. And this week, Andy has been making six, that’s right, six*, scrambled eggs for breakfast every day. This prompted the debate: Do you salt your scrambled eggs when you whisk them, or after, when they’re on the plate? Andy salts before. “Neither,” whispered Christina Chaey, who has a thing about eggs I’ll never understand. Food editors Anna Stockwell and Kat Boytsova salt after, for some reason. Emma Wartzman salts before and then whisks in some cream cheese after (!!!). But I’ll let egg-obsessed Adam Rapoport have the last word: “A) Chaey is cray. B) I think you gotta salt a little bit while whisking, and then finish with flaky salt when done. It's definitely not enough to just sprinkle with salt after they're plated, because the salt just rests atop the eggs and doesn't infuse them with flavor. I've kvetched about this a zillion times, but nothing worse than unseasoned scrambled eggs. Bland and rubbery and, ultimately, flavorless.”*He’s trying to bulk up. “After the fourth egg, it gets difficult to eat anymore,” he told me while pulling a seeded loaf for Healthyish out of the oven. “His biceps don’t lie,” Carla added.Explore Bon AppétitBeggs NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-01", "author": ["Condé Nast", "Alex Beggs"]}