{"id": "d464b6e91c4b3cc1cb8050e307f9e87a", "url": "https://www.bonappetit.com/story/fast-and-flavorful-vegetable-broth", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "How to Make a Fast and Flavorful Vegetable Broth, No Veg Scraps Required | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make a Fast and Flavorful Vegetable Broth, No Veg Scraps RequiredNooch does it again.By Sarah JampelMarch 18, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Susan Ottaviano.  Prop Stylist by Maeve Sheridan FacebookTwitterEmailI have been in the market for a fast, flavorful vegetable broth for many years. I don’t typically have cartons in the pantry (because I’m a snob) or jars of the homemade stuff in the freezer (because I’m a lazy snob). As a consequence I’m often using water in place of broth (I repeat: lazy), but it’s a substitute that usually doesn’t do the recipe service (apologies to Zaynab Issa’s red lentil soup). What I’ve been searching for then is a broth that won’t take too many minutes on a weeknight but will bring big, deep flavor to my meals.Reader, I found my white whale: a vegan broth that’s ready in less than 30 minutes, with no store-bought cartons, no bouillon concentrate, no scraps simmering for hours. All you really need is nutritional yeast, which dissolves in hot water to lend its savory, nearly chicken-y flavor to the liquid (though a few other ingredients are nice too).I first learned about incorporating nutritional yeast into vegetable broth from cookbook writer Andrea Nguyen, who uses it in her vegan pho. While nooch may seem like an unexpected ingredient in broth, Alicia Kennedy notes on Serious Eats that some manufactured bouillon cubes actually contain nutritional yeast or other yeast extracts. As a source of glutamates (that is, delicious, lip-smacking umami), its inclusion is actually quite logical.Here’s how to make a fast vegetable broth:Sauté alliums (onions, leeks, scallions, garlic) and aromatics (chiles, herbs like rosemary and thyme, lemongrass, ginger), then add nutritional yeast and water, and simmer, partially covered, until flavorful—start checking around 10–15 minutes. I like to add yellow miso to the mix too for another layer of richness, salinity, and body. You can double down on the miso or skip it entirely (knowing you’ll have to add more or less salt depending). In terms of how much nutritional yeast to use, I found that ¼ cup nooch to 6 cups water is a nice ratio, but you can obviously adjust to your own taste, or add more vegetables—like carrots and celery—when you cook down the alliums.This broth is the foundation of Chickpea Noodle Soup—add some chickpeas as it simmers, dunk in some broccolini at the very end, serve over noodles—but it’s great anywhere a vegetable (or even chicken!) broth would be welcome, like in soup (chicken noodle, leek and potato, chickpea and celery), risotto, or even stuffing. With my next batch I’m going to try that red lentil soup again to see what my first round was missing. (And after that? Matzo balls!)Get the recipeChickpea Noodle SoupThere’s triple the chickpea in this quick and comforting soup: The broth is flavored with chickpea miso, and the mix of soft and crispy chickpeas makes for a delightful mix of textures.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-18", "author": ["Condé Nast", "Sarah Jampel"]}