{"id": "d481dc8fb71267355bbf5052344496fe", "url": "https://www.bonappetit.com/story/how-to-make-stuffing", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "How to Make the Ultimate Crispy-Chewy Stuffing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make the Ultimate Crispy-Chewy StuffingOr, how to make stuffing that aligns with your, ahem, personal brand.By Claire Saffitz, Sarah Jampel, and Antara SinhaNovember 2, 2021FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailHomemade stuffing is the dish that puts any old dinner party firmly in holiday territory. You can eat pie, cornbread, and green beans any time of the year, but stuffing, in all of its indulgent glory is the true signifier of the season. (Though if your family eats stuffing on any given April weeknight, we salute you.)Below, we’ll outline how to make stuffing that’s entirely customizable and especially memorable. That means you can make stuffing that matches whatever meal you’re making—whether it’s a low-key holiday with just a couple of friends or an all-out black-tie affair. After all, once you learn the fundamentals, your ideal stuffing is just a loaf of bread—plus some aromatics, maybe a little sausage, and a textural add-in or two—away. (BTW, these instructions are for bread stuffing that’s baked outside the bird. Rice dressing loyalists, look away.)How to make stuffing:Heat the oven to 350°. Butter a shallow 3-qt. baking dish—a 13x9\" is perfectly proportioned for crispy edges and custardy middles, but almost any casserole dish will do—and butter a sheet of foil. This amount of stuffing will serve about 8 people (6 if your crew is really hungry; 10 if you’re working on all of those other side dishes).The breadOnce you’ve got your set up, the first (and arguably most important) step is to choose the kind of bread. Think of the bread as your stuffing’s backdrop—it’s going to set the tone of the whole dish. If you want a blank canvas (maybe you’re planning to add a ton of mix-ins that needn’t be overshadowed), choose a Pullman loaf. For something richer that will yield a stuffing more akin to bread pudding, go with eggy challah or brioche. Ciabatta, with its airy innards and crusty exterior, is particularly suited to tearing into craggy pieces and another good plain candidate. Baguettes, because they’re so thin, maximize crustiness; on the opposite end of the spectrum, white sandwich bread leans into soft squishiness. If you choose rye or sourdough, keep their inherently strong flavors in mind as you choose what else to add. Cornbread, whether lightly sweet or totally savory, lends a softer, more crumbly texture. Alex LauBefore you get to mixing, you’ll need to dry out that bread. Put simply: Bread is like a sponge. The drier the bread, the greater its capacity to absorb flavorful stock. You can dehydrate the bread by tearing it into pieces and leaving it out to stale (overnight, or as long as several days, depending on how moist it was to begin with), or you can use the oven as a shortcut. Cut or rip your bread of choice, then bake it in a low-temperature oven (250–300°) until it’s quite dry but not brown, somewhere between 30 minutes to 1 hour depending on type of bread and oven temperature. This is especially critical if you’re using cornbread, which will otherwise turn to mush.The add-insTransfer your dried bread cubes to a large bowl along with any add-ins that don’t need to be cooked on their own first. These ingredients add textural contrasts and bold flavor and afford you the opportunity to get creative. Consider nuts and seeds (toasted pecans, hazelnuts, pistachios, pepitas), dried fruit (like cranberries, tart cherries, or dates), fresh herbs (cilantro, parsley, tarragon, dill), sliced fresh Fresno chiles, sliced sun-dried tomatoes or Calabrian chiles, roasted vegetables like squash or brussels sprouts, fresh or smoked oysters, or even grated cheese.Alex LauThe meatNext up, tackle your meaty protein. For crispy bites of browned meat, you’ll want to sear the meat on the stovetop before taking advantage of the fat it yields. For one batch of stuffing, aim for 8–12 oz. meat—think hot or sweet Italian sausage, fresh chorizo, Chinese sausage, breakfast sausage, salami, bacon, kielbasa, or pancetta.Heat a few tablespoons olive oil in a large skillet over medium, then cook the meat (either slice it first or break it into small pieces with a spoon or spatula), until browned and cooked through, 7–10 minutes. Using a slotted spoon, transfer to bowl with bread mixture, leaving the fat behind. For a vegetarian stuffing, simply skip the meat—if you’d like, brown umami-rich mushrooms, which will act as a savory backbone, and add a little extra fat in the form of oil or butter as you toss the bread.Alex LauThe aromaticsNext up, you’ll harness that flavorful fat to soften your aromatics. We consider 2 yellow onions and 4 stalks celery, all finely chopped, to be the nonnegotiables. Additional ingredients—like thinly sliced leeks, red onion, scallions, chives, or shallots; chopped ginger and garlic; fresh rosemary, fresh thyme, or fresh sage; strips of hardy greens like kale or Swiss chard; finely chopped fennel—are bonuses. Whatever you choose, season the aromatics with kosher salt and freshly ground black pepper (as well as any additional seasonings, like crushed red pepper flakes, ground cumin, smoked paprika, or dried herbs) and cook over medium heat, stirring often, until onions are softened and browned around the edges, 10–12 minutes. Scrape aromatics into bowl with bread mixture.Alex LauReturn skillet to medium heat and pour in deglazing liquid, which works to dislodge any browned bits—a.k.a. flavor bombs—stuck to the bottom of the skillet and brings much-needed brightness. Add about ½ cup of dry sherry, vinegar (like apple cider, sherry, or red wine), or dry white wine and cook, scraping the bottom of the skillet, until all of the liquid has evaporated. Next, add 1 stick butter, cut into pieces, and cook, stirring, until butter has melted. Drizzle over bread mixture. Alex LauNext up, whisk 2 large eggs with 2 cups stock. This could be turkey stock, low-sodium chicken broth, or vegetable broth—whatever you pick, taste it first and make sure it’s seasoned to your liking. Often, the reason for bland stuffing is bland stock. The butter, eggs, and stock add the moisture and protein that binds the bread, transforming what would otherwise be glorified, disparate croutons into luxurious stuffing with a rich, custardy interior and a crunchy top and bottom. Replace a portion of the stock with half-and-half for an even richer final product. Add the egg mixture to the bread, season with salt and pepper, and toss until combined, adding more stock ¼-cupful at a time as needed to ensure bread is fully hydrated.Alex LauTransfer stuffing to your prepared baking dish and dot with 4 Tbsp. unsalted butter, cut into small pieces (this additional butter is crispy crust insurance!). Cover with foil, buttered side down, crimping edges to seal. Bake until a paring knife inserted into the center comes out hot, 30–35 minutes. Remove foil and increase oven temperature to 450°. Bake until top is well browned (take it one step past golden brown for maximum flavor and crustiness), 20–25 minutes. Let sit 10 minutes before serving.That’s it! You have a stuffing to call your own. The only problem with a recipe that’s so open to customization? The next time holiday season rolls around, you might not remember what worked well. Jot down any flavor combinations you loved—a celery-heavy stuffing with rye bread and kielbasa? a brown butter ciabatta stuffing with leeks, shiitakes, and rosemary?—so that you can re-create it next year. If not, just rejoice in tomorrow’s leftovers, knowing that there are an infinite number of delicious stuffing possibilities in your future. Explore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-02", "author": ["Condé Nast", "Claire Saffitz", "Sarah Jampel", "Antara Sinha"]}