{"id": "d498e28fb7e1f4dea8d1f1f5b13e9539", "url": "https://www.bonappetit.com/story/instant-pot-nonstick-cooking-pot", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "The Instant Pot Nonstick Cooking Pot Is Finally Back In Stock | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Instant Pot Nonstick Cooking Pot Is Finally Back In StockAnd it makes it a much better rice cooker.By Elaheh NozariJanuary 12, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIf 2017 was the year you got an Instant Pot and became an evangelist of its slow-and-pressure-cooking ways, 2018 is the year to trick it out. I'm assuming you already knew this because one of its most popular accessories, the coated non-stick inner pot, is currently sold out (in 5 and 6 quart) on Instant Pot's official website, and was out of stock on Amazon until this week. But it's back, baby...at least on Amazon. Jeff Bezos is the richest man in history because he knows what the Instant Pot community wants.The standard Instant Pot comes with a stainless steel cooking pan, which is great for making all the shredded chicken, pork, and beef your winter body desires, but what about when you want to tap into the pot's other functions, like cooking rice? You could use the stainless steel pot, but you know what makes rice cookers so failproof and convenient? Non-stick pots. This one is Teflon-free and can go in the dishwasher (top rack!). Just know that it's not 100% ceramic, but a ceramic-coating on an aluminum pot.Amazon reviewers mention making quiche with it, yogurt, pasta, and other starchy dishes. Because the Instant Pot's heat comes from the center of the appliance, it can create a scalding hotspot in the middle when you're using it to sauté or brown meat, so the nonstick option adds another layer that keeps the hotspot from, well, getting too hot. Super-users also like having the second pot for cooking multiple dishes in a row—while one cools, you can simply take it out and put in the second pot. Use one pot to make shredded chicken, the other to make rice, and what's that but chicken and rice for dinner?!Buy it: Instant Pot Ceramic Non-Stick Inner Pot, $20 for a 6-quart pot on AmazonExplore Bon AppétitShoppingInstant PotTrendsRead MorecultureHow to Clean Your Smelly Instant Pot Sealing RingBy Alex BeggscultureThe Instant Pot’s Master Plan to Invade All of Our KitchensBy Alex BeggscultureThe Instant Pot Will Change Your Life—No JokeBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-12", "author": ["Condé Nast", "Elaheh Nozari"]}