{"id": "d4a0ecda31830fc6311a6b7f5b27099e", "url": "https://www.bonappetit.com/story/tear-your-food", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Tearing Up Food By Hand, Rather Than Slicing, Creates Cool Shapes and Textures | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPut Down Your Knife and Tear Up Your Food By Hand Why we're always asking you to rip your sweet potatoes, mushrooms, and cucumbers. By Jesse SparksNovember 14, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailSome things are simply overrated. Think fidget spinners, motorized hover-boards, and pretty much the entire last season of Game of Thrones. Oh, and intricate knife skills.Lucky for me, senior food editor Molly Baz is on the same page. More often than you’d expect, she skips the knife work and handles food (warm or room temp, obviously) by hand. For the uninitiated, tearing up food can sound counterintuitive at best and downright barbaric at worst, but Molly makes a pretty convincing argument.First, it’s a matter of practicality. “Breaking out my knives just makes for more dirty dishes that I’ll have to clean later,” she told me. Those fancy knife skills you’ve studied while binge-watching fifteen episodes of Chopped aren’t actually going to come in handy right now—sorry!Second, ripping your food into good-sized chunks is an easy way to make a straightforward dinner feel like a showstopper. “I tear because I like the irregular edges and the silhouette they create on the plate,” she says. The natural, organic shapes of torn food will garner ooohs and aaahs when you present, say, a platter of beautifully roasted sweet potatoes, radicchio adorned with torn boiled eggs, a spicy cucumber salad, or a citrus garnish with randomly-sized gems of juicy fruit.But tearing is not just for cooked food or produce you’ll be eating raw. Tearing certain ingredients will subtly change the way they cook: Unlike slicing, which results in straight, neat edges, pulling with your hands makes for a greater amount of uneven, textured surface area, conducive to craggy, crispy, charred edges. Next time you’re making croutons or sautéed mushrooms, put away your knife and use your hands instead.Okay, I won’t go so far as to say that knives are overrated (I’m not maniacal), but I will say that I’ll be using my chef knife a little less in 2020. And honestly, my fingers have never felt safer.Get the recipe:Sweet Potatoes With Charred Lemons and CrunchiesWith custardy insides and charred exteriors, these sweet potatoes are everything you always wish roasted sweet potatoes could be. A crunchy mixture of toasted nuts and seeds provides pops of texture and spice, and a cooling lemony yogurt sauce cuts through the richness. View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-14", "author": ["Condé Nast", "Jesse Sparks"]}