{"id": "d4bbc3587f6b06a14688729140fe88da", "url": "https://www.bonappetit.com/recipe/butternut-squash-parmesan", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Butternut Squash Parmesan Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesButternut Squash ParmesanBy Lauren SchaeferFebruary 13, 20194.7(47)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis hearty winter squash recipe is a twist on traditional eggplant Parmesan with fewer steps (there’s no need to wait around for the squash pieces to dry, plus you don’t have to fry them!) but no less satisfaction.Ingredients4 servings6Tbsp. extra-virgin olive oil, divided3oil-packed anchovies, finely chopped3garlic cloves, finely grated1tsp. crushed red pepper flakes128-oz. can whole peeled tomatoes1small butternut squash (about 2½ lb.)2tsp. kosher salt, divided, plus more8oz. fresh mozzarella, shredded2oz. finely grated Parmesan (about ¾ cup)¼cup whole-milk Greek yogurtFreshly ground black pepper¾cup panko (Japanese breadcrumbs)3sprigs basilPreparationStep 1Preheat oven to 425°. Heat 1 Tbsp. oil in a medium saucepan over medium. Cook anchovies, garlic, and red pepper flakes, stirring often with a wooden spoon, until sizzling, 30–60 seconds. Add tomatoes and gently break apart with spoon. Reduce heat to low and bring sauce to a low simmer. Cook, stirring occasionally, until sauce is slightly thickened and flavors have melded, about 15 minutes.Step 2Meanwhile, cut off neck from squash. Peel neck and bulb until you reveal the orange flesh underneath (you might need to take off a few layers). Stand bulb upright on cut end. Starting on one side, slice top to bottom into ¼\"-thick planks until you reach the core (you don’t want holes or seeds in your squash). Rotate squash and repeat until you’ve worked all the way around the bulb. Slice neck in half lengthwise, then cut crosswise into ¼\"-thick pieces. Transfer squash to a large bowl. Add 2 Tbsp. oil and 1½ tsp. salt and toss to coat.Step 3Mix mozzarella, Parmesan, and yogurt in a small bowl; season with salt and black pepper.Step 4Using an immersion blender directly in pot or transferring tomato sauce to a food processor, purée until mostly smooth. Taste and season with salt and black pepper.Step 5Drizzle 1 Tbsp. oil in an 8x8\" glass or metal baking dish. Spread with ½ cup sauce. Arrange 5–6 squash pieces in a mostly even layer over sauce (it’s okay if some pieces overlap). Sprinkle with ½ cup cheese mixture, then spread with ½ cup sauce. Layer again with squash, followed by ½ cup cheese mixture and ½ cup sauce. Repeat with a final layer of squash and remaining cheese mixture and sauce.Step 6Cover pan with foil and bake 50 minutes. Uncover and continue to bake until cheese is browned and sauce is bubbling, 15–20 minutes.Step 7Meanwhile, toss panko and remaining 2 Tbsp. oil and ½ tsp. salt in a small bowl with your hands until well coated.Step 8Top squash Parmesan with breadcrumb mixture and continue to bake until golden brown, about 10 minutes (don't worry if things look liquidy; the breadcrumbs and squash will soak them up as everything rests). Tear basil leaves over. Let cool 10 minutes before serving.Step 9Do Ahead: Sauce can be made 3 days ahead. Cover and chill. Unbaked squash Parmesan (without panko) can be assembled 8 hours ahead. Cover and chill.How would you rate Butternut Squash Parmesan?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleI think this is now my favorite way to use butternut squash. The sauce can also be made with fresh Roma tomatoes (I used 8 yesterday). I tend to add Italian herbs to the sauce. Suggest putting a pan under the 8X8 dish as it may well overflow! Really delicious and enjoyed even by hard-core non-vegetarians. Jan FOklahoma City, OK12/29/2021Probably my favorite new recipe. This will be showing up on my table for years to come. Whole ingredients cooked the way they should be, creating a simple flavor packed dish. The flavor of delicious cooked tomatoes and fresh cheeses deeply penetrates the squash so every bite tastes phenomenal. We ate ours with honey lemon salmon but I would eat it on its own any day! I highly recommend!Hawg goblinAltoona Pennsylvania12/23/2021better than traditional lasagna!!! make sure to cook squash through:)CTDarien, CT12/22/2021Definitely a keeper- I halved the sauce because I thought I was using half the butternut squash, but I think I could have used more. It didn't fill the whole dish (same with my reduced cheese) but I was pleased to see the liquid really stepped up during cooking-- turned out great.KVLos Angeles11/26/2021I find the instruction regarding slicing the pumpkin confusuing. Does it end up with 1/4 inch cubes?\nPeterBentleigh, Vic 32044/6/2021I prepared this recipe tonight.  I followed the recipe as is, the only change I made was that I used regular breadcrumbs instead of panko.  The dish was perfect and delicious.  A new one for my repertoire!  Thanks!!María Tempe,AZ1/15/2021This recipe is a vegetarian converter.  Reminds me of a Puttanesca sauce so double the anchovies and add the olives along with a few capers.   Thinking about making squash spaghetti for it.  This one will go in \"The Book\".  Rocketbob1/14/2021Love this recipe! It’s a fall favorite in our house. I let the sauce simmer a bit longer than 15 minutes and use a bigger pan to avoid a support lasagna. LianaProvidence, RI11/30/2020This is a great recipe! Lovely depth of flavor and super satisfying. I didn't think it necessary to blend the tomato sauce, and I'd save the trouble of the extra washing up. Otherwise no changes to the method or ingredients, turned out perfect. AntoniaIthaca, New York11/11/2020This is one of the best new recipes I've made! Very cheesy and satisfying... will be making it for friends soon!AnonymousBOSTON, MA10/28/2020Easily five stars! Better than any eggplant parmesan I've ever had. I was skeptical about the anchovies at first, but this dish turned out so perfect that I will likely start adding anchovies to all my tomato sauces! I will definitely be making this again come autumn, when all the farm stands are exploding with butternut squash. I suggest you do the same. AnonymousNew York7/21/2020Really nice dish, made it once to the letter and second time I added a smokey chorizo and black olives. The chorizo definitely added  lot more punch to the sauce. No need to blend tomato sauce, delicious meal thanks!BigcorkyGlasgow4/7/2020I left the sauce chunky bc that’s what I prefer. Mine was still “soupy” even with the panko, but it was delicious. I added more seasoning to the sauce than called for & a dollop of tomato paste bc I had it in the fridge & needed to use it up ;-)Oakton, VA 4/7/2020The best vegetarian meal I’ve made so far! You don’t even miss the pasta and the sauce is amazinggg! we need more vegetarian recipes like this from bon appetite! jstiefel117Orange County 2/28/2020I dream about this dish. Completely worth the slightly finicky prep (i.e. probably not something to whip up on a weeknight without a little planning in advance). I likely made life a little bit harder on myself by choosing to thinly slice the neck of the squash with a mandolin (the end result turned out more like a butternut squash lasagna than squash parmesan, but I'm not mad about that). Each individual component was easy enough (the spicy, umami-y tomato sauce is the real star IMHO). The panko is key: no big soupy mess here...the panko soaked up the liquid beautifully during the 10 min resting period. \n\n1000% would make again. AnonymousSacramento, CA12/8/2019Explore Bon AppétitCanned TomatoTomatoVegetableMozzarellaCheeseButternut SquashSquashMainNut-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-13", "author": ["Condé Nast", "Lauren Schaefer"]}