{"id": "d4d0320549bd4df64d99ab7ee114039d", "url": "https://www.bonappetit.com/story/buy-glass-meal-prep-containers", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "These Meal Prep Containers Will Motivate You to Bring Lunch | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Meal Prep Containers Will Motivate You to Bring LunchThe ultimate answer to all your storing, toting-to-work, and reheating needs.By Alyse WhitneyJanuary 10, 2018FacebookTwitterEmailFacebookTwitterEmailYou know the old saying about dressing for the job you want, not the one you have? Well, using glass meal prep containers is like dressing for the job you want: it makes you look (and feel) more put together than you actually are. While I'm a big proponent for using disposable takeout containers for leftovers, they're far from perfect. You can't always microwave them—especially with the lid on, which can warp and fuse to the base so it's hard to open without burning yourself with steam. They're not made from the most dishwasher safe material. And they tend to crack after a number of uses. So when I'm really trying to motivate myself to meal prep, I use Anchor Hocking's round glass storage containers with colorful lids.The reasons to love glass food storage containers are the same reasons why your mom loves her Pyrex glass dishes: They're durable and safe in the microwave, dishwasher, or oven. My flight attendant roommate uses these (without the lid, of course) in the oven on airplanes to heat up her food, and I've gone from the fridge to my Breville SmartOven (a fancy convection toaster oven that I use constantly) to reheat things like lasagna or chicken thighs that I want to get crispy on top. It works equally well in a microwave to heat up leftover lentil soup and to tote chilled overnight oats to work.Take this zucchini-eggplant bake from the fridge straight to the oven in a glass storage container.\nStill need more convincing? They're easy to clean, stack perfectly in the fridge, and can be easily labeled with masking tape to know what's inside and when it was made. I've dropped one before and it doesn't shatter and spill food all over the floor like plastic containers can do, and they are nearly impossible to stain. (I'm looking at you, tomato soup leftovers!) Buy this cheap kitchen upgrade and (maybe) convince yourself to pack your lunch more than once a week. It's more impactful on your lifestyle than buying a blazer.Buy it: Anchor Hocking Glass Storage Containers, $15.43 for a set of four on JetTomato soup wont stain these containers:Creamy Tomato Soup with Cheese ToastiesDIY kid food is the best food, if you ask us.View RecipeExplore Bon AppétitMeal PrepBasicallyShoppingBA RecommendsRead Morecooking5 Meal Prep Resolutions I'll Definitely, Maybe Follow in 2018By Alyse WhitneycookingHow to Make a Week's Worth of Amazing Lunches in 2 HoursBy Chris Moroccocooking5 Meal Prep Upgrades So You Can Have Healthier Lunches All WeekBy Alyse WhitneycookingMeal Prep Ideas to Save Time, Money, and Your SanityBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-10", "author": ["Condé Nast", "Alyse Whitney"]}