{"id": "d4e1ec819db923560aad2cfb7556b0fc", "url": "https://www.bonappetit.com/story/pregnancy-eating", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "I Thought Pregnancy Eating Was All About Pints of Ice Cream. I Was Wrong. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Thought Pregnancy Eating Was All About Pints of Ice Cream. I Was Wrong.As the reality set in that I was sharing my body, I began to fret over my nutrition in a way I never had before.By Meryl RothsteinJanuary 14, 2019FacebookTwitterEmailIllustration by Bárbara MalagoliFacebookTwitterEmailI pictured myself in the kitchen, skin glowing, baking a cake for no reason other than that I wanted to eat a cake. I figured I’d have ice cream by the pintful. When the waiter asked if I wanted dessert, I was going to say yes every damn time. I imagined my pregnancy as nine months of socially sanctioned overeating, the one time in a woman’s life when no one judges her for ordering grilled cheese and fries and a milkshake by herself at the diner.This is gonna be fun, I thought.It wasn’t.First, there were the dietary restrictions, the fine print on my new indulgence contract. Depending on who you ask, pregnant women are supposed to avoid alcohol, unpasteurized soft cheese, raw fish, raw meat, rare meat, raw eggs, runny eggs, deli meats, tuna, swordfish, tilefish, King mackerel, lox, sprouts, too much caffeine, unpasteurized milk, and unwashed produce. My doctor’s list differed slightly from my friends’ doctors’ lists, which differed slightly from lists I found online. How was I supposed to know which list was the right list, the one standing between me and preventable miscarriage or birth defects? And what technically counts as a deli meat anyway? Meals, particularly meals out, suddenly felt like culinary minefields. There’s nothing joyful about standing at a holiday party googling, “can pregnant women eat pâté?\"I decided to take a laid-back approach. I knew so many women who enjoyed a nightly glass of wine! I read modern-day pregnancy bible Expecting Better, which uses science to persuasively argue that many of the restrictions are unfounded! But then I remembered something: I’m not laid back. On a vacation to Italy, I ate prosciutto—when in Rome, literally—then spent the next two hours wondering what it said about me as a mother that I decided the joys of Italian cured meats outweighed the elevated risk of fetal listeria.So I did my best to follow the rules, but found that had a downside of its own: I felt uptight and uncool among women whose doctors gave them the green light on sushi or who downed espressos throughout their pregnancies. Avoiding unpasteurized cheese in some people’s company makes you feel like the one kid at the middle school party who refused to take a drag of that cigarette.For all the talk of “eating for two,” it’s not actually a thing. Yes, you’re supposed to eat more calories, but only a few hundred per day—think a bowl of ice cream, not the pint. And those calories are supposed to come from foods like almonds and avocados, not, you know, Cheetos. Plus, during my first trimester, I barely wanted to eat, period—I didn’t experience food cravings so much as food aversions. Instead of looking forward to meals (my typical motivation for getting out of bed each morning is the opportunity to eat breakfast), they became obligations.As the reality set in that I was sharing my body, and everything I put in it, with my baby, I began to fret over my nutrition in a way I never had before. Eventually I’d have lots of people to help me raise my baby—my husband, for example, would presumably pitch in—but for now, I was on my own. Only I could promote cognitive development with omega-3s or bone formation with calcium. It was an immense responsibility.Meal planning, once a source of pleasure (what do I want to eat this week?!), now felt loaded. I made sure seafood was on the menu at least three times a week in search of those vaunted omega-3s. I snuck spinach into larbs and ate salads like it was my job—which I kind of felt like it was.I was hungry pretty much all the time, so I began packing healthy snacks with a fervor. I brought containers of carrot sticks and broccoli to work no matter how many times my boss made fun of me for eating the after-school snack of a fourth grader. I was like that guy who pats down his coat every morning to make sure he has his keys and wallet, except I was checking for an apple and a hard-boiled egg.I loved these healthy habits, but I hated having to think about food so much.Then came my gestational diabetes test.An estimated two to ten percent of women get gestational diabetes—basically, diabetes for the duration of your pregnancy. I was diagnosed with gestational glucose intolerance, which is not nearly as serious as diabetes, but it meant my body wasn’t processing glucose as well as it should. My doctor encouraged moderation in carbs but told me not to beat myself up over my food choices.At first, I used a simple system: If something was truly delicious, I’d give myself the green light to go for it and not feel stress if it was high in carbs. My doctor encouraged moderation, not abstinence. But if I was eating it just because it was there and I was kind of hungry, I wanted to learn how to pass on that, something I imagine everyone with more self-discipline than me already does. This system worked for me for maybe a week, until I realized that I was setting myself up to agonize over every carb that passed in front of me. And when you work at a place like Bon Appétit, where people casually swing by your office to ask if you want some croquembouche, that was a lot of agonizing.So I switched to cheat days, no matter how much that idea—and that phrase!—made me cringe. I’d give myself permission to eat sweets a few days a week, which I’d typically plan for when I knew there’d be something good—a tasting in the test kitchen for a cake story, say, or a vacation to Austin. This drastically cut down on the number of 4 p.m. squares of chocolates, or the times I’d wander over to the office snack table “just to look.”I got into a routine. I was eating more healthfully than I probably ever had in my life. I felt like I had finally cracked the code on my sweet tooth, that the world had given me permission to eat junk and I had decided I was into carrot sticks. I was sure that I’d keep these habits after my pregnancy.Of course that didn’t happen either. In the first weeks after I gave birth, I was ravenous (a consequence of breastfeeding, which burns calories like crazy), and I didn’t have the energy to think about what I was eating. I roamed around my kitchen shoving—literally shoving—into my mouth anything I could eat with one hand while bouncing a newborn with the other. If I overthought food when I was pregnant, this moment was its opposite. And with it came the realization that, thanks to the caloric churn of breastfeeding, I could eat whatever I wanted and lose weight.This was my Ben & Jerry’s fantasy. Finally.Months later, I’m still breastfeeding, though I’m no longer shoving Mallomars into my face (for the most part). I’ve gained back time in the kitchen and the wherewithal to peel carrots, and my diet is more closely approaching normal. One major difference between my life before pregnancy and now—aside, of course, from having a wonderful baby—is that I eat dessert with abandon. And, probably for the first time in my adult life, I don’t feel bad about it. After months of thinking so hard about what I was eating, it feels nice not to worry. I am eating for one once again, and at this moment, I feel like I’m doing right by her.Explore Bon AppétitHealthyHealthyishCooking For KidsessayRead MoreLifestyleFor Santigold, Climbing Kilimanjaro Was Easier Than Having KidsBy Caitlin BrodyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-14", "author": ["Condé Nast", "Meryl Rothstein"]}