{"id": "d4eb5d9f8e8c3021c2d63706f4ac237f", "url": "https://www.bonappetit.com/story/fault-lines-itami", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "In ‘Fault Lines,’ a Japanese Housewife Falls for an Objectively Hot Restaurateur | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIn ‘Fault Lines,’ a Japanese Housewife Falls for an Objectively Hot RestaurateurEmily Itami’s debut novel is sexy, laugh-out-loud funny, and full of prose as sumptuous as the yakitori, onigiri, and bento described.By Ali FrancisSeptember 17, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I was lucky enough to spend three days in Tokyo last week, and it was magnificent. I explored the cobbled streets of Kagurazaka, sampled bites of crispy, croquette-like beef and potato korokke during Obon, and watched cherry blossoms suddenly bathe the city in pink as if a switch had been flicked. While Japan remains closed to non-nationals, you can travel there like I did: via Fault Lines, author Emily Itami’s sharp-witted debut novel about a frustrated Japanese mother who seeks adventure in the arms of an objectively hot, kind, and fun restaurateur.Fault Lines: A Novel$28 $22 at Amazon$28 $26 at Bookshop.orgMizuki, mother of two and wife to the hardworking and emotionally remote Tatsuya, has a lot going for her—financial security, a pretty apartment, and cute kids. But days filled with laundry and lunches and a marriage devoid of romance leave her deeply depressed. “My children,” she reflects. “My life’s work, my greatest loves, orchestrators of total psychological trauma and everyday destruction.”Then she meets the suave, funny, and open-minded restaurateur Kiyoshi, and together they explore the city on a series of delicious dates, focusing “on the hedonistic pleasures of the moment.” Wandering the labyrinthian night market in Ebisu and snacking on yakitori, Mizuki begins to feel like a past version of herself: the confident, beautiful, and happy young woman who’d moved from rural Japan to New York City to make it as a singer. Though you might feel complicated about her having an affair, you can’t help rooting for her. Finally, a literal earthquake forces Mizuki to acknowledge the fault lines running beneath her world. She’s living two lives, and in the end she can only choose one.Sexy, laugh-out-loud funny, and full of prose as sumptuous as the meals described, Fault Lines is a must read for anyone fond of Sally Rooney’s expert characterization and Haruki Murakami’s immersive world-building. Though, be warned: In between chapters I spent a lot of time staring at my reflection in the mirror, wondering, Who the heck am I, and how did I get here? Because, parent or not, this book is going to send you into a minor existential crisis about the paths taken, and those decidedly not. Recently, I called up Itami to chat about the inspiration behind Fault Lines, her favorite writing snacks, and what it’s like to live between two cultures.What inspired you to write this book?At the time that I started thinking about the book, I had just had my own kids and I was living in Japan. And [I experienced how quickly] you go from being an independent, fully fledged human to being seen only in terms of your role relating to other people. That’s exacerbated in a society that is so traditional. Japan, especially Tokyo, is really forward-looking [in a lot of ways], but it's actually very old-fashioned [socially]; there are still clear gender roles. The upside is that mothers are very respected. But sometimes I think that they can end up feeling trapped in those positions.Kiyoshi, Mizuki’s love interest, is an entrepreneurial restaurateur, which is a stark juxtaposition with her husband, Tatsuya, who works in a big corporation. Why did you choose that career path for him and how did you go about researching the character?I was thinking of a very dreamy guy. I was like, “He's going to be really glamorous, and he's going to be really good at cooking.” The degree of hard work [it takes to run a food business] always fascinated me. I felt like that tied in with the [intense] work culture in Japan, too, but it was different because Kiyoshi was working maniacally for himself. And I felt like that was something that Mizuki would be attracted to at that moment in her life.After growing up in Japan and then London, I went back to Tokyo for a while when I was 18. During that time I was working in a [donburi restaurant]. It was a local neighborhood place for the salarymen in the area to come for lunch, so it had this mad rush. It was really good fun. And later, while I worked as a freelance journalist, I interviewed a lot of chefs and people who ran restaurants. I guess I took bits from all of them.From Mizuki preparing bento for her kids to a fancy business dinner at one of Kiyoshi’s restaurants, food scenes are peppered throughout the book. Why was that such a big part of the narrative?I felt like it would be [impossible] to write about Japan without mentioning food. Because food is really... It's everything. It's how everything is communicated. People aren’t [typically] very demonstrative. My grandmother would never, ever say anything emotional to us, but she would cook for us every single minute that we were with her. [She’d make] all these crazy-difficult things, and that's how she showed love.You wrote this book after you’d moved back to London, right? Were there any foods you turned to while writing?Yes! Instead of coffee and biscuits, I would always drink green tea, because my grandma is a matcha teacher, with dorayaki. And I ate rice all the time.Mizuki lived in the U.S. and Japan and you've lived in Japan and England. I'm curious if you personally relate to her journey?I think that her sense of feeling in and out of her own culture is my life experience. I didn’t necessarily realize that was what I was experiencing because it was just my life. And then, as I got older, I kind of came to see that it's a really privileged position to be able to be inside and outside at the same time. But it's also difficult, because, especially in a country like Japan that's quite homogenous, you know that you'll never really be fully accepted.For someone who's just getting into this book and wants to eat and read at the same time, what’s the perfect food pairing?I think yaki onigiri would be good because they're warm and filling and you’d be able to hold them in one hand. Or you might want to have some Japanese bakery food: curry or melon bread, freshly baked so it's crispy on the outside. And then you need a cold drink, like something you’d get from a Japanese vending machine.Are there any food-ish books out there that continue to inspire you?My dad gave me Tender at the Bone by Ruth Reichl when I was 13. I'd never heard of her and now I read her books all the time. They're so warm and vivid and they just make you feel better every time.Tender at the Bone: Growing Up at the Table$18 $16 at AmazonAnother book I love is Strange Weather in Tokyo by Hiromi Kawakami and translated [by Allison Markin Powell]. It’s a love story where the couple keep meeting in the same neighborhood bar, not on purpose. They keep sitting next to each other at the counter to eat all this homestyle food, and that's the way their relationship develops. It's so lovely and brilliant.Strange Weather in Tokyo: A Novel$17 $15 at AmazonDid writing this novel make you feel more connected to a place you’ve left?Yeah. I think Fault Lines was definitely a way to write myself back to [Japan]. You know that physical sensation that happens when you read something about a place [you love]? I guess I wanted to create a world where I was curating that feeling and filling in all the details the way that I wanted it to be.Read Itami's Novel:Fault Lines: A Novel$28 $22 at Amazon$28 $26 at Bookshop.orgExplore Bon AppétitBooksCultureShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-17", "author": ["Condé Nast", "Ali Francis"]}