{"id": "d4f4c0f8f0bc3d9bbc938a59680c48cd", "url": "https://www.bonappetit.com/story/brunchcon-review", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "I Went to BrunchCon, a Convention for People Who Love Brunch | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Went to BrunchCon, a Convention for People Who Love BrunchI drank the mimosas, I ate the tiny bites, and met a lot of superfans of brunch.By Kelly ConaboyMay 22, 2018FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailA positive thing you can say about BrunchCon is it is isolated. Unlike SantaCon, a similar alcohol-soaked New York City con, it doesn’t spread its trouble across city blocks, or interrupt your commute with its revelry. It doesn’t terrorize your local bartender, or vomit on your sidewalk. BrunchCon, a multi-city event dedicated—like brunch—to small bites of food and large quantities of alcohol, is stationary; quarantined, this year, in Brooklyn’s EXPO center.Brunch, a critically maligned but publicly beloved weekend meal, has enjoyed a bit of positive press lately. Sadie Stein wrote in a piece for the New Yorker (titled “Are We Done Hating Brunch?”) that there are delights to be found, yet, in the languid mid-day feast. Grub Street asserted, in the introduction to a list of restaurants with abnormally exciting brunch offerings, that we are likely living in New York’s golden age of brunch. Could glowing reviews of BrunchCon be the third that makes the trend? I was dubious that BrunchCon would lead to such assessments, but I was ready to find out.They love brunch!\nPhoto by Laura MurrayUnlike what you may have pictured, BrunchCon is not an event where people dress up as their favorite brunch characters and line up for panel discussions. (The convention’s loud, pulsating party music prevents much excess communication.) It is, instead, brunch stretched and pushed to its extremes. Rather than a bottomless mimosa deal controlled by the accessibility of your waiter and the inaccessibility of your shame, BrunchCon offers a bottomless mimosa and bloody mary and beer and wine deal, all you have to do is walk to your desired beverage stand. Instead of a $20 plate of eggs and toast, it’s a $45 investment in various tiny bites of deviled egg, chicken and waffles, and energy bars. Instead of a day lost to drinking and a night lost to an early hangover it’s—well, that part is 1:1.Photo by Laura MurrayThis is the second year BrunchCon has visited New York. The first was a disaster. “New York’s First BrunchCon Was a Drunken Hellscape,” wrote Grub Street. “NYC's First 'BrunchCon' Went About How You'd Expect,” said Gothamist. “BrunchCon? More like BrunchConned say disappointed New Yorkers,” lamented Metro. Complaints were myriad and mainly concerned the crowded space, long lines both to get in, and frat party-like floors sticky with mimosa. “If someone stole your dog or your man or your money & you want revenge, send them to #BrunchCon,” tweeted one attendee.It is clear that for its second year, with egg on its face (yeah, I did that), BrunchCon had to do better. The event team, which holds Cons in seven other cities, pared down its vendors from 50 to 30. (Trouble finding brands willing to be associated with BrunchCon probably helped with this task significantly.) Prices were decreased, and the event was moved to the much larger EXPO center. I attended Sunday morning and I have to admit, the BrunchCon team learned from a brunch of their mistakes, ha-ha.Photo by Laura MurrayThe EXPO center is a spacious, sun-drenched box of a place in Greenpoint, Brooklyn. Upon entry, you were greeted with a plastic champagne flute that was to be your designated plastic champagne flute for the duration of your BrunchCon experience. It should have been in a necklace that you wore around your neck, but I’ll forgive BrunchCon for this oversight. When you wanted more mimosa, you simply walked to the large, square mimosa station in the center of the room and handed a staff member your flute, which they dutifully filled with pre-made mimosa from one of several large coolers. The process took mere seconds and was performed without judgment.The mimosas—which I sampled, as well as a glass of rosé and a bloody mary, for the sake of journalism—were slightly more juice-heavy than you would want if you ordered a single mimosa at a restaurant, but were arguably a perfect blend for continuous drinking. There were two Bloody Mary stands; seven wine options at a large Barefoot Wine station; a mimosa station; a Coney Island Beer station; a Peroni station. The largest lines were for a chicken and waffle bite from Baked & Fried, a good bite, and for a snow cone bite from Sweetface Snowballs, which I did not sample. The smallest lines were for just about everything else, either due to bite efficiency or bite boredom.Photo by Laura MurrayNo one seemed to be displeased, however. Attendees danced to the extremely loud party music, sat at plentiful tables stationed in the center, and enjoyed their many drinks and tiny bites. Employees mopped up spills almost obsessively, fearing, I imagine, another year portrayed as a brunch-themed frat party. A group of women I talked to said they liked the mimosas the best, and offered, without my asking, that they would come back. A couple from the Upper East Side told me the festival was boozier than they expected and that they weren’t trying to get wasted at 10 a.m., but they also offered without my asking, that they would come back. They had decided to come because someone in their group saw the event on Facebook and because they “love brunch.”That you could have the same amount of mimosas for the price of a bottle of André and a box of orange juice, or a larger meal for half of the price of the small bites, seemed to not matter to these brunch fans. After all, the appeal of brunch is not the food nor the drink, it is the experience; and it’s not so much the experience, as what you want the experience to be. The day drunkenness, the party atmosphere, the generally worse-than-average restaurant food. All that matters is one’s own taste for the unpleasant.Photo by Laura MurrayExplore Bon AppétitBrunchNew York CityTrends + NewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Kelly Conaboy"]}