{"id": "d4fe9505a5de25607928acf3ce7afb3c", "url": "https://www.bonappetit.com/story/simple-syrup", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "What is Simple Syrup, How to Make Simple Syrup, and How to Use Simple Syrup | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor the Sake of Baristas and Bartenders Everywhere, Don’t Dump Sugar Into Your Cold DrinksSimple syrup is the smartest way to sweeten any cold drink.By Chala Tyson TshitunduMarch 19, 2021FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAs a former barista, I feel very passionately about simple syrup. While I would never judge a customer’s drink order, I did genuinely cringe any time I saw someone dump a packet of sugar into their iced coffee. Let’s review the science: Solids, like sugar granules, can take ages to dissolve at low temperatures. No matter how aggressively you swirl the ice around, that sugar will keep sinking to the bottom of your cup. The solution, however, is simple: syrup.What is simple syrup?Simple syrup is a liquid sweetener made by dissolving sugar in water. That’s literally it. Simple syrup disperses sweetness evenly throughout beverages of any temperature, making it a key component of many iced drinks and cocktails (like sparkling beet lemonade or a whiskey sour).Simple syrup has two main forms: standard syrup, which is made with equal parts sugar and water (1:1 ratio), and rich syrup, which is made with twice as much sugar as water (2:1 ratio) and therefore more viscous. Everything can be measured out by volume (like, 1 cup sugar to 1 cup water), but if you’re a stickler for precision, weighing your water and sugar (like, 200 grams sugar to 200 grams water) will yield results that are fractionally more accurate.How do you make it?There are two distinct methods for making simple syrup: hot and cold. Each method has its own unique advantages and disadvantages, but both are markedly easy, so this is the point where you get to choose your own adventure!It’s more common to see simple syrup made on the stove via the hot method. In a saucepan, bring equal parts water and sugar to a boil, stirring continuously until the sugar has fully dissolved. Be cautious not to let too much water evaporate—otherwise, your syrup will reduce and cook down to be much thicker and sweeter than expected. Remove from heat, funnel into a glass or plastic container with a lid, and let cool completely before use.The cold method tends to get less love than its stovetop counterpart, perhaps because it takes a bit more time. Many recipes will have you stirring sugar into room temperature water periodically over the course of 10–15 minutes, but Drink What You Want author John deBary swears by an unconventional cold process: busting out the blender.“I usually need to use [simple syrup] right away,” deBary says, “but that’s hard when it’s hot!” Blending sugar and room temperature water together on high for a full minute, then allowing it to settle for another full minute, makes for simple syrup that can be used in an instant.Can you customize it?Since simple syrup is essentially just sugar water, it can easily be customized by adding another ingredient that will infuse it with flavor—dried flowers like hibiscus, citrus peels, fresh herbs, and even crushed whole spices like cardamom and fennel. “It’s a low-risk way to experiment with different flavors in a cocktail,” deBary says. Be aware that infusion works a bit differently with each of the two methods: When using the cold blender method, add flavor elements straight to the blender, along with sugar and water, and strain out after blending. DeBary prefers this method when using delicate ingredients like herbs as it allows for infusion without a change in flavor. When using the hot method, you can add your fruits, herbs, and/or spices directly to your fresh hot syrup and allow them to steep for 24 hours before straining.How long does it keep for?Again, this depends on the adventure you chose. According to Food Republic, when stored properly, hot-processed standard syrup can last up to a month in the fridge, and rich syrup can last up to six months. Cold-processed syrups, however, can grow mold in about half the time.Made more than you can use? DeBary suggests freezing extra simple syrup and thawing overnight in the refrigerator or quickly in the microwave when needed. How simple!Time for a beverage:Iced Coffee ShakeratoWhen shaken with a lot of ice and a splash of sweetener, espresso forms a creamy froth on top and becomes infinitely more exciting.View RecipeExplore Bon AppétitSummer DrinksCocktailCoffeeSugarRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-18", "author": ["Condé Nast", "Chala Tyson Tshitundu"]}