{"id": "d505768f7a2a9a7d9bbafdc1e806faf3", "url": "https://www.bonappetit.com/story/leafy-things-you-should-be-using-like-herbs", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "6 Bold, Peppy, Leafy Things You Should Be Using Like Herbs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking6 Bold, Peppy, Leafy Things You Should Be Using Like HerbsThere’s a whole wide world beyond herbs.By Sarah JampelMay 10, 2019FacebookTwitterEmailPhoto by TED+CHELSEA CAVANAUGH, Food Styling by Simon AndrewsFacebookTwitterEmailHerbs, herbs, herbs (to the tune of “Marsha, Marsha, Marsha”): Sure, we’re excited about all the tender herbs popping up at the farmers' market—a welcome dose of color and freshness after so many months of brown, lumpy roots and tubers (no offense, potatoes)—but why should they get all the attention?This time of year, herbs aren’t the only bold-flavored leafy things out and about. There are plenty of other characters that can bring the same pizzazz and brightness to your recipes—if you just give them a chance.Here’s a rundown of our favorite not-herbs that can be treated in much the same way you would the usual suspects—basil, dill, cilantro, parsley, and mint. Throw a handful into a salad, whiz them into a vibrant sauce, or shimmy them into a sandwich. And since they’re also great when combined with proper herb-herbs, feel free to mingle and merge to your heart’s content.Photo by TED+CHELSEA CAVANAUGH, Food Styling by Simon AndrewsCelery LeavesThese magical yellow-green leaves live on the top of stalks and tucked inside the core of a celery bunch; they’ve got an even more intense celery flavor than the stalk itself and are delicious in a salad, vinaigrette, or Bloody Mary.Photo by TED+CHELSEA CAVANAUGH, Food Styling by Simon AndrewsArugulaSkip the feathery salad and throw a handful on top of anything mild or fatty (ricotta! pizza! risotto!) to add a pop of peppery flavor. Arugula also makes for a deliciously spicy pesto.Photo by TED+CHELSEA CAVANAUGH, Food Styling by Simon AndrewsWatercressFiery and slightly sour, we like it in sandwiches, buzzed into green sauces, and chopped into a mustardy potato salad.Photo by TED+CHELSEA CAVANAUGH, Food Styling by Simon AndrewsFennel FrondsThe feathery wisps that crown the top of a bulb of fennel are a built-in garnish for any dish that contains the bulb itself. But fronds can also be used wherever you want fennel’s signature fresh, anise-y flavor but without the bulb’s crispy crunch.TED+CHELSEA CAVANAUGHScallions and ChivesFor a more delicate onion-y flavor that doesn’t dry out your mouth with intense heat, turn to these little alliums. Scallions and chives can be eaten raw—and with abandon!—for lots of flavor without the overwhelming fire you get from red or yellow onions.Photo by TED+CHELSEA CAVANAUGH, Food Styling by Simon AndrewsPea Sprouts and ShootsLeggy and leafy and so adorable it almost hurts, pea sprouts and shoots are sweet, slightly grassy, and about as springy as spring gets. They go well with—you guessed it—peas and will do good work on top your pea mash, pea pasta, or pea soup.These would all be pretty cool in a pesto, TBH:How to Make Pesto Out of Just About AnythingPSA: You don't need pricey pine nuts or even basil to make everyone's favorite green sauce. Here's how to make pesto out of whatever you've got lying around.View StoryExplore Bon AppétitBasicallyherbCeleryArugulaWatercressFennelPea ShootRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-10", "author": ["Condé Nast", "Sarah Jampel"]}