{"id": "d50c97a5d0c7b1ce4472133cf0bedf12", "url": "https://www.bonappetit.com/recipe/broccolini-with-sesame-sauce-and-lemon", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Broccolini With Sesame Sauce and Lemon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueBroccolini With Sesame Sauce and LemonBy Andy BaraghaniOctober 15, 20194.9(7)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThis steamed broccolini dressed with a salty-sweet sesame sauce was inspired by gomae, a Japanese spinach dish. It’s a bright and palate-cleansing; a perfect side for heavy winter dinners. You want the water to be heavily salted to properly season the broccolini. Two tablespoons per quart of water is a good rule of thumb.Ingredients8 servings6bunches broccolini (about 3 lb. total), trimmed, halved lengthwiseKosher salt¼cup tahini2Tbsp. white miso1Tbsp. low-sodium soy sauce1Tbsp. mirin (sweet Japanese rice wine)1Tbsp. unseasoned rice vinegar1tsp. toasted sesame oil4Tbsp. vegetable or other neutral oil, divided2tsp. honey, divided½lemon, seeds removedToasted sesame seeds (for serving)PreparationStep 1Cook broccolini in a large pot of boiling salted water until bright green and crisp-tender, 5–7 minutes. Drain and transfer to paper towels.Step 2Meanwhile, mix tahini, miso, soy sauce, mirin, vinegar, sesame oil, 2 Tbsp. vegetable oil, 1 tsp. honey, and 2 Tbsp. water in a small bowl to combine; season sesame sauce with salt.Step 3Cut lemon lengthwise into quarters, then thinly slice crosswise. Toss in a small bowl with remaining 2 Tbsp. vegetable oil and remaining 1 tsp. honey; season lightly with salt.Step 4Spread sesame sauce on a platter and arrange broccolini on top. Scatter lemon over; sprinkle with sesame seeds.Step 5Do Ahead: Sesame sauce can be made 1 day ahead. Cover and chill. Bring to room temperature before using.How would you rate Broccolini With Sesame Sauce and Lemon?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleSauce was delicious!  But boil time was too long it became mushy.  Luckily the sauce was so good it saved the dishjoanne hinh5/4/2020Loved this and comes together very quickly. I agree with the other commenter that the boil time was too long for me, I boiled for 5 min and it was pretty mushy. Next time I'll taste test at the 3 min mark and go from there.Julie LeeSeattle, WA11/30/2019Quick, easy, and delicious. A well rounded recipe. Anonymous11/25/2019This was really delicious and pretty easy to make. The sauce is highly drinkable. I thought the broccolini turned out a bit mushy but may have boiled a min too long. Next time I’m going to try broiling the broccolini. kristinabronitsky9659Oakland, CA11/24/2019Explore Bon AppétitTahiniCondiments, Sauces & PastesBroccoliVegetableFallSideVegetarianDairy-FreeHealthyishThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Andy Baraghani"]}