{"id": "d517fd9e309cd74f1f62eb9b2f59595f", "url": "https://www.bonappetit.com/recipe/greens-with-braised-pancetta-and-garlic", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Greens with Braised Pancetta and Garlic Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGreens with Braised Pancetta and GarlicBy Cal PeternellNovember 1, 20184.7(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Dana BonaguraEmailPinterestPrintEmailPinterestPrintThis recipe is one of our favorites from Almonds, Anchovies, and Pancetta, our November 2018 Cookbook Club pick. If you can’t find pancetta, slab bacon can be used in its place but will add a smoky flavor to the finished dish.Almonds, Anchovies, and Pancetta by Cal Peternell with Permission from William Morrow Cookbooks, 2018Ingredients4 servings1Tbsp. extra-virgin olive oil8oz. pancetta, cut into 1½\" pieces12garlic cloves, unpeeled½cup dry white wine2bunches kale, mustard greens, and/or collard greens, stems removed, leaves coarsely choppedKosher saltPreparationStep 1Preheat oven to 450°. Heat oil in a large ovenproof skillet over medium. Cook pancetta, stirring occasionally, until lightly browned on all sides, about 5 minutes. Add garlic and wine, increase heat to medium-high, and bring to a simmer. Add enough water to just cover pancetta (about 2 cups), return to a simmer, then transfer pan, uncovered, to oven. Immediately reduce oven temperature to 325°. Roast, adding more water if pan looks too dry, until pancetta is very tender and garlic is softened, 60–70 minutes.Step 2Carefully pluck out garlic and let cool slightly. Peel, then return cloves to skillet.Step 3Heat skillet over medium-low. Working in batches, add kale, stirring and folding into liquid in pan to encourage wilting, until all greens fit in skillet. Bring to a simmer and continue to cook, tossing occasionally, until greens are wilted and flavors have melded, 15–20 minutes. Season with salt.How would you rate Greens with Braised Pancetta and Garlic?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI make this recipe at least once a year. A great way to get a load of greens in, with a ton of flavour from the pork and garlic. I also always peel my garlic so I can skip the peeling. \n\nWill probably be able to cook this from heart soon enough. AnonymousToronto, ON.11/26/2021Really yummy! I doubled the greens using lacinato kale, mustard greens, and chard. Used finely chopped pancetta since that's what I had and reduced braising time to 50 minutes. Will definitely make again!AnonymousBay Area, California10/16/2020Gave pork belly a dry rub due to lack of pancetta. I think turning on convection in oven to make meat crispy will be faster than having to wait 60-70 min. Used minced garlic which had a nice smoked flavor since being in the skillet for so long. Didn't use that much water but still came out great.ok42dayBay Area4/28/2020I love this recipe. It has all the flavor of a comfort food and is loaded with greens. Goes beautifully with crusty bread for smearing the garlic onto. chelseaalyonsChicago, IL4/15/2020this is a great cold-weather meal with some crusty bread (cheese toasties, anyone?) and a board game IMO. FYI Cal’s cookbook instructs you to cook the greens separately, but I personally think cooking them in the braising liquid is better! the whole garlic cloves are so flavorful. I added lots of freshly ground black pepper. if you’re worried about fat/oil (if your pancetta is especially fatty), pour some of it out before adding the wine and garlic. chelseaalyonsChicago, IL10/9/2019The recipe on its own makes for a very oily dish as the fat from the pancetta and olive oil are cooked together create a lot of excess oil. It also doesn't have a lot of flavor on its own, but adding a little chicken broth in replacement of the water helped create more body. AnonymousCalifornia 3/2/2019Explore Bon AppétitKaleLeafy GreensVegetablePancettaCured MeatMeatGarlicMustard GreensCollard GreensSideDairy-FreeNut-FreeGluten-FreeBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-01", "author": ["Condé Nast", "Cal Peternell"]}