{"id": "d54c82c5d31c723f774ab9d545482fb5", "url": "https://www.bonappetit.com/story/mater-soap", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "The Bar Soap That's Saving My Skin This Fall | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Bar Soap That's Saving My Skin This FallI’m especially into its cheerful peachy hue and delicious geranium scent.By Aliza AbarbanelOctober 11, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!Forget Disneyland or the beach—my shower is my happy place. I start craving steam as soon as the temperature dips below 70°F, but the combination of hot water and the shifting seasons wrecks havoc on my poor dried-out skin. So ever since I ditched bottled body wash to reduce my plastic use, I’ve been searching for a hydrating bar soap with silky smooth suds, and that bar is Mater Soap’s ultra-hydrating geranium bar.The Brooklyn-based brand is helmed by Addison Walz, whose background in sculpture, textiles, and natural dyes helped her produce this aesthetically impeccable soap. Her cold-pressed process also avoids drying ingredients like sodium lauryl sulphate (SLS), opting for sustainably sourced ingredients like rosy kaolin clay and smoky pine tar. I’m especially into geranium’s cheerful peachy hue and delicious floral scent.It’s made from a blend of olive oil and coconut oil that’s similar to castile soap (of Dr. Bronner’s fame), with plenty of shea butter for an extra moisturizing boost. Best of all, the smell of geranium, hibiscus, and annatto seed lingers on my skin throughout the day. When I’m stuck on a stalled subway car or trapped in a two-hour meeting, one whiff reminds me of a better place: a hot shower. —Aliza Abarbanel, Healthyish assistant editorBuy it: Mater Soap Geranium Bar, $14.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItNatural BeautyShoppingRead MoreLifestyleThis Low-Waste Shampoo Bar Saved My Thick, Dry HairBy Christa GuerraRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-11", "author": ["Condé Nast", "Aliza Abarbanel"]}