{"id": "d54f12b9ce5ce646760b3553d0a57703", "url": "https://www.bonappetit.com/story/whatre-you-eating", "year": 2020.0, "month": 7.0, "day": 2.0, "content": "Instead of Asking “How Are You,” I Ask “What’re You Eating?” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleInstead of Asking “How Are You,” I Ask “What’re You Eating?”I can't join my far-flung community at their dinner tables, but I can send a picture of the mana’eesh I’m making.By N.A. MansourJuly 8, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI probably pick my friends on their ability to eat. I tried hard not to become an auntie, as is expected by both my Palestinian and Mexican bloodlines, but by the time I was hosting my own dinners at age 20, my inner tia-khalto hybrid came out. There’s an anxiety here, that my loved ones aren’t being properly nourished, and my response is to bring out trays of cookies, bowls of nuts, and three different types of tea after dinner. It’s an expression of love, so my friends have to be able to endure this and show patience when I daydream of menus. They also have to be able to tease me: While visiting a childhood friend in the UK, she told me I was saying the word fetteh as I napped on her couch in Manchester. She laughed maniacally at the irony: I had just made her my version of the dish, which had layers of tahini-yoghurt sauce alternated with golden croutons made of store-bought naan (our substitute for thin khubz lubnani), and stewed eggplant (I had forgotten to buy the chickpeas that typically go into it).I stuck my tongue out at her. She knew I had made her the fetteh because we both missed being home, even if home was hard to pin down; it was probably why I was dreaming of it later that night, too. Third culture kids like us are used to their worlds being scattered, a product of living a few years here and a few there, but never quite in the culture of our parents or their parents.My world exists in little bubbles that have broken off from the large bubble that contains me. A significant bubble exists around that childhood best friend living in Manchester, who I met in the United Arab Emirates during high school. She eventually ended up in the UK after a stint in Lebanon, where her parents are from; they are her bubbles, too. Another bubble encircles around a friend on an island in the Nile, not that far from my own Cairo apartment; she was the last person I hugged before the pandemic hit. My parents are the biggest bubbles: One is firmly in Chicago, in their childhood home, and the other drifts between the Middle East, Central Asia, and the Americas. I am positive I inherited the drifting gene from them—becoming a historian means I have bounced across the world for the last five years.Mulling over giving an honest answer to \"How are you?\" or \"Are you okay?\" can set a cycle of anxiety into motion: an anxiety of making others anxious.To keep up with all my bubbles, I am good at using my phone, at least half of the time. I am a voice notes aficionado, sending long rambling messages to friends while making coffee or tea. I claim I’m “taking them along on the journey,” incorporating the sounds of my day as I measure out flour or dice garlic. They patiently endure the banging of the oven door and the tick tick tick of my knife on the chopping board. The other night, as I was sending a voice note to a colleague and friend who is a curator, talking about things people who love history and art talk about, I slipped in Oh, and what are you eating for dinner? towards the end. It wasn’t something I normally ask her; the question just sort of came out of me and I wondered if she’d find it strange. She was a colleague I had only met in person twice before, but a bubble steadily grew as we sent back voice notes on the politics of curation and increasingly, our personal lives. We had not yet broached the topic of food, and I was mildly anxious to hear her response, but the note I received in return the next day was all about mackerel and pickles, with a good dose of the memories that accompany food.I had only really ever asked my family what’re you eating before, breathlessly flung into a hasty voice note; the triumphant hazards of being third culture kids who also belong to two obsessive food cultures—Mexican and Palestinian—means we talk only of food. Now, during the pandemic, I carefully ask more people in my bubbles what they’re eating that day: former employers, Twitter friends, that new friend I made at a party right before the lockdown, and relatives I never texted that often before. They send pictures of ritually-plated kahvaltı with eggs fried with pastrami and all manner of Turkish breakfast cheeses, single-word texts cascading into one another (mandazi, samboosa), and voice notes asking what I think they should order from their local family-run Argentinian restaurant. Empanadas, I answer.What are you eating? is How are you? with fewer implications. Mulling over giving an honest answer to How are you? or Are you okay? can set a cycle of anxiety into motion: an anxiety of making others anxious. I know I feel it daily. By asking what my loved ones are eating, I can tell if my brother’s swamped with work, since he’s getting a burrito bowl instead of experimenting in his kitchen. My own aunties convey stress at food scarcity by telling me they only have potatoes—no flour or masa to make our cultures’ unyeasted breads. An island away in the Nile, my colleague and dearest friend in the city is in a playful mood, trying something dangerous with dumplings (I COULD HAVE LOST YOU! I screamed into a voice note that evening when I found out the recipe called for her to mix hot water and oil). Living less dangerously, the curator and I discuss the global everpresence of the drink we call karkade in Arabic, that my Chicana mother calls agua de jamaica. My bubbles don’t have to tell me how they’re feeling. Knowing what they’re eating (or even drinking) is like seeing their face muscles twitch into a smile or a slight frown. Asking what are you eating? also restores joy by focusing the conversation on something we love. It works that way for me, too: The creative act of cooking relieves a day of chaos in the news cycle.I can’t always share the product with my far-flung community, but I can send a picture of the mana’eesh I’m making along to Manchester. Instead of sending it to my childhood best friend, I send it to her husband. He tells me he’s eating a kebab they ordered, we text back and forth about the new baby, and then he asks how to make the mana’eesh. I describe my dough recipe—it’s the same one I use for pizza, although I pull it thinner—and I sternly tell him he’ll need really good za’tar to spread on it. He will then toss them into the oven until the bottom of the flatbread is crunchy and serve with sliced raw tomatoes and cucumbers. He will surprise his wife with them some morning soon and it’s like I’m there, in that bubble. Although I cannot taste, I can influence what is on their table and ooh and aah at my friend’s victorious attempt to create new food memories. I’ll be there soon enough, napping after a big lunch we’ve made together, muttering za’tar in my sleep.Explore Bon AppétitessayRead MoreCoronavirusIt Took a Global Pandemic, But I'm Finally Calling My MomBy Phillip PicardiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-08", "author": ["Condé Nast", "N.A. Mansour"]}