{"id": "d550ca50cd201040d92d097bc2cd976b", "url": "https://www.bonappetit.com/recipe/roasted-peppers-with-parm-breadcrumbs", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "Roasted Peppers with Parm Breadcrumbs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRoasted Peppers with Parm BreadcrumbsBy Lauren SchaeferMay 3, 20184.7(7)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintBasically just an excuse to eat breadcrumbs by the handful, TBH. Great hot and at room temperature, these make a great, low-stress addition to an antipasti meat and cheese plate.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketCutting Board$10 At IKEAChef's Knife$34.53 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketMedium Bowl$17 At AmazonPlatter$29 At AmazonIngredients4 servings3bell peppers, any color4Tbsp. extra-virgin olive oil, divided¾tsp. kosher salt, divided1cup panko (Japanese breadcrumbs)½cup finely grated Parmesan1tsp. garlic powder1lemon4sprigs parsley1tsp. Aleppo-style or other mild red pepper flakesPreparationStep 1Preheat oven to 450°. Place 3 bell peppers upright on a cutting board. Working around stems and avoiding the seedy center, slice straight downward to remove 4 lobes from each pepper.Step 2Arrange pepper lobes skin sides down on a rimmed baking sheet. Drizzle with 1 Tbsp. oil; season with ½ tsp. salt.Step 3Gently mix 1 cup panko, ½ cup Parmesan, 1 tsp. garlic powder, 2 Tbsp. oil, and remaining ¼ tsp. salt with your hands in a medium bowl.Step 4Using your fingertips, pat about 2 Tbsp. breadcrumb mixture into each piece of pepper. Drizzle peppers with remaining 1 Tbsp. oil.Step 5Bake peppers until bottoms are deeply browned and breadcrumbs are golden, 18–22 minutes. Let cool slightly.Step 6Meanwhile, slice 1 lemon into wedges and set aside. Pick leaves from 4 parsley sprigs and coarsely chop.Step 7Transfer peppers to a platter. Top with red pepper and parsley. Serve with lemon wedges alongside.How would you rate Roasted Peppers with Parm Breadcrumbs?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleVery nice. The bell pepper is very soft and the panko is very seasoned and crispy, so it forms a very nice contrast in texture.AnonymousCleveland5/27/2020YUM!! These were super easy to make, and really delicious. Makes a great appetizer or side dish.AnonymousColumbia, SC1/11/2020Forgot the lemon and parsley, but oh so scrumptious with the Magic Crispy Chicken on basically, with a salad and quinoa/brown rice side.AnonymousSC3/4/2019Explore Bon AppétitBell PepperVegetableParmesanCheeseEasyQuickStarterSnackNut-FreeVegetarianRoastDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-03", "author": ["Condé Nast", "Lauren Schaefer"]}