{"id": "d55589f689424a46a4dc51b75c468bad", "url": "https://www.bonappetit.com/story/digestif-candle", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Brightland’s Digestif Candle Is Like a Breath Mint for Your Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingBrightland’s Digestif Candle Is Like a Breath Mint for Your KitchenFor those nights when your nose needs a palate cleanser.By MacKenzie Chung FeganAugust 10, 2021FacebookTwitterEmailPhoto by Allie WistFacebookTwitterEmailThis is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.At the end of a robust meal, all I want is a digestif—a thimble of maybe an amaro or cognac that clears my palate. Mmm, I think, pouring myself a Meletti. That laksa was so good, but now I would like not to taste it anymore. A digestif marks the end of dinner in a way that is both celebratory and final, like an exclamation point. That was fun! Let’s go to bed.Brightland’s Digestif candle operates on the same principle, except for your nose instead of your taste buds. After the garlicky fried rice or pan-seared mackerel or cumin-forward aloo gobi has been cleared, light up this scented candle and, if you’d like, pass the scotch. With notes of neroli (which is derived from bitter orange blossoms), vetiver (a fragrant grass), and a hint of black pepper, Digestif banishes food smells and transports you somewhere warm, verdant, and lush.Brightland Digestif Candle$42 at BrightlandIf you’re thinking, Brightland? Isn’t that the olive oil company with the Instagrammable matte bottle and the slick branding? you are correct. The secret ingredient in this soy-based candle—and what makes its fragrance especially potent—is Brightland’s own cold-pressed California olive oil, which it says improves the “scent throw” of the candle. You know how when you bloom spices in ghee or oil, their flavor permeates the fat, which in turn infuses lentils or pasta or chicken breasts with redolent goodness? It’s the same idea with the olive oil and the component scents in the Digestif candle. I’m pretty sure. I’m not a scientist. But that sounds right.Even on nights when I’m not lingering at the table with guests after dinner, the Digestif candle has become part of my routine. I’ll light it up while I’m washing dishes—the equivalent of brushing my kitchen’s teeth before bed—knowing that when I stumble downstairs the next morning, it’ll smell like a boutique filled with lovely things I can’t afford instead of last night’s fish.Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}