{"id": "d56ca249db139bc8989da1ae0dd5479c", "url": "https://www.bonappetit.com/story/sonia-spring-cocktails", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "I'm Drinking a Strawberry Negroni Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI'm Drinking a Strawberry Negroni Right NowIt's spring cocktail season and I am here for it.By Sonia ChopraApril 22, 2021FacebookTwitterEmailFacebookTwitterEmailEvery other Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.I’d never been one to drink at home and that didn’t change much even when I stopped going out three or four nights a week. It’s not the drinking that I missed so much as the act of going to a bar, of rallying friends to celebrate (or complain), of hashing out a problem over glasses of chilled red, of sitting alone with a book at a bar and asking the server too many questions about wine.Now, though, with two vaccine doses behind me, the weather turning, and the spring produce coming in, I’ve been stalking cocktail menus kind of aggressively and have started to order more drinks to go. Basil, snap peas, cucumbers, and strawberries all play well with gin, my spirit of choice, and it’s been fun to see those show up on website menus and in people’s Instagram feeds, featured in drinks dotted with violet petals or little sprigs of herbs. Last weekend when we ordered takeout from Atlanta’s Talat Market (Bon Appetit’s October 2020 cover star!), I ordered a to-go cocktail made with green mango (!); at nearby Little Bear there’s a strawberry rum Negroni I have yet to try but cannot stop thinking about.I’m so ready to be back in bars, to banter, to debate glassware and sweetness and bubbles, to maybe—one day—even sneak sips again from my friends’ drinks. But until then I’m so grateful for this change in seasons and for the bartenders who are really taking advantage of it in their cocktail menus.I’d love to hear what you’re drinking (or what you want to be), if you want to shoot me a note at sonia@bonappetit.com. And if you do like to make drinks at home, definitely check out the interactive Cocktail Cabinet my coworkers at Epicurious created, which can help you find a drink (nonalcoholic or with booze) based on what you have at home.Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-22", "author": ["Condé Nast", "Sonia Chopra"]}