{"id": "d573967a192a7ebdce8e3d04acf57b95", "url": "https://www.bonappetit.com/story/never-dine-out-on-valentines-day", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Dine Out on Valentine's Day? Why Not Just Stick a Fork in Your Date's Eye? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDine Out on Valentine's Day? Why Not Just Stick a Fork in Your Date's Eye?7 reasons you should absolutely be cooking at home on the 14th.By Alex DelanyFebruary 12, 2019FacebookTwitterEmailPhoto by Bobbi LinFacebookTwitterEmailDid you just hear that? That was the sound of over a hundred million greeting cards being purchased, all adorned with illustrations of little pink ribbons and crimson hearts and golden, not-so-threatening arrows. Oh, yes: Valentine’s Day is just around the corner, friends. And that means you’ve got a question ahead of you: What are you and your date doing for dinner on the 14th? Are you dining out? Or are you staying in?Well, I’ll answer that question for you: You’re staying in. You’re cooking. And it’s going to be great. You might have had the vision of some fancy restaurant meal ahead of you, filled with bottles of bubbly, candlelight, vibes, and a hefty check at the end of it. But to be quite honest with you, you’d be a fool to do anything other than cook at home. Here’s why you and your Valentine should absolutely, 100 percent, without a doubt do dinner at your place this Thursday:You Don't Have to Worry About All That Restaurant StuffOh, you didn’t make a reservation yet? Yikes. That’s going to be rough. And at this point, you’re going to end up at whatever restaurant has seats open, not a spot that truly expresses how much you care about your date. That’s not a good look. And even if you’re going to a fancy spot with a killer reputation and impeccable service, what if you can't get off work at exactly the moment you need to and end up being late? And wait, how much are those drinks!? And...hold on, did the maître d’ just say you have to wait half an hour, even with your reservation? And is that a stain from the chicken Parm you ate for lunch on your shirt?Dining at home is about taking away the pressure to have a night that’s “worth” what you're paying for it. That kind of dining out-related stress just doesn’t happen at your place. You’re on home turf. You’re in control. You can breathe more easily. (And you can change that shirt.)You should be cooking what you and your date want to eat. Not what everyone else wants to eat.\nSpecial Valentine’s Day Menus (for the Most Part) Stink!If you approached me and said, Hey, I’ve got this menu that I want you to order from for your special date. You don’t get to choose what you want. The dishes are all going to be relatively safe, because we need to appeal to every diner in our restaurant simultaneously. And it’s not actually that great of a deal. In fact, we marked the prices up a bit, because everyone is trying to dine out tonight. But we’re going to give you a free glass of average sparkling wine when you get here, so you feel fancy. You down? I’d say, LOL. What!? No, I am not down.The Valentine’s Day prix fixe menu is a scam! They’re money-makers for sure, but most chefs don’t like cooking them. At the end of the day, if I was going to take my date to have an experience at a restaurant I thought she’d love, I’d want it to be the real experience of that restaurant. I don’t want a watered-down menu of Valentine’s Day hits. I want the real thing.You Will See (and Maybe Even Talk to) Other Human Beings at a RestaurantValentine’s Day is about celebrating your affection for a special person in your life. (Or multiple people. Or friends. Or yourself. Or a giant pillow shaped like a human. I’m not here to judge.) And you're interested in diluting that experience by being in a crowded restaurant, surrounded by couples celebrating their brilliant, unique love, just like you? You want to listen to everyone else’s conversations? And you want to bump everyone else’s elbows? And you want to confuse your date’s coat for someone else’s coat? And then apologize for not knowing what your date’s coat looked like? And then apologize to a stranger for touching their coat?!No, thanks. I want my Valentine’s Day to be spent with my Valentine and just my Valentine. I’ll be celebrating in the comfort of my own home, where I can spend quality time with my date. And where I am familiar with the contents of the coat rack.You know what isn't super loud? Marinated olives and feta.\nYou Can’t Hear Your Date in a Crowded RestaurantWHAT? SORRY, THE MUSIC IS REALLY LOUD. AND EVERYONE ELSE IS SHOUTING. I CAN’T REALLY HEA...WHAT? YOU WANT ME TO MOVE ON TO THE NEXT POINT, BECAUSE YOU UNDERSTAND WHAT I’M TRYING TO SAY HERE? IS THAT WH...YEAH? OK. COOL.No One Wants to Wait On Your Table on Valentine’s DayYour waiter would probably rather be at home on Valentine’s Day. That’s nothing against you, a perfectly respectable and courteous diner. But a lot of the people who show up to a restaurant on Valentine’s Day are jerks. They feel the need to show off for their date and end up disrespecting the staff, tipping poorly, and/or acting like they own the joint. Your waiter would almost certainly rather have the night off and spend it at home cooking dinner with someone they care about. (Which is what you should be doing, too.)But also: You really want some stranger all up in your date? It’s impossible for them to not be a major factor in your night. Imagine if your waiter was just along for the ride all night. After you paid your bill, they joined you at a tasteful cocktail bar. Then they accompanied you and your date back to your place. And there they were, wedged between you and your date when you woke up the next morning. You don’t want to share the night with a stranger, as charming and serviceable as they may be at dinner. And they probably don’t want to be in the middle of your romantic evening either.Ted CavanaughBooze Costs Less at HomeRestaurants sell so many bottles of bubbly wine on Valentine’s Day, and that’s great for them, because booze margins are where restaurants make most of their money. But that’s not great for me, the guy who knows the wine that my date and I really want to drink is only $26 a bottle at my wine shop. And that there’s no corkage fee or bottle markup in my apartment. And that I also have all the ingredients to make a Negroni sitting on my counter. Yeah, I know. Making the point of saving money on Valentine’s Day might seem a little stingy. But hey, deep down, I’m sure you’ll both appreciate it.Imagine someone baking you a chocolate cake. That person must rule.\nPhoto by Chelsie Craig, Food Styling by Rhoda BooneReally, It’s the Act of Cooking—and Hosting—That CountsYou can put a price on how much you love someone when you take them out to dinner. It comes on a little piece of paper at the end of the meal, right above a line where you sign your name. But you can’t really quantify the emotional value of cooking a meal for someone. Sure, you bought the groceries, but the thought that went into planning a menu and choosing wine, candles, and tunes is priceless. The fact that you made the pork chops or the steak or the roast chicken or the salmon or the chocolate cake for this person that you love (or just like, if you’re not ready for that yet) means so, so much more than even the priciest meal out.Anyone can take someone to dinner. But who can cook the thing that caters to your date’s specific preferences, in the comfort of your kitchen, while connecting in ways that remind you why you like this person in the first place? Only you can do that, my friend. Cooking for another human being is the most sincere way of saying \"I care about you.\" I want to feed you both literally and metaphorically. That’s sappy. But that’s the truth.Now, about that dinner menu:Easy Steak with Pan SauceA juicy, buttery, steakhouse-worthy dinner in 30 minutes flat.View RecipeExplore Bon AppétitBasicallyValentines DayDinnerRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Alex Delany"]}