{"id": "d576af22dc63da7e6c60848de3b96542", "url": "https://www.bonappetit.com/story/being-a-black-chef-deborah-vantrece", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Being a Black Chef in a White-Led Restaurant Industry Isn’t Easy—But I’m Not Giving Up | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsBeing a Black Chef in a White-Led Restaurant Industry Isn’t Easy—But I’m Not Giving UpNavigating a decades-long culinary career, Deborah VanTrece has encountered racism at nearly every turn. And she’s done keeping quiet about it.By Deborah VanTrece, as told to Hilary CadiganSeptember 24, 2020FacebookTwitterEmailIllustration by Alexis EkeFacebookTwitterEmailI was in my early 20s the day I went shopping at a store in Independence, Missouri. It was a day like any other; I don’t even remember what store it was. What I do remember is being accused of stealing something. Within minutes a policeman was approaching me. I told him I hadn’t done anything. He hit me over the head with a billy club and knocked me unconscious.I remember coming to as he was dragging me across the ground and throwing me into the back of his police car. I remember the long drive to the station. I remember that when we got there, they went through my bag and saw right away that I hadn’t stolen anything. That I was a college student. That I’d never been in trouble. “Okay,” they said. “You can go.”Back then I wasn’t a chef yet. I didn’t have any awards under my belt or recognition to my name. I didn’t know what the decades ahead would look like, what I’d go through to get where I am today—owner of an award-winning Atlanta soul food restaurant. Back then I was young and I was Black. That was it. I was young and I was Black and I was shopping someplace somebody thought I shouldn’t have been.Every Black person has stories like this. We have some that are collectively the same and some that are our own as individuals. But something’s happened to all of us—and that’s why we have to speak out.Growing up in Kansas City, I was the kid who didn’t order kid’s meals. I ordered full-on entrées. I fell in love with cooking in seventh-grade home economics. Those fluffy French omelets got me. Beating the egg whites, watching them come to a peak, folding in the fillings—it was all so cool. I didn’t realize you could do that much with an egg. So I went home and made fluffy omelets for everybody. Then I started looking at cookbooks, playing with chicken pot pie, stir-fries. My mom caught on and would let me do the grocery shopping and make dinner while she was at work. I’d only get so much money each trip, but I learned to clip coupons and shop smart so that whatever cash I had left over would be my allowance. I didn’t realize she was teaching me some real life lessons there, but she was.I always wanted to be a chef, but it never seemed possible because I’d never seen a Black woman in that role. All I had to look up to was Julia Child and a bunch of white men. So instead I moved to Atlanta, became a flight attendant, traveled the world, and ate everything I could find: paella in Spain, adobo in the Philippines. It was exciting, getting to know different cultures through their food. In my free time I’d re-create recipes for friends and family, dreaming of a career where all I did was cook.I was in my mid-30s and raising a two-year-old daughter by the time I finally enrolled in culinary school. There were no scholarship opportunities for people my age, so I doubled up on classes, finished in a year (valedictorian with a 4.0 GPA!) and got a job as a sous-chef straight out of graduation. Two months into the job, we were catering this huge corporate event, and we were behind on prep. The chef went home, but I opted to stay through the night. By the time he showed up the next morning, I had everything lined up and ready to go. I thought he’d be thankful, but instead he told me: “I never would have hired a n-gger like you had I known how good you really were.” Then he said, “You can run back and tell everybody I said that, but it’ll be your word against mine.” And that’s exactly what happened. There was no recourse. I quit the next day.When you’re Black in America, racism is a constant. And as a queer Black woman working in restaurants, I’ve experienced it all firsthand. Sometimes it’s action and sometimes it’s words, but it all comes from the same place.On my better days I find happiness in the simple acts of cooking: methodically chopping vegetables; pan-frying chicken in cast iron like my grandmother taught me; following the handwritten chocolate chip cookie recipe my mom left behind after she died. In the kitchen I can sometimes forget there are people out there who see my skin color as a threat.Then I get that wake-up call—maybe it’s small, like a put-down from a white chef who feels threatened by Black talent, or maybe it’s big, like a Black man murdered on camera for using a counterfeit bill—and suddenly everything that’s ever happened to me and the people I love based on the color of our skin comes flooding back. When things have been so wrong for so long, you tiptoe around them so they don’t hurt you directly. And then one day they do.Illustration by Alexis EkeBy the time I opened my second restaurant in 2015, I was well-established. It’d been 13 years since I closed my first one, Edible Art Cafe, but in the meantime I’d accumulated decades of catering experience and a definitive style: soul food with a twist. I called my new restaurant Twisted Soul and built a menu out of the dishes I grew up eating, infused with the flavors of my travels and the skills I learned in culinary school. Cajun grilled chicken with crawfish butter sauce, cornbread-stuffed pork tenderloin, red bean ravioli—this was food that told my story, not somebody else’s. Food that reminded me why I wanted to be a chef in the first place.I rented a space in downtown Decatur, a city just east of Atlanta, because it was cute and walkable with lots of shops and restaurants. I hadn’t spent much time there myself—in fact, not many people I knew did either—but I didn’t question that at the time. I just thought I was going into a smaller version of Atlanta that was right next door.Almost as soon as we opened, I realized I was wrong. Some of the other big chefs in the neighborhood were young enough to be my kids, but because I didn’t come up through their channels they didn’t respect me. See, there’s this thing in the industry where if you worked for known white chefs, if you came up through them, then you’re all good. You’re wonderful. But if you got there on your own, well, how the hell did that happen?Much like Black chefs themselves, soul food has never gotten the respect it deserves. People play down the influence African Americans had on the food of the U.S. and then try to take our traditions away from us. They cook soul food but call it “Southern food” instead. When the whole sustainability thing got big, I watched the dishes we’ve been cooking for centuries become the popular items on all the white Southern chefs’ menus, as if they had never existed before. All the castoffs we grew up on—neck bones and oxtails and hog heads—were disguised and called different names. I’d be at a festival with all these top chefs serving pork terrine on peppery crackers or whatever, and I’m like, “Okay, girl. This is the same stuff all the country people are boiling in big black kettles at the cookout.”As Black chefs we’re always being asked to explain ourselves. I have to explain why I’m putting macaroni in my paella, even though I learned from a lady in northern Spain who does the exact same thing. And then, if we stick to what we grew up on, we get asked, “Why is your food always soul food? Is that all you can do?” Nobody asks an Italian chef that. Maybe the question should be: How do you do what you do?Of course there are Black restaurateurs all over the country who have succeeded in spite of everything, who started from the ground and worked our way up without any help. And everyone loves those stories. But when it’s time for the neighborhood restaurant crawl, we don’t get invited because we don’t draw the type of crowd the other chefs are looking for. So they exclude us. And then put Black Lives Matter signs up in their windows.I’ll say it now, flat out: I left Decatur because of racism. All those microaggressions over the course of my career: racism. It may be more insidious than getting knocked out by a cop—it may be dressed up in nice liberal clothing—but that doesn’t make it any less racist. And I’m done being quiet about that. I’m done sugarcoating ugly truths because at 60 years old I no longer fear the repercussions of honesty. There’s power in calling things what they are.Looking back now at all these experiences written down on paper makes me cry, but I know each one of them has only strengthened me, as a chef and as a person. I think about my mom dropping me off at an elementary school where I was one of only six Black kids because I tested into the accelerated program. How strong she had to be—and how frightened—watching her daughter as the only Black girl in the Girl Scout troop or at the sleepover. I think about my daughter, Kursten, who was a toddler when I went to culinary school, who has seen me fall to my knees, who has seen me get back up. Now, at 28, she’s the general manager and beverage director at our new Twisted Soul location on Atlanta’s Westside. She understands the importance of ownership, of building a foundation that can stick around for generations so that Black people can come into the world having something.I’m no longer content just sneaking through the door; I’m going to put my foot in it and hold that door open for the young Black chefs behind me. The Westside of Atlanta is a mixed neighborhood with a welcoming spirit, a place where people who look like me don’t just survive but thrive. And the new Twisted Soul is a safe space—a space for positivity and communion and feeling good, both for the young Black chefs I mentor and the diners who eat with us. Come by and we’ll serve you hoisin-braised oxtails and sticky sweet potato pone and the best fried fish you ever tasted. COVID-19 has changed things, but we’re resilient. There may be a shortage of prime meats, but there are plenty of neck bones, and I’ve always known how to make something beautiful out of the things no one else wants.These days I see resilience as a responsibility. The food industry has always needed more financing and mentorship for people of color, and now I can help with that. I’m no longer content just sneaking through the door; I’m going to put my foot in it and hold that door open for the young Black chefs behind me. That’s why our leaders—MLK Jr., John Lewis—laid their lives on the line. To tell future generations: You don’t have to stand for this.Now there’s an army of young people out there. They are frustrated, but they are educated and strong and smart. They’re leaving jobs where they’re treated badly and starting their own things: restaurants and pop-ups and cooking shows on Instagram—that’s their pivot. And it’s not just because of COVID-19; it’s because opportunities have never been offered to them. So they’re learning to exist outside of the traditional power structures. They’re shaking up the institutions. They’re protesting out in the streets.Here in the restaurant world, those changes are reverberating. White chefs have always set the rules, but it’s time to question them. Maybe the little white man from Kentucky on the side of that bucket isn’t the authority on fried chicken. Maybe that biscuit recipe didn’t come from your grandmother but an enslaved person somewhere down the line. Maybe French cuisine isn’t the standard. Maybe we need to kick the damn door down. And maybe, on the other side, there are possibilities beyond what we’ve ever imagined.Deborah VanTrece is an award-winning chef and owner of the restaurant Twisted Soul in Atlanta. She is currently working on a cookbook, to be released on March 16, 2021.Explore Bon AppétitFirst PersonSoul FoodAtlantaChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-24", "author": ["Condé Nast", "Deborah Vantrece", "As Told To Hilary Cadigan"]}