{"id": "d57abe51ba0297d751fb527d2280f23c", "url": "https://www.bonappetit.com/story/savory-cashew-butter", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "This Is the Savory Cashew Butter of My Dreams | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoptechniquesThis Is the Savory Cashew Butter of My DreamsMeet the saucy condiment we're swooshing under roast vegetables, tossing with noodles, and more.By Molly BazSeptember 5, 2018FacebookTwitterEmailPhoto by Elizabeth CecilFacebookTwitterEmailI'm guessing you think this is just another cashew butter, like the kind you'll find spread on toast or swirled into a new-age yogurt parfait at your garden-variety all-day café. But I’m here to convince you that it’s not. It’s really, really not.I tried this savory cashew butter for the first time when I headed to Portland, Maine, to cook with chef Ben Jackson of Drifters Wife, which this year took the #9 spot on our list of America's Best New Restaurants. At the restaurant, Jackson serves this cashew butter under tiny roasted fairy tale eggplants with pickled peppers.This nut butter is nothing like the stuff you'll find in a jar, yet is simple to make. You start by cooking cashews in a little oil along with shallots and garlic until they get all golden brown and delicious. And then Jackson pulls a unexpected move: He adds fish sauce and lime juice and blends them until they are as smooth as tahini. What results is a supremely creamy, umami-rich cashew sauce.  Grilled vegetables? They beg to be doused with this sauce. Roast chicken? Spread some of this underneath and tell me it’s not the best damn chicken you’ve ever tasted. It is also your newest cold noodle sauce, as well as the perfect alternative to standard tahini dressing.To call this a nut butter is to minimize its real potential. It’s a dip, it’s a spread, it’s a dressing, it’s a sauce. Cashews can be expensive so yes, it’s a bit of an investment. But if you consider the heavy lifting a powerhouse sauce like this can do for everything from a bowl of plain grains to blanched veg, I think you’ll agree that it’s worth it.Get the recipe:Eggplant with Cashew Butter and Pickled PeppersMake this cashew butter once, and you’ll want to use it on roasted vegetables year-round.View RecipeExplore Bon AppétitCashewNut ButterSauceHot 10 2018Hot 10Read MorecookingA Fairy Tale Eggplant Recipe That Comes With an Irresistible Cashew SauceBy Aliza AbarbanelcookingThese Rice Noodles in Cashew Sauce Are Easier Than Ordering TakeoutBy Julia BlackChocolate-Cashew ButterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-05", "author": ["Condé Nast", "Molly Baz"]}