{"id": "d58a30f62fdf184b9adda0cb0d2795d2", "url": "https://www.bonappetit.com/story/busy-people-lunch", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "What Very Busy People Eat for Lunch | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat Very Busy People Eat for LunchWe talked to six very busy New Yorkers about what they eat for lunch, you know, in between all of those meetings.By Emily SundbergJanuary 8, 2018FacebookTwitterEmailPhoto by Andreas Feininger/The LIFE Picture Collection/Getty ImagesFacebookTwitterEmailWhen I moved to New York for college at FIT, I learned a lot of things. I hung out with the smokers long enough to bum a cigarette as well as bum advice on the best brand of charcoal pencils. I worked on group projects with people who lived off-campus to learn the coolest bars on the Lower East Side. And my Italian roommate taught me the importance of walking a few extra blocks to get a good slice instead of 2 Bros.But most of all, I learned that busy people love to talk about how busy they are. And everyone in New York is busy—supposedly that's why they walk so fast. Including me. You know the busy people, they have their phone out all the time. They say “put it in my calendar!” or “I need a vacation after this year!” But everyone has to eat to survive, so I asked a bunch of my friends with all kinds of different—very busy—day jobs how they do it. Here’s what they had to say.Michael Graydon + Nikole HerriottJoey O’BrienOccupation: Executive AssistantSince your job is busy what do you usually eat for lunch? I bring snacks from home like dried mango, wasabi peas, and blueberries to eat throughout the day, and if I do not feel satisfied, I will buy something from grab-and-go places, like Dig Inn, Roast Kitchen, or Sweetgreen. If I do buy something, it’s usually some combination of protein and greens.Do you eat it as efficiently as possible, or take a real break? I take a real 40-minute break. I make sure to leave the office, even if that means eating my homemade lunch on a bench outside.Photo by Alex LauJane RosenfeldOccupation: Graduate School Student at Bank Street, getting a Master’s in Elementary EducationSince your job is busy what do you usually eat for lunch? YES. My job is busy and even though there is 50 minutes given to teachers for lunch each day…usually about only 5 of them are spent consuming food. The rest involves running around and planning and cleaning up clay or paper scraps or glue that spilled. So I usually pack lunch because I definitely don’t have time to run out during the lunch break to get any. I usually make a sandwich, (turkey, lettuce, tomato!!!) the night before, maybe chips or a cookie (Tates is king) if I’m feeling crazy?! There’s a place near my school that sometimes I go to in the morning to grab a coffee or buy a sandwich or wrap. It’s called Gotham and it’s across the street so it’s very convenient.Do you eat it as efficiently as possible, or take a real break? I definitely do not take a real break…That’s probably not a great thing to do but there really is no other choice? I’m always working on something or talking to a student or doing something that takes away from my attention to my food. I should probably work on that…Quincy MooreOccupation:  Founder & Creative Director, KnowlitaSince your job is busy what do you usually eat for lunch? My most frequent lunch spot is definitely Ludlow House—aka my office—and most days I order one of their salads with grilled chicken. My favorite lunch spot, though, is Lovely Day in Nolita, on Elizabeth between Prince and Spring. I order the same thing every time: fried chicken appetizer and the Pad Thai with tofu.Do you eat it as efficiently as possible, or take a real break? Enjoying a proper lunch is a luxury for me these days, and so usually it's a masterclass in efficiency (and/or insanity). Quick bites of something healthy-ish, devoured in-between calls and meetings, often in the back of cars, and always and forever coupled with excessive amounts of coffee.Rachel ParisoOccupation: NYC DogwalkerSince your job is busy what do you usually eat for lunch? I rarely (if ever) pack meals. I eat only the same few items in rotation so I don’t have to really think about it. Those items are subject to change but at the moment they are Lenny and Larry’s complete cookies (all flavors), mixed nuts, and kettle cooked potato chips (I’m obsessed). I also frequent the Grey Dog in Chelsea for pumpkin muffins and coffee. Big Booty Bread Co. makes vegan potato and veggie empanadas that I’ve recently become obsessed with.Do you eat it as efficiently as possible, or take a real break? Sometimes I have time to sit and have some coffee with my muffin at the Grey Dog in the morning. Otherwise I always eat on the go, while walking the dogs, depending on how chill the dogs are… Sometimes I eat at the dog park, but puppies end up mobbing me for food.Daniela SchiliroOccupation: Art Director for Grey GroupSince your job is busy what do you usually eat for lunch? When it comes to designing for an ad agency, we are extremely deadline driven. Because of this, my day-to-day varies and some days are much longer that others. It’s entirely unpredictable. This was definitely difficult to become accustomed to at first since I am a sucker for a routine. I love a good custom salad from Sweetgreen (olives, sun dried tomatoes, chickpeas some times, grilled chicken is a must) but I also crave a pick me up (mozzarella & tomato) on ciabbata panini from Eataly or an egg sandwich or Milanese sandwich from Daily Provisions every so often. It depends how my day is going and if I can run out. Eataly is usually my go-to since my office is conveniently above it. (Yes, its a blessing and a curse)!Do you eat it as efficiently as possible, or take a real break? I do eat my lunches as efficiently as possible since I usually have afternoon meetings. Although some days it’s nearly impossible to leave the office, I am a firm believe of getting up and getting some fresh air during the day and moving your body! That time for me is usually my lunch run. I realized this past year that I buy lunch in the summer way more than in the winter because of the weather! Roasted veggies, sandwiches, salads are usually my go-to packed lunches in the winter time.Hey busy people, did you know there's a Healthyish bowl at Sweetgreen?\nPhoto by Alex LauAmanda ShineOccupation: Co-founder, The SettingSince your job is busy what do you usually eat for lunch? If I’m honest, sometimes lunch is an afterthought, so by 4 p.m. if we haven’t already eaten, we’ll order sushi from Blue Ribbon or salads from Sweetgreen for the team.  If we’re able to have a lunch meeting or some extra time to step out, I love Two Hands on Church Street. It’s around the corner from our office and the perfect midday treat. Their salads are so fresh and the ambiance is always clean and vibrant. I order The Brassicas Bowl [You can get the recipe for it here.]Do you eat it as efficiently as possible, or take a real break? It’s nice to properly have lunch when I’m able and I love places like Cafe Select or Sant Ambreous for a beautiful midday meal when the schedule allows. Lunch is a luxury sometimes and it can be the best kind of break even if it’s a great pasta at your desk... just because we usually order late into the day, doesn’t mean we don’t make sure to enjoy it!Explore Bon AppétitLunchRead MorecookingHow to Make a Week's Worth of Amazing Lunches in 2 HoursBy Chris Moroccocooking100 Lunch Ideas on What the Heck to Pack for WorkBy Alyse Whitneytest-kitchenThis Is the Most Substantial Lunch on the PlanetBy Alex BeggscookingThis Isn't Your Mom's Green Goddess SandwichBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-08", "author": ["Condé Nast", "Emily Sundberg"]}