{"id": "d59a666347a996409052a9ea8a958504", "url": "https://www.bonappetit.com/recipe/asparagus-with-parmesan-fonduta", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Asparagus With Parmesan Fonduta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueAsparagus With Parmesan FondutaBy Stefano SecchiMarch 15, 20225.0(2)Read ReviewsTriangleEmailPinterestPrintPhotograph by Paola + Murray, food styling by Rebecca Jurkevich, prop styling by Marina Bevilacqua EmailPinterestPrintEmailPinterestPrintWild asparagus is often paired with cheese sauce in the northwestern Italian region of Piedmont, where chef Stefano Secchi of New York City’s Rezdôra often finds inspiration. “When asparagus is coming up, it’s typically still colder at night, and the fonduta is nice and warming,” Secchi says. In this twist on a classic fonduta, Secchi emulsifies the sauce using the salted water from blanching asparagus instead of cream or butter. The heat from the water gently cooks the egg yolks and melts the Parmesan, forming a rich, velvety blanket to coat your vegetables.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonTongs$13 At AmazonBlender$32 At AmazonSilicone Spatula$13 At BA MarketIngredients4 servings1large bunch asparagus, woody ends trimmed3large egg yolks3½oz. Parmesan, finely grated3Tbsp. extra-virgin olive oilPreparationStep 1Cook asparagus in a large pot of boiling generously salted water until dark green and just crisp-tender, about 30 seconds for pencil-thin stalks and up to 2½ minutes for thicker stalks. Using tongs, immediately transfer asparagus to a large bowl of ice water; let sit 30 seconds. Transfer to a kitchen towel and pat dry; arrange on a platter. Measure 3 Tbsp. cooking liquid from pot and set aside in a small bowl.Step 2Blend egg yolks, Parmesan, and oil in a blender on low speed, scraping down sides as needed, until well combined. Increase speed to high and, with motor running, gradually drizzle in reserved hot cooking liquid; blend until smooth and emulsified. Immediately pour fonduta over asparagus.How would you rate Asparagus With Parmesan Fonduta?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleLoved this sauce over asparagus. I don’t think my cooking water was hot enough when added to the yolk-oil-parm mixture, so the Parmesan didn’t fully melt. The flavor was still divine. I’d take this over a hollandaise any day! Both from ease of preparation and flavor. \n\n We served it the asparagus with the porcini gnocchi, also from this issue, and the Parmesan fonduta that seeped over and mixed with the brown butter sage sauce was rich heaven. SpatulaCity123Los Angeles3/24/2022Explore Bon AppétitDinnerSide5 Ingredients or FewerEasyQuickWeeknight MealsGluten-FreeNut-FreeVegetarianItalianEuropeanAsparagusVegetableParmesanSpringSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Stefano Secchi"]}