{"id": "d5c35f973f5d74f003c755f80a616481", "url": "https://www.bonappetit.com/story/happy-hour-with-al-pimms-cup-recipe", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "A Pimm's Cup Recipe to Start Summer Off Right | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Pimm's Cup Recipe to Start Summer Off RightThis refreshing, low-ABV cocktail is what June is all about. Kick off summer with this big-batch Pimm's Cup recipe.By Al CullitonJune 6, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically's resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.You know what sounds like my ideal summer afternoon? Eating a ton of oysters and downing a few low-ABV, refreshing gin drinks that are a little bubbly, ever-so-slightly herbaceous, and adorned with lots of fruit and a shock of mint. Well that’s just the idea James Pimm had back in the 1820s (or the ’30s, you know how these historical things go…). The son of a farmer, he had gotten into the restaurant business and was running a popular London tavern serving mostly shellfish to his patrons. And the cocktail he created—the Pimm's Cup—has remained a warm-weather classic for nearly 200 years.Pimm used myriad elements to flavor his tavern's house “tonic” and to make it \"healthful\" (at least by 19th century standards), including quinine, which was used as an anti-malarial, citrus peels, herbs, spices and fruits. It was called Pimm’s No. 1 Cup. The “Cup” part  stands for fruit cup or summer cup, a category that essentially originated with Pimm’s. Fruit cups, like other liqueurs, tend not to be as high in alcohol as other spirits, and they’re meant to be combined with ice and a carbonated beverage, i.e. lemonade (in the UK, that means lemon-lime soda) or ginger beer. The drink is then garnished with abandon, as described above.SO. It's hot. You’re probably pretty thirsty by now. We're going to whip up a great big batch of refreshing Pimm's Cups—enough for around 12 servings—that would make ol' James proud, exactly the thing you want for your next sweaty backyard hang. Here’s the list. Go forth! Meet you back here when you’ve gathered your ingredients.Photo by Chelsie CraigShopping List1-1L bottle Pimm’s No. 11 cup London dry gin (optional, see below)8-10 lemonsSugar12 sprigs mint3 oranges1 pint strawberries1 English cucumberGinger beer or ginger ale (fancy and spicy is best!)First, make a syrup! Combine the peels of 2 oranges, 8 strawberries, quartered, and 2 cups sugar in a bowl. Muddle and mix around, about 3 minutes. Add 4 or 5 hearty sprigs of mint, stir, and gently muddle for another 30 seconds. Let mixture sit for 15 minutes. Meanwhile, boil some water. Add 2 cups boiling water to your fruity sugar mixture and stir well until sugar is completely dissolved. Strain out solids and reserve syrup in a jar. Let cool completely.Juice enough lemons to produce 1 cup of lemon juice. Fill a large glass pitcher with ice (or you can use a punch bowl, half-full of ice). Add 3 cups Pimm’s No. 1, 1 cup London dry gin, 1 cup freshly squeezed lemon juice, and 1 cup of your reserved syrup. (If you want it to be really low ABV, you can add 4 cups Pimm’s and omit the gin, but I always fortify mine with extra gin. I like the juniper flavor.) Stir well to combine. Throw in a few orange slices, quartered strawberries, and slices of cucumber. Give it another stir.What makes this both easy and fun is a sweet little garnish bar with more strawberries, orange slices and strips of cucumber. (Use a Y-peeler to get long, thin strips of cucumber that will wrap nicely around the inside of a glass). Also, MINT. Lots of beautiful mint.Pro tip: When storing mint in the fridge, roll into a damp paper towel. When ready to use on your Pimm’s bar, store it with the leaves down in a glass of fresh water. When you want to use a sprig, just remove from the glass, shake off water and give it a good slap. You should be doing this whenever you garnish with herbs!In addition to all your garnish, you’ll want to set out a bunch of glasses with your pitcher o’ Pimm’s and an ice bucket with tongs or a scoop. To serve, dole out approximately 4 oz. into a glass, add ice, top with spicy ginger beer and garnish with strawberries, mint, cucumber strips and orange slices. If you want to get crazy, you can skip the ginger beer and top with sparkling wine for a Pimm’s “Royale.” (That’s how we amend a cocktail’s name when some kind of soda is replaced with sparkling wine—and it’s almost always an excellent move.)Your Pimm’s Cups will look just perfect at your Wimbledon viewing party or, you know, next to your delivery pizza on the fire escape. Let’s raise a glass to James Pimm for this one, summer just wouldn’t be as good without the No. 1 Cup.Want to get into the tequila instead? This way:4 Easy Tequila (and Mezcal!) Cocktails, No Margarita Mix in SightGive these majestic agave spirits the respect they deserve.View StoryExplore Bon AppétitCocktailPimm'sGinFruitHappy Hour with AlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-06", "author": ["Condé Nast", "Al Culliton"]}