{"id": "d5db6bd33f0e38dcf73aa098afd9b8d6", "url": "https://www.bonappetit.com/story/stacy-madison-pita-chips", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "How Stacy Madison Became a Pita Chip Mogul | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Pita Chip Founder Did Things Differently—And Clearly It WorkedStacy Madison, the Stacy behind Stacy’s Pita Chips, on the unlikely business decisions that made her a mogul.By Amanda ShapiroFebruary 22, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis story is from 13 Ways to Launch the Food Business of Your Dreams, where women entrepreneurs share their experiences and best advice on turning a passion for food into a career.When Stacy Madison started a sandwich cart with her business partner in 1997, she thought she’d turn it into a restaurant someday. But it was the free chips she passed out (cut and baked from the previous day’s pita bread) that kept her customers lining up. Within months, the food cart was in the garage and Stacy’s Pita Chips was a budding wholesale business, eventually hitting the shelves of Trader Joe’s and other national grocery chains. Since selling Stacy’s to PepsiCo in 2006, Madison has started two more food ventures, including, most recently, a line of energy bars, BeBold, and is the spokesperson for Stacy’s Rise Project, an organization that supports aspiring women food entrepreneurs—like Sophia Maroon of Dress It Up salad dressings. Amanda Shapiro: How did you finance Stacy’s Pita Chips at the beginning? How did that change as the company grew?Stacy Madison: We self-funded all the way through. We didn’t want to give up equity to investors, and luckily we never had to. We did the credit card shuffle, taking advantage of introductory rates and keeping track of our debt. We also had $100K in student loans to manage. As we grew, we took out bank loans and lines of credit to do things like buy a building and a bread production line. You’re chasing money at first, but once you start generating, the banks come to you.What’s one thing you did differently from your competitors that paid off?We knew we couldn’t compete with a $3 family-size bag of tortilla chips, so we got Stacy’s Pita Chips placed in the deli section instead of the chip aisle. We wanted to be seen and sampled, so we worked with deli managers to set up demos. We drew more customers to the delis, and we put a higher value on our product.Tell me about the decision to sell Stacy’s Pita Chips. Was it a tough call?We had no intention of selling. We were making money doing what we loved to do every day. But as it grew, the company started to run us rather than us running the company. I had kids. My business partner Mark wanted to travel. Meanwhile, these global companies were knocking on our door. I really went through a grieving process: excitement, fear, anger, loneliness, frustration, sadness, loss, and, eventually, gratitude and starting over.Having started two more companies now, what’s one thing that’s gotten easier and one thing that’s harder?I know how to assemble a trustworthy team, and I understand the ups and downs of being a business owner. I’ve become a professional at crisis intervention. The harder part is [managing] the unrealistic expectations. After Stacy’s, I feel like I have to create another successful company overnight. I feel that pressure from retailers, wholesalers, distributors, even myself.What’s one thing that fledgling entrepreneurs don’t think about enough?Cash. Everything takes twice as long and is twice as expensive as you anticipated. Know what you have in the bank, and make sure it’s enough.What’s one rule you live by?No meetings after 4 p.m. But we do break that rule sometimes.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-18", "author": ["Condé Nast", "Amanda Shapiro"]}