{"id": "d5f713e89a6915d3b06910a8e466aafa", "url": "https://www.bonappetit.com/story/dinner-party-in-isolation", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "I Threw a Dinner Party in Isolation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusHow I Threw a Dinner Party in IsolationYou don’t need a reason to dress up and have dinner tonight.By Christina ChaeyApril 25, 2020FacebookTwitterEmailPhoto by Alex Lau FacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Dear Healthyish readers,Forty-three days ago, my roommate Emma brought home a case of wine. This was back when plenty of us were still going out to restaurants and bars, and we were all just beginning to ask our friends if they knew what “social distancing” meant. I’ll tell you what I thought it meant at the time: that we wouldn’t be able to go out to eat for a little while, but that we could most certainly keep throwing big, all-night dinner parties in the otherwise-uncertain interim; hence the wine. Less than 24 hours later, both of my roommates and I had all read the same somber news articles that made it extremely clear that we wouldn’t be having anyone over—possibly for a very long time.I cried that night after the three of us agreed it was best to not have people over anymore for the time being. I felt stupid for grieving over something so trivial—and something that hadn’t even happened yet—while also already knowing that I would miss these ordinary and amazing evenings, spent with friends in our home, more than anything.Sure, we’ve been finding ways to get creative about hanging out without actually hanging out—I’ve partaken in FaceTime cooking lessons and socially distant birthday parties, and am currently on a dizzyingly long email thread about the agenda for a virtual bachelorette party I’m “attending” next weekend—but I don’t have to tell you it’s just not the same when you can’t bring the party home.A little apéro to start things off\nI’m not sure why it took us a month and a half of isolation to come up with the idea, but a couple of Sundays ago, while many others were logging into virtual Passover seders or orchestrating Easter egg hunts over Zoom, we decided we would throw a dinner party for ourselves. A proper one, with candles and runny cheese and crackers and dessert.A couple of days before, we started riffing on menu ideas centered around the beautiful whole branzino waiting in the freezer. (Have I mentioned how much I love Pierless Fish? If you live in NYC, you need to get on this.) I was fresh off my weekly grocery shop, and I was feeling flush. There would be a big leafy salad with marinated golden beets and crunchy walnuts. A cheesy, greens-stuffed galette like a cross between torta pasqualina (a savory Easter tart) and creamed spinach (a food that needs no holiday to show up at the table, imo). And, this being a dinner party for the times, there would obviously be beans.Pillowy meringues filled with lemon curd for dessert\nOn the morning of the big day, I walked into the kitchen to find Emma pulling trays of tall, crisp meringues out of the oven to serve for dessert with tart lemon curd spooned in to make them look like sunny eggs. The rest of the day was a blur of knives chopping and burners going and the oven humming, our spirits and energy high. We dressed up and put on lipstick but stayed in our house socks and slippers, and the combo felt weird and right. We christened our little balcony with our first outdoor happy hour of the year. We feasted on fish and beans and greens and ate too many meringues and opened one more bottle of wine than we needed to. I melted into bed by midnight, full in every sense, happier than I knew I could be right now.While writing this, I texted Emma and Becca: “Do you guys remember Easter? Because it feels like it was several lifetimes ago.” Becca replied, “Yes, it was the best day. And perhaps we should have Easter again.”We do still have nine bottles of wine left.(Dinner) party on,Christina ChaeyAssociate editorP.S. Writing this reminded me of Rachel Khong’s absolutely wonderful essay about opening a pretend restaurant in her kitchen. She served “pepites de chocolate” (chocolate chips) for dessert served in a glass dish, and if you don’t find that impossibly charming, I don’t know what to do with you.Explore Bon AppétitHealthyishWhat's Chaey Cooking?essayRead MoreLifestyleHow to Meal Prep for One But Never Eat the Same Thing TwiceBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-25", "author": ["Condé Nast", "Christina Chaey"]}