{"id": "d5fc9fc199262a84cb6f1d9b97d5ad05", "url": "https://www.bonappetit.com/story/milk-braised-pork-shoulder", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "This Milk-Braised Pork is The Tenderest Way to Braise | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingGet Over Your Fear of Curdled Milk and Make This Tenderest of Pork BraisesMilk-braised pork sounds so wrong, but it’s so, so right.By Alex BeggsNovember 28, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailThe milk is curdled and everything is going to be okay. I promise! Because, despite all inclinations to the contrary—including memories of that science fair experiment where I tried to keep roses alive in milk, and just general visual repulsion—pork braised in milk is absolutely wonderful. It’s tender, flavorful, rich, and comforting. Don’t trust me? Ask an Italian grandma.Maiale al Latte is a classic Italian dish that utilizes the lactic acid in milk to break down a fatty hunk of pork. It’s hard for some of us (non-Italians) to wrap our heads around this because we’re so used to the French style of braising: throwing stock and wine into a pot. But if you’re surrounded by farmland, cows, and pigs, Maiale al Latte starts to make a whole lot of sense.Andy Baraghani, who developed this recipe, first had Maiale al Latte as a young cook at Chez Panisse. A guest chef was throwing together a meal using leftover pork shoulder and a pot-full of local milk, the really good stuff. The dish was simple, and “hard to f*ck up,” which is how Andy, inexperienced and eager, was assigned to look after it. His recipe keeps it unfussy, infusing the milk with garlic, sage, and lemon. Let’s take a closer look.The curds were strained for this photo, a purely aesthetic decision!\nPhoto by Chelsie Craig, Food Styling by Kate BuckensThe aromaticsEverything comes together quick and easy. First you brown the pork shoulder and halved head of garlic. Then you wipe out the pot and add in your aromatics and milk. The sage brings a wintry herbal note, chile de arbol (or red pepper flakes) add a level of spice, big strips of lemon peel help the milk curdle and brightens up against the pork fat, and garlic is garlic. We keep the whole head of it, cut in half, rather than ask you to peel a bunch of cloves. When you serve it, squeeze the garlic out all over the pork, or on toast. “It’s not a delicate dish,” said Andy. “You can interact with it. Eat the garlic. Take the herbs out.”The milkIt’s gotta be whole, friends. Not skim, and definitely not oat. “Italy doesn’t mess with skim milk,” Andy told me. “You need the flavor from whole milk to stand up to the pork, you want a sauce with flavor.” We can’t emphasize that enough. But we’ll try, with italics. Flavor. It’s not an expensive dish at the end of the day, so splurge for the best milk you can find.The...curdled milkWhen it curdles, 2 ½ to 3 hours uncovered in the oven later, the curds take on this smooth, ricotta-like texture and are packed with, that’s right, flavor. You can strain them out for a smooth sauce, but we prefer to serve them on the meat—call it “rustic”—to spread alongside the melted garlic. At one point Andy referred to them as “dairy blobs,” which is nice.Meat notesYou CAN overcook the pork, so make sure to turn it in the oven every thirty minutes, and stop when a paring knife can cut through. You want meat you can slice—not shreddy, barbecue pork. You can also swap lamb shoulder, lamb shank, veal shoulder, or chicken legs in place of pork shoulder, per Andy. Just keep an eye on cooking time (chicken will be ready faster than those shoulder cuts).Creamy polenta makes for an extra decadent pairing.\nAlex LauWhat to serve on the sideCarla Lalli Music’s creamy polenta, to go full creamy-on-creamy. Or a bracing chicory salad to “keep you from palate fatigue,” as people who write about food too much would say. At Chez Panisse, they made a fried sage salsa verde, which Andy has a recipe for here. That’s how he’d do it at home, he said, to cut through the richness of the pork.Get the recipe:Maiale al Latte (Milk-Braised Pork)This traditional Italian braised pork roast may not be one of the most photogenic dishes you’ll ever make, but it sure is one of the tastiest.View RecipeExplore Bon AppétitPork ShoulderBraiseMilkWinterItalianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-27", "author": ["Condé Nast", "Alex Beggs"]}