{"id": "d6047d6d4cee2976250c7346aa20459d", "url": "https://www.bonappetit.com/story/sandwich-hag-dallas", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Sandwich Hag Is Teaching Dallas How to Hire Differently | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Vietnamese Sandwich Shop Teaching Dallas How to Hire DifferentlyAt Sandwich Hag, Reyna Duong leads a team of people with different abilities, including those with Down syndrome, and she’s paving the way for more restauranteurs to do the same.By Priya KrishnaSeptember 12, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn 1978 the chef Reyna Duong, along with her parents and 10 siblings, fled their fishing village in southwestern Vietnam. Duong was just a year old when she boarded the boat in the middle of the night, escaping the takeover of the communist regime. The family eventually landed in Long Beach, California.It may seem like escaping a war as a baby would be the most defining aspect of Duong’s (or anyone’s) identity. But her life has been equally shaped by what happened after: the arrival of her youngest brother, Sang Duong.Sang has Down syndrome. He was born in Long Beach, and Duong spent her childhood taking care of him alongside her parents, who opened their own clothing manufacturing business. At age 22 she moved to Dallas, initially working in the corporate world but ultimately becoming the owner of a Vietnamese sandwich shop, Sandwich Hag.Sang is the reason she opened Sandwich Hag in Dallas, a restaurant that, in a city often ignored for its food offerings, is serving a dazzling take on Vietnamese home cooking. Thirty to forty percent of her part-time employee force, at the restaurant and for events, encompasses individuals with different abilities, including those with Down syndrome.Duong initially hated cooking but had vivid childhood food memories of her mom making spaghetti seasoned with fish sauce, and bánh tét, sticky rice wrapped in banana leaves and filled with mung beans or plantains. “She would hold yarn with her teeth and stretch and wrap the banana leaves,” she recalls. “Each one hung like a pair of…” she pauses. “What’s that? Bruce Lee?” she pauses. “Oh! Nunchucks. I mean, the talent of this woman.”But the food memories are intertwined with difficult ones. Her parents did not understand how to handle a child with Down syndrome (on top of 11 others), and her father had a gambling addiction. He was physically abusive to Sang, she says, her tone slowing and her bubbly energy coming to a halt.Life in Long Beach was chaotic and crowded. Duong’s parents were busy running their business, and they enlisted the help of their kids to stitch shoulder pads and steam garments. “I wanted to go outside and play all the time,” she adds, “but I was expected to be more responsible.” She didn’t even realize until later in life that someone close to her had sexually abused her as a kid—she brushed any feelings of discomfort under the rug. She was more concerned for her brother Sang.“There were moments where I could tell they were embarrassed of my brother,” Duong says. “That was tough for my dad because in our community, it is a lot of saving face,” or wanting to create a veneer of stability in front of others.When her parents were in their 80s, Duong assumed custody of Sang, after her father told her that Sang would become the state’s responsibility after he died. For the first time, Sang shared with her the extent of the physical abuse he had endured at his father’s hands.Duong’s parents both passed within the next two years. When Sang came to live with her in Dallas, the two were still in mourning. To honor their mother’s memory, Duong cooked Vietnamese food. She made bun thit xao, thinly sliced pork with noodles, and fish sauce spaghetti. “When I would make my curry, every time, he’d go, ‘Oh, Mom made that.’ ”Cooking for Sang, she realized that working in food was far more exciting to her than the corporate life. So she and her partner, Arthur Andrade, rented a tiny old cigar lounge in the Cedars district surrounded by yards of asphalt. Neither of them had any restaurant experience.The homemade pork sausage banh mi.\nPhoto by Alex LauShe put together a short menu of everything-from-scratch Vietnamese staples: banh mi stuffed with a homemade pork sausage patty that sing with honey and fish sauce; a silky turmeric and coconut milk stew slow-cooked with onions, carrots, bell peppers, and chicken thighs; and tightly wrapped spring rolls stuffed with carrots, radishes, and herbs.“I was advised to remove my ‘no modifications’ policy and told that Dallas may not be ready for fish sauce,” she says. “I was like, ‘Fuck off.’”She named the place “Sandwich Hag”—the first word a reference to the menu’s signature banh mi, and “hag” to take back the pejorative word often used to describe women.  She decorated the patio with string lights, botanical artwork, and graffiti-coated chairs. The restaurant became a walk-up window attached to a small kitchen.Most important: She decided to bring on Sang to help maintain the patio and expedite orders, and to hire others like him.“I was going to build a restaurant and create a culture where Sang was right by my side,” she says. “I told him, ‘This is a restaurant; you’ve got to learn and act right and be appropriate.’ I held him accountable just like everyone else.”On a recent afternoon in Sandwich Hag’s tiny kitchen, Duong’s jet-black hair was pulled back tightly with a hair clip, showing off her chili sauce earrings and black thickly rimmed glasses. She toasted crackly baguettes from a Vietnamese bakery in nearby Garland, TX in the old Quiznos toaster she and Andrade found at an auction, and mixed up the pungent garlic aioli for the banh mi.Creating an environment where Sang and other differently abled people could succeed required making a few changes. For example, because Sang can’t read well, she uses a color-coding system to help him identify customers’ drink orders (coconut coffee is pink, for instance). She simplifies the vocabulary she uses in the kitchen—when a delivery order is ready, she says, “The order is ready. Hit the green button,” and Sang now knows to respond with “Mark as ready?” “I pay attention to the language that works and tweak our process,” she says. Sang sometimes has trouble with numbers, so instead of telling him the number of baguettes to place in the toaster, she will say “One,” and Sang will respond with “One” and put the baguettes in one at a time until Duong tells him to stop.But she says Sang’s energetic personality is a perfect fit for the restaurant business. “What some of my family members saw as a burden, I saw in Sang as a positive,” she says. “If he doesn’t like something, he will tell you. He always says, ‘Yes, chef.’ He will always remind new hires to put on gloves and wash hands. He is dedicated, and he is passionate. I’ll be trying to close the restaurant and he wants to mop.”Sang’s uniform consists of black glasses similar to his sister’s and a red bandana wrapped around his head. In person he’s super cheerful, a go-getter. “I love peeling ginger, mopping, sweeping, talking to people,” he says.To Duong, food is only one part of Sandwich Hag’s mission. She uses the restaurant to advocate for individuals like Sang. She works with an organization called LaunchAbility, a career-services center for people with different abilities, to recruit employees. Each year she hosts a party at the restaurant for World Down Syndrome Day, where she invites neighboring vendors and a local brewery to raise awareness for the cause. She helps cater the Community Ball, an annual event for the nonprofit My Possibilities, an educational program that Sang is currently enrolled in. But she thinks the most important thing she can do is to put Sang at the front and center of the restaurant, to normalize his presence.“We want to create hope for young children with Down syndrome, to see that Sang is working here,” she says. “He is all over our social media. He is talking to customers.”There are challenges to having Sang and others with disabilities work at the restaurant, Duong says. She has to be very patient, and customers sometimes get annoyed that orders may take longer to come out.Neither the state of Texas nor the federal government are particularly friendly toward people of all disabilities either. Mountains of paperwork and bureaucracy make it extremely difficult for even the most informed individuals to navigate career paths for disabled family members, Duong tells me. Most of all, disabled persons aren’t allowed to earn their food handler’s certificate, meaning Sang can’t make the curry or slice the cucumbers for the banh mi. It’s a law that befuddles Duong. \"Sang is so clean, he always uses gloves,” she says. “I can’t wait for the city of Dallas to get its act together.”She believes change can start with the restaurant industry, a business where there is a severe labor shortage right now. “Seeing how able and smart and intuitive and passionate Sang is, I feel that it is an oversight for companies not to recognize that,” she says. “I am hoping to break the barrier of discomfort.”She knows that she is fighting an uphill battle taking on these issues as a restaurant operator in a conservative state like Texas. But the glowing reviews and wraparound lines are the surest indication that what she’s doing is working.“If you eat my food, my food will speak for itself,” she says. “But Sang can’t speak for himself, and I can’t keep quiet. I don’t know any other way to be the example except to just do it, you know?”Explore Bon AppétitRestaurants + TravelDallasChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-12", "author": ["Condé Nast", "Priya Krishna"]}