{"id": "d6045e43e10e5fcb0fb93e71836da842", "url": "https://www.bonappetit.com/recipe/smashed-cucumber-salad-with-zaatar-and-feta", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Smashed Cucumber Salad with Za'atar and Feta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueSmashed Cucumber Salad with Za'atar and FetaBy Chris MoroccoMarch 20, 20185.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintMagic happens when toasted garlic oil meets fragrant za’atar. But if you don’t have za’atar on hand, dried mint is equally delicious infused into hot oil.Ingredients4 servings5mini seedless or Persian cucumbers or 1 small English hothouse cucumber (about 12 oz.)Kosher salt2garlic cloves, lightly smashed4Tbsp. extra-virgin olive oil2Tbsp. za’atar or 1 Tbsp. dried mint and 1 Tbsp. sesame seeds½tsp. crushed red pepper flakes2Tbsp. fresh lime juiceCrumbled feta (for serving)PreparationStep 1Gently smash cucumbers with a rolling pin or the back of a heavy knife just to break open. Tear into irregular 2\" pieces and place in a medium bowl; season lightly with salt. Let sit at least 5 minutes and up to 1 hour.Step 2Meanwhile, cook garlic and oil in a small saucepan or skillet over medium-low heat, turning garlic once, until golden brown and very fragrant, 5–7 minutes. Add za’atar and red pepper flakes and remove from heat. Let cool until just warm and stir in lime juice; season dressing with salt. Transfer to a medium bowl.Step 3Drain cucumbers, discarding any liquid they have released. Add to bowl with dressing and toss several times to coat. Top with feta.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Smashed Cucumber Salad with Za'atar and Feta?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleSo many cucumbers this time of year.  Delicious summer salad to go along with anything on the grill.Minnesota8/1/2020Loved this! Would use less lime next time it was a little bit too acidic for me. Anonymous12/4/2019the Smashed Cucumber with Za'atar recipe as written here is different from the Smashed Cucumber Salad recipe shown in the accompanying video.  the latter one has chili oil instead of garlic oil + za'atar, and there are other differences.  luckily, i like both versions.hollis5Vero Beach, FL3/27/2019I made with one large shallot thinly sliced instead of the garlic. Fantastic.  A great summer side dish, which I'll make again & again. Boston MA 7/8/2018Explore Bon AppétitSaladCucumberVegetableZa'atarHerbs & SpicesFetaCheeseQuickEasySideGluten-FreeVegetarianKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Chris Morocco"]}