{"id": "d60e4090af389a3a514db28304fae527", "url": "https://www.bonappetit.com/story/brandoni-pepperoni-pizza-los-angeles", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "Everything About Brandoni Pepperoni's Pizzas Scream Los Angeles | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsEverything About Brandoni Pepperoni’s Pizzas Scream Los AngelesChef Brandon Gray breaks down one of his pop-up’s most popular pies: the bold, flavor-packed Colors.By Elyse InamineMarch 26, 2021FacebookTwitterEmailPhoto by Dylan + JeniFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s...well...dish that we’re obsessed with right now.“I’ve lived in a 10-mile bubble my entire life,” says chef Brandon Gray from his home in the Baldwin Hills neighborhood of Los Angeles. He begins to map out the milestones of his life in proximity to where he lives now. He’s three blocks from his first high school. Two and a half miles from the high school he graduated from. Three miles from his childhood home. “Everything I know is L.A.,” Gray continues. “L.A. is me, and food is the best representation of me.”Enter Brandoni Pepperoni, Gray’s pizza pop-up that’s a cheese-covered homage to his hometown, from the farmers market ingredients to the West Coast hip-hop-inspired names. He started making pizzas for fun, mainly at the request of friends, but ever since he opened orders to the public, the pop-up has taken a life of its own. Perhaps that’s because of the branding (trying saying Brandoni Pepperoni without smiling), or maybe it’s because of the giddy-making magic you feel when you place the order via text and pick it up at Gray’s home. But it’s definitely because of Gray’s technique, honed after years working in restaurant kitchens like Providence and Trois Mec; proudly Californian provenance; and a little attitude (recognize the song titles on the menu?). Here he explains everything that goes into one of his best-selling pizzas: Colors.The DoughLike many iconic hip-hop tracks, this pizza dough is the product of collaboration. Gray hit up chefs and pandemic-era sourdough enthusiasts for pointers on how to perfect his dough. The current iteration is made up of two Italian flours—very fine Tipo 00 and stone-ground Buratto—and one local flour, Rouge de Bordeaux from heritage grain farm Tehachapi Grain Project, for extra wheat-y flavor. After the flours are mixed with water and yeast, the dough is slowly fermented for 24 hours. The result is a pizza crust with just the right amount of chew and crackle.The SauceBianco DiNapoli tomatoes are cooked down for hours with dried oregano and thyme from Kandarian Organic Farms in San Luis Obispo; “the best garlic in the world” from Milliken Family Farms in Santa Barbara; and, in lieu of the usual red pepper flakes, Thai chile powder. “It adds a unique spiciness and a smoky vibe,” Gray explains. “This is me going against the grain.”The VegColeman Family Farms in Carpinteria supplies about 70 percent of the produce for Brandoni Pepperoni, but Gray’s got a soft spot for the farm’s extra leafy broccolini. “You never see broccolini with leaves—some farmers tear them off—but Coleman keeps them on and I love them,” he says. “They crisp up like chips in the oven and lend an earthy flavor.”The SausageThis is not your classic Italian sausage. “This is my interpretation of Jimmy Dean’s breakfast sausage,” Gray says. “I grew up on that.” Maple syrup gives this garlicky, fennel-y, porky mix that same nostalgic sweetness. It also balances out the sausage’s triple dose of heat: Kashmiri chile powder, smoked paprika, and more Thai chile powder.The CheeseGray ventured beyond state lines for Grande, the “crème de la crème” of mozzarella made in Wisconsin.The Finishing Touches“Ten years ago, people were putting edible flowers on food to make it look pretty, but they served no other purpose,” Gray explains. “But here they emphasize something.” The yellow broccolini flowers echo the bitterness of the broccolini, while the fresh cucumber-like flavor of the purple borage plays off that sharpness. A drizzle of garlic oil, made by poaching Milliken Family Farm’s finest in Buon Gusto Farms olive oil, finishes Colors, which is named after the famed Ice-T song. “It represents my personality,” Gray says. “Eating this, you’re like, ‘Pow, bang, boom.’”Explore Bon AppétitDish DecodedLos AngelesRead MorerestaurantsAt Charleston’s Jackrabbit Filly, Here's How to Eat Your Weight in LuckBy Jenny LiaorestaurantsEverything That Goes Into a Hot, Luscious Bowl of Mohinga at Brooklyn’s RangoonBy Hilary CadiganrestaurantsHow Do I Love Thee, Chinese Sponge Cake? Let Me Count the LayersBy Rachel KartenrestaurantsTexas Meets China Meets Vietnam at Blood Bros. BBQBy Daniel VaughnRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-25", "author": ["Condé Nast", "Elyse Inamine"]}