{"id": "d62c67b725d9f648145c5af45ceea520", "url": "https://www.bonappetit.com/recipe/whole-grain-pancakes-with-blackberries", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Whole Grain Pancakes with Blackberries Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueWhole Grain Pancakes with BlackberriesBy Chris MoroccoMarch 20, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWith all due respect to diner breakfasts and box mixes, the average pancake is about as satisfying as a bag of marshmallows. We’ll take ours skillet-size, burnished from whole wheat flour and studded with cooked grains, because we want them flavorful and with a hardy texture.Ingredients4 servings¾cup whole wheat flour½cup all-purpose flour2Tbsp. sugar1tsp. baking powder1tsp. baking soda1tsp. kosher salt1large egg1½cups buttermilk2cups mixed cooked whole grains (such as barley, farro, rye, spelt, kamut, and/or quinoa)Melted unsalted butter (for pan)Room-temperature butter, fresh blackberries, and pure maple syrup (for serving)PreparationStep 1Whisk whole wheat and all-purpose flours, sugar, baking powder, baking soda, and salt in a large bowl. Whisk egg and buttermilk in a medium bowl just to incorporate. Using a few swift strokes, whisk egg mixture into dry ingredients just to combine. Stir grains into batter (you can pulse the grains in a food processor first if you prefer them in smaller pieces).Step 2Heat a large nonstick skillet over medium-high. Lightly brush with butter. Add half of batter to skillet, spreading into an even layer as wide as the skillet. Cook pancake until bubbles have formed and broken across the entire surface and underside is golden brown, about 5 minutes. Using 2 spatulas (or sliding onto a flat plate before inverting back into skillet), flip pancake. Continue to cook until lightly browned underneath, about 1 minute. Transfer pancake to a plate. Repeat with remaining batter.Step 3Serve pancakes topped with butter, fruit, and syrup.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Whole Grain Pancakes with Blackberries?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleAmazing! Great texture and taste. I used a commercial cereal mix of rolled oats, red quinoa, chia seeds, and flax. This is now the top (only?) pancake at our home.LynneRochester, NY9/23/2021These were delicious!  Used a mix of millet, quinoa and rice that was leftover in the fridge.  Loved the grainy addition to the solid buttermilk recipe.CookinVTVermont4/26/2020Explore Bon AppétitPancakeFarroRice & GrainsBarleySpeltQuinoaBlackberryBerryFruitWhole Wheat FlourFlourButtermilkOther IngredientsEasyQuickNut-FreeHealthyishBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Chris Morocco"]}