{"id": "d63a98a08c578657142bc200496a2e60", "url": "https://www.bonappetit.com/recipe/caramelized-shallot-dip-with-toasted-everything-bagel-topping", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Caramelized Shallot Dip with Toasted Everything Bagel Topping Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDCaramelized Shallot Dip with Toasted Everything Bagel ToppingSponsored by Stacy's®FacebookPinterestTwitterEmailThis salty, summertime dip pairs perfectly with Stacy’s® Simply Naked® Pita Chips.PrintIngredientsFor the shallots:5 large shallots, peeled and sliced1 tablespoon salted butter1 teaspoon granulated white sugar4 cloves garlic, minced2 teaspoons sherry vinegar2 tablespoons parsley, finely chopped (one pinch reserved for garnish)2 tablespoons chives, thinly sliced (one pinch reserved for garnish)pinch of kosher saltpinch of black pepperFor the everything bagel topping:1 tablespoon sesame seeds1 tablespoon poppy seeds1 tablespoon dried minced onion flakes1 tablespoon dried minced garlic flakes1 tablespoon caraway seeds, (note: if you can't find caraway seeds, substitute with dill or fennel seeds, or simply omit)For the dip:1 16oz. sour cream, (alternatively, you may use extra thick, strained Greek yogurt)1 bag Stacy’s® Simply Naked® Pita ChipsRecipe PreparationHeat a medium pan over medium heat. Melt the butter, then add the shallots. Sprinkle the sugar over the shallots and season generously with salt and pepper, and stir to combine.Cook, stirring occasionally, for 15-20 minutes, until shallots are soft and deeply golden. Adjust heat as needed between medium and medium-low to keep from scorching.Once shallots are deeply browned, add the garlic and cook 1-2 minutes, until just softened.Deglaze the pan with the sherry vinegar, scraping up any browned bits from the bottom of the pan. Once the vinegar has evaporated, stir once more to incorporate completely. Turn off heat.Stir in chopped parsley and chives, reserving a pinch for garnish. Let shallots cool completely.Mix all topping ingredients together in a small bowl. Heat a small pan on medium-low heat.Toast the mixture in the pan, tossing frequently, 2-3 minutes, until fragrant and lightly browned.Transfer the mixture immediately to a sheet pan and spread out to cool.Fold the cooled caramelized shallots into the sour cream and stir to mix thoroughly. Season with salt and pepper. Top generously with the everything bagel mix, reserved parsley, and chives. Enjoy with Stacy’s® Simply Naked® Pita Chips.Sponsored by Stacy's®GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitStacy's® Pita ChipsSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Stacy'S"]}