{"id": "d6401cdd4e04e60803a2d9bcd3a44e0e", "url": "https://www.bonappetit.com/story/new-restaurant-pancakes", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "These Restaurant Pancakes Go Way Beyond Buttermilk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThese Restaurant Pancakes Go Way Beyond ButtermilkClassic ’cakes are great and all, but they’re not the only option. Here’s how chefs are reinventing pancakes (Coffee flour! Sourdough starter! Vegetables!).By Bon AppétitSeptember 25, 2018FacebookTwitterEmailPhoto by David AlvaradoFacebookTwitterEmailNo disrespect to that box of Bisquick you grew up with, but did you know you can make pancakes with sourdough and buckwheat and even coffee flour? Chefs do. Across the country, they’re upping their breakfast games, transforming the ho-hum flapjack into a must-order item. We talked to six chefs who are making versions we’d love to wake up to any day about their secret weapon ingredients.Barney Hannagan, Chef, Proud Mary, Portland, OR“Our signature hotcake uses a batter I’ve been perfecting with another chef since 2013. We make our batter fresh to keep it fluffier and use a self rising flour to make them more consistent. We throw a cookie crumb on there, shower it with edible flowers like nasturtium to give pops of those pinks and purples to go with the strawberries, and finish it off with a dulce de leche whipped ricotta.” (This is the pancake pictured above.)Alex Manley, Director of Baking and Pastry, June’s All Day, Austin“We love leavening batter with our mother, a wild yeast starter we use for our country loaves. Sourdough pancakes have a nice tang, are thinner than classic buttermilk pancakes, and have a texture that’s less cakey and more airy.”Emily Yuen, Executive Chef, Bessou, NYC“To make our Japanese-style pancakes nice and tall, we whip egg whites and fold them into the batter. I love how they get crispy edges from the sizzling pan we pour the batter into yet remain light and fluffy on the inside.”Roxana Jullapat, Baker and Co-Owner, Friends & Family, L.A.“Because it’s naturally free of gluten, buckwheat is easy to stir in vigorously without making tough pancakes; in fact, the buckwheat makes them quite tender. The flavor is subtle and aromatic but also has a nice earthiness.”The buckwheat pancake from Friends & Family gets drizzled with maple syrup.\nPhoto by Dylan + JeniJason Wilson, Chef-Owner, The Lakehouse, Bellevue, WA“We make our pancakes with coffee flour, which is made by milling the usually discarded coffee fruit into a powder. It doesn’t taste like coffee—there are more floral, citrus, and roasted-fruit notes. I pair it with cocoa powder for rich flavor plus vitamins, fiber, and protein.”Jaime Young, Chef and Partner, Sunday in Brooklyn, Brooklyn“Adding malt powder (made from roasted barley) to our pancakes gives them a deep caramelized flavor profile. We top the pancakes with hazelnut maple praline sauce and brown butter to accentuate those caramelized notes.”Guy Turland, Chef-Owner, Bondi Harvest, Santa Monica, CA“We put puréed vegetables like butternut squash and pumpkin into our batter in the fall and zucchini in the summer. Anything with natural sweetness works. We combine it with kefir for tang and a little extra rise.”Now go ahead and make some pancakes yourself:Explore Bon AppétitRestaurantsPancakeTrends + NewsRead MorecookingThese Ham and Cheese Waffles Wake Me Up Inside (Yes, Like the Song)By Alyse WhitneycookingA Whole Grain Pancakes Recipe That Won't Give You a Brunch HangoverBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-25", "author": ["Condé Nast", "Bon Appétit"]}