{"id": "d65eb252cedd45b3fab5f6d60007a013", "url": "https://www.bonappetit.com/story/rent-week-chipotle-chicken-quesadilla-recipe", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "This Chicken Quesadilla Recipe Is All Grown Up and Just Right for Rent Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Rent Week Chipotle Chicken Quesadilla Recipe Is All Grown UpForget the dorm room quesadillas of your past. There's a new sheriff in town.By Alex DelanyMarch 28, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailDid you know the plural version of spectrum is spectra? I didn’t. But then I decided to write about spectrums in the introduction to this installment of Rent Week, and lo and behold, I learned that spectrums isn’t a real word. Wild stuff. Now I’m going to use spectra to linguistically flex on all my friends. But here’s the point: People talk about all different spectra. There’s the UV Spectrum. There’s the Human Sexuality Spectrum and the Electromagnetic Spectrum. There’s the Political Spectrum. There’s the Radio Spectrum and the How Many Drinks Should You Have on a First Date Spectrum. They’re all very important spectra, but in all this spectra talk and debate, we habitually overlook one of the most important spectra in existence.Have you ever heard of the Homemade Quesadilla Spectrum?Yeah. Didn’t think so. But that’s honestly fine. The Homemade Quesadilla Spectrum functions like any other spectrum. There are two extremes, with an infinite number of points falling in between them. At its simplest, the Homemade Quesadilla Spectrum looks like this:You get it. It’s a spectrum. But it’s an interesting spectrum, because a seemingly simple food such as the quesadilla actually has many different factors that determine where on the spectrum it falls. Good cheese, a hot skillet, and quality tortillas push it toward the Exquisite end. Lack of sauce, a microwave, or dry, poorly-seasoned meat can push it toward the Terrible end.For a portion of my life, my feet were planted firmly at the Terrible end of the spectrum. We’ll call this phase college. The quesadillas I made were filled with dry, cubed chicken breast, whatever shredded cheese was already inside my mini-fridge or the cheapest at the closest convenience store, and tortillas that really shouldn’t have been called tortillas. I made quesadillas like this because I didn't know any better. I hadn’t eaten the great quesadillas of my lifetime, and I wasn’t an exceptional cook.But then I learned to cook. And I had the good fortune to eat some really great quesadillas. And the state of my quesadilla affairs became more clear. I needed to start moving toward the opposite end of the spectrum. I didn’t want to lose what the quesadilla had been to me—the greatest 3 a.m.  drunk-snack of all time—but I wanted to honor it in a more serious way. Which is how I ended up with this month’s Rent Week recipe: a braised chipotle chicken and charred scallion quesadilla. It’s exactly what I want when I'm craving the dorm room microwave special, but more refined and infinitely more delicious.So it’s time to follow me on this journey. Smash the play button on this Full Spectrum playlist I made you (with a full spectrum of vibes and completely free of charge), and get ready to move past those dorm room quesadillas.You start with the chicken. In order to really bring it, you want your chicken to be tender, saucy, and flavorful. You can’t have a truly top-notch chicken quesadilla if the chicken stinks. That’s why I braise chicken thighs in crushed tomatoes for my quesadillas. You might think that’s a bit involved, but braising chicken thighs takes way less time that you might think.Season 4 bone-in, skin-on chicken thighs with kosher salt and chipotle chile powder. Place them in a Dutch oven, skin-side down, and turn your stove to medium-high heat. You want to render the fat and brown the skin of the chicken. Let them sear without touching them for about 8 minutes. Flip a thigh to check your progress. If it easily releases from the pan, and the skin is browned and crispy, flip them all. Let the non-skin side cook for 4 minutes, and remove the thighs from the pan. They’re not fully cooked, but you’ll come back to them later.Charred scallions will always make things better.\nNow you have a nice bit of chicken fat in your Dutch oven. Add 4 smashed and peeled garlic cloves and 1 white onion, cut into six wedges, to the Dutch oven. Season with salt and leave the garlic and onions undisturbed to brown in the Dutch oven. After about 5 minutes, place the chicken thighs back into the pan and pour in 1 28oz. can of crushed tomatoes, season with salt and a few pinches of chipotle chile powder. You want to make sure the thighs are fully covered in tomato. If they aren’t, add a bit of water, until they are submerged. Turn the heat to low, and let the chicken braise for about 25 minutes.While the chicken is braising, you need to char some scallions. I always like to have something green in a quesadilla. It makes me feel like less of a sophomore, plus it usually tastes good. Wash and dry 1 bunch or 10 scallions. Heat a glug of olive oil in a cast-iron skillet over medium-high and place the scallions in it in such a way that all of the white ends are in contact with the skillet. Don't touch them. Leave them undisturbed for about 4 minutes, then turn the scallions to char on the other side. This isn’t the time to be delicate. You want some serious color. When the scallions have charred, take them out of the pan and slice them widthwise into thirds and place them in a small bowl for future quesadilla construction.Has it been 25 minutes? Yes, it has. Your chicken has been braising away in that simmering tomato sauce. Take the Dutch oven off of the heat, and remove the chicken thighs, placing them in a medium mixing bowl. You’re going to shred that chicken. This is best done with two pairs of tongs, but one pair of tongs and a fork will also do. Remove the bones and shred the meat into chunks of varying sizes. Once the chicken is shredded, ladle a couple spoonfuls of the braising liquid over the meat and stir to coat. You really want each piece of chicken to be dripping with juice.Whether you go with something pre-shredded or something like queso Oaxaca, you want a melty cheese.\nPhoto by Chelsie CraigLet’s talk cheese and tortillas for a minute. When it comes to tortillas, American grocery stores are filled with terrible ones. While this is Rent Week, I'm the type of crazy person who buys quality flour tortillas online so that I always have a stash of the good stuff in my freezer, so...yeah, there's that. I get really great Sonoran-style tortillas from Caramelo, which are small and loaded with pork fat. But if this is all a bit too extra for you, just head to a Mexican market or a grocery store that stocks a lot of Mexican products for a better chance of finding a good tortilla. You should look for refrigerated flour tortillas with condensation in the bag, a sign that they still have some kind of moisture content. And if you can’t find a great flour tortilla, well, just use whatever you can find.Cheese-wise, my ideal quesadilla is loaded with queso Oaxaca, but shredded mozzarella (Mozzarella is actually similar to queso Oaxaca) or shredded cheddar will work too. As long as the cheese is melty, it’s going to work. Again, we’re talking about a spectrum here, so sliding down a bit in one regard isn’t the worst move, if you’re sliding up on every other component. But yeah, if you can find queso oaxaca, get that.Now you have to build your quesadillas. The most important tip I can give—and I really cannot stress this enough—is that you don’t want to overfill your quesadilla. A quesadilla shouldn’t feel hefty. It should be on the thinner side, snackable and self-contained.Don't go wild when building your quesadilla. Less is more.\nPhoto by Chelsie CraigJust enough chicken to cover half of the circle, with some space left around the edge. Just enough scallions to get some in every bite. And just enough cheese to get in the nooks and crannies. As is the case with pizza, \"extra cheese\" always sounds like a way better idea than it is in practice. The fillings should be balanced and the portions humble. You should want to eat two, unless you're working with massive tortillas.Heat a glug of olive oil over medium heat in the same cast-iron skillet you used earlier. If your tortillas have a high fat content (like those Caramelo beauties), you won’t need oil. But most grocery store tortillas require a bit to prevent sticking.  Fold the blank side of the tortilla over the filled side. Place the tortilla in the pan, and don't touch it. Wait for some serious browning to occur, then flip the tortilla. You want to make sure the cheese is visibly melted before removing it from the pan.Crispy Boys.\nPhoto by Chelsie CraigEat these immediately. Quesadillas that sit around are not great. The cheese congeals, and the crispy tortillas get soggy. These should be made to order.Serve them up with a bit of sour cream and a little bowl of the tomato-y braising liquid for dipping. Do you feel that? That was you sliding to the Exquisite end of the Homemade Quesadilla Spectrum. It doesn’t all happen at once. There’s no pressure to evolve immediately. But if you work at it, improving one aspect of your quesadilla at a time, you’ll eventually be staring at the Terrible end of the spectrum from miles away, saying something like, “Remember when we used to microwave quesadillas?”And I’ll say something wise like, “Of course I do. You’ve got to start somewhere. We’re all just quesadillas sliding up and down the spectrum of life.”Nevermind. That was stupid. I won’t say that.In more of a pasta mood? Right this way:A Rent Week Recipe That Redeems Store-Bought GnocchiSage and brown butter? On crispy gnocchi? Tell me more.View StoryExplore Bon AppétitCheeseBasicallyRent WeekChickenTortillasGreen Onion ScallionRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-28", "author": ["Condé Nast", "Alex Delany"]}