{"id": "d667949d70c1674606016a89da9e816a", "url": "https://www.bonappetit.com/story/nordic-ware-fluted-loaf-pan", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "This Loaf Pan Makes the Most Beautiful Cakes, Ever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Pan Makes the Most Beautiful Loaf Cakes, EverLoaf with the most.By Sarah JampelAugust 28, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.“That’s beautiful” was the immediate response I got when I texted a photo of my latest loaf cake to my great friend and baking pen pal, Caroline. “It’s not me,” I wrote back, “it’s the pan!”Loaf cakes are normally squat and plain—the type of dessert that fits squarely into the “humble and homely” category. But a loaf that’s baked in the Nordic Ware fluted loaf pan emerges like a butterfly from a cocoon: intricately designed and absolutely stunning, an entirely different creature. With its undulating curves and star-like design, the Nordic Ware pan transforms even the plainest carrot cake or banana bread into a beauty queen—no glaze or dusting of powdered sugar necessary (though it sure is nice).I mean, just look at it!\nPhoto by Chelsie CraigIf you, like me, are risk-averse, you might be wondering how on earth you’re going to get the cake out of the pan in one piece while preserving the elaborate pattern. Good news: This pan is nonstick—like, actually nonstick.But that doesn’t mean you’re off the hook completely: You still should spray the pan with baking spray (nonstick spray that also contains flour) or butter every nook and cranny, then dust with flour and tap out the excess. However, nonstick here does mean that if you do your share of prep, the pan will work in your favor, and you’ll be able to turn out a photo-worthy loaf (not an oxymoron) every time.And while my loaf cake’s beauty was mostly the pan’s doing, I give you permission to take credit for your future cakes. Half the fun of baking, after all, is showing off.Photo by Chelsie CraigNordic Ware Anniversary Loaf Pan$35.50 at The BA MarketExplore Bon AppétitHighly RecommendShoppingRead MoreshoppingSilicone Mats Are So Nonstick, You’d Think They Were Crafted By AngelsBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-28", "author": ["Condé Nast", "Sarah Jampel"]}