{"id": "d66895ef4fd52a9983902b40d171b1d3", "url": "https://www.bonappetit.com/recipe/smothered-cabbage-with-sausage", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Smothered Cabbage With Sausage and Hot Honey Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueSmothered Cabbage With Sausage and Hot HoneyBy Greg CollierSeptember 14, 20214.8(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Rebecca Jurkevich, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis fresh take on classic smothered cabbage from Leah & Louise in Charlotte is an ode to chef Greg Collier’s late sister, Leah, who loved to experiment in the kitchen. Steaming the cabbage over low heat gently cooks the layers until tender and allows the creamy and velvety sauce to coat them quickly.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSmall Saucepan$155 At AmazonSlotted Spoon$13 $10 At AmazonLarge Skillet$84 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients6 ServingsHot honey1cup honey1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt1Tbsp. smoked paprika1tsp. cayenne peppercabbage and assembly1large head of cabbage, outer leaves removed, cut into 6 wedgesKosher salt2slices bacon, cut into ½\" pieces1andouille sausage, cut into ½\" pieces2cups heavy cream2cups low-sodium chicken broth½cup cilantro leaves with tender stems½cup parsley leaves with tender stems1tsp. extra-virgin olive oil1tsp. fresh lemon juicePreparationHot honeyStep 1Warm honey in a small saucepan over medium heat. Whisk in salt, paprika, and cayenne. Remove from heat; whisk in 1 Tbsp. water. Set aside.Cabbage and assemblyStep 2Preheat oven to 300°. Generously season cut sides of cabbage with salt. Place wedges, cut sides up, on a rimmed baking sheet; pour 1 cup water into pan. Cover with foil; bake until tender (a paring knife should slide through easily), about 2 hours.Step 3Cook bacon in a large skillet over medium-high heat, stirring occasionally, until browned and crisp, about 3 minutes. Transfer to a plate. Cook sausage in same pan, stirring often, until lightly browned, about 3 minutes. Return bacon to pan and add cabbage, cream, and broth. Cook 1 minute. Using a slotted spoon, transfer cabbage to plates. Cook liquid in pan until reduced by half, 10–13 minutes. Spoon sauce over cabbage.Step 4Toss cilantro and parsley in a medium bowl. Drizzle oil and lemon juice over and season with salt; toss to coat.Step 5Scatter herb salad over cabbage and drizzle ½ cup hot honey over.How would you rate Smothered Cabbage With Sausage and Hot Honey?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleMy fella is going to love this. An old Louisiana boy, that andouille sausage, is going to put this dish over the top for him, and hot honey ? Brilliant, but I use Chipotle powder rather than Cayenne for added smokiness., \n\nThank you BA staff, going in my little recipe tin for sure.\n\nOr, as my fella would put it Aaaaiiiieeeeeeeeeeeeeeee !Kynthia the fustrated chefCali born - midwest located.3/15/2022Wow.  Definitely make this.  I didn't have bacon, but did everything else.  Soooo good. LibbyCorpus Christi2/21/2022This recipe was really good! I made this and did a lemon pepper pork tenderloin on the bbq for dinner for my husband and myself and it was amazing! This dish was really easy to make! The cabbage took only about 1.5 hours and it was starting to fall apart. I might cook it for a shorter time next time because I did want to make sure that it sat in the sauce for a while to soak up the yummy cream sauce so by the time that it was all really finished, some of the cabbage wedges were a little too soft. The hot honey was a perfect addition to the cabbage as well as the pork (my husband poured the hot honey over the pork and the salad)! Definitely make the herb salad to throw on top because the citrus from it really ties the whole dish together. We will definitely be adding this to our list of dinners! Bri M. Reno, NV9/23/2021Explore Bon AppétitCabbageLeafy GreensVegetableSausageMeathoneyDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Greg Collier"]}