{"id": "d66efe3b351e99938d9f0aef8ae90930", "url": "https://www.bonappetit.com/story/the-best-way-to-clean-mushrooms", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "The Best Way To Clean Mushrooms Is To Not Wash Them At All | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Way To Clean Mushrooms Is To Not Wash Them At AllIf you love something, let it be.By Jesse SparksOctober 22, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailIf you’re new to cooking mushrooms, first off, welcome to the club. Secondly, let's start with the biggest takeaway: Excess moisture is the enemy. If you’ve ever had disappointing ‘shrooms (read: slimy, mushy, or gray), it might be because you introduced too much liquid too early on. Because mushrooms are porous, they tend to soak up liquid like a sponge. And once they get to this state, it’s hard to make them crispy or flavorful—they’re just too water-logged.But if they need to be kept away from water, then what's the best way to clean mushrooms? The emphasis is on \"clean\"—which isn't the same as \"wash.\" We recommend starting with a quick inspection before you get anywhere near the faucet. If you’re buying boxed mushrooms from the grocery store, you’re most likely going to get a squeaky clean box. After all, most mushrooms are grown in indoor farms, not harvested from the wild. Unless you see any glaring bits of dirt, you’re ready to get cooking.If you do find any with patches of dirt and grime, grab a dry cloth, paper towel, or, if you’re going above and beyond, a pastry brush, to wipe off any gross bits. Once they’re nice and clean, store them in a brown paper bag in the fridge. We recommend paper because plastic leads to condensation, which leads to slime. If a plastic bag is your only option, be sure to leave it  partially open to ensure circulation.In the worst of cases—you know, the A&E-primetime-special-worthy horrors—give them a fast swish-swish in lukewarm water, then drain in a colander and immediately blot with a towel. Now cook them right away—washed mushrooms don’t keep well. But that’s not necessarily a bad thing: It’s a good reason to make mushroom carbonara tonight.Get the recipe:Mushroom CarbonaraMushrooms take the place of the traditional cured pork in this super-satisfying vegetarian carbonara recipe.View RecipeExplore Bon AppétitMushroomRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-22", "author": ["Condé Nast", "Jesse Sparks"]}