{"id": "d68ac2d2e9826d21f75f032fcfe419dc", "url": "https://www.bonappetit.com/recipe/pineapple-celery-gandt", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "Pineapple Celery G&T Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredPineapple Celery G&TDeVonn Francis shares his new spin on a Bombay & Tonic. DeVonn uses pineapple as a nod to his Caribbean roots, celery to complement the herbaceous notes in the gin, and bay leaf to tie all the ingredients in.By BOMBAY SAPPHIRE® GINApril 3, 20215.0(5)Read ReviewsTriangleEmailPinterestPrintTed + Chelsea CavanaughEmailPinterestPrintEmailPinterestPrintIngredients1½oz. Bombay Sapphire3bay leaves3oz. premium tonic water1celery stalk, chopped½cup ripe pineapple, peeled, cored and cubedIceLime wedge, for garnishPreparationStep 1In the bottom of a cocktail shaker, muddle together pineapple, celery, and 2 bay leaves until the celery is thoroughly pressed. Then fill the shaker halfway with ice. Step 2Pour in Bombay Sapphire Gin, cover with lid, and shake for 30 seconds (the shaker will become frosty on the outside).Step 3Fill balloon glass with ice and pour the liquid from the shaker into the glass.Step 4Top with tonic water and garnish with a lime wedge and bay leaf. Click to Shop Bombay Sapphire NowBE BRILLIANT AND INSPIRED. DRINK RESPONSIBLY!©2021. BOMBAY SAPPHIRE AND ITS TRADE DRESS ARE TRADEMARKS.IMPORTED BY THE BOMBAY SPIRITS COMPANY U.S.A., CORAL GABLES, FL. GIN - 47% ALC. BY VOL.How would you rate Pineapple Celery G&T?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis is sooo delicious. The combination of flavours is perfect. It is now my new favourite summer drink. AnonymousToronto, ON4/23/2021Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-03", "author": ["Condé Nast", "Bombay Sapphire"]}