{"id": "d6924633de62a6a961f68915689467fa", "url": "https://www.bonappetit.com/recipe/instant-pot-coq-au-vin", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Instant Pot Coq au Vin Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueInstant Pot Coq au VinBy Carla Lalli MusicFebruary 13, 20184.6(37)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintBrowning the bacon, vegetables, and chicken in a skillet before adding them to the Instant Pot is the most efficient way to get good color on each ingredient without making yourself crazy trying to use the machine’s “Sauté” setting. Instead of hours in the oven, this classic French braise only needs 15 minutes at high pressure to achieve silky-shreddy chicken meat and vegetables so tender you can cut them with a spoon.Ingredients4 servings4chicken legs (thigh and drumstick)Kosher salt, freshly ground pepper2cups dry white wine1bunch thyme, divided4oz. thick-cut bacon, cut crosswise into ¾\" pieces8oz. shiitake mushrooms, stems removed, caps torn into 3 pieces4Tbsp. unsalted butter, divided8oz. carrots, peeled, cut crosswise into 4\" pieces4shallots, peeled2garlic cloves, smashed2Tbsp. white wine vinegar1Tbsp. all-purpose flourHandful of chopped parsleySpecial EquipmentAn Instant Pot or pressure cookerPreparationStep 1Pat chicken dry with paper towels; season aggressively with salt and pepper. Transfer chicken to a 1-gallon resealable bag or an 8x8\" glass baking dish. Pour wine over, then add ½ bunch thyme. Turn to coat, seal bag or cover baking dish, and let sit at room temperature while you prep the other ingredients. (Or, chill up to 48 hours.)Step 2Cook bacon in a 10\" or 12\" nonstick skillet, preferably not cast iron, over medium heat, stirring occasionally, until brown and crisp but all of the fat hasn’t rendered out, 8–10 minutes. Transfer to a plate with a slotted spoon. (Medium heat lets you work in batches without having to worry about scorching your pan, and you’ll eventually use all the browned bits to build a deeply flavored braising liquid.)Step 3Add mushrooms to bacon drippings in pan; season with salt. Cook, tossing occasionally, until tender and golden brown but not crisp, about 6 minutes. Scrape mushrooms into Instant Pot insert and reserve pan.Step 4Meanwhile, remove chicken from marinade and place on a large plate; reserve marinade but pluck out and discard thyme sprigs. Pat chicken skin dry with paper towels. Heat 2 Tbsp. butter in reserved pan over medium. If you’re using a 10\" skillet, you’ll have to do this in 2 batches, but chicken should all fit in a larger pan. As soon as butter is foaming, add chicken, placing skin side down, and cook, undisturbed, until skin is dark golden brown and plenty of fat is cooked out, 10–12 minutes. Turn onto flesh side and cook until pale golden brown underneath, about 2 minutes. Nestle chicken into pot insert.Step 5Pour off all but about 1 Tbsp. accumulated drippings in pan (save it—this is a cross between clarified butter and schmaltz and can be used to sauté or roast basically anything). Add carrots, shallots, and garlic; season lightly with salt. Cook, tossing often, until shallots are golden brown in spots, about 4 minutes. Add to pot insert along with half of the reserved bacon.Step 6Return pan to medium heat and pour in vinegar. Cook, scraping up browned bits with a wooden spoon, until syrupy, about 3 minutes. Add reserved wine marinade and remaining ½ bunch thyme and bring to a simmer. Cook, stirring and scraping bottom of pan, until reduced by half, 5–7 minutes.Step 7Pour liquid over chicken and seal pot. Set for “Pressure Cook,” high, 15 minutes. Let natural release 10 minutes, then unseal.Step 8Meanwhile, smash flour and remaining 2 Tbsp. butter together with a fork in a small bowl until well combined.Step 9Transfer chicken legs and vegetables to a platter or plates. Pluck out and discard thyme sprigs from liquid. Add butter-flour mixture to liquid and whisk to melt. Bring to a simmer on high “Sauté” setting and cook to thicken sauce, about 3 minutes. Taste and adjust seasoning, if needed. Stir in parsley.Step 10Serve coq au vin with braising liquid poured over and all around. Sprinkle remaining reserved bacon over.How would you rate Instant Pot Coq au Vin?Leave a ReviewTell us what you thinkReviews (26)Back to TopTriangleThis was lovely and very straightforward. The instant pot is a good way to finish the boring part (braising) in a hurry, and I agree that using a separate pan to do the sauté as opposed to the instant pot makes everything simpler and more flavourful. I'm confused by the reviews commenting on how convoluted the instructions are, as we found everything clear and easy to follow - other than the bacon. We just weren't sure about how large the pieces were supposed to end up, and ours never got crispy, which I find happens when I use thicker cut. It's white wine, not red, so it will be more subtle, but it's a nice looking Sunday dinner, and over garlic mashed potatoes makes a good stick-to-your-ribs meal to end off the weekend. Part of our rotation, for sure.HLStewartKingston, ON, Canada4/26/2021I made this recepie and loved it. A few issues though, you can tell this is a recepie that's tailored around the instant pot. Not like that's the worst thing, but some parts of this recepie felt like more work than it's worth. I'd make this again but not nearly as often as traditional Coq Au Vin.Kurtis SmejkalVancouver, BC3/1/2021I've made this a few times now, and love it! Something happened this last time that was different though... i used kosher salt and it was tasted much (too) saltier. Also, in the past the shallots stayed in tact, this time they didn't. I just watched the video and think i heard that it is good to keep some of the root intact, so i'll do that next time. The flavour is delicious. Next time I may try using chanterelles, but the shiitakes are delicious. Takes a long time to prepare, especially if need to do pan cook chicken in batches. AnonymousVancouver, BC11/30/2020While the verbiage is clunky and odd, any cook should be able to figure out what is meant.  What was a bit of a surprise is the length of time in out of pot cooking.  Allow yourself some time for prepping vegetables, browning chicken, reducing marinade and then making sauce -- whew! That took up nearly an hour by itself.  The time in the Instant Pot was minimal compared to all the outside work.\n\nI used wild mushrooms I had just picked that day: Lobster mushrooms (hypomyces lactiflourum) and Yellow Brittlegills (Russula Claraflava), I also used green onions from the garden instead of shallots but followed everything else to the letter, although times I used common sense not worrying too much about that save for the time in the Instant Pot which I followed exactly.\n\nThe result was spectacular.  My husband who is not a big fan of chicken loved it.  Had some crusty bread to soak up the gravy too and the rest of the white wine.  Will put this on my \"keeper\" list.New England7/27/2020After eating this travesty... seriously? Who gave this more than one star? It was palateble, but EXTREMELY bland (and yes, I followed the recipe to the letter). My advice, do not waste your time if you are looking for something with a good flavor to it... or that you dont wish to spend hours making.AnonymousTennessee7/11/2020I LOVE to cook! But... this is the most poorly put together at home cooking recipe I have ever seen. Nothing is worded correctly, there is no prep time given, and its just badly put together. This has been a torturous task in making. I LOVE creating and embellishing upon great old world recipes and making them my own. Never have I had such an annoying time whilst cooking anything!SteelchrossTennessee7/11/2020I am doing an at-home Epcot “World Showcase” tour during this COVID-19 quarantine and needed a recipe from France. I chose this one because it looked easy enough and I wanted to use my Instant Pot! I have never made Coq au Vin, so this was my first attempt. Due to limited shopping, I did not have any bacon. I used 2 Tbsp avocado oil and 2 Tbsp butter with some Lawry’s seasoned salt for the “bacon fat”. I also used red wine instead of white and frozen chicken breast tenders instead of thighs. I also used maitake mushrooms. Ok, I guess I changed a lot of things! BUT...it was absolutely amazing still and my kids (13 & 16) loved it! I appreciated the video and the ingredient and prep guidelines. I would say I’m maybe intermediate level when it comes to cooking, but I’m getting really good at subbing because I’m staying home and not shopping like I normally would. THANK YOU for helping me have success at our “France World Showcase” stop! CcoymsrdOrange County, CA4/21/2020So everything about this was quite good except that the chicken was absolutely overcooked. I didn't check any times against any other sources that I trust so will do so before making again. I did double the carrots and that should have the only change made - that said I would double the mushrooms next time - maybe use button for that. Served along buttered noodles with Parm.Anonymous3/31/2020Best thing I've made.  I did take quite a while on  saute  (on normal) at the end  to get it to thicken but the results were fantastic.  I got my market to make 1/4\" or so bacon slices for lardons.  I highly recommend that over regular or even thick packaged bacon if you can get it. I also added Sherry Vinegar (vs just white wine vinegar) but I have nothing to compare the results to.\n\nIn the video she uses a small area and it's nice and neat.  My kitchen looked like a bomb went off.  Obviously, one of us a professional and it's obviously not me.adiamondSan Diego3/13/2020This recipe was fantastic! The chicken came beautifully tender and silky. Next time I'll make a few alterations: I used red wine instead of white, and it ended up a little too strong. I'll either use less red wine or try white next time. The amount of flour and butter was way too much for the liquid left over - it ended up being very thick and gelatinous, and I had to thin it down a lot. The thyme was also really strong, but that I like.\nI'll definitely make it again!Ariana de Souza1/25/2020Since I had four leg quarters, and was looking for a recipe using them, I made this last night, and of course used red wine, as that was what I was used to. It was delicious! I will make this again, and again, as my wife loved it.  Enjoyed the video! \nBon Appetit!\n\njmkthird19452356San Diego, California6/1/2019So good! Anonymous3/14/2019This was spectacular. Watch the video as it differs from the recipe slightly. I doubled the mushrooms and used 5 fat carrots, which should not be sliced or they will turn to mush. Heed the advice about bacon in the cold pan and definitely do your searing on medium so you don’t burn the fond. That would be sad. Thanks Carla for a fabulous recipe. sppulliamSan Carlos, CA2/6/2019I used red wine, as that is what the coq au vin of my youth used. Although not quite thickened, the sauce was wonderful. I found that the chicken was overdone and, the next time I cook this dish, will vent the Instant Pot immediately after cooking is finished.  Harry SaltzmanNew York, NY2/3/2019I'm over the moon about this recipe and will definitely make it again. 1. definitely heed the advice to brown on the stove instead of the IP. I've read that some get frustrated when recipes require work beyond IP but you are actually saving time. The IP saute function is not great. It doesn't get hot enough and it's too cramped for proper browning of meat. 2. Honestly I think one of the biggest reasons this tasted so great was that I bought quality thick-cut bacon from a butcher. I also got the chicken there, but I really noticed the biggest difference in the bacon. To save a bit to cash, I used half shiitake and half baby bella mushrooms 3. I was having guests so I upped the chicken to 6 pieces and wine to 3 cups from 2. I bumped up the butter/flour mixture a bit too. I did not increase the bacon. I turned out great. I also added 4 minutes to the pressure in case it's of interest. \n\nOverall, I have nothing but love for this recipe and I'll definitely make it again. Serve with some nice bread to soup up the delicious sauce!Anonymousma, usa1/26/2019Explore Bon AppétitStewSoups and StewsFrenchEuropeanChickenPoultryWinterMainDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Carla Lalli Music"]}