{"id": "d694a59d5a5e759e08bee849352dbdc0", "url": "https://www.bonappetit.com/story/mansplaining-waiter", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "Is It Ever Okay...To Call Out a Mansplaining Waiter? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay...To Call Out a Mansplaining Waiter?And more of your etiquette questions about restaurant faux pas answered definitively, forever and ever.By Alex BeggsMarch 13, 2019FacebookTwitterEmailBettmann/Getty ImagesFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s etiquette column. Have a question? Email staff.bonappetit@gmail.com.“If, during your meal, one dish came with hair in it, another had a piece of plastic in it, everything else was delicious, and all they comped was giving us more dessert—should I have demanded the whole thing to be comped?” —Dissatisfied DevinLet me get this straight, you found a hair, some plastic, but then went ahead and ordered dessert? It sounds like you have forgiveness in your heart. It’s 2019—no one forgives anymore. We rage! We avenge! Your soul remains pure. And yet, that extra dessert shows up and you think, could it be more? This is how paradise fell. Sure, they could have comped the entire meal and your three glasses of Sauv Blanc on ice, but restaurants barely make a profit these days and you clearly walked into a struggling one. You get an entire meal free when the treasure discovered on your plate was once living, breathing, and pooping. That’s the one. So take your extra bowl of definitely-sneezed-on-gelato, and never go back to that place again.Spotless!\nPhoto by Alex Lau“Here’s a restaurant bathroom scenario: I am a dude. I’m waiting in line to use the only restroom at a restaurant. There’s another dude in there. And there’s a woman behind me in line. When it’s my turn, I see that the dude has left some pee on the seat. I’m not going to sit in it, but the woman behind me in line will have to deal with it. And she’ll probably think it was me who peed on the seat. I obviously can’t say to this woman, ‘That’s...not my pee on the seat,’ but I also don’t want to clean that dude’s pee off of a toilet seat before I head back to dinner. Is this a Gandhi-ish ‘Be the change, yadda, yadda, yadda,’ situation? Or is it the woman’s problem, and I just happen to be caught in the crossfire? WHO CLEANS THE PEE?” —A Different AlexThe ladies’ room in our office has an overstuffed paper towel dispenser that causes people to pull too many towels. By the afternoon, the floor of the ladies room is littered with them, plus used, wet towels people flung into the can and missed. This used to drive me crazy. Who are these grotesque goblins I work and pee beside? But then I realized. I’m Mother Theresa. I’m Princess Diana. I’m a freaking saint. So now, I use the towel I dried my hands with to pick up those stranger germ towels and make sure that society doesn’t crumble into the landfill where all these towels are going. Wipe the pee. Wash your hands.SNACK BREAKThe creamy ricotta up against crispy broccoli up against spicy honey—YOU WANT THIS TOAST. For a dinner party snack on baguette, or on sourdough toast for dinner. So versatile!Broccoli and Garlic-Ricotta Toasts with Hot HoneyCrispy roasted broccoli proves it works just as well as an appetizer as it does a side dish.View Recipe“When splitting the check with a friend, are you obligated to discuss how much you’re tipping and then synchronize your totals?” —Gossipy GinaSure, why not? Then I always tip an extra dollar so the server likes me best.“Is it ever okay to call out a mansplaining waiter/bartender who questions if I really want my drink order? I pretty much exclusively drink mezcal, and get questions about if I ‘know it will be smoky’ or ‘have had mezcal before.’ And yep, they’re always from dudes. I may look young and femme, but I know what I want to drink!” —Alcy AlizaI prefer tequila. But when they ask if you know it’ll be smoky say, “yes, I know many, [LONG PAUSE] many things” and do NOT break eye contact and do not smirk.When they ask if you’ve had mezcal before, look off dreamily and say, “yes, we drank mezcal at the commune on sacrifice days.”Photo by Hulton Archive/Getty Images“I ordered a pork chop at a pretty fancy restaurant lately that arrived raw. When I pointed it out to the waiter, who agreed it was undercooked, she asked if I wanted the chef to put it back on the grill. I thought they’d just cook a new one, so instead I asked for an entirely different dish. Is that okay?” —Raw RachelYeah that was a good idea. Do that.That’s all for now, but if you have petty etiquette questions or recipe requests for me, email staff.bonappetit@gmail.com and be too specific. I want the juicy details!Love, AlexExplore Bon AppétitIs It Ever OkayEtiquetteRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-13", "author": ["Condé Nast", "Alex Beggs"]}