{"id": "d6985fdfeb53c669465c02a175b96e66", "url": "https://www.bonappetit.com/story/cheesy-arancini-recipe", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "This Arancini Recipe Is the Weekend Cooking Project You’ve Been Looking For | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingArancini Is the Weekend Cooking Project You’ve Been Looking ForRoll me up and fry me: the arancini story.By Alex BeggsNovember 8, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailOne of the greatest things to arrive before your eyes, served on a roaming platter in a room of laughing, polite people, is a crispy, round orb of arancini. Those ping pong balls of fried risotto save you from pre-dinner hunger pangs, or more likely from open bar–empty stomach mistakes. See it, grab it, pop it. Arancini, I just wrote a commercial for you.Rather than deprive yourself of this joy the 360 days of the year you’re not at a holiday party, why not make them at home and crack into the open bar under your TV? Great idea!For this recipe, Molly Baz had a vision: Huge molten arancini that spilled out cheesy risotto onto the plate like lava cakes—a vision we shot down. “Arancini are party food, you can’t have that,” scolded Andy Baraghani, who we never thought would have so many arancini takes. “Andy can’t crush my dreams,” Molly told me, so she’ll save that recipe for another occasion. Still, these arancini are stuffed with sugar cube–sized pieces of mozzarella, so that even when you bite into one, there’s an oozy cheese pull to ooh and aahh over. As one does. The rest is about making risotto, chilling risotto, rolling risotto snowmen, and frying risotto. It’s a labor of love, but aren’t the best things in life? But\nlet’s briefly look at each step at a time so you can see how attainable this is outside of a catering kitchen.Making risottoThe risotto part keeps it simple—no peas here—with onions, garlic, salty Parm, white wine, plenty of black pepper, lemon zest, and some heavy cream. Add stock, stir stir stir, the usual risotto bag of tricks. It’s done when it’s “toothsome,” which is one of Molly’s favorite words and which I never hear anyone else say, ever. But she means al dente, not mushy.Chill the risottoThen you spread the risotto out on a baking sheet to chill for an hour or four in the fridge. This will make it roll-able.Roll the risotto snowmenThings get messy! Using a ¼ cup measuring cup will help you make consistent balls. You can do this with your bare hands or wear gloves, but you shape each ball into a sort of disc first, add two squares of mozzarella, and then shape the rice around it, rolling it into a snowman head. Freeze ‘em for a few minutes so they can firm up.Fry the risottoMolly tested a few different crispy coating options. She ended with Panko and a traditional egg + flour dredge because other options (cornstarch slurry, regular breadcrumbs) didn’t fry as evenly, or with as good of a crunch. You need a good crunch to contrast with the gooey filling, so this was an important detail.The biggest possible mistake you can make when frying the arancini is taking them out too early because you’re impatient and want to get this party started already. They’ll take 6-8 minutes and need to be DEEPLY golden brown. TEST one out of the oil by cutting into it to see that the mozz has melted. (This is your spider’s time to shine!) Then take the others out. Then go mingle with your laughing, polite dinner guests, who’ll be talking about those arancini for months to come.Last thingWe have a great mini recipe for a chile oil dip to serve with these, with oil-packed Calabrian chilies, garlic, and more lemon juice—it really helps cut through the richness of the fat-on-fat-on-fat in the risotto.This recipe makes a party’s worth of arancini, so please use this as an excuse to throw a party. Send paper invites. Buy tiny napkins. Make a bathtub of spritzes! Celebrate what blessings the fry gods have bestowed upon us.Get the recipe:Mozzarella Arancini (Stuffed Rice Balls)This is a labor of love that will make other people love you, which is reason enough to give this recipe a try.View RecipeExplore Bon AppétitRisottoPartyCocktail PartyItalianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-08", "author": ["Condé Nast", "Alex Beggs"]}