{"id": "d69be9d1958d62ff651ad626407e5ece", "url": "https://www.bonappetit.com/story/celery-soup-chile-garlic-oil", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "The Celery Soup Recipe That Will Make Leftover Celery Seem Like a Gift | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDon’t Underestimate the Power of This Celery SoupIf you need me, I'll be making this celery soup all January.By Alex BeggsJanuary 12, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis celery soup is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.I have some celery hangups. I’ve written about how to use it up, because it always seems to be lingering in my fridge, lonelier than the third cutest member of a boy band. (That’s VERY lonely, by the way.)Because the best way to deal with your food-related fears/anxieties/phobias is to face them, I volunteered to test this celery and chickpea soup for the Feel Good Food Plan. Maybe, I thought, it would make me feel good now—but also forever.The soup, with a celery, onion, chickpea, and chicken stock base, is comforting and flavorful and exactly what you want in the depths of January. It’s ready in around 30 minutes, which is always a welcome surprise when it comes to soup. I don’t know what personality type I am that prefers soup for lunch rather than for dinner, but I made this as meal prep for the work week and it was perfect for warming me up (WHY IS THE AIR CONDITIONING ON IN THIS OFFICE IN WINTER?!) and making me feel full—without being so full I need a desk nap.But this recipe is all about the bonus sprinkle on top—garlic-chile oil oil that is better than Lay’s potato chips. I told Andy Baraghani, the food editor who developed it, to DOUBLE THAT RECIPE. I used jalapeño instead of Fresno chiles, so sue me. Pro tip: Make sure to take the time to properly chop the garlic, not just slice it, so it'll cook more evenly. And keep the heat medium-low so they get crunchy and not, you know, burnt. (TBH even though I scorched the garlic the sprinkle tasted awesome.)Other Andy-style garnishes (this man loves flair!) include a salty yogurt to mix in for creaminess, and a squeeze of lemon on top, which makes all the difference. If you think these accoutrements are optional, you’re missing out on the full Celery Soup Experience. Squeeze the damn lemon! It brightens everything up like drinking rosé on a snow day. Obviously that’s a good thing.A final note about this recipe—the BA test kitchen has strong feelings about boxed chicken stock. As in, they never use it. If homemade isn’t an option, they go with water instead. That’s up to you. I broke the law and used low-sodium boxed stuff and I’m alive to tell the tale. In fact I’m more than alive. I feel great.Get the recipe:Chickpea and Celery Soup with Chile-Garlic OilYou know the soup and salad deal? Well, this is our take on combining the two into one dish.View RecipeExplore Bon AppétitSoupHealthyishCeleryChickpeaRead MorecookingThis Roasted Squash Recipe Is the Ultimate Vegetarian MainBy Meryl RothsteinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-12-15", "author": ["Condé Nast", "Alex Beggs"]}