{"id": "d6bdde9cf85a9dd6b1c31d994ad691fb", "url": "https://www.bonappetit.com/story/delanys-hypothetical-fantasy-cookout", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "My 100% Hypothetical Fantasy Cookout | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy 100% Hypothetical Fantasy CookoutThere will be boozy lemonade. And pasta salad. And chicken wings. Oprah is invited. Welcome.By Alex DelanyMay 25, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailWhoa. Was that Michael Jordan who just walked by? Holding a glazed chicken wing and drinking lemonade from a tiki glass that looks like a basketball hoop? Is that Diane Keaton, in an oversized Hawaiian shirt and comically large sunglasses, lounging in a chair by the pool? Is Oprah talking to your 10th grade math teacher about the charred cabbage? Yup. This is all happening. Because we’re at Delany’s 100% Hypothetical Fantasy Cookout, where anything is possible. Dreams, reality, and astonishingly tasty food coexist without a hint of skepticism. It’s great to see you. So glad you could make it. Feel free to grab a beer from the kegerator at the top of the water slide.Okay. The sad reality is that I can’t actually throw a grilling party. The apartment building I live in doesn’t allow grills or open flames on the premises. And even if I mustered up the courage to sneak one onto my balcony, Oprah hasn’t returned my calls in weeks. Something tells me she wouldn’t show. Which is sad, because throwing a party is my second favorite thing to do when it gets all sunny and warm outside. The first is grilling.But we just released a killer issue filled with some seriously rad grilling recipes, so I’m not letting these real world road blocks get in my way. I’m going to throw this party. Right here. With you. On the internet. Here’s what’s on the menu. Get ready to eat your butts off.Strawberry-Rose Agua FrescaPhoto by Alex Lau, food styling by Rebecca JurkevichI’ll be serving a drink that can be consumed with or without booze, because there will be both kids (The Yodeling Walmart Boy from Youtube, D.W. from the animated television program Arthur, Andy from Toy Story, etc.) and adults at this cookout. A refreshing, fruity strawberry agua fresca will do the trick. You can head to any of the water fountains, which will start to dispense tequila after 6:00 p.m., to spike your beverage.Spiked Ginger-Mint LemonadePhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyThere’s a boozy lemonade stand over by the basketball courts. It’s staffed by the Hardy Boys and Nancy Drew. If want them to serve you a dangerously sip-able cocktail that’s as tart as it is minty, they’ll do that. If you want them to solve mysteries for you, they’ll also do that. That’s hospitality.Grilled Corn Salad with Hot Honey-Lime DressingPhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyAnd while we’re at the basketball courts, it looks like Air Bud is here. Or maybe it’s one of Air Bud’s kids? Or grandkids? I don’t know. Golden retrievers all look pretty much the same. Whoever it is seems to be ripping apart a bowl of the grilled corn salad with hot honey-lime dressing. It’s brightly acidic thanks to the lime and a little spicy thanks to sriracha. But creamy chunks of avocado keep those flavors in check. Wait. Can dogs eat avocado? Should I be calling someone?Romesco Pasta Salad with Basil and ParmesanPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonCan you hear me over the duet being sung by Patti Smith and Andre 3000? Great. Pass me the pasta salad. Yeah, you heard what I said. I’m serving pasta salad, because even though it’s one of the worst dishes ever invented, I managed to find one that’s actually good. It’s all of the classic Italian flavors you love, turned into a carb-y salad. Tomatoes, basil, peppers, Parmesan, and garlic, topped with crispy breadcrumbs and chopped walnuts. There’s texture happening here, because this pasta salad is tossed in romesco sauce. It’s not a giant pile of slimy salad dressing-soaked noodles.Charred Tomato SalsaPhoto by Alex LauWhere are the tortilla chips? Damnit. Maya Angelou has them on her float in the pool. We need them for this minimalist, charred tomato salsa. You can’t have a cookout without chips and something to dip them in. This salsa is good enough to eat with a spoon though, with a hint of spiciness from a serrano and a gentle smack from lime juice.Charred Bean and Pea SaladPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEddie Murphy said these beans were amazing. I don’t know. I haven’t tried them yet, because my sous chef WALL-E (the robot from WALL-E) cooked them. But I do like Eddie Murphy, and he wouldn’t shut up about them. They’re acidic and salty and a little spicy. But most of all, this is a simple preparation for prime-season produce, a celebration of the vegetables at the market, and a perfect side for everyone at the cookout, including Eddie Murphy. Did I mention that Eddie Murphy showed up? Love Eddie Murphy.Savory Caramel Chicken WingsPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonPaul Newman threw that horseshoe. He missed the pit by a little. Be cool. Pick it up and hand it back to him. He’s a normal guy. You know what’s not normal though? THE FREAKING SAVORY CARAMEL GLAZE ON THESE GRILLED CHICKEN WINGS. FISH SAUCE AND LEMONGRASS, ARE YOU KIDDING ME? A reincarnated Paul Newman playing horseshoes is an everyday sight compared to these things. Sweet and sticky and smoky, these wings are standing at the front of the queue to become cookout regulars all summer long. Clean your hands before touching the horseshoes though. No one likes a sticky horseshoe.Charred Cabbage with Goat Cheese Raita and CucumbersPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonWho’s a notable vegetarian? Madonna? No, she couldn’t make it. Erykah Badu? Yes, Erykah is here. And she’s vegetarian. So we need to have a standout vegetarian main. Cookouts aren’t all meat, all the time, folks. That’s why this charred cabbage with goat cheese raita and cucumbers is an absolute winner. The mix of textures (charred, crispy exterior and tender interior) here makes it seem like you’re actually eating a piece of meat. And the acid and herbs in the salad combine with the creaminess of the yogurt to cover the rest of the bases. Speaking of, there are golf carts leaving from the side of the house to take you to the wiffle ball arena. Hurry up.Sticky-Sweet Grilled Pork ShoulderPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonIf you think I’m having a cookout without some red meat, you are mistaken. I floated the idea past Bill Murray when we were conceptualizing the menu, and he laughed in my face. Haven’t seen him since. In hopes that he’ll show up today, I’ll be serving this sticky-sweet grilled pork shoulder, which was developed by a member of the royal barbecue family Aaron Franklin. The flavor on this piece of meat is absolutely bonkers, coated in a glaze that’s equal parts sweet, spicy, and salty. It’s beautiful, and it tastes a hell of a lot like char siu pork when all is said and done. Sliced thin with pickles, it is perfection. Enjoy. And let me know if you see Bill.Fried Fish Sandwiches with Cucumbers and Tartar SaucePhoto by Alex Lau, food styling by Chris MoroccoSIKE. It’s a fish sandwich. This is a made-up party. I can do this if I want to. And I want to, because this is one of the best fried fish sandwiches I’ve ever had. It’s creamy and tangy, thanks to tartar sauce, and sliced cucumbers lighten the whole thing up to make you feel somewhat healthy. Plus, the fish itself was caught by Captain Quint from Jaws...before he got eaten by the giant shark.Strawberry Eton MessPhoto by Alex Lau, food styling by Rebecca JurkevichYou’d think we’d be having an elaborate, opulent dessert at this event, huh? Something that looks like the thing Rihanna chose to wear, which is cool, but a bit...much. We’re not. We’re going to keep it low-key with a Eton mess, a spoonable dessert made from fresh whipped cream, strawberries, and store-bought meringues.Eton mess is the dessert that brings this whole thing together, because at the end of the day, a cookout isn’t about extravagance or impressing people. It isn’t about notable celebrity guests, a 126-acre backyard, or a pool big enough to fit your jet skis. A cookout is about making delicious food for people who want to be outside. It’s about relishing the simple joy of breathing fresh air, smelling the coals, and tearing into flavorful food with people you care about. Which is why I invited you. Hope you enjoyed yourself. Party favors are through the arcade. Get home safe.Want to keep you're grilling vibe a little healthier? Fine. Here:1 / 65ChevronChevronClams with Spicy Tomato Broth and Garlic MayoView RecipeExplore Bon AppétitMenusGrillCookoutChickenPorkSalsaSaladPastaFishStrawberryCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-25", "author": ["Condé Nast", "Alex Delany"]}