{"id": "d7047048fd9e4f2c13d9e4b2a4b2aee5", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/beta5", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Beta5 Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverBeta5A Mount Pleasant sweets shop pushing cacao boundaries since 2011FacebookPinterestTwitterEmailBETA5 Chocolates GO HERE: for a wild and whimsical experience in all things chocolate, sugar, flour, and cream. Named for “the most stable form of cocoa-butter crystallization,” Beta5 began by producing chocolate bars and confections, but its creations have expanded to include a line of ethereal cream puffs and weekend experiments in pastry and ice cream.ORDER THE: noodle bar (actually a chocolate bar) with togarashi-spiced peanuts and ramen noodles; mango-passion fruit caramels; Vietnamese coffee cream puff; and whatever special weekend creation they’re featuring, like raspberry-orange brioche ice cream sandwiches and sundaes simply titled Disco.THE VIBE IS: clinical-like but in a good way. It is a fine curated chocolate lab with an all-white sparkling-clean space and a product lineup that changes often. Peek through the windows in the back of Beta5 to watch the team of pastry wizards at work.PRACTICAL STUFF: Open Tuesday to Friday, from 10:30 a.m. to 5:30 p.m.; and Saturday and Sunday, from 10 a.m. to 5 p.m. Closed Monday.—Lindsay AndersonLuis ValdizonBETA5 ChocolatesWE ALSO LOVEBeaucoupAn outstanding bakery worth the (slight) trek to KitsilanoBurdock & Co.A Mount Pleasant go-to that shows off the best of British Columbia33 Acres BreweryCalifornia meets the Pacific Northwest and the result is this breezy Mount Pleasant breweryExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}