{"id": "d70fe91ac03dc3dc3f6b122fb58aad12", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/kishimoto", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Kishimoto Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverKishimotoThe Drive’s no-frills standby for impeccable sushiFacebookPinterestTwitterEmailJyan Kishimoto GO HERE: for some of the city’s best (and most affordable) sushi, a coup considering that  Vancouver is a North American sushi capital. Named after chef and owner Akira Kishimoto, this unassuming spot is as friendly as it is serious about its food.ORDER THE: house speciality: oshizushi, impeccable pressed sushi with imaginative flavor pairings. You can’t go wrong with the salmon, served in a jar filled with cherrywood smoke. Then get whatever assorted sashimi is available (flown in straight from Tokyo’s Tsukiji Market), very photogenic oyster shooters, and, if you have time to wait for it, textbook-perfect okonomiyaki.THE VIBE IS: chummy and enthusiastic. Behind the bar, chefs look up to smile at new customers before resuming their laser focus on the tasks before them, while diners of every age eat with wide-eyed enthusiasm. The affordable menu means you’ll likely dine next to one of many regulars, all of whom have their own strategy for snagging one of the endlessly coveted seats.PRACTICAL STUFF: Open Wednesday to Sunday, from 5 p.m. to 9:45 p.m. Closed Monday and Tuesday. No reservations, so be prepared to wait a bit or you can call ahead for takeout and make a picnic of it at nearby McSpadden Park.—Lindsay AndersonJyan KishimotoJyan KishimotoWE ALSO LOVEKissa TantoChinatown’s critically acclaimed Italian-Japanese restaurant worth dressing up forFisherman’s TerraceDestination-worthy dim sum in a Chinese-food capital (a.k.a. Richmond)The AcornFine-dining in Mount Pleasant that just happens to not include meatExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}