{"id": "d7115dec40b9db52f379c4c3e8d25229", "url": "https://www.bonappetit.com/story/what-are-chia-seeds", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "What Are Chia Seeds Good For Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Are Chia Seeds Good For Anyway?Here's why we love these little specks of good health.By Aliza AbarbanelJanuary 26, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Emily EisenFacebookTwitterEmailThis story is part of the Healthyish Pantry, a collection of articles breaking down the ingredients we love most. Click here to read the whole guide—then stock up.Sure you've had chia pudding, but maybe you're wondering: what are chia seeds good for besides a physical transformation that’s straight out of a John Hughes movie and getting stuck in your teeth? First thing's first: Yes, they're the same seed that powered the Chia Pets craze in the ‘80s. Now that we've got that established, here's everything else you need to know.Where they come from:Chia seeds come salvia hispanica, a flowering mint plant native to parts of Mexico and Guatemala. Its seeds are one of the oldest forms of nutrition—a staple of of Mayan and Aztec diets that became popular in the Western world around a decade ago. They're pretty much tasteless and odorless, but their most obvious characteristic is that they absorb a shocking amount of liquid—up to 10 times their dry weight—swelling into tapioca-like balls beloved by healthy breakfast fanatics and feared by anyone with trypophobia.Why we love them:The term “superfood” gets tossed around a lot these days, but chia seeds are one of those trendy ingredients that actually deserves the title. The small seeds hold the holy trinity of nutrition—fiber, protein, and omega-3 fatty acids— which promote slow digestion and a subsequently steady stream of energy. Chia seeds also contain key minerals like calcium and magnesium, and all nine essential amino acids. Plus, they’re naturally gluten-free and vegan.What to look for:It’s common to spot speckled black chia seeds, but white seeds are also available. The only difference is aesthetic. Solid brown seeds aren’t yet mature, and you should probably avoid adding them to your smoothies—their stunted development translates into limited nutritional benefits and an unpleasantly bitter taste. Once purchased, chia seeds can be safely stored in a cool, dry place for several years.Where to buy them:These days, chia seeds are pretty common. You can find them in health food stores and major supermarkets. They’re also available on Amazon and Thrive Market.How to use them:Chia seeds have an extremely subtle flavor, and are therefore prioritized for texture over taste. They’re most commonly used in puddings (both for breakfast and dessert), but we also use them to give body to tonics, smoothies, jams, and even crackers. Sprinkled dry over salads and grain bowls, they give the perfect amount of crunch.Now, put that bag of chia seeds to good use:Coconut Chia-Tapioca PuddingIf you love the texture of chia pudding, it gets even closer to bubble tea with the addition of tapioca pearls here.View RecipeBlueberry-Chia Ice PopsView RecipeTropical Energy BarsIf you can’t find no-sugar-added pineapple, this recipe works with pretty much any dried fruit of your choice.View RecipeExplore Bon AppétitHealthyishChiaRead Morerecipes26 Chia Seed Recipes That Don’t Involve Just PuddingGallery26 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-26", "author": ["Condé Nast", "Aliza Abarbanel"]}