{"id": "d71616cbd84763f9bd8424585cfe6e1c", "url": "https://www.bonappetit.com/story/omsom-southeast-asian-seasoning-packets", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "Omsom Asian Seasonings Have a Permanent Spot in Our Pantry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOmsom Asian Seasonings Have a Whole Lotta Flavor and a Whole Lotta CredThese flavor-packed sauces simplify iconic dishes without dumbing them down.By MacKenzie Chung FeganOctober 13, 2021FacebookTwitterEmailPhoto by Mischelle MoyFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.“Real Asian flavors that take you home.” The phrase scrolls across Omsom’s website like a news ticker, sandwiched between a tout that orders over $29 ship free and a “shop starters” banner. It’s a simple line of marketing copy, but it made me emit a small yelp of surprise. How often had I encountered a brand that presumed that Asian flavors taste like home?Omsom sells something it calls starters, which are essentially sauces with all the flavor components needed to make a specific Asian dish like bulgogi or larb. They come packaged in resealable pouches (which I prefer so I can customize the amount of seasoning I add to my dish) or single-use packets, and you can also buy sampler packs that showcase the flavors of East or Southeast Asia. The bright umami-rich Filipino sisig starter contains vinegar, garlic, mushroom powder, and calamansi purée. The Vietnamese lemongrass barbecue option has just the right amount of savory funk, thanks to Red Boat fish sauce, lemongrass, and oyster sauce. The Thai larb starter consists of not one but two packets, one with fish sauce, lime juice, sugar, and chili flakes and the other with toasted rice powder for that essential nutty flavor.Photo by Mischelle MoySoutheast Asian Omsom Sampler$29 at OmsomEach starter comes with instructions on how to make a composed dish using the seasoning packet. Although the recipes are simple, coming together in the time it takes to sauté some meat and chop some veg, they’re not dumbed down. Omsom doesn’t assume that I would prefer a boneless, skinless chicken breast as the catchall protein (I would not). Several of the recipes call for pork belly—eternally popular in many Asian cuisines, but aside from a brief brush with trendiness circa 2005, not a mainstream cut for many white Americans—although if you’d like to use the traditional pig’s snout, cheeks, and ears for the sisig, I’m sure Omsom would approve.Omsom's sisig seasoning packet in action\nPhoto by Jenny HuangFor those nights when even turning on the stove is too much meal prep, the latest addition to the Omsom family is a set of six starters (two each of the Vietnamese lemongrass barbecue, Korean bulgogi, and Chinese mala salad seasoning pouches) with recipes specifically created for Instant Pots and air fryers. They come together in a snap, and you can look forward to spicy bulgogi braised pork or crispy, air fried lemongrass cauliflower and mala chicken wings with little more work than pushing a button. Instant Pot Omsom Sampler$29 at OmsomThat Omsom speaks with a decidedly Asian American voice is thanks to its founders, Vietnamese American sisters Kim and Vanessa Pham. To develop their starters, they sought out chefs who could deliver on Omsom’s promise of “no more diluted dishes, no more cultural compromise,” including Amelie Kang of the MáLà Project, Jimmy Ly of Madame Vo, and Chat and Ohm Suansilphong of Fish Cheeks. The results are so satisfying my only quibble is that I wish they came in family size jars; I'd save a space for a vat of the lemongrass barbecue starter right next to my 25 oz. jar of Lao Gan Ma chili crisp.If you’re not used to having your experience centered, it can be giddy-making when you realize that a company is talking to you. And that can feel pretty radical if you’ve spent a lifetime seeing grocery aisles full of “homestyle” chicken pot pie and “grandma’s” tomato sauce that don’t particularly remind you of home or grandma. For us Asian kids, Omsom provides the shortcuts to nourishing, flavor-packed meals—just like Mom used to make.Explore Bon AppétitShoppingHighly RecommendRead Morecooking5 Spice Blends We Can Get BehindBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-20", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}