{"id": "d743eb5502a36a88bd17132e23469ea2", "url": "https://www.bonappetit.com/story/hungry-pigeon-breakfast-sandwich", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "An Adult-Sized Hangover Calls For Hungry Pigeon's XL Breakfast Sandwich | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAn Adult-Sized Hangover Calls for the XL Breakfast Sandwich at Philly’s Hungry PigeonI promise I’ll be more fun after I eat this.By Emily SchultzMay 21, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.If you are, or have previously been, in your 20s, then you’re already familiar with the wisdom people in their late 20s like to dole out to people in their early 20s: “Live it up now!” “Your bones are going to start creaking from all of that dancing!” and my personal favorite: “Once you pass 25, the hangovers really start to go downhill.”The last one is something I, three weeks into 26, can now vouch is actually true. No longer can I keep up with my 23-year old sisters when we go out to the club in Philadelphia. They’ll have spent the night downing much vodka and wake up the next morning like nothing even happened. I, now over the hill, no longer bounce back so easy, and in order to recover, I require a breakfast sandwich from Hungry Pigeon.At its core it’s a house-made english muffin with craggly nooks and crannies, a fried egg with lacy edges and a runny yolk, some Lancaster jack cheese that’s sharp enough to perk me up, and a swipe of creamy-tangy dijonnaise. But it doesn’t have to end there: The best part is choosing which extras to add on.People say you get less fun as you get older, but the sweet Country Time pork roll (this is Philly we’re talking about) and hash brown the size of a brick that I’m known to choose disprove that theory. The crunchy, cubic tater is created by taking loads of shredded (local!) kennebec potatoes, dusting them with rice flour and salt, and then baking them on a sheet tray the day before. When your order comes through, they take a square from the tray and freshly deep fry it, making for a super crispy-and-never-soggy potato puck.The whole thing is greasy, salty, messy, and instantly brings me back to life after a long night out. Though on second thought, I think I’ll leave the sweaty clubs to my sisters, because waking up early to get one of these is now my older, wiser version of a good time.Go there: Hungry PigeonExplore Bon AppétitHighly RecommendPhiladelphiaBreakfastSandwichRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Emily Schultz"]}