{"id": "d776f379a6c24f16c80b4db6247588d4", "url": "https://www.bonappetit.com/recipe/weeknight-pad-thai", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Weeknight Pad Thai Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesWeeknight Pad ThaiBy Claire SaffitzMarch 13, 20184.2(22)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintWe're all about taking shortcuts when it comes to weeknight cooking, but there's no way around using tamarind in pad thai—it lends a complex sweetness that you just can't get from any other ingredient, and the dish is simply a shadow of its former self without it. You can find it in the \"international\" section of a lot of grocery stores, but an Asian market is going to be a sure thing. Once you've got the base recipe down, pad thai is a great way to use up leftover proteins like cooked shrimp or shredded rotisserie chicken; simply toss them in when you add the noodles so they can warm through without overcooking.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonWhisk$10 At AmazonTongs$13 At AmazonColander$11 At AmazonLarge Skillet$84 At AmazonIngredients4 servings1bunch scallions4large eggs⅓cup roasted, salted peanuts8oz. dried flat pad Thai noodles or stir-fry rice noodles¼cup tamarind juice concentrate (or 2 Tbsp. tamarind paste mixed with 2 Tbsp. water)3Tbsp. dark brown sugar2Tbsp. fish sauce2tsp. chili-garlic sauce, such as sambal oelek or Sriracha, plus more for serving3Tbsp. vegetable oil2cups mung bean sproutsLime wedges (for serving)PreparationStep 1First, some prep: Cut 1 bunch scallions crosswise to separate dark greens parts from light green parts and bulbs. Thinly slice scallions crosswise, keeping ends separate.Step 2Crack 4 eggs into a medium bowl and whisk to blend.Step 3Coarsely chop ⅓ cup peanuts.Step 4Place 8 oz. noodles in a medium heatproof bowl. Add boiling water to cover and let stand, tossing with tongs frequently, until soft and pliable but not tender, 7–10 minutes (depending on brand). Drain and rinse with cold water, then drain again.Step 5Whisk ¼ cup tamarind concentrate, 3 Tbsp. brown sugar, 2 Tbsp. fish sauce, 2 tsp. chili-garlic sauce, and ¼ cup hot water in same bowl you used to soak noodles.Step 6Heat 3 Tbsp. oil in a large skillet (at least 12\" in diameter) over medium-high. Add eggs and cook, stirring constantly, until dry curds form, 1–2 minutes.Step 7Add scallion whites, fish sauce mixture, and reserved noodles. Cook, tossing often with tongs, until sauce is mostly absorbed and noodles are well coated, about 3 minutes.→  Wait, what is fish sauce, anyway?Step 8Toss in scallion greens, 2 cups bean sprouts, and half of the chopped peanuts. Cook, tossing constantly, until heated through, about 1 minute more.Step 9Divide noodle mixture among plates. Top with chili-garlic sauce and remaining peanuts. Serve with lime wedges for squeezing alongside.Step 10Serve immediately—and any time you're thinking about ordering delivery.How would you rate Weeknight Pad Thai?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleVERY IMPORTANT: do NOT use Indian tamarind concentrate (like Tamicon). It is TOTALLY different from Thai tamarind concentrate and will make \"pad thai\" that is dark brown, bitter, and so sour. Trust me -- I've made this mistake twice thinking the first time was a fluke or bad fish sauce! Once I found Thai tamarind concentrate, this makes such an easy, delicious dish. Good without bean sprouts if yours go bad before you can use them or you don't have them.KallanAnn Arbor, MI4/22/2021Amazing recipe-super easy to follow and super delicious! Highly recommend!\nPotato101Washington, DC9/8/2020This was not at all what I expected, I'm maybe a little too familiar with restaurant style pad thai and this had a completely different flavor.  The tamarind was right but the rest of it was all different.  Not a horrible recipe, I'd eat it again but definitely don't expect a classic pad thai flavor.tatum01seattle, wa7/30/2020Not 100% sure but... I couldn’t find tamarind concentrate at the store so I used the substitute of “paste” in the ingredients list. It says to use 2 tbsp. Paste with 2 tbsp. Water. However when you do the pad Thai comes out very dark and VERY tamarind-y tasting. Almost not a good flavor at all. Was this supposed to be 2 tsp. Paste to 2 tbsp. Water? That would make much more sense. Anonymous1/11/2020I used the tamarind paste, and I didn't get the gross gray effect other people noticed. I will say though, the paste was completely overpowering both in color and flavor, so I would use about half as much next time. Overall, I was really impressed with how quickly this dish came together and it tasted pretty great!AnonymousColumbia, SC11/5/2019So I'll start out by saying I cook a lot of Thai food. I was excited to try this recipe out, but these flavors are wrong. I made it, took a bite, and knew it would be going directly in the bin. I asked my husband to try it and he wasn't a fan either. I followed the recipe to a T, I just think this is a bad recipe... Sorry 😬Anonymous11/2/2019This was definitely an easy, quick, baseline way to make Pad Thai, but for me, the flavors weren't all completely there (which may have been my fault).  I made the same mistake of using tamarind paste, mixed with water, which is extremely viscous and dark in color.  I wasn't able to find tamarind juice concentrate at Central Market (I live in Texas - it is an amazing grocery store that should have Whole Foods shaking in their boots).  I think the use of the juice concentrate, along with some more complex spices, would have made a huge difference. \nIt may be helpful to include links or examples of exact ingredients that are called for.enegrialbertHouston2/21/2019We like this.  Simple for a weeknight.  I usually throw some cooked shrimp or chicken on top.  Then we put some Hoisin and siracha on top.  AnonymousNJ12/27/2018I roughly followed this recipe, replacing tamarind water for Marmite water, peanuts for cashews and pine nuts, and sweet chilli sauce for Thai Tom-Yum paste because that's all I had in my cupboards and I really needed Pad Thai. Bit of coriander to finish, so good. Thanks for the saucespiration!bethanthorsbyEngland10/28/2018I wanted to fall in love with this recipe, but it didn't wow us. The sauce was a bit bland when I first mixed it and tasted it, so I added a bit of grated fresh garlic and ginger to amp it up. I added a handful of shredded chicken at the end, as the recipe suggests, but I think the sauce was stretched too far because of it — overall the dish was very dry and got gummy quickly. Restaurant Pad Thai definitely uses more oil. These noodles were missing a slickness that they needed. Any ideas for how to use the rest of these bean sprouts and tamarind concentrate? ;-)NYkittyNYJersey Shore, NJ4/24/2018This did not work out for me! I'm pretty sure I know what happened though. At my local Whole Foods there was no tamarind juice but I did find paste in the Indian specialty section. This stuff is amazing, so happy to find it. However, it's the color and consistency of molasses. Even mixed with water, and then the other ingredients, it was very dark. I also think my fish sauce is of a darker hue. Anywhatsit, when it came together everything was grey. Everything. Grey eggs, noodles, everything. I don't like eating grey food generally. \nI can see how this recipe would work, at the end of the day I think I need to stick to a slightly more complex pad thai. Missed the ginger/garlic/cilantro stems/thai chilies\nI'm not used to adding the egg first. I did really like that, stealing it for the future.\nCheers!parkerokincaidChicago, IL4/7/2018Delicious and easy! LOVE the step by step directions!JudithTranchinaNew York4/6/2018This is a delicious dish and I would call it American Pad Thai. I did not use mung bean sprouts did not have any bean sprouts on hand. I also topped this dish with roasted salmon. This is a keeper dish. salucesKaunakakai3/18/2018Explore Bon AppétitRice NoodleNoodlePasta & NoodlesWeeknight MealsQuickEasyOne-Pot MealsMainDairy-FreeGluten-FreeSautéDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-13", "author": ["Condé Nast", "Claire Saffitz"]}