{"id": "d77ce62104c6dbaa75fbe070e3f31bb1", "url": "https://www.bonappetit.com/recipe/pan-roasted-sweet-potatoes-and-tempeh", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Pan-Roasted Sweet Potatoes and Tempeh Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssuePan-Roasted Sweet Potatoes and TempehBy Ali Slagle November 23, 20214.3(18)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman. Food Styling by Pearl Jones. EmailPinterestPrintEmailPinterestPrintThe real star of this vegan dinner is the smoky chipotle oil created by frying chipotles in adobo: It gets used to roast sweet potatoes; to fry tempeh crumbles, which become bacon-y in the process; and even used to dress the apple-cilantro salad. Win, win, win. —Ali Slagle, recipe developer and cookbook authorAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonMesh Sieve$13 At AmazonStainless Steel Mixing Bowls$26 At AmazonIngredients4 Servings2shallots, thinly sliced2chipotle chiles in adobo, coarsely chopped18-oz. block tempeh, crumbled into pieces no bigger than a chickpea½cup grapeseed or vegetable oilKosher salt4medium sweet potatoes (about 1½ lb.), scrubbed, halved lengthwise1small crisp apple (such as Pink Lady or Honeycrisp), cored, coarsely choppedZest and juice of ½ lime⅓cup coarsely chopped cilantroPreparationStep 1Place a rack in bottom third of oven; preheat to 425°. Heat shallots, chipotle chiles, tempeh, and oil in a large cast-iron skillet over high until oil is sizzling, then reduce heat to medium-high and cook, stirring occasionally, until shallots and tempeh are golden brown, 8–10 minutes.Step 2Drain tempeh mixture in a fine-mesh sieve set over a large heatproof bowl. Wipe out and reserve skillet. Transfer tempeh mixture to paper towels; season with salt. Let cool (it will crisp as it cools).Step 3Add sweet potatoes to bowl with drained oil and season with salt; turn to coat. Arrange sweet potatoes cut side down in reserved skillet; set bowl with remaining oil aside. Roast sweet potatoes, undisturbed, until golden brown and tender, 25–30 minutes.Step 4Meanwhile, add apple, lime zest and juice, and cilantro to reserved bowl with oil and stir gently to coat; season apple salad with salt.Step 5To serve, transfer sweet potatoes to a platter. Spoon tempeh mixture over and top with apple salad.How would you rate Pan-Roasted Sweet Potatoes and Tempeh?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThe Flavors were good. I didn't have really much oil come off the tempeh mixture and my tempeh was sort of crisped. Not sure I would go through this effort again.CookRye, NY3/21/2022I made this recipe to have something to eat at the office for lunch this week, and it did not disappoint. Great mixture of textures and flavors! As earlier comments note, 8 oz of tempeh is really only about 2.5 servings, so I used three sweet potatoes instead of four, which gave me enough topping for the three servings. As I'm not a fan of beauregard or jewel sweet potatoes (too watery for my preference) I used a mix of Hannah and Japanese sweet potatoes, which continue to have a nice texture even after sitting in the fridge for a day or two after cooking. I added a drizzle of tahini, which finished it off perfectly. Looking forward to making this again! KayleePhiladelphia PA2/9/2022Great recipe - prepared it twice already, exactly as written. What a delicious and satisfying dinner for two trying to do good. Fit FoodiesPark Falls WI1/25/2022Wow!  This was a FABULOUS recipe. I was looking for something unique to do with tempeh and this did not disappoint. My husband, a big foodie said he LOVED it. Next time I might add a 3rd pepper. Also, the tempeh did not crisp up as promised. Next time I’ll. Lay it flat on paper towels, perhaps that will help. Also, I wondered how much shallots should be used. Shallots come in all sizes. Our shallots amounted to a little more than 1/4 cup. \n\nAll in all though - it was so delicious!  Don’t skimp on the apple salad. It pulls it all together. 😊BS0901Phoenix 1/20/2022I love these fresh, addictive, and pantry friendly flavours. The spice level is lovely. My only issue is that the tempeh did not crisp (that could have been my poor technique), and that the topping to potato recipe seems off. 8oz of Tempeh is at most 2.5 servings. I woul consider doubling the toppings or reducing the potato for a better serving size.Anonymous801101/20/2022Explore Bon AppétitVeganVegetarianSweet PotatoRoastWeeknightEasyQuickChipotleChileVegetableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Ali Slagle"]}