{"id": "d7804444053b7fa90a359d306a5a4976", "url": "https://www.bonappetit.com/story/jammy-pepper-pasta-salad", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "Jammy Pepper Pasta Salad Is Your Date to All the Summer Picnics | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Pasta Salad That Won’t Get Weird at the PicnicIt’s packed with jammy, sweet bell peppers and topped with ricotta salata and hazelnuts.By Alex BeggsJune 12, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kat BoytsovaFacebookTwitterEmailYou might be familiar with the congealed mayo crime scene, a summer tragedy. What started as a wonderful idea—old school pasta salad with green olives and an entire jar of Hellmann’s!—turns into slimy sludge as the sun beats down on your super cute picnic. That’s why we set out to develop a summer pasta salad that can stand up to the heat, and maybe even bring a little itself. Something that travels well, tastes like summer, and matches a variety of plaid blankets. Molly Baz’s jammy pepper pasta salad is what we got, and we’re extremely happy about it.It stars sweet bell peppers (we’ll leave the colors up to you; no comment on green) that get the caramelized onion treatment with spicy chiles (if you want), garlic, thyme, salt, a little sugar to help everything brown, and vinegar in a Dutch oven over medium-low. It’s mostly hands-off at this point, a stir here and there, until the peppers get silky (give it around an hour). That’s essentially your sauce, and it’s reminiscent of your favorite Italian salad dressing with that sweet-spicy-tangy vibe. I also call it lip-smacky, for which the thesaurus had no other alternatives.The rest of the salad can come together in the meantime: quickly pickle some red onion for a hit of acid, boil some rigatoni (the preferred pasta to catch the sauces in its outer ridges and inner tube), toast some hazelnuts, dig around the closets for that picnic blanket with the tarp-thingy on one side. Once the peppers are ready, combine everything and top with a cheese that won’t melt or, shudder, sweat in the sun, like creamy-salty ricotta salata. A few tears of fresh basil and you’re ready to go.The jammy pepper mixture, we also realized, would be incredible as a bruschetta/toast topping, or served on a platter with ricotta, or squished into a veggie sandwich. It’s as versatile as that tie-dye shirt you’re wearing everywhere this summer. Yeah, we’ve seen it. You look great. You’re really pulling it off. It’s amazing how appropriate it is for every occasion, just like...this...recipe...Get the recipe:Jammy Pepper Pasta SaladThis spicy, sweet, and punchy pasta salad is perfect for a hot summer picnic when you need your dishes perfect at room (ahem, air) temperature.View RecipeExplore Bon AppétitBell PepperPicnicPastaSaladSummer SidesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-12", "author": ["Condé Nast", "Alex Beggs"]}