{"id": "d7a6e73c6a937422c919f8324371e924", "url": "https://www.bonappetit.com/story/gluten-free-carrot-cake", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "This Gluten-Free Carrot Cake Made BA Staffers Pretty Much Lose Our Minds | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Gluten-Free Carrot Cake Made BA Staffers Pretty Much Lose Our MindsThat's how incredible it is.By Amanda ShapiroMay 1, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Chris Morocco, Prop Styling by Emily EisenFacebookTwitterEmailCarrot cake is the best cake. Yeah, I said it. The reason it's the best cake is because normal cake is boring, and carrot cake is full of adventure in the form of nuts! raisins! spices! and, uh, carrots! Whereas many cakes are dry, carrot cake is almost always—pardon the term—moist, due to the carrots involved. You have to be pretty baking-impaired to end up with a dry carrot cake. Still, in my 31 years of carrot-cake consumption (yes, I was eating carrot cake at my birth), I've had some sub-par versions. The biggest downfall is not enough stuff. Every bite of carrot cake needs to have stuff: a nut here, a raisin there, and carrot in every bite, of course. It's not called \"flour cake,\" people! The other mistake is not using cream cheese frosting. Cream cheese frosting is the only frosting for carrot cake, full stop. No buttercreams allowed. We all know that the point of frosting is to mainline sugar directly into our bloodstreams, but the cream cheese cuts the sugar with just enough tang to take the glucose-edge off.All of this is to say, when I asked the Healthyish food editors to tackle a carrot cake recipe, I had a lot of criteria. Then I also decided that it should be gluten-free, because I like to torture them. (Me to the food editors: \"Let's make cookies you can eat for breakfast! How about gluten and dairy–free brownies?! What about a turkey burger that's not overcooked and gross?) They tolerate me, then they produce something brilliantly delicious. Of all the carrot cakes I've consumed, this may very well be the best version I've ever tasted, gluten-filled or gluten-free, and everyone else who's tried it has agreed.Senior food editor Chris Morocco, who developed this recipe, went in with a 100-percent almond flour base, and it totally paid off. (He credits Martha Rose Shulman for the inspiration.) No messing around with GF flour blends, which vary widely and don't always produce consistent results. The other great thing about this recipe is that it comes together like any other cake: dry ingredients (almond flour, baking soda, baking powder, spices) in one bowl; eggs, sugar, and vanilla in another bowl; mix together with the add-ins and some coconut oil, and bake for just over half an hour. Morocco took my \"tons of stuff\" mandate so much to heart that his first version fell apart under the knife and he had to scale back a little on the add-ins. Speaking of those, he made the inspired decision to use golden raisins as well as unsweetened coconut flakes. Because it's so moist (sorry!), the cake will stay delicious for days—just be sure to keep it in the fridge.And now let's talk about this frosting, because it was my turn to be dubious when Chris told me that he'd mixed some Greek yogurt in with the cream cheese. Did he go one healthyish step too far? I asked myself before taking a bite.  The answer is a solid \"HELL no.\" The ⅓ cup of Greek yogurt that makes its way into this otherwise-classic cream cheese frosting is nothing but a delight. This frosting has a bit more tang and a pillowy texture, like a super-luxe face mask. I ate a little off the side of the cake, then I ate a little more, and a little more, and... Well, some days you eat cake for dinner. And, if that's what's happening, well, it better be your favorite cake.I can't sell it any harder than that:Gluten-Free Carrot CakeAlmond flour is a wonderfully sweet, nutty complement for fresh carrots, walnuts, and raisins.View RecipeExplore Bon AppétitHealthyishRead MorecookingBreakfast Cookies Are the Reason We're Getting Up In the MorningBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-01", "author": ["Condé Nast", "Amanda Shapiro"]}