{"id": "d7d69b82349fd05b0a7c176574f19946", "url": "https://www.bonappetit.com/recipe/spicy-steak-lettuce-wraps", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Spicy Steak Lettuce Wraps Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpicy Steak Lettuce WrapsBy Molly BazJune 2, 20194.5(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintLettuce wraps might be our all-time favorite weeknight summer dinner—minimal cooking, maximum flavor and freshness. And if your only experiences with short ribs have been in their braised form, then you're in for a treat. Sliced thin and generously marinated, as they are here, they're quick-cooking, tender, and packed with flavor, but they're also delicious grilled whole to a juicy medium-rare; just take care not to overcook them. Want to make this a lighter meal? Lose the rice and sub in some herbs and crunchy, quick-pickled veggies.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketPlate$55 At Bon Appétit MarketMicroplane$16 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAForkSalad Spinner$40 At AmazonPlatter$29 At AmazonPlastic Bag$11.70 At AmazonSmall Bowl$13 At AmazonLarge Skillet$84 At AmazonTongs$13 At AmazonIngredients4 servings1lb. boneless beef short ribs1cup short-, medium-, or long-grain white rice (NOT parboiled, converted, or quick-cooking) (optional)1red Fresno chile12\" piece ginger4garlic cloves3limes, divided1Tbsp. light brown sugar2tsp. toasted sesame oil2tsp. kosher salt, plus more1head of red leaf lettuce¾cup roasted, salted peanuts1English hothouse cucumber1cup cilantro leaves with tender stems2Tbsp. vegetable oil, dividedPreparationStep 1Place 1 lb. boneless beef short ribs on a plate or small rimmed baking sheet and freeze uncovered for 15 minutes. This makes it easier to slice.Step 2Time to start your perfect pot of rice if you want it!Step 3Finely grate 1 red Fresno chile, 1 2\" piece ginger, and 4 garlic cloves into a medium bowl. (If you're sensitive to spice, maybe start with a half of a chile—you never know how hot they're going to be!) Cut 1 lime in half and squeeze juice into bowl. Cut remaining 2 limes into wedges and reserve for serving.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Add 1 Tbsp. light brown sugar, 2 tsp. toasted sesame oil, and 2 tsp. salt to bowl with chile mixture and stir with a fork to combine.Step 5Cut short ribs crosswise against the grain as thinly as possible (and no more than ¼\" thick), creating lots of small strips. Add to bowl with marinade and use your hands to massage marinade into meat until coated. Let sit at room temperature at least 15 minutes (or as long as 2 hours!).Step 6Meanwhile, tear 1 head of red leaf lettuce into large hand-sized pieces. Rinse and thoroughly dry in a salad spinner. Arrange on a large platter.Step 7Place ¾ cup roasted, salted peanuts in a resealable plastic bag, seal, and coarsely crush with the bottom of a heavy mug or glass. (You could also just chop them, but this is the cleanest way to go about it.) Transfer to a small bowl; set aside for serving.Step 8Slice 1 English hothouse cucumber in half lengthwise, then cut crosswise into ¼\"-thick half moons. Arrange on platter alongside lettuce. Arrange 1 cup cilantro leaves with tender stems and reserved lime wedges on platter.Step 9Heat 1 Tbsp. vegetable oil in a large (12\") nonstick skillet over medium-high until shimmering. Add half of short ribs in a single layer and cook, undisturbed, until deeply caramelized on one side, about 3 minutes. Turn with tongs and continue to cook until second side is deeply caramelized, about 1 minute longer. Transfer to platter. Return skillet to medium-high heat, add remaining 1 Tbsp. vegetable oil, and repeat with remaining meat.Step 10Arrange cooked rice, steak, reserved peanuts on platter with vegetables (if your platter is too small, serve rice and peanuts alongside in separate bowls).How would you rate Spicy Steak Lettuce Wraps?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleI made these for dinner tonight - YUM!  I used Shell steak as a substitute for the short ribs - but otherwise kept to the recipe.  I also used some fresh matchstick carrots and some sliced radishes for extra crunch (and it made a beautiful presentation).   I agree with other reviewers that it would have been nice to have a sauce to accompany the dish; I had some Peanut Sauce in my refrigerator and used a bit of that - it helped to amp up the peanut flavor.  Excellent - can't wait to make it again. FFNJ076457/24/2020Instead of rice, use noodle.  I will upgrade you taste with lettuce and herb wrapsAnonymous3/5/2020I haven't made this yet, but I plan to soon. Could NY strip work as an alternative? Anonymous9/17/2019I think the components of this dish are great but I did feel the amount of salt overwhelmed the flavor. I think I would do half the salt and add more to taste.CflcflcflSacramento9/7/2019Molly...this was exceptional.  I am always looking for light easy recipes and this hit the target.  My husband, who is so not veggie, ate his on some flour tortillas, and raves about it as well. lg_kelly3860Austin 9/3/2019This was really delicious. Pretty reminiscent of some Vietnamese dishes. I would use two chili’s cause I like it spicy. Also I used a boneless ribeye from our local butcher, added sprigs of mint, lightly pickled the cucumbers and made a Vietnamese spicy fish garlic spicy sauce on the side. Amaze-balls.AnnspacemarieOakland, CA8/23/2019This was such an amazing dish. My friend and I decided to try out a new recipe instead of going out, and we're absolutely making this again tonight! The lettuce, cucumbers, cilantro and lime were so fresh that it really complimented the savory meat. As my friend has put it, \"it was like having a really nice restaurant dinner in the comfort of our own home\". evelyngarza24Houston, TX8/18/2019Used skirt steak instead of short ribs as that is what we had in the fridge. Just served the meat over rice and didn’t do all the extra things. Meat was tasty and caramelized well! Next time we will add more veggies with the rice, a la stir fry style.  AnonymousColorado7/3/2019The meat was super tender and flavorful! Anonymous6/25/2019Made the steak only and served it with rice as well as used it in a sandwich for work paired with sharp cheese. Delicious! Flavour is even better if marinated overnight up to 3 days.sumi-e6/19/2019Super easy recipe and is quickly becoming my favourite last minute dinner. The beef marinade is so flavourful and caramelises beautifully. The beef balances out perfect when put together with rice and lettuce! AnonymousAustralia6/19/2019Loved this recipe! I used extra firm tofu instead of short ribs with the same marinade. I pan fried the tofu then stuck it in the oven for 15 minutes at 375 – crispy and delicious vegan alternative. I also added a peanut sauce on top (equal parts water and peanut butter plus a little bit of soy sauce, garlic, fresh ginger and rice vinegar). Light with a little zing! Can't wait to make this dish all summer!AnonymousColumbus, OH6/11/2019Wow, this was really good, and easy. I didn't have access to to short ribs so I used flank steak and it worked beautifully. Make sure you get it nice and browned and caramelized; it ends up with the texture and umami of crispy bacon but with an Asian beefy flavor. Yum!ed_hawcoMontreal6/10/2019Super easy dinner! I grated lime zest into the marinade, and I think it added a nice extra zing. Also mixed up a quick Vietnamese fish sauce recipe (sugar + fish sauce + vinegar + water + julienned carrots) that helped add some moisture and flavor to the rice. I also served this with sprigs of mint and Thai basil in addition to the cilantro. Made the leftovers into a rice bowl the next day and that was delicious too.stefanie yeungWashington, DC6/6/2019Delicious summer meal! I subbed out the rice in favor of quick pickled red onions and radishes which were great. I imagine the rice would also be good, but I loved the zing and crunch offered by the red onions and radishes. Served this al fresco with a chilled soup for an appetizer and it was the perfect fresh, light, and summery meal. AnonymousBerkeley, CA6/5/2019Explore Bon AppétitWrapShort RibBeefMeatSteakLettuceLeafy GreensVegetableEasyWeeknight MealsQuickMainDairy-FreeGluten-FreeSautéLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-02", "author": ["Condé Nast", "Molly Baz"]}