{"id": "d7e9857c1586ad2ccf9ea548b1d310b5", "url": "https://www.bonappetit.com/story/chrissy-teigen-cravings-hungry-for-more-podcast", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Chrissy Teigen on the Long Road to Making Her Second Cookbook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureChrissy Teigen on the Long Road to Making Her Second CookbookTeigen came on BA Foodcast to talk about how she got out of a “dark place” of postpartum depression to write ‘Cravings: Hungry for More.’By Alyse WhitneySeptember 18, 2018FacebookTwitterEmailAubrie Pick/Clarkson PotterFacebookTwitterEmailAlmost a year ago, Chrissy Teigen started a frenzy on Instagram when she posted a photo of her daughter, Luna, chowing down on garlic-soy ribs. This was one of the first sneak peeks into her highly anticipated second cookbook, Cravings: Hungry for More (a follow-up from the 2016 bestseller Cravings). The book is now available in stores and online, along with a cookware and tabletop line at Target, but before you get your hands on a copy, you can make her deep-fried ribs recipe with a mere four ingredients: baby back ribs, soy sauce, garlic, and black pepper. Teigen came on the Bon Appétit Foodcast to share the difficult process of making this book while battling postpartum depression; how she was “ballsier” about using more strong, pungent Thai recipes inspired by her mom; and how she and her husband, John Legend, work together in the kitchen. Read on for a condensed version of her conversation with BA editor in chief Adam Rapoport, get two recipes from the new cookbook, and listen to the podcast below. —Alyse WhitneyContentThis content can also be viewed on the site it originates from.What did you have for breakfast this morning?I had half cauliflower, half oats porridge with shiitake mushrooms and bone broth, with a poached egg on top.Did you make that yourself?I did, yes. We make it about once a week and then freeze it. It sits and gets better and better, and it helps me with milk production.How did having kids impact your cooking routine?I think that since [Luna] has been so good at sleeping pretty much her whole life, we always knew that at 7:30 we would be able to kind of shut off, open the bottle of wine, and really enjoy making a meal together. We do eat really late, and I think we’re lucky for that. We would never be able to eat dinner at 8:00. We’ve never been those people. Knowing that when they’re gone, they’re actually asleep and out of our hair, that’s really something to look forward to throughout the day. Not that we don’t completely enjoy the time with them all day.In your new book, Cravings: Hungry for More, you write pretty candidly that it was a challenge having just had your first child and dealing with being a new mother. What was that process like of writing this book?I looked back through the recipes [of this book] and for maybe a quarter of them, I was pretty heavy duty in the midst of postpartum depression. I was really in a dark place for it, and obviously that affects everything—not just mentally, but physically. You’re exhausted. Your bones hurt. It’s hard to look at food because you don’t want to eat it. It’s pretty torturous to have to write recipes when you don’t have an appetite yourself.I think once we really realized and honed in on the issue, everyone was able to understand that we had to stop. This isn’t going to be good for anybody. I’m not going to put out the recipes I love. I’m not going to be able to taste the recipes I love. So we just put a hold on everything for about five months, until I started feeling better, and it changed everything.You have such a tight relationship with your readers and followers. It seems like they expect you to be exuberant and funny and candid and on, and it’s hard to be on when you’re not feeling on.Exactly. It’s really, really tough, and you can’t just flip a switch and turn it on. I’ve never been good at faking emotions. I’m not good at hiding anything. Everyone knew already. It was just something that was not really spoken about. It was the elephant in the room, basically. It was very obvious to everybody, but I personally couldn’t tell if I was just tired from being a new mom, or if everyone feels like this, or am I just being moody? It wasn’t until having a doctor actually diagnose it that we were able to feel comfortable telling everybody. And everyone was so beyond understanding.In terms of the writing process, you work with a co-author, Adeena Sussman.Adeena and I have such similar brains. What I love most about her is that she just gets equally excited about food. She actually gave me the balls to feel I could try anything . I’d say, “Do you think this cheese would go well with this?” And she would say, “How are you going to know if you don’t try it?” I was always very by-the-book. I used to stick to recipes. She taught me how to just go with my gut and palate. We have the brain of a stoner, basically. We always called ourselves stoners who don’t smoke. More important than a recipe is being able to establish the base, like how to do a perfect poached egg or make a fluffy biscuit. Those tips are things I love and and I need to hear too because I’m just a home cook; I’m not a chef in any way. Having her to get the recipes technically perfect was great.On the stoner note, I feel like looking at your cookbooks, it’s kind of like walking into Hillstone and wanting to order the entire menu.I’m very big on adjectives in the book too. As you can see, everything is gooey-ooey.You have cheesy chicken Milanese. As if chicken Milanese isn't good enough where you got a breaded crispy cutlet with the arugula and tomatoes on top, you decided to fill this cutlet with gooey, oozy cheese when you cut into it.I feel very anti-that. I kind of make fun of it too. When you hear [gooey-ooey], it sells it and it makes people really want to make that recipe. When they’re flipping through chicken Milanese, I mean that’s fine, but to really hear all the goodness that goes into it and how they’re going to sell it to their friends and family when they present it. I want people to be really proud of the things they make. Even when I’m in a group text with friends and I’m telling them what I’m making for dinner, I include all those words too to lure them into coming over to my house. I’m like a used car salesmen with food.Chrissy Teigen’s Cheesy Chicken MilaneseChrissy’s Milanese recipe from ‘Cravings: Hungry for More’ is stuffed with cheese and topped with arugula salad.View RecipeLet’s say you were to invite me over to dinner. What is a manageable entertaining meal that you might make for, say, eight people tonight?I love a good braise. I’m a fan of things that have been cooked slowly, all day, and have turned themselves into a pot of love rather than a quick meal. Especially if you’re coming over. I love doing an osso bucco or something. I love a hearty stew over smashed potatoes. And I’m very into one-pot meals. Honestly, I get really nervous cooking for actual foodies.You mentioned in the intro that you are sharing more of the flavors that you grew up with on your mom’s side, who is Thai.I was always really nervous. In the first book one of my biggest stresses was that mom chapter because it’s really hard to get a recipe out of her. Anyone that has an Asian mom or an Italian mom—someone from a culture of really loving to cook at home—it’s hard to get a recipe out of them. Everything changes, depending on what’s in the fridge already, or how they’re feeling that day. They don’t write anything down. They don’t measure. And I was scared that people would be scared to make Thai food. It’s pungent, it’s strong, it’s fish sauce, it’s chunks of garlic. It can be a lot for people.[From the first book] I didn’t think anyone would stuff ground pork into a cucumber and boil it with chicken broth. But they did, and they loved the flavors and I thought that was so cool. So we were ballsier about the Thai chapter in Hungry For More. This one is definitely more extensive and not as traditional. We do have a pad thai carbonara, but also you’re going into food from my mom’s village days.There’s a recipe for Thai fried ribs that I was hesitant to put in because it has three ingredients. It’s literally soy sauce, garlic, pepper, and [baby back] ribs, but it’s so delicious. It’s these little ends of ribs and you’re just gnawing on the bone of this jerky-like rib. My daughter loves it, and we all love it. You try something like that and you say, no, this, this has to be in. You have to be comfortable with putting easier things in the book.Chrissy Teigen’s Thai Soy-Garlic Fried RibsMaking ribs at home can be sooooo intimidating. Pretty much every rib recipe involves hours of smoking or slow-baking. Enter Chrissy Teigen’s perfect solution: Fry the ribs!View RecipeIt’s so often the easier things that people end up making.I thank God for social media because otherwise I wouldn’t really know what people are making the most. I think my Cacio e Pepe, which was one of the easiest recipes in the last book, is made 20 times more than anything else. I was wondering why people gravitate toward things like that, and then I realized it’s the simplicity.If John has to make one thing for you, what’s he cooking?John’s an amazing cook. He cooked seven days a week while I was pregnant. He was always my sous; he loves to chop things. You teach him one thing and he remembers it forever. Now he’s become a chef in his own right. I’m like, you’re really trying to take my title in the house! He’s become so good.More Chrissy Teigen right this way:Thai Soy-Garlic Fried RibsCheesy Chicken MilaneseRead the intro from her first book, CravingsAubrie Pick/Clarkson PotterRecipes and images reprinted from Cravings: Hungry for More. Copyright © 2018 by Chrissy Teigen. Photographs copyright © 2018 by Aubrie Pick. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House LLC.Explore Bon Appétitchrissy teigenCookbooksPodcastsThaiRead MorecultureChrissy Teigen Refuses to be One of Those \"Dead-Inside Laughing-with-a-Salad Chicks\"By Chrissy TeigencultureChrissy Teigen on the One Thing That’ll Save Any Ruined DishBy Elyssa GoldbergRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Alyse Whitney"]}