{"id": "d80453d62c915ef488d079686649677d", "url": "https://www.bonappetit.com/story/creamed-eggs-all-together-now", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "You Can’t Go Wrong with “Creamed” + “Eggs” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsYou Can’t Go Wrong with “Creamed” + “Eggs”The indulgent brunch dish at All Together Now proves it.By Adam RapoportJuly 22, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.As soon as I spotted “creamed eggs” on the menu at All Together Now, I knew I had to order them. I just didn’t know what they were.But how could they not be great? “Creamed” + “Eggs” = guaranteed tasty. What showed up on my plate at this new-ish all-day cafe in Chicago’s Ukranian Village was...not what I expected. I guess I was thinking something more British-y—like coddled eggs in cute little ramekins.Instead, imagine a warm, velvety smooth egg salad fit for some duchess or czar—that’s chef Abigail Zielke’s creamed eggs. She grew up in Wisconsin and got the recipe from her mom, who inherited the recipe from her very Southern mother.As professional chefs will do, Abigail zhuzhes up the dish with some pro-level technique. She makes a basic roux and whisks in some heavy cream or milk to form what’s essentially a bechamel sauce. She then adds hand-torn, just-under-hard-boiled eggs, which she folds into the creamy sauce. The yolks melt into the bechamel, giving it a spring-timey yellow hue.At the restaurant, Abigail serves the luxurious mixture over a bed of braised collards atop a thick slab of charred toast. A sprinkle of Aleppo pepper and a few pickled pearl onions help offset all that creaminess.I thought I would only make it through a few bites, given how rich the dish is. But I ended up demolishing it—it’s that delicious. An indulgent, but perfectly balanced brunch/lunch order. Which brings me back to zeroing in on the creamed eggs in the first place. Menus are like the SATs. Even if you don’t know which answer to bubble in (or in this case, what exactly you're ordering), follow your first instinct. You’ll generally be right.Go there: All Together NowExplore Bon AppétitHighly RecommendRestaurantsChicagoBrunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-22", "author": ["Condé Nast", "Adam Rapoport"]}