{"id": "d80852a8058dd3e5b1e02df761cf7f2c", "url": "https://www.bonappetit.com/recipe/bas-best-molten-chocolate-cake", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "BA's Best Chocolate Lava Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBA’s Best Chocolate Lava CakeBy Chris MoroccoPhotography by Alex LauFebruary 9, 20224.6(31)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintIf dark chocolate running in rivulets down whipped cream mountains is the backdrop in all of your greatest fantasies, this alluring molten chocolate lava cake recipe is the dessert you’ve been looking for. The spongy cake has an unabashedly liquid center that bursts forth the moment the chocolaty dam is broken by spoon. Many recipes achieve this effect by purposely undercooking the cake, so that the middle is raw batter. Effective, but not the most delicious.In our version, a spoonful of chilled ganache is placed at the center of the cake batter. As the bake time ticks down, the ganache is rendered molten as the batter shores up around it.You’ll need four 6-oz. ramekins to pull off the recipe (though a jumbo cupcake or muffin tin will work in a pinch). We like to butter and then line the individual dishes with demerara or raw sugar (instead of the more typical flour or cocoa powder) for little pops of texture. If you’d like to serve with a dusting of powdered sugar or a scoop of vanilla ice cream, be our guest. Watch how this chocolate lava cake is made here or take a chance on chocolate lava cake’s caramel counterpart instead. –Joe SevierEditor’s note: This recipe was originally published as BA’s Best Molten Chocolate Cake on February 2, 2016.Ingredients4 servings¼cup heavy cream7ounces bittersweet chocolate, chopped into small pieces, divided6tablespoons unsalted butter, plus more for ramekinsDemerara or raw sugar (for sprinkling)3large eggs⅓cup light brown sugar1teaspoon vanilla extract3tablespoons all-purpose flour½teaspoon kosher saltSpecial EquipmentFour 6-ounce ramekinsPreparationStep 1Heat cream in a small saucepan over medium until just beginning to simmer. Place 2 oz. chocolate in a small bowl; pour hot cream over. Stir until smooth. Chill ganache until firm, at least 1 hour.Step 2Preheat oven to 425°. Coat ramekins with butter and sprinkle with demerara sugar, tapping out excess.Step 3Combine 6 Tbsp. butter and remaining 5 oz. chocolate in a medium heatproof bowl set over a large saucepan of barely simmering water (do not let water touch bowl); stir constantly until chocolate is melted (you can also do this step in the microwave).Step 4Using an electric mixer on medium-high speed, beat eggs and brown sugar in a large bowl until light and tripled in volume, about 4 minutes. Beat in vanilla.Step 5Gently fold melted chocolate into egg mixture until incorporated. Fold in flour and salt until smooth.Step 6Divide half of batter among prepared ramekins (about ⅓ cup each). Place 1 mounded Tbsp. ganache in the center of each partially filled ramekin. Divide remaining batter among ramekins.Step 7Bake until tops are firm but cakes wobble slightly when jiggled, 13–15 minutes. Let cool 30 seconds before inverting onto small plates. Serve immediately.Do Ahead: Ganache can be made 1 week ahead. Tightly wrap and keep chilled. Cakes can be assembled 1 week ahead. Tightly wrap with plastic in ramekins and freeze. Let sit at room temperature 1 hour before baking.How would you rate BA’s Best Chocolate Lava Cake?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleLoved this! Will make again and again--if you make ahead, note that your ganache center may sink to the bottom. Added cardamom and might try saffron or orange next time around.SumaiyaSan Francisco, CA12/30/20211. I love that this recipe takes a lot of the stress out of lava cake – – with the ganache in the center you don’t have to obsess over the timing. Also no raw eggs, so pregnancy friendly!\n2. This recipe is slightly more work than other lava cakes I have made, however I would say the effort is worth it. \n3. I did not follow the directions and put too much batter in each cup. This only made three cakes. Obviously a user error. \n4. I love that this cake can be refrigerated raw and baked off at will. I’m excited to have this recipe to throw down once dinner parties are an option again – – coming in hot with a lava cake always makes you look like a gSarah TMaine4/12/2021Amazing! Super rich though (I definitely recommend adding a fruit topping like raspberry or strawberry to help combat the richness of it) but overall 10/10, I could’ve shared 1 ramekin with my significant other due to the richness! Definitely saving this one!JuliaLos Angeles, CA2/15/2021I used a very high quality chocolate and this was absolutely delicious.  I cooked it for 13 minutes, and probably only needed 11 or 12, so I will check it earlier next time.AnonymousMassachusetts4/26/2020I just made these and they turned out great! I baked for 13 minutes and the cake was a little bit on the dry side, but my scale was out of batteries so I had to kind of guesstimate the amount of chocolate (side note, can all math be about chocolate? I think I'd like it more if it was), but honestly, I think it would just soak up ice cream or creme anglaise that much better. So not really a problem. The batter was SO LIGHT! Like, it held its shape when I scooped it into the ramekins, which was really cool! It made the baked cake very airy and nice. I baked one cake and froze the other 3 to make fresh when I'm feeling lazy and need some chocolate. Stellar job as always!honeybeebutchMinneapolis9/12/2019I made these for a special Valentine's Day dinner and they were superb!!! Easy to make and tasted like a 5 star restaurant dessert. Anonymouspompano beach2/15/2018Explore Bon AppétitCakeDessertAmericanChocolateOther IngredientsNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-02-02", "author": ["Condé Nast", "Chris Morocco", "Alex Lau"]}