{"id": "d81336b7cbb4187279c5e42163cb5907", "url": "https://www.bonappetit.com/recipe/cashew-nam-prik", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "Cashew Nam Prik Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCashew Nam PrikBy Andy BaraghaniJuly 26, 20194.9(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintNam prik is a chile-based dip found all over Thailand. This version is a riff on nam prik ong, which is typically found in northern Thailand and made with pork or beef. We swapped the meat for cashews; it gives the dip a healthyish twist as well as a smoother, creamier texture.IngredientsMakes about 3 cups1cup raw cashews6Thai chiles or 4 Fresno chiles, chopped2medium shallots, chopped1lemongrass stalk, tough outer layers removed, white and pale green parts coarsely chopped5garlic cloves, coarsely choppedFinely grated zest from 2 limes (about 3 tsp.)1tsp. kosher salt, plus more3Tbsp. canola oil1Tbsp. tomato paste8oz. cherry tomatoes, halved1Tbsp. fish sauce1Tbsp. fresh lime juice1Tbsp. coarsely chopped cilantro leaves with tender stemsBibb or Little Gem lettuce leaves, sliced cucumbers, sliced mango, and soft-boiled eggs (for serving)PreparationStep 1Pulse cashews in a food processor until pieces are no larger than ¼\". Transfers cashews to a medium bowl (it’s okay if some of the cashews have gone all the way to powder, which will thicken the dip).Step 2Pulse chiles, shallots, lemongrass, garlic, lime zest, and 1 tsp. salt in food processor until very finely chopped. Scrape down sides and continue to pulse until a coarse paste forms. Transfer curry paste to a small bowl.Step 3Heat oil in a medium saucepan over medium. Add cashews and cook, stirring often, until golden brown in most spots, 4–6 minutes. Add curry paste and cook, stirring often, until slightly darkened, about 3 minutes. Add tomato paste and cook, stirring, until mixture starts to stick to bottom pot, about 2 minutes. Add tomatoes and a splash of water and cook, scraping any browned bits that may have stuck to bottom of pot, until tomatoes are completely broken down and mixture is thickened, 7–10 minutes.Step 4Remove from heat and stir in fish sauce and lime juice. Taste and adjust seasoning with salt.Step 5Transfer nam prik to a medium bowl. Top with cilantro. Serve nam prik warm with lettuce, cucumbers, mango, and eggs alongside.How would you rate Cashew Nam Prik?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleI use this as a seasoning agent for Shrimp, dipping for veg (obviously) and as dukkah! This is the recipe I'd take to my grave. Nitya San Jose, California11/16/2021Delish ! I've made this again and again with less spice, you want this. Yum ! Chef RachelleNYC8/4/2021Not to be that person, but I don’t have a food processor so I made some pretty big changes to the prep and this still turned out delicious! I just added everything into a container and used my immersion blender, then threw the mixture in a pan over heat to let it get a little caramelized and develop depth of flavor.  I’m currently dipping cantaloupe, green beans, and a soft egg in it, would definitely recommend.\n\n As a bonus this nam prik is Whole30 compliant if you replace the canola oil. AnonymousPortland, OR8/25/2020So delicious! Should have heeded the advice of my fellow commenters - I reduced the chilies due to what I had on hand, and I was disappointed in the spice level. Follow the recipe! \n\nI didn't have lemongrass, so I used some green curry paste I had in the fridge, which totally worked. AnonymousSeattle5/27/2020Soo good. Like another reviewer, I was also worried about the heat and using six very ripe Thai chilies, but it was that perfect heat level, not burning and spicy. I only had one lime to zest and it was just fine. You can definitely turn this into a meal if you want to fill up a lettuce cup with some of the dip, soft-boiled eggs, cucumbers and snap peas.AnonymousTexas5/17/2020This was fantastic. I was worried it would be way too spicy-hot as I was making the curry component (using four Fresno chiles) but the end dish had just the right amount of heat. I decided to veganize it by swapping out the fish sauce with ~0.5 teaspoon of Better Than Bouillon No Chicken Base (because I've recently noticed it kind of has a slightly fishy-pungent edge), and it worked out really well. This yields a LOT of dip. I'm thinking about using some of the leftover to stir-fry with some veggies and rice or rice noodles. Thanks for another great recipe!!AnonymousCalifornia5/15/2020My husband said this was one of the best things I ever made. The sauce has richness of flavor and great balance!AnonymousSeattle, WA5/5/2020This was excellent! I couldn't find Thai or fresno chiles, so I went with four small jalepenos (they tend to grow 'em big here in TX). Turned out to be the perfect amount of heat. I think the fish sauce adds great flavor, but could also easily be omitted to make this a vegan recipe. Will absolutely make this again and again.AnonymousAustin, TX4/29/2020Good balance of bright, tart, salty, spicy and funky flavors. Everything that I want out of something Thai-inspired. I slightly over-blended my cashews and used chopped larger tomatoes because that's what I had, and it still turned out great. Will make again. Goes great on eggs and carrots. AnonymousPasadena, CA2/26/2020Wow, this is so good! Extremely flavorful, and just the right amount of spice. Can't wait to make again. AnonymousPortland OR1/16/2020This was spicy, nutty, and soooo delicious. Will definitely make again for a dip that doesn't feel boring!AnonymousLos Angeles8/5/2019Explore Bon AppétitDipSpreadsCruditéThaiSoutheast AsianAsianCashewNutLemongrassHerbs & SpicesThai ChileChileVegetableQuickEasyStarterSnackDairy-FreeHealthyishSautéNew Year'sDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-26", "author": ["Condé Nast", "Andy Baraghani"]}