{"id": "d81d198a8b621fe5948056b11d0a504d", "url": "https://www.bonappetit.com/story/blue-light-glasses", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "These Blue Light Glasses Are My Practical and Stylish Solution to Daily Screen Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Glasses Are My Practical and Stylish Solution to Daily Screen TimeMy cute and study frames are like a vacation for my eyeballs.By Emily SchultzMarch 26, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!I’m the kind of person who leaves something in their online cart for three months before clicking “buy.” Pre-pandemic I would say things like, “we should hang out sometime,” with no real plans to actually do so. And please don’t ask me to choose a favorite nut butter. What I’m trying to say is that I dread commitment. That’s why I’ve always purchased glasses that are on the cheaper side; there’s no emotional (or financial) regret if I accidentally sit on them, decide they aren’t my lewk anymore, or lose them deep in a tote-hole.Then last summer my optometrist informed me that because of my farsightedness my eyes were tensing up while looking at screens all day and that I should get reading glasses to help them relax a bit. Even better, doc said, was if I bought blue light glasses that could pull double-duty repelling those digitized wavelengths that can mess with our circadian rhythms (among a handful of more sinister suspected side effects). Was it finally time to invest in one nice pair of glasses rather than my environmentally ill-advised practice of buying loads of cheap options?When I found Eyebobs, a Minnesota-based company that makes super-sturdy and incredibly cute glasses, I knew the answer was yes. Their reviews proved reputable, and they had enough but not too many frame options for my easily daunted self. As an Ashkenazi Jew, styles like “Kvetcher” really spoke to me, and the designs felt like a nice range—from the more eclectic shapes like the “1.21 Gigawatts” to the more traditional like the “Waylaid.” For my first pair I went with the chic, cat-eye-shaped “Dorothy” frames in tortoiseshell and I’ve been wearing them all day, every day for the last six months. They still feel tight (regular glasses wearers will know the feeling of loose frames sliding down your nose all day!), chic enough for a compliment or two at the beginning of a Zoom meeting, and so comfortable that my eyes are relaxed at the end of a long day of computer-phone-television tag.“With blue light glasses and readers especially, we are constantly taking them on and off as we transition from in front of our computers and screens to playing with our kids or reading a book,” explained Chelsey Wright, head of design at Eyebobs. “That opening and stretching can really wear glasses down, so we use a super durable hinge and luxury acetate in order to ensure the frame has a long life.” We love a long life!Thanks to Eyebobs’ focus on durability, I don’t see myself needing to buy a new pair of blue light glasses any time soon. Though it saddens me not to rotate between all of their fun frames, I have to remind myself there are plenty of other ways I can imbue variety into my days. Now will it be almond, peanut, or pistachio butter toast today?Photograph by Emma FishmanDorothy Blue Light Glasses (Orange Tortoise)$89 at EyebobsExplore Bon AppétitHealthyishHealthyish Loves ItShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-26", "author": ["Condé Nast", "Emily Schultz"]}