{"id": "d81e6a1ea160002c03fa219260293acc", "url": "https://www.bonappetit.com/story/you-need-a-better-cake-pan", "year": 2020.0, "month": 3.0, "day": 5.0, "content": "The Best Cake Pan is the Fat Daddio's 9-Inch Cake Pan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Need a Better Cake Pan—Specifically, A Fat Daddio's Cake PanFor the name alone!By MacKenzie Chung FeganMarch 30, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.I own cake pans. They are two 9-inch rounds made of dark metal, and I purchased them about a decade ago. The nonstick coating is scratched moderately on one, badly on the other. If you apply enough pressure, you can flex the bottoms in and out, like the lid of a Ball jar. On one, there’s a thin fuzz of rust that that I’ve tricked myself into thinking is stuck-on chocolate cake.Am I you? Are you me? If so, join me in admitting that it’s time to let go. While my pans technically still perform their intended function, they’re not doing me any favors—and when it comes to baking layer cakes, I need all the favors I can get. This week, as I prepare to tackle this Cardamom-Pistachio Carrot Cake as part of the Basically Guide To Better Baking, I’m upgrading to the best cake pan around, Fat Daddio’s.“Fat Daddio’s are the gold standard,” says Basically editor Sarah Jampel, only slightly mortified by having to say the words “Fat Daddio” aloud. “They’re what restaurants and commercial bakeries use, and they’re really heavy duty so they’ll heat evenly and last you a long time.” Fat Daddio’s pans are made of light-colored anodized aluminum. Since dark pans heat more quickly than light pans, using a Fat Daddio’s ensures that the outside of your cake doesn’t cook too quickly, which can result in a burnt-crust-underbaked-middle situation. And their non-reactive coating means you can bake a citrus upside-down cake in it without fear of it tasting metallic.Round cake pans lead to, well, round cakes!\nPhoto by Chelsie Craig, Food Styling by Pearl JonesSohla El-Waylly, who developed the carrot cake recipe, uses Fat Daddio’s pans exclusively—and not just in the Test Kitchen. She says, “My husband and I baked our wedding cake in them. It was five tiers, and each tier had eight cake layers and was about a foot tall. It was too much cake. But those pans are fantastic!” If Fat Daddio’s are good enough for Sohla to entrust with FORTY LAYERS of her own wedding cake, they are certainly good enough for the two birthday cakes I bake a year. (If you’re curious like I was: It was s'mores flavored. “I regret that,” says Sohla, “but I did not have the sophisticated palate I have now.”)Even if you’re not a regular cake baker, Sarah argues that a round pan’s versatility makes it a kitchen essential. “Nothing is stopping you from baking brownies or lemon bars in a round pan,” she explains, “and with a little math you can bake loaf cakes in a cake round, too.” I even pull my busted pans out when I need to roast a small handful of nuts. They’ve served me well. But now it’s time to upgrade.Photo by Laura MurrayFat Daddio's Round Cake Pan, 9 x 3 Inch$14 at AmazonExplore Bon AppétitBasically BakingCakeShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-30", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}