{"id": "d82fac4528e26c6d099b55fc51d2099b", "url": "https://www.bonappetit.com/story/aina-small-farm-directory", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "Want to Buy Produce Direct from Farms? This Site Makes Online Food Shopping a Breeze | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingWant to Buy Produce Direct From Farms? This Site Makes It a BreezeAina connects shoppers with independent growers across the country.By Megan ZhangFebruary 18, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailWhen the pandemic hit American shores early in 2020, grocery stores felt it first. Pantry staples such as flour and rice disappeared from shelves as quickly as they could be replenished, and shoppers who tried to order food online often found it near impossible to snag an open time slot on major platforms like Amazon Fresh and Instacart.Spurred by their frustration, two friends, David Pham and Jason Curescu, built and launched a database called Aina, helping shoppers find small farms that offer delivery. Formerly known as Farms That Are Delivering, Aina now includes more than 1,384 producers across all 50 states—each one vetted manually—and links out directly to the farms’ websites for purchase, pickup, and delivery. By helping shoppers find fresh meat and produce, Aina aims to support independent farming businesses and promote the humane raising practices, transparency, and eco-consciousness that many of these food producers embrace.I initially became curious about Aina at the start of the pandemic as a way to decrease grocery store visits and find ingredients that were scarce in my local supermarket. Plus, it was certainly a win that shopping this way would support small farms around the U.S.Navigating the database is very straightforward. I entered my address and the search engine pulled up farms across the country that offer delivery services to my location (or that allow nearby customers to pick up orders). I further narrowed the search by specifying the meat, seafood, produce, dairy, or prepared goods that I was looking for. I could also filter by purchase type (à la carte, in bulk, as a CSA, etc). From that refined list, I could peruse an array of farms and visit their websites to place an order or to learn more.It was through Aina that I found Liberty Ducks, a family-owned, fourth-generation farm in Petaluma, California. My father had been talking about wanting to try a roast duck recipe, and because the farm offered San Francisco Bay Area residents free shipping with a purchase over $50, we ordered two: one to prepare this week and one to freeze for another time. The order arrived on our doorstep just a day later.When you buy from farms, you’re not only supporting the farmer. You’re also supporting the earth.Aina doesn’t process orders and only directs users to the farms’ websites, so for many shoppers, this will mean placing orders from multiple suppliers in order to cover all their grocery bases. However, throughout my searches I realized that many farms offer free shipping—sometimes with a minimum purchase requirement—so I didn’t mind arranging multiple deliveries, especially for large batches of items with a relatively long shelf life, like cheese, apples, and squash. Hopefully, this also conserved shipping costs for the farm.Though ordering from multiple sites certainly took time, I still found it quicker than in-person supermarket shopping. I also realized that the act of making several small transactions made me more intentional about purchases. While mindlessly browsing a supermarket—whether physical or virtual—can often lead to over-purchasing and wastefulness, the inherent gradualness of shopping at farms one-by-one made me think more about what actually needed to be replenished.For my family, buying groceries from farms hasn’t entirely replaced supermarket shopping. We also still receive and enjoy the Community Supported Agriculture (CSA) to which we’ve subscribed for years. Aina, however, will certainly stay a part of our shopping routine post pandemic. It’s a great way to support hardworking small business owners while stocking up on staples—not to mention saving time on in-store shopping trips. We even discovered several new favorite foods: walnut butter from Central California (a deliciously earthy alternative to peanut butter) and lobster fresh from Maine (for special at-home birthday dinners and other occasions), to name a couple. Aina is also the first place I’ll go to find meat, as the database makes it easy to discover farmers who are committed to raising animals humanely and shares information about heritage breeds. Plus, the freshness and quality of the meat we’ve found through Aina (like the duck from Petaluma) has been unparalleled.And many items, such as pies and fruit baskets, are delivered with a warm human touch—tied up in a ribbon or sent with a handwritten note—making them great for gifting.“I hope that people will feel empowered,” Pham says. “When you buy from farms, you’re not only supporting the farmer. You’re also supporting the earth, you’re supporting the animal when you buy from a good farm. You’re saying, ‘I vote with my wallet that I like how you’re treating your animals.’”Explore Bon AppétitHealthyishGroceryShoppingCoronavirusRead Moreculture7 Habits of Highly Effective Grocery ShoppersBy Victoria von BielRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-18", "author": ["Condé Nast", "Megan Zhang"]}