{"id": "d8364b5ecf8e16944675b4a75ad7e5ad", "url": "https://www.bonappetit.com/story/barney-greengrass-upper-west-side", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Barney Greengrass Is the Only Restaurant That Hasn’t Been Bettered Anywhere on Earth | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Only Restaurant on the Upper West Side That Hasn’t Been Bettered Anywhere on EarthBehold the heavenly funk of smoked fish at Barney Greengrass, New York’s legendary appetizing shopBy David RemnickJune 6, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.I’m not in the habit of talking smack about my own neighborhood, but no one can accuse the Upper West Side of Manhattan of being a restaurant haven. Decent places come and go; more often they don’t appear at all. There is finally a worthy Chinese restaurant, Han Dynasty on West 85th, that knows how to make cumin lamb and a hot pot worthy of the name. But the neighborhood is on the older side, shall we say, and restaurant people tell you that they can’t get anyone to come out for later sittings. No one is making Madrid-hour reservations. By nine, most places without a big bar business are dust bowls. And so business is better elsewhere.Gary Greengrass, the third-generation proprietor.\nPhoto by Alex LauThere is, however, one Upper West Side establishment that has not, for its category, been bettered anywhere on earth, and that is a humble appetizing joint on 86th and Amsterdam: Barney Greengrass. It is the only place where I’ve ever had a running account. However, my wife, Esther Fein, with whom all financial arrangements reside, refuses to reveal to me what our monthly Barney Greengrass bill is. I am glad not to know, though I imagine that Gary Greengrass, the third-generation proprietor, has built a house where he smiles and gives tours of the “Remnick-Fein” wing in honor of my family’s lucrative appetite for smoked fish. Let me tell you, it must be a gezunte wing, complete with 20-foot ceilings, marble floors, and Trumpian fixtures. Which is to say, we eat a lot at Barney Greengrass. Come to think of it, it’s where we do the majority of our “entertaining.”One of the few places worth eating on the Upper West Side.\nPhoto by Alex LauHow to describe the place? It is the past regained. The original was in Harlem; the family moved downtown in 1929. The investment in interior decoration has been minimalist, and not in the Philippe Starck, skinny-assed chairs sense. More in the sense that I don’t think they have spent a dime on the nonessentials since the Truman Administration. For some curious reason, the wallpaper is of the French Quarter in New Orleans. Barney Greengrass does not serve crawfish.Nova, sturgeon, good times.\nPhoto by Alex LauThe enormous yellow menu offers both milchig and fleishig, dairy and meat, but in my opinion only tourists and the benighted opt for meat. (If you want pastrami, go to Katz’s, and that is an entirely different discussion.) My go-to weekend breakfast is “the scramble”—Nova, chunks of sturgeon, and exquisitely browned onions all scrambled into a few eggs. With a bialy toasted well. A side order of herring in cream sauce with onions couldn’t hurt either. My wife, the health nut, orders half-sour pickles and sliced tomatoes. The coffee is adequate, but I am not complaining.Is this what heaven looks like?\nPhoto by Alex LauThe waiters are, to a man and woman, friendly, knowledgeable, funny. One is a writer who is the author of a comic novel called Balls. Another cracks wise about a certain magazine. Another shows you pictures of her toddler. And they all know your order before you do. Dessert? Thank you, yes. A chocolate babka muffin with a guilt-easing side plate of fresh fruit. And there you have it. After a couple of lazy hours, you say goodbye to Gary, who is nearly eclipsed by stacks of his “accounting.” Maybe you buy a “Barney Greengrass: The Sturgeon King” T-shirt. (My son wore his on the Great Wall of China.) And then you are out on Amsterdam Avenue, happy, full, your clothes emitting the heavenly funk of smoked fish.David Remnick is the editor in chief of The New Yorker.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsNew York CityRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-05", "author": ["Condé Nast", "David Remnick"]}