{"id": "d84d1a08146d929a1b359030d66f293d", "url": "https://www.bonappetit.com/recipe/adult-mac-and-cheese", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Adult Mac and Cheese Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAdult Mac and CheeseBy Molly BazJanuary 15, 20194.3(165)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea KyleEmailPinterestPrintEmailPinterestPrintJust about as easy as opening one of those little boxes of shells and powdered sauce—and a whooooole lot more delicious. Our super-quick stovetop mac and cheese borrows from the method for a classic cacio e pepe pasta, but with a bit of milk to make it extra creamy. No béchamel, no baking, just pure dairy-on-carbs joy.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketLarge Pot$55 At AmazonWooden Spoon$6 At AmazonChef's Knife$34.53 At AmazonDutch Oven$80 At AmazonWhisk$10 At AmazonGlass Measuring Cup$19.99 At AmazonColander$11 At AmazonIngredients4 servingsKosher salt1lb. small shells½cup (1 stick) chilled unsalted butter2tsp. coarsely ground black pepper1cup whole milk5oz. store-bought grated ParmesanPreparationStep 1Add 3 big handfuls of kosher salt to a large pot of water and bring to a boil. (You're probably tired of us saying it all the time, but, yeah: Salting your pasta water generously is the key to well-seasoned pasta, period.)  Drop 1 lb. small shells into boiling water and give them a good stir to be sure nothing sticks. Set a timer according to package directions for al dente.Step 2Cut 1 stick chilled unsalted butter into 8 pieces.Step 3While pasta is cooking, heat 2 Tbsp. butter and 2 tsp. freshly ground pepper in a large heavy pot or Dutch oven over medium, stirring occasionally, until butter is melted and foaming, but not browned, and pepper is fragrant, about 1 minute.Step 4Add 1 cup whole milk to butter to stop it from browning and bring to a simmer. Whisk remaining 6 Tbsp. butter into milk mixture 1 Tbsp. at a time, allowing each to fully melt before adding the next. (Doing this gradually is important—it helps to emulsify your sauce.) You may need to adjust your heat occasionally to maintain a simmer. If pasta still needs a few more minutes to cook, turn off heat under your sauce, cover pot, and keep warm.Step 5Scoop up 2 cups pasta cooking liquid with a large glass measuring cup. You're probably not going to use all of the pasta water in your sauce, but it's better to have more than you'll need.Step 6Drain pasta and add to pot with milk mixture. Return to medium heat and cook, tossing with a wooden spoon to evenly coat all shells, about 30 seconds.Step 7Add about one-third of grated Parmesan, stirring pasta vigorously with wooden spoon to melt. Add about ½ cup reserved pasta water and continue to stir until combined. Repeat this process 2 more times with remaining Parmesan. You may not need all of the pasta water, so add ½ cup at a time until pasta is very creamy and well coated. It’s always good to err on the side of looser (with a little extra pasta water) because the sauce will thicken as it cools. Give it a taste and add more salt, if needed.Step 8Divide pasta between bowls—or just heap it into one big bowl for yourself, no judgie—and serve right away.How would you rate Adult Mac and Cheese?Leave a ReviewTell us what you thinkReviews (99)Back to TopTriangleThis recipe has never failed me when i didn't know what to make for dinner but I wanted something tasty and I had milk, butter, pasta and cheese on hand. Some of the cranky comments on here are ridiculous! It's pasta and cheese, people! If you wanna make a bechamel, go for it! This takes like 12 minutes.AnonymousCary, NC3/12/2022Recipe?  I hate to be a snob, but this concoction had no depth of flavor and is unworthy of publication by Bon Appetit.  The next recipe will tell you to ditch microwave popcorn and actually pop your own popcorn at home with instructions on how to apply salt and butter.Joe6969Seattle2/4/2022store-bought parmigiano, what other way is there to get it?pacepuleoMilano2/4/2022Lovelovelove. I've made this so many times, I can't even eat boxed Mac and cheese anymore because my taste buds flat out reject it! Annie's who? Kraft what?\n\nI'll probably make this until the end of time. I'm pretty loyal to the recipe, but I've also used half and half a few times (mostly due to not having whole milk in my fridge lol) and it worked out just the same, giving the sauce a richer flavor.AlisonCalifornia1/20/2022You can make this with any cheese you have on hand, although an aged cheese is going to give you more depth of flavor. If the cheese you're using isn't finely grated, I highly suggest pulsing it in a food processor, or mincing it by hand (easy to do if it's already 'shredded'). This will make it easier to incorporate into the sauce and won't leave a layer of cheese goo in the bottom of the pan. I would also recommend adding the cheese to the sauce BEFORE adding the noodles, as again, this will make it easier to incorporate the cheese into the sauce. I also added baby spinach during this step (before adding the noodles) to move the dish further into 'adult' territory. If you miss the good old neon orange coloring, try adding some turmeric and/or paprika or use an American cheddar cheese. The addition of flat leaf parsley could also take this dish to the next level. P.S. I also used heavy cream instead of milk. Used half the amount specified, and then added noodle water as needed.NicholasCharlotte, NC1/2/2022Easy and simple.  Follow it to a tee. My family loved it.  Great comfort food!  Thank you!Anonymous12/20/2021Good recipe.  What the heck happened to the Print feature?  No offense intended, but sometimes improving a website should include good features from the previous version.Anonymousbillings, mt10/26/2021The thing I love about this recipe is that I’m lactose intolerant, so it was great to find a recipe that could easily be non-dairied (I use oat milk, non dairy butter & nutritional yeast instead of cheese) and still works? Is this the fanciest mac n cheese out there, no! Is it delicious when you want a quick-ish lunch, yes! (Also I’ve added various seasonings to it at various times & it always works fine, so I think of it more as a starting point than a finished recipe these days)NatSydney, Australia10/12/2021This is not a recipe. This is just pasta tossed with parmesan cheese and salt. \nIt's a step up from boxed mac and cheese, but I'd be ashamed to call it a recipe.HyeriCalifornia7/22/2021Was kind of nervous to make this after reading some of the reviews, but it turned out really well. It definitely does remind me of a boxed mac and cheese thin sauce (I usually make my mac and cheese with a roux), but I was expecting that and thoroughly enjoyed it. Just follow the recipe to a T, and make sure you are ALWAYS stirring during the last major step. I added in a handful or two of shredded white cheddar, and also put chives on top (saw in another review). Both were great additions and I won't hesitate to make this again when I want something simple and easy. LizzieMonterey, CA6/4/2021Very tasty and easy to make. I used less than 1 teaspoon pepper and added more to my bowl. Combined skim milk with cream. Sauce came out perfectly. Salted the water with 2 Tablespoons and used the water to keep the sauce from getting too thick. Will make this for my grandkids again, just not too often with all the butter and milk. Still more healthy and better tasting than the powder box or the packaged cheese sauce products.AnonymousFlorida 5/20/2021I love this recipe it’s become a staple in my house it’s super easy and always delicious! My boyfriend always asks for me to make this for dinner. Molly’s recipes are always great and this one is no exception!! Shayla MeadsLos Angeles, California 2/23/2021An amazing recipe--I make it for every snow day. Sometimes with shells, but often with whatever pasta I have around the house. This is NOT baked mac n cheese, so if you want that ooey gooey texture that some of the other comments miss, go make that! If you want delicious, nuanced stove top mac n cheese, MAKE THIS ONE. So good and so simple. Just follow the recipe, don't try to improvise. Veronica Upstate, NY2/16/2021I think this recipe is great. I got results just as advertised without any of the issues others have mentioned. So, follow the recipe closely! The only thing I'd add is that this is SUPER peppery! I wish I would've put less in.HeatherEdmonton, AB2/3/2021What am I a HORSE? Geez are you trying to give Americans a stroke? There is less salt in two boxes of off brand imitation mac and cheese than this salt lick you call mac and cheese! Water from the pacific would be less dangerous to consume.\n\nFor anyone atuallywanting to make this and decides to read this first skip all the salt and use a very small pinch od salt or even better salted butter! Do not pour water into the milk and do not use parmesan cheese! Instead use pepper jack, cheddar and or any soft cheese that is your favorite, this will provide all the salty badness that you need and or desire as well as provide actual cheese flavor! Season liberally with garlic powerder, pepper and some chives or your favorite hot sauce.  \n\nBy all means ignore the \"adult mac and cheese\" crap whom ever came of with this crap.D GatlingCalifornia1/18/2021Explore Bon AppétitMac and CheesePastaParmesanCheesePasta ShellsPasta & NoodlesEasyQuickOne-Pot MealsWeeknight Meals5 Ingredients or FewerMainNut-FreeVegetarianSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-13", "author": ["Condé Nast", "Molly Baz"]}