{"id": "d85b525d6070254747479feaa2da8c98", "url": "https://www.bonappetit.com/story/priya-krishna-indian-ish-april-cookbook-club", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Our April Cookbook Club Pick Is Priya Krishna’s Fantastic and Fun ‘Indian-ish’ | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOur April Cookbook Club Pick Is Priya Krishna’s Fantastic and Fun ‘Indian-ish’There’s no other spring cookbook with as much personality, point of view, and chaat masala.By Alex BeggsApril 1, 2019FacebookTwitterEmailFacebookTwitterEmailWhat’s the ish? In Priya Krishna’s new cookbook Indian-ish, it’s the roti pizza, the quinoa kheer, the saag feta—all the twists on Indian dishes that were invented by her family in their Dallas home. If you’ve been following along with us, you may already be familiar with some of them (like a vegetarian sloppy joe called pav bhaji, a bright and spicy grilled cheese called dahi toast, or baked potatoes with chat masala) from her column of the same name, which I very happily edit here on bonappetit.com. Now with a whole book of Indian-ish recipes to dig into, we’re making it our Cookbook Club pick for the month of April.If you’ve never made Indian food at home, Indian-ish is going to get you into chhonk (spices tempered in oil), dal (stewy lentils), and kachumber (cucumber or other raw veg salads). But this isn’t Indian food 101. The country spans over a billion people, hundreds of languages, and a multitude of regional cuisines, and these recipes are uniquely Krishna—which means they’re really fun, creative, comforting, and unyielding. (Yes, we’re sprinkling chaat masala on almond butter toast, IT WILL BE GOOD. TRUST.)Most of the recipes are Priya’s mother Ritu’s—a software programmer, wine lover, pottery collector, and style icon. (She likes to pair kurtas with gold Zara pants, and believes strongly in the power of statement jewelry.) Ritu and her husband Shailendra came to the U.S. in the early ’80s, and longing for the Indian food of home, she taught herself to cook with help from PBS and relatives she called for guidance.The results, however, are entirely her own. There’s Indian Ribollita, which adds Indian green chiles to the classic the Italian soup; roti pizzas, Ritu’s response to her pizza-demanding daughters, made with cheddar, onion, and cilantro chutney; a sunshine yellow caramelized onion dal. It’s “60 percent traditional Indian, 40 percent Indian-plus-something-else, mostly vegetarian,” Priya writes in the introduction. And you can tell Ritu thinks about cooking the way she dresses, and that’s with one goal in mind: be fabulous.After Priya gathered and tweaked her mother’s recipes, added some of her own, and narrowed down her list for Indian-ish, I was lucky to be one of her many enthusiastic recipe testers for the book. And I can vouch for the simple but stunning one-pan Lotus Root and Jammy Tomatoes (there’s a great texture mashup from the crisp lotus root up against velvety tomatoes) and the instant classic Spinach and Feta Cooked Like Saag Paneer. Priya was, and I say this out of admiration, neurotically obsessed with making sure the recipes were accessible, downright easy, delicious, and that they worked. I don’t want to know how many Google docs made this happen. (Okay, she told me how many, it was a LOT.)Doesn’t that look gooooood?\nI’m excited to see what my coworkers make for our Indian-ish cookbook feast, which feels like an extra special occasion to me—a selfish editor who’s unendingly proud of Priya as a writer, friend, and now cookbook author. There’s a deluge of spring cookbooks coming out, but none have what Indian-ish does: heart, humor, and chaat masala on almond butter toast.Pre-order it: Indian-ish by Priya Krishna, $18 on amazon.comExplore Bon AppétitIndianishcookbook clubCookbooksIndianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-01", "author": ["Condé Nast", "Alex Beggs"]}