{"id": "d863b38b8a0c20bd6f6690241a784b98", "url": "https://www.bonappetit.com/recipe/collard-greens-salad-with-pickled-fennel-and-coconut", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Collard Greens Salad With Pickled Fennel and Coconut Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueCollard Greens Salad With Pickled Fennel and CoconutBy Marcus SamuelssonDecember 1, 20203.8(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Joshua Kissi, food styling by Roscoe Betsill, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintInspired by chef and author Marvin Woods, this mix of hardy greens, pickled fennel, and spicy coconut vinaigrette brings a lightness to decadent tables. Anyone with a busy kitchen during the holidays will appreciate a salad that gets better as it sits. The creamy coconut vinaigrette softens the collards while freeing up time for you to focus on other dishes.This recipe was adapted from ‘The Rise: Black Cooks and the Soul of American Food.’ Ingredients8 ServingsPickled Fennel½cup white wine vinegar⅓cup sugar2tsp. Diamond Crystal or 1 tsp. Morton kosher salt2garlic cloves, smashed1bay leaf (optional)1medium fennel bulb, stalks and tough outer layer removed, thinly sliced lengthwise1jalapeño, halved lengthwiseCoconut topping2Tbsp. extra-virgin olive oil2jalapeños, finely chopped2garlic cloves, thinly sliced1cup unsweetened coconut flakesKosher saltDressing and assembly1large egg yolk*½cup unsweetened coconut milk3Tbsp. fresh lemon juice2Tbsp. extra-virgin olive oil2tsp. Dijon mustard1tsp. toasted sesame oil1tsp. Worcestershire sauceKosher salt2bunches collard greens, stems removed, leaves very thinly sliced (about 5 cups packed)½small head Napa cabbage, tough stems removed, very thinly sliced (about 2 cups)1small head radicchio, halved through core, very thinly sliced (about 2 cups)¾cup crumbled farmer’s cheeseIngredient Info* Raw egg is not recommended for the elderly, pregnant women, people with weakened immune systems…or people who don’t like raw egg.PreparationPickled fennelStep 1Bring vinegar, sugar, salt, garlic, bay leaf (if using), and 1 cup water to a simmer over medium-high heat. Let cool 5 minutes. Add fennel and jalapeño and let cool completely. Cover and chill at least 2 hours before using.Do ahead: Fennel can be pickled 1 week ahead. Keep chilled.Coconut toppingStep 2Heat oil in a medium skillet over medium. Cook jalapeños, garlic, and coconut flakes, stirring often, until garlic and coconut turn golden, about 5 minutes. Season with salt and transfer to a small bowl.Dressing and assemblyStep 3Blend egg yolk, coconut milk, lemon juice, olive oil, mustard, sesame oil, and Worcestershire sauce in a blender until smooth and creamy; season dressing with salt.Step 4Place collard greens, cabbage, and radicchio in a large bowl. Drizzle dressing over, season with salt, and toss to coat. Add cheese and pickled fennel and gently toss again; scatter coconut topping over.How would you rate Collard Greens Salad With Pickled Fennel and Coconut?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladCollard GreensLeafy GreensVegetableFennelCoconutFruitSideGluten-FreeVegetarianKetoHealthyishKwanzaaJuneteenthDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson"]}