{"id": "d87a8d9acfd9f09a8ddd0d6285822615", "url": "https://www.bonappetit.com/recipe/arugula-with-italian-plums-and-parmesan", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Arugula with Italian Plums and Parmesan Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueArugula with Italian Plums and ParmesanBy Ignacio MattosApril 17, 2018EmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintFor the best play between sweet, hot, and salty ingredients, look for spiky arugula, labeled “rocket” or “rucola,” at the farmers’ market. It’s much more peppery and sturdy than what you’ll find at the supermarket. For an over-the-top dinner menu, serve this salad with Romano bean salad, paccheri with shellfish, grilled red mullet, grilled bistecca, and brioche au rhum. We said over-the-top.Ingredients8 servings16Italian plums, halved, or 8 small plums, quartered⅓cup cocktail onions, halved,layers separated2Tbsp. fresh lemon juice2Tbsp. extra-virgin olive oil, plus more for drizzling3oz. arugula (about 5 cups)Kosher salt, freshly ground pepper3oz. Parmesan, thinly slicedPreparationToss plums, cocktail onions, lemon juice, and 2 Tbsp. oil in a large bowl. Add arugula, season with salt and pepper, and toss again. Transfer to a platter; top with Parmesan and drizzle with more oil.How would you rate Arugula with Italian Plums and Parmesan?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladItalianEuropeanArugulaLeafy GreensVegetablePlumStone FruitFruitParmesanCheeseQuickEasySideGluten-FreeNut-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}