{"id": "d87b7aac72d27ec4cc8dfeac1b28b930", "url": "https://www.bonappetit.com/recipe/coconut-rice-noodles-with-ginger-and-turmeric", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Coconut Rice Noodles with Ginger and Turmeric Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueCoconut Rice Noodles with Ginger and TurmericBy Chris MoroccoJuly 10, 20183.8(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThis is a weeknight pantry curry that comes together in the time it takes to boil water for the rice noodles. Fast! For this recipe, blooming the ginger, turmeric, and black pepper in oil is essential for releasing their aromatic properties into the coconut milk-based sauce.Ingredients4 servings Kosher salt5oz. rice vermicelli2Tbsp. virgin coconut oil or vegetable oil1small red onion, thinly sliced4garlic cloves, thinly sliced11\" piece ginger, peeled, finely grated1tsp. ground turmeric1tsp. coarsely ground black pepper, plus more113.5-oz. can unsweetened coconut milk1½tsp. honey1Tbsp. fish sauceToasted unsweetened shredded coconut (for serving)PreparationStep 1Bring a large saucepan of salted water to a boil. Remove from heat; add noodles. Let sit, stirring occasionally, until al dente, about 4 minutes (time may vary by brand). Drain and rinse under cold running water.Step 2Meanwhile, heat oil in a large saucepan over medium. Cook onion and garlic, stirring often, until softened and golden, about 3 minutes. Add ginger, turmeric, and 1 tsp. pepper and cook, stirring, just until fragrant, about 1 minute. Add coconut milk, honey, and ¼ cup water. Bring to a simmer; cook until flavors come together, about 5 minutes.Step 3Mix fish sauce and noodles into broth; season with salt if needed. Divide among bowls and top with shredded coconut and more pepper.How would you rate Coconut Rice Noodles with Ginger and Turmeric?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleDelicious, simple recipe. Fish sauce and salt are key - salt to taste! I added a bit more of the spices as well, and sautéed them in the pan in a little oil to let them bloom. Used lite coconut milk and it was still great. Will make again!Anonymous1/11/2022This dish had a great combination of flavors. I added some thinly-cut sauteed chicken breast to make it a full meal. Other than that, I made the recipe as written, but skipped the coconut. I think of this dish as a change of pace comfort food.  JeanieSChicago, IL1/10/2022I remember this dish as a \"Sri Lankan breakfast dish/soup\"; very good and veganAnonymousNorway10/25/2021So this recipe was good, but heres how how to turn it into a tasty complete meal. \n\nFollow per the recipe but double turmeric, season broth with soy sauce. \nAfter bringing the broth to a simmer, add ~10oz of any whitefish, cut into cubes, cook for additional 5 min. Incorporate quartered baby bok choy, remove from heat. Serve with chopped peanuts.DerekNorfolk3/19/2021This was bland as hell :(\n\nI tried to salvage it with some cayenne pepper, soy sauce, more fish sauce, and some spring onions on top. I wouldn't make this again.AnonymousNew Zealand6/29/2020Loved how this turned out (once I made a couple tweaks). Highly agree with some others that the flavor was a little lacking at first. I would do a few things: 1) add a little more turmeric and ginger, as others have suggested 2) add some extra sweetness. It made a tremendous change, more than even adding the extra spices. I used some cream of coconut that I had accidentally opened a couple days prior, but I suspect that more of the honey would also do the trick 3) maybe use fewer noodles, since i think the noodle-broth ratio was too high, and I personally liked getting little spoonfuls of the liquid.andidaniBoston4/16/2019I was really happy with this. I don’t think it lacked flavor, as some reviewers have complained, and I didn’t even use onion (my husband has an aversion). The flavor was pleasant and comforting, just right for a cold night. I served this with some stir-fried shrimp and green beans. WendyROrange County, CA12/10/2018This was not great. Even with extra aromatics and salt it was pretty bland, as other reviewers have said. I also think this took about half an hour start to finish, not the 15 minutes the recipe says. 30 minutes is no big deal if it’s good but, it really wasn’t. Anonymous11/20/2018This was great, especially given I had all of the ingredients already. It's a really simple recipe- not too much flavor. I added some chicken sausage to give it extra heartiness. The toasted coconut flakes added a lot. AshleyBrookeWashington, DC11/9/2018Mmm this was really good. I used curry powder instead of turmeric, and I added extra salt and carrots based on the other reviews. Toasted chopped peanuts make a great topping for it, too!zizi jeanmairePA11/2/2018I have made this recipe several times and love it!  I usually tweak recipes and always taste for salt at the end.  Just salt does wonders for a bland recipe (as some reviewers stated). I'm not a big fan of fish sauce so I reduced the measurement and I used fresh turmeric instead of dry.  I usually add extra veggies, like Napa cabbage, sugar snap peas finely sliced, julienned carrots and/or julienned zucchini.  I used mung bean starch noodles with this and they were perfect.  A new staple recipe in my home!pinkgrannygoNorth Carolina, USA10/9/2018One can add finely chopped serrano peppers to enhance the flavor. \nFeel free to write me for vegetarian recipes queries. chezshuchi.comshuchiUSA9/20/2018I guess the idea is that you actually can make something decent with whatever's lying in your pantry but it does severely need a few twists to make it truly enjoyable. It's a good base, but I guess it's my fault for expecting it to turn out like their Chicken Khao Soi recipe (which is excellent, by the way!)AnonymousMalaysia9/18/2018Made recipe exactly as listed but it was really weak in flavor -  Kinda disappointed but c'est la vie. Added a bunch more ginger and finally just added some sambal in after eating a few bites since it was so plain.  Maybe I'm missing something? Anonymouschicago8/24/2018I knew this was going to need a bit more. I started by sautéing shrimp that had been marinated in ginger & garlic. I added about 1 tablespoon of turmeric & then saffron to the broth. Finished with fresh basil.  Next time I will definitely salt the water before adding rice noodles, as I had to add lots of salt to get flavor. Might also consider red pepper flake for a little zing!AliRSkaneateles 8/19/2018Explore Bon AppétitRice NoodleNoodlePasta & NoodlesGingerHerbs & SpicesTurmericCoconut MilkOther IngredientsQuickEasyWeeknight MealsOne-Pot MealsMainDairy-FreeGluten-FreeHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Chris Morocco"]}