{"id": "d880f24b7260bdb3f97c5850dd131bdc", "url": "https://www.bonappetit.com/story/white-pesto-pasta", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "White Pesto Pasta Is The Easiest Dinner You Will Make This Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhite Pesto Is the Easiest Dinner You Will Make This WeekIt‘s creamy, it’s cheesy, it’s garlicky, and just as can’t-stop-eating-it delicious as the OG basil-based one.By Emma WartzmanApril 17, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmail“Pesto is not necessarily what you think it is.” This is what food director Carla Lalli Music told me the other day after doing loads of reading about what actually constitutes the classic pasta sauce. There are a lot of things to know about Carla, but one is that she has an encyclopedic library of cookbooks on hand for research.The purpose of this particular research? To create a recipe for White Pesto, a riff on the classic Genovese version we normally think of when we imagine pesto—but just as delicious, craveable, and simple to make. Could she do it with the same number of ingredients? Using just a knife? What about without the heaping mound of herbs?! Would the internet throw themselves into a frenzy?! Well, folks. She did. And you can’t, because her recipe is delicious, and it’s as much of a pesto as the green sauce we know and love.The result is an ultra-creamy, walnut-studded sauce that can be made in no time—well, as long as it takes to boil water, pretty much—and all in one bowl.The creaminess comes from the base of ricotta, which Carla chose because it’s so mild. “You can add a lot of it without it becoming super salty or super funky,” she says. “Plus, it has a high water content, which helps make a sauce that really coats the noodles.” There’s still parm in there to hit that salty note, there’s still raw garlic for that bite, and there’s olive oil, salt, and pepper, because duh. Toasted walnuts fill the need for fatty nuttiness. But the real twist comes from lemon zest. “We tasted the first iteration with no lemon,” says Carla, “but it wasn’t quite dynamic enough. Without tons of herbs, we needed something bright to balance the dish out.” The main difference is in the proportions: Heavy on the cheese and nuts, light on the herbs (though there is a small amount of oregano in there—just enough to lend an earthy bite in the background, but not enough to give off any color). So far so good, right?It gets better: All you have to do is give those ingredients a couple quick chops and a few grates, and mix it all together in a bowl. See that? That’s your water boiling already. Then, throw in the pasta, cook it to al dente, scoop out a cup of the pasta water, pour that directly into the bowl, add the pasta, and toss it vigorously. “The tossing, tossing, tossing is important,” says Carla. “I mean it when I say a full two minutes.” It will feel like a long time, but you need to commit in order to make the sauce thicken up and cling to each noodle.And really, what’s two minutes when your dinner just came together in less than thirty?Get the recipe:White Pesto PastaBuilt of toasted nuts, creamy ricotta, and salty Parmesan, you don’t even need a food processor to make this riff on the normal pesto you know and love.View RecipeExplore Bon AppétitPestoWeeknightPastaRead MorecookingBA’s Best Pesto Recipe Is Here and It's the Perfect Balance of Nuts, Herbs, and CheeseBy Alex Beggs and Andy BaraghanicookingHow to Make Pesto Out of Just About AnythingBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-17", "author": ["Condé Nast", "Emma Wartzman", "Andy Baraghani"]}