{"id": "d88e3b3788478ae00cba1dcb744ae184", "url": "https://www.bonappetit.com/story/nontron-knives", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "Nontron Knives Are My Favorite Knives in the Drawer  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Own a Lot of Steak Knives, But These Steak Knives Rule Them AllThe French-made Nontron knives look sharp and stay sharp.By Elyse InamineJanuary 20, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.My husband has a steak-knife problem. He can’t stop buying them—chunky wood ones; a delicate, bone-china-hued Laguiole set, who knows what’s next. (One coworker asked if he was a serial killer, given his affinity. For the record, he’s not!)I didn’t understand his obsession until I stumbled upon these stunning steak knives at Cheval d’Or in Paris via Instagram (I know, I know, but whatever!). They looked playful and modern, as if designed in collaboration by my dream aesthetic duo: Dr. Seuss and Christian Louboutin. I suddenly understood the urge to buy pretty cutlery, so I got the set to marvel, I mean use, in real life.Each Nontron knife is made by hand by 20 or so craftsmen in Nontron, France, a charming town in the southwestern part of the country, and each is meticulously labored over. Only one person will see the knife from start to finish—no Ford assembly line here, vive la France!—from sanding the handles, which are made from wood dried out for four years so it doesn’t warp, to the rest of the 39 steps (polishing, centering, and tightening the stainless steel blade for example). The result is a knife that’s not only beautiful to look out (just wait til your next dinner party!) but functional, with a blade sharper than Trevor Noah.But even better: It’s put an end to my husband’s steak-knife shopping spree once and for all.Buy it: Nontron multi-colored knife set, $265 for six at Nontron KniveAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingKnivesRead MorecultureThese Insanely Expensive Steak Knives Are the Best I’ve Ever OwnedBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-20", "author": ["Condé Nast", "Elyse Inamine"]}