{"id": "d88e475c07f448873832f04d4f8017b4", "url": "https://www.bonappetit.com/story/cake-mix-upgrades", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "How to Make Box Cake Better (And Fool People Into Thinking It's Homemade!) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Favorite Ways to Make Box Cake a Whole Lot BetterThey don’t call me the cake mix doctor for nothing.By Anne ByrnFebruary 25, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Thu BuserFacebookTwitterEmailIn Cheap Tricks we’ll help you make the most out of everyday supermarket staples. Next up: How to make box cake better (like so good people will think it's homemade).When I first reached into my pantry for a box of cake mix, I didn’t know it would turn into a newspaper story and then into the bestselling book, The Cake Mix Doctor. With three children under the age of 10 and so many occasions to bake a cake at the last minute, I used the simplest hacks—like switching up the water with orange juice—to elevate that mix…and maybe hide the fact I wasn’t baking from scratch.Once I baked more with cake mixes and figured out how far I could push the envelope—or in this case, the packet of instant pudding mix!—I got better at it.Cake mixes are wildly popular and, in certain circles, somewhat controversial. While their convenience can’t be denied, the reality that they’re not homemade hangs over them. That’s where doctoring up cake mixes comes in—not only does it make the boxed mixes taste better, but it also makes people feel like they’re baking.However you look at the mix—a desperate measure for desperate times or a jumping-off point for an infinite number of delicious desserts—here are my best strategies for making box cake better:1. Switch up the liquidAt the very least, replace the water on the package with apple cider, coffee, even pink Champagne. Use that same liquid to make a glaze or frosting, as in apple cider cake with apple cider glaze. Or turn to citrus, from lemon to orange to lime to grapefruit, or even clementine. Add the zest and juice in the cake batter and frosting. You can swap in canned coconut milk anytime your recipe calls for whole milk. It makes for velvety cakes with good structure. (Pair it with an egg substitute and you’re on the road to a vegan cake.) Soft fruit can also be used in place of some of the liquid in the batter. Ripe bananas, applesauce, mashed roasted butternut squash, and puréed berries all add moisture and personality to cake.2. Enrich with fat for a denser, homemade crumbWhile box directions will tell you to add vegetable oil, you can do better. Use melted butter instead of oil (plus buttermilk in lieu of water). Or use olive oil, especially when pairing with citrus. Mixing in cream cheese, ricotta, sour cream, whole-fat yogurt, or peanut butter in addition to the amount of fat called for on the box will yield even richer cakes. And who wouldn’t want that?3. Amp up flavorSimply put, a chocolate cake mix needs more chocolate. I’ve successfully added up to 6 ounces of melted bittersweet chocolate (or Nutella) to the batter. To enhance the richness of chocolate batters even more, add a spoonful of Kahlua, dark rum, or espresso. Chocolate cake mix? Add more chocolate!\nAlex LauFor yellow cake I like to add a drop or two of maple flavoring, which packs more taste than vanilla. And infusing the liquid in the batter or glaze with rosemary, lavender, or Earl Grey tea adds another level of sophistication.4. Add structure to pound and Bundt cakes On their own, boxed cake mixes have a structure that’s loose and airy. But if you add ¼ cup flour or half a box of instant pudding mix, the texture of the cake becomes denser and tighter, ideal for a pound-cake-like consistency that will hold the shape of a Bundt pan. 5. The eyes have it! The time you save using a mix can be put into presenting something gorgeous. Here are a few of my favorite tricks: Hide softly whipped cream, chocolate ganache, or a smear of brown sugar-cream cheese frosting between the layers, then frost the top and sides of the cake lightly with your favorite buttercream, in a barely naked fashion, which means spreading the frosting around the sides, then pulling it off with spatula to leave just a thin coating.For a naked cake, leave the sides totally bare or cover them with a barely-there layer of frosting.\nPhotograph by Alex Lau, food styling by Sue Li, prop styling by Sophie StrangioOr get whimsical with color in layer cakes. Divide the yellow batter into thirds and color two of them with either matcha (green), cocoa powder or melted chocolate (brown), even a tablespoon or two of strawberry gelatin (pinkish red). Bake a layer of each, slice them in half horizontally for even more layers, and alternate the colors as you stack and frost.I change up the shape of the pan too. While a standard cake mix will make two 9\" rounds, you don’t have to follow the rules. Use a springform pan (which makes for a taller, prouder cake), an extra-long loaf pan or two standard ones, or a Bundt pan. When possible I toss something into the bottom of the Bundt, like nuts or coconut, before adding the batter. The goodies in the bottom toast into a delicious topping once you invert the baked cake.And when you’re in a complete rush and don’t have time to doctor up the batter, pour it into a cast-iron skillet full of sautéed apples or bananas and rum or chunks of fresh mango or pineapple, and bake the classic upside-down.There’s a really good reason cake mixes have been doctored up for decades— it’s not just easy, it’s fun!Anne Byrn is the bestselling author of The Cake Mix Doctor, and her most recent book based on mixes is A New Take on Cake. She lives and bakes in Nashville and writes the Substack newsletter, Between the Layers.Explore Bon AppétitCheap TrickscookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-25", "author": ["Condé Nast", "Anne Byrn"]}