{"id": "d8935a04d5fb951a658bf2cdf2551141", "url": "https://www.bonappetit.com/story/thanksgiving-feud-2019", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "Our Unnecessary Thanksgiving Feuds: 2019 Edition | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOur Unnecessary Thanksgiving Feuds: 2019 EditionWe argued. We ate. It was great.By Alex BeggsDecember 7, 2019FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Gobbles and SquabblesA funny thing about working at Bon Appétit is that your family doesn’t care that you work at Bon Appétit. Every year, this becomes more and more apparent when we all return to the office with stories of our Thanksgiving dinner dramas. For example, my dad read Adam’s newsletter about Pumpkin Chiffon Pie—and then went and made ANOTHER WEBSITE’S PUMPKIN CHIFFON PIE RECIPE. Dad, why!? So for the second year in a row, here’s a special edition of Unnecessary Food Feud of the Week: Family Feud Edition!Amanda Shapiro laments: “Dude, my mom made a big f-ing deal about me scrubbing all the sweet potatoes before roasting them even though she bought ORGANIC, then she DIDN’T EVEN EAT HER SKINS.”“My grandmother and uncle were BUGGING at the prep steps I forced them to do for Andy and Brad’s turkey,” reports Emily Schultz. They asked: “What are we asking the butcher to do? Separate it? Separate what?!!!” (The butcher was happy to oblige, and even said he was getting more requests this year than ever to break the turkey down. Coincidence?) “And we’re leaving it uncovered? In the refrigerator? For two days? And you’re sure this is safe??” (No one was poisoned.) “Soy Sauce? I’m not even going to ask.” (Schultz is now allowed to make the turkey every year.)Want this letter before it hits the website? Sign up for our newsletter!As if this galette weren’t impressive enough already?\nMichael Graydon + Nikole HerriottRachel Karten sends a postcard: “I went to my boyfriend’s Thanksgiving and brought heavy cream and maple syrup to make the maple whipped cream for Alison Roman’s Salted-Butter Apple Galette. Before dessert was served, I asked for a bowl and whisk. And they were like, ‘you can’t make whipped cream like that—it’s going to take you HOURS.’ They gathered around in disbelief to watch me make whipped cream from scratch. Anyway, it took seven minutes and everyone said the dessert was FANTASTIC. Not really a feud, but a reminder that making whipped cream from scratch is extremely delicious and, in some cases, very impressive.”“Save it for divorce court!” said Carla Lalli Music. “I pay a therapist to hear this stuff and you want it for free!!??”Kate Fenoglio says: “After spending two days baking, including the most perfect pumpkin pie I’ve ever made, my mom goes to the grocery store and comes back with a store-bought pumpkin pie!!!! She argued it was so people could have another slice of pie in the morning with coffee, but I made sure to give her a hard time about not having faith in my baking skills. (She definitely does and took about 15 photos of my pumpkin pie.)”“I wanted people to not eat my cookies before Thanksgiving dinner had even hit the table, but that didn't happen,” sighs Emma Wartzman. “I feuded with everyone.”“My friend and I argued about how early is too early to eat on Thanksgiving,” Christa Guerra recalls. “He wanted to eat at 1 p.m. like a grandma, but then you don’t get to graze on appetizers for six hours before!”“My girlfriend’s grandmother wanted Stove-Top stuffing,” says Bryan Fountain, “so we made that and one from scratch. She had a bite of the homemade, ate two servings, and did not touch the Stove-Top. It was annoying and satisfying at the same time.”A leeeettle too crispy.\nAliza Abarbanel discovered her family’s oven is 100 (100!) degrees off, so her puff pastry for Claire Saffitz’s apple tart burnt. Bad. “We ate the apples off the top though!”Sarah Jampel has a relative who “only makes food that tastes like mothballs.” They brought a green bean casserole with apparently raw green beans bobbing around in a vat of extremely liquidy soup with “little blobs of fried onions on top, like wet dog turds.” Vivid!Christina Chaey had a lot on her mind: “I...forgot to oil the bird before it went into the oven and then my mom and I argued for the next 3 hours about when to baste it with butter. We poured a melted half-stick over the poor thing once I realized the error of my ways (but not revealing to anyone, of course) which was...exactly 10 minutes before it came out of the oven. Oops.”The following people had beautiful, peaceful Thanksgivings. Or they’re lying to me: Chris Morocco (“no one went to the hospital!”), Molly Baz (“I went to Paris!”), Alex Delany (“I get along with my family!”), Sohla El-Waylly (“Maybe your newsletter should be about how great our Thanksgivings were!”), Brad Leone (ate lobster), and Adam Rapoport (“I was face-down on the sectional nine minutes after dinner was over.”).Explore Bon AppétitBeggs NewsletterThanksgivingRead MoreLifestyle[*whispers*] I Don’t Like ThanksgivingBy Amanda ShapirocultureShrimp Scampi Pasta for the Hesitant Home CookBy Alex BeggscultureWhat to Cook When It’s Dark at 4 p.m.By Alex BeggscultureMore Prunes! More Prunes! More Prunes!By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-07", "author": ["Condé Nast", "Alex Beggs"]}