{"id": "d89d23e10953ab2d42868600c7d89eed", "url": "https://www.bonappetit.com/story/turning-food-into-home-remedies", "year": 2020.0, "month": 9.0, "day": 3.0, "content": "Turning Food into Home Remedies Is My Love Language | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTurning Food Into Home Remedies Is My Love LanguageHow I use pantry staples to heal my family's scars, burns, and rashesBy Paloma Quevedo September 16, 2020FacebookTwitterEmailEmma FishmanFacebookTwitterEmailFew things bring me more delight than spending a warm Saturday morning lugging around an oversize tote at my local farmers market, scanning the rows of fresh produce and looking for the ripest, most promising pieces of fruit and vegetables. I haul home the produce with the most potential—for my cooking but also for my skin.Bright and juicy lemons will be zested into creamy pasta al limone, but the discarded pulpy rinds will be boiled on the stove, filling my house with a rich citrusy aroma. I’ll add mint to the leftover water to use as a toner that will lighten the acne scars on my face. Bunches of crisp cucumbers will be cut and spiced up for a briny salad. I’ll set a few cucumbers aside to thinly chop and carefully place all over my sister’s face for a morning pick-me-up to reduce puffy eyes and redness. Heart-shaped strawberries will be baked into a vanilla sheet cake, while the discarded cores and bruised pieces will be puréed and combined with cane sugar and coconut oil to use as a body scrub in the shower.I grew up on a ranch in the middle of the Mexican Chihuahuan desert, an hour’s drive from the nearest town. It was a place where you made do with what you already had. And it’s where I learned that every ingredient in my kitchen has other uses too.One of my favorite memories is of my mother sitting in one of the far corners of the house, beneath the glow of the late afternoon sun, soaking her nails in a bowl of olive oil. Thinking I was asleep, my mom sat alone and in silence, the only moment of the day she had to herself before my dad got home from the corrals. Now that I’m a mom and close to the age my mother was then; I find myself borrowing her quiet ritual. I don’t need to go out and get a mani-pedi to pamper myself; I just need to set aside some 15 minutes on a quiet afternoon, grab a bowl, and fill it with olive oil from my pantry (the everyday bottle, not the nicer, cold-pressed, extra-virgin one that sits on the counter). My cuticles are moisturized, my nails are strengthened, and I cultivate a sense of focus and calm.Now that I have a home of my own—me, my partner, our daughter, my sister, and the orange cat—creating homemade concoctions has become a love language. When one of us has an affliction or need, I look to my fridge, the products in my pantry, or anything from my small garden that can become a healing balm. I love the act of creating a natural remedy, then using it to soothe my partner’s sore back, relieve my daughter’s sore gums, or mitigate UTI pain, all with my own resources and my own two hands.Two years ago, I gave birth to a happy and healthy baby girl. But I experienced a devastating postpartum depression during her first month of life. I distrusted my ability to be a good mother and had a debilitating lack of desire to perform even the simplest of tasks. I had a lot of help from my mom and partner’s mom at first, but when they left after the first two weeks, I was left to make my first decision as mother-in-chief, to shake myself out of my helplessness.I needed to do something about the bald spots on my daughter’s head that were looking seriously dry. I was skeptical of using anything store-bought on her skin (still am), worried that some chemical might cause a dangerous reaction. I decided to improvise a topical scalp shampoo; my grandmother on my dad’s side swears by a tomato’s ability to stimulate hair growth, and a close friend of mine uses castor oil to moisturize her scalp and get rid of dandruff. I puréed a couple of overripe tomatoes along with a few drops of castor oil to carefully massage onto my daughter's tiny scalp during her bath. We practiced this gentle ritual a couple of times a week; I would hold her head and softly rub it with the pulpy mixture as she cooed and waved her little arms in delight.I started to see the dry patches clear up. Her head filled with thick, toffee-colored locks of hair, and I felt immense pride at my ability to take care of her. Amid my depression, it was one of my first glimpses of overwhelming joy.Although my family has stayed healthy during this global pandemic, it’s been a definite challenge. Stress and fear are high, money has been tighter, and our time outside the house has been limited. But it has also crystallized the value of my homemade concoctions—they’ve become deeply bonding and essential rituals.When my partner’s face is breaking out, (probably from using body soap as a face wash), I cut a stalk from our aloe vera plant and scrape the juice into a bowl and mix in some turmeric. We get comfortable on the couch so that I can lather the orange slime onto his face while we watch our favorite show. I’ve also taught him how to make my favorite avocado mask so that he can mix it up on his own and massage it onto it on my face when I’m the one that needs pampering.My sister and I are trying to lighten our hair with limes and salt and beer like our aunt used to do when we were little, spending summers at her pool. She’d pour the mixture on our long, chocolate-colored hair, then lie us down on a towel for the sun to fry it to a lighter shade. We wanted bleached blond highlights a la Mary Kate, and Ashley in “Our Lips Are Sealed,” but we were satisfied enough with the slight amber glow that our tips achieved.This summer, while my daughter napped, we drenched our hair in the citrusy beer mixture from our childhood, slathered on some sunscreen, and sprawled ourselves out in the sun—side by side. I’m not saying it’s particularly good for our hair follicles, but the relaxation and comfort these moments bring me are worth it.My cat, Luis Miguel, also gets in on the hair action. He is the most handsome, most orange boy you will ever meet. However, his beauty is not totally innate—after a good hair brushing, I use some of the beer mixture on him, washing it off after a few minutes on his coat.Last year, at a farmers market in the outskirts of Austin, I found myself at a beekeeper’s stall buying way too much beeswax. I wanted to make my own candles, but the beeswax ended up sitting in a dark corner of my pantry for months.Now that we’re trying to make our household a “greener” one, I’ve been looking for ways to reduce the plastic and packaging that comes in and out of the house. So the beeswax has been revamped into lotion bars.My daughter is almost two now, and I place the ingredients on the kitchen table where I can sit down while she stands between my legs to help. She stirs with a wooden spoon, uses the dropper to mix in oils, and I help her pour the mixture into the molds. Sometimes we decorate the mixture with flower petals, and the result is a lovely golden bar that instantly softens when it glides on the skin.My daughter's routine is now lining up more and more with mine, so we sometimes take our nighttime bath together in the big tub. After we’ve dried off, we sit in our towels and moisturize. She has her own little lotion bar, which we molded into a small almond shape that she can easily grasp onto. As I slowly drag my adult-sized lotion bar around my back, up and down both legs, and onto my knees and shoulders, my daughter attends to each movement, and she carefully does the same.Explore Bon AppétitHealthyishSelf CareNatural BeautyessayRead MoreLifestyleThe Cookbook That Makes Herbal Medicine Totally ApproachableBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-16", "author": ["Condé Nast", "Paloma Quevedo"]}