{"id": "d89e9690651190c115aae5cea30ee0f3", "url": "https://www.bonappetit.com/story/mozzarella-in-carrozza", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Mozzarella in Carrozza Is the Perfect Combination of Crunchy, Gooey, and Saucy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMozzarella in Carrozza Is the Perfect Combination of Crunchy and GooeyOkay, it's basically a giant mozzarella stick. By Anna GassDecember 17, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Micah MortonFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Growing up, I always knew the food my mother prepared for me after school was a little different than what my friends were eating. As an Italian immigrant from Calabria, she kept her culinary heritage alive here in the U.S. by re-creating the dishes she grew up making and enjoying with her family. But as a child I didn’t yet appreciate these traditional Italian dishes and instead longed for the food I saw in commercials and tasted at friends’ houses.In true mom fashion she would concede but not entirely, which led to her “Italianizing” whatever she prepared. This concession is how I came to know and love Mozzarella in Carrozza.After asking for a simple grilled cheese—two pieces of white bread, American cheese, and a quick browning sear in a pan with butter—I was presented with something, well, a bit different.Mozzarella in carrozza is the closest thing Italians have to grilled cheese: a molten mozzarella center nestled between two pieces of breadcrumb-crusted, pan-fried slices of bread. Serve with a side of marinara and you have the ultimate Italian treat that satisfies a craving for savory, gooey, saucy while also delivering a fantastic crunch factor.So who do we have to thank for this mozzarella masterpiece? The origins of this sandwich have long been debated, as you can find them served all across Italy, from Calabria to Naples and Venice, where they add prosciutto and anchovy. Everyone puts their own spin on it, but the foundation remains the same. The name itself also has an interesting backstory. Carrozza means  carriage in Italian. Some believe the sandwich received its moniker because it resembles the carriage used to carry milk from the farms to the cities (but I can’t quite picture this). Others insist that the long strands of cheese that pull from the bread as you eat it look much like the reins of horse-drawn carriages. Regardless of which story you’re drawn to, the sandwich has withstood the test of time, remaining a staple in Italian kitchens due to its simple ingredients and easy preparation. Not to mention, it tastes delicious!To make it, start with a couple slices of thick Italian bread (day-old is best). Fill with mozzarella. Fresh mozzarella is traditional, but I love low-moisture shredded mozzarella. Either works great and will result in an ooey-gooey cheese-pull moment. If you opt for fresh mozzarella, cut about three ½-inch-thick slices and pat dry with a paper towel. You want to remove as much moisture as possible. For the shredded variety, pack on about ¾ cup. Press down on the bread to seal the cheese in. Then lightly coat the assembled sandwich in flour, quickly dip both sides in beaten egg, and for the ultimate crunch factor, cover in seasoned Italian breadcrumbs.Heat up a pan with a nice glug of neutral oil, about a ½ inch deep, and carefully drop in your sandwich, making sure the bottom piece is submerged. You are looking for a shallow fry. After a golden-brown crust forms and the mozz starts to melt, give it a flip and finish it off on the other side. Drain on a paper towel and sprinkle with salt. If you want to feel like you’re eating a jumbo mozzarella stick, dunk it in your favorite marinara (warmed up, please). Personally, I like mine super crunchy, so I skip the sauce, but you do you.The next time you have a hankering for a warm, cheesy sandwich, instead of reaching for American or cheddar, grab a few extra ingredients from the shelf for this Italian version. It might be a few extra steps but you will be handsomely rewarded with a golden, crunchy upgrade. Throw in a zippy arugula salad and your fancy lunch just turned into a simple dinner.Anna Gass is the author of Heirloom Kitchen: Heritage Recipes and Family Stories from the Tables of Immigrant Women.Explore Bon AppétitIt's That SimpleMozzarellaItalianSandwichGrilled CheeseRead MorecookingWhen I Have More Cheese Than I Know What to Do With, I Make Fromage FortBy Em McGarriglecookingI Am Passionate About Snack Boards, And These Are My RulesBy Amanda MitchellRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-17", "author": ["Condé Nast", "Anna Gass"]}