{"id": "d8c78b3c79527371025f18763f663d79", "url": "https://www.bonappetit.com/story/office-party-etiquette", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Office Holiday Party Etiquette: Is It Ever Okay…to Bring a Plus-One? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay…to Bring a Plus-One to the Office Holiday Party?Solicited advice on partying with your coworkers.By Alex BeggsDecember 18, 2019FacebookTwitterEmailIllustration by Cari Vander YachtFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.Can I bring my significant other to the company blowout? —Significant SergioNah, thanks. This is your one chance to blow off a year’s worth of coffee-breath-flavored steam with your trenchmates. Partners add an awkward couples cruise dynamic, not to mention they seem to unnecessarily highlight who has their conventional societal whatnot together and who is a wild and free bohemian.Illustration by Cari Vander YachtWhen can I commandeer the playlist? I’m an experienced DJ—it went over really well at my cousin’s bat mitzvah. —Bold BartYou need to have people on your side before you storm the DJ booth. Do you have the undying support of at least five others? Okay. But if they shake their heads saying, “No, man, I love these Kidz Bop versions of early 2000s R&B songs,” then let the music in your head suffice.Can you avoid the boss altogether? Or at some point, do you need to go up to them and make small talk? —Actually Adam RapoportHow often do you get face time with your boss? If this is an opportunity to remind them that you’re human, not a number-crunching never-sick robot, you’d better seize it. But the boss doesn’t want to be cornered at the crudités table while you lay out the plans for a new project you’ve been plotting in the shower. Schedule a real meeting for that and use this encounter to find out if the boss is human too, not a number-obsessed corporate-controlled robot.Illustration by Cari Vander YachtWhat’s the dress code situation? I want to get crazy! —Fully Clothed FrankieTwo years ago contributing food editor Rick Martinez wore a stunning navy velvet tux jacket to the BA holiday party, and not a day goes by that I don’t think about it. Dressing up is a nice (maybe even fun!) thing to do and a sign of respect and festivity, but no one is going to care if you show up in the same outfit you wore to work that day. However, if you feel like this is the prime time to break out that flesh-colored spandex jumpsuit with the pearlescent sequins that turn you into a giant betta fish, rock on. Like a velvet tux, I’ll never forget it either.Is it cool if I leave the party early? Or not go at all... for four years in a row? —Deterred DidiDon’t skip it. It’s humanizing and cathartic—and your only window to pry into your coworkers’ personal lives without seeming creepy. But it’s such a good idea to leave early I’d recommend WE ALL do it! That way you get free mini spanakopita and look like a team player but avoid any regrettable third-drink mistakes and get a full eight hours’ sleep.Illustration by Cari Vander YachtSo you drank too much at the holiday party. How do you handle the next day? —Hungover HarrietYou come in and show yourself! “I’m never doing shots again,” you’ll moan to your bleary-eyed colleagues, knowing you definitely will the second that tiny glass is in your clutches. Misery loves company. Bring a bag of egg-and-cheese sandwiches and a case of coconut water. Misery loves those too.Is it ever okay to do shots with your coworkers? —Straight-Shooting SusanI plan on living out the rest of my days on this planet without ever doing shots again. And I suggest you do the same. Have you ever woken up the next day and thought, I’m so glad I did shots last night! I feel amazing! I’m going for a run! It’s pure pain. And tequila didn’t do all that work to be treated like this! No shots!Illustration by Cari Vander YachtWhat snacks can I eat with my hands versus utensils? —Touchy TobyThe cocktail party appetizer eating guide:HANDS:• Arancini• Mini spanakopita• Shao mai• Sliders• Deviled eggs• Bruschetta• Pigs in a blanket• Bacon-wrapped datesUTENSILS:• Ceviche????How do I leverage my boss’s inebriation to get a raise? —Anonymous AlexTHIS NEVER WORKS.That’s all for now, but if you have petty etiquette questions, recipe requests, or just want to tell me you think I’m unfunny and WRONG, so wrong, about everything, please email staff.bonappetit@gmail.com.Love,AlexExplore Bon AppétitIs It Ever OkayEtiquetteHoliday 2019Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-18", "author": ["Condé Nast", "Alex Beggs"]}