{"id": "d8ce2294b071ad4fd6e6dbb8a4873720", "url": "https://www.bonappetit.com/recipe/shrimp-empanadas", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Shrimp Empanadas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueShrimp EmpanadasBy Ignacio MattosApril 17, 20184.3(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintFor a Uruguayan like Ignacio Mattos, who developed this recipe, these snacks are a labor of love. Gather a crew to help stuff and pinch them, then fry up enough for a crowd. If you can find head-on shrimp, buy them and add the heads to the stock. They’ll add an intense shrimp flavor to the filling. Serve these empanadas alongside a picnic menu of beef sliders, grain salad with tomatoes, and Italian sundaes with Nutella.Ingredients8–12 servingsDough4oz. lard, melted, slightly cooled1Tbsp. kosher salt1Tbsp. red wine vinegar6cups all-purpose flour, plus more for surfaceFilling1lb. small shrimp, preferably head-on, peeled, deveined, shells and heads reserved4Tbsp. extra-virgin olive oil, divided⅓cup dry white wine1medium onion, very finely chopped4garlic cloves, thinly sliced6Tbsp. chilled unsalted butter, cut into pieces2Tbsp. finely chopped cilantro1tsp. finely grated lemon zest½tsp. crushed red pepper flakesKosher saltVegetable oil (for frying; about 8 cups)Special EquipmentSpecial Equipment: A 4½\"-diameter cookie cutter; a deep-fry thermometerPreparationDoughStep 1Mix warm lard, salt, vinegar, and 2 cups lukewarm water in a large bowl to combine. Gradually add 6 cups flour, mixing with a sturdy wooden spoon or your hands until a shaggy dough forms.Step 2Transfer dough to a lightly floured surface and knead until mostly smooth and no dry spots remain, about 2 minutes. Wrap in plastic and chill at least 2 hours.Step 3Do Ahead: Dough can be made 2 days ahead. Keep chilled.Filling and AssemblyStep 4Cut shrimp in half lengthwise, then finely chop (it’s okay if some pieces get pasty). Set aside.Step 5Heat 2 Tbsp. olive oil in a large saucepan over medium-high. Add reserved shrimp shells and heads (if using) and cook, smashing down on shells and heads occasionally with a wooden spoon, until pink and bottom of pot begins to brown, about 5 minutes. Add wine and cook until reduced by half, about 2 minutes. Add ⅔ cup water; bring to a boil. Reduce heat to low and simmer until reduced by one-third, 6–8 minutes. Let cool. Strain stock through a fine-mesh sieve into a heatproof measuring glass, pressing on solids; discard solids.Step 6Wipe out pan, add remaining 2 Tbsp. olive oil, and set over medium heat. Cook onion, stirring often, until softened but without taking on any color, about 5 minutes. Add garlic and cook, stirring, until softened, about 3 minutes. Add shrimp stock and reserved shrimp and cook, stirring occasionally, until most of the shrimp have turned pink, about 2 minutes. Remove from heat. (Shrimp will continue cooking in the residual heat.) Mix in butter, cilantro, lemon zest, and red pepper flakes; season with salt. Let cool 20 minutes, then transfer to a medium bowl. Chill at least 1 hour before using.Step 7Divide dough into 6 equal pieces. Cover all but 1 piece with plastic wrap and chill. Roll out remaining piece of dough to a 14\" round about 1/16\" thick.Photo by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiStep 8Using cutter, punch out 6 rounds from dough. Place 1 Tbsp. filling in the center of each and brush water halfway around edge of each round.Photo by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiStep 9Fold dry side of dough up and over filling to create a semicircle. Pinch edges to seal; crimp.Photo by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiStep 10Transfer to a parchment-lined rimmed baking sheet. Repeat with remaining dough and filling. Chill 20 minutes.Photo by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiStep 11Meanwhile, pour vegetable oil into a large heavy pot fitted with thermometer to come halfway up sides. Heat over medium-high until thermometer registers 350°. Working in batches and adjusting heat to maintain temperature, fry empanadas, turning often, until deep golden brown, 5–7 minutes per batch. Transfer to a wire rack set over paper towels; let cool 2 minutes before serving.Step 12Do Ahead: Filling can be made 1 day ahead. Keep chilled.How would you rate Shrimp Empanadas?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangle\"Using cutter, punch out 6 rounds from dough.\"  Says it right in the recipe if you would've read it instead of just looking at the pictures and then giving one star for it.Anonymous7/25/2019Agree about the problem with the photo, but I assume we should follow the instructions and cut the rounds rather than try to adjust to the photo.johngouldrubinNYC4/14/2019Your photo has a square piece of dough, not roundfredricksonEarth4/13/2019Explore Bon AppétitSavory Pie & TartSouth AmericanLatin AmericanShrimpShellfishSeafoodSnackStarterNut-FreeDeep-fryLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}