{"id": "d8ce3d445a80cc540ac48797268dfb19", "url": "https://www.bonappetit.com/story/chili-powder-vs-chile-powder", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "Chile Powder vs Chili Powder - The Difference Between Chile Powder and Chili Powder | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYes, Chili Powder and Chile Powder Are Different ThingsThat one letter makes a biiiig difference.By Sarah JampelAugust 27, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailChile powder, chili powder. Seems like a small difference, right? Maybe one you wouldn’t even notice at the grocery store, in the glaring lights of the spice aisle? Welp, read carefully, friends: Because that last letter is an important distinguisher of two different ingredients.Let’s start with chile powder, which is made from ground dried chiles, with few or no additives. There are many types of chile powder, all named after their pepper of origin. Ancho chile powder, the kind Molly Baz recommends for her No-Grill Elote is made from, uh, ancho chiles (a.k.a. dried poblanos) and is fruity, earthy, and relatively mild. Because it’s smoky, it’s helpful for creating the illusion of grilling even when no grill is involved (as in the aforementioned elote).Chipotle chile powder, which comes from dried and smoked jalapeños, has a similar rich charred flavor but more intense heat. Cayenne, which starts from—you guessed it—dried cayenne peppers, is the the most fiery and least smoky of the three and is often used in small quantities (because, very fiery). While those three are the most common chile powders in the US, there are so many available for mail-order that you could make a hobby of collecting harder-to-source varieties—like habanero, guajillo, piri piri, Kashmiri chile, Bird’s Eye. But before you clear out a drawer exclusively for chile powders, remember that, like all ground spices, they lose potency as they sit.Now onto chili powder, which is used to flavor the dish of the same name (you know, like Chicken Chorizo Chili). In the BA recipe style guide, a 16-page document expertly maintained by our recipe editor Liesel Davis, chili is said to refer to “chili con carne and the seasoning used in making it.” Chili powder contains other ingredients like oregano, paprika, pepper, cumin, garlic powder, onion powder, and/or salt. You’ll have to read the ingredient list to see exactly what the jar contains, as the exact blend varies between brands.Deputy Food Editor Chris Morocco is a big fan of high-quality chili powder because when he wants dried, ground chiles, he’s most often craving the other spices and dried herbs that’ll make it multidimensional rather than one-note. Plus, it’s more of a one-stop shop, delivery complex flavor with only one jar. He uses chili powder in dry rubs, to spice up his Easiest-Ever Grilled Veggie Burgers, and to finish buttery seared mushrooms. His advice? Find a blend that doesn’t contain salt so that you’re still able to season the dish to taste.In conclusion, both chili powder and chile powder have their uses, but they’re not the same. So before you go adding 2 teaspoons of cayenne to your chili (...ouch!), make sure that’s an “i” and not an “e” on the jar, okay?First chile powder, then elote:No-Grill EloteEverything you love about Mexican elote—the charred kernels, the creamy-spicy-salty sauce, lots of lime—without the grill.View RecipeExplore Bon AppétitChileAncho ChileChiliChile PowderRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-27", "author": ["Condé Nast", "Sarah Jampel"]}