{"id": "d8d64d2bd26558046b869a8f1eff6a63", "url": "https://www.bonappetit.com/story/zip-top-silicon-storage-bags", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "Silicone Zip Top Bags Are Helping Me Give Up Single-Use Plastic for Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureZip Top Bags Are Helping Me Drop Single-Use Plastic for GoodThese silicone containers are infinitely reusable and superior to plastic bags in every way.By Sarah JampelMarch 8, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.The problem I have with plastic bags is the same problem I have with trivial arguments: I just can’t seem to let them go. Once I have a plastic bag (or a grudge :-)), it’s mine for life. This explains why, when we recently moved apartments, I unpacked about 30 used plastic bags in various states of cleanliness. I do feel justified, however: Bags like these take hundreds of years to degrade in a landfill and may end up in the oceans, where they kill marine life like turtles. So why not scrub them with soap, drape them all over my kitchen and living room to air-dry, and then pack them up and tote like pets and prized trinkets across state lines?My partner, who is constantly sniffing and inspecting the elderly bags, wondering if they’re safe for storing fresh cheese or newly washed herbs, tends to disagree. Try as I might, disposable plastic bags cannot last in my kitchen rotation forever.But what can withstand years of wear are these silicone Zip Top bags, which don’t get thin or cloudy or ripped, no matter how many times I wash and dry them. I use them anywhere I’d use plastic: for freezing bananas and fruits for smoothies, decanting mostly empty boxes of pastas and grains to save space in my pantry, tucking a sandwich or a snack for a long car ride. They have all of the benefits of plastic bags—space-saving, lightweight, convenient—and then some. Because they have flat bottoms, I can use them to hold liquids, like soups and sauces, so that they don’t leak or flop, as well as delicate items (like grapes and raspberries) that shouldn’t risk getting smashed. They’re also freezer-, microwave-, and dishwasher-safe. And since a Zip Top container stays open, I can eat my grain salad directly out of one—which is handy when I’m too lazy to wash a bowl. My plastic bags can’t do any of that!Even with my set of three, I’ve found myself reaching for the box of plastic bags with a lot less frequency. Don’t get me wrong: I’m going to keep my old plastic bags in the rotation until I’m made to say goodbye—but let’s just say I won’t be adding new athletes to the team anytime soon.Photo by Emma FishmanReusable Zip Top Storage Bags (Set of 3)$48 at Amazon$48 at HiveExplore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-08", "author": ["Condé Nast", "Sarah Jampel"]}