{"id": "d8d6ec6d54d0122b18b5191489037e50", "url": "https://www.bonappetit.com/city-guides/new-york/venue/burrow", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Burrow Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginnew yorkBurrowA whimsical Japanese bakery grows in DumboFacebookPinterestTwitterEmailAlex Lau GO HERE: for all of pastry chef Ayako Kurokawa’s weird, charming, buttery masterpieces.ORDER THE: cakes. You know the ones. Kurokawa’s gained quite a following for her quirky, yet minimal and delicate aesthetic—apple-caramel cakes draped with thin sheets of shaved apple, frosted blue eyeballs dotting pineapple upside-down cakes. But even her simplest ones, like strawberry shortcakes and cocoa-dusted chocolate cakes, hold their own among the borough’s big names in baking. (However, if cakes aren’t your thing, crumbly linzer cookies swiped with raspberry jam, jagged black pepper-scallion scones, and ginger-cinnamon braids paired with faintly smoky hojicha still hit the sweet spot.)THE VIBE IS: relaxed, with occasional freneticism if a handful of architects or stroller-pushing locals swing by. “Intimate” is how a broker might describe the space. Inside, there are only two wooden chairs, a narrow counter by the window for standing, and three leather ottomans outside, so there’s not a lot of room to spread. The dark wood display, cobbled together furniture, and pale hues evoke both your parent’s basement and a stylish cafe in Tokyo’s old Asakusa neighborhood.PRACTICAL STUFF: Open Monday to Friday, from 9 a.m. to 4 p.m., and closed on the weekends. Kurokawa and her baked goods stick to a militaristic schedule. Breakfast rolls out between 9 to 11 a.m. Then cookies and cream puffs start sliding into the shelves right around 11:30 a.m. But the cakes don’t debut until around 2 p.m., so plan accordingly.—Elyse InamineAlex LauAlex LauWE ALSO LOVEVoyager EspressoThe futuristic Aussie cafe hidden in a Lower Manhattan subway stationOkonomiJapanese breakfast and ramen, all in one perfect Williamsburg spotMomofuku KoHang out with chefs at David Chang’s continually groundbreaking spot in the East VillageExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-21", "author": ["Elyse Inamine"]}