{"id": "d8dbd28690589fb40f2f408f32adeb90", "url": "https://www.bonappetit.com/recipe/fruit-sandwiches", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Japanese Fruit Sandwiches Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFruit SandwichesBy Molly BazJuly 19, 2018EmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintYou can make these with a combination of fruits or go monochrome—we love the simplicity of an all-strawberry sandwich as much as a mixed-fruit one. Using thick slices of Japanese milk bread, however, is a must. Its soft, fluffy interior soaks up the cream and fruit juices, but it won’t turn to mush. There aren’t many mass-produced milk breads out there, but you can find it at Asian markets as well as grocery stores that stock a good selection of Asian ingredients (or make your own!).IngredientsMakes 41cup chilled heavy cream1Tbsp. plus 2 tsp. sugarA pinch of kosher salt8slices Japanese milk bread1kiwi, peeled, cut crosswise into 4 ½\"-thick rounds8small strawberries, trimmed, halved lengthwise1yellow peach or ¼ mango, cut into 1½\"x½\" stripsPreparationStep 1Using an electric mixer on medium-high speed, beat cream, sugar, and salt in a medium bowl until stiff peaks form, about 3 minutes. (You need it to be on the firm side. If cream is underwhipped, it will be more difficult to slice the sandwiches.)Step 2Neatly remove crusts from bread with a serrated knife. Arrange bread on a clean work surface. Evenly spread ¼ cup whipped cream on each slice of bread with an offset spatula or butter knife. Place 1 kiwi round on top of whipped cream in the center of 4 bread slices. Arrange strawberry slices in corners of bread slices, orienting them so that the pointed end is tucked right into the corner. Place 4 peach strips in the gaps between kiwi and strawberries.Step 3Place a second slice of bread, cream side down, over to close sandwich. Smooth outside edges of whipped cream, adding a little if necessary to fill gaps. Wrap each sandwich in plastic wrap and chill at least 3 hours and up to 8.Step 4Using serrated knife, cut each sandwich into 4 triangles and serve.Photo by Alex LauHow would you rate Fruit Sandwiches?Leave a ReviewTell us what you thinkExplore Bon AppétitSandwichFruit DessertDessertJapaneseEast AsianAsianKiwiFruitStrawberryBerryPeachStone FruitSummerEasySnackNut-FreeVegetarianMemorial DayLabor DayBreakfastLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-19", "author": ["Condé Nast", "Molly Baz"]}