{"id": "d8df1d7d66b04fd8b4acce4da7d24f77", "url": "https://www.bonappetit.com/story/el-bashas-soup", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "At El Basha, Eat Your Soup and Don’t Ask Questions | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAt El Basha, Eat Your Soup and Don’t Ask QuestionsMy strategy at this Lebanese restaurant was to try and order one of everything. The owner noticed.By Rainbow RowellJune 6, 2018FacebookTwitterEmailPhoto by Dana DamewoodFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.The first time Vera Razamazova gave me free soup, I thought it was because she thought I still worked for the newspaper.I was a columnist here in Omaha for nearly 11 years. It wasn’t ever like being truly famous, but I could always tell when people recognized me, especially at restaurants. They’d be nice to me in a way that wasn’t really nice. They’d insist I take free dessert, which I couldn’t ethically eat.I’d stop going to places when that happened.So when Vera sent out soup for me, my heart sunk. I couldn’t give up El Basha. “I can’t eat this,” I said to my husband. “It’s graft.”“You don’t even work there anymore,” he said. “Eat your soup.”El Basha’s creamy lebneh and warm pita.\nPhoto by Dana DamewoodI ate it. It’s El Basha’s special yellow lentil soup. With fried bread for dipping. And fresh herbs and lemon. Vera stopped by the table later to make sure I liked it.Vera usually stops at the table, if the restaurant isn’t too busy, to smile and say hello. Sometimes she’ll wave at you from the kitchen. A few visits after this one (a few free bowls of soup later), she asked me what I did for a living.I must have looked like a maniac. Vera wasn’t giving me free soup because she wanted me to write about her business—she just knew that I loved the soup! I felt profoundly grateful.Okay, so maybe you’re wondering why I wasn’t just ordering the soup if I loved it so much…The mezza plate is a must: hummus, tabbouleh, baba ghanuje, and falafel, with pita bread.\nPhoto by Dana DamewoodBecause, at El Basha, if you order a sandwich—I recommend the kafta wrap, by the way; it’s spiced ground beef, grilled on skewers, then wrapped with tahini and Turkish pickles—you have your choice of french fries (good, but basic), lentil soup (heavenly), or warm garlicky potato salad (transcendent). I usually go with the potato salad and mourn the loss of the soup.Vera noticed.She’s probably noticed that I try to order everything when I come to El Basha. My strategy is to go with a crowd and hope they like to share.The mezza plate is a must: hummus, tabbouleh, baba ghanuje, and falafel, with warm pita bread. If you order that and the mixed grill platter—kafta, grilled chunks of chicken with garlic sauce, and gyro meat—you’ll have tried about half the menu.I’m also addicted to the lebneh, strained yogurt with olive oil and mint, and especially to the sour purple pickles that come with everything when the right kind of turnips are in season. Both are made in-house.Almost everything on El Basha’s menu is made on site. I didn’t know that until I sat down with Vera for this piece, but I should have guessed; the salads change depending on what vegetables are in season, and when El Basha runs out of something, it’s out for the day.That’s her husband’s doing, Vera says. Ahmad Nabulsi opened the restaurant about 20 years ago with his nephew, hoping to bring to Omaha some of the foods they loved growing up in Lebanon. Nothing made it onto the menu unless Ahmad could make it fresh. The beef shawarma is marinated and stacked right here. The hummus starts with dry beans, never canned or cooked. Ahmad has his eye on adding fresh baked goods to the menu, too, if he can find space for ovens.The restaurant belongs to Ahmad and Vera now. And it feels like a place that’s loved. That’s partly why people are drawn to it, I think.Inside El Basha.\nPhoto by Dana DamewoodIf you’ve been coming to El Basha since the beginning, you’ve followed them to a new location, you’ve watched the patio grow and bloom. The dining area has gotten homier. More pictures on the walls, new tile floors, more modern tables and chairs. (Gone is the chair with the lightning-bolt tear that my son called The Chair Who Lived.) New brightly colored glass lamps, from a Turkish market in Houston, hang over the tables.If you’re a regular, you get used to seeing other regulars. The restaurant is popular with nearby hospital staff and with people who work at First Data. It’s also popular with various immigrant communities. Vera wonders if Ahmad’s cooking reminds a lot of different people of home.“Most of the people who come here, we’ve known them awhile,” she says. “Their kids are eating the food that their parents were eating when they were here dating.”While we talk, one of the cooks brings us Turkish coffee and a mezza plate. The baba ghanuje is subbed out with lebneh, the way I always order it.I think about telling Vera that I can’t accept free food because this time I really am writing about her, but I can hear my husband in the back of my head. “Eat your soup,” he says.I do.Rainbow Rowell is a writer and author of many books including Eleanor & Park.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Rainbow Rowell"]}