{"id": "d8eac00df90b1a55407db14eee75479d", "url": "https://www.bonappetit.com/recipe/grilled-vinegar-turkey-with-chiles-and-rosemary", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Grilled Vinegar Turkey With Chiles and Rosemary Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueGrilled Vinegar Turkey With Chiles and RosemaryBy Molly BazOctober 20, 20204.5(34)Read ReviewsTriangleEmailPinterestPrintPhoto by Kelly Marshall, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintCutting the turkey in half dramatically reduces the cook time. Brine the night before and you’ll be able to get it on the table after just an hour and a half or so on the grill. If you aren’t up for tackling the butchery yourself, most butchers will do it for you. Our recipe is inspired by the vinegar chicken at Bernie’s in Greenpoint, Brooklyn.Ingredients8 - 10 ServingsBrine6Tbsp. Diamond Crystal or 3 Tbsp. plus 1½ tsp. Morton kosher salt3Tbsp. paprika2Tbsp. light or dark brown sugar1Tbsp. freshly ground black pepper1¼tsp. ground cinnamon112–14-lb. turkey, backbone removed, halved along breastboneSauce and assembly3Tbsp. extra-virgin olive oil, plus more for grill2red Fresno chiles or jalapeños, thinly sliced2cups sherry vinegar or red wine vinegar2Tbsp. light or dark brown sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more6large sprigs rosemary½cup (1 stick) unsalted butter, cut into 1\" pieces1Tbsp. Worcestershire saucePreparationBrineStep 1Mix salt, paprika, brown sugar, pepper, and cinnamon in a small bowl. Pat turkey halves dry and cover all over with spice mix, packing on until you’ve used all of it. Arrange turkey halves, breast side up, on a rimmed baking sheet and chill, uncovered, at least 12 hours and up to 3 days.sauce and assemblyStep 2Let turkey sit at room temperature 1 hour before grilling. Pat dry with paper towels, then brush all over with 3 Tbsp. oil.Step 3Whisk chiles, vinegar, brown sugar, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a measuring glass or small bowl until sugar dissolves.Step 4Prepare a grill for medium indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off); lightly oil grate. Cover grill; heat to 350° (place an oven thermometer in the center of indirect side of grill if there isn’t one built in).Step 5Place turkey, skin side up, over indirect heat, with breast halves next to each other and farthest away from the heat (the legs should be closest to the heat). Cover grill and grill turkey, basting skin with chile sauce every 20 minutes, until an instant-read thermometer inserted into thickest part of breasts registers 140° and thickest part of legs registers 160°, 1¼–1¾ hours. Keep an eye on the temperature inside the grill and aim to maintain heat at 350° as much as possible. If using a gas grill and the temperature drops significantly, turn on a second burner to medium-low to bring the temperature back up. If using a charcoal grill, light a chimney of coals and add as needed.Step 6Lightly oil grate on hot side of grill. Using tongs and a large spatula to support the turkey, turn turkey halves over, arranging skin side down over direct heat. Brush turkey with chile sauce (you won’t use all of it) and grill, uncovered, until skin is charred and crisp, 8–10 minutes. Thickest part of breasts should now register 150° on thermometer and legs should register 170°. Arrange rosemary sprigs over a cutting board and set turkey, skin side up, on top. Let rest 30–60 minutes before carving.Step 7While the turkey rests, bring remaining chile sauce to a simmer in a small saucepan over medium heat. Whisk in butter a piece at a time, incorporating completely after each addition. Stir in Worcestershire sauce; season with salt.Step 8Carve turkey as desired and transfer to a platter; arrange rosemary around. Pour sauce over turkey, along with any accumulated juices on cutting board.How would you rate Grilled Vinegar Turkey With Chiles and Rosemary?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleI don't have a review, I can tell this turkey is just terrific.  This is the ending of July and I am just starting to put my Thanksgiving menu together. This will be one of my main courses at my table. I am so glad for everyone's reviews. Now I know this turkey can be done in the oven,  happy holidayssharynlawton, oklahoma7/23/2021I made this Turkey in the oven instead of on a grill and it was the best turkey I have ever had, no question. This is my go-to for turkey from now on.PapaJamonNew York, New York11/30/2020This was soo delicious! I loved the spices in the brine and that sauce!! I just cooked a Turkey breast and it took about an hour on the grill. Will definitely make this again probably will make a chicken with this recipe sometime this year.PattySeattle, WA11/29/2020Outstanding!  This was my first grilled turkey and I made the right choice of preparation.  The rub/brine was smoky and rich.  And the spicey and tart basting liquid made the turkey beautiful and juicy.   There was a nice amount of heat, but it didn't interfere with the flavor.  And making the sauce and serving it on the side was great for those of us who like something other than gravy.\n\nThis one is a keeper!Diane Belton11/27/2020Made this for Thanksgiving yesterday - and boy was it a hit! So delicious and cooking times were pretty true. The vinegar sauce is punchy, but a small amount enhanced all those delicious brined flavors. Definitely will make this again and I will definitely be preparing chicken this way too.Amy E.Chevy Chase, MD11/27/2020Whoo! Okay, I used this today for Thanksgiving! Followed the recipe for the dry brine and the basting liquid, but spatchcocked a 10-pound turkey and roasted in the oven: 450 for 30 minutes, then basted with the vinegar/chiles/brown sugar liquid, lowered temp to 350 and basted every 20 minutes until the breast reached 165. At that point, I added the melted butter and Worchestershire to the liquid and basted again while it cooled and before I carved.\n\nIT. WAS. AMAZING. It was nice to have such a bright-tasting and flavorful turkey that provided contrast rather than blending in with the stuffing and other things on the table. Husband was confused as to how this was still turkey. \n\nFor those asking about heat: it turned out quite subtle here! Definitely not bland, but it wasn't spicy by any means. If you wanted to dial it up, putting some of the sauce on the meat post-carving would be a way to customize to different palates at the table. But this year with just the two of us was a good time to experiment with something new.\n\nThanks Molly!Jess G.Hyattsville, MD11/27/2020So excited to reg this! I am to cook it in the oven. But wondering I should put butter or something under the skin? To help make it more moist and the skin more crispy?  I am also new to making a turkey. AnonymousThousand Oaks, ca 11/26/2020I'm thinking about making this  but my mom can't stand spicy food. Any ideas how to modify the sauce  for people who don't like spicy food? AnonymousZieglerville, PA11/25/2020I have just prepared the turkey with the spice rub and while re-reading the recipe I wonder if the rub is left on the bird with just a pat down to dry before grilling or is  most of the salt wiped away while patting down? I don't want the meat to be to salty.AnonymousHoney Grove TX11/22/2020If you had asked me about recipes I would have asked you to please include nutrition information.  \nSo many of us are trying to lose weight it would be a big help\nThank you.AV8Rcoastal Alabama11/21/2020Due to a last minute grill issue, I had to pivot to oven-roasting my turkey. I followed the grilling directions using my oven -- 350 degrees, for about an hour and 45 mins (13 lb turkey), and finished the turkey for a few minutes on broil to get that crispy skin. If you don't have a grill, or want to try this in the oven, it still turned out AMAZING! 10/10 would recommend.AnonymousWashington, DC11/20/2020Flavor packed, and unique! This was a great twist on turkey. The brine was excellent and made the turkey moist and delicious. I served the sauce on the side which was good since I thought the sauce was a little heavy on the vinegar .... but not in a bad way - just different. A little goes a long way. I used a mix of sherry and red wine vinegar. The sauce actually tasted much better the next day.  My guests all raved about this turkey and I will definitely be trying this one again.  I used a gas grill and kept it pretty much rock solid at the 350-degree mark. It took me about 2 hours to get to the recommended internal temperatures and then I let it rest for 1 hour. I would encourage anyone looking for a fun and flavorful twist to a traditional Thanksgiving bird to consider this recipe!  JeffNew Jersey11/9/2020Really tasty and a quick, easy cooking method.  The hardest part was cutting it, but after that  using the gas grill made for a delightful change of pace from our usual oven roasted turkey. The sauce was a tad too vinegary for me, so the next time I may reduce the amount of vinegar or add a little more brown sugar. I used red wine vinegar and regret that I didn’t run to the store for sherry vinegar. That said, my sons thought it was delicious, gobbled it up and said they wouldn’t change a thing. Barb GNew York11/8/2020Explore Bon AppétitTurkeyPoultryMainNut-FreeKetoGrillingThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Molly Baz"]}