{"id": "d8eb71d76c91f45f1ceabf723ec0fd38", "url": "https://www.bonappetit.com/city-guides/package/tokyo", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Tokyo City Guide - Where to Eat and Drink  | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincity guidesTokyoPhoto by Xavier Girard LachaîneWe don’t need to tell you that Tokyo is the destination for people who travel to eat. But with izakayas around every corner, six-seat soba shops down hidden alleys, pizza and gelato that’s better than what you’ll find in Italy (or Brooklyn), and high-quality sushi even at the convenience stores.…well, it can be hard to know where to look first. That’s where we come in. Our list of must-eats, from Tokyo-obsessed chefs around the world and on-the-ground locals, will give you a starting point (and help you overcome the language barrier). Start here, then spend some time wandering the city, stopping for every onigiri and daifukumochi you see.Where the Chefs GoFacebookPinterestPhoto by Xavier Girard LachaîneKaduyaYour old-school ramen-and-dumpling hookup.FacebookPinterestPhoto by Xavier Girard LachaîneHigashiya GinzaSweets to stuff in your suitcase.FacebookPinterestPhoto by Xavier Girard LachaîneGinza KojyuThe less-is-more tasting menu.FacebookPinterestPhoto by Xavier Girard LachaîneInnsyouteiReconsider what you think you know about tofu.FacebookPinterestPhoto by Xavier Girard LachaîneOhitsuzen TanboWith rice this good, you almost forget about the fresh fish that tops it (almost).FacebookPinterestPhoto by Xavier Girard LachaîneFuglenCoffee by day, cocktails by night.FacebookPinterestPhoto by Xavier Girard LachaîneMikawa ZezankyoAs good as tempura gets.FacebookPinterestPhoto by Xavier Girard LachaîneSavoy Azabu-jubanAuthentic Neapolitan pizza, 6000 miles from Naples.Where the Locals EatTonkiDeep-fried pork cutlets, with no frills or fussButagumiPork cutlets taken to a higher playing field.Nata de CristianoAs close as you’ll get to Portugal without leaving Tokyo.Shin UdonThis udon will ruin you for all other noodles. So long, ramen. See ya, soba.IfuuCome to this izayaka for the sake, stay for the seasonal fish.TenkiyoBudget-friendly tempura below the buzz of Tokyo Station.SuzuranRamen as a work of art.ShirubeA bustling, all-are-welcome pub where the mackerel’s as good as the fried chicken.Japanese Ice OucaLuscious Italian-style gelato meets uniquely Japanese flavors.NunotsunesarashinaBy-the-books soba in a fittingly classic environment.Bloody AngleClassic cocktails in a romantic rose-tinged setting.KikanboHellishly fiery ramen that will put your spice tolerance to the test.FellowsAmerican burgers that are better than burgers in America.Nemuro Hanamaru GinzaThe sushi conveyor belt you‘ve been dreaming of.Café de l‘AmbreWhat people are talking about when they praise Japanese coffee.KitsuneyaThe real reason to go to Tsukiji fish market is not fish at all.Anda GyozaA vegetable-forward respite from tempura and sushi.KushiwakamaruMeat on a stick! And plenty of beer, too.Still Hungry for Tokyo?Before You Go to Tokyo, Learn These Etiquette TipsBut if you stick your chopsticks straight into your rice, you're on your own.Where to Drink, Eat, and (of Course) Sing Your Heart Out in Tokyo Right NowArtisanal sake, all-you-can-drink sushi, and $4 gin-and-tonics in a postwar-inspired jazz bar: this is what you should be drinking in Tokyo right now.Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-13", "author": ["Bon Appetit"]}