{"id": "d8f3c2c246c9dcd476c93566496abfa0", "url": "https://www.bonappetit.com/story/ty-haney", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Ty Haney of Outdoor Voices on the Stress-Busting Rituals That Keep Her on Top | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleOutdoor Voices Founder Ty Haney on the Stress-Busting Rituals That Keep Her on Top\"Totally possible\" is just one of the mantras that's made Haney and her apparel brand so successful.By Ali FrancisApril 19, 2019FacebookTwitterEmailPhoto by Sasha JuliardFacebookTwitterEmailIn Entrepreneurs Run the World, we get advice and insight from game-changing entrepreneurs with big ideas. This week we talked to Ty Haney, founder and CEO of Outdoor Voices.“I’m still attached to this youthful feeling of playing like a kid,” Ty Haney tells me over the phone recently. “Why do we lose that when we get older?” She’s in Austin and I’m in New York, but something in her voice tells me she’s smiling.Haney, the almost 30-year-old founder and CEO of ultra-popular apparel company Outdoor Voices, is recalling her outdoorsy childhood in Boulder, Colorado. When she moved away to study at Parsons School of Design, she found herself wondering, “What’s going to be my motivation to get up every day and move my body?”The idea for Outdoor Voices came to her during a leisurely jog along the West Side Highway. “It was probably after two and a half years of doing literally no exercise,” Haney says. “And in that moment I realized I wanted to build a brand around recreation, and I wanted to get the world moving everyday.”But in lieu of “winning,” or exhorting her customers to perform, Haney believes that Doing Things (the company mantra) should be fun and easy. Getting up and doing anything for 30 minutes every day “is how you build sustainable habits,” she says. Whether Haney’s off riding horses, hiking, or swimming in Austin’s Barton Springs, it’s clear that she’s the company’s best billboard—touting an alternative, far less competitive view of physical activity.Here we chat with Haney about the importance of growing her business organically, the nut milk brand she swears by, and the ritual she performs when she’s feeling stressed.What do you think has been the most challenging part of building Outdoor Voices?I did not study fashion or apparel manufacturing. It’s not rocket science, but at times it felt like it! Creating patterns that are made out of paper then applied to stretchy fabric that goes on a three-dimensional body actually proved to be harder than expected.Did you have any work experience before starting Outdoor Voices that you felt was super helpful?In school I was working at a company called Launch Collective, which was a fashion incubator. They essentially had four functional departments—finance, marketing, e-commerce, and product. And then they would run a bunch of start-up fashion labels through it. So I got to see how they built those brands from scratch.When did you realize Outdoor Voices really had legs? (No pun intended.)I started sending products to friends and family, and the first indication was when they would come back for more. I'd give them the first kit and they’d come back wanting a second or a new color. That's when I realized this was sticking. That's kind of a simple early, early memory. But for any business, the repeat purchase is super, super critical to knowing that you're doing something right.Do you have any advice on how or when to raise money?Ahead of going out and raising money, I think it's important to show proof of concept through traction. We went to a trade show in Vegas really early on. I hate [trade shows], but it actually was really helpful because this store in the UK called The Garbstore spotted us there and became our first wholesale partner. From there, J. Crew discovered us and ordered 11,000 units, which at the time just about put me out of business. But those early contracts where what gave me the confidence to go to investors and be like, \"Hey, we've got something here.\"As a young woman, without any experience doing this, what were those initial meetings like?I think once I fully dedicated myself to building Outdoor Voices, I subconsciously put on this armor. Because I look back and think about how wild it was that I would just march into these conference rooms and not really be all that self-aware. As for my gender, I really leaned into that. My customers have boobs and a butt, and those bounce. And who better to make a product for that than a woman?You seem so genuinely optimistic. Is this learned or trained?Oh, it definitely takes practice and maintenance, like everything. I do have some personal mantras that get me into the right mindset, kind of like small meditations. One we often say in the office is “totally possible.” We always face every problem with a solution-oriented mindset. The other is from Thomas the Tank Engine: \"You can do it, you can do it, you can do it.”When work gets really stressful, do you have any calming habits?I was taught this one recently, and it's pretty simple: When you first wake up you take 30 grateful breaths. You just kind of whisper to yourself and think about 30 things you're grateful for. So it could be that piña colada last night, a really good slice of pizza, or the woman that smiled at me on the trail. I find it really powerful in a not overly cumbersome way.How has your role at Outdoor Voices changed from the first couple of years, to now?Early on, I and all the people we recruited went a mile wide and an inch deep in terms of what they were working on. Now it's kind of the reverse. We're looking for people who really have expertise and depth in a functional area. In some ways, my role is the same too, though. I’m like the culture protector.When and how do you stay active?I jog for three miles, no more. That's my ultimate max. And I'm truly jogging at a recreational pace. But when it's too cold out, I love going to recreational centers. I've just recently started indoor rock climbing. And then with the team here at OV we're always doing different types of activities, from dance to weird aerobics classes.Do you think working out makes you a better leader?For the business, I have to find a way to exercise and get the endorphins going. Because that's what makes me a happy and helpful person.What are some of your favorite snacks right now?There's a local nut milk brand in Austin that my friend stared called Fronks. I think you're only meant to use it as creamer in your coffee, but I drink the whole bottle easy. If I could have one every day, I would. I’ve also become a huge fan of macadamia nuts.Do you have any advice you’ve received lately that’s felt transformational for you?I think I am late to the game, but on his podcast Joe Rogan talks about the importance of REM [Rapid Eye Movement]. Sleep has been so crucial for me. Since listening to that, I've been able to feel okay with going to bed early instead of being busy or going out.Explore Bon AppétitHealthyishEntrepreneurs Run the WorldInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-19", "author": ["Condé Nast", "Ali Francis"]}