{"id": "d8f8f4d1f7509909fa46dc27ffdec63e", "url": "https://www.bonappetit.com/recipe/sticky-pomegranate-and-ginger-chicken", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Sticky Pomegranate & Ginger Chicken Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesSticky Pomegranate & Ginger ChickenFacebookPinterestTwitterEmail4 - 6 servingsActive Time: 30 minTotal Time: 40 minUse extra stock in place of water for the most flavorful rice and grains.PrintIngredients8 bone-in, skin-on chicken thighs (about 3 pounds)Kosher salt and fresh ground pepper4 tablespoons vegetable oil3 large shallots, thinly sliced3 garlic cloves, thinly slicedOne 2-inch piece of ginger, peeled and julienned1/3 cup packed light brown sugar1 cup Swanson Chicken Stock3 tablespoons rice vinegar1 tablespoon fish sauce1 tablespoon pomegranate molasses1 jalapeño, sliced1/2 cup pomegranate arils1/2 cup fresh cilantro leavesRecipe PreparationIn a large high-sided skillet, heat 2 tablespoons of oil over medium-high. Season chicken with salt and pepper. Working in two batches add chicken to skillet. Sear, turning to brown all over, about 2 minutes per side. Remove to a plate. Pour the oil out of the skillet and discard.Return skillet to medium. Add remaining 2 tablespoons oil, shallots, garlic, and ginger; cook, stirring, until softened, about 1 minute.Pour ¼ cup stock in the pan and add brown sugar. Boil, stirring frequently, until deep golden in color, about 5 minutes.Carefully and slowly, pour the remaining ¾ cup of stock into the skillet. Stir in the vinegar, fish sauce, and pomegranate molasses. Bring to a boil, and return chicken to skillet, skin side down. Reduce to a simmer, and cook for 10 minutes. Turn chicken and continue to cook, basting occasionally, until the sauce thickens and the chicken is cooked through, about 10 minutes more.Transfer chicken to a platter, drizzle sauce over, and top with jalapeno, pomegranate arils, and cilantro.Recipe by Campbell'sReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitCampbell'sSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}