{"id": "d90563dc07da22133e60ecd627150625", "url": "https://www.bonappetit.com/story/pandemic-birthday-baking", "year": 2021.0, "month": 2.0, "day": 1.0, "content": "I Can't Have a Birthday Party This Year, but I Can Still Have Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Can’t Have a Birthday Party This Year, but I Can Still Have CakeOr brownies! Or pie! Or both!By Sonia ChopraFebruary 4, 2021FacebookTwitterEmailPHOTO AND FOOD STYLING BY SOHLA EL-WAYLLYFacebookTwitterEmailEvery Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.It’s birthday central in my family—a bunch of us fall in a neat little row—and usually I’d be at home in Atlanta right about now, ordering cookie cakes and petits fours, buying some cheesy balloons, and trying to pick a restaurant for dinner that will please a handful of people with wildly different tastes. I’ve always been very happy to ignore my own birthday in favor of doing something fun for my loved ones, but this year, when I’m the only part of the “birthday train” that isn’t back in Atlanta, I’ve decided to at least think about doing it up big.Want this letter before it hits the website? Sign up for our newsletter!I’m sensing these camo chocolate fudge brownies in my future...\nPhoto by Laura MurrayOr, well, big for a homebody in a two-person household in the aftermath of a blizzard in the middle of a pandemic, which basically means I bought the ingredients to make an elaborate cake (it has saffron meringue!) in a moment of ambition but have since scaled back my plans to make...I don’t know, maybe some pretty brownies? Or a fun pie, or, like, a more low-key meringue situation? Possibly some scones and a nice tart curd? Should I just buy myself some fancy chocolate and call it a day? Sarah Jampel recommended little berry shortcakes if you don’t want too many leftovers, and Emily Schultz suggested BA’s Best Cheesecake if you want dessert for days after the celebration—or, she says, why not bake a batch of cookies and turn them into ice cream sandwiches?I’m feeling a weird amount of pressure to make something, and it’s kind of stressing me out. I can’t promise I won’t just ignore the whole day or maybe opt for a really cool box mix, but I’d love to hear what you would make (especially if the answer involves cream cheese frosting, my favorite) and how you’re celebrating birthdays at home right now. I’m at sonia@bonappetit.com.Explore Bon AppétitLetter From The EditorRead MorerecipesI Bought Too Many Avocados (as Usual)—But They Won’t Go Bad on My WatchGallery6 SlidesBy Sonia ChopraRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-04", "author": ["Condé Nast", "Sonia Chopra"]}