{"id": "d911ad27e862e94d766d0c0960577fb3", "url": "https://www.bonappetit.com/recipe/asian-pear-shiso-salad-with-quinoa", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Asian Pear–Shiso Salad With Quinoa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueAsian Pear–Shiso Salad With QuinoaBy Danielle Bell and Pablo OsorioJanuary 4, 20224.2(7)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThis layered winter salad is a study in delightful textures: Crisp and juicy Asian pear is served over creamy Greek yogurt—enhanced with honey, lime juice, and black sesame paste (or tahini) for nuttiness and complexity—and finished with a shower of quinoa. It’s inspired by the Asian pear–stuffed shiso leaves that are a frequent appetizer at Danielle Bell and Pablo Osorio’s de Porres Dinner Series events and private chef gigs.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronShallow Serving Bowl$26.99 At AmazonCitrus Juicer$7 At AmazonWhisk$10 At AmazonLarge Saucepan$60 At AmazonMesh Sieve$13 At AmazonTongs$13 At AmazonIngredients2 servingsKosher salt⅓cup quinoa1scallion, white and pale green parts finely chopped, dark green parts thinly sliced1small red Thai chile, finely chopped1Tbsp. unseasoned rice vinegar2tsp. fresh lime juice, divided2tsp. honey, divided1medium Asian pear, thinly sliced½medium cucumber, halved lengthwise, sliced ¼\" thick⅓cup plain whole-milk Greek yogurt1tsp. black sesame paste or tahini4shiso leaves or ¼ cup mint leaves, torn into small piecesSesame seeds (for serving)PreparationStep 1Bring a large saucepan of salted water to a boil. Add quinoa, return to a boil, and cook, stirring occasionally, until tender, 12–15 minutes. Drain; set aside.Step 2Whisk together white and pale green scallion parts, chile, vinegar, 1 tsp. lime juice, and 1 tsp. honey in a large bowl. Add pear and cucumber; toss to coat. Season with salt; let salad sit 15 minutes.Step 3Meanwhile, whisk yogurt, sesame paste, a pinch of salt, remaining 1 tsp. lime juice, and remaining 1 tsp. honey in a small bowl until smooth.Step 4Just before serving, toss salad with dark green scallion parts and shiso. Spread yogurt mixture over a shallow bowl. Using tongs, mound salad on top, leaving behind any liquid in bowl. Scatter sesame seeds and reserved quinoa over.How would you rate Asian Pear–Shiso Salad With Quinoa?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleTextures were interesting, the combination of thai chilis and pear was great, but the amount of honey made the dish take overly sweet (and the yogurt-tahini combination resembled some kind of mayonnaise). In the future, I'd lean more towards a vinegar dressing for the salad, with a tahini base [without yogurt]. but some great components!Anonymous1/31/2022Explore Bon AppétitDinnerLunchEasySaladVegetarianNut-FreeGluten-FreeHealthyishAsian PearFruitQuinoaRice & GrainsYogurtOther IngredientsSideWinterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Danielle Bell", "Pablo Osorio"]}