{"id": "d9124fae3f6eceac87a567f7465bdad4", "url": "https://www.bonappetit.com/story/grilling-headlamp", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "I Won’t Grill Without My Trusty Black Diamond Headlamp | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Won’t Grill Without My Trusty Headlamp’Cause it’s actually way dorkier to look ill prepared.By Carla Lalli MusicMay 6, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.In this world, lots of people are going to tell you all kinds of hyped-up things about all the grilling equipment you’re supposed to have and need to buy. I’m here to tell you that most of it is untrue and extraneous—especially a hand-forged, monogrammed, iron steak brander.If you want to grill, you need three things: 1) a grill, 2) a pair of 18” tongs, 3) and a headlamp. The grill is self-explanatory. The tongs are essential for keeping your hands at a comfortable distance while you move things around on the grates. The headlamp, though, is the single most important tool because eventually, no matter how well you think you’ve planned it, the sun will set on you. And when it does, you will be that person in the dark trying to tell if your steak is sufficiently charred or if your chicken is cooked through, and no, dragging the floor lamp from your living room out onto the deck is not a solution. Switching on your phone’s flashlight and holding it in the air with one hand while you try to grill with the other also doesn’t work. Asking a friend hold a flashlight for you makes you dependent on others. It also makes you look unprepared.The only thing that will save you when the sun sets is a headlamp. Like a spelunker, like a survivalist, like a neurosurgeon, your nighttime grilling necessitates hands-free seeing. I started rocking this classic, battery-powered model from Black Diamond many grill-seasons ago, and my only regret was that it took me that long to see the light (sorry). Sure, some people say I look dorky, but those people don’t know anything about grilling, so who cares what they think.I think it’s cool to be prepared. I think it’s cool to be able to see in the dark. I think it’s cool to have proper equipment. And I think it’s cool to continue to feed your friends even after the sun goes down. It’s headlamp season—and I’m ready.Photo by Chelsie CraigBlack Diamond Cosmo Headlamp$30 at AmazonExplore Bon AppétitHighly RecommendToolsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-06", "author": ["Condé Nast", "Carla Lalli Music"]}