{"id": "d9380e14412962552811362daff127dd", "url": "https://www.bonappetit.com/story/zojirushi-rice-cooker", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "The Best Rice Cooker, According to Bon Appétit Editors | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingIf You’re Serious About Rice, You Need This Rice CookerIt’s the unofficial appliance of the BA test kitchen.By Chris Morocco, Christina Chaey, and Ali FrancisNovember 8, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The best rice cooker is the one that makes the whole process so easy that there’s no daylight between your craving a bowl of plump, fragrant grains and lunch. Whenever the mood strikes, you’re halfway to garlicky fried rice, crispy pilaf, or sushi casserole. And while you definitely can make great rice without a rice cooker—in the oven or on the stove, salted with your own tears—do you want to? For the perfect rice, you need a rice cooker. And the best rice cooker, the one our food editors use daily at Bon Appètit, is the Zojirushi Micom Rice Cooker and Warmer.Photo by Alex LauZojirushi NS-TSC10 Micom Rice Cooker$192 $165 at AmazonThis sleek gadget has taken up permanent residence in the Test Kitchen, a gently whirring constant at the center of a roomful of cooks in motion. When everyone inevitably gets hangry by midday, all we have to do is quickly reheat a leftover protein, scramble a couple of eggs, or slice some avocado and break out the chile crisp to turn those still-warm, fluffy, and tender grains into a meal. Of all the kitchen appliances out there, you’re going to want to make room on the countertop for this one.How does a rice cooker work, and what can it do that a pot on the stovetop can’t?The greatest advantage of making rice in an electric rice cooker versus the stovetop is that you can press a button and walk away, unlike a needy pot that you have to babysit from start to finish. Ever forgotten to take a pot of rice off the flame? Yeah, us too. Rice cookers can detect when the water in the pot has been absorbed or converted to steam, at which point they either automatically shut off or keep the rice warm for a while.Why are Zojirushi rice cookers so good?It’s not the cheapest model on the market, but the 5.5 cup (cups of uncooked rice, that is) capacity Zojirushi Micom Rice Cooker and Warmer is one of our top picks for a reason. Not only does this Japanese-designed model cook flawless, super fluffy rice consistently, but the price tag is a bit more budget-friendly compared to the brand’s higher end induction model, which is beloved by rice obsessives everywhere.So why do some cookers cost $40 while others run upward of $400? The short answer is that less expensive models can generally only tell you when there is no more water in the cooking pot, whereas higher-end “smart” cookers, like this one, are equipped with a micro computer that uses something called “fuzzy logic” to compensate for human error (say, if you accidentally added too much liquid to the pot, it’s able to sense that and adjust so your grains don’t end up mushy).The easy-to-read LCD control panel features a clock and programmable cook settings for each type of rice—like white or long grain, brown, porridge, and mixed grains—that take all the guesswork out. The thick inner pot conducts heat evenly, ensuring each batch of rice is uniformly tender. A countdown timer lets you know exactly when your rice will be done, the delay timer looks out for future-you, and an automatic “keep warm” function holds your grains at temp until you're ready.What really stands out to us about this rice cooker, though, is just how versatile it is. This is no single-use appliance: Steam your veggies in bulk. Pour cake batter right into the greased inner pot and watch it rise to perfection using the cake menu setting. And then bask in how easy your rice cooker is to clean; wipe down the stainless steel exterior, remove and hand wash the inner lid, and chuck the dishwasher safe inner pot into your machine.Lunch is served.\nPhoto by Alex LauDoes it come with any accessories?The Zojirushi Micom Rice Cooker and Warmer comes with a suite of products to ensure you’ve got everything you need to get cooking right away: a steamer basket for veggies, nonstick rice spatula for scooping sticky rice, and a plastic measuring cup that’s slightly smaller than a standard U.S. cup (it’s based on the size of the sake cups used to measure rice in feudal Japan) that corresponds to the water calibration lines you’ll find on the inside of your cooking pot. If you lose your cup, don’t worry—as long as you use a consistent ratio of grains to water, you’ll be fine.How do I know which rice cooker is best for me?If all you need is a simple pot of white rice, an inexpensive model will do the job. But if you want to cook mixed grains, bake moist cakes, and steam veggies, go for a pricier model that has the inbuilt tech to handle more variation. Here are a few more of our top picks:For a low-fi, stovetop option that still follows the principles of a digital rice cooker, try this gorgeous ceramic number with a glass lid made by the Japanese brand, Hario. Simply simmer your rice until the cooker whistles (adorable), and then let it steam for 15 minutes.Photo by Isa Zapata, food styling by Micah MortonLarge Hario Rice Cooker$95 at Food52If you only have a couple of people to feed, a mini rice cooker, like this one from Dash, will serve you well. It only has a two cup capacity, but it makes great rice and also takes up way less counter space in your kitchen (or dorm room).Dash Mini Rice Cooker$25 at AmazonBefore everyone had an Instant Pot or pressure cooker, there was this Tatung steamer—a slow cooker, steamer, popcorn machine, and rice cooker all in one. This machine may not have any of the fancy bells and whistles that the more modern multi-cookers do, but that’s exactly the point. The simple on-off switch will take home cooks from from fluffy rice to stews without any fancy cooking settings.Tatung Electric Steamer$143 $120 at Amazon$140 $98 at Wayfair$137 at TS EmporiumThe aforementioned Zojirushi Induction Heating Pressure Cooker and Warmer is for the rice and grain connoisseurs. It does everything our fave does—and more. The main difference is that this rice cooker uses induction, which heats the whole pot (rather than just the bottom) and makes for a super precise cooking process. But it will set you back a few hundred dollars.Zojirushi NP-HCC10XH Induction Rice Cooker$420 $330 at AmazonDo you have a favorite brand of rice?Lundberg Family Farms Organic California Sushi Rice is our pick for an everyday white rice. It’s perfectly sticky but versatile enough for rice salads, desserts, and wayyyy more.What do I do with all this rice?Kale fried rice: Cook rice, undisturbed, in an oiled nonstick skillet until it starts to crisp. Add torn kale by the handful, letting it wilt between additions and tossing as you go. Clear space for some garlic and scallions, add an egg, give it a quick scramble, then toss it all together.Fried rice is pretty much the best way to reinvent leftovers.\nPhoto by Alex LauSavory porridge: Simmer equal amounts of white rice and stock or water in a small saucepan, stirring occasionally and adding more liquid as needed, until the rice is thick and creamy. Treat it as a blank canvas for a soft-boiled egg, shredded chicken, or some sautéed mushrooms. Or, make this pork and shiitake mushroom congee, a quintessential Chinese comfort food.Kimchi stir-fry: Grab a jar of kimchi and chop into chunky pieces. Cook sliced scallion whites and kimchi in a skillet until slightly softened, then add leftover whole grains and season with soy sauce and toasted sesame oil. Top with a fried egg and you’ve got dinner.Or, just go with the grain:1 / 71ChevronChevronCrispy Green Rice PilafView RecipeExplore Bon AppétitShoppingproductStaff PicksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-18", "author": ["Condé Nast", "Chris Morocco", "Christina Chaey", "Ali Francis"]}