{"id": "d93bf920b6509723240107b341495147", "url": "https://www.bonappetit.com/story/yasmin-khan", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "Yasmin Khan, Author of the New Cookbook Zaitoun, on What the Importance of Writing a Palestinian Cookbook in 2019 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIn 'Zaitoun,' Yasmin Khan Looks at Palestinian Food With an Activist's EyeThe cookbook author on what you should take away from her latest exploration of the Palestinian kitchen.By Cassandra Landry March 27, 2019FacebookTwitterEmailPhoto by Matt RussellFacebookTwitterEmailOn a cool autumn night in Ramallah, a full moon hung in the sky, chickens strutted around the yard, and Yasmin Khan huddled under a blanket. She watched as a colorful array of simple mezze, prepared by women from a community group that seeks to heal trauma with yoga, hit the table: arugula and radicchio salad studded with citrus, lamb meatballs on slices of potato smothered in tahini, and moussaka—velvety eggplant, chickpeas, and tomatoes spiced with a delicate veil of cumin. Over the next two years that recipe, along with many others, would make its way into Khan’s new cookbook-travelogue hybrid, Zaitoun: Recipes from the Palestinian Kitchen, released last month in the U.S.Fast-forward to 2019, another cool night under another waxing moon: Khan, a former grassroots organizer and human rights activist with British anti-poverty charity War on Want, stood beside Palestinian chef Reem Assil in the dining room of Reem’s California in Oakland. The two were hosting a dinner inspired by recipes from the book. Palm-sized globes of dukkah-encrusted labneh and tin wa zeitoun, a fig, olive, and honey tapenade, traded hands between strangers. Warm pillows of soft khobz bread (a specialty of Assil’s) disappeared along with platters of djaj mahshi, stuffed roasted chicken stained violet with sumac.Khan and Assil first met while sharing the stage, along with chefs Tanya Holland, Preeti Mistry, and Dominica Rice, during a Cherry Bombe panel on cultural appropriation in the fall of 2017. “I didn’t know anything about her until we met in the green room, but we immediately connected,” says Assil, who describes Khan like a sister. “She’s rooted in that same activist experience and understands the burnout from non-profits, the constant fight to turn out people to action, how to navigate the world of policy development.”In the food world, a background in activism is powerful, Assil explains, because it provides an awareness of the power dynamic involved in entering a new community and an ability to find the right audience for your message. “Yasmin didn’t write this book to make herself feel good,” she says. “She knew there was an audience that needed to hear these stories. She’s leading from behind, allowing an avenue for other voices.”In that regard, Zaitoun is a natural continuation of the mission Khan first laid out in her 2016 book The Saffron Tales: Recipes from the Persian Kitchen: to create books that go beyond sharing recipes in order to offer insight into the everyday lives of people in a given place. Food is a compassionate way to start the difficult conversations that Khan isn’t afraid to have. But while Saffron Tales was informed by her own identity as the daughter of an Iranian mother and a Pakistani father, Zaitoun takes a more anthropological approach.From the start, Khan was incredibly sensitive about being an outsider writing about Palestine. “A lot of my internal struggles with this book were very much about accurately portraying what I saw while also creating a joyous book that people would want to cook from,” she says. As a result, she wrote for a very specific reader: not only a Palestinian, not only an Israeli, but someone who “in the simplest and most human of terms” wants to understand—and to cook incredibly delicious food. She checked every sentence against that lens.To Assil, it’s actually Khan’s perspective as an informed outsider that allowed her to capture nuance and present a clear chorus of voices. “Obviously, the Palestinian community is one of many that has experienced war and genocide and imperialism. Khan is in a unique position to understand how all those struggles are connected,” she says. “It’s important to evaluate those intersections and see that it’s not just one microcosm or one group of people. She comes from that history. She understands the root causes.”Khan also knows, as she puts it, that “the very act of documenting Palestinian culture, of celebrating it and honoring it and saying that it even exists, is a political act at the moment. That's the crazy situation that we've found ourselves in. As a Brit traveling through the U.S. talking about Palestine, I am dumbfounded at the debate and the hostility.”“People in the Middle East are only seen through the prism of terrorists or victims. But why does Muhammad always have to be one of those two things? Why can't he just be, like, on his sofa watching Netflix, eating a cookie? That’s how many people live! The more that can be done to humanize people from these communities, the better. I think this is the kind of conversation that people in the US want to have. It just seems to be that there hasn't been a space to do that.”She hopes Zaitoun—the Arabic word for olive, notable as both a cornerstone ingredient and a symbol of peace—can be one such space. In many ways, the timing feels right: Most of us want to widen our lens. Our favorite books and shows—whether it’s Samin Nosrat’s deep-dive travels in Salt, Fat, Acid, Heat or the renewed emphasis on global narratives on shows like Chef’s Table—grapple with issues of representation and identity. Yotam Ottolenghi and Sami Tamimi’s runaway hit Jerusalem now shares a shelf with Reem Kassis’s The Palestinian Table, and, of course, Zaitoun.“I wanted it to feel hopeful,” she says. “We live in a polarized and divisive time when people's communication—online, offline, in the political realm, in any realm—is hostile. I understand that. There's a lot of toxicity, but I wanted to create a book that would make people feel optimistic and connected, because I really believe that they're the feelings we need to foster if we want to progress forward.”She mentions a farmer she met during one trip who continues to harvest his olives despite the risk of being shot at for doing so. “Resilience is an incredibly optimistic thing,” she says. “Cooking is a place where [people in the Palestinian community] still find a lot of joy. When you travel around the world cooking in people's kitchens, breaking bread with people in their favorite restaurants, you end up sharing so many joyous experiences even in the hardest of places. You can always find a thread of commonality. I think that becomes very empowering.”Explore Bon AppétitHealthyishCookbooksMiddle EasternprofileRead MoreLifestyle13 Healthy Cookbooks That Changed the Way We EatGallery13 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-27", "author": ["Condé Nast", "Cassandra Landry"]}