{"id": "d94411f85bb821e2ccfd738538532470", "url": "https://www.bonappetit.com/story/february-doughnut-horoscopes", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "Read Your February Horoscope—Paired with a Doughnut for Every Sign | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureRead Your February Doughnut Horoscopes and Then Make Them Come TrueTake this astrology thing into your own powdered-sugar-covered hands.By Catherine UrbanFebruary 1, 2018FacebookTwitterEmailIllustration by Taro UryuFacebookTwitterEmailThere’s nothing like a month filled with Valentine’s Day commercials for chain jewelry stores to make a person want to close the blinds and have some ”alone time” with a box of a dozen doughnuts. No matter what your astrological sign is, you agree with this. We can feel it. Which is why your February horoscopes come with a doughnut prediction, and the best way to achieve your destiny is to get in a car and set your heart/GPS for the nearest bakery. Below, read what the stars have in store for you this month.Illustration by Taro UryuAriesYou’ve recently taken on some extra responsibility, which you normally hate, but after multiple pep-talks with yourself in the bathroom mirror, you’ll be extra confident in your ability to win at life this month. Say “yes!” to all the work luncheons and opportunities to network. You out of anyone know how to break the ice and make a lasting impression. Maybe it’s your way with words (zero filter) that makes you so lovable. Maybe it’s because you brought a box of chocolate frosted doughnuts to that meeting. Just like you, they’re no BS: straight-up chocolate on freshly fried dough. There’s no unexpected filling hiding inside—what you see is what you get.Illustration by Taro UryuTaurusBig changes are underway in your career this month, and while this can make you feel uneasy, rest assured that your loyalty and hard work do not go unnoticed, and this will help you in the long run. You’ll feel a big boost of optimism, which will help you get (weirdly) excited about change. Abundance comes in the form of friendship this month, so plan accordingly with the squad—that’s who will support you as you move out your comfort zone. That is, move out of your glazed doughnut comfort zone, and pair your coffee with a Boston kreme doughnut—irresistibly sweet custard with a touch of chocolate frosting in every bite, sure to meet your high standards of decadence.Illustration by Taro UryuGeminiThings have gotten waaay too serious for you, and you find yourself cracking random jokes when the convo gets too dry. You need to detach from drama and free up those extra brain cells for creativity and adventure this month. Doing so will naturally brighten up all areas of your life, particularly your relationships and your general outlook. And you know what else will brighten up your life? A jelly doughnut. You don’t care how messy it gets, because finger-foods are fun and no one is going to take that from you. Besides, a little powdered sugar on the tip of the nose never hurt anyone.Illustration by Taro UryuCancerYour patience is being tested and you find that you are quicker to boil this month (dare we say crabby??). This is good, Cancer, because you are often more tolerant than you need to be. You’ve recently shifted your focus to the long-term and you’re done wasting energy on things with zero yield. Ask yourself, “will it matter in three years?” Similarly, you’re being more cautious with saving your money for real-deal investments. Trends come and go but lucky for you, glazed doughnuts are here to stay. Not overly sweet, exquisitely modest, and above all: consistent. Just what you need to stay focused on what matters most.Illustration by Taro UryuLeoYour focus this month is on relationships—romantic and platonic both. No one is doubting your warmth and generosity, but it’s (maybe) time to show it a bit more. All of this extra effort to meet people halfway (let’s be real, you prefer to lead) is making you hungry, so reach for a cruller—twisty, crispy on the outside sweetness with a baroque shape that stands out against the rest, perfect for someone who is fearlessly unique. We know we can’t put you in a box, but we’ll take a dozen of these to go.Illustration by Taro UryuVirgoThis month, you’ll be paying more attention to your health and how you ration your time. You might decide you’re spending too many hours on social media, when you could be talking to people IRL instead. You’re a perfectionist: you set your expectations too high, put too much on your plate, and then throw it all out when you get overwhelmed. Look at your calendar and be real with yourself. What’s realistically doable in a day? One thing you can squeeze in before the commute to work? Matcha doughnuts—vivid, eye catching green pastries that trick everyone into thinking they are eating something healthy, with an extra caffeine buzz to energize you through that to-do list.Illustration by Taro UryuLibraWhile you are normally really good at maintaining a steady juggle in your balanced life, this month you’ve got permission to let loose! You’ve earned the right to have “too much of a good thing”, which you can interpret as you wish: a Tuesday night steak dinner, that pedicure with the little fish, a new pair of socks, whatever feels indulgent. You often overthink your decisions, but this time let your heart lead you. Also let your heart lead you to the nearest, pinkest strawberry sprinkle doughnut—most sought after by Homer Simpson and Libras alike—you can’t help yourself when it comes to a dessert that’s as sweet on the eyes as it is on the palate. And not to worry, no one’s expecting you to share this time.Illustration by Taro UryuScorpioGiving yourself time to recharge is vital to your being, so this month you’ll want to spend more time at home. Admittedly, you’ve been neglecting your living space, which is why this month is optimal for playing catch up on some of those projects (okay, your Netflix queue too). Your friends are used to getting cryptic texts from you; let them wonder what “busy” actually means. For lazy Sundays on the couch, go for the mighty bear claw. It’s complex (like you), sounds tougher than it is (also like you), and is big enough to be considered a hobby. Hey, we don’t make the rules.Illustration by Taro UryuSagittariusYour mind is craving fresh material this month and Instagram’s discover page isn’t cutting it this time. You’re seeking a juicy mystery novel, or maybe that big book on quantum mechanics—something you can get lost in. You’ve got a nice boost of can-do enthusiasm that will last for a couple months; ride this wave while you can. It’s rare for you to be this focused, Sag, but now is excellent time for research and absorbing new material. You’ll also need to absorb some calories (for thinking fuel!) in the form of a coconut doughnut, a melt-in-your-mouth miracle that is so out of this world that you forget which planet you are on. And as you know, you can never pass up a sweet, sweet distraction.Illustration by Taro UryuCapricornIt’s no secret that you have finer tastes, but you are no spendthrift either. You’ll be dropping some cash this month; you might replace your worn-down phone case and get those boots that have been in your shopping cart for ages. You know it’s worth investing in yourself, but sometimes you need a reminder. This year marks a major turning point in your life, so we want you to fully commit right now. Show up, do what’s necessary, and speak your truth—and for those moments when you shouldn’t say anything at all, pop a powdered sugar doughnut in your mouth! As you know well, it’s bitter black coffee’s one true pairing. If you’ve got powdered sugar all over your face, you know you’re doing it right.Illustration by Taro UryuAquariusHappy birthday, Aquarius! You’re calling the shots and we’re doing our best to keep up with you. If you take anything seriously this month, let that be your career. Your skills could catch your boss’s eye this month, so put yourself out there and get ready for more opportunities coming your way. If there are any habits you’ve been trying to kick (other than doughnut habits), here’s a window of opportunity for you to do so. You always keep things interesting and your ideas are constantly ahead of the curve, which is why you need a Bavarian doughnut—a treat as ingenious as you are. Whoever thought pairing pudding and pastry was a good idea (prob an Aquarius) definitely wasn’t wrong.Illustration by Taro UryuPiscesWhen it comes to your career, you are a powerhouse right now. You are bringing an edgy creative spirit to your ongoing projects, which inspires you to take those big ideas to the next level. While this is a great month for you to take those risks, be mindful that you don’t take on more than you can handle or else you’ll feel all over the place. Concentrate your aim by reserving plenty of downtime for yourself. We recommend yoga, bubble baths, and a giant apple fritter—deep fried delicious grooves of apple cinnamon as multifaceted and dreamy as you are—and if you can combine all of those activities, even better.Catherine O’Neill is an astrologer and writer now coping with a bit of a doughnut craving. Maple pecan or strawberry frosting, please! You can check out more of Catherine’s work here.Have you ever made apple cider doughnuts at home?Explore Bon AppétitFood HoroscopesDoughnutRead MorecultureYour January Horoscope: Dumplings and PredictionsBy Catherine UrbancultureYour December Horoscope: Holiday Cookie EditionGallery12 SlidesBy Catherine UrbancultureNovember Horoscopes Are Here: Which Thanksgiving Side Are You?By Catherine UrbancultureOctober Horoscopes Are Here—Which Halloween Candy Are You?By Catherine UrbanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-01", "author": ["Condé Nast", "Catherine Urban"]}