{"id": "d9453a8c6e51e356af859f7bd80eb953", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/duck-and-cover", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Duck and Cover Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenDuck and CoverA Mad Men-esque temple to mixology in Vesterbro.FacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: for the city’s best cocktails, served in a basement room that feels like a Danish Don Draper’s den. (Even the bar is teak.)ORDER: any of the seasonal cocktails. Here the bartenders push the boundaries of creativity, but remember where you are and try something made with aquavit, schnapps, or any spirits made by local star Empirical Spirits. In spring we love a chamomile fizz, made with gentian and gin.THE VIBE IS: snug, sexy, and serious about mixology.PRACTICAL STUFF: Open Tuesday and Wednesday from 4 p.m. to 1 a.m.; Thursday to Saturday from 4 p.m. to 2 a.m.; and Sunday from 6 p.m. to midnight. Closed Monday.—Christine MuhlkePhoto by Ditte IsagerWE ALSO LOVEHimmeriget10 beer taps, lots of Fernet, and cocktails that’ll make everyone happy at this Frederiksberg barBRUSHydrate, sort of, with 33 constantly changing taps from this Nørrebro suds stopVed Stranden 10Get lost in natural wines at this living room-esque Indre By barExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}