{"id": "d946f3c844ae2b2fbd1c4b3f11c63838", "url": "https://www.bonappetit.com/recipe/tadka-pasta", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Tadka Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTadka PastaBy Sonia ChopraMay 24, 20214.8(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, food styling by Micah Morton, prop styling by Nicole LouieEmailPinterestPrintEmailPinterestPrintWhen my mother came home from school as a kid in Bombay, her mother used to make her a super-quick pasta of noodles tossed in a fragrant tadka for flavor. A few decades later in Atlanta, my grandmother made a version of it as an after-school snack for me, too, but here, she sometimes used instant noodles and I sometimes added a few healthy shakes of Parmesan. Now, a couple decades after that, I’ve added some vegetables—and rarely skip the parm—for a dish that comes together so fast that I can make it and eat it in a 30-minute break between meetings. —Sonia ChopraAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonSlotted Spoon$13 $10 At AmazonLarge Skillet$84 At AmazonIngredients4 servings 2cups fresh or frozen, thawed corn kernels, peas, and/or chopped green beansKosher salt1lb. spaghetti2Tbsp. plus 1½ tsp. peanut oil or ghee2tsp. black mustard seeds30curry leaves (3–4 sprigs)2tsp. urad dal½tsp. asafetida4Tbsp. chilled unsalted butter, cut into pieces2oz. Parmesan, finely grated (about 1 cup); plus more for serving (optional)2Tbsp. chana dal, soaked 15 minutes, drained, or chopped unsalted dry-roasted peanutsPreparationStep 1If using fresh peas and/or green beans, cook in a large pot of boiling salted water just until bright green, about 1 minute. Using a slotted spoon, transfer to a small bowl.Step 2Add pasta to same pot of boiling water and cook, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid.Step 3Heat oil in a wok or large skillet over medium. Cook mustard seeds until oil around seeds is sputtering (cover skillet if you are getting splattered), about 10 seconds. Add curry leaves, urad dal, and asafetida and stir to combine. Cook until fragrant and urad dal is golden, about 1 minute.Step 4Add corn (or fresh or frozen peas and green beans) to wok and cook, stirring occasionally, until tender, about 2 minutes. Add pasta and toss to combine, then add butter, 2 oz. Parmesan, and reserved pasta cooking liquid and toss until butter and cheese are melted and coat pasta. Toss in chana dal.Step 5Divide pasta among bowls and top with more Parmesan if desired.How would you rate Tadka Pasta?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis recipe looks delicious but I'm so confused about the dal.  You soak the chana dal and then eat it without cooking it?  I always thought dal had to be cooked for much longer or in a pressure cooker? Anonymous2/23/2022I made tadka orzo - tadka was cumin seeds. Vegetables were peas carrots and beans.  My own recipe.RevaNew Bern, NC6/16/2021I’d like to make this next week, but I don’t see the curry leaves in the final dish, if there’s 30 of them you think you would, do they need to be on stalks?Kara North Carolina 6/4/2021Actually, genuinely, INSANELY good. Reminds me of sevai upkari (made with vermicelli and similar spices). The butter is a decadent addition and it literally took 8 minutes end to end because I had some cooked pasta in the fridge. Kudos!! Anonymous5/31/2021Explore Bon AppétitPastaIndianSouth AsianAsianSpaghettiPasta & NoodlesCurry LeafHerbs & SpicesCornVegetablePeaGreen BeanQuickEasyWeeknight MealsMainVegetarianSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-24", "author": ["Condé Nast", "Sonia Chopra"]}