{"id": "d947204839211d1e62afcf2858f08e4d", "url": "https://www.bonappetit.com/story/anywhere-anytime-broccoli-bolognese", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Broccoli Bolognese Is an Anywhere, Anytime Pasta | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBroccoli Bolognese Is an Anywhere, Anytime PastaKinda ugly, but extremely quick, easy, and delicious.By Adam RapoportSeptember 17, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.As much as we all talk about cooking with seasonal ingredients, sometimes you just want a recipe you can make whenever, wherever. Sometimes you just want broccoli bolognese.Kinda ugly but extremely delicious, it’s a dish that requires little more than a head of grocery-store broccoli, a couple of sweet Italian sausages, and a box of pasta.The magic lies in how it all comes together. You blanch then chop the broccoli, essentially getting the bits the same size as the crumbled sausage you’ve got browning in a large sauté pan.Want this letter before it hits the website? Sign up for our newsletter!When you combine the two, you add a cup of salty, starchy pasta water to form the base of your sauce. But how do you get it to be all... bolognese-ish?A potato masher.That’s probably the one definitive takeaway you can glean from Molly Baz and me in the recipe’s video. As the broccoli and sausage simmer in the bubbling water, a masher incorporates the two ingredients, kind of making them one, a process that reaches its fruition with the addition of butter and a shower of finely grated parm.As Molly skeptically points out in our video, it’s not really a bolognese in the traditional sense.But I like to think that broccoli bolognese—or “broc bolo” in Molly speak—just sounds good. Almost as good as it tastes.Get the recipe:Broccoli Bolognese with OrecchietteBroccoli and sausage pair up for an indulgent veg-heavy pasta dinner.View RecipeExplore Bon AppétitAdam NewsletterRead MorecookingWho Needs Fancy Pasta When You Have D.I.Y. Hamburger Helper?By Amiel StanekcookingTwo Pastas Are Better Than OneBy Adam RapoportcookingRed Pesto Pasta Is Here, and It’s Full of Bright, Spicy, Umami FlavorBy Emma WartzmancookingFor a Kid-Friendly Cacio e Pepe, Just Add CornBy Deb PerelmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Adam Rapoport"]}