{"id": "d959d20696dd0f5e464997173f254d62", "url": "https://www.bonappetit.com/recipe/chai-spiced-granola", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Chai-Spiced Granola Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueChai-Spiced GranolaBy Christina ChaeyJanuary 4, 20224.9(17)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis granola, inspired by masala chai, doesn’t get its fragrance from warm spices like cinnamon and ginger alone—there’s also ground black tea in the mix, which adds a pleasant astringency. Buckwheat groats are incomparably nutty and crunchy—but if you can’t find them, simply sub in more old-fashioned oats.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSpice Grinder$45 At Kitchen AidRimmed Baking Sheet$20 At Bon Appétit MarketSilicone Spatula$13 At BA MarketSmall Saucepan$155 At AmazonWhisk$10 At AmazonIngredientsMakes about 6 cups1bag black tea2cups old-fashioned oats1cup buckwheat groats1cup unsweetened coconut flakes½cup raw pumpkin seeds½cup raw sunflower seeds½cup coarsely chopped walnuts1tsp. ground ginger½tsp. ground cardamom½tsp. ground clovesFreshly ground black pepper2tsp. ground cinnamon; plus more for serving (optional)¼cup unsweetened applesauce¼cup virgin coconut oil or vegetable oil1tsp. Diamond Crystal or ½ tsp. Morton kosher salt6Tbsp. honey; plus more for serving (optional)Coconut or whole-milk yogurt and pear or apple slices (for serving)Special equipmentA spice millPreparationStep 1Preheat oven to 300°. Remove tea leaves from bag and finely grind in a spice mill (you should have about 1 tsp.).Step 2Whisk ground tea, oats, buckwheat groats, coconut flakes, pumpkin seeds, sunflower seeds, walnuts, ginger, cardamom, cloves, a few grinds of pepper, and 2 tsp. cinnamon in a large bowl to combine.Step 3Cook applesauce, oil, salt, and 6 Tbsp. honey in a small saucepan, whisking to combine, over medium heat until lukewarm, about 1 minute.Step 4Pour applesauce mixture over oat mixture and stir with a flexible rubber spatula until oat mixture is thoroughly coated. Spread granola out on a parchment-lined rimmed baking sheet and bake, stirring every 15 minutes, until deep golden brown and dry to the touch, 40–45 minutes. Let cool.Step 5Serve granola in bowls with yogurt, pear, and more honey and cinnamon (if desired).Do ahead: Granola can be made 2 weeks ahead. Store airtight at room temperature.How would you rate Chai-Spiced Granola?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis is a delicious and slightly unusual granola due to the buckwheat and black tea leaves. I love how mildly sweet it is. As with most homemade granolas that don't have a high proportion of sugar and oil, this is crumbly stuff. Not forming large clumps. Which is fine by me because it is great in yogurt. I'll be making this again and again. AnonymousOmaha, Ne3/25/2022I've made this granola twice and it's DELICIOUS. Probably my new favorite go-to granola. But I do have to mention one important detail for those trying the recipe for the first time. Make sure you purchase regular, UNTOASTED, raw buckwheat groats. My local health food store had both in the bulk section the first time I was purchasing ingredients and I was a little unsure which to choose, so I went with the lighter, blond colored raw groats. They were great and provided a pleasant crunch. In fact, I feel like that's the ingredient that actually gives this granola some real interest compared to other spiced granola recipes. The second time I went to purchase ingredients, they were out of the raw groats and only had dark colored toasted groats (also called kasha) so I used those thinking that they would taste a little different being roasted, but that that toasty-ness would still play well with the other flavors. They actually have a vastly different texture! They are very firm and I'm a little worried that I might crack a tooth chewing on them. I'll still eat this batch I made with the toasted groats, but I'll likely need to let it sit in milk or yogurt to soften a little first. No big deal, but LESSON LEARNED. FYI, I discovered that Bob's Red Mill packages raw buckwheat groats and I'll look for those next time the bulk section is out. CaleAustin, TX2/27/2022Super good! I loved the way my house smelled with all the spices! I did realize I made a mistake after looking at the picture again. I used regular pumpkin seeds instead of pepitas. Will definitely make again 😊JulesNewport Beach CA1/30/2022This was delicious and super easy to make. I served mine with vanilla yogurt and banana. Highly recommend! Ashley K. Houston, TX1/17/2022So delicious and crispy. Love the applesauce idea to bind and sweeten. Will definitely make this all the time. AnonymousLos Angeles 1/8/2022Explore Bon AppétitBreakfastSnackGranolaEasyVegetarianVeganHealthyishDairy-FreeGluten-FreeCoconutFruitOatRice & GrainsWalnutNutRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Christina Chaey"]}