{"id": "d9595baa0645387298d9a6336b864c9c", "url": "https://www.bonappetit.com/story/gjusta-quintessential-los-angeles", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Gjusta Is My Never-Miss Los Angeles Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsGjusta Is My Quintessential, Never-Miss L.A. SpotIt’s a California food wonderland.By Adam RapoportMarch 5, 2019FacebookTwitterEmailPhoto by Adam RapoportFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I was half way to LAX Friday morning when I glanced at my Delta app and noticed that my 9:30 a.m. flight to JFK would be departing at 3:40 p.m.Hmm...Two thoughts immediately popped in my head.One, I’m heading back to the hotel for a couple more hours of sleep.Two, then I’m going to Gjusta.If you love food—and, certainly, if you work at Bon Appétit—a trip to L.A. almost always means a trip to Travis Lett’s bustling deli/coffee shop/sandwich joint/bakery/all-around food wonderland.Want this letter before it hits the website? Sign up for our newsletter!Peden + MunkIt’s the kind of place where everything looks good, and you need to seriously strategize before ordering.I arrived in Venice Beach around 12:30 p.m., and I immediately channeled my inner Alex Delany, ordering a cortado and grabbing a stool at the worn-down marble counter to study the menu. The woman next to me was dividing her bites between one of Gjusta’s what’s-good-at-the-market-that-day grain salads and a particularly California-looking bagel of her own devising—hummus, quick-pickled onions, cucumbers and, of course, avocado.I was feeling more lunchy than breakfast, so I turned my attention to the sandwich portion of the menu. The guy to my right, on the same frequency, opted for the justifiably praised smoked brisket baguette with a side of jus. Tempting, but having gone out the night prior to Park’s for Korean BBQ with BA’s wine editor Marissa Ross—who rolled up with three BYO bottles of natural wine—I was thinking something a smidge less meaty.So I settled on the chicken banh mi and a bag of freshly made potato chips, which you’ll find sitting next to the register, daring you not to order them.If you live in, or spend much time in L.A., Gjusta is the kind of place where you always run into someone because everyone seems to end up there.Just as I was ordering, I bumped into Jay and Alison Carroll, hoteliers, branding savants, and friends of BA. They too were on their way to LAX, a quick 20 minute ride away. (If you haven’t gotten the memo by now: Stop at Gjusta on your way to the airport—to eat in or to grab any number of goods for the plane.)Peden & MunkWe sat down at one the many picnic tables out back, set out our mix-and-match order of food and snapped a flurry of requisite Instagram images in the perfect Southern California light. (For optimal color impact, do like Alison and order the smoked-fish plate.)Then I quite literally had to jet. So I said goodbye to Jay and Alison, grabbed a freshly baked chocolate cookie on my way out the banged-up wooden screen door and hopped a car to LAX.It’s almost as if I wished for that five-hour flight delay.Explore Bon AppétitAdam NewsletterRead MorecookingMaster the Italian Hero and Be the Hero of Every PartyBy Adam Rapoportbest-new-restaurantsGjusta, Los AngelesBy Andrew KnowltonPhotography by Peden + MunkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-05", "author": ["Condé Nast", "Adam Rapoport"]}