{"id": "d9627a7258640ecb1b31b6428aeeced4", "url": "https://www.bonappetit.com/recipe/vegetarian-taco-bowls", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Tofu Crumbles With Rice and Avocado Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegetarian Taco BowlsBy Chris MoroccoDecember 16, 20194.8(62)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintWe took inspiration from picadillo, a flavorful, saucy spiced ground meat dish popular throughout Latin America, the Caribbean, and in the Philippines, and thought, Why not give tofu a similar treatment? So for this vegetarian (vegan without the queso fresco!) version, we crisped up the tofu in olive oil, then doused it in spices and hot sauce for some heat.Ingredients4 servings114-oz. block firm or extra-firm tofu¼cup extra-virgin olive oilKosher salt2garlic cloves, smashed2tsp. ground coriander1tsp. ancho powder or sweet smoked paprika1tsp. ground cumin½tsp. ground fennel1Tbsp. double-concentrated tomato paste2tsp. hot sauceCooked white rice, shredded red cabbage, sliced avocado, crumbled queso fresco (optional), cilantro, and lime wedges (for serving)PreparationStep 1Firmly squeeze tofu to expel as much excess water as possible (don’t worry if it begins to crack or come apart). Tear into 1\"–2\" pieces.Step 2Heat oil in a large nonstick skillet over medium-high. Add tofu, season with salt, and cook, tossing occasionally, until golden brown and crisp around the edges, 5–7 minutes. Using a rubber spatula, break up tofu into ½\"–1\" pieces. Add garlic and cook, tossing occasionally, until tofu pieces are crisp all over, about 3 minutes.Step 3Reduce heat to medium. Add coriander, ancho powder, cumin, and fennel. Cook, stirring, just until spices deepen in color, about 20 seconds. Add tomato paste and cook, stirring with rubber spatula, until paste slightly darkens in color, about 1 minute. Add hot sauce and 1 cup water. Bring to a simmer and cook, uncovered and stirring occasionally, until sauce thickens, 5–7 minutes. Season with salt.Step 4Divide rice among bowls. Top with tofu mixture, cabbage, avocado, queso fresco, and cilantro. Serve with lime wedges for squeezing over.How would you rate Vegetarian Taco Bowls?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleGood stuff! Next time, I'm gonna add black beans. AnonymousSeattle, WA2/13/2022Incredibly low-effort, weeknight winner. Wow is this delicious and so easy to whip up. Making this a major part of my weekly rotation.AnonymousBrooklyn, NY11/30/2021THIS IS THE BEST.  This is one of my first dishes I ever made with Tofu. My mom said she refused to try it because she hated tofu. Well she tried it, and we both agree, its a favorite. This recipe is such a easy, wonderful weeknight recipe. Desi S.Tucson9/8/2021I absolutely loved this. Made exactly as written for my friends, so flavorful and I genuinely couldn't tell it was tofu, which sounds like someone who promoted a vegan pyramid scheme would say, but I am a meat eater and think that it tasted so much like ground chicken or pork. GJLos Angeles, CA7/31/2021This was such an easy weeknight dinner—and so fun to make! I've never tried this cooking method for tofu, but I was really impressed with the results. I'm not a vegetarian nor vegan, but the tofu crumbles in the end really did taste and feel like ground crumbled beef. I'll keep this in my back pocket for future recipes...I'm thinking enchiladas next time... I've also read other places that freezing and thawing your tofu provides for an even meatier texture, so think I may try that out with this recipe as well.\nAlso, I happened to have all the ingredients as called for and I really liked the combo! I was a bit skeptical of the fennel at first, but was quickly proven wrong. I might doctor it up next time with some New Mexico chile powder for added heat.\nFYI: If you have a heavy dutch oven that works great for pressing tofu...seriously!SAArlington, VA6/16/2021Keep trying to find a tofu recipe I like. Another one in the \"no\" pile.  Followed instructions to a T, AnonymousAllentown6/4/2021So pleasantly surprised! I didn't want to use up all of my tofu so i subbed some crushed up cooked chickpeas to half of the amount of tofu as written. I used all the same spice measurements. Subbed some vegan worcestershire and ketchup in place of the tomato paste and wow... amazing. Such amazing smoky flavor - i used chipotle chile powder instead of paprika. Perfect with some fresh toppings! PriyaLexington, KY5/30/2021As others have said, the cooking method on this is great. Getting the tofu very crispy before adding the sauce is key. The sauce thickens beautifully. I almost couldn't tell that it was tofu and not pork in my taco! AngelaSeattle, WA5/6/2021So, I basically made a completely different recipe but the method is brilliant. Used oregano, chipotle chile powder, cumin, smoked paprika, and zataar (chaos).  Added 2x the garlic and two big pinches of sugar, and more tomato paste and more hot sauce and more salt. Finished with butter because I’m nasty like that. Ate over greens because I give mixed signals. Was a bomb, saucy, BBQ tofu affair. VictoriaRichmond3/6/2021Honestly my new favorite dinner. Added more hot sauce and more salt but DAMN this was good. Quick pickle your cabbage in red wine vinegar and salt/sugar while your tofu is crisping. You'll thank me later. Andrianna El Paso, TX2/7/2021Very tasty, very easy, but could use a little more spice. I’ll probably add at least 50% more to kick it up a bit. I also added corn into the bowl which added some nice brightness. I will definitely be making again. AnonymousCleveland, OH2/4/2021Super tasty and easy weeknight meal. Could definitely make into burritos if desired but I stuck with just the rice. Next time, I think I’ll kick up the spice level.AnonymousChicago, IL1/10/2021When I told my husband I was making this he moaned that tofu sounds awful. So we were both surprised at how good this turned out. Easy easy easy! It is going into our weeknight rotation. AnonymousLaguna Beach, CA12/22/2020Not a regular veggie eater but loved this! Didn't miss the meat at all. Added pickled onion, avocado, pickled jalepenos and feta cheese. So GOOD. AnonymousToronto10/13/2020This was delicious! I was out of coriander and didn't have any good substitutes so I just used some oregano (~ 1 tsp).  I serve it with quinoa instead of rice and added some pickled red onions. Yum!  It took a little longer for the sauce to thicken than the recipe says but eventually it came together.   Definitely will keep this in the rotation for a quick, easy and healthy dinner! AnonymousBuffalo, NY4/1/2020Explore Bon AppétitRice and Grain BowlTex-MexAmericanCaribbeanLatin AmericanTofuOther IngredientsRiceRice & GrainsAvocadoVegetableQuickEasyWeeknight MealsMainVegetarianNut-FreeGluten-FreeVeganDairy-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-16", "author": ["Condé Nast", "Chris Morocco"]}