{"id": "d96570e39a845ad8087d890d6753b7d1", "url": "https://www.bonappetit.com/recipe/weeknight-ragu", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Weeknight Ragù Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueWeeknight RagùBy Chris MoroccoAugust 10, 20213.9(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintMany ragus require hours of simmering. Not this one. Here we take the express lane, opting for ground meat, which gives you a head start on tenderness, and combining it with flavor-packed ingredients like double-concentrated tomato paste and heavy cream. Together they make for a sauce that’s just as satisfying as one that’s cooked all day. You can use pretty much any ground meat in this speedy meat sauce, but this is not the time to seek out extra-lean cuts. If you’re buying chicken or turkey, try to find ground dark meat, which is less prone to drying out.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonTuttoCalabria Crushed Calabrian Chili Peppers$10 At Snuk FoodsMicroplane Grater$16 At AmazonHeatproof Measuring Cup$18 At AmazonWooden Spoon$6 At AmazonIngredients4 Servings4Tbsp. extra-virgin olive oil, divided1lb. ground pork, turkey, beef, or chickenKosher salt1medium onion, finely chopped4garlic cloves, thinly sliced2Calabrian chiles in oil, finely chopped, or 1 tsp. crushed red pepper flakes¼cup double-concentrated tomato paste¼cup heavy creamFreshly ground black pepper12oz. gemelli or other short pasta1oz. Parmesan, finely grated, plus more for servingBasil leaves (for serving)PreparationStep 1Heat 2 Tbsp. oil in a medium Dutch oven or large skillet over medium-high. Add pork in 8–10 pieces, spacing evenly, and season with salt. Let cook, undisturbed, until deeply browned underneath, about 3 minutes. Turn over and cook until deeply browned on opposite side, about 3 minutes. Transfer to a plate (it won’t be cooked through and that’s okay).Step 2Reduce heat to medium and add remaining 2 Tbsp. oil to pot. Cook onion, stirring often, until softened and just beginning to turn golden around the edges, about 5 minutes. Add garlic and cook, stirring often, until fragrant, about 2 minutes. Add chiles and tomato paste and cook, stirring often, until paste is slightly darkened in color, about 3 minutes. Return pork to pot and break up into small pieces. Add cream and 1½ cups water. Bring to a simmer, then reduce heat, and simmer gently until liquid is reduced by one third and flavors have come together, 15–20 minutes. Season ragù with salt and pepper.Step 3Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid.Step 4Add pasta to ragù along with ½ cup pasta cooking liquid and 1 oz. Parmesan. Cook, stirring and adding more pasta cooking liquid if needed, until sauce coats pasta, about 2 minutes.Step 5Divide pasta among shallow bowls and top with basil and more Parmesan.How would you rate Weeknight Ragù?Leave a ReviewTell us what you thinkReviews (18)Back to TopTriangleLike some reviewers, I was a little underwhelmed. That said, by using Spanish chorizo sausage, a splash of white wine and by doubling the tomato paste, this recipe reached a 4/5 for me. TaraCanada1/20/2022This dish was delicious. Definitely will make it again. Madeline D-SPhoenixville 11/8/2021Its funny the family raved, I thought it was good not great.  I added some roasted cherry tomatoes that I had and a splash of Rao's sauce and I used high quality ground rib eye.   I normally wouldn't mind a sauce that's not very tomato based but agree this lacked complexity.  I think I prefer Bon Appetit's pasta with vodka sauce which is always a hit.  I agree also use chicken broth instead of water. On the bright side it all comes together in about 30 mins so it is a good weeknight dish.ErinLA, CA9/28/2021Although some reviewers seemed underwhelmed by this dish, I enjoyed it a lot and highly recommend this recipe! Be aware, however, that this isn't a tomato-ey dish. If you prefer an Italian-American-style, heavy tomato-flavored sauce, you might be disappointed. Instead, because of the high proportion of meat in the sauce, the sauce had a meat-forward flavor that was supported by some tomato flavor. (I used 90/10 ground sirloin, which gave this dish a big, beefy flavor.) This reminded me of something you'd get at an authentic Italian restaurant. I followed the recipe for the most part, with only a couple changes. First, I only used 1/2 teaspoon of crushed red pepper flakes. Second, along with the red pepper flakes, I added some dried herbs--1/2 teaspoon each of oregano, marjoram, and European basil. Third, I used half and half instead of heavy cream. And I added it at the very end. I used penne because it was the only short pasta I had in my pantry. It was perfect for this dish! My only regret is that I didn't think to use homemade chicken stock instead of water. I'll try that next time because swapping stock for water is always a great way to make a quick sauce taste as though it has been simmered for hours.Kay in HoustonHouston, TX9/15/2021Personally I loved this! Super easy and if you like a bit of kick - it’s delicious.MadcSan Francisco 9/10/2021A rare misfire from Chris. Nothing objectionable about it, just a big... meh.   No complexity of flavor at all. Not sure how this recipe became the cover of the Sept. issue. James 007NYC9/9/2021I made this with ground turkey I had to use up (half of which had sage in it) and chili flakes. It was quick, easy to make, and delicious. It tasted like a sauce that was left to simmer for way longer than the 20 mins it took to marry the flavours. I saved the bulk the sauce to save and add pasta to through the week, and I'm sure the flavours will only get more intense as it sits. PhillyCookPhiladelphia, PA9/8/2021Very easy to put together! I recommend using the double concentrated tomato paste and let it simmer for longer, closer to 30 minutes. Subbed out the Calabrian chiles for a red hot chilli pepper sauce. AnonymousAustin, TX 9/7/2021I doubled this recipe because i had a big group eating.  I used a pound of beef and i ground up fresh a pound of fresh  pork.  I did use the pepper flakes.\nI will say i was disappointed by the \"milky flavor\".  My expectations was for a richer, deeper flavor. \nI decided to add a \"stalk\" of basil fresh from my garden and found that if i cooked it a little longer a bolder flavor developed.  Like said I did double the recipe so while it may not make a big difference sometimes you can't just double a recipe - certain ingredients may need to be tweaked.\nI would make it again.  \n MCNew York9/5/2021I was really looking forward to making this dish but found it bland and lacking in flavor. I added Parmesan to the sauce and more salt but it still had little depth or flavor. Bolognese takes more time and effort but is more rewarding in flavor than this ragu.R. Elbaum Woodinville, WA9/5/2021Delicious! Used ground chicken with garlic powder because I was out of garlic, an unprecedented event in my home. Added a can of Muir Glen fire roasted tomatoes and chili flakes and it was HEAVENLY.ElkPortland, OR8/28/2021Could of used more tomato. My sauce came out chunky and was lacking in depth of flavor. For others I would recommend adding a can of crushed tomatoes and double the amount of tomato paste the recipe calls for.Matty MathesonSeattle8/27/2021Definitely flavorful, but not as rich as I had anticipated. I would add chopped canned tomatoes to mine next time! Taylor GSeattle, WA8/25/2021So so good. I was able to pull it together during my lunch hour. I also used half & half like another reviewer but I put it in at the end cause I was worried it would break. I wanted to use a whole box of pasta (why just 12 oz??? What am I gonna do with 4 oz of leftover pasta??) so I used a whole 6 oz can of tomato paste, 1/2 cup half & half, and the whole cup of pasta water. Worked great, tasted awesome. Highly recommend!Megan B-LMinneapolis, MN8/20/2021Sunny (from 8/18/21): You can absolutely make it with Beyond Meat. I did it last night and it worked really well. You can make the recipe exactly as written but, if you're up to it, brown the meat in two batches because the extra moisture in the Beyond Meat will leach out and prevent browning. (But I did it in one batch in a 12in pan and it turned out great still). Also, I think this dish can take more black pepper than. you may think it should have! :DLukeTwin Cities, MN8/20/2021Explore Bon AppétitPastaItalian AmericanAmericanGround BeefBeefMeatGround PorkPorkGround ChickenChickenPoultryGround TurkeyTurkeyParmesanCheeseWeeknight MealsEasyMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Chris Morocco"]}