{"id": "d9673cca2438dc37b7d50d6b8d5e0e14", "url": "https://www.bonappetit.com/story/arthurs-nosh-bar-montreal", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "Arthurs Nosh Bar Lets Me Eat Food the Way I Want: Off of a Tower | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsArthurs Nosh Bar Lets Me Eat Food the Way I Want: Off of a TowerThree levels of bagels, gravlax, and more.By Emily SchultzJune 25, 2019FacebookTwitterEmailPhoto by Karolina Victoria JezFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.They say 60 percent of the human body is made up of water, but if you ask a Jew from the Northeast (a.k.a. me), we’d say our bodies are actually 60 percent everything bagels and gravlax. That means, of course, that I know the difference between a good bagel and a great bagel when I see one, and that when I say there’s one bagel that’s ruined me for all others, you better believe it’s GREAT. I’d even venture to say that the luxurious three-story tower of bagel heaven served at Arthurs Nosh Bar in Montreal is, in fact, the bagel situation of my dreams.Let me break it down for you: On the bottom floor, you’ll find perfectly toasted sesame bagels, Montreal-style obviously, in all their chewy, slightly sweet glory. Right above the bagels are thick, juicy slices of tomato (when in season) or rye bread (carbs on carbs!) and a tennis-ball-size dollop of tangy cream cheese. Finally, crowning the top of the tower, you get the crème de la crème: house-cured gravlax (or smoked salmon, but go for the gravlax because of all of the salty, fatty reasons) along with paper-thin wisps of white onion, lemon wedges, salty capers, and grassy dill. Pile it altogether, and you’ll understand why I can’t look at other bagels in quite the same way.Go there: Arthurs Nosh BarExplore Bon AppétitMontrealBrunchHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-25", "author": ["Condé Nast", "Emily Schultz"]}