{"id": "d9761bc1ec777e71e645830cb9bf59cc", "url": "https://www.bonappetit.com/recipe/grilled-shrimp-with-palapa", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Grilled Shrimp with Palapa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueGrilled Shrimp with PalapaBy Tom CunananMay 21, 20195.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco and Tom Cunanan, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintWhen Chef Tom (from Bad Saint who developed this recipe) gifted us a jar of palapa, we nearly lost our minds. An insanely flavorful condiment made from toasted grated fresh coconut and tons of aromatics, it can be a topping for any grilled or roasted protein.Ingredients8 servingsPalapa16red Thai chiles6dried shiitake mushrooms1fresh coconut or 4 cups dried unsweetened shredded coconut¼cup vegetable oil1bunch scallions, chopped1½heads of garlic, cloves separated, finely chopped12\" piece ginger, peeled, finely chopped6makrut lime leaves, thinly sliced (optional)3Tbsp. sugar1Tbsp. Diamond Crystal or 2 tsp. Morton kosher saltShrimp and Assembly2lb. jumbo shrimp, preferably head-on, peeled, deveinedVegetable oil (for grill)Kosher salt2lemons, halvedPreparationPalapaStep 1Pulse chiles in a food processor until finely chopped (if you’d rather chop them by hand, wear gloves!). Transfer to a small bowl.Step 2Grind mushrooms in a spice mill or with a mortar and pestle (or use food processor again) to a powder.Step 3Hold coconut in one hand and strike it firmly around the equator with the back (blunt side) of a heavy knife or cleaver, rotating coconut as you go until it splits. Whack coconut halves with the back of knife to loosen meat from shell. Remove meat and shred on the large holes of a box grater (or use food processor fitted with grating plate). Toast shredded coconut in a dry wok or large cast-iron skillet over medium heat, stirring often, until deeply browned in spots, 15–20 minutes. Transfer to another small bowl.Step 4Heat oil in same wok over medium-low. Cook scallions, garlic, and ginger, stirring constantly, until very fragrant, about 3 minutes. Mix in chiles, mushroom powder, toasted coconut, lime leaves (if using), sugar, and salt. Cook, stirring often, until golden brown and very fragrant, about 5 minutes. Let cool.Step 5Do Ahead: Palapa can be made 3 months ahead. Cover and chill.Shrimp and AssemblyStep 6Toss shrimp with 2 cups palapa in a large bowl. Cover and chill at least 1 hour or up to 1 day.Step 7Prepare a grill for medium heat; oil grate. Arrange shrimp on grate and pack any palapa still in the bowl on top; season lightly with salt. Grill, turning once or twice and keeping as much palapa on shrimp as possible, until opaque all the way through, about 5 minutes.Step 8Meanwhile, grill lemon halves, cut side down, until charred, about 5 minutes.Step 9Serve shrimp with lemons for squeezing over.How would you rate Grilled Shrimp with Palapa?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleTried cooking this. Really yummy and savoury. I am Pinoy and however as much as I would like to support this, I feel the need to point out that the Maranao Palapa is nowhere near this iteration. Ingredients and cooking style are nearer to Indonesian Serunding Kelapa (Spicy Coconut Floss) than Filipino Palapa. Mushrooms are substituted for small dried shrimps in the original Indonesian version.GekidanBacolod City, Philippines9/21/2019Made this for a BBQ and it was insane. kmarxmarxchicago8/15/2019Explore Bon AppétitFilipinoSoutheast AsianAsianShrimpShellfishSeafoodCoconutFruitChileVegetableThai ChileSummerMainDairy-FreeGluten-FreeKetoHealthyishGrillingMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Tom Cunanan"]}