{"id": "d97880f7b8eee4bc7d34bc9c8d952ae3", "url": "https://www.bonappetit.com/recipe/rose-sangria", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Rosé Sangria Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRosé All Day SangriaBy Kat BoytsovaMay 8, 20183.7(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintUse your favorite combination of herbs for this refreshing twist on sangria. We like to think of it as spa water but with a little buzz! It’s perfect to serve at picnics or on any warm summer night.Ingredients8–10 servings4Persian cucumbers, divided2750-ml bottles rosé½cup bianco vermouth1bunch mixed herbs, such as basil, mint, tarragon, and/or parsley, divided212-oz. cans citrus soda, such as Limonata or SpritePreparationStep 1Cut 3 cucumbers into spears; set aside. Coarsely chop remaining cucumber, then gently smash pieces with a rolling pin or the back of a heavy knife to soften flesh and release juices. Transfer all cucumbers to a large pitcher. Add rosé and vermouth and stir to combine. Set aside a few of the prettiest herb sprigs and chill in a zip-top bag until ready to serve. Smack remaining herbs against a cutting board to release aromas and lightly bruise leaves and add to pitcher. Cover and chill at least 3 hours and up to overnight for flavors to meld.Step 2Divide sangria among ice-filled glasses. Top off with soda. Garnish with reserved herbs.Photo by Chelsie Craig, Food Styling by Yekaterina BoytsovaHow would you rate Rosé All Day Sangria?Leave a ReviewTell us what you thinkExplore Bon AppétitCocktailDrinks AllPitcher DrinkSangriaSpanishEuropeanVermouthAlcohol & Other DrinksCucumberVegetableSummerDrinksFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-08", "author": ["Condé Nast", "Kat Boytsova"]}