{"id": "d98126632f52c3d2c59119e3112f8469", "url": "https://www.bonappetit.com/story/essential-workers-look-back", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "The Lives of Essential Workers, One Year Into the Pandemic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusThe Lives of Essential Workers, One Year Into the PandemicDelivery drivers, grocery cashiers, and farmers reflect on feeding a nation in crisis.By Patricia EscárcegaFebruary 16, 2021FacebookTwitterEmailPhoto by Hannah La Follette RyanFacebookTwitterEmailIt’s been a year since the pandemic hit America and sent more than 40 percent of our workforce home. But for delivery drivers, grocery cashiers, farmers, and so many more deemed vital to feeding our nation, things have looked a lot different. Here, six essential workers share their stories with writer Patricia Escárcega and “Subway Hands” photographer Hannah La Follette Ryan.In the past year Patty Estes, a grocery store cashier in Puyallup, Washington, has endured every customer service indignity imaginable. She has been spat on for not issuing a refund to an angry customer, chewed out for not allowing someone to purchase several gallons of hand sanitizer when the store limit was two, and called “every bad name in the book.”Chef Nancy Burgos-Jackson of Red Door Place.\nPhoto by Hannah La Follette RyanIt’s a privilege to be employed during a pandemic that has cost so many their jobs, Estes says, but working at a supermarket has never been harder. Last March, when legions of shoppers lined up to empty the shelves of canned goods, toilet paper, and cleaning products, the deluge of foot traffic was so overwhelming that some cashiers immediately filed requests for extended leaves of absence; others went on anti anxiety medications. “I’ve worked in retail for most of my life, about 17 or 18 years. But I’ve never seen a year this bad,” Estes says. “We used to love getting to know our customers and having conversations with them. It’s completely changed. The anxiety level in the store is insane.”Grocery store cashiers are among the 22 million food and agriculture workers deemed essential to the infrastructure of the nation during the early weeks of the pandemic. The diverse group encompasses workers on farms and in restaurant kitchens, workers who pack meals for schoolchildren or stock grocery shelves, workers who prepare and deliver meals—jobs that feed people and keep communities secure. People of color and women make up the majority of these workers, and immigrants are overrepresented, particularly in the meat-packing sector. The work they do is undervalued, underpaid, and often dangerous.Pedro Albarran, a meat-packer at the Farmer John pork processing plant in Vernon, California, remembers the fear he felt last spring as dozens of his coworkers began to fall ill. By November, 315 out of Farmer John’s 1,800 employees contracted the virus. Albarran, who earns just under $15 an hour breaking down pork shoulders in the cut department, was frustrated by the sluggish response of his employer, a subsidiary of Smithfield, one of the world’s largest pork processing companies. He says they’re more focused on speeding up production than protecting personnel.Geoff Bucknum of Farm Director, Sunny Harvest Co-op, Kirkwood, PA.\nPhoto by Hannah La Follette RyanUnfortunately, the workers we depend on for survival are also the ones least likely to have access to health insurance benefits, paid sick leave, or savings. They are more likely to get sick on the job, and less likely to have a seat at the table when policymakers look for solutions in times of crisis. The conditions that made Farmer John vulnerable to outbreaks—crowded workspaces, lack of safety training, uncommunicative management—mirror those at other factories, farms, stores, and restaurants across the country. Yet OSHA, the federal agency charged with protecting worker safety, reported in December 2020 it had only issued citations related to 295 inspections for violations relating to coronavirus, and performed painfully few inspections outside the health sector. Enforcement of safety protocols has been largely left to the companies themselves or overwhelmed state and local agencies, and as a result, workers suffer.A job is a paycheck, but it also defines the rhythm of our daily lives. It has the power to lift us out of poverty and uncertainty, shape our children’s future, and make communities out of strangers. Work can give us a sense of dignity and security, but it can also take those things away—and the current crisis has brought that fact into painfully sharp focus. In the stories that follow, we’ll hear from the farmers and delivery drivers, the cooks and cafeteria workers who have spent the past year facing down their own mortality in order to keep the country fed.“We have been called heroes, but I don’t like that word,” Albarran says. “We’re simply essential workers. We do our work as best we can so everyone can have food on their table.”Hernandez rides a bike full of orders in NYC.\nPhoto by Hannah La Follette RyanAndres Hernandez: DoorDash Delivery Driver, Queens, NY“This delivery work, yeah, it’s hard. Especially when it’s raining and snowing. Sometimes I get angry that people don’t leave tips. You go a long distance for three dollars, sometimes one dollar. I work from 11 in the morning to 3:30 in the afternoon, then from 5 to 10 at night. I ride about 50 miles a day on my e-bike. I don’t like it, but I need the money.”Ravon Jones: Assistant Cafeteria Manager, Dothan City Schools, Dothan, AL“This job has always been hard work, and because of COVID it’s even harder now. A lot of the staff is quarantined at home, but we still have to go out and feed these kids. They’re not allowed to eat in the cafeteria anymore, so we prepare the food there, pack it into coolers, and deliver it to the different learning pods. The teacher comes out and gets what she needs for her class. Most of the time they don’t allow the kids to come out, but we still get to see them a little bit. Even with masks on they recognize us and know we’re the cafeteria ladies. They wave and say hello. It brings joy to our hearts to give them something that they may not be getting at home. That’s one of the highlights of being a cafeteria worker. Because some of these kids are very hungry. Sad as it may be, sometimes this is the only meal they get.”Burgos-Jackson prepares to serve. \nPhoto by Hannah La Follette RyanNancy Burgos-Jackson: Chef and teacher, Red Door Place, NYC“Before COVID we all used to eat together in the church soup kitchen where I work. I would go around from table to table to say hi to people. They would say to me: ‘Nancy, I feel like I’m in a restaurant without getting the bill.’ I wanted to cry. Here I am making you a beautiful hot meal; I don’t know when you’re going to eat again, but today, with me, you’re going to eat the best meal in the world. I don’t get that interaction now, but even through the pandemic, I keep going down to the church. I wear my mask. I wash my hands and practice social distancing. And I do my job.”Pedro Albarran: Pork Shoulder Deboner, Farmer John, Vernon, CA“Many of my coworkers have gotten sick, and the rest of us are expected to pick up the slack. New people come in but don’t last long. Production has been ramped up. Sometimes the meat starts coming down the line before we have even finished our 15-minute breaks—which are more like seven minutes now, because by the time you remove all your PPE and grab a snack, the break is essentially over. The line never stops. It’s extremely physically demanding work. There are times when we want to go to the restroom, but we have to wait for someone to fill in for us on the line before we’re allowed to go. Morale is very low. Everyone is scared of getting sick, but we try to stay vigilant. The work we do produces the food that makes it to people’s tables. Essential workers across all industries need to be recognized. We want these companies to tell us that we are essential, pay us what we’re worth, and provide us with the working conditions that we deserve. We want companies to stop hogging all the profits.”Bucknum with some fresh-picked vegetables.\nGeoff Bucknum: Farm Director, Sunny Harvest Co-op, Kirkwood, PA“As the pandemic set in, a lot of farmers decided early on not to plant, thinking that it would just result in loss. We went in the other direction and said, ‘You know, as a Plain sect [Amish] community, what we do is we farm.’ It’s particularly hard for our farmers to isolate and do everything over the phone, but we wanted to serve our customers wherever they might be. Food distributor and restaurant sales contracted massively, but we worked to secure USDA grants to supply food boxes and actually produced and delivered more food this year than any year before. I hope that this year has made people think more carefully and ask: ‘Hey, where does my food come from? Who am I supporting?’”Patty Estes, Grocery Cashier, Fred Meyer, Puyallup, WA“We get temperature checks before shifts but we could be asymptomatic from being around thousands of customers every day. And then we’re talking about people who are surviving on minimum wage trying to go to the doctor. I’ve heard stories from coworkers about family members telling them they don’t want to see them because of where they work. They don’t want to get exposed. It hurts. We’re just trying to make a living.”Explore Bon AppétitCoronavirusRestaurantsRead MorerestaurantsNo Us Without You Is Feeding the Essential Workers Who’ve Fed UsBy Othón Nolasco, as told to Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-16", "author": ["Condé Nast", "Patricia Escárcega"]}