{"id": "d984d3cde6c284ccad0fd39c4506f8c1", "url": "https://www.bonappetit.com/recipe/adonis-spritz", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Adonis Spritz Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueAdonis SpritzBy Christina ChaeyJanuary 4, 20225.0(3)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintAdonis cocktail purists might balk at the addition of bubbles to the classic combo of sherry and sweet vermouth, but the club soda is what makes this drink an all-night sipper with virtually zero chance of a hangover the next day.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCocktail Jigger$6 At AmazonVegetable Peeler$10 At Amazon1.25\" Silicone Ice Cube Tray$15 At AmazonIngredientsMakes 11oz. fino sherry1oz. sweet vermouth3oz. club soda2dashes of orange bittersOrange twist (for serving)PreparationPour sherry and vermouth into an old-fashioned or rocks glass filled with ice, followed by club soda. Top with bitters and garnish with orange twist.How would you rate Adonis Spritz?Leave a ReviewTell us what you thinkExplore Bon AppétitSherryAlcohol & Other DrinksVermouthCocktailDrinks AllHealthyishDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Christina Chaey"]}