{"id": "d9a420da0148d6a51bc40c4ec321fd54", "url": "https://www.bonappetit.com/recipe/pecan-pumpkin-spice-chocolate-chip-cookies", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Pecan Pumpkin Spice Chocolate Chip Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssuePecan Pumpkin Spice Chocolate Chip CookiesBy Amanda MackOctober 20, 20204.1(49)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“Meet the Holiday Triple Threat Cookie,” says baker Amanda Mack, the owner of Crust by Mack in Baltimore. A chocolate chip cookie spiked with homemade pumpkin spice, crunchy pecans, and gooey pumpkin puree. This recipe makes big cookies. To make 40–48 smaller cookies, use a No. 60 cookie scoop (about 1 Tbsp.) and bake about 10 minutes.IngredientsMakes 20-241Tbsp. ground cinnamon1½tsp. ground ginger1tsp. ground nutmeg¾tsp. ground cloves3cups (375 g) all-purpose flour1¼tsp. baking soda1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1¼cups (2½ sticks) unsalted butter, softened until just slightly firm1½cups (packed; 300 g) light brown sugar1cup (200 g) granulated sugar3large eggs¼cup canned pumpkin purée1Tbsp. vanilla bean paste or vanilla extract4oz. (112 g) semisweet chocolate, coarsely chopped1½cups (9 oz./255 g) dark chocolate chips1½cups (174 g) coarsely chopped pecansPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Mix cinnamon, ginger, nutmeg, and cloves in a small bowl to make pumpkin spice. Whisk flour, baking soda, salt, and 1 Tbsp. pumpkin spice in a medium bowl; set remaining pumpkin spice aside for making pies, quick breads, or another batch of cookies.Step 2Combine butter, brown sugar, and granulated sugar in the bowl of a stand mixer fitted with the paddle attachment. Beat on medium speed, scraping sides of bowl as needed until fluffy, about 3 minutes. Reduce speed to low and with motor running, add eggs one at a time, mixing to incorporate after each addition before adding the next. Beat in pumpkin purée and vanilla paste. Gradually add dry ingredients and beat just until combined (be careful not to overmix). Set aside a handful or so of each of the chopped chocolate, chocolate chips, and pecans. Using a rubber spatula, gently fold remaining chopped chocolate, chocolate chips, and pecans into dough.Step 3Using a No. 20 cookie scoop (about 3 Tbsp.), drop balls of dough onto two parchment-lined baking sheets, spacing at least 4\" apart. (If using a half-sheet pan, bake 2 cookies per sheet. For a full sheet, you can fit about 4.) Gently press reserved chocolate and nuts into tops of dough balls.Step 4Bake cookies, rotating pans top to bottom and front to back halfway through, until golden brown around the edges, 11–13 minutes (subsequent batches may take 2–3 minutes longer). Let cookies cool on baking sheets 5 minutes.Step 5Using a thin metal spatula, carefully transfer cookies to wire racks and let cool completely.Step 6Do ahead: Dough can be made and formed into balls 3 months ahead; freeze on baking sheets until solid, then transfer to resealable freezer bags or an airtight container. Cookies can be baked 3 days ahead; store airtight at room temperature.How would you rate Pecan Pumpkin Spice Chocolate Chip Cookies?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleI used Penzey's pumpkin pie spice but otherwise followed the recipe as written & thought these cookies were delicious. I served them warm with homemade bourbon pumpkin ice cream for dessert on Thanksgiving & will do so again. I thought it was the perfect solution to the pecan vs. pumpkin pie debate. One caution: The dough must be at room temp for the centers to cook through. I also recommend pressing down on the ball centers to thin them a bit to insure complete cooking. In my oven, they took 15 minutes.Dfchud12/7/2021I made these as written last year and they were awesome! So many compliments. I have a non-dairy person coming to Thanksgiving this year. I substituted plant-based chocolate and vegan butter (from a tub). The chocolate substitute worked just fine. The vegan butter definitely changed the texture of the cookies as they were baking. The first lot completely pooled out. I tweaked it to do 1 tbsp drops instead of 3 tbsp, did one tray at a time closer to the heating element (at the same temp) and reduced the baking time to 8.5-9 mins. Seemed to do the trick! AnonymousMelbourne, Australia11/25/20212.5 cups of sugar! R U trying to kill us. Please try again.AnonymousFt Myers, FL11/2/2021I thought these were great. I used pumpkin pie spice like someone else recommended and I don't think my pie spice was very good so I wouldn't recommend that because it threw my flavors off. But I corrected it by dicing some crystallized ginger into little bits and sticking them on before I put the cookies in the oven. Plus I topped them with Maldon salt. And I thought they were great!HoodancePittsburgh12/16/2020I thought this recipe was worded pretty strangely so I took the liberty of streamlining it to make it easier to follow and the end result was pretty good. I used a pre-blended pumpkin spice mixture that I have on hand, and then I added some ground cardamom that worked really well with the rest of the cookie. I also browned the butter and added it to the sugars instead of creaming it, I reduced the amount of sugar, and I deliberately portioned out the dough making them more oversized. The texture came out perfect, they were really chewy and nice. I'll probably make them again with these alterations and I'll also halve the recipe because it made a ton. I gently suggest using this recipe as more of a guide instead of something you should follow word for wordGabrielleAshland, Oregon12/14/2020This is a great recipe. Made them for Thanksgiving and it yielded about 24 large cookies which was great to share all weekend. Instead of making my own pumpkin spice, I used Pumpkin Spice Seasoning from Trader Joes which worked just as well. Then you don't have to make a bunch just to set aside. I made these again with all Buckwheat flour to make them gluten free and they were perfect. Gluten free flour just needs time to chill or freeze before baking (which I would recommend doing for even non-gluten free flour), but the pumpkin puree makes everything stay moist and chewy. I agree that there were some steps in the recipe that were not written well - like setting aside a handful of the chocolate chips and pecans to press into the cookies right before baking. MariahBay Area, CA12/9/2020These cookies were delicious and made plenty to pass around at the holidays. Some reviews mention how flat the cookies became while cooking but I did not find that this affected the taste at all. The cookies are nice and crisp when first taken out of the oven and actually soften beautifully overnight. The pumpkin flavor definitely shines through more on the second day. They were definitely a hit!KatieAtlanta, GA12/1/2020I didn’t have ginger or pecans, and didn’t chop up any chocolate chips, but I still thought these cookies were to die for! I added a tad bit more of the pumpkin spice mixture and they came out so deliciously flavorful! I also didn’t use a stand mixer (just used a fork, actually). The dough was verrrry sticky, so I really would recommend using a scoop. The cookies spread quite a bit, but if you use smaller dough balls then you can fit more on your tray (it takes so long if you can only do 4 at a time!). AnonymousNew York City11/28/2020I put the cookie dough in 1-tablespoon scoops on a baking sheet in the freezer overnight for about 12 hours before baking. They came out so soft and fluffy, and they didn't spread at all! The flavors came through beautifully. Definitely my new favorite fall cookie! I also substituted about 1 tablespoon of pre-made pumpkin pie spice from Trader Joe's (instead of opting to make my own) and that worked well. BVFerndale, MI11/26/2020I actually love the look/texture of these cookies, despite what some of the commenters are saying. I followed the instructions for cooking and then cooking in the baking sheet before transferring them, and that led to beautifully soft, chewy cookies. I got 30 large cookies from this recipe and because you can only bake in small batches, it took me about 2.5 hours just to bake them! You could easily cut this recipe in half and it would be plenty of cookies and much less time. I added an extra tsp of pumpkin pie spice which I think was a good call. Next time I'd add more salt and toast the pecans. I put flaky salt on the tops of my cookies but I think more salt in the dough would bring out the other flavors.MKAustin, TX11/26/2020These came out flat as a pancake, even after freezing the dough in balls. Really disappointing. AnonymousLansing, Michigan11/21/2020I judge my recipes by how many I want to eat immediately, and I ate 2.5 of these right out of that gate - very good!\n\nI read through a lot of previous comments to tweak the recipe. I added a cup of oats (which I loved) and cut back on the sugar. Also chilled the cookies in the fridge before and popped them in the freezer for 5 minutes right after. Cooking for about 20 minutes on 350 degrees worked the best for me. \n\nMy tweak was to add a little flaky sea salt on top. CPNY, NY 11/17/2020These are delicious but the recipe has some issues.  First, I would add all the chocolate and pecan pieces to the batter.  Sticking them on top of the dough balls was unnecessary and didn't really do anything for me.  Second, I found these need to be in the oven for about 15 minutes, maybe even a little longer.  11-13 mins in the oven and you'll have very tasty cookie mush.Anonymous2220111/12/2020Nice cookies, but a little too sweet - next time I would reduce the amount of sugar to use 1 C brown sugar and 3/4 C granulated sugar. I did place the cookie dough in the fridge overnight and they still spread out during the bake - dark soft edges at 14 minutes plus 2 minutes while the center was still light so I had to add a few more minutes to the bake time. AnonymousCA11/10/2020These turned out well for me but not without frustrations. I don’t like how the recipe is written; it makes it so that you really have to read it all the way through and then go step by step. The wording is really confusing and there were multiple times when I stopped and realized I messed something up because of how it was written. For example, I totally missed that for some reason you make extra pumpkin spice mix and hold it aside. Why would we need to do that? I wish the recipe just had the amounts needed for this and that’s it. Then the instructions say to mix in the chocolate and pecans and leave some out. Then it says fold in the remaining. So I did that, and then got to the end where we’re supposed to press some on top. But I folded it all in because it said to fold in remaining. It didn’t make much difference as far as the final product but it was frustrating to realize I made a mistake. I refrigerated the dough overnight because that’s normally how you get a good cookie, so mine didn’t spread like the recipe expected them to and I’m relieved because who has time to cook two cookies per half sheet??? AnonymousNYC11/6/2020Explore Bon AppétitCookieDessertPecanNutChocolateOther IngredientsFallSnackBakingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Amanda Mack"]}