{"id": "d9b59b7e9da42013564fe49a1b13eb62", "url": "https://www.bonappetit.com/story/press-in-pie-crust", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Press In Pie Crust Is Way Easier—And Just As Delicious—As Roll-Out Pie Dough | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy I’m Giving Up on Pie Dough and Opting for a Press-In Crust InsteadI can't be bothered with a rolling pin.By Antara SinhaNovember 23, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by Pearl JonesFacebookTwitterEmailAs a self-professed dessert lover, one of my favorite treats is a seasonal pie. From tart berry pies in the summer to warmly spiced pumpkin and sweet potato in the fall, I’d probably bake myself a pie a week if it weren’t for the laborious process of preparing and chilling and rolling out pie dough. Which is why more and more often I’ve found myself abandoning roll-out pastry and opting for low-maintenance press-in crusts instead.You’re likely no stranger to press-in pie crusts. From crushed graham crackers to ground mixed nuts to crumbly buttery shortbread-style pâte sucrée, the world of press-in pie crusts is vast and varied. What they all have in common, though, is they allow you to set the rolling pin aside and choose a faster, more reliable and intuitive tool: your hands. Assembling the dough can be as simple as mixing up your ingredients with melted butter and pressing it into a pie pan or tart tin.Next time you’re making a pumpkin pie, opt for a crumbled biscoff cookie base—you won’t miss the traditional roll-out pie crust when warm ginger snappy flavors are front and center. Experiment with savory and sweet by mixing in saltines or Ritz crackers into your pie crust; you can even consider a handful of cheese crackers in the mix for a cheddar-and-apple-pie moment. Instead of covering your precious stone fruit and berries with a time-intensive laborious lattice, opt for a press-in tart crust that’s crisp, light, sweet, and just as buttery. Rolled oats, shredded coconut, and spices are all welcome to the party too.To be fair, press-in pie dough is not a one-to-one swap. You will miss out on the flakiness that comes from properly mixed pie dough, where large pieces of butter release steam in the oven to create air pockets. But there’s joy to be had in a press-in crust’s buttery, crumbly, meltingly short texture; there’s opportunity to incorporate additional flavors; and there’s less of a chance of getting a massive headache from trying to roll out finicky dough when a family member is breathing hot air down your neck.The crust for this cranberry-lime pie is a mix of ginger snaps and pecans. \nPhoto by BOBBI LINLike traditional pie dough, you may likely need to parbake your crust, which can take a little planning ahead. In her debut cookbook Life Is What You Bake It, Vallery Lomas writes that the best rule of thumb is to consider the amount of moisture in your filling. Parbaking—a fancy word for giving the empty crust shell a headstart in the oven—“is used when a filling is so liquidy that it might make the crust soggy before it’s had a chance to firm up in the oven, like a sweet potato pie,” writes Lomas. So for custard-based pie fillings, pumpkin and sweet potato included, you’ll want to prick your pie shell and bake—sometimes loaded up with pie weights, depending on the nature of the recipe—until the crust firms up. But even with this step, turning to a press-in crust is still loads easier than wrestling with your rolling pin.Consider this permission to give up on roll-out pie dough this year. When you’re in a pinch, say fretting over preparing the dessert you volunteered to bring to Friendsgiving or hurriedly trying to pull together a showstopping pie to round out Christmas dinner, do you really need the added stress? A press-in pie crust doesn’t require painstakingly incorporating butter, guessing about hydration levels, or whipping out the ruler and squinting to see what ⅛\" looks like. And that pumpkin or apple pie will be just as tasty.Press to ImpressSalted Caramel–Chocolate TartWe can't stop staring at the layers of bittersweet ganache and buttery caramel.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Antara Sinha"]}