{"id": "d9c6cc5caf40721d02d1d31a118e1832", "url": "https://www.bonappetit.com/recipe/spring-y-brothy-beans", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Spring-y Brothy Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueSpring-y Brothy BeansBy Andy BaraghaniApril 20, 20213.8(38)Read ReviewsTriangleEmailPinterestPrintPhotograph by Heami Lee, food styling by Maggie Ruggiero, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrintIf you’ve got hardy greens in your fridge that aren’t getting any younger, blanch and then blend them into a silky-smooth purée that enlivens a simple bowl of beans (you can use this trick to green-ify any brothy soup, FYI). This recipe calls for kale but is meant to help you make use of whatever greens you’ve got, from Swiss chard to spinach to herbs that are a bit over-the-hill.Ingredients4 Servings3Tbsp. raw pistachios, walnuts, or almonds1bunch kale¼cup extra-virgin olive oil, plus more for drizzling2medium leeks, white and pale green parts only, tough outer layers removed, sliced into ½\"-thick rounds4garlic cloves, thinly sliced4oil-packed anchovy filletsKosher salt, freshly ground pepper12\"-wide strip lemon zest½tsp. crushed red pepper flakes4cups low-sodium chicken broth215-oz. cans large white beans, (such as butter or cannellini), rinsed1cup chopped parsley2oz. feta, broken into large pieces41\"-thick slices country-style bread, toasted (for serving; optional)PreparationStep 1Toast pistachios in a dry small skillet over medium heat, stirring occasionally, until golden brown in spots, about 4 minutes. Transfer to a cutting board and let cool; coarsely chop.Step 2Remove ribs and stems from kale leaves. Finely chop ribs and stems; keep separated from leaves. Heat ¼ cup oil in a large pot over medium. Add leeks, garlic, anchovies, and kale ribs and stems; season with salt and pepper. Cook, stirring occasionally, until leeks are slightly softened, about 4 minutes. Add lemon zest and red pepper flakes and stir a few times to combine. Pour broth into pot, increase heat to medium-high, and bring to a simmer.Step 3Reduce heat to medium-low, add beans and crush a few with a wooden spoon to make the soup more creamy. Let simmer 10 minutes, then stir in kale leaves and cook until just wilted, about 2 minutes. Remove soup from heat.Step 4Using a slotted spoon, transfer kale leaves to a blender and add parsley and pistachios. Pour 1 cup broth (some beans are fine) from soup into blender and purée until smooth. Pour kale purée into pot with soup and stir to combine. Taste soup and season with more salt if needed.Step 5Ladle soup into bowls; top with feta and drizzle with oil. Serve with toast.How would you rate Spring-y Brothy Beans?Leave a ReviewTell us what you thinkReviews (12)Back to TopTrianglehow are y'all going to put that picture up there?! This looks like I ate kale for lunch then threw it up in a pot to make dinner. the taste is alright though.AnonymousNY8/19/2021I ran this on a limited menu at work as a “light and healthy” item. Sold really well! I will say you can not go without the lemon squeeze but I just used zest and a bunch of toasted pistachios and kale chips dressed with furikake. It was a hit!DrewsimPalm city Florida 5/20/2021I just finished my 2nd bowl and kind of loving it!  The thing that made it taste as I imagined it would from seeing the photo was a very generous squeeze of fresh lemon right in to my bowl.  Now that I've eaten it and tasted it at every stage, the lemon is non-negotiable. Also, I immersed, blended, and finally finished it in my Nutribullet but it still wasn't completely smooth.  I ended up really liking it with a few chunks here and there.  Anything this green has to be healthy. Yum! PS not a dairy eater so used \"Violife Just Like Feta.\"DeniseCalifornia5/12/2021Loved it! I used an immersion blender, and did achieve the beautiful green of the image with a bit more chunks of kale. I love the idea of greenifying, and will definitely use this on other clear broth soups.Anonymous5/7/2021Loved it!Erin RiesTelluride, CO5/7/2021While mine wasn't as bright green as the picture above, it was certainly green, evenly blended, and delicious! I did make some alterations to the blending though... I cooked the kale ribs, leeks, red pepper flakes, lemon zest, fish sauce (no anchovies!) and garlic in the pan as directed and then added all THAT to the blender with the pistachios and about 2 cups of bean cooking liquid (I made my beans from dry) and blended until smooth. Then I added the chicken stock to the pot, warmed it up, added the blender mixture to the stock, then added the beans, THEN added the kale leaves and simmered for a few minutes. It was amazing!! I could really taste the heat from the pepper flakes and the acidity from the zest, which other reviews below noted as lacking. SarahIN5/7/2021This was  absolutely delicious.  I have a Vitamix so the kale was completely pureed.Anonymous5/3/2021Maybe my blender doesn't have the power it should, but it did not totally puree the kale - rather turned it into tiny bits, not the smooth green color in the picture.  Plus it is really hard to fish out the wilted kale leaves, so I steamed them separately.  Overall - kind of disappointing.  I wish it looked like the  picture!  PDX cookPortland, OR5/2/2021OK - the taste is pretty nice, and you are certainly getting a good amount of veggies with this.  But if you think that picture has much to do with the outcome - you're wrong. There are three main issues with this recipe.  First, the use of canned cannellini beans is going to result in a bowl with broken and mushy beans.  Either use something larger, or start with dried and go from there.  Second, the steeping of lemon zest for 15 or so minutes does not impart much of that brightness that the amount of kale & leeks would like.  Adding a bit of the lemon juice helps brighten that up.  But the last issue is what makes this a private soup and not something you do for guests: you're not going to get kale in a blender to be either a perfect puree or a bright green like the image shows.  There is no emulsification with the bit of beans they suggest you add. It just looks a mess.JustSomeGuySeattle, WA4/30/2021I was really surprised to see this had poor ratings. I made it out of the magazine and it was a lovely weeknight recipe. I wouldn't say \"show stopping,\" but for what it is.... it's very good. I made it exactly as written but used chickpeas instead of white beans. It was very savory and satisfying. KatChicago4/28/2021Whoever rated this so badly clearly did something really wrong?!\nThis is a perfect healthy weeknight soup.\nCocoCanada4/27/2021This was amazing! I had to sub: onions for leeks; beef broth for chicken; and threw in basil and celery along with kale, romaine and spinach. Super rich and flavorful; I didn't even bother with cheese on top.Jafar the Royal VizierCanada4/27/2021Explore Bon AppétitSoupSoups and StewsKaleLeafy GreensVegetableCannellini BeanWhite BeanBeanPistachioNutLima BeanSwiss ChardSpinachFetaCheeseSpringEasyWeeknight MealsOne-Pot MealsMainGluten-FreeHealthyishEasterDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Andy Baraghani"]}