{"id": "d9cd24fde6c9f611df566644f7607025", "url": "https://www.bonappetit.com/story/a-few-of-my-favorite-fats", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "These Are a Few of My Favorite Fats | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Are a Few of My Favorite FatsI’ve been ransacking my pantry for ghee and coconut oil, butter and cream, nuts and seeds.By Christina ChaeyMarch 28, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Heather GreeneFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,When I started my newsletter a month ago, I had no idea I would be writing pretty much exclusively about cooking in the midst of...this. While it’s been overwhelming at times, sitting down every week to do it has given me a lot of insight into my own relationship to food, particularly in times of higher-than-average stress. For one, I’ve realized just how much I rely on cooking as a coping mechanism for my anxiety. I’ve also recognized how important it is for me to eat in the company of others (I am blessed with two roommates who are extremely game to eat most things I put in front of them).As usual, I cooked a lot this week (because what other option do I have? ...I really need to get some frozen pizzas), but I also spent a lot of time dreaming about all the things I hope to make once spring arrives. It’s the kind of thought exercise that makes me feel better about the future—which is worth a lot right now.Anticipatory joyHealthyish editor Amanda Shapiro recently shared an article on her Instagram Stories that introduced me to the term “anticipatory grief,” or the sense of impending loss we know is heading our way, even though we might not know when or where it will happen. It’s the kind of grief pretty much everyone I know is swimming laps in daily. But there are some future things we can be certain about: the peas will soon be too fat for their pods. Sweet and tender spring onions will flood the farmers’ market. And there will be asparagus. So much asparagus! (As an aside, I didn’t know how asparagus was grown until like two years ago, and it’s WILD). They’re still a few weeks out from arriving, but thinking of the spring vegetable congee and butter-roasted halibut with asparagus and pea-and-shrimp chawanmushi I’ll make when they show up fills me with what I’ll call “anticipatory joy.” In other words: something to look forward to.Make this soothing syrupWe had a couple of days in my house last week when we were completely out of lemons and limes, so now we are currently sitting on an embarrassment of citrus fruits. Every time I walk by and see them piled high in their big bowl, I instantly feel calmer. This week I made a jar of ginger honey lemon syrup, a party trick I picked up from former BA designer Alaina Sullivan, who whips this up to keep in the fridge whenever she feels a cold coming on. If you have a lemon, a bottle of honey, and a big knob of fresh ginger, you can (and should) make this.Please send fatsMaybe it’s the fact that I spend almost all of my time inside my very dry apartment, or maybe it’s that my anxiety-riddled insides are in need of an extra dose of comfort. In any case, I’ve recently been craving foods that are positively drowning(!) in fats. I’ve been ransacking my pantry for ghee and coconut oil, butter and cream, nuts and seeds. I’m eating sweet potatoes topped with avocado and toasty brown-butter turmeric walnuts. Bowls of cozy cod chowder spiked with cream. Scallion pancakes slowly crisped in vegetable oil. I like to think all these things are lubricating the joints, the stomach, the mind. (And if not, at least they taste very good.)These days, my evening rice gets a pat of butter and a sprinkle of soy sauce, something my parents only allowed me to do maybe once a month when I was growing up. When I texted a photo of my dinner (Salt and Pepper Fish, simple greens, and the aforementioned rice) to my family thread earlier this week, my dad immediately responded, “Too much butter LOL.” My sister replied, “Never enough butter.” At least she gets it.Till next week,Christina ChaeyAssociate editorExplore Bon AppétitHealthyishWhat's Chaey Cooking?Read MoreLifestyleCooking at a (Social) DistanceBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-28", "author": ["Condé Nast", "Christina Chaey"]}