{"id": "d9cd41940ead1162d716df4d4f8e1972", "url": "https://www.bonappetit.com/story/mtr-spiced-chutney-powder", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "MTR Spiced Chutney Powder Makes Everything Taste Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Chutney Powder Makes Everything Taste BetterMTR Spiced Chutney Powder is tangy, savory, spicy, and always on call in my kitchen.By Priya KrishnaMarch 18, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.There are certain foods I remember tasting for the first time that immediately prompted me to say, Where the hell has this been my whole life? A hunk of nutty, salty Parmesan. The tongue-coating richness of really good caramel. The potent, bright flavor of fish sauce. But none more so than MTR Spiced Chutney Powder.I was 7. My aunt Sonia (a.k.a. Sonia Mami of garlic-ginger chicken renown) was making idlis, and I was getting ready to eat the steamed, cloud-like rice cakes the way I was used to: with lots of butter slathered on top and a spoonful of yogurt on the side. Instead, Sonia Mami brought out a packet of this chutney powder, mixed in a little bit of ghee to turn it into a paste, and set it next to my idli.Chutney powders, also known as chutney pudi or gunpowder, are common across South Indian cuisine—usually as a ground blend of chiles, lentils, spices, and sometimes ingredients like dried shrimp or coconut. This one was burnt orange in color and made with red chiles, black lentils, curry leaves, mustard seeds, and asafetida. I dipped my pinky finger into the sauce, and tasted. The sensation was tangy, savory, and spicy, with the pleasant graininess you get from a good Dijon. The ghee rounded everything out. Just a little dab, and my idli was transformed. Sonia Mami gave me a packet to take home, and it became a staple of the Krishna pantry.We added the powder to ghee but also olive oil—we liked the way the fruitiness of the oil complimented the spices. I ate this chutney powder by the boatload not just with idli but drizzled over sweet potatoes, sprinkled atop rice, swirled into plain yogurt, dolloped onto grilled cheese sandwiches, and spread along the inside of dosas.I fully recognize that homemade chutney powders are better than store-bought ones, and I am thankful for my mother’s South Indian friends, who will always hook me up with their personal stashes when I am back home in Dallas. But for my everyday use in New York, these packets of MTR Spiced Chutney Powder do more than just fine, and are easily the most flavorful condiment in my pantry. They stand front and center in my cabinets, ready to be mixed with fat and slathered upon anything—literally anything!!!—that requires seasoning. My weeknight dinners/midnight snacks/lazy breakfasts/quick lunches will forever be indebted to Sonia Mami.Buy it: MTR Spiced Chutney Powder, $8 for 7-ounce bag on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingSpiceRead MorecultureOf All the Things in My Pantry, This Za’atar Blend Is My FavoriteBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-18", "author": ["Condé Nast", "Priya Krishna"]}