{"id": "d9d1a9071c9335ccb480734a12c6b873", "url": "https://www.bonappetit.com/story/leo-ripassata", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "At Leo in Brooklyn, Even the Most Stubborn Winter Vegetables Taste Like Luxury | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Make Even the Most Stubborn Winter Vegetables Taste Like LuxuryWe asked the folks at Brooklyn's new pizza joint Leo, where long-cooked and olive-oil-soaked vegetables are stealing the show. By Lizzie NoonanDecember 16, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailSince Leo opened near me in Williamsburg, I’ve become an accidental regular. Any time of day is now easily converted into an opportune moment to pop by the counter-service bakery and restaurant: a seeded morning bun for breakfast, a pear crostata and espresso pick-me-up, or a pizza rosso snack to-go. Leo has strong pizza lineage: Co-owner Mike Fadem is also a co-owner of Ops, one of Brooklyn’s best pizza restaurants, and his partner Joey Scalabrino was formerly the chef there. But, I must confess, it’s the assortment of ripassata that I can’t get enough of.As per Italian tradition, ripassata is the method of taking toothsome vegetables and breaking down their fibrous stems until they’re pleasant enough to eat (ripassare means to go over again). Often the technique is used to tame greens, like spigarello or broccoli leaves, that would otherwise be discarded or that can’t be digested properly if consumed raw. Leo has perfected the art with dishes like peppers and broccolini doused in olive oil or fioretto cauliflower with Calabrian chili and fennel seeds.Mike Fadem and Joey Scalabrino in a booth at Leo.\nPhoto by Emma FishmanThe idea for Leo came about over the course of the two owners’ travels around Europe, to cafés like Lille Bakery in Copenhagen, Panificio Bonci in Rome, and Flor in London—neighborhood places that are worth planning a trip around. “Besides being obsessed with pizza and bread, Mike and I love vegetables more than anything,” Scalabrino explains, “Cicoria ripassata when we go to Rome or sautéed snow pea shoots when we eat in Chinatown: We think these kinds of things go perfectly with pizza.”We got the lowdown on how Fadem and Scalabrino coax even the most stubborn produce into ripassata. And since ripassata is more of a state of mind than it is a recipe, trusting in your ability to taste is key. But there’s no need to sweat if your R&D goes awry: “You can always turn it into soup,” jokes Scalabrino.Get cozy with your produce“The most important thing is to learn the vegetable itself,” says Fadem. In the winter, look out for broccoli rabe or spigarello, and, come summer, go for eggplant or bell peppers. After hitting the farmers market, assess your raw produce of choice for bitterness and mouthfeel. Then, pick one of the myriad of options such as blanching, sauteéing, roasting, or boiling.If you’re unsure of the best path forward, test a small amount of the vegetable in a pot of salted water: “Try to boil a little bit to find the right texture,” he says, “you want to find the pleasure spot for that particular vegetable.”There’s no such thing as overcookedWhen working with tough winter vegetables, overcooking is never a bad thing. Don’t be afraid to make mistakes, Fadem encourages. When roasting, blasting high heat for a short amount of time usually does the trick—try 500 degrees for 10 minutes to start but don’t stray too far from your oven in the meantime. For blanching, 3 minutes in salted, boiling water is a solid starting point for most greens; adjust time depending on the stem’s thickness.Let the EVOO flowThe trick to tender, glistening vegetables is using copious amounts of olive oil before, during, and after cooking. It’s important to pick your olive oil wisely and invest in a high-quality product that will add flavor. “Right now, we get ours from Cantina Giardino, a winemaker in Campania,” Fadem says. “It’s really smooth but also spicy and fruity.” Check out Italian specialty purveyors like Gustiamo and Archestratus for hefty tins from vetted producers.Acid equals vibranceFinish your vegetables with acid, either in the form of citrus or vinegar, to add brightness. Acid also helps soften the vegetables and makes them last longer.“We’re working with a couple purveyors that bring in unique, well-made red and white wine vinegars,” says Fadem,”They have a real depth of flavor that’s kind of the secret to a lot of our favorite salads.” Scalabrino recommends reaching for winter citrus such as Meyer lemons or Sumo oranges to achieve the same effect. Use both the zest and juice for extra zip.Add a kick“Not all spices are created equal,” says Scalabrino, which is why he goes for Burlap & Barrel’s ethically sourced single origin blends. Peperoncino, fennel seeds, and dried herbs should all be within arm’s reach. To add a different texture and taste, toss in roasted pine nuts, raisins or crushed hazelnuts.Stage a second act“We want to make simple food that can sit over time and be served quickly,” says Scalabrino, “so a lot of these things taste better many hours or even a day after they’ve been prepared.” To shake up any leftover ripassata, throw the veggies between thick slices of sourdough or on top of a pizza, or turn them into a companion for pasta.Three Leo combinations to try at home:#1. Winter Greens + Calabrian ChiliBlanch chicories, collard greens, kale, or other tough winter greens in salted water for about three minutes or until crunch is gone. Ring dry. Sauté with olive oil and Calabrian chili. Dress with lemon juice, lots of olive oil, and salt to taste.#2. Peppers + BroccoliniToss peppers and broccolini in salt and olive oil. Roast in the oven at 500 degrees for about 10 minutes or until char begins to form. Add water as needed to keep from drying out. Dress with red wine vinegar and more olive oil. Season with crushed fennel seeds and fresh lemon when served.#3. Turnips + Dandelion Green PestoToss turnip wedges in salt and olive oil. Roast in the oven at 500 degrees for about 10 minutes. Dress with pesto made from dandelion greens, garlic and hazelnuts. Top with crushed hazelnuts and serve with whipped ricotta.Explore Bon AppétitHealthyishRestaurantsBrooklynItalianRead MoreLifestyleThe Pizza Place We Can't Stop Going To...For the SaladBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-16", "author": ["Condé Nast", "Lizzie Noonan"]}