{"id": "d9d9f7f530ae7eeb1b521cb284e819da", "url": "https://www.bonappetit.com/recipe/risi-e-bisi-with-sizzled-scallions", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Risi e Bisi (Italian Rice and Peas) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRisi e BisiBy Andy BaraghaniMay 10, 20184.4(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintThe fried scallions are not traditionally part of this Italian risotto and peas dish, but we love the added crunch. This recipe is ideal to make in the springtime when peas are fresh, but frozen works as well (we wanted you to be able to enjoy it year-round).Ingredients4 servings6scallions¼cup plus 2 Tbsp. extra-virgin olive oil, plus more for drizzlingKosher salt5cups low-sodium chicken broth3oz. pancetta, finely chopped1medium onion, finely chopped2garlic cloves, thinly sliced1cup arborio or carnaroli rice½cup dry white wine2cups shelled fresh peas (from about 2 lb. pods)3Tbsp. finely chopped mint2Tbsp. unsalted butter1tsp. finely grated lemon zest2oz. finely grated Parmesan (about 1 cup), plus more, shaved, for servingFreshly ground black pepperPreparationStep 1Cut scallions crosswise into 3\" pieces, then cut each piece lengthwise into thin strips.Step 2Heat ¼ cup oil in a large heavy saucepan over medium-high. Add scallions and cook, stirring occasionally, until crisped and golden brown in spots, 4–6 minutes. (They’ll soften at first but will crisp up eventually.) Using a slotted spoon, transfer scallions to paper towels to drain; season with salt. Pour off oil into a small bowl; set aside for later. Reserve saucepan.Step 3Bring broth to a simmer in a medium pot; keep warm over medium-low heat.Step 4Return saucepan to stove and add pancetta and 2 Tbsp. oil. Cook over medium heat, stirring occasionally, until fat begins to cook out, about 3 minutes.Step 5Add onion and cook, stirring often (notice a theme here?), until softened and golden, 5–8 minutes. Add garlic and cook, stirring like you mean it, until softened, about 1 more minute.Step 6Stir in rice; season with salt. Cook, stirring, until some grains are translucent, about 4 minutes. Add wine and cook—Never. Stop. Stirring.—until pan is almost dry, about 3 minutes. Ladle in 2 cups broth and simmer, stirring occasionally, until broth is absorbed, 2–3 minutes. Ladle in another 2 cups broth and continue to cook, stirring yet again, until rice is cooked through and most of the broth is absorbed, 5–7 minutes.Step 7Add peas and remaining 1 cup broth and cook, stirring to the very end, until peas are tender, 3–5 minutes. (If using frozen peas, add at the end and cook 1 minute to warm through.) Stir in mint, butter, lemon zest, and 2 oz. Parmesan. Taste and season with salt and pepper.Step 8Divide risi e bisi among bowls. Top with shaved Parmesan and reserved crunchy scallions. Drizzle with reserved scallion oil; season with pepper.How would you rate Risi e Bisi?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleGiovanni Risi e Bisi AnonymousSan Antonio TX 1/31/2022Good grief, do NOT listen to the commenters who say to pre-cook the rice! This is made similar to risotto and the rice absorbs the added liquid as it cooks. Get some good carnaroli or arborio rice and make it according to the recipe, keeping in mind that the cooking times for each ingredient may need to be adjusted. Excellent and authentic northern Italian dish! AnonymousIdaho, USA 7/4/2020To those saying the rice should be cooked beforehand (and to anyone reading their comments): *Please* don't do that. You absolutely cannot make risotto from pre-cooked rice, and the suggestion is bizarre and baffling. This recipe is beautiful as-written—I'm talking, like, crazy delicious. I make it regularly. I do find, however, that I usually need to cook the rice longer than stated. Cooking times in recipes are always relative and will vary from cook-to-cook and setting-to-setting. Use your instincts.Ashburn, VA, United States5/14/2020This was amazing! We accidentally tripled the pancetta amount (use metric measurements!), which made the dish very salty. But this would have been great if we actually followed the recipe.jacobvaughan344709australia5/8/2019I'm in the middle of preparing this. There's either too many scallions or not enough oil to fry them. Six scallions produces a ton of material and 1/4 cup just means they soak it all up rather than frying in it as the recipe seems to imagine. No oil was left over for later use. The rice has to be cooked first I presume? 1 cup of cooked rice is what it should say - no way uncooked rice will cook in 11 minutes and become \"translucent\" and \"cooked through\".  Anonymous5/21/2018I think there is a step missing - the rice should be cooked before it is added to the onion and garlic mixture!\nAnonymous5/14/2018This recipe is fantastic, it is easy to follow and execute relatively quickly. My husband and I both loved this dish, it was inSANEly delicious. For a couple who makes a ton of risotto, would highly recommend for a slight change of gears. It is so well-balanced flavor-wise with sweet, sour, umami, and texture-wise with creamy and crunchy from those wonderful fried scallions.kelseyurgoWinston-Salem, NC5/14/2018Explore Bon AppétitRisottoItalianEuropeanPeaVegetableRiceRice & GrainsSpringEasyWeeknight MealsMainNut-FreeGluten-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-10", "author": ["Condé Nast", "Andy Baraghani"]}