{"id": "d9e54097add96518b3bde232e86f5f40", "url": "https://www.bonappetit.com/recipe/black-and-white-and-green-cookies", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Black-and-White-and-Green Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueBlack-and-White-and-Green CookiesBy Rick MartinezNovember 19, 20193.6(77)Read ReviewsTriangleEmailPinterestPrintPhoto by Ted + Chelsea Cavanaugh, food styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintThis is a play on two of our favorite classics: the Thin Mint and New York City’s iconic black-and-white cookie. But here we’re upping the game with finely chopped fresh mint mixed right into the dough for both its lovely green color and subtle, cool breeze flavor. Then comes the drama: geometric swipes of white sanding sugar and dark melted chocolate. The mint flavor will intensify as the cookies sit; make ahead if that’s your thing.IngredientsMakes about 242tsp. baking powder2½cups (320 g) all-purpose flour, plus more for dusting1½tsp. kosher salt, plus more2cups (packed; 45 g) picked mint leaves (do not use stems), patted dry1cup (200 g) granulated sugar1¼cups (2½ sticks) unsalted butter, room temperature1large egg1large egg yolkCoarse white sanding sugar or Swedish pearl sugar (for decorating)1cup (120 g) powdered sugar2Tbsp. (20 g) Dutch-process or unsweetened cocoa powder1Tbsp. light corn syrupSpecial EquipmentA 3\"-diameter cookie cutterPreparationStep 1Whisk baking powder, 2½ cups flour, and 1½ tsp. salt in a medium bowl to combine. Pulse mint and granulated sugar in a food processor until mint is finely chopped. Add butter; process to combine. Add dry ingredients and pulse again to combine. Add egg and egg yolk; pulse until a shaggy dough forms.Step 2Turn out dough onto a lightly floured surface and knead just until dough holds its shape. Divide dough in half; pat each portion into a 1\"-thick disk. Wrap disks in plastic and chill until firm, at least 2 hours.Step 3Place racks in upper and lower thirds of oven; preheat to 350°. Working with 1 disk at a time, roll out dough on a lightly floured sheet of parchment paper to about ¼\" thick, dusting with more flour as needed to keep from sticking. Punch out rounds with lightly floured cookie cutter and arrange on 2 parchment-lined baking sheets, spacing 1\" apart. Pat dough scraps into a 1\"-thick disk. Wrap in plastic and chill 10 minutes if soft. Repeat process with scraps.Step 4Hold a bench scraper or straightedge upright 1\" from edge of a cookie to cordon off a shallow semicircle (do not press down into dough; you’re just making a barrier). Coat semicircle with sanding sugar; gently press to adhere. Remove scraper; you should have a tidy sugared edge. Repeat with remaining cookies and more sanding sugar.Step 5Bake cookies, rotating baking sheets top to bottom and back to front halfway through, until edges are lightly browned, 10–12 minutes. Let cool 10 minutes on baking sheets, then transfer to 2 wire racks set inside 2 rimmed baking sheets; let cool completely.Step 6Sift powdered sugar and cocoa powder into a medium bowl. Add corn syrup, a pinch of salt, and 2 Tbsp. warm water and stir until smooth and glossy.Step 7Position bench scraper to make another shallow semicircle on the other side of the cookie, angling it so that it forms a V with the sugared edge, lightly pressing scraper into cookie to make a barrier. Spoon 1 tsp. glaze onto exposed semicircle and use a toothpick to help coat evenly; excess will drip over sides. Lift scraper straight up and over chocolate side to create a neat edge. Repeat with remaining cookies and glaze. Let sit until glaze is set, at least 2 hours.Step 8Do Ahead: Dough can be made 1 month ahead; freeze. Thaw in refrigerator before using. Cookies can be baked 1 day ahead; store tightly wrapped on a rimmed baking sheet at room temperature.How would you rate Black-and-White-and-Green Cookies?Leave a ReviewTell us what you thinkReviews (61)Back to TopTriangleI made these exactly per the recipe, with very minor exceptions.  I applied sugar evenly and added a bit more water to the chocolate glaze to make it more workable.  I also swapped molasses for the corn syrup since it's what I had on hand.\n\nI gifted these to new parents as a St. Patrick's day gift along with other goodies.  They look EXACTLY like the photo and are light, fluffy and delightful.  I'm not into super sweet cookies and these are excellent.  My local grocery store was out of fresh mint bundles so I bought one of the live mint plants they sold instead, cut the stems a few inches above soil, rinsed and then chopped in the processor.  I suspect some of the reviewers used a different type or mint or had non-fresh sources?  Not sure what went wrong but will definitely make these again.  Took some time but is not hard.  I also drizzled extra chocolate onto them at the end so none of the glaze went tow waste.  Beautiful and refreshing!  I'm typing this as I munch on one of the leftover pieces.  :)PelkLos Angeles, CA3/17/2021Yep. These taste like weed. Was gonna put them in cute little boxes for my neighbors, but I’m afraid they may think I’m trying to drug them. They’re really pretty though!AnonymousMiami, FL12/22/2020Certainly alot of controversy and strong opinions about a simple cookie. Well, not that simple but worth the effort. I love the flavor and visual appeal but if you are looking for an in-your-face peppermint explosion you will not be happy. The flavor is more subtle and herbal. This cookie takes a bit of precision in applying the sanded sugar and the chocolate glaze but nothing too difficult to master. It's a holiday cookie!  I did make a few adjustments after reading the reviews. 1).  Added 1/4 cup sugar to the dough 2). I used a scale to measure the 45 grams of mint leaves. Very important as a bunch of mint leaves can vary greatly in weight and will have an impact on flavor. I did add 1/2 teaspoon of peppermint oil to the batter and a small drop to the chocolate glaze. This boosted the peppermint flavor a bit but didn't overpower herby flavor from the mint leaves. 3). I left out the salt. Other then that I followed a well written recipe (Thanks Rick) with excellent results. Oh...I did use the bench scraper (if you don't have one get one now...a very versatile tool) to apply the sugar and the glaze. I was a bit skeptical but it worked great. Be sure to hold the scraper at a 90 degree angle to the cookie and pull up at a bit of an angle to get a clean edgeNinaNorthport, NY12/21/2020Damn you other commenters are haters! I was halfway through making this recipe before reading the reviews and got very concerned, but these turned out great and I love the taste! I guess if you're expecting a typical artificial/sweet mint flavor you'd be thrown off, but I absolutely love the fresh mint in here and it plays really well with both the sugar crystals and chocolate. This recipe is definitely a project, but the cookies look so pretty and impressive that I think it's worth it. A couple of notes from my experience: 1) If you're doubling the recipe like I did, not all the dough ingredients will fit nicely in your food processor and mix properly, so I'd suggest making the dough in two distinct batches. 2) The dough texture was not at all like described and was much gooier like other commenters noted. I was worried I messed up the proportions but it may have just been because the butter got too soft? After an overnight refrigeration, the dough was rock hard and had to rest for about half an hour before I was able to roll it out. 3) Decorations-wise, I found the bench scraper system to be too unwieldy for the sugar and chocolate process, so I just free-handed it and it was much easier and I still got a pretty straight line. I had to brush a little water onto each cookie for the sugar to stick to it. Also, do not try to apply either the sugar or the chocolate right on the baking sheet! Decorate them over a separate plate or bowl and let the excess drip off before placing them on the baking sheet/rack. 4) Don't worry if you don't have a 3\" cookie cutter. I used a cocktail glass and dipped the rim in flour for each cookie and had no issues.SoapnanaChicago, IL12/14/2020Let me start by saying this is not a sweet cookie if you follow the recipe exactly.  I am beginning to like it more after some modifications, but I don't love it yet.  First a note about the dough: it was probably the wettest dough I've tried to work with and was a gooey mess coming out of the processor.  When kneading it, we continually added flour and worked it in to make the dough a little drier.  If I make these again, I will definitely add more flour to the food processor than what the recipe calls for.  Now about the taste: I used about a bunch and a half of fresh mint leaves from the grocery store and this worked out to the 45 grams, and I think this is the right amount.  The mint comes through nicely, but I also find the first bite grassy/herby/plant-like.  The more you eat of the cookie, though, the less noticeable the grassy taste becomes.  I made my first batch of 12 and started to decorate them as the recipe recommends, but I guess my family just likes a sweeter cookie.  I ditched the recommended approach of creating sections of sugar and frosting and covered the entire cookie with white sugar before baking (instead of the one-third of the area) and put a light layer of chocolate frosting on the entire surface of the cookie.  The extra sweetness made it more palatable for our tastes.   Also, I added a little bit more water to the frosting than what the recipe called for to make it easier to work with.  The fresh mint flavor stays with you and leaves a pleasant taste in your mouth long after you've had your last bite.  Overall, I had to make some changes to the recipe to make it sweeter.  I would make these again, but with my modifications to make them sweeter. Steve CChicago, IL12/14/2020Might as well rename these cookies Grinch Droppings because that’s what they taste like. I don’t know where to start — the grassy flavor (grazing on our lawn would have been more enjoyable than eating these) or the gooey dough that stuck to everything it touched. Mint and chocolate is a classic combo, but this recipe has managed to produce a flavor combination that reminds one of pesto and chocolate syrup. These cookies turned a treasured Christmas time tradition into a full blown culinary panic attack, as we were so confused as to what we were doing wrong. Turns out we weren’t doing anything wrong. These cookies just suck.AnonymousBerkeley, CA12/13/2020These cookies are controversial and the reviews here reflect that. Personally, I LOVED them. I'm not a baker but I gave the recipe a try and they looked just like the picture! The flavor is a very fresh natural mint and this is, I think, what causes them to be so divisive. \"Sweet\" and \"mint\" is an unusual flavor combo and not everyone has a palate ready to mix those two things. My guess is that if you like more savory flavors or are open minded about encountering flavors in new ways then you'll love these cookies. I had probably ten different people try them, three loved them and seven hated them. But it doesn't matter because I really, really loved them and I'm making them again this year!KirstenAnaheim, CA12/11/2020These cookies turned out absolutely delicious. I used Chocolate Mint fresh from the garden. A full two cups created an absolutely light but punchy mint flavor. The color was perfect. I didn’t bother to put the chocolate on because we liked the cookie so much on its own. I really don’t know why others had such a hard time. Their mint may not have been strong enough. Our Peppermint that we grow at our farm has a more skunky flavor than our Chocolate Mint variety. \n10/10 will make this cookie again forever. Stephanie L.Utah 5/29/2020So I had this recipe on my mind for a long time because the cookies just looked SO GOOD. So I finally made them the other day, and I can say for a fact that these are not good at all. I got the right color and everything and they just weren't that good for many reasons. The main reason being that the flavors don't work that well together. Its a weird journey of tasting chocolate, to subtle mint, to a weird salty after taste. I had a great time making them but they were just awful. The cookies are now just sitting in my compost bin. George BWashington Dc 5/20/2020These cookies were a hit!, easy to prepare and fun!!RagoliMÉXICO5/18/2020Do not taste like weed, taste like mint so if you like mint desserts you will like. We made sure to use the right amount of fresh mint and think that was a major contributing factor to our success. Would make again but not going to add to my Christmas cookie repertoire.AnonymousChicago1/8/2020Loved these! Super quick dough, easy to work with, and the decorations were fairly simple but made them look fantastic. The mint flavour was great and they weren’t too sweet. Only issue: you’d probably need 2 or 3 bunches of mint from the store to hit the recipe amount. I used maybe 1/2 that plus some dried mint and it still tasted great! Anonymous1/5/2020I saw these pretty cookies and thought I had to give them a try regardless of all the negative reviews. If you are expecting a thin mint or candy-cane tasting mint flavour, you are bound to be disappointed, as fresh mint is much more subtle, light, and herbal than the typical \"mint flavour\" you would expect from most baked goods. Yes, these were fairly labour intensive but not ridiculously so like a lot of other commenters are stating and I'm not even much of a baker. I was pleasantly surprised by the end result - they turned a beautiful colour, the texture was lovely, and the subtle mint flavour was really tasty. I was worried these wouldn't be sweet enough, but the coarse sugar and chocolate glaze made up for what the cookie itself was lacking. These definitely aren't your typical rich, sweet, and *absolutely delicious* Christmas cookie, but honestly I thought they were a nice break from the heavy treats I'd been eating this holiday season. With patience and the right expectations, this recipe is definitely worth a try if you're considering it. They were nice and I enjoyed them, but will they become a part of my regular Christmas-baking-arsenal? Probably not. emmahumeKingston, Canada12/31/2019The cookie equivalent of \"Cats.\" \"Cats\" almost ruined movies for me, and these cookies made me want to give up on baked goods forever. There are seven of us in this family who agree. Other than that, our vacation was fine, thanks for asking.AnonymousCalifornia12/28/2019This was pretty good! My only warnings would be that the dough is soft and a bit sticky, so you may need to put some or all of it in the fridge after rolling it out for a bit, and that melted chocolate with butter is a way better glaze option. It is definitely more herbal than thin mint, it's almost mojito-ish, super refreshing. I enjoyed it AnonymousPennsylvania12/27/2019Explore Bon AppétitCookieDessertAmericanMintHerbs & SpicesSnackNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Rick Martinez"]}