{"id": "d9efcbee662930499ffc16269d8bc0f9", "url": "https://www.bonappetit.com/story/i-never-peel-my-ginger", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Do you HAVE to Peel Ginger? This Recipe Developer Doesn't Think So | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Never Peel My Ginger—And I'm a Recipe DeveloperYup. I've told you to do it dozens of times. But in my own kitchen, I just can't be bothered.By Molly BazNovember 7, 2018FacebookTwitterEmailFacebookTwitterEmailI’m just gonna come right out and say it: I don’t peel ginger at home, and I’m sure as hell not about to start. If you look at almost any recipe on our site or in the mag (save this one), you’ll notice that fresh ginger is pretty much always called for in peeled form. I’ve developed dozens of recipes to date that call for peeling ginger (always with a spoon) before grating, slicing, or chopping it. I did so because that’s more or less the protocol around these parts, and because I was trained in professional kitchens and it’s just what you do. But when I’m cooking for myself, my husband, or my friends, those self-imposed rules become flex...extremely flex.I currently work alongside some very opinionated Bon Appétit Test Kitchen editors, so trust me when I say that outing myself on this matter doesn’t come easily or without risk. I certainly won’t be surprised when senior food editor Chris Morocco reads this article and comes over to my station in a quiet, bewildered fury to question my antics. But I just turned 30, which apparently means I'm a full-on adult, and part of being an adult is being honest with yourself and steadfast in your convictions (or whatever). So to all the skeptics out there (still lookin’ at you Morrocco), here are all the reasons why I do not and will not peel my ginger:1. I have noticed little to no perceptible flavor difference between peeled and unpeeled ginger.2. Peeling ginger in an effective and waste-free manner—i.e., taking the time to get around all those little knobby bits instead of ripping them off and throwing them away when nobody is looking—takes a whole lot of time, and who has a surplus of that?3. I've never heard anyone say anything about ginger skin being \"bad for you,\" and I’d venture to say the skin likely contains some nutrients that are otherwise going to waste.4. If you're really worried about it, any dirt or bacteria on the outside of a piece of ginger can be easily removed with a scrub brush and some good ol' water.Peeling ginger is the most annoying thing about making these delicious Ginger Scallion Ramen Noodles. Don't even bother!\nPhoto by Alex Lau, Styling by Andy BaraghaniThere is one—and only one—scenario in which I endorse peeling ginger, and that is when you happen upon a piece that’s been in the bottom of your crisper for two months, and the skin has turned sad and wrinkly, but it’s literally all you have to lean on to enhance your meal. I get it; I’ve been there. This is a moment when consuming the ginger peel may in fact leave something to be desired—it’ll be tough and fibrous and has probably taken on a whole bunch of nasty fridge flavors. If that's the case, lose the peel. A last word of advice: if the ginger at the supermarket looks like it does in the aforementioned scenario, skip it. That sad, stanky old ginger isn’t doing anything for anybody.Feel liberated? How about some salmon with a gingery miso sauce?Crispy-Skin Salmon with Miso-Honey SauceQuick cooking, not-too-expensive, and super satisfying, salmon fillets are a weeknight dinner slam dunk—and our go-to method for making them is pretty much un-mess-up-able.View RecipeExplore Bon AppétitGingerBasicallyHacksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-07", "author": ["Condé Nast", "Molly Baz"]}