{"id": "d9f55bd876ccc7664e86ea4e0ef67634", "url": "https://www.bonappetit.com/story/floral-extracts", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "Floral Extracts are Powerful Tools, If Used Responsibly | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFloral Extracts Are Powerful Tools, If Used ResponsiblyA little goes a long way.By Antara SinhaJanuary 18, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.From delicately perfumed treats like Apple-Rose Pie to aromatic tachin, floral extracts—namely rose water and orange blossom water—add a luxurious, delicate, distinctive fragrance to desserts, baked goods, and even savory dishes. While they may be intimidating to work with (it’s never pleasant when your food veers into soapy territory), they’re incredibly versatile and, if handled with care, easy to incorporate into your baking and cooking. With a slight hand and a few tips and tricks, you can keep your dishes fragrant, floral, and not perfumey.What are floral extracts?Commonly used in South Asian and Middle Eastern cooking—though you’ll find them in cuisines across the world—floral extracts (most commonly, orange blossom water and rose water) are made from boiling flower petals and distilling the steam into a concentrated essence. It’s potent, heady stuff; there’s a reason it’s also commonly used in perfumes.Orange blossom water does have a mild citrusy scent, but it’s less punchy and direct than orange zest or juice. Made from the flower petals rather than the fruit itself, you’ll get sweet notes of jasmine, a mild bitterness, and an overall more herbaceous aroma. Rose water smells like, well, a bouquet of roses. Rich, sweet, and familiar, a little goes a long way.Cortas Orange Blossom Water$8 at AmazonThe Spice House Orange Blossom Water$11 at The Spice HouseHow do you use floral extracts?This is the fun part: Floral extracts taste delicious in a wide range of applications, so experimenting with them is a low-risk way to add a little extra something to your cooking when you’re trying to impress.“It’s more luxe than anything else,” says associate food editor Zaynab Issa. “You can add a little bit and it feels special.” Her favorite way to use floral extracts is in sweet, bright, fruity treats—she’ll add a few drops to a frozen watermelon granita in the summertime.Add it to homemade jam, fold it into whipped cream to serve with fresh fruit, or mix it into a simple buttercream for the next cake you bake. Blend it into a refreshing agua fresca, add a drop or two to a cocktail, or incorporate it into cookies, crisps, pies, or pastries. All are good candidates for some floral fun.Strawberries are a natural companion to rose water in this agua fresca.\nPhoto by Alex Lau, food styling by Rebecca JurkevichFor savory applications, orange blossom water and rose water play nicely with light, bright, herby, and citrusy accompaniments. Add a couple drops to a pot of steamed rice, lemony dips and sauces, citrusy salad, or to the marinade for a roasted fish, like this Black Bass with Orange Flower Water.Unlike adding fresh herbs or other aromatics that can turn bitter or lose their flavor after cooking, floral extracts aren’t quite as heat-sensitive, so they’ll hold up no matter what stage or step of cooking you add them in.Issa’s number one piece of advice: Go slow. Start with a drop before adding more, and when possible, dilute it before incorporating it directly into your cooking. Instead of shaking a bottle of rose water over your sweet treats—an easy way to accidentally overdo it—first mix it into a “solvent,” as Issa describes it. For example, add rose water to a simple syrup to soak your jalebi, or use it to dissolve other spices, like saffron in this Pistachio Almond Brittle. While other flavorings such as vanilla extract or rum can take a more mellow backseat even if you add an extra splash or two, floral extracts will be the first thing you smell when you take a bite.“There’s a fine line between nice accessory and overpowering showman,” says Issa. Better to start with a little and work your way up by taste and personal preference.Where can I buy floral extracts?Look for rose water and orange blossom water in tall, glass bottles at Middle Eastern and South Asian grocery stores—though your supermarket may also stock a few varieties in their spice section or international aisle. They’re also easy to track down online—just make sure you’re purchasing floral extracts specifically made for culinary and not cosmetic purposes. We’re fans of brands like Stories + Objects that make limited batches of artisanal rose water from Iran and are worth the splurge, but if you’re on the hunt for a relatively inexpensive alternative, brands like Al Wadi and Cortas are reliable and worth seeking out.Al Wadi Rose Water$14 at Amazon$7 at Snuk FoodsThe Spice House Rose Water$11 at The Spice HouseGet the recipeJalebiIt only takes a handful of ingredients to bring this dazzling South Asian snack to life in your kitchen. These particular jalebi strike the perfect balance between crispy, chewy, and sweet.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-18", "author": ["Condé Nast", "Antara Sinha"]}