{"id": "d9fd466b85e3cf9fc1564cbc8ebed6df", "url": "https://www.bonappetit.com/story/food-facts-team-usa-winter-olympians", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "Fun Facts: Team USA's Winter Olympians Really Love Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAll of the Quirky Food Facts We Learned About Team USA's Winter OlympiansAll of the adorable and intriguing food facts from the 2018 Olympian profiles.By Maggie LangeFebruary 6, 2018FacebookTwitterEmailALEXIS BOICHARD/GETTYFacebookTwitterEmailIf you love a quick origin story, you can find easy satisfaction come Olympic season. Astounding physical feats are accompanied by all sorts of narratives about dedication, obstacles, prowess, virtuosity. The Team U.S.A. website is a solid compendium of origin stories; it’s basically a series of digital baseball cards with all the stats and facts you could possibly want. When I was snooping around the profiles to prepare myself for the Pyeongchang Winter Games, I found one powerful through-line: The Olympians are hungry.Fierce Maame Biney.\nHarry How/GettyThe first profile that intrigued me was of speed skater Maame Biney from Reston, Virginia. She was told she was going “too fast” to be a figure skater, so she went too fast by trade. Biney is uncompromising! She will not change her talents for the sport! She will change the sport for her talents! I became a fan. Then, I became a disciple when I read her answer to the boilerplate question about her favorite food. She responded: “any type of meat.” TEAM ANY TYPE OF MEAT! Flexible, yet demanding. Ravenous, carnivorous. This answer manages to be both deeply unspecific, but also, it really tells us so much.Speed skater Thomas Hong in the lead, clearly motivated by his passion for food.\nHarry How/GettyThe “favorite food…” question, I found, seems to function as a type of tea-leaf reading into Olympian psyches. Some use it to show the self-control and sacrifice required to be the very best. As 21-year-old speed skater Aaron Tran put it, he loves doughnuts and Oreos, “but he sadly can’t eat them very much or else coaches will get upset.” Thomas Hong, a speed skater who has been pursuing culinary studies when not being an athlete, took space in his Olympic profile to make clear that he loves ramen and “does not like cucumbers in any form.” Very much understood. His exacting scruples will certainly serve him well as he continues to excel at whatever he does.Just trust us, that's Codie Bascue in there.\nAlexander Hassenstein/GettyOthers divulge the secrets to their elite physiques. Bobsledder Codie Bascue shared that “he has more supplements in his closet than clothes.” He also gave a shout out to “Five Guys.” Five guys, is unfortunately, just one guy over the regulation number for guys in a bobsled, but great to learn Codie can leave the rules behind when he’s off the track.If you can't tell from this photo, Hannah Teter makes her own maple syrup.\nDaniel Milchev/GettyMostly, the Olympians seem to crave the wholesome tastes the world has to offer: biathlete Maddie Phaneuf just wants a home cooked meal, speed-skater Jerica Tandiman insists on fresh mango off of a tree, and bobsled-competitor Matt Antoine used his profile to make a strong claim about campfire coffee. One Olympian, Hannah Teter from Lake Tahoe, makes her own maple syrup, and alpine skier Ryan Cochran (pictured at the top of this story) works at his family’s maple syrup store. These are details of virtuous, go-getters, self-reliance and outdoorsy wherewithal. There’s a lot to admire in this consistency. They will be very good at surviving in the snow, forever.Emily  Dreissigacker: Likes cake.\nStanko Gruden/Agence Zoom/GettyAfter sports, presumably, food is a top thought and top ambition. Disproportionately, the most desired job, post-Olympics is to be a chef or go to culinary school. One biathlete wants to “have a cake bakery!” I believe, for one, if you are in the Olympics you can really do anything else you want to do! Can’t wait to patronize this cake shop in your future, second-generation Olympian Emily Dreissigacker. So many Olympians this year—at least twelve!—listed cooking or baking as one of their favorite extracurricular activities. I suspect this is because they are expending an outrageous amount of calories, they must spend their timing trying to fix this deficit. As alpine skier Megan McJames put it, she loves to be “relaxing in the kitchen.” I wish this for all the athletes in their time of repose: a nap by a snack, rest and replenishment.Morgan Schild, food hobbyist.\nClive RoseI was particularly interested in this hobby list from freestyle skier, Morgan Schild: “Hobbies include eating, biking, and playing soccer and softball.” It’s not unusual— yet it’s still astounding for me, a non-professional athlete—that the hobbies of professional athletes include other forms of competitive movement. But the star player here, hobby #1, is “eating”. What a bold categorization. Not as necessity, but rather as a leisure pursuit worthy of devotion. We could all perhaps, frame our hobbies in such a way. And what are the Olympics for, if not to inspire with the power of the human form and action?A baked good that deserves a gold medal:Explore Bon AppétitTrends + NewsPeopleOlympicsRead MorecultureGabby Douglas Can’t Wait to Have Pizza After the Olympics Are OverBy Alex BeggscultureOlympic Rower Seth Weil Eats Whatever the Hell He WantsBy Alex BeggscultureSo Much Yogurt: What Athletes in the Olympic Village Will Be EatingBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-06", "author": ["Condé Nast", "Maggie Lange"]}