{"id": "da116d816b597a38ee68b7c086f8b151", "url": "https://www.bonappetit.com/story/summer-bean-salad-tomato-vinaigrette", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Summer Bean Salad Proves that Beans Aren’t Just for Winter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSummery Bean Salad: Because Brothy Beans Aren’t Only for WinterFor all us grumps who are already a little (just a little!) ready for fall.By Sarah JampelAugust 22, 2018FacebookTwitterEmailMarcus NilssonFacebookTwitterEmailMy mom always told me not to wish time away...but now’s the time of the year when I’m sorta kinda secretly ready (don't tell!) for fall to begin. It’s terrible, I know!I don’t want tomatoes or peaches or any of my other market buds to go away (please don’t leave me!); I just want the nights to be chilly enough that I can eat warm, cozy foods—grant me stewy beans!—without having to wear a sweat band.But, right as I was getting especially ungrateful, this summery mixed bean salad solved the issue—and put me back in my place. Summer, I still love you.This bean salad (from Gabriela Cámara at Contramar) is essentially brothy beans—exactly what I think about when I think of wool socks-level comfort food—but instead of swimming in a rich, creamy sauce, they’re marinated in pico de gallo made from puréeing fresh tomatoes with onion, serrano chile, cilantro, and lime juice—your favorite chip dip in salad dressing form.And while canned beans will serve you well here (think black, cannellini, navy, kidney, or even garbanzo), you could also use fresh shell beans (like cranberry, butter, or scarlet runner beans) from the farmers market. Dried and canned beans may be year-round, dead-of-winter food, but the fresh ones are à la moment, which is reason enough to eat them by the bowlful.Cook your fresh beans (or drain your canned ones), then toss with olive oil and let them sit in the pico de gallo vinaigrette to absorb all of its tomato-y sweetness and chile heat. Add sliced snap beans (which will offer the crunchy complement to the creamy cooked beans) and chia seeds, which will thicken the dressing (sounds wackadoo, but trust!). And in true great recipe nature, this salad is make-aheadable, too. Assemble it at least one hour (or up to a day) before you’re ready to eat it.Here we have a photo of my soul.\nPeden + MunkIt’s like your favorite bean and tomato soup finally changed into its summer clothes. Refreshing enough to feel like August, but rich and satisfying enough to be a reminder that fall isn't so far away, after all. (Whether that scares or excites you is your call).Get the recipe:Mixed Bean Salad with Tomato VinaigretteView RecipeExplore Bon AppétitCannellini BeanBeanSaladSummer SidesRead MorecookingMatrimony Beans Are Keeping Me Afloat This Rent Week (and Wedding Season)By Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-21", "author": ["Condé Nast", "Sarah Jampel"]}