{"id": "da211e50588b130745699c6d2916beef", "url": "https://www.bonappetit.com/story/summer-beer-styles", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "The 5 Summer Beers We’re Drinking Alllll Summer Long  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 5 Styles of Beer That Will Get You Through a Hot, Hot SummerFrom goses to farmhouse ales, your cookout is looking for something more exciting this summer.By Alex DelanyJune 19, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailNot all beer is summer beer. Sure, we don't want some heavy, sticky stout when the sun is at high noon. Duh. But when we’re organizing cookouts around perfectly-glazed meats and smoky, charred vegetables, we want a summer beer to match. The game day lagers aren’t going to do.So what makes for good summer beer? It isn’t just one thing. It’s the entire summer feeling, packed into a cool glass. It’s the smell of freshly cut grass, the sound of a marinade sizzling on a ripping hot grill, and the feeling of splashing water cooling baked cement. Summer beer is the slide of a screen door and the “Dinner time!” yell that follows it. These are the five styles of beer that will get you to that state of pure summer relaxation:American PilsnerThanks to our beer-loving friends in the Czech Republic, we’ve been drinking pilsner for well over a hundred years. And the Champagne of Beers? Yeah, that’s a pilsner. It’s a common style, a lager brewed with pilsner malt, but American brewers are pushing the pilsner away from watery suds of frat parties past  and embracing the flavors of zingy hops and soft, toasty malt. A local pilsner is the stepping stone for the craft beer newcomer, something familiar and refreshing at the same time.We Love: Suarez Family Brewery Palatine Pils, Victory Brewing Prima Pilsner, Threes Brewing Vliet, Firestone Walker Pivo Pils, and pFriem Family Brewers PilsnerPhoto by Alex LauBerliner WeisseVinyl lounge chairs. Lifeguards twirling whistles. And hot dogs from the snack bar. Berliner weisse is an afternoon at a suburban swim club. This German wheat ale is gently tart, chug-able, and very open to the addition of fruit (although we’ll gladly drink Berliner weisse without it). Brewers love throwing tropical fruits like mango, passionfruit, or lychee into Berliner weisse, which welcomes a little sweetness to balance out that tang. Get ready to experience lemonade stand flashbacks.We Love: Creature Comforts Athena, The Referend Bier Blendery Berliner Messe, J. Wakefield Brewing Miami Madness, and Perennial Artisan Ales Peach Berliner WeissPhoto by Alex LauGoseIf Berliner weisse is a day at the swim club, a gose (goes-uh) is a day at the beach. Brewed with salt (seriously) and coriander, this low-ABV German style is summer’s ultimate food beer. It’s light and refreshing in the lip-smacking, get-this-rib-sauce-off-my-face type of way, something like a spray of cold ocean water. We wouldn’t recommend eating ribs on the beach though. Too much sand. Too much sauce. Stick with with the gose, at least until you get home.We Love: Lost Nation Gose, De Garde Hose, Westbrook Gose, Grimm Artisanal Ales Super Spruce, and Sierra Nevada Otra VezPhoto by Alex LauNew England Style IPAIPAs aren’t about bitterness anymore. Gone are the days of syrupy-sweet, hangover-inducing hop bombs. We live in a new era now, one filled with aromatic, fruit-forward, drink-on-repeat IPAs, beers that taste and smell like boozy fruit salad. The new-school IPA exploits the fruity flavors in hops, instead of their bitterness, and they look completely different too. These IPAs are unfiltered, which means they’re cloudy, looking something like orange juice. We’ll take an unfiltered IPA over a mimosa any day.We Love: Mikkeller San Diego Windy Hill, Triple Crossing All Neon Like, Fieldwork Brewing Pulp, Hill Farmstead Susan, and Narrow Gauge Fallen FlagPhoto by Alex LauFarmhouse AleThere’s no real definition for a farmhouse ale. Sorry. Sometimes they’ll be called saisons and other times wild ales. But the common thread is the place they evoke. Farmhouse ales are yeast-driven ales that take root from beers historically brewed on Belgian farms. They taste like fresh baked bread and hay, with melon-y undertones of barnyard funk. Where the pilsner is a pristine example of simplicity, the farmhouse ale is an artful showcase of thought-provoking flavor. Not to fall into cliches...but these are the beers that will change you.We Love: Brewery Bhavana Till, Allagash Little Brett, Side Project Biere du Pays, Our Mutual Friend Saison Trystero and Holy Mountain WitchfinderWant to know what the deal is with IPAs? Here ya go:10 Styles of IPA to Know Before Your Next Round of BeersOnce you know the difference in IPAs, you can find your IPA soulmate.View StoryExplore Bon AppétitBeerAlcohol & Other DrinksSummer DrinksGrillCookoutRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-19", "author": ["Condé Nast", "Alex Delany"]}