{"id": "da3139b4b35afe6d6bc6c6918bbcea1b", "url": "https://www.bonappetit.com/story/healthy-vegetable-dips", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Healthy Dips You Can Make with Basically Any Vegetable | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHealthy Dips You Can Make with Basically Any VegetableYour Super Bowl snack plan is here.By Anna StockwellJanuary 28, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Kat Boytsova, Prop Styling by Emily EisenFacebookTwitterEmailSuper Bowl Sunday definitely doesn't need to be a day for healthy eating, but we can still add a few more veggies to the spread. The best place to sneak them in? A couple healthy dips. There's a lot to love about this easy roasted vegetable dip recipe: the caramelized roasted vegetables, the way you can customize it to your heart's content, and how it takes on the color of whatever vegetable you choose (try purple cauliflower for a Pantone color-of-the-year-approved look). Got leftover roasted vegetables in the fridge? Now's the time to use them up. Or, roast something special just for this. Here's how to make it all work.Butternut squash and leeks dip\nPhoto by Alex Lau, Styling by Kat BoytsovaWhen deciding what to roast, I like to stick with a single vegetable, plus a bit of onion, garlic, shallot, or leek roasted alongside for added depth and sweetness. My favorite combos right now are beets and garlic, butternut squash and leeks, and cauliflower and onion. But you can also use a blend of different kinds of roasted vegetables—carrots and sweet potatoes are also great team players, for example—and they can all be tossed in your favorite oil and seasoned simply with salt and pepper or any mix of spices and herbs.Roasted beet and garlic dip\nPhoto by Alex Lau, Styling by Kat BoytsovaMake sure to let your roasted vegetables cool completely before you start turning them into dip, then measure out 2 cups of the vegetables and transfer to the jar of a blender or your food processor (the more powerful your blender is, the smoother your dip will be). Add 1 cup of full-fat plain Greek-style yogurt, ¼ cup of lemon juice, and 2 tablespoons of tahini. You’re going to need to add some water too to get the dip to a nice dippable consistency. Start with 2 tablespoons of water, then start blending or processing, scraping down the sides of the jar a couple times, and continuing to blend until smooth. If the dip seems too thick or isn't blending well, add more water, one tablespoon at a time, until your desired consistency is reached, scraping down the sides of the blender between additions. Once it's nice a smooth, blend in 1 tablespoon of extra virgin olive oil, then taste it. Season your dip with salt and pepper, and you're ready to party.Cauliflower and onion dip\nPhoto by Alex Lau, Styling by Kat BoytsovaI like to spoon the dip into a serving bowl, swirl the top smooth, then top it off with a drizzle of olive oil, some chopped fresh herbs, or some crushed red pepper flakes. To make it really look festive, make a few dips with different vegetables (and colors!). You can dip anything you want in these—from crunchy romaine leaves to cucumbers to, sure, potato chips. And you'll still have room for a few  extra crispy baked wings.Explore Bon AppétitHealthyishSuper BowlDipCrudite DipRoasted VegetablesVegetableRead Morerecipes75 Healthyish Super Bowl RecipesGallery75 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-28", "author": ["Condé Nast", "Anna Stockwell"]}