{"id": "da3646b061c43b66c6c3a347dc1695db", "url": "https://www.bonappetit.com/recipe/eye-of-round-roast-au-jus", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "Eye of Round Roast with Jus Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesEye of Round Roast with JusBy Amiel StanekDecember 16, 20214.0(10)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintIn the world of beef roasts, eye of round is often overshadowed by supremely marbled prime rib and melt-in-your-mouth tenderloin. But what it lacks in richness and delicacy it makes up for in affordability and superior beefy flavor. Treat it lovingly with an overnight dry brine to season it throughout, then cook it patiently and gently and you’ll be rewarded with a meaty centerpiece that feels company-worthy without breaking the bank. However, if rare to medium-rare meat isn’t your bag, this probably isn’t the recipe for you. Eye of round doesn't have a lot of intramuscular fat to keep the whole thing moist, so it really needs to be rosy throughout in order to be its most succulent self. If you’ve got a leave-in probe thermometer, this is the time to use it. The less times you have to open the oven to check the internal temperature, the better.The accompanying jus takes a bit of effort as well as another pound of meat, but it adds tons of rich beef flavor and comes together while the roast cooks. Bonus: After you’ve strained the jus, you’ll be left with nuggets of fork-tender chuck ready to be turned into a quick hash, soup, or fried rice later in the week. But if it all still feels like too much, a simple horseradish-sour cream sauce or Dijon mustard mixed with mayo would also make a delicious accompaniment for the meat—no harm, no foul. —Amiel StanekAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonSpice Grinder$45 At Kitchen AidInstant-Read Thermometer$35 At ThermoworksCutting Board$10 At IKEAMedium Saucepan$39 At AmazonMesh Sieve$13 At AmazonIngredients6–8 servings2tsp. black peppercorns2tsp. fennel seeds12½–3-lb. eye of round roast, trimmedKosher salt2Tbsp. vegetable oil, divided1lb. chuck stew meat, cut into 1\" cubes1medium red onion, sliced6oz. crimini or button mushrooms, sliced3garlic cloves, smashed2Tbsp. double-concentrated tomato paste1Tbsp. plus 1½ tsp. Worcestershire sauce1Tbsp. soy sauce1tsp. (or more) sherry vinegar or red wine vinegarFlaky sea saltFreshly ground black pepperSpecial equipmentA spice mill or mortar and pestlePreparationStep 1Coarsely grind peppercorns and fennel seeds in a spice mill or with a mortar and pestle. Using generous three-finger pinches, season roast on all sides with kosher salt—seriously, don’t hold back, you should see salt on nearly every surface. Rub peppercorn mixture all over roast, then place on a wire rack set inside a rimmed baking sheet. Chill, uncovered, at least 12 hours and up to 2 days.Step 2Let roast sit at room temperature 30 minutes before baking.Step 3Preheat oven to 250°. Bake roast (still on rack set inside baking sheet) until an instant-read thermometer inserted into the thickest part registers 110°, 1½–2 hours.Step 4Meanwhile, heat 1 Tbsp. oil in a medium saucepan over medium. Working in 2 batches, cook stew meat, turning occasionally, until well browned on all sides, 6–8 minutes per batch. Transfer to a plate.Step 5Place onion in same saucepan, season with kosher salt, and cook, stirring occasionally, until onion is translucent and starting to brown, 6–8 minutes. Add mushrooms, increase heat to medium-high and continue to cook, stirring occasionally, until mushrooms are softened and most liquid has cooked off, about 5 minutes. Add garlic, tomato paste, Worcestershire sauce, and soy sauce and cook, stirring often, until mixture browns and begins to stick to bottom of pan, 2–3 minutes.Step 6Return stew meat to pan and add 6 cups water. Increase heat to high and bring to a boil. Reduce heat to medium-low (you want a good bubble going) and simmer, uncovered, until jus is reduced by two thirds, about 1½ hours.Step 7Using a fine-mesh sieve, strain jus into a small bowl, pressing on solids to expel as much liquid as possible, then return jus to pot (you should have 1½–2 cups). You can save the meaty, oniony solids if you’d like; it makes a great hash. Add vinegar to jus; taste and season with more kosher salt and vinegar if needed. (Be generous: The jus should taste rich and highly seasoned.) Cover jus and let sit until ready to serve roast.Step 8Remove roast from oven. Heat remaining 1 Tbsp. oil in a large heavy skillet, preferably cast-iron, over high until just beginning to smoke. Cook roast, turning occasionally using tongs, until deeply-browned all over, about 5 minutes total. Transfer roast to a cutting board and let rest 10 minutes (the final internal temperature should be around 120° for medium-rare).Step 9Meanwhile, reheat jus over medium-low. Thinly slice roast straight across against the grain and transfer slices to a platter. Sprinkle with sea salt and ground pepper. Pour about a third of jus over roast. Serve remaining jus on the side.Do ahead: Jus can be made 2 days ahead. Reheat over medium-low before serving.How would you rate Eye of Round Roast with Jus?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI admit, it looks delicious but seriously, All of those ingredients?  Wouldn't even begin to try it.  Sorry!Kacee ConklinNashville, TN2/17/2022I don't add all these spices.  Eye of Round has its own wonderful taste and doesn't need all this\nenhancement. I use salt, pepper, and garlic powder. I  weight the roast.   I usually make a 3 lb. roast:\n10 min per lb; therefore, 30 min. total.\nI put it in the MICROWAVE.   First side 5 min on HIGH, then 10 min; on MEDIUM.\nTurn over.\n15 minutes on 5.\n\nWonderful for meal and grreat for sandwiches.\nCharlottePalm Desert,CA1/29/2022Wow--two pieces of meat, one from each end of the animal, each needing entirely different methods to get the best out of them.  Well now!  \n\nI have twenty ways to do chuck, but until today, I only had one way to cook eye round.  I'm glad to find this recipe.  I love that this is low heat, so that it's easier to hit that med-rare temp .  I also love that the browning happens in a skillet at the end--something I can watch and control easily.\n\nI find eye round to be challenging, temperamental, difficult to cook juuuust right.  And that's what it must to be: medium rare, full stop.  Underdone by 5 degrees, it can feel like eating a raw animal, a tartare, not at all flavorful.  Overdone by 5 degrees, you have inedible shoe leather.    \n\nOne bit of advice:  let the eye round roast rest longer, if you can.  It benefits from really thin slicing, which is easier when it is cooler.  Betty Rubble0173012/21/2021Can this be done by revere searing after soul vide?Dave POswego, Illinois12/20/2021Explore Bon AppétitDinnerMainBeefMeatRoastChristmasDairy-FreeNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-16", "author": ["Condé Nast", "Amiel Stanek"]}