{"id": "da3af7e322b350dcbd4f9ad73c54c3c6", "url": "https://www.bonappetit.com/story/pueblo-pinon-incense-burner", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "This Little Incense Burner Makes My Kitchen Smell Better and My Heart Fuller | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Little Incense Burner Makes My Kitchen Smell Better and My Heart FullerAnd it brings me back to the Southwest.By Bryan FountainJuly 16, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I cook at home at least four or five nights a week. Usually, three of those nights I manage to smoke out my apartment while searing a steak or pork chop in a cast-iron skillet—to the dismay of my vegetarian partner. So, after opening up my kitchen window and turning on the vent hood fan, I like to mask the smell.Scented room sprays, in my humble opinion, smell worse than the charred bits of meat. Our solution? Earthy pinon incense wafting out of a charming, Altoid-tin-size pueblo dwelling. Pinon is a sugar-cube-shaped brick of incense made from dried out and compressed pine needles. These pines are specific to the southwest region of New Mexico, and—fun fact—are the species that produce pine nuts. When burned, the room fills with a woodsy aroma that replaces the leftover burnt smoke and refreshes my entire apartment.Though I love the pinon, it was the quirky packaging that stood out to me when I found this incense burner at a tourist trading post outside of Flagstaff, Arizona. The design, by Incienso de Santa Fe, is a nod to the folk art style of the region, with its red-rock color and protruding wood beams. It reminds me of the small collectible Christmas villages my mother busts out around the holidays, though this is free of glitter and nutcrackers.I keep my little pueblo on a shelf in my living room to display my beloved souvenir as well as to easily grab when the bad smells come back. Even if I’m not cooking, I love bringing it out and watching the smoke come out the mini chimney. The plumes rise towards the ceiling and I get lost in it.And since these incense burners are so affordable (under $13!), my eyes are already set on the log cabin burner; I already have a spot cleared right next to my first smoky friend. I fully intend on having a tiny pinon-burning, Wild West town by the end of this year, mark my words!Buy it: Casa Burner with Pinon Natural Wood Incense, $12.58All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendproductRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-16", "author": ["Condé Nast", "Bryan Fountain"]}