{"id": "da44509235619d166ba6fbbef33eb9f1", "url": "https://www.bonappetit.com/story/how-to-make-cottage-cheese", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "How to Make Cottage Cheese from Scratch, Full-Fat and Delicious | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Cottage Cheese from Scratch, Full-Fat and DeliciousWith the bounciest curds.By Molly BazSeptember 4, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThe sad days of watery low-fat cottage cheese as lackluster diet food are finally over. Let us all take a moment to acknowledge what happened, and be grateful for the lessons learned from our mistakes. Ladies and gentlemen, FULL-fat (the good kind of fat), organic, locally sourced, grass-fed, additive free, yada-yada cottage cheese has arrived to the marketplace and is here to stay. Lucky for all of us, brands like Cowgirl Creamery and Good Culture have taken the high road and reinvented this oft-overlooked dairy product as something worthy of your attention and your table.Some of our most treasured mornings in the test kitchen occur when there’s cottage cheese in the walk-in. We eat it for breakfast, lunch, and a mid-afternoon snack. It’s become somewhat of a thing, just ask my dear colleague and fellow cottage cheese aficionado, Claire Saffitz. But what Bon Appétit was missing, it turns out, was a recipe to make cottage cheese at home.To correct this oversight, I spent the last few weeks developing this recipe for cottage cheese so that even when Brad forgets to order it, I can pull through for the team. And although it takes about 5 hours to complete—don’t run away from me yet!—only 20 minutes of those hours are actually active, and the rest is left up to nature. So really, it’s like a 20 minute, 4-ingredient recipe. It’s easy! Just indulge me, okay?Use good buttermilk—thank us later.\nLaura MurrayA word to the wise: the few ingredients in this recipe demand that you use the highest quality dairy you can get your hands on for the best tasting results. There’s nothing added to enhance the flavor of your milk, buttermilk, and cream so please, please start with the best stuff you can find. It will pay off in the end. When it comes to sourcing milk, the most important thing is that it’s not labeled “ultra-pasteurized,” which means the milk has been heated for a longer period of time, killing bacteria that’s essential in cheesemaking. (Pasteurized milk is great, it’s the “ultra” stuff that’ll make things difficult.)Back to the recipe. What even IS cottage cheese? Cottage cheese is made by heating whole milk, coagulating or “setting” the milk into a solid curd (in this case with animal rennet), and then gently cooking the set curd until it soft and bouncy. Yes, you’ll need liquid animal rennet (a bottled product made with enzymes from animal stomachs, used in cheesemaking) which you can get your hands on at any cheese shop or from some place called Amazon.com.So many ways to consume cottage cheese.\nPhoto by Alex LauThe basic steps are this: heat a large pot of whole milk to 80° (best to use a digital thermometer) add a few drops of rennet, stir a couple times, cover the pot and let it sit. Four hours later the milk will have set to a custard-like texture, sorta jiggly like silken tofu. Run your knife through the custardy milk in a crosshatch pattern and then begin to gently stir the curds as you heat it again. Once it reaches 115°—any higher and you’ll risk unpleasant, dense curds—strain off all the excess liquid (aka whey). What you’re left with is a bunch of bouncy-flouncy-cute-as-hell cottage cheese curds that get bathed in buttermilk and a touch of cream, and then get chilled.And that’s it. Cottage cheese, full of fat and full of flavor, freshly made and ready to be doused in olive oil and flaky salt, or served with peaches and a drizzle of honey. The options are endless. Take this recipe, bust out a batch, and let your imagination run free.Get the recipe:Cottage CheeseHomemade cottage cheese just tastes better than store-bought. Use the best dairy you can find for the creamiest flavor.View RecipeAnother great way to use buttermilk—in pasta!Explore Bon AppétitCottage CheeseDairyRead MorecookingIf You’re Not Using Buttermilk in Your Pasta, You’re Missing OutBy Alex DelanycookingHow to Make Homemade Butter: Why Churning Your Own Is Worth the EffortBy Rochelle BilowshoppingCan We All Please Finally Admit That We Love Cottage Cheese?By Claire SaffitzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-21", "author": ["Condé Nast", "Molly Baz"]}