{"id": "da52b6dd2c6bbccabfb3be4ee9b30d46", "url": "https://www.bonappetit.com/story/kevin-wilson-ceo-of-chai", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "On TikTok, the “CEO of Chai” is Making Tea—And Spilling It Too | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOn TikTok, the “CEO of Chai” Is Making Tea—and Spilling It TooBut don’t you dare call it “chai tea.”By Zinara Rathnayake July 13, 2021FacebookTwitterEmailAngela MaeFacebookTwitterEmailKevin Wilson says that if you are bored at home, “forget that chai tea latte from Starbucks.” In a TikTok video from April 2020, he shows how to do the “real thing,” crushing cardamom and nutmeg, boiling them in milk, adding tea leaves, and stirring until he sees the “color of a happy brown boy.” The video went viral, garnering over 889,000 views. Two weeks later the 30-year-old Californian pastor-turned-TikTok star had over 20,000 followers on the platform. Just over a year after that, with more than 200,000 followers and 4 million likes, Wilson considers himself the “CEO of chai.” In his clips, he makes the tea from scratch while tackling topics like the BLM movement or Asian American hate. “When the Atlanta spa shootings happened, I made a video,” he says. “I crushed cinnamon and brewed chai while talking about Asian American violence in the United States in the name of ‘bad religion.’ This is part of my activism. It’s informed by my faith.”When Wilson set up his TikTok account in 2019, chai-making videos weren’t in the plans. As a Christian pastor, he wanted to see what his young students were seeing and posting on the popular social media platform. “I’m always curious when a new social media tool like Instagram or TikTok becomes trendy and I want to experiment with it—but it’s true that I kind of wanted to spy on my students too,” he says now with a chuckle.Thé or théthani is how we drink our tea in Sri Lanka: black with milk powder and sugar. Like me, Wilson was born and brought up there, in a mountain town called Kandy. Like my thaththa (father), Wilson's dada made thé or théthani every morning for him. When Wilson was 12, his family settled for a new life in Oman, where his mother worked as a nurse. There, Wilson drank masala chai with his Indian and Pakistani friends. In 2008, when he came to the US as an 18-year-old to enter pilot school (a dream he says didn’t work out), he looked for ways to stay connected to his roots. Chai was one of those ways. But when he saw the “chai tea latte” at Starbucks, Wilson identified it as a classic example of cultural appropriation. “You are commercializing someone else’s culture—my culture, the culture of South Asians,” he explains.Over Zoom, I chatted with Wilson about chai, self-care, TikTok, and why it’s important to talk openly about the most burning social issues.When I came to the USA...I wanted to do things that made me feel closer to home. It was my first time living away from my family. Like most other immigrants, I came here with two suitcases in hand. I felt a strong sense of displacement and disorientation. I was figuring out how to live this new life, desperately trying to hold onto anything that reminded me of my roots.Chai reminded me of home...and Sri Lankan théthani is similar to doodh patti chai—a milk-only chai made without adding water. I couldn’t find good milk powder to make théthani. But I drank chai with my Indian friends, so I started experimenting with different chai recipes. I loved the different taste profiles of cardamom, cloves, cinnamon, and other aromatics. Chai was the ritual that kept me tied to my roots.I’ve always experimented with...communication media, ever since high school. When the internet became a thing, I made a blog, and then a YouTube channel. But TikTok was unlike any other video platform. I initially focused on motivational content. Then one day, I uploaded a chai-making video by the kitchen sink. It went viral. There’s this idea that TikTok is only for Gen Z, but that’s not true. I saw people my age who were curious about chai. They wanted to know more. So I made another chai video. People followed and started making chai. They were like, “This is the best thing I ever made, I want more.”I create my content for...this community of amazing chai-loving humans who want to make authentic homemade chai as a meaningful practice, as a way to connect with themselves. We have mothers who are making it as a ritual to bond their families. And then there are South Asian Americans—Sri Lankans, Indians, Pakistanis, Bangladeshis, and everyone else—like me. They tell me that for a long time, they forgot who they were. They tell me that I inspire them to explore and embrace their cultural roots.My TikTok handle is not... Chai Guy or Chaiwala or Prince of Chai. It’s @crossculturechristian. People tell me it’s a missed opportunity and I should rebrand myself. But @crossculturechristian is who I am; my life is defined by the faith across different cultures I was and am part of. I’m professionally a pastor, which informs my worldview.Tea is deeply personal for me because...my grandfather was a tea estate manager in Sri Lanka, which is a very influential position for a Tamil Sri Lankan. But I remember seeing the plight of the tea estate workers. Some of my relatives worked in the estates. Tea has a long, troubling history of colonialism that I’m deeply connected to. I try to acknowledge the fact that Sri Lankan tea history is inexplicably tied to British colonialism and slavery. At the same time, there's the need for our generations to raise awareness in a meaningful way, not only to educate but also to reclaim our history. Today, young South Asians are doing exactly that. We are reclaiming our histories and stories.I used to think my story was a liability because...I had low self-esteem. The fact that I have an accent, look the way I do, or don’t fit into groups was working against me. I wanted to run back home. But I realize now that your story is not a liability; it’s your greatest superpower. How you look, the way you talk, the fact that you wear a sarong at home and make théthani every morning, or the fact that you say something which sounds really ridiculous to other people—all your quirks are holy. It makes you, you. And that’s why I talk about self-care in my videos. I feel that I’ve given people a license to explore themselves. When people do that, they are being brave.When I saw a piece of our culture being commodified...in the form of Starbucks’ chai tea latte, I was amazed. “What the heck is this?” When I tried it, it tasted nothing like our tea. It’s bad, but the fact that people like it makes it worse. I create awareness around this by using humor; I do duets on TikTok and review other people making chai, and laugh with them when they say ‘chai tea’ [the two words mean the same thing]. Once I told the audience that everytime you say chai tea, “a brown grandma, somewhere, sheds a silent tear.” People loved it. Some people wanted to protect brown grandmas, others cracked up, and some told me they would never use the phrase ‘chai tea’ again. Most of my audience is white Americans. I think my videos are working. People tell me that they never knew about chai and now they are learning.I recently signed a book deal...and it’s a “tea table book.” [Get it?] It’s all about tea: the color and the taste of your chai; the first sip you take. Every chapter will have a chai recipe. It also talks about my Sri Lankan experience and my South Asian immigrant experience. It’s a memoir, but not a memoir. Each chapter is a springboard for people to understand more about tea and life. If you told me a year ago that I would have gone viral on TikTok and signed a book deal to write about chai, I would have never believed you. But here we are. This all happened because I came to accept who I am and express my authentic self.Explore Bon AppétitPerson of InterestCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-12", "author": ["Condé Nast", "Zinara Rathnayake"]}