{"id": "da654c253d01a36a13f0b7552b802d53", "url": "https://www.bonappetit.com/story/lemon-pepper-chicken-recipe", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Heaven Is an Entire Lemon-Pepper Chicken Doused in Honey Butter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHeaven Is an Entire Lemon-Pepper Chicken Doused in Honey ButterA new (easy!) recipe from pitmaster Bryan Furman will give you all kinds of ATL cred.By Hilary CadiganJune 14, 2018FacebookTwitterEmailPhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyFacebookTwitterEmailOnce, I spent three days straight eating nothing but chicken wings.Accompanied by four brave adult humans, I journeyed through the sweaty depths of an Atlanta July, armed with floss picks, wet naps, and handfuls of Prilosec. We ate out of styrofoam containers in gas station parking lots and visited strip clubs at 3 p.m. We fought over wilted celery. At one point somebody made a bracelet out of chicken bones. Things got weird. But we emerged triumphant, with a crumpled, sauce-stained spreadsheet listing the names of Atlanta’s top 12 chicken wing purveyors, ranked.As a result of this experience, coupled with my decade in Atlanta (America’s chicken wing capital—fight me), I consider myself a bit of a connoisseur. And like any good Atlantan, Paper Boi included, I know without a scrap of doubt in my heart that the best chicken wing flavor on earth is lemon-pepper wet.First, a lesson for the uninitiated. The difference between regular lemon-pepper chicken and the hallowed lemon-pepper wet is one thing: butter. Specifically, liquified butter that’s poured over your freshly fried chicken in a blanket of greasy glory, balancing the zing of the lemon and bite of the pepper with pure fat. Sometimes, there’s hot sauce in there too. But know this: A lemon-pepper wet wing is a little bite of heaven.But you know what’s even better than a little bite of heaven? An entire chicken-sized hunk of heaven. And that is what my fellow Atlantan Bryan Furman of B’s Cracklin’ BBQ has introduced to you, good readers, with this grilled lemon-pepper chicken recipe. So obviously, I had to rep my adopted hometown and make it, even though I’d never grilled a whole chicken before. And because I am an all-or-nothing kind of person and a glutton for punishment (and just a glutton, generally), I decided to make it about two hours before 40+ people were to arrive at my tiny-kitchened Brooklyn apartment over Memorial Day weekend. Go big and stay home. That’s my motto.Get the whole cookout menu from B’s Cracklin’ here.\nPhoto by Peden + Munk, Food Styling by Sue Li, Prop Styling by Rebecca BartosheskyHow it went downStep one to cooking an entire chicken is buying an entire chicken. In keeping with Furman’s M.O. of using only top quality proteins he helps raise himself, I opted for the most ethically-raised-seeming chicken in the Key Foods refrigerated meats aisle. I removed the chicken’s heart and other ick parts like a champ (made easy by the fact that they came neatly tucked inside a little plastic bag) and tossed them in the freezer, telling my cat and whoever else might have been listening that I would someday “make a stock with them or something!” while knowing that in reality they will remain lost behind three open bags of freezer-burned broccoli until I a) move out or b) die.My friend Pat arrived as I was cleansing the chicken carcass (not with soap; shout-out to this man for learning that lesson for me). In exchange for a can of Coors Light, he agreed to be my sous chef, which mostly involved taking videos of me with the chicken and posting them to my Instagram story.“Ayyyyyeeee!!!! 🔥 🔥 🔥 ” responded pitmaster Bryan, upon seeing said story. “Cut it in halves. It gets the flavor better that way.”Dammit because I planned to skip this step, having no idea how to sever an entire chicken. But now I had to. The pitmaster was watching. “Hold down this chicken!” I yelled to Pat, who’d wandered away under the wrongful impression that he’d come to his birthday barbecue to socialize. I grabbed the largest knife I could find with trembling hands. “Hold her down!”Folks, what ensued was not pretty and more closely resembled a Shakespearean murder scene than a maybe commonplace culinary proceeding, but what’s important is that I ended up with two pieces of chicken where once there was one.Now, the thing to know about this recipe is that once you get past the chopping a chicken in half part, it’s really quite easy. Even if you’re me. Sprinkle that baby with salt and pep, let it sit at room temp for an hour, heat honey and butter on the stove ‘til it gets all foamy-delish, add some lemon slices, and throw both chicken halves on the grill. If you end up accidentally pouring the entire batch of honey butter onto the chicken in one go instead of brushing it on every five minutes like you’re supposed to, fear not! Just melt more honey butter. There’s no such thing as too much honey butter.And if your roommate decides to get involved at the LAST POSSIBLE SECOND and drops one of your beautiful golden brown chicken halves into the back of the gross dirty grill seconds before it was ready to be served, this too is not the end of the world. Just mold your face into a mask-smile, say “no I’m not mad” through gritted teeth, and stick that thang back on the grill for a couple more minutes to burn off the grime. Don’t tell any of your guests what happened. They’ll read about it later on the internet.I may be a cooking noob, but I’ve been described by myself and my mom as one of the most acclaimed lemon-pepper chicken judges this side of the Mason-Dixon. And the verdict is clear: Bryan Furman’s lemon-pepper [wet] chicken checks all the boxes: juicy on the inside, crisp on the outside, flavored with a swoon-worthy balance of salt and pepper and sweet, sweet lemony butter. Best of all, its deceptively-easy-to-makeness will force everyone at your barbecue to realize they’ve been underestimating you and your motor skills and your ability to be patient all their lives. Plus, you can spend the rest of the day week month bragging about it. Which I did. Which I’m still doing.Y’all, I grilled an entire chicken.And you can too!Lemon-Pepper ChickenA summer grilling recipe from B’s Cracklin’ BBQ in Georgia, where juicy lemon-pepper chicken is a culinary tradition.View RecipeExplore Bon AppétitGrillChickenLemonAtlantaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-14", "author": ["Condé Nast", "Hilary Cadigan"]}