{"id": "da7d99b47bceb047e05e5f4eb0e9e8cb", "url": "https://www.bonappetit.com/story/bonne-maman-intense", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Bonne Maman’s New Intense Fruit Spreads, Reviewed  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Bonne Maman’s New ‘Intense’ Fruit Spreads Compare to the OriginalBonne Maman’s French recipe has less sugar and more fruit, and you can finally buy it in the U.S.By Alyse WhitneyJuly 24, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailWhen you hear the word “intense,” you probably think of Ironman competitions, Big Little Lies, and The Rock’s Instagram. But...jam? Yep. This month, Bonne Maman released a new line of “intense” fruit spreads in the U.S. This is the company’s French recipe and it’s slightly less sweet (39 percent, to be exact), and more fruit-forward. How does it compare to the classic 23 flavors? We were the first to taste the three debut flavors and find out.The differences between the original and the new line are subtle. The original, red gingham-printed lid Bonne Maman jar is 13 oz. with 50 percent fruit, while the smaller, purple-topped 8.2 oz. Intense jar is 67 percent fruit. A jar of original apricot jam has 13g of sugar per Tbsp, while Intense has 8g per Tbsp. Bon Appétit staffers tried classic Bonne Maman and the new Intense line side-by-side and here’s what we thought:Bonne Maman Intense: StrawberryAlex Lau“Pure strawberry flavor and not too sweet,” remarked one taster, noting that the little seeds within were a nice touch, but it was a little too chunky. “Very berry! Good acidity and balance—I want it with yogurt, please,” noted another. However, it wasn’t a home run for everyone. One taster thought that the spread was too thick and that it was a bit muted compared to the original. Despite the name, the ‘intense’ is actually more mellow than the sugar-packed U.S. version, which it makes up for with a stronger fruit flavor. We’re into it.Bonne Maman Intense: ApricotAlex LauSpoiler alert: Apricot won our taste test of all of Bonne Maman’s flavors last year, and it ran away with that award this time too. One taster called this “best in show” and described it as “beautiful flavor with fuzzy apricot skin and bursting with juice.“ That’s poetry right there. It had the “best texture of the bunch”—slightly broken down pieces of fruit that were big enough to make it overall “extremely fruity.” It was also likened to a sun-dried apricot with a sunny, rounded flavor, and it would be perfect on ricotta toast or in thumbprint cookies. We liked this one better than the original because it wasn’t as sweet or gummy.Bonne Maman Intense: BlueberryAlex LauThe original blueberry was one of the sweetest fruit spreads we’d ever tasted, but the Intense version mellowed out into a looser blend of berry texture and set juices. It was bright, yet a little sour to balance things out, and one taster said it was like the “perfect bite of Maine blueberry pie.” It had a more seedy texture and pops of whole blueberries, making it feel kind of like fruit soup... in a good way?  It would be good in a smoothie or swirled into ice cream. When so many blueberry products taste artificial, it’s nice to finally try something that tastes like real blueberries.Right now, Bonne Maman Intense is only available in Publix and Kroger stores, but it will expand to Whole Foods, Target, Amazon, and more online stores in August.Buy a six-pack of Bonne Maman Intense strawberry on Amazon for $35, or check your local grocer for a jar.Oooh, let’s put some Bonne Maman Intense in icebox cake!All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitTaste TestShoppingJamFruitRead MorecultureA Definitive Ranking of 23 Bonne Maman FlavorsBy Alyse Whitneyrecipes36 Fruit Jam Recipes That Go Way Beyond ToastGallery36 SlidesBy Elyssa GoldbergcultureThis Incredible Strawberry Jam Is Made with Rare, Extremely Tiny StrawberriesBy Zahra Pettican Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-24", "author": ["Condé Nast", "Alyse Whitney"]}