{"id": "daa87d48419c7aceda63035c482de733", "url": "https://www.bonappetit.com/story/what-is-ricotta-cheese", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "So, What Is Ricotta Cheese, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSo, What Is Ricotta Cheese, Anyway?You know it. You love it. But what is ricotta cheese, really? Let's learn about the fluffiest cheese in the land.By Alex DelanyApril 24, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailIf the Italian word ricotta doesn’t translate to glorious, fluffy cheese clouds in English, I’d like to speak to someone about changing that. Because that’s exactly what ricotta is: light, spongy, creamy, glorious fresh cheese. You might be a ricotta fanatic. Or you might dabble on occasion. But do you really know what ricotta’s deal is? What is ricotta cheese, really?Well, let’s start with what it’s made from. Ricotta can technically be made from the milk of cows, sheep, goats, or water buffalo, but the ricotta that we consume most frequently—the stuff you can buy at almost every grocery store—is made from the milk of a cow. But historically, that cows milk was used for something else before it was used to make ricotta. Sorry, is that confusing? Allow me to explain.So, ricotta actually translates to recooked in Italian, and ricotta is what’s called a \"whey cheese.\" When you make cheese, you separate milk into two distinct things. You have the solids, called curds, which will be separated out and pressed to form cheese. And you have the liquid that is left behind, called whey. Most cheeses that we know and love are made from the curds but, traditionally at least, ricotta is made from the tiiiiiny bit of curd left behind in the whey.Cheesemakers make whatever cheese they want to make with the curds, and then repurpose the leftover whey to create ricotta (among other whey cheeses). To do this, the whey is heated—usually after a small addition of whole milk and some form of vinegar or citrus juice—and the remaining curds start to coagulate. The curds will become larger and more solid and, eventually, the pot will be emptied into a portion of cheesecloth and strained. Once the cheese cloth is emptied of any remaining whey, you’ll be looking at a bunch of fluffy, white ricotta.This is how ricotta is traditionally made; it's a way to put all that leftover whey to good use. But these days, at least in the States, we tend to make ricotta from whole milk instead of whey. In this case, the process is the same as making any other cheese—you heat the milk, coagulate it in some way, and then strain the curds from the whey to form a soft, fresh, spreadable cheese product.Ricotta dip! It's really, really good!\nPhoto by Chelsea KyleThe main thing to take away from this whole process is that ricotta is a fresh cheese. There’s still a ton of moisture in ricotta. As a general rule, the older a cheese is, the less moisture it will have retained. An aged cheese like Parmesan is hard and dense. Since the ricotta we use at home isn’t aged at all, it’s light and moist, and also much more perishable than drier cheesesSo that’s how ricotta is made. But what do you do with it? Well, lasagna filling is a good place to start. Or maybe some stuffed shells or manicotti. But ricotta is also a fantastic ingredient to add straight-up to a dish. Dollops of ricotta on top of pasta, soup, or pizza bring freshness (and definitely more richness) instantly. A swipe of ricotta over toast should be your official substitute for cream cheese, especially with some cracked black pepper and a drizzle of honey. You can make it into a dip with herbs and spices, and ricotta with almost any in-season fruit is guaranteed to be a killer dessert.Really, you can use ricotta in many instances in which you might otherwise use yogurt. It’s the cheese that can do both! And while you do know how it’s made, there’s no pressure to tell everyone you meet. You can just enjoy the pillow-y fresh cheese, keeping the thoughts of curds and whey to yourself.Here's that lasagna you asked for:Basically Skillet LasagnaFinally: an easy, cheesy, vegetarian(!) lasagna recipe that doesn't require you to dirty every pot and pan in your kitchen.View RecipeExplore Bon AppétitBasicallyCheeseRicottaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-24", "author": ["Condé Nast", "Alex Delany"]}