{"id": "dab765f0ad203472539e600fe276c6df", "url": "https://www.bonappetit.com/story/how-to-store-onions", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "How to Store Onions So They Last Longer Than Your Most Recent Relationship | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Store Onions So They Last Longer Than Your Most Recent RelationshipJust remember: cool, dark, and dry.By Sarah JampelMay 17, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailI’ve thought about how to store herbs, berries, tomatoes, nuts, and even flour. (Underwear, that too!) But how to store onions? Don’t you just, er, put them on the counter and let them hang out for…I don't know…ever? That’s what I thought until one dark morning several years ago, when I walked into the kitchen and found the counter covered in stinky liquid. The potatoes and onions, which had been bunking together in the same basket, had led to each other’s demise: The spuds had sprouted and softened; the onions had liquified and leaked.  I am telling you this horror story not to gross you out, but to implore you to consider how to store onions (and potatoes). Here’s what you need to know to extend your onions’ lifespans for as long as possible:Keep storage onions in a cool, dark, and dry place.Moisture and light lead to mold (ew) and sprouting (annoying, though not a deal-breaker), so stow your storage onions (red, yellow, and white as well as shallots and the diminutive pearl and cippoline) in a dry, well-ventilated basket, bin, or large bowl. Keep them out of the sun and in a cool but not freezing locale with some air circulation. I keep mine in the cabinet with all of my baking dishes, but in the future I aspire to buy crates’ worth and stow them in a garage or cellar. You also want to make sure, as you have gleaned from my anecdote, that they’re separated from potatoes (which are prone to rotting if kept nearby). How long do onions last?According to The Chef’s Garden cookbook, onions stored at temperatures between 30°F and 50°F will keep for up to one year. Otherwise, they’ll last for several weeks.Store cut onions in the refrigerator (or even the freezer)…You can hang on to a halved or sliced onion in an airtight container in the fridge for about one week. Store them in an airtight container (preferably a glass one, as plastic will absorb odor) to decrease oxidation, moisture absorption, and stinkiness. And as long as you’re going to be cooking the onions, rather than using them raw as a topping or condiment, where texture is vital, you can store them in the freezer for several months. …along with any tender, fresh alliums.For alliums that aren’t long for this world (as in, they haven’t been cured for long-term storage)—think scallions, spring onions, sweet onions, leeks, green garlic, garlic scapes, chives—store them in the fridge. Anything that comes bunched—like spring onions and scallions—unfurl, then wrap in a damp paper towel and tuck them into a bag or airtight container. (I also peel away anything that’s slimy or wilting and toss it into the compost—it’s not going to help the cause.)Explore Bon AppétitOnionStoringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-17", "author": ["Condé Nast", "Sarah Jampel"]}