{"id": "dada3b8e217676202b8d80ba36f574c8", "url": "https://www.bonappetit.com/recipe/spicy-skillet-lasagna-with-ricotta-and-spinach", "year": 2021.0, "month": 11.0, "day": 3.0, "content": "Spicy Skillet Lasagna With Ricotta and Spinach Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpicy Skillet Lasagna With Ricotta and SpinachBy Rachel GurjarNovember 18, 20213.7(10)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintInstead of baking lasagna sheets flat in a pan, we use wavy noodles rolled into pinwheels and arranged so their ruffled edges become browned and crispy as they bake. This turns every serving into the kind of textural marvel that in traditional lasagna is only really possible around the outer edges but is arguably the best part! The savory spice from cumin seeds and crushed red pepper flakes in the vegetarian sauce means you won’t miss the meat here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBenriner Mandoline Slicer$80 At AmazonCast Iron Skillet$30 At AmazonMicroplane Grater$16 At AmazonLarge Pot$55 At AmazonIngredients4-6 servingssauce¼cup extra-virgin olive oil1medium white onion6garlic cloves1tsp. ground cumin128-oz. can plus 1 15-oz. can crushed San Marzano tomatoes3sprigs basil, leaves picked1Tbsp. crushed red pepper flakes1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher saltassembly8oz. mature spinach1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more1lb. lasagna noodles2medium zucchini, thinly sliced about ¼\" thick on a mandoline2cups fresh ricotta¾cup whole milk½tsp. freshly ground black pepperPinch of ground nutmeg4oz. Parmesan, finely grated, plus more for serving18-oz. package shredded low-moisture mozzarellaBasil leaves (for serving)PreparationsauceStep 1Heat oil in a 10\" ovenproof skillet over medium. Cook onion, garlic, and cumin, stirring occasionally, until onion is beginning to brown and soften, about 5 minutes. Add both cans of crushed tomatoes, basil leaves, red pepper flakes, and salt. Cook, stirring occasionally, until sauce is slightly thickened and flavors have melded, about 10 minutes. Stir in ½ cup water, then remove from heat.AssemblyStep 2Cook spinach in a medium pot of boiling salted water until wilted, about 30 seconds. Drain and transfer to a large bowl of ice water. Let sit until cool enough to handle. Drain and ring out excess moisture from spinach with your hands. Separate spinach and set aside.Step 3Preheat oven to 425°. Cook noodles in a large pot of boiling salted water, stirring occasionally and separating noodles as needed to keep from sticking, until just starting to soften and bend but still firm in the center; about 5 minutes. (They should be firmer than you think they should be, but this will create al dente lasagna layers instead of gummy ones.) Transfer noodles to a large bowl of cold water and let cool. Drain noodles and stack flat on a rimmed baking sheet, separating layers with sheets of parchment or wax paper.Step 4Place zucchini in a single layer on a rimmed baking sheet lined with paper towels and salt generously on both sides. Let sit 15 minutes to allow excess moisture to drain.Step 5Process ricotta and milk in a food processor until smooth. (It should be whipped and a bit airy). Add pepper, nutmeg, 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt, and 4 oz. Parmesan and process 10 seconds. Transfer to a medium bowl and fold in reserved spinach with a rubber spatula.Step 6Using a ladle, transfer all but 1 cup sauce to a medium bowl, (there should be just a thin even layer of sauce left behind).Step 7Take a lasagna sheet and place 1–2 slices of zucchini in the center. Scoop 2 (heaping) Tbsp. ricotta mixture on top and spread evenly over noodle. Sprinkle 1 Tbsp. mozzarella on top. Carefully roll up lasagna and sit vertically in skillet with tomato sauce. Repeat with remaining lasagna sheets, zucchini, ricotta mixture, and mozzarella.Step 8Evenly ladle sauce in bowl over rolled pasta, then sprinkle more Parmesan over. Bake lasagna until sauce is bubbling gently around the edges and tops of lasagna rolls are browned and crisp, 35–40 minutes. Remove from oven and top with more basil to serve.How would you rate Spicy Skillet Lasagna With Ricotta and Spinach?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleJust made this with some slight adjustments: halved the recipe, skipped the zucchini, used frozen spinach, and homemade lasagna noodles. Would definitely make again, loved the heat. E Reid 1/31/2022Yummy flavors, but it says to cut zucchini 1/4” thick, which turned out to be too thick when I made it…zucchini was barely cooked and my two zucchini only yielded 10 slices at this size, which was not enough for the amount of noodles. 1/8” might be better.Jen KGrosse Pointe Woods, MI12/23/2021Looks interesting, but would this work in a dutch oven?CarlToledo11/29/2021Explore Bon AppétitLasagnaPasta & NoodlesDinnerVegetarianBakeRoastCast ironTomatoVegetableZucchiniSquashRicottaCheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-18", "author": ["Condé Nast", "Rachel Gurjar"]}