{"id": "daf8a8cb3395d4e22b8e9c153f5e4cf9", "url": "https://www.bonappetit.com/story/pie-dough-problems", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Why Cold Butter Is Important for Successful Pie Dough | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPie Dough Problems? I'm Blaming Your ButterKeep it cool.By Jesse SparksApril 6, 2020FacebookTwitterEmailPhoto by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen Kaminski FacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.My grandmother Evelyn Watkins (good ol’ gram) was a spitfire of a baker who regularly churned out pies at the drop of a hat. So when she’d come to Houston to watch my siblings and me during our summer vacations, she’d make pies with her grandkids. She would lean over me, take my hands in hers, and press them into a soft pillow of pie dough, cursing the invasive heat of the sweltering summer.One time, as she felt our soggy, sticky dough that was basically begging for a cooler clime, she let slip: “You can’t do sh!t if your dough’s too fuck!ng hot.” Originally I thought it was my fault—that I hadn’t  formed the perfect dough quickly enough—but really, it was always about the butter.When it comes to pie dough, keeping the butter as cold as possible is the key to achieving that gold-medal worthy flakiness. Once you’ve rolled out and folded your pie dough, those distinct bits of butter will steam as the dough bakes, creating the pockets of air that puff up into distinct layers. If the butter is too warm, it will combine too well into the flour, making the dough hard to work with and the final crust tough or cracker-like. If you’ve had pie crust problems, chances are the butter’s to blame. Here’s how to keep it under control:Start with cold butter, straight from the fridge. And if you’re using European butter, which is higher in fat and softer at room temp, Sohla El-Waylly recommends cubing it and freezing it until it’s firmed up.Consider the temperature of your kitchen. It could fluctuate depending on where you live, if you have air conditioning, and the time of year. You’ll want to work extra quickly (and be extra cautious) if you’re working in a warm environment like Houston in the summer.Chill your tools. Make space in the fridge or freezer for your mixing bowl, bench scraper, and baking vessel, be it a pie dish or a sheet pan.When a recipe calls for water, it should be icy-cold and definitely not from the warm side of the tap.Give the dough ample time to chill throughout the process.  Pastry pro Lisa Ludwinski, owner of Sister Pie in Detroit, freezes her dough at several points during her process. Even if you’re not following her recipe, it will help give your butter a stint in the freezer as soon as it starts to feel tacky, warm, or mushy. When in doubt, opt to let it chill the dough in the freezer for up to 20 minutes before continuing to work (keep in mind that it might need to rest for a few minutes at room temperature to become pliable again).Remember to move quickly and efficiently. Get your flour and water measured before the butter comes out of the fridge, lest you start cursing like an impassioned grandmother. And don’t be too precious as you smash the butter into the flour—it’s better to go quickly than to be exacting,Your freezer is your friend.\nIf your doughs feel warm or tacky after you’ve lined the pie dish or shaped the galette, stick it in the freezer or fridge until it’s firm and cool to the touch before you bake.And just like that you’re ready to bake a pie that would make your my grandmother proud, which is absolutely a feat in and of itself.Get baking:Triple-Threat Onion GaletteNot just a clever name, this savory tart combines three alliums (scallions, garlic, and onion) for maximum flavor and crispy-jammy texture. The key to the flaky crust is to move fast! Rolling and folding the dough while the butter is still cold creates distinct layers of butter and flour that will steam apart during baking, making the crust light and flaky.View RecipeExplore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-06", "author": ["Condé Nast", "Jesse Sparks"]}