{"id": "db3105b6204203d403cd57d2d8398ac8", "url": "https://www.bonappetit.com/story/mushroom-jerky", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "This Mushroom Jerky Changed My Jerky-Loving Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Mushroom Jerky Changed My Jerky-Loving LifeYes, I finish an entire bag in one sitting.By Rachel KartenSeptember 13, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!I’m a diehard jerky fan. If J-14 magazine made posters of jerky, my childhood bedroom would have been plastered with them.  I’ve even professed my love for the salty snack on this very site. So when a mysterious bag of *whispers* Pan’s mushroom jerky showed up on our office  snack table, I was skeptical. Could it replicate the chew of meat jerky? Would it have that terrible fake smoke flavor that plagues most faux-jerkies? Did I really want to eat a handful of mushrooms? Then I tried it. And my jerky-loving life was changed forever.Pan’s Mushroom Jerky was started by Michael Pan after visiting his extended family in Malaysia and trying their extremely snackable dried mushrooms. When he returned home to Portland, Oregon, he brought the recipe with him: a minimal mix of organic dried shiitake mushrooms, water, avocado oil, coconut sugar, salt, and chia seeds.While you’ll never be confused if you’re eating mushroom or pork, there is a distinct jerky quality to the snack that satisfies that same craving. The little nuggets of mushrooms are chewy and meaty. The salty umami that shiitakes naturally have comes through. Most importantly, it passes my very important jerky test: Can I finish an entire bag in one sitting? — Rachel Karten, associate director of social mediaBuy it: Pan's Mushroom Jerky, $7.50All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItMushroomSnackShoppingRead MoreLifestyleI'm Now A Person Who Drinks Lightly Brewed Sparkling TeaBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-13", "author": ["Condé Nast", "Rachel Karten"]}