{"id": "db339e582e4dd61a3e42915fdba208bf", "url": "https://www.bonappetit.com/recipe/salted-pistachio-crumbles-with-berries-and-ice-cream", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Salted Pistachio Crumbles With Berries and Ice Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueSalted Pistachio Crumbles With Berries and Ice CreamBy Andy BaraghaniApril 14, 20204.3(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Aneta Florczyk EmailPinterestPrintEmailPinterestPrintA salty, crumbly pistachio topping; juicy macerated fruit; and yes, store-bought ice cream combine for a back-pocket dessert that might feel a bit like cheating but is so good nobody will care.Ingredients8 servings½cup (60 g) raw pistachios1cup (125 g) all-purpose flour½cup (100 g) sugar¼cup (38 g) cornmeal1tsp. kosher salt, plus more½cup (1 stick) unsalted butter, melted1½lb. strawberries (about 1 quart), hulled, halved, quartered if large1Tbsp. fresh lemon juice½tsp. ground cardamom3Tbsp. honey2pints ice cream of your choicePreparationStep 1Place a rack in upper third of oven; preheat to 350°. Spread out pistachios on a rimmed baking sheet and toast, tossing halfway through, until slightly golden brown, 6–8 minutes. Let cool; pulse in a food processor until mostly finely ground but with some larger pieces remaining.Step 2Mix pistachios, flour, sugar, cornmeal, and 1 tsp. salt in a large bowl, then drizzle in butter and work in with your fingers or the handle of a wooden spoon until small pebble-to pea-size clumps form. Scatter crumble over a parchment-lined rimmed baking sheet, trying not to break it up too much, and bake, tossing halfway through, until golden brown, 20–25 minutes. Let cool.Step 3Meanwhile, toss strawberries, lemon juice, cardamom, and a pinch of salt in a medium bowl to combine.Step 4Heat honey in a small skillet, stirring, until it begins to bubble and darkens slightly, about 4 minutes. Remove from heat and scrape into strawberries. Toss, until honey is evenly distributed (it’ll be sticky in the beginning but will eventually dissolve). Let sit, tossing occasionally, until berries release their juices, about 15 minutes.Step 5Scoop ice cream into bowls. Spoon strawberries and their juices over; scatter crumble on top.How would you rate Salted Pistachio Crumbles With Berries and Ice Cream?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleSo dope.AnonymousHoboken, New Jersey1/24/2021So dope.AnonymousHoboken, New Jersey1/23/2021This was perfectly salty and sweet! Great texture between crunchy and creamy. My husband made it for my Birthday. Kim Topeka, KS12/29/2020This pistachio crumble is so so good. I had extra because I was low on berries and I’ve been putting it in yogurt as less healthy granola :) and next I’m going to try to make a pie crust with a few tweaks. I can’t get enough of it. The dessert itself as described in this recipe is also excellent. AnonymousPhiladelphia 5/25/2020This was good! I used frozen berries and cooked them for a bit on the stove with the honey, cardamom, lemon juice, and salt until they were a thick compote. AnonymousNew York5/7/2020Delicious. Subbed cardamom for cinnamon and nutmeg because we were out and it was great. Made it for a friends birthday and everyone wanted seconds. AnonymousAustin5/3/2020this was tasty! easy to make and delicious. I had corn grits that I used instead of corn meal which worked out fine but I would probably prefer it with the meal rather than grits. \nIt seems like a lot of cardamum when measuring it out but it isn't overpowering when everything is together. I put it over greek yogurt instead of ice cream and it is very good. it's no ice cream but I'm working with what I've got. AnonymousSouth Carolina4/17/2020Y’all desperately need to update your Pinterest page Anonymous4/14/2020Explore Bon AppétitFrozen DessertDessertPistachioNutStrawberryBerryFruitBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Andy Baraghani"]}