{"id": "db4270e9cb04b2d7078ee729bf44fac0", "url": "https://www.bonappetit.com/story/maille-rich-country-dijon-mustard", "year": 2020.0, "month": 9.0, "day": 3.0, "content": "I’m in Love With Maille Rich Country Dijon Mustard, Partly Because of Its Name, Mostly Because It’s Just So Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m in Love With This Mustard, Partly Because of Its Name, Mostly Because It’s Just So GoodMaille Rich Country Dijon mustard is silky and soft with just the right ratio of pungent mustard seeds peppered throughout.By Amiel StanekSeptember 16, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I’m a bit of a Goldilocks when it comes to mustard. I’ve always loved the notion of whole grain mustard, but I find the texture to be slimy and off-putting. I adore the heat and spreadability of a uniformly smooth Dijon, but sometimes it can be a bit...unnervingly smooth. But Maille Rich Country Dijon mustard? It’s juuuuust right: silky and soft with just the right ratio of pungent mustard seeds peppered throughout. You could probably make your own with a ratio of 75% smooth to 25% whole grain, which is probably exactly what the company does to make it. But you don’t have to! Because Maille did it for you, and put it in a jar, and gave it a sick name, and put it on shelves, and now I’m writing about how awesome it is, and you’re reading it.But, yeah: I mostly love Rich Country because...it’s called Rich Country, which I’m sure you’ll agree is a pretty unnecessarily epic name for a condiment. It sounds like the next great Rick Ross album. Or a Keith Urban–themed Southern waterpark. Or a new bourbon endorsed by a retired pro wrestler. But it’s not! It’s mustard. And it’s helped clarify for me that I want my condiments to do more than simply enhance the taste of food I’m preparing—I want them to enhance my life, to spark joy every time I pull them out of the fridge. Indeed, every time I reach for my new favorite mustard, I can’t help but whisper the name aloud as if I were starring in a commercial for it—R-r-r-r-iiiiiiich Coooooountry—and laugh out loud while I’m making lunch. (This could be the quarantine brain talking, but still. It’s the little things, people.)Anyhoo, this mustard is perfect—exactly what I want to perk up a salad dressing, lend some oomph to a turkey sandwich, or serve as a condiment alongside a dinner of sausages and sauerkraut. Sweet, salty, sour, and spicy, it’s already secured a coveted spot in my Desert Island Condiment Hall of Fame, right up there with Heinz ketchup and Hellmann’s mayo. And while I’m sure that the next time I go to the grocery store, I’ll probably find it surrounded by any number of comparable products, I refuse to accept any substitute. It’s Rich Country—R-r-r-r-iiiiiiich Coooooountry—or nothing for me from here on out.Buy it: Maille Rich Country Dijon Mustard Blend, $5 on MercatoAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingHighly RecommendRead MorecookingThe Only Time I Panic Is When These 5 Condiments Run LowBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-06", "author": ["Condé Nast", "Amiel Stanek"]}