{"id": "db490d89082ed3b1ed413f1ce4d80719", "url": "https://www.bonappetit.com/city-guides/montreal/venue/damas", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Damas Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealDamasAll the meze (and fresh pita!) at this standout Syrian spot in OutremontFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for Damas’ vibrant Syrian specialties in a moody sprawling space.ORDER THE: hot and cold mezes served with freshly made pita. You must try the borek jibné, superlight fried dumplings filled with molten baladi cheese and served with tomato sauce for dipping, and the hummus lahmé, hummus topped with flavorful lamb. Finish the meal with a scoop of baklava ice cream and a glass of cardamom saffron tea.THE VIBE IS: very festive, thanks to red beaded light fixtures, lanterns, and tiled walls. The huge dining room is crowded almost every night, mostly with families and couples on date night, so grab a seat at the bar where you can see right into the kitchen: one cook sprinkling dishes with fresh herbs, another making pita to order.PRACTICAL STUFF: Open every day: Monday to Thursday 5 p.m. to 10 p.m., Friday 5 p.m. to 11 p.m., Saturday 4 p.m. to 11 p.m., and Sunday 4 p.m. to 10 p.m. Reserve ahead of time via OpenTable, especially on the weekends but also during the week for good measure.—Claire SaffitzPhoto by Dominique LafondWE ALSO LOVELe MoussoSplurge a little on this innovative tasting-menu-powered restaurant in the Gay VillageArthurs Nosh BarThe Saint-Henri Jewish(ish) deli with lines out the doorAgrikolIn the Gay Village, a rum-fueled oasis run by Arcade Fire Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}