{"id": "db4f484be08c13a1e9031afde4b97b9f", "url": "https://www.bonappetit.com/story/amazing-creamy-taco-sauce-crema", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "How to Make an Amazing Creamy Taco Sauce in About 45 Seconds | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make an Amazing Creamy Taco Sauce in About 45 SecondsIt slays on just about any taco you can think of, but tastes incredible on everything from grilled veggies to steak too. This sauce is life.By Alex DelanyJuly 12, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailWhen I'm at a restaurant, eating tamales or enchiladas or tacos, you can bet that I'll ask for crema. That creamy, tangy, dairy-based sauce is just too good not to drizzle over everything in sight. Objectively speaking, crema is a very simple ingredient, but when I'm at home, I never make it, because crema has one negative: It requires time. You need to wait at least three hours for all of the sour cream, heavy cream, and salt to get cozy together and do their thing. On weeknights, I don't have that kind of time. I need immediate gratification. So I make something else.I make a sauce that’s not technically a crema but tastes just as good as one. This saucy taco-topper is like that fake ID you acquired in college. It may not be one hundred percent legit, but it works like a charm. And with this substitute, you don't even need to use cream. Here’s how you whip some up:This is you, making crema.\nYou start with ½ cup mayo. Yes, mayo. Like I said, this isn’t being made with authenticity in mind. Mayo is a little thick, so add 2 Tbsp. water to thin it out. And then we cheat the tang that crema is known for with 1 clove of grated garlic and a pinch of salt.Now you have a sauce that can do the same work as a crema, without the three hour waiting period. It took you about 45 seconds to make, and it’s going to taste like a million bucks. That’s impressive. And while some might call it lazy, I'd call it...efficient.Crema makes taco better. That's science.\nYossy ArefiThis sauce isn’t a one-trick pony, either. You can use this to top way more than shrimp tacos. You can top chicken tacos. Carnitas tacos. Steak tacos. No, no: I kid, I kid. It works on way more than tacos. Drizzling a bit over some roasted or grilled vegetables is a certified win. Topping toasts, sandwiches, and any and all meats with a drizzle also brings them up a notch. And potatoes? Oh, roasted or fried potatoes, whole or in a hash? They all love the sauce. And I do too. This sauce is life.Here's that taco recipe you want:Honey-Chipotle Shrimp TacosThese easier-than-easy shrimp tacos are packed with flavor, and ideal for busy weeknights.View RecipeExplore Bon AppétitBasicallyMayonnaiseCondiment/SpreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-12", "author": ["Condé Nast", "Alex Delany"]}