{"id": "db54f6770d089ee5be32b084b17686a2", "url": "https://www.bonappetit.com/recipe/swordfish-with-asparagus-and-beans", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Swordfish With Asparagus and Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueSwordfish With Asparagus and BeansBy Ali Slagle February 8, 20224.8(9)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata, food styling by Pearl Jones, prop styling by Marina BevilacquaEmailPinterestPrintEmailPinterestPrintSwordfish is perfect for hot-and-fast applications like this springy skillet from Ali Slagle’s cookbook I Dream of Dinner (So You Don’t Have To) because it cooks quickly without drying out. Swap in another fatty fish—like mahi-mahi or salmon—and whatever crunchy vegetables (like green beans or snap peas) and small white beans (like navy or Great Northern) you have on hand. Serve alongside orzo, Israeli couscous, bulgur, or crusty bread for sopping up the lemony juices.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Skillet$84 At AmazonFish Spatula$14 At AmazonMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonWhisk$10 At AmazonIngredients4 servingsZest and juice of 2 lemons1tsp. crushed red pepper flakes½cup plus 4 Tbsp. extra-virgin olive oil, dividedKosher salt, freshly ground pepper41”-thick swordfish or mahi-mahi steaks (about 1½ lb. total), patted dry, cut into 1” cubes1lb. asparagus, woody stems trimmed, cut into ½” pieces1garlic clove, thinly sliced215-oz. cans small white beans, (such as navy or Great Northern), rinsed½cup tender herbs (such as mint, dill, basil, and/or parsley), plus more for servingPreparationStep 1Whisk lemon zest, lemon juice, red pepper flakes, and ½ cup oil in a small bowl to combine; season vinaigrette with salt and pepper.Step 2Season fish all over with salt and pepper. Heat 2 Tbsp. oil in a large skillet over medium. Add asparagus, garlic, beans, and ¼ cup water; season with salt and pepper. Cook, stirring occasionally, until asparagus is crisp-tender and beans are warmed through, about 4 minutes. Transfer to a medium bowl; stir in 2 Tbsp. vinaigrette. Reserve skillet.Step 3Heat remaining 2 Tbsp. oil in reserved skillet over medium. Cook fish, stirring occasionally, until golden brown and flesh flakes easily with a fork, 5–7 minutes.Step 4Add fish and ½ cup herbs to bean mixture and stir once. Drizzle with more vinaigrette and season with more salt and pepper. Just before serving, scatter more herbs on top.Recipes excerpted with permission from ‘I Dream of Dinner (So You Don’t Have To)’ By Ali Slagle. Copyright © 2022 By Alexandra Slagle. Published by Clarkson Potter. \n\nBuy it on Amazon or Bookshop.orgHow would you rate Swordfish With Asparagus and Beans?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis was delicious! I made it as written except that I had salmon in the house and was too lazy to go to the store for swordfish. I will definitely make it again…and again…DELISH!Guilford, CT2/24/2022Just made it.  Used fresh dill.  It was absolutely WONDERFUL.  Used swordfish, followed instructions to the \"T.\"  Will be making this for guests soon.  The lemon is soooo good, makes it fresh and delightful.  Note: we felt the serving size was a bit large.  It basically calls for each guest to eat 1/2 can of beans, which seems to be a bit much.  But who cares?  It was so good, we ate it gladly.AnneCambria, CA2/22/2022I made this using Whiting because it’s what I could afford. The flavors were great, the vinaigrette was necessary to include something acidic. I thought the dish needed added texture since my asparagus wasn’t as crispy and everything else was mushy, so I topped it with garlic roasted bread crumbs. \nWould make again!KateNew York, NY2/20/2022Explore Bon AppétitDinnerWeeknightEasyQuickOne-Pot MealsGluten-FreeNut-FreeDairy-FreeSwordfishFishSeafoodMahi-MahiAsparagusVegetableNavy BeanBeanWhite BeanMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Ali Slagle"]}