{"id": "db56544a603ea4f992ef370f36889f82", "url": "https://www.bonappetit.com/story/oyster-sauce-explainer", "year": 2021.0, "month": 8.0, "day": 5.0, "content": "What Is Oyster Sauce? And How Do You Cook With It? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Oyster Sauce? And How Do You Cook With It?Your most pressing questions answered.By Ali FrancisAugust 30, 2021FacebookTwitterEmailPHOTO BY JULIAN COUSINSFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Oyster sauce stands alone! With the shake of a bottle, I can bless just about any pile of meat and vegetables with layers of complex salty-sweet umami flavor. What would Phat Sii Krong Neua or this Chicken and Corn Stir-Fry be without a dollop of the good stuff? And just THINKING about going back to spaghetti (yes, spaghetti!) sans oyster sauce gets me all grumpy face emoji.Yet, what is this magical brown sauce? Is it actually made of, well, oysters? And how can one start deploying it at home?For starters, oyster sauce is believed to have been invented totally by accident. In 1888 Chinese food stall operator Lee Kum Sheung left a pot of oyster soup on to simmer for so long that it cooked down into a thick brown paste. Sheung took a cheeky taste, not wanting to waste a full pot of food, and realized his caramelized concoction was rich, super savory, and perfectly delicious. So he called it “oyster sauce” and started serving it to his customers as a seasoning before going on to package and sell it under the now-iconic Lee Kum Kee Asian sauce empire.PHOTO BY JULIAN COUSINSLee Kum Kee Premium Oyster Sauce$6 at Weee!$17 at AmazonGood news: These days, oyster sauce is everywhere. So grab a bottle, kiss it on the cap, and use it to make any dish a better version of itself. Go wild! Experiment! Like the sauce itself, all the best things happen when you’re least expecting them.Is the grocery store stuff made of oysters too?This is one of those increasingly rare instances where a food product is, drumroll, as advertised. Even 133 years after Sheung’s discovery, Lee Kum Kee (as well as Kikkoman) is still making their sauces with something called “oyster extractives” (derived from oysters, water, and salt), along with sugar, salt, corn starch, flour, coloring, and my favorite ingredient, monosodium glutamate (MSG)—which is the same seasoning that makes Cool Ranch Doritos so difficult to stop eating. Also known as oyster-flavored sauce, be sure to check the label before you buy—the ones worth their brine will contain extracts made from real shellfish.Along with a jolt of flavor, oyster sauce adds a dark caramel color to any dish, which, according to assistant food editor Jessie YuChen, is referred to as “the sauce color” in Mandarin. It’s a shade you’ll notice in many Chinese dishes like stir-fried broccoli, Cantonese beef chow fun, and lo mein. Whether the color is coming from soy, oyster, or another brown sauce like hoisin, it’s a sure sign a dish is going to be tasty. The equation is simple, according to YuChen: “Brown = sauce = flavor.”What does oyster sauce taste like?Unlike fish sauce, which is decidedly fishy, lick a dollop of oyster sauce off your finger and you won’t think, “Wow, oysters!” But it is “absolutely loaded with flavor,” according to test kitchen director Chris Morocco. It’s sweet. And salty. But the flavors run deeper than that. The sweetness isn’t one-noted or cloying; it’s dark and developed, like caramel. The saltiness is less like table salt and more like ocean water (“in a good way,” says YuChen). And, sort of like anchovies, all that oyster flavor lends tons of umami and rich savoriness to the sauce. “It’s like four sauces in one,” says senior food editor Christina Chaey.Oyster sauce undoubtedly packs a punch, but to Morocco, it’s a perfectly balanced one that hits each note evenly. “It confers tons of flavor [to sauces, stir-fries, and dressings], without overwhelming the other ingredients,” he says.How do you cook with oyster sauce?A versatile condiment for Asian cooking and beyond, oyster sauce can happily stand alone or blend into the crowd. However you use it, a little goes a long way. “I simply finish off quickly cooked meat and/or veg with a plop of oyster sauce and call it a day,” says Chaey. But it’s also pretty much guaranteed to be delicious whisked into a marinade for steak or any meat; drizzled on steamed greens; spooned into meaty braises or soups; or added to your dumpling fillings and stir-fries.More of a recipe kinda guy? Here are some of our oyster sauce-y faves:Chicken and Corn Stir-FryPineapple Pork AdoboTri-Tip Steak With Tiger Bite SauceBlistered Green Beans With Fried ShallotsBo Zai Fan (Chinese Chicken and Mushroom Clay Pot Rice)Phat Sii Krong Neua (Thai-style short ribs)Grilled Brisket with Scallion-Peanut SalsaWhich brands of oyster sauce are the best?Of course, not all oyster sauce is created equal! Across the board our food editors prefer Lee Kum Kee’s Premium Oyster Sauce for that OG savory flavor. It’s “the security blanket of my condiment cabinet,” says Chaey. (According to the Lee Kum Kee website, if you want a milder flavor, try their Panda Brand Oyster Sauce.) YuChen also recommends Kikkoman’s Oyster Flavored Sauce, or Wan Ja Shan’s vegetarian mushroom-based riff for the shellfish-averse.Lee Kum Kee Panda Brand Oyster Sauce$4 at Weee!$12 $9 at AmazonKikkoman Oyster Flavored Sauce$11 at AmazonWan Ja Shan Vegetarian Mushroom Oyster Sauce$19 at Amazon (Pack of 2)What can be used instead of oyster sauce?While there really is nothing quite like oyster sauce out there, if your local supermarket is fresh out of the good stuff and you’re in a bind, choose your own adventure:Sub in the vegan “brown sauce” in this Bok Choy With Brown Sauce and Crispy Garlic recipe by Fat Choy chef and owner Justin Lee.Opt for the Indonesian sweet soy sauce Kecap Manis, which has the same starchy-thick texture and a similarly sweet-salty flavor, just without the shellfish-y notes.Use a dark (aged) soy sauce, or something like Healthy Boy Brand Mushroom Soy Sauce, which has similar transformative power—albeit a different flavor.Explore Bon AppétitIngredientsOyster SauceShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-30", "author": ["Condé Nast", "Ali Francis"]}