{"id": "db69f4fb57a5c85e5c1d3e05ee81d2e1", "url": "https://www.bonappetit.com/recipe/martini-bar", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Martini Bar Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueMartini BarBy Alison RomanAugust 13, 20195.0(4)Read ReviewsTriangleEmailPinterestPrintPhotograph by Michael Graydon + Nikole Herriott, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintTechnically it’s called a 50/50 since it’s half gin and half vermouth. As you won’t be individually stirring these 'tinis, water is added to aid in the dilution you’d normally get from ice. That’s necessary to transform the mixture from pure alcohol to a tasty, drinkable beverage. This is the cocktail hour course from Alison Roman’s “Steak House Night in America” menu: Low-and-Slow Rib Roast, Baked Potatoes Deluxe, The Greatest Creamed Greens, and Upside-Down Apricot Tart.Recipe adapted with permission from Nothing Fancy: Unfussy Food for Having People Over by Alison Roman (Clarkson Potter, an imprint of Penguin Random House, LLC). Copyright © 2019. Ingredients8 servings 2½cups gin2½cups dry vermouthOlive brine and olives, cocktail onions, and/or lemon twists (for serving)PreparationStep 1Combine gin, vermouth, and 1 cup water in any vessel large enough to hold all 6 cups of liquid. Stir until well combined (alcohol and water have different densities, so you need this step for proper mixing). Chill until ready to serve.Step 2Pour over a glass of ice (it doesn’t need to be a martini glass) and let guests garnish however they like. Olive brine and olives for dirty, cocktail onions for a Gibson vibe, and a lemon twist for, uh, a twist.How would you rate Martini Bar?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis is not a review, although I cannot wait to make this! However, I'm extremely curious about the orange cocktail glasses in the photo. Where can I get these?AnonymousHouston, TX4/25/2020Explore Bon AppétitCocktailDrinks AllMartiniGinAlcohol & Other DrinksVermouth5 Ingredients or FewerDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Alison Roman"]}