{"id": "db6e3789b01ab3003e6cecf111d53c4a", "url": "https://www.bonappetit.com/story/guest-house-raleigh", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "Guest House Is the Boutique Hotel I Wish I Actually Lived In | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureGuest House Is the Boutique Hotel I Wish I Actually Lived InLocation, location, location—and a killer backyard to boot.By Alex DelanyMay 29, 2019FacebookTwitterEmailCourtesy of Guest House RaleighFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m the type to spend as little time in my hotel as possible. It’s where I brush my teeth and sleep. And sometimes—if there’s a phenomenal lobby bar—where I have a drink. But during a stay at Raleigh, North Carolina’s Guest House, a historic home that was recently transformed into an eight-room inn, I found myself spending a suspicious amount of time on the property.First there are the rooms, furnished in the clean, minimalist way I wish my apartment was: Breezy white linens. Sleek white lighting fixtures. Touches of light wood. Modular desks. Little Marshall speakers that beg to be plugged into. Then there’s the communal kitchen area and the backyard—two of the most appealing places to be. The brick patio, with its views out onto downtown and its smattering of places to sit and kick back, is the perfect spot to hang in the afternoon; and the kitchen, with is bright, airy vibe and small cafe tables offers prime breakfast-time seating.The clean view from one of the kitchen’s cafe tables.\nPhoto by Emily LyonswoodBut what makes all this even more pleasant is the inn’s proximity to some of Raleigh’s finest food and drink shops. Five minutes to Brewery Bhavana to buy cold beer. A minute further to Short Walk Wines for bottles of natty, light-bodied French red. A quick walk in the opposite direction puts you at Transfer Co. Food Hall, home of Raleigh’s excellent Benchwarmers Bagels.So, yeah, I still got to spend lots of time roaming the city. It just meant that I planned each day around exactly the right places I wanted to hit up, so I could pick exactly the right spoils to bring back to my adopted home.Go there: Guest HouseExplore Bon AppétitHighly RecommendRaleigh, NCHotelsTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-29", "author": ["Condé Nast", "Alex Delany"]}