{"id": "db8ce53eea41d7d1224e4e32611c277a", "url": "https://www.bonappetit.com/recipe/best-ever-grilled-cheese", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "Best-Ever Grilled Cheese Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2015 IssueBest-Ever Grilled CheeseBy Alison RomanPhotography by Michael Graydon Nikole HerriottFebruary 24, 20223.6(465)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon and Nikole HerriottEmailPinterestPrintEmailPinterestPrintNo matter the hour (or your age), a grilled cheese sandwich is the pinnacle of crave-worthiness. This rendition doesn’t attempt to reinvent the classic. It just guides you toward making the best-ever version of it. But there are a few rules you must follow:Butter goes in the pan not on the bread. To ensure golden (not burned) toastiness, the exterior of the sandwich should be slicked with mayo, which has a higher smoke point than butter and possesses the combined browning power of oil and egg yolks. When mayo-slicked bread meets buttered pan, that’s when the magic truly begins.Opting for a cheese that melts well is paramount: American is the melting-est cheese there is, but a young cheddar cheese works well too and brings deeper flavor. If you want to go off-script, stick to a soft or semisoft cheese. Their high moisture content means they’re especially adept at turning molten.Once the sandwich is in the pan, pressing down with a spatula is helpful for achieving even toasting—and for encouraging bread and cheese to meld together. But don’t be overzealous; this is not a smashed cheese sandwich.Cut the sandwich diagonally. It’s official: Sandwiches cut this way actually taste better.Ready to serve? A bowl of tomato soup is an optional accompaniment but highly encouraged.If you’re looking for grilled cheese recipe riffs, we have those too. There’s one with a kick courtesy of  mustard and pickled jalapeños, another inspired by cheesy garlic bread, and many more.Editor’s note: This recipe originally appeared in our March 2015 issue.IngredientsMakes 1 awesome sandwich2slices ½”-thick Pullman or other white bread2tablespoons mayonnaise1tablespoon unsalted butter2ounces thinly sliced American cheese or cheddar (about 4 slices)Freshly ground black pepperTomato soup (for serving; optional)PreparationPlace bread on a cutting board and spread mayonnaise over top side of each; this is key to a golden, delectable crunch. Heat a small skillet (nonstick, ideally) over medium. Slide in half of butter. When it melts, place 1 slice of bread, mayonnaise side down, in skillet; top with cheese; season with pepper. Top with second slice of bread, mayonnaise side up. When underside is golden brown, about 4 minutes, turn sandwich and add remaining butter to skillet. Press down on sandwich to encourage even browning and to help melt cheese—be gentle, don’t smash it. Cook until second side is golden brown and cheese is melted. Eat immediately, preferably with soup.Nutrition Per ServingCalories (kcal) 810 Fat (g) 52 Saturated Fat (g) 19 Cholesterol (mg) 95 Carbohydrates (g) 63 Dietary Fiber (g) 3 Total Sugars (g) 11 Protein (g) 18 Sodium (mg) 1400How would you rate Best-Ever Grilled Cheese?Leave a ReviewTell us what you thinkReviews (47)Back to TopTriangleJust a quick to on cheeses ... Grilled cheese w tomatoes is my desert island food I cannot live without cheese that being said the best two cheeses for grilled cheese is a brand called cooper sharp American cheese! It gives you the creamy ooey melty goodness off American but has a sharp taste of a mild sharp cheddar it's amazing if your looking for a more tasty grilled cheese ...my other choice is from land o lakes it's a 4-cheese blend of American, asiago, parmesan, and romano cheese packed into a creamy American cheese slice type of cheese.  The nutty taste of the Italian hard cheeses w the golden brown butter is amazing especially if you like a slice of tomatoe in your Sammy like I do ☺️Cheesy obsessionProvidence, RI3/17/2022I have been doing this for years and love it. It's one of my little kitchen hacks that I tell everyone about. The mayo just helps to crisp up the bread. I don't know about putting 2 tablespoons on it...I just spread a thin layer on the outside of the bread and it works like magicAlexandraNew Jersey3/16/2022Mayo on a grilled cheese, YUK! Your fired!Ricky Boy BleuNY, NY3/15/2022IT WAS DELICIOUS \nWILL DEFINITELY MAKE AGAIN\nAnonymous3/12/2022poopoodeezpot of creation3/9/2022I tried this recipe and was very disappointed. The mayonnaise prevented the bread from getting crispy. It took forever for the bread to even start to brown and it was still soggy. I think it's better to just use butter only. Lee MatrixVirginia2/18/2022Wow I made this grilled cheese and it was so good I haven’t ate anything else since then. I believe im getting backed up but I don’t give a hoot I’ll  deal with that at a later time, I believe I have the best daily schedule because of this said sandwich. I won’t go into my whole day but after I get done walking my toaster and feeding my radio I fire up the ole stove for one of these sandwiches. AnonymousOh, hey11/17/2021BEST GRILLED CHEESE EVER. I MADE THIS FOR MY BEST FRIEND AND SHE ATE IT ALL. SHE SAID THAT SHE'S ALLERGIC TO MAYO AND LACTOSE INTORELANT AND STARTED TO DANCE WEIRDLY ON THE GROUND. I THINK SHE REALLY LIKES THE GRILLED CHEESE BASED ON THIS RECIPE. THANKS, I'LL CONTINUE TO MAKE HER GRILLED CHEESE WITH THIS RECIPE.Jane's FriendSomewhere in the corner of the universe11/4/2021Yeah that works, delic. AnonymousEngland 10/27/2021These are really good instructions. I followed everything exactly like the person posted. There were a little issues here and there, but nothing I couldn’t resolve on the fly.\n\nI finally was able to rebuild my transmission for my car. Thanks!SuperGuySeattle, WA10/23/2021I found that this recipe did make for a better crunch. However, I also found that it took away from the flavors of the classic we love. If you have a go to comfort food recipe for grilled cheese, I suggest staying with it.  That’s my opinion for my taste. I encourage everyone to try it, tweak it,  and experiment with it.  If nothing else, there’s always your old favorite to fall back on when you need it most. Norman Colorado10/23/2021I used a hearty whole grain bread with provolone. I can't stop making it for lunch! The only downside is the timing. 4 minutes on 4 on my gas stove in a cast iron skillet is too much. I'm still tinkering. Even a little over-cooked this sandwich is a delight! Mayonnaise? Whoda thought!RobWashington, DC10/21/2021these comments are life-altering lol.  will be trying this soon. looks sooo good.IcyboiChicago, Illinois10/15/2021Sooooo, made this sandwich while watching hockey thinking since it was just preseason I wouldn’t get very invested in the game. I thought wrong, got caught up in the game and forgot to turn the sandwich after 4 minutes and ended up burning one side. On the bright side the sandwich still tasted great ( that’s how good this recipe is) and on an even brighter side my team won. Kathleen Valentine Las Vegas NV 10/10/2021This was the best grilled cheese ever, I brought it to the elementary school and got 7 kids to eat it in my van, this is better then candy, 100% recommended this to all your local kid lovers. Joe momYour moms house 9/27/2021Explore Bon AppétitSandwichAmericanCheeseCheddarQuickEasy5 Ingredients or FewerMainNut-FreeVegetarianSearLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2015-02-17", "author": ["Condé Nast", "Alison Roman", "Michael Graydon Nikole Herriott"]}