{"id": "db9eaa092fd910be5551af114f0f83c3", "url": "https://www.bonappetit.com/story/bookends", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "These Bookends Are My Excuse for Buying All the Books | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Bookends Are My Excuse for Buying All the BooksThey're stackable, colorful, and very chic.By Aliza AbarbanelApril 20, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!My love of books has always been a point of pride—until I started renting a one-bedroom that’s, well, not exactly spacious. Throw in the fact that I live with a masters student who collects political theory texts with the zeal of a manic librarian, and my precious stacks of novels started to feel more like clutter than prized possessions. Enter: Tortuga’s Dumbo Bookend.These stackable steel arches are designed by Ciszak Dalmas in collaboration with Tortuga, a modular furniture company with an eye for mobility. I was instantly drawn to the “Saraha” trio, because desert landscape tones speak to my heart and match the houseplants slowly taking over my living room. (Yes, I’m a millennial stereotype.) Best of all, the bookends can be turned to display a single prized item, like my copy of Where Cooking Begins. With a totally reasonable price point—and a tidal wave of spring releases on the horizon—completing my set just feels right. — Aliza Abarbanel, Healthyish assistant editor.Buy it: Tortuga Dumbo Bookend, $28–$32.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish Loves ItHealthyishDesignShoppingRead MoreLifestyleA Tool to Clean (Like Really Clean) Your TongueBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-20", "author": ["Condé Nast", "Aliza Abarbanel"]}