{"id": "db9f27f630694aca1b0b043344afe037", "url": "https://www.bonappetit.com/story/caramel-apple-feud", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "A Beefy Stir-Fry That Requires Only the Laziest Knifework | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Beefy Stir-Fry That Requires Only the Laziest KnifeworkChop, chop, done.By Alex BeggsOctober 19, 2019FacebookTwitterEmailPhoto by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Lazy knifeworkSounds like the title of an unreleased thriller about a line cook with a taste for murder (AGENTS, CALL ME). But in fact, it is the best part of a beef-and-ginger stir fry that Christina Chaey made this week. “The thing I deeply love about that recipe,” she said, “is it’s got the laziest possible knifework. Slice ginger, slice onions, slice beef, done.” I watched on Instagram Stories as she tossed everything about and when I saw those onion rings, I knew what I was cooking this weekend.Make it: Beef and Ginger Stir-FryWant this letter before it hits the website? Sign up for our newsletter!Gobble gobble gooOur Thanksgiving issue is out in the world, coming to a mailbox or checkout aisle near you soon! And this year, we did EIGHT covers, each a different editor holding a succulent roast turkey (cooked in parts—oh yes, it’s happening). The editors are the stars of Making Perfect: Thanksgiving, which is now on Bon Appétit’s Roku and Apple TV channel—this is how we make money, people—and then rolling out weekly on YouTube. The magazine covers are photographed artfully chin-down, so Rachel Karten started taking photos of staffers around the office completing the cover with their own faces. See below—and then take yours.Watch it: Making Perfect: ThanksgivingSubscribe: The magazine’s on sale for $10 right now, just sayin’.Overheard in the Test Kitchen“People aren’t ready for dried fruit in soup.” —Andy BaraghaniPHOTO BY ALEX LAU, FOOD STYLING BY REBECCA JURKEVICH, PROP STYLING BY KALEN KAMINSKIGo all outI was in Detroit last weekend for a very special golf tournament that raised money for my partner’s dad’s cancer doctor + research team at the University of Michigan. In between getting experimental cancer treatments approved (but mostly denied) by evil insurance companies, Big B has been eating as much as possible while he has regained taste buds and appetite. And so we came to FEAST (and watch DVRed Jeopardy!). What was the most dramatic meat we could cook? Chris Morocco’s epic roast beef, DOUBLED. “Did you guys win the lottery?” Chris asked. Well, depends on how you look at it. Keep an eye on the temperature, he told me. We dropped some coin on strip loin and cooked that roast for hours and then broiled it for the final browning. On the side we had 8 lbs. of Andy’s buttery, garlic-infused mashed potatoes, his lemon-zesty salami bites with Marcona almonds as an appetizer, Konbi’s shishito pepper-pistachio dip, roasted carrots, and a big salad. I’m not done!! For DESSERT, I baked Four and Twenty Blackbirds’ salted caramel apple pie, which was as over the top as it sounds. And lemon bars for a palate cleanser. Crowd your house with people you love, eat like you won the lottery, and carry on.Sit back and clapI loved this Glamour feature about 12 people changing the food world.RICKWhenever Rick Martinez is in the Test Kitchen, my heart lights up. He’s just so infectiously happy, and maybe that’s from all the cookies (his nickname is “Sugar Man”), but it’ll turn your day around. He was making tortillas for an upcoming Healthyish recipe. “I miss the bacon fat,” he sighed. But that reminds me, we do have a recipe for bacon fat tortillas, which Rick made on camera here. See him staring lovingly at the frying bacon, above. That could be you.Make ‘em: Taco Norteños with Bacon-Fat Flour TortillasAlex LauWhat’s Jesse cooking“Atrocious monkey bread,” said Jesse, who took on Claire Saffitz’s cinnamon-syrupy recipe last weekend. “What happened?” I asked (picture me as Lucy behind the psychiatrist booth). “Some of the top got stuck in the pan while I was unmolding it, and I think there was a yeast issue. I’m gonna write a personal essay titled ‘Yeast Taught Me, a Perfectionist, Everything I Needed to Know About Failure.’” Then he made Claire’s apple cake a second time.Bake it: Monkey Bread OR Apple-Walnut Upside-Down CakeLook at all the readers also making Claire’s apple cake!How many times do I have to write about this ‘til y’all make it!Unnecessary food meme of the weekUnnecessary food feud of the weekAlex LauIt’s October, my black cat’s birthday, and the time of year I want to buy a bag of caramel apple lollipops, ONE of the greatest Halloween candies of all time. I said one! But the food they’re inspired by—not so great. IMO, they’re difficult to eat and I’d rather buy a tub of dulce de leche, slice my own apple, and dip each slice individually, and generously. Matt Hunzinger agrees, with a meme:“tired: full caramel apple (impossible to eat)wired: sliced apples with caramel to dip”Carla Lalli Music is also a hater: “Last time I checked I didn’t want to rip out all of my teeth and get gluey caramel syrup all over my face and in my hair at the same time.” Adam Rapoport reports: “The apples are mealy on the inside. People like the look, the notion of them, but no one likes to eat them.” But Hilary Cadigan LOVES caramel apples, especially after corn dogs and/or a turkey leg. Cadigan the carnie! “Hate,” said Sarah Jampel. “Difficult to eat,” said Sasha Levine. “Caramel apples are SITUATIONALLY delicious,” defended the scholar Jesse Sparks. “I feel like people are mad that they’re eating caramel apples in bad circumstances.” Molly Baz went “soul-searching and found nothing.” Meryl Rothstein jumped in: “I think a lot of you are conflating candied apples with caramel apples but both are not good.” Andy Baraghani is “into them. And then I run to the dentist and deny, deny, deny.”Love ‘em? Make these miso-caramel apples then!Explore Bon AppétitBeggs NewsletterRead MorecookingEverything That Goes Into Making the Absolutely, Positively Perfect Thanksgiving TurkeyBy Alex BeggscultureMy Favorite American Pastime Is a Baseball Helmet Full of NachosBy Alex BeggscultureI Made the Mushroom Pasta. Now It’s Your Turn.By Alex BeggscultureApple Pandowdy, Where Did You Come From?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-19", "author": ["Condé Nast", "Alex Beggs"]}