{"id": "dbb741e190235bc5d48ca4bb7e3d0c39", "url": "https://www.bonappetit.com/story/what-is-dashi", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "What Is Dashi, The Fastest Route To A Flavorful Meatless Broth | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDashi Is The Fastest Route To A Flavorful Meatless BrothIf you can steep tea, you can make dashi.By Sarah JampelOctober 29, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailLook up umami in the dictionary and dashi is what you'll find. It tastes as rich and complex as a broth or stock that's been simmering for hours, but it takes less than 15 minutes to make and, in many cases, is built on just one or two ingredients. How is this possible?!?!Dashi actually refers to a group of broths that can be made from steeping various ingredients in either cold or warm water. The simplest dashi is vegan, made from cold-brewing kombu (more on that below), while stronger versions are created by squeezing the flavor out of bonito flakes (katsuobushi), dried sardines, dried shiitake mushrooms, dried shrimp, dried scallops, adzuki beans, and/or toasted soybeans.Among the different dashi, the common thread is the incomparable umami flavor. What does that mean exactly? Translating roughly to “deliciousness” in Japanese, umami is that rich, savory, tongue-coating quality that lingers on your tongue and makes certain foods so irresistibly delicious. The sensation of umami (and its primary source, the amino acid glutamate) was discovered in 1908 by Dr. Kikunae Ikeda, who linked glutamate to kombu. In the years since, food scientists have identified other chemical compounds where umami exists. And when various sources of umami are present at the same time, the taste is not just added but multiplied (like how when you're chatting at normal levels with one friend and another friend comes along, you all somehow end up screaming).All of this explains why the most popular dashi—and the one that you'll make for our Soba Soup With Shrimp and Greens—is such powerful stuff. Kombu and katsuobushi (a.k.a. bonito flakes) provide two different sources of umami (glutamic acid from the kombu, inosinic acid from the bonito flakes), which means that the flavor of the dashi is waaaaaay greater than the sum of its parts.Be sure to strain out ALL of the bonito flakes.\nPhoto by Chelsie Craig, Food Styling by Yekaterina Boytsova\"Dashi is as simple and as easy to make as steeped tea,\" writes Sonoko Saki in her forthcoming book Japanese Home Cooking, but \"it is nevertheless the foundation of Japanese cuisine. The success of a Japanese dish often lies in the flavor of the dash.\" The highest compliment a chef or cook can receive, she explains, is \"Dashi ga kiiteru!,\" which means that the diners can taste the quality of the dashi.While chefs spend their entire career perfecting their dashi, the layperson's rudimentary version is simple. You'll start by soaking kombu (a large seaweed belonging to the family of brown algae also referred to as kelp). Be sure not to rinse it first: The white specks on the surface aren't packaging residue but deposits of mannitol sugar, which contribute to its sweetness and umami. Once the kombu is soft and flexible (about 10 or 15 minutes), turn the heat to medium and bring it up slowly, during which the kombu will release those valuable, flavorful compounds. You don't want the water to boil because that can result in bitter dashi, so remove the seaweed as soon as you see bubbles rising to the surface.Next, add the katsuobushi, wispy, light pink flakes made from shaving a block of dried bonito (skipjack tuna), and bring the water to a boil. Turn off the heat and let the flakes sit. The longer they steep, the fishier your broth will taste (so, uhh, set a timer!). Strain out the fish flakes and...that's it! You've made dashi. (Save the kombu and the bonito in the fridge: You can simmer them together, along with another handful of bonito flakes, if you have them, for secondary dashi, known in Japanese as niban dashi).Use dashi when you're boiling rice (or making congee), as the basis of miso and noodle soups, or to gently cook a piece or fish. With kombu and bonito flakes in the pantry, you're always a few minutes away—and during cold/flu/general ailment/cookies-everywhere season, you can't really ask for anything better.Get the recipe:Soba Soup With Shrimp and GreensDashi is the fastest route to a savory, slurp-able broth—and there are no loooong simmers or bags of chicken bones necessary.View RecipeExplore Bon AppétitJapaneseSeaweedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-29", "author": ["Condé Nast", "Sarah Jampel"]}