{"id": "dbbad0c44025c1752acea8700a1f175b", "url": "https://www.bonappetit.com/recipe/chocolate-dutch-baby", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Chocolate Dutch Baby Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueChocolate Dutch BabyBy Claire SaffitzJanuary 25, 20184.2(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's Bridge, styling by Molly BazEmailPinterestPrintEmailPinterestPrintIntroducing a warm chocolate dessert that is way simpler and faster than a soufflé (no beaten egg whites) or a molten chocolate cake (no double boiler) but every bit as delicious.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketGlass Measuring Cup$19.99 At AmazonMeasuring Spoons$10 At Bon Appétit MarketMedium Skillet$60 At AmazonWhisk$10 At AmazonMedium Bowl$17 At AmazonPlastic Wrap$9.84 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEASmall Saucepan$155 At AmazonMedium #40 Cookie Scoop$16 At AmazonIngredients2 servings3large eggs⅓cup all-purpose flour¼cup sugar3tablespoons unsweetened cocoa powder¾teaspoon kosher salt, plus more½cup whole milk1ounce bittersweet, semisweet, or milk chocolate¼cup heavy cream1tablespoon unsalted butterCoffee ice cream (for serving)PreparationStep 1Arrange a rack in center of oven; preheat to 425°. Place a dry medium skillet on rack to preheat.Step 2Whisk 3 eggs,  ⅓ cup flour, ¼ cup sugar, 3 Tbsp. cocoa powder, and ¾ tsp. salt in a medium bowl until smooth.Step 3Whisking constantly, slowly stream ½ cup milk into egg mixture. Cover with plastic and let batter rest 15 minutes.Step 4Meanwhile, chop 1 oz. chocolate and transfer to a small saucepan. Add ¼ cup cream and cook over low heat, whisking often, until chocolate is melted and mixture is completely smooth; season with a pinch of salt. Keep warm over low heat.Step 5Remove skillet from oven and add 1 Tbsp. butter; swirl skillet to melt, making sure to coat entire bottom and sides of skillet.Step 6Give batter a quick whisk to reincorporate, then pour into skillet. Quickly transfer to oven, taking care because the handle is hot.Step 7Cook until pancake is dramatically puffed and edges are curling inward toward center but center is still moist, 10–12 minutes. Remove skillet from oven (watch for that handle again) and let rest about 2 minutes. The pancake will immediately begin to fall, but that’s normal. Meanwhile, pull ice cream out of freezer to let it soften slightly.Step 8Top with 2 scoops ice cream and drizzle with warm chocolate sauce; serve warm.How would you rate Chocolate Dutch Baby?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleWhen did you add the chocolate to the batter? Did I miss a step?deb1bakerNorfolk VA4/21/2021Very good and very easy. Too dark for a couple of my kids, but that's how I like it, so that's how I made it! 😁 I don't have an oven safe skillet so I used an 8x8 glass pan instead. I could get 9 servings from it. kwood8Midwest9/19/2018This dessert was delicious and easy! Made no adjustments, even though the salt scared me a little. Could easily serve 2-4 people, especially with added scoops of ice cream.AnonymousNew York2/15/2018Explore Bon AppétitPancakeDessertChocolateOther IngredientsEasyNut-FreeBakingBreakfastBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-25", "author": ["Condé Nast", "Claire Saffitz"]}