{"id": "dbbfba56dda8308f3b17e7b27f96b40c", "url": "https://www.bonappetit.com/recipe/grilled-swordfish-with-tomatoes", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Grilled Swordfish With Tomatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueGrilled Swordfish With TomatoesBy Kendra VaculinMay 25, 20214.4(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintIf you’re new to grilling fish, swordfish steaks are the perfect place to start—sturdy, skinless, and meaty, they take to the grill like a champ. The key is to not overcook them. You’re shooting for an internal temperature that’s just shy of 135°F, which will yield meat that’s just-opaque and juicy. If your fish is sticking to the grate once your timer dings, don’t panic: As long as your steaks are properly oiled, they’ll release easily when they’re ready.I like to finish my fish with a relish-y tomato topping flavored with saffron, almost-crispy garlic, and buttery olives for a superfast and summery dinner that begs to be eaten outdoors. Multi-colored cherry tomatoes from the farmers’ market make for the best presentation, but aren’t strictly necessary; a cold bottle of wine at the ready, on the other hand, is non-negotiable. —Kendra VaculinThis recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSmall Saucepan$155 At AmazonFish Spatula$14 At AmazonLarge Basting Spoon$16.37 At AmazonCutting Board$10 At IKEAIngredients4 Servings2Tbsp. vegetable oil, plus more for grill21\"-thick swordfish steaks (about 12 oz. each)Kosher salt3Tbsp. extra-virgin olive oil2garlic cloves, thinly sliced½tsp. saffron threads12oz. cherry tomatoes, halved, quartered if large1small bunch chives, cut into ½\" pieces (about ¼ cup)½cup coarsely chopped parsley½cup Castelvetrano olives, smashed, pits removed1Tbsp. sherry vinegar or red wine vinegarFreshly ground black pepperPreparationStep 1Prepare a grill for medium-high heat; oil grate with vegetable oil. Season fish on both sides with salt. Pour 2 Tbsp. vegetable oil into a shallow bowl or a baking dish; add fish and turn to coat.Step 2Heat olive oil in a small saucepan over medium-low. Add garlic and saffron, crushing threads between your fingers, and cook, stirring occasionally, until garlic is just starting to turn golden at the edges, about 2 minutes. Scrape into a medium heatproof bowl; set aside.Step 3Grill fish until firm when gently pressed and opaque throughout, about 5 minutes per side. Transfer to a platter.Step 4Add tomatoes, chives, parsley, olives, and vinegar to bowl with reserved garlic mixture and toss to combine; season with salt and pepper. Spoon over fish.How would you rate Grilled Swordfish With Tomatoes?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangle5min per side at medium high is about a minute too long per side for most swordfish steaks—they will end up overcooked and tasting like rubber. I also agree with other reviewers that this would have been better if the tomatoes were cooked, and that the sauce needed something else—this was a pretty, but mediocre, dish.MaryBrooklyn, NY10/7/2021The picture was so wonderful that I expected this to be at least a 4-star recipe.  My daughter said I was brave to serve something to company before testing it first.  I told her so many \"bon appetite\" recipes are so great, that I was not worried.  Well, I ate my words.  This recipe was okay, but that's not what I was going for.  My food was picture perfect, but the taste was lackluster.  I think the recipe called for too much parsley (or maybe I packed mine too tightly).  Also, I think it would have been better if the tomatoes were cooked.  I'm not saving this one in my recipe box.Mary-DeeLaguna Hills, CA7/26/2021Lovely simple preparation. Must like safforn.AnonymousBrooklyn, NY7/13/2021Me encanta esa recetaAnonymousMexico7/7/2021Delicious! Very refreshing and rich at the same time. JohnSag Harbor7/6/2021This recipe was delicious and easy! The market didn't have swordfish, so we had salmon (in the pan not grilled) and it was still incredible with the relish. Will make again! RLD7/6/2021So its pesce spada alla Siciliana minus all the good stuff? \nAdd in pine nuts and raisins to your sauce if you want a truly great recipe.\n\nAlso, cite your sources...JasonPhiladelphia, PA6/28/2021Very tasty and very easy, however, next time I make this I will use half butter and half olive oil to sauté the garlic and will add  half of the tomatoes to the butter/oil / garlic mix to cook them a bit for more flavor and to release some of their juices.  Very colorful and flavorful.  I had extra tomato/olive mix left over and ate it over mixed greens the next day.  Will make this again.KathyDenver6/27/2021Fabulous and very easy!  Great dinner party dish. DeniseSugar Land, Texas6/20/2021Delicious! Made a few adjustments: used red snapper instead swordfish and, of course, added butter! I also added some thyme at the end. Lovely and light. Anonymous6/7/2021Explore Bon AppétitSwordfishFishSeafoodCherry TomatoTomatoVegetableCastelvetrano OliveOliveOther IngredientsSummerQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeKetoHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Kendra Vaculin"]}