{"id": "dbc0c87c73232c694e1e1ed586a870c0", "url": "https://www.bonappetit.com/story/bamboo-pot-scraper", "year": 2020.0, "month": 7.0, "day": 4.0, "content": "I’m Cooking and Doing Dishes Nonstop, and This Bamboo Pot Scraper Keeps Me Going | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m Cooking and Doing Dishes Nonstop, and This Bamboo Pot Scraper Keeps Me GoingThe Bambu scraper has been a longtime favorite in my kitchen, but recently I’ve gained a new appreciation for it.By Michele OutlandJuly 24, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’ve been keeping this humble yet mighty bamboo pot scraper perched at my sink for years now. A dear friend of mine gave it to me as a gift, which to be perfectly honest, I thought was a little curious. Then I started using it. It quickly reached permanent staple status, and I didn’t think I could love it more—that is, until I started sheltering at home. I’ve been cooking a lot and doing the dishes nonstop—or at least that’s what it feels like! These pot scrapers make all that cleaning a little easier by removing stubborn bits of cooked-in food without scratching the surface of your pots and pans. Each corner of the scraper is a different shape, so one edge is more like a right angle and another more rounded. That means it can fit into almost any pan curve or tight baking sheet corner, so you never miss a spot.Plus, the scrapers are made of a natural, organic material that seems to last forever: bamboo! It feels nice in my hand and is super sturdy; I’ve been using that same scraper for all this time. The Bambu site has recommendations for how to care for it, but I don’t do any of it and it’s still going strong. It’s the gift that keeps on giving, especially now when I’m cooking and cleaning more than ever. I think I might start sending them to my friends, too.Buy it: Bambu Pot Scrapers, $14 for a set of four on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingCleaningRead MorecultureThe Test Kitchen Has a Favorite Sponge—and It Never SmellsBy Gaby Melian Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-24", "author": ["Condé Nast", "Michele Outland"]}