{"id": "dbc12bce335dc53096512f7249be2319", "url": "https://www.bonappetit.com/story/rent-week-pesto-roasted-vegetables", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "Pesto-y Roasted Vegetables Make Rent Week Bearable | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPesto-y Roasted Vegetables Make Rent Week BearableThe dinner you need when your wallet is empty and your crisper is half-full.By Alex DelanyMay 4, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI used to live with a dude named Chris Fenimore. I moved into my first apartment in New York City with him as a roommate, and although Feni—that's what we call him—no longer lives with me, I’m still shacked up in the same spot. A few months ago, I found his banged-up record player in the back of my closet, something that Feni left behind when he moved out, and I decided to finally show it some love. Since then, I’ve spent entirely too much money on records and have quickly fallen into the labor-intensive habit of searching through the cheap bins at Manhattan’s most suspect record purveyors. To be honest, I love it. But the lesson here is that things left laying around still have value, whether those things are found in your closet, the dollar crates at a record store, or deep in the vegetable bin of your refrigerator.In fact, the stuff in your fridge is probably more valuable than whatever’s hanging with the gym socks in the bottom of your closet. The odds and ends in your fridge are edible! Records, sadly, are not. So when it comes to Rent Week, you should be looking at the rogue carrots, beets, alliums, and other vegetal delinquents in your fridge as potential dinner options. Especially once you know how to roast the hell out of them, toss them in a rough pesto, and serve them over grains.That’s right. This Rent Week recipe is a grain bowl. Surprise! I like grain bowls! I’m a millennial! I’ve been told that grain bowls come with the territory. So smash the play button on this playlist filled with tunes from the early '70s (inspired by the cheap bins at the record store and totally free of charge) and get ready to be resourceful. Just like your parents always wanted.To start, we roast some vegetables in an oven set to 425°. Like I said, the exact makeup of your vegetable mix depends on what’s in the fridge, but you should make sure you have at least one bunch of carrots (preferably mixed in color) with the greens still attached on the top, one kind of allium (I prefer about 5 shallots), and two of the following vegetables that have some kind of heft to them: 1 head of broccoli, 1 bunch of broccolini, 1 head of cauliflower, 5 beets, 2 sweet potatoes, or 2 cups of Brussels sprouts all work.The colors, Duke!\nPhoto by Chelsie CraigWe want to do minimal work to the vegetables before they go in the oven. Remove the greens from the top of the carrots off and save them. Peel the outer layer off of your alliums. If they happen to be shallots, slice them in half. If it’s a white onion, slide it into quarters and separate the layers. Beets can be sliced in half, once the greens are discarded. Basically, you want everything to be about the same size, so it roasts at a similar rate.Dump the cleaned and chopped vegetables on a sheet pan and toss them with a drizzle of olive oil. Season the whole tray with some kosher salt. That’s all you need. Fat and salt. The good stuff.Once those go in, we start our grains. I’m not going to pressure you into anything. There are a bunch of ways to cook rice and grains. I want you to do what you think is right. Maybe it’s steaming some white rice like this. Maybe it’s cooking some farro or Healthyish grains like this. Or maybe it’s mixing half white rice and half mixed grains in your rice cooker. Whichever way you chose, use 3 cups of the dry stuff. (Having leftover grains is always useful.)While the vegetables and the grains cook, take the carrot tops and roughly chop them, so you have about 1 cup carrot greens (tightly packed). BTW, we’re making a pesto with carrot tops, which are 100% edible, as well as tasty. This is Rent Week: We should be using every bit of food we can! (If you don't have any carrot tops, a mix of herbs like parsley, dill, basil, and/or cilantro will work.) Mix the chopped carrot tops, ⅓ cup roughly chopped nuts (whatever you have on hand that aren’t peanuts), ½ cup olive oil, and ¼ cup white wine vinegar. Mix them together, and season with a few pinches of kosher salt.The vegetables will be finished before the grains. Take them out when they are tender and crispy, with some solid color across the lot. This will take between 20 and 30 minutes, but pay attention to how they look and feel more than you do the timer. Let the vegetables cool, and slice the carrots into thirds. Roasted vegetables don’t need to be hot to be delicious. We’ll serve these at room temperature.Pour the pesto over your vegetables and toss them to coat. If you went wild with the amount of veggies, and they look a little dry, feel free to add another glug of olive oil, white wine vinegar, and another pinch of salt to make sure the pesto covers more surface area.Dinner. Is. Served.\nPhoto by Chelsie CraigAnd then you grab a bowl, scoop some rice or grains, and plop a big ol’ heap of vegetables on top. This dish isn’t about beautiful plating or artistic presentation. This is about using what you have to make sure you go to bed with a belly full of food—food that you enjoyed eating.The roasted vegetable bowl is the same as my record player. The built-in speakers are shit. The needle needs to be replaced. There's dust lodged into places it will never exit. It’s not the world's sexiest record player, but it does what matters: It plays music. It makes me happy. Just like a pesto-y bowl of rice and roasted vegetables.Not into vegetables at the moment? Fine. Let's do chicken thighs.These Crispy Chicken Thighs Are the Only Way to Start the YearChicken thighs, with garlic-honey, are here for the first Rent Week of the year. Breathe. You're in a space now.View StoryExplore Bon AppétitBasicallyRent WeekRoasted VegetablesCarrotShallotBeetbrussels sproutRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-04", "author": ["Condé Nast", "Alex Delany"]}