{"id": "dbe39234b60be771911992888ffa6e05", "url": "https://www.bonappetit.com/story/bavel-los-angeles", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Bavel’s Lamb Neck Shawarma Brings Out My Inner Carnivore | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsBavel’s Stupid Juicy Lamb Neck Shawarma Brings Out My Inner CarnivoreAt chef Ori Menashe’s temple to hummus and pita, this tender, smoky meat dish steals the show.By Aliza AbarbanelApril 2, 2019FacebookTwitterEmailPhotograph by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Diners brave L.A. traffic for the hummus at Bavel, chefs Ori Menashe and Genevieve Gergis’s new Arts District restaurant. But when a platter of slow-roasted lamb neck shawarma makes its way from the kitchen’s wood-burning fire through the cavernous dining room, all eyes turn to the meat. You can’t blame them: The imposing on-the-bone cut isn’t as common as, say, lamb chops. And that’s exactly why they chose to include it on the menu here, and at their Italian hot spot Bestia too.“Our philosophy at both restaurants is utilizing all parts of the animal,\" Menashe says. “This is one of the parts that the butcher is always stuck with, because nobody wants to deal with the neck. We figure out ways to showcase how good it can be.”The layers of flavor begin with a carefully balanced blend of spices—cardamom, allspice, black pepper, sumac—mixed with an onion purée that caramelizes as the lamb slow-roasts for 12 to 16 hours. Then the meat is finished in a wood-burning oven and served up tableside with a fleet of spicy, pickle-y condiments and a fluffy mound of hot laffa flatbread. The presentation makes one thing clear: This is not a meal for forks and knives. It’s a total hands-on affair, with the laffa as the best tool for nudging the smoky, tender meat off the vertebrae straight into your mouth. Add tahini, crunchy pickles, and fiery amba sauce at will, then use whatever is left of the bread to soak up every last puddle of lamb juices. This is a dish worth savoring until the very end.Go There: BavelExplore Bon AppétitLos AngelesMiddle EasternHighly RecommendRestaurantsLambRead MorerestaurantsHow a Cheap, Bent-Up Composition Notebook Helped Me Open a RestaurantBy Ori MenasheRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Aliza Abarbanel"]}