{"id": "dbeb43e4e13a0b9edc64a6f3d616a4b2", "url": "https://www.bonappetit.com/recipe/garlicky-bok-choy", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "Garlicky Bok Choy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGarlicky Bok ChoyBy Sara Dickerman and Marissa LippertPhotography by Alex LauFebruary 23, 20224.0(41)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintThis baby bok choy recipe is ideal for when you’re short on time (it takes less than 10 minutes) and ingredients (there are just five). The quartered stalks are steamed with stir-fried garlic and shallot—plus a little soy sauce for seasoning—but if you don’t have these alliums you could sub in scallions and half a red onion or whatever similar ingredients you have in the pantry or crisper drawer. Because it’s fairly simple, this recipe opens itself up to all kinds of additions. Want to grate a knob of fresh ginger in with the garlic? Go for it. Drizzle on a little sesame oil to serve? Love it.Steaming the leafy greens allows their stalks to turn tender to the core without too much charring or drying out. When rinsing the bok choy, give it a good shake to dry, but don’t worry if a little water still clings—it’ll help with the steaming. Serve this fast-and-furious side dish alongside any simply roasted meat or fish or with fried rice, a boiled egg, or chile crisp (a dish just as good for breakfast as it is for dinner).Looking for more easy bok choy recipe ideas? Fat Choy chef-owner Justin Lee’s rendition with crispy garlic and a vegan take on oyster sauce packs a big umami punch. The green adds a crunch to this stir fry with pork, scallions, and ginger and lends a pop of color to this elaborate vegan kare-kare from Bad Saint in Washington, D.C.Editor’s note: This recipe was originally published in 2013.Ingredients4  Servings1tablespoon vegetable oil2garlic cloves, chopped1shallot, chopped1pound baby bok choy, rinsed, cut into quarters, with core intact1tablespoon reduced-sodium soy saucePreparationHeat oil in a large skillet or wok over medium-high heat. Add garlic and shallot and cook, stirring, until fragrant, about 30 seconds. Add bok choy, soy sauce, and 2 Tbsp. water and cover immediately. Cook 1 minute. Uncover and toss, then cover and cook until bok choy is tender at the core, about 3 more minutes.How would you rate Garlicky Bok Choy?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleSo easy, tasty and healthy!Joseph L.Montreal, Canada7/19/2021Simple and delicious, great use for csa bok choybrushjlsolon, ohio6/16/2020Quick and simple. It would definitely a refreshing side dish for something that's a bit heavier or more heavily spiced/seasoned. AnonymousVirginia5/9/2020How do you cut it into quarters yet leave the core intact?AnonymousD.C.1/22/2020Have not made this recipe yet, but entirely want to...appears fabulous and its ingredients are all things I love...looking forward to learning the other reviewers’ comments! From: Albu-Quirky_Culin-Quirky © Can someone send me the recipe?\nHave not made this recipe yet, but entirely want to...appears fabulous and its ingredients are all things I love...looking forward to learning the other reviewers’ comments!  \n\nAlbu-Quirky_Culin-Quirky ©\n\nTakeAdvice&LearnAlbuquerque8/14/2019Have not made this recipe yet, but entirely want to...appears fabulous and its ingredients are all things I love...looking forward to learning the other reviewers’ comments!  From: Albu-Quirky_Culin-Quirky © \nCan someone send me the recipe?TakeAdvice&LearnAlbuquerque8/14/2019Explore Bon AppétitChineseEast AsianAsianBok ChoyLeafy GreensVegetableEasyQuickSideDairy-FreeNut-FreeVeganVegetarianSteamLunar New YearRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2013-12-28", "author": ["Condé Nast", "Sara Dickerman", "Marissa Lippert", "Alex Lau"]}