{"id": "dc01f1b1642fe306683ff13684f283b0", "url": "https://www.bonappetit.com/story/bread-41-dublin", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "I Spent Less Than 2 Days in Dublin and I Ate at Bread 41 Bakery 3 Times | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Spent Less Than 2 Days in Dublin and I Ate at This Bakery 3 TimesWhy try another restaurant when Bread 41 is this good?By Meryl RothsteinSeptember 23, 2019FacebookTwitterEmailPhoto by Patrick Hanlon and Russell Alford, GastroGaysFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I don’t do a lot of repeat restaurant visits. Even when I love a place, going back means I’m missing an opportunity to try somewhere new. And as a BA editor with a serious case of FOMO, I always want to try somewhere new.But when I was in Dublin this past summer, Bread 41 made me break my no-repeat rule. I first walked in because my husband suggested it—he read the words “long-fermented sourdough,” “organic ancient grains,” and “house-milled flour” and figured I’d be interested. (He was right.) Opened last September, it’s the bakery outpost of Bread Nation, baker Eoin Cluskey’s bread wholesale business devoted to top-quality bread made the old-fashioned way. Bread 41 was along the way on our walk from our hotel to St. Stephens Green and, by the time we got there, it was already sold out of bread (it wasn’t even noon!). So I bought a salted chocolate chip cookie made with spelt and fat chocolate discs, and a salted-caramel croissant the size of a baby’s head as consolation and vowed to come back in an hour, when I was told more bread would be out of the oven.Thoughtfully made bread, like this cranberry and poppyseed sourdough, is worth a trip (or two) to Bread 41.\nPhoto by Shannon O' RourkeSixty minutes later, I was wandering the streets of Dublin, pulling hunks of bread from a still-warm miso einkorn loaf. It had a beautiful dark, crunchy crust and a moist, chewy center, with a little kick from the miso that caught you in the back of the throat. And because I was about to leave town—Dublin was a brief stopover on the way to family wedding outside the city—I also bought a chicken banh mi for the road. It was a pretty loose interpretation of a banh mi, but that didn’t bother me as I shoved pillowy housemade milk bread and house-fermented carrots into my mouth.While we were at the wedding, I started thinking about the danishes, which looked so pretty. And the malted loaf, which sounded so interesting. We returned to Dublin with less than 24 hours before our flight back to New York. Plenty of time for another trip to Bread 41 so I could stuff an oat porridge loaf—made with roasted oatmeal!—in my suitcase. What else was I going to do? Try another restaurant? Not when Bread 41 was an option.Go there: Bread 41Explore Bon AppétitHighly RecommendDublinBreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-23", "author": ["Condé Nast", "Meryl Rothstein"]}