{"id": "dc03c44c94bc11509067995013105f35", "url": "https://www.bonappetit.com/story/rice-noodles-cashew-sauce-recipe", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "These Rice Noodles in Cashew Sauce Are Easier Than Ordering Takeout | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Rice Noodles in Cashew Sauce Are Easier Than Ordering TakeoutThese rich, cashew-sauced noodles are the healthyish version of my favorite takeout dish.By Julia BlackJanuary 10, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.I don't know about you, but every time I order Chinese food, I order sesame noodles. And every time I order sesame noodles, I find myself eating the leftovers for a week. And every time I eat sesame noodles for a week, I decide I can't bear the sight of a peanut butter- and soy sauce-drenched takeout container ever again. So how do I break the cycle? Well, from now on I'll be making rice noodles with spicy cashew sauce, which covers all the same flavor bases—rich, nutty, salty, a little bit sweet—but fills me up in a much more satisfying, well-rounded way.This isn't your traditional gado-gado— an Indonesian preparation which typically involves a mix of cooked, raw, and fried vegetables, tofu, rice, and eggs topped with a spicy peanut sauce. (In Indonesian, \"gado-gado\" essentially means \"mix-mix.\") Senior food editor Andy Baraghani's spin on the dish includes light-yet-satisfying rice noodles and buttery cashews that put the \"ish\" in \"healthyish.\" All that, and a colorful array of vegetables to keep your nutritional bases covered.The bulk of this recipe takes place in the blender, where you can pretty much riff as you go. I went heavy on the lime, chili, and cashews, but you could also lean into the soy sauce, ginger, or sugar. (I also bought roasted cashews to save time instead of throwing them in the oven. Sorry, Andy!)The trickiest step here is getting the noodles and the sauce to mingle. Don't try to dump the sauce on top of the pile of noodles in one go if you want to avoid the dish getting clumpy. Your best bet is to assemble each serving separately by spreading the thick sauce in the bowl before adding the noodles and the chopped vegetables. The variety of crisp, crunchy, lime juice-coated vegetables on top is what makes this a meal instead of just a starchy side dish. Top it off with a little Sriracha, and you've got yourself a meal you not only wont get sick of—you'll actually look forward to your leftovers.Get the recipe:Rice Noodles with Cashew Sauce and Crunchy VegThis recipe is inspired by Gado-gado, a colorful and crunchy Indonesian salad, made with a wide array of raw and cooked vegetables (and sometimes noodles). The dressing is usually peanut-based, but we used cashews. Feel free to try another tender nut such as pistachios or pecans instead.View RecipeExplore Bon AppétitHealthyishCooking TipsRice NoodlesCashewFeel Good Food PlanRead MoreLifestyleSanity-Saving Poached Chicken and Rice For When Life Is Just Too G-D LoudBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-10", "author": ["Condé Nast", "Julia Black"]}