{"id": "dc12a804dc163371bd1c8f3da6f2c472", "url": "https://www.bonappetit.com/story/never-cook-baby-spinach", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "You Should Never, Ever Cook Baby Spinach. Trust Us. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Should Never, Ever Cook Baby Spinach. Trust Us.Baby spinach gets gross when you cook it. Here's what you should do instead.By Alex DelanyJanuary 9, 2018FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailOnce upon a time, the word \"spinach\" conjured up images of a gloopy, dark green slime that shot out of tin cans and into Popeye's cartoon mouth. It was gross, but good for you. Nowadays, though, we're more likely to think of tender-leaved baby spinach when we think of the vegetable; that stuff is everywhere, a staple of salad bars and crisper drawers everywhere. So it makes sense that, when most people are staring down a recipe that calls for cooked spinach—be it a coconut-infused lentil soup or phyllo-encased spanikopita—they are likely to reach for the plastic tub of the baby stuff in their fridge. But that's a mistake, because cooked baby spinach is, well, slimy and gross. No bueno.We only eat baby spinach raw over here. It gets slippery and weird when thrown into soups, sautéed, or stirred into pasta sauce. Does it seem like a convenient way to use up the wilty last few cups leftover from a week of meal prepped salads? Sure. But is it delicious? No. No it isn't. So what to do when we want a cooked dish that has all of those nutrients and green, leafy flavor, sans slime? You've got two options.Frozen spinach is killer in lentil soup.\nPhoto by Heidi's Bridge, styling by Molly BazFirst, there's the Alice Waters-approved method. You buy a few beautiful bunches of dark green, mature spinach—ideally from the farmers' market. You  carefully wash them, blanch them in boiling, salted water, shock them in ice water, and then press them in a sieve or colander to get out any excess liquid before incorporating them into a recipe. It's a lot of work, but totally worth it if you're into that kind of thing.And then there's the, we-just-want-to-get-dinner-on-the-table method: Use frozen spinach. That's right, we said it. Thaw one of those rectangular boxes from the grocery store's frozen food section, give it a quick squeeze, and go to town. Sure, a lot of frozen vegetables deserve all of the shade that gets thrown their way—looking at you, frozen broccoli—but others, like spinach and peas, are a shortcut we can totally get behind. Frozen spinach gives you all the flavor, texture, and nutrition you'd get from fresh mature spinach, but without all of those time-consuming steps. Plus, it's always waiting for you in the freezer, ready at a moment's notice.So yeah, never cook baby spinach. You’re better than that. Raw baby spinach. Meticulously prepped and cooked mature spinach. Or cooked frozen spinach. Those are your options. If you catch us making dinner on a weeknight though, there’s only one real way to go. Hit us with the frozen stuff, every time.Don't just stand there! Thaw some frozen spinach and make this coconut lentil soup:Explore Bon AppétitBasicallySpinachRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Alex Delany"]}