{"id": "dc20ccf192676f8fac6b7de7941734d4", "url": "https://www.bonappetit.com/story/cachou-lajaunie-licorice", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "Cachou Lajaunie Are the Mints You Need | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMints Are for Wimps—You Need These Tiny Licorice BombsCachou Lajaunie takes fresh breath to a whole new level. By MacKenzie Chung FeganFebruary 20, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I learned many things from my French ex. In France, instead of the Tooth Fairy, there’s a tiny mouse that sneaks into children’s rooms and steals their teeth. In certain provinces, the traditional greeting of “la bise” is not limited to two cheek kisses but extends to three or sometimes four. The French word for “walkie talkie” is, absurdly, “talkie walkie.” But the most valuable thing I learned is that, after a meal of ripe cheese or garlicky snails, a normal breath mint won’t cut it. You need Cachou Lajaunie.Cachou Lajaunie are black, square pastilles about the size of a stud earring that pack an enormous menthol-y, licorice-y wallop. Developed in 1880 by Toulouse pharmacist Léon Lajaunie, they were marketed as a solution for bad breath for “smokers, chauffeurs, cyclists, etc.,” which leaves me with some unanswered questions about 19th-century French cyclists. The distinctive yellow, circular tin was designed by a watchmaker to fit in a gentleman’s waistcoat pocket, and it looks the same today as it did nearly a century and a half ago. To dispense a pastille—and you only need one—you twist the tin like an old-school decoder ring and shake one out through the revealed opening.The addition of natural mint flavor and powdered catechu, an acacia tree extract used in ayurvedic medicine and known for its refreshingly astringent quality, gives the petite pastilles a cooling mouthfeel, but the dominant flavor is definitely licorice. In the U.S. we tend to think of “mint” as synonymous with fresh breath, but not so in other parts of the world. (See: mukhwas, the anise and coriander seed Indian palate cleanser, and Euthymol, the polarizing, cotton-candy-pink toothpaste from the U.K. that contains thyme.) But I can vouch, the feeling after is clean, clean, clean.Now I keep a tin of Cachou Lajaunie in my purse at all times. Not only are its breath-freshening properties more effective than a TicTac, but they’re also more delicious—at least to a licorice lover like me. While I can’t get behind all things français (talkie walkie!), Cachou Lajaunie gives me the breath confidence I need for endless cheek kissing.Buy it: Cachou Lajaunie, $23 for six tins on AmazonAll products featured on bonappetit.com are independently selected by our editors. If you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRead MorecookingA Garlic-Lover’s Chicken Recipe Because Life’s Too Short to Worry About Bad BreathBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-20", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}