{"id": "dc2d9f81ce2d2baa0c04b78771a87c74", "url": "https://www.bonappetit.com/recipe/seco-de-pato", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Seco de Pato Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueSeco de PatoBy Danielle Bell and Pablo OsorioJanuary 4, 20224.6(13)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Caroline Hwang, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThe most important step in this Peruvian duck stew is cooking down the flavor base of aromatics and ají amarillo. The goal is to caramelize the mixture, called an aderezo, into a dark, jammy paste. Take your time to build and concentrate the flavor and you’ll be rewarded with a thick, homey stew. Bell and Osorio recommend Zócalo brand ají amarillo paste, as others can tend to be much spicier.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonDutch Oven$80 At AmazonSmall Rimmed Baking Sheet$28 At AmazonWooden Spoon$6 At AmazonTongs$13 At AmazonIngredients2 servings2duck legs (about 1 lb. total)Kosher salt1large bunch cilantro1medium sweet potato, peeledVegetable oil (if needed)1large red onion, finely chopped8garlic cloves, finely grated½cup ají amarillo paste (preferably Zócalo)1tsp. freshly ground black pepper½tsp. ground cumin1cup pilsner or other pale lager1½cups low-sodium chicken broth1medium Yukon Gold potato, peeled, cut into 1\" pieces1medium carrot, peeled, sliced ½\" thick¼cup thawed frozen peas3Tbsp. heavy cream1Tbsp. unsalted butterPreparationStep 1Pat duck legs dry with paper towels; season on both sides with salt. Place, skin side up, on a plate and chill, uncovered, at least 8 hours and up to 12 hours.Step 2Pick ¼ cup leaves with tender stems from cilantro bunch; set aside. Coarsely chop rest of bunch and place in a blender along with ⅓ cup water; blend until smooth. Measure out ½ cup cilantro purée and set aside; discard remaining purée. Rinse out and reserve blender.Step 3Place racks in middle and lower third of oven; preheat to 325°. Prick sweet potato all over with a fork and wrap in foil; place on a small rimmed baking sheet. Bake on lower rack until fork-tender, 1–1½ hours. Remove sweet potato from oven; set aside.Step 4Meanwhile, place duck legs, skin side down, in a cold, dry large Dutch oven or other heavy ovenproof pot. Set over medium heat and cook until skin is browned and a good amount of fat has cooked out, 8–10 minutes. Turn duck over and cook until browned on the other side, about 5 minutes. Transfer duck, skin side up, to a plate, leaving fat in pot (you should have about ¼ cup; add vegetable oil if short).Step 5Add onion to pot and season lightly with salt. Cook (still over medium heat), stirring occasionally, until softened and starting to brown, 10–12 minutes. Add garlic and cook, stirring often, until fragrant, about 1 minute. Add ají amarillo paste; cook, stirring occasionally, until jammy, 5–7 minutes. Stir in pepper, cumin, and reserved cilantro purée. Cook, stirring often, until darkened, thick, and most of moisture has cooked off, 5–7 minutes.Step 6Add pilsner, scraping up any browned bits from bottom of pot with a wooden spoon. Cook, stirring occasionally, until thickened, 5–7 minutes. Stir in broth and bring to a boil. Using tongs, place duck, skin side up, in pot.Step 7Transfer pot to middle rack in oven and bake, uncovered, 30 minutes. Partially cover pot and continue to bake until sauce is slightly thickened, 20–30 minutes longer. Uncover pot and stir in potato and carrot. Cover pot; continue to bake until duck and vegetables are tender, 20–25 minutes more. Stir in peas.Step 8Unwrap reserved sweet potato and place in blender. Add cream, butter, and a pinch of salt. Blend, adding water as needed (up to 3 Tbsp.), until you have a thick but pourable purée. Taste and season with more salt if needed.Step 9Divide duck legs and sauce between bowls. Swirl sweet potato purée into sauce; top with reserved cilantro.How would you rate Seco de Pato?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleGreat base flavors! Really rich, lots of complexity. Next time though, either I need to extend the cooking time or raise the temperature. The duck leg, potatoes, and carrots were all not as tender as I had hoped. (Our oven is accurate, so that isn't the issue.)Ken WortleyPhiladelphia PA area1/31/2022\"This is bomb. Wow. Oh my god.\" - my sister with her mouth full.\n\nAbsolutely delicious and easy to make! It is spicy, but not in a way that lingers or hurts, the cilantro garnish really cuts into the spiciness. I couldn't find duck legs, so I used duck breast and it practically fell apart in the stew.  Absolutely worth the long wait for it to be done. Prep and cleanup were a breeze. I expected the chili paste to fill the air whole cooking, but it didn't make me cough like other chilis do while cooking. I found the Aji paste at a Latin American market, right up front. \n\nMy sister and I ate all of it in one sitting, and we're petite girls, it was just THAT good. I've written this one down and put it in my favorites folder! I will absolutely be making this again. I just wish I had more of it for leftovers. Next time I'll be doubling the recipe. \nAnonymousSan Diego, CA1/22/2022This was fantastic! It was spicy, but the sweetness of the sweet potatoes gave it a perfect balance. I used crème fraiche for the sweet potatoes as that is what I had on hand but other than that I followed the recipe to the letter. I will happily make this for my family again and again. Kate London ON1/18/2022I was really excited to make this dish, but it left me disappointed. With all the steps and special ingredients, I was expecting to be blown away by the end result...but it was just okay. The preparation doesn't really highlight the flavor of the duck legs. You could easily use chicken legs and get the same taste. I also found it too rich - all that duck fat, plus butter and cream? The mix of spices and sweet potato puree were delicious, but I wouldn't make this again. SashaJersey City, NJ1/18/2022Explore Bon AppétitDinnerPeruvianSouth AmericanLatin AmericanStewSoups and StewsDuckPoultrySweet PotatoPotatoVegetableYukon Gold PotatoCarrotPeaRoastMainNut-FreeGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Danielle Bell", "Pablo Osorio"]}