{"id": "dc30eef6267ff45a512cd8e43a67fd36", "url": "https://www.bonappetit.com/story/cows-tale", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "A Cow’s Tale | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Cow’s TaleA feud over a beloved candy, some sconce news, and more from the week at BA.By Alex BeggsFebruary 15, 2020FacebookTwitterEmailFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Photo by Alex Lau, Food Styling by Yekaterina Boytsova A good soup is easy to findI thought about writing a Valentine to Andrea Nguyen’s ridiculously easy canh, a brothy Vietnamese soup that in her version, is full of greens and shrimp. I made it last weekend and it happened so fast I didn’t know what hit me. Stir some onion around, add water and fish sauce, add greens, ginger, and shrimp, done. It’s amazing how much savory goodness the shrimp and fish sauce bring to, well, a pot of water. Afterward, a world of opportunity opened: I could add a sliced serrano next time! (I couldn’t actually think of any more things I’d change, but she has some suggestions in the article too.)Make it: My Favorite Soup is Brothy, Gingery, and Ready in 30 MinutesWant this letter before it hits the website? Sign up for our newsletter!I love itPhoto by Laura MurrayClaire Saffitz Introduced Me to My Favorite New ClogsPhoto by Paul Raeside🚨SCONCE WATCH 🚨I like to keep close tabs on the state of sconces. Are we using enough of them? Could there be more? (Trick question: There could always be more.) Take your lunch break to swoon over photos of an English farmhouse with approximately 47 sconces. I also love design that has undertones of divorce, debt, and celibacy. And please relax! The black granite countertop is going—soon.Read more: How Restaurateur Keith McNally Built Texture Into His 1919 Cotswolds HomeOverheard at BARapo, trying to convince two staffers wearing jumpsuits to take a photo together for Instagram: “We’re gonna post a picture that says, ‘looking for a third.’”Hilary Cadigan: “I don’t think that phrase means what you think it means.”BOOM. Oh god. I peeked into the oven window and saw a sweet potato had exploded. Sweet yellow carnage was everywhere and the potato was split open down the middle. I’d poked holes in it with a fork, I swear! The temp was 350! So why did it explode? I’d like to blame my new oven, which has been trouble since the day it was installed. I even had to have it replaced because the first one made actual explosions when ignited. TERRIFYING. But if you know why my sweet p spontaneously burst at the seams, please fill me in.Unnecessary food meme of the weekUnnecessary food feud of the weekA 5-lb bag of BULLS-EYES showed up at the office, spurring a buzz of excitement among those of us who are RIGHTFULLY huge fans of Cow Tales. (Bulls-Eyes caramel creams—around since 1918!—are a chopped-off version of Cow Tales, a soft outer layer of caramel with a white creamy-powdery center.) “As far as old lady living room dish candy goes, I'll take a Werther’s Original over a Cow Tale any day,” dismissed Aliza Abarbanel, earning nods of agreement from Amanda Shapiro and Rachel Karten. They are “DELICIOUS,” declared Hilary Cadigan, “the ideal blend of chewy and frosting-y, semi-sweet and very sweet.” “Will someone explain to me why they are called ‘cow tales’?” asked MacKenzie Fegan, derailing the conversation  into a flurry of confusion. “Never heard of them,” was the refrain from the deprived editors in the Test Kitchen. “If there are so many seedless oranges, why eat seeded oranges?” asked Adam Rapoport (he’s two weeks late to that feud.) “Cow Tales are $0.25 at the counter at Wawa!” announced Emily Schultz, qualifying her as a contestant on The Price Is Right. “They. Are. Disgusting,” said Meryl Rothstein, refusing to stand down. It’s too bad she’s so wrong.Explore Bon AppétitBeggs NewsletterRead MorecultureIs It Ever Okay...to Fake an Engagement for Free Dessert?By Alex BeggscultureTrader Joe’s Latest Snacks, Reviewed in These Strange, Strange TimesBy Alex BeggscultureA Super Bowl Menu from My Home to YoursBy Alex BeggscultureI Made BA’s Best Banana Bread and It Was Indeed the BestBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-15", "author": ["Condé Nast", "Alex Beggs"]}