{"id": "dc5af7d784e315f9aa979821ff968178", "url": "https://www.bonappetit.com/recipe/basically-strawberry-shortcakes", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "Strawberry Shortcakes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBasically Strawberry ShortcakesBy Molly BazJune 9, 20194.8(78)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintStrawberries are a classic choice for this summertime dessert, but if there are other fresh berries out there callin’ your name, by all means, use those instead. And if you've never made homemade whipped cream before, you're in for a treat—it's so good, you could skip the shortcakes altogether and still have an amazing dessert.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketRimmed Baking Sheet$20 At Bon Appétit MarketParchment Paper$3 At AmazonWhisk$10 At AmazonLarge Bowl$18 At AmazonMicroplane$16 At AmazonChef's Knife$34.53 At AmazonMedium Bowl$17 At AmazonSpatula$12.99 At AmazonCutting Board$10 At IKEAIngredients6 servings2cups all-purpose flour, plus more for surface1½tsp. baking powder¼tsp. baking soda½cup plus 1 tsp. sugar, divided1½tsp. kosher salt, plus more1lemon½cup (1 stick) cold unsalted butter1cup sour cream, divided2cups heavy cream, divided1½lb. strawberries1tsp. vanilla extractPreparationStep 1Place a rack in center of oven; preheat to 400°. Line a rimmed baking sheet with parchment paper. Whisk 2 cups flour, 1½ tsp. baking powder, ¼ tsp. baking soda, 4 tsp. sugar, and 1½ tsp. salt in a large bowl to combine.Step 2Finely grate zest of about half of 1 lemon right into bowl (reserve lemon for later).Step 3Cut 1 stick cold butter into ½\" pieces and toss with dry ingredients until coated. Work butter into dry ingredients by pinching and rubbing it between your palms until there are lots of flat shards and pea-sized bits remaining. Those small, uneven pieces of unincorporated butter create steam pockets as the shortcakes bake, resulting in a tender, flaky end result.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Combine ¾ cup sour cream and ⅓ cup heavy cream in a medium bowl. Create a well in the center of the dry ingredients. Scrape cream mixture into well. Working in circles from inside the well outwards with a rubber spatula, mix dough until large, shaggy clumps form.Step 5Knead once or twice (don’t overdo it!) until it forms a mass and most of the flour has been incorporated into the dough.Step 6Transfer to a lightly floured surface. Pat to a 1\"-thick square (it should be about 6x6\").Step 7Cut dough into 4 equal squares, then stack them all on top of each other, creating one very tall tower of dough. Press down on stack with your hands, flattening dough back to a square. This stacking method is what will create lots of flaky layers. Pat to a 7½x5\" rectangle about 1\" thick.Step 8Cut rectangle in half lengthwise, then cut each of those 2 rectangles into 3 squares. Transfer squares to prepared baking sheet. Sprinkle tops with 1 Tbsp. sugar. Freeze 10 minutes. (This will help ensure that the shortcakes rise—rather than spread out—in the oven.)Step 9Bake shortcakes until golden brown all over, 20–25 minutes.Step 10While shortcakes bake, make your strawberries and whipped cream. If whipping cream by hand, place a large bowl in freezer to chill. Trim and discard stems of 1½ lb. strawberries. Cut smaller ones in half and larger ones into quarters. Transfer to a medium bowl. Cut reserved lemon in half and squeeze 2 Tbsp. lemon juice into bowl with strawberries. Add 3 Tbsp. sugar and toss to combine. Let sit at room temperature, tossing occasionally as you wait for the shortcakes. They will naturally create their own syrup through the mingling of the fruit juices with the sugar and lemon juice.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 11Pour remaining 1⅔ cups heavy cream into chilled bowl. Add 1 tsp. vanilla, 3 Tbsp. sugar, and a pinch of salt. Vigorously whisk with your largest whisk, making figure-8 motions, until soft peaks form. This will take 3–5 minutes of good ol’ elbow grease—but don't be discouraged if it takes longer! If you’re not feeling up to the challenge, use an electric mixer and beat starting at low speed, gradually increasing to high as cream begins to thicken. You’re still looking for those nice, slightly floppy, soft peaks. Whisk in remaining ¼ cup sour cream until just incorporated.Step 12Let shortcakes cool at least 15 minutes. Gently split shortcakes in half with your hands. Place bottom halves in serving bowls. Divide whipped cream, then macerated strawberries among bottom halves. Drizzle any syrupy juices left in bowl over. Close with top halves of shortcake.Step 13Marvel at your creation. Serve and enjoy!How would you rate Basically Strawberry Shortcakes?Leave a ReviewTell us what you thinkReviews (49)Back to TopTriangleSo tasty! I reduced the sugar with the strawberries and added some zest to them as well and used powdered sugar in the whipped cream. The saltiness of the biscuit with the sweet of the whip and tart of the strawberry/lemon mix ::chefs kiss::HeatherBaltimore, MD1/8/2022Has anyone ever made this and rested for longer in the fridge rather than ten minutes in the freezer?AnonymousNyack, NY10/24/2021So yummy! Everyone loved them. Next time I will cut back on the salt a smidge but still amazing.Mrs DekleRedlands, Ca6/1/2021Stellar! I can’t believe I was able to make these. They are both delicious and gorgeous.AVGUpstate, NY3/15/2021Fantastic recipe! Exceeded my expectations. They were a big hit with my family.AnonymousMiami8/11/2020A fantastic dessert that I would absolutely make again! The amount of salt is a problem because of the difference between kosher and regular - just use 1/2 tsp and you’ll be good. I too am insecure about making biscuits and shortcakes but this one makes me feel like a star baker! Thank you for this recipe :) CoDavisonOntario, Canada8/6/2020The biscuit/shortcakes look beautiful and taste so rich.  I always feel a little insecure about making biscuits because it is so easy to flop the recipes.  This one worked so well and the result was so gorgeously flaky.  A+ for sure.AnonymousOhio7/28/2020Too salty but overall, a good recipe!  I am a real biscuit fan, I make them often and decided to try this one. The recipe is easy to follow and with great results except there is definitely a mistake with the salt measurement! They were much too salty . I will make again but just use 1/2 tsp salt , which I find pretty standard for 2 cups of flour. \nThanks for sharing \nBrulebakerCanada7/2/2020Used yogurt. Dough came out dry. Added a couple tablespoons of ice water.Anonymous6/28/2020The biscuit/shortcake itself was really tasty, but didn't rise very much after a 25-minute bake in the oven. The lemon zest in the shortcake is a great idea and you absolutely shouldn't skip that step! I also cut back on the sugar in each of the components, which helped a ton. I didn't whip the sour cream into the whipped cream. This would be delicious with blackberries and blueberries all the same. AnonymousChicago6/20/2020Way too salty. I had to eat around the shortcake and the rest went in the trash. Next time I'll put in 1/2 tsp.Anonymousknoxville, tn6/17/2020Cakes came out too salty! And a bit dry. The cream tied in the entire dessert so will make again with more cream, less (no) salt, and less time in the oven. AnonymousMorgan Hill, CA6/14/2020Absolute knockout. The sour cream folded into the whipped cream is a trick I will 100% steal for other recipes. Perfect amount of acidity throughout the whole thing. Unreal!!gretansdWinnipeg, MB, Canada5/30/2020Fabulous. Made this for a special Sunday breakfast for my husband after his grueling 12 hour shift (Life in the time of Covid...) It made his day, not least because strawberry shortcake is his favorite and he pronounced it \"Best ever!\"Nicola LagonigroNew York City5/17/2020YOOOOO!!!!! Okay so I love baking but this quarantine season has given me the baking blues. This recipe is simple enough to follow and complete and it feels good to something done. It doesn't use an inordinate amount of flour/sugar/butter which are already in short supply here in my town. It doesn't require crazy equipment or specialty/quality items, and it doesn't even require a normal oven! I used my toaster oven to bake the short cakes and it turned out fine! If your toaster oven runs hot, I rec checking the color after 12-15mins and listening... I opened my lil toaster oven and heard the butter/moisture evaporating with a little hiss. Once there was almost no sound, and the tops were browned, I knew they were done. I added more Lemon Juice to the Strawbs and it was just delightful :). Thanks BA!AnonymousWillimantic Connecticut5/9/2020Explore Bon AppétitFruit DessertDessertAmericanStrawberryBerryFruitSummerNut-FreeVegetarianBakingFourth Of JulyMemorial DayLabor DayBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-09", "author": ["Condé Nast", "Molly Baz"]}