{"id": "dc6565330fe45d5d75d41f88cf889b04", "url": "https://www.bonappetit.com/recipe/crispy-smashed-potatoes-with-walnut-dressing", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Crispy Smashed Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCrispy Smashed Potatoes With Walnut DressingBy Molly BazNovember 12, 20214.8(155)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Styling by Molly BazEmailPinterestPrintEmailPinterestPrintA condiment made up of walnuts, anchovies, garlic, and red pepper flakes is the ultimate umami bomb, which is then spooned over the crispiest-ever smashed potatoes.Ingredients4–6 servings2lb. new or other small waxy potatoes1cup Diamond Crystal or ½ cup Morton kosher salt, plus more⅔cup extra-virgin olive oil, dividedFreshly ground black pepper½cup walnuts, coarsely chopped2oil-packed anchovy fillets, drained1garlic clove3Tbsp. golden raisins4tsp. Aleppo-style or other mild red pepper flakes¾cup sour cream½cup mixed tender herbs, such as parsley, dill, cilantro, and/or basilLemon wedges (for serving)PreparationStep 1Place a rack in center of oven; preheat to 450°. Place potatoes in a large pot and cover with water. Add 1 cup salt and bring to a boil. Immediately reduce heat to medium-low, bring to a simmer, and cook until potatoes are just cooked through and pierced easily with a fork, about 15 minutes (time will vary depending on the size of your potatoes; be careful not to overcook as they’ll fall apart when smashed). Drain and transfer potatoes to a rimmed baking sheet. Let cool slightly.Step 2Place another rimmed baking sheet on top, then push down firmly to smash potatoes (alternately, use the bottom of a mug or measuring cup to smash each one individually). Drizzle ⅓ cup oil over potatoes, then toss to coat; season lightly with salt and black pepper. Roast potatoes until crispy and golden brown, 35–40 minutes.Step 3Meanwhile, cook walnuts, anchovies, and remaining ⅓ cup oil in a small saucepan over medium-low heat, stirring occasionally, until anchovies are disintegrated and walnuts are golden brown, 6–8 minutes. Transfer to a small bowl, finely grate garlic over, and toss to combine. Mix in raisins and Aleppo-style pepper; season with salt.Step 4Spread sour cream on a large plate. Top with potatoes and spoon walnut sauce over. Scatter herbs over and serve with lemon wedges alongside.How would you rate Crispy Smashed Potatoes With Walnut Dressing?Leave a ReviewTell us what you thinkReviews (96)Back to TopTriangleSubbed dates for raisins and turned out fantastic! Can't wait to eat these again.Anonymous3/14/2022This was amazing. I liked the sauce so much I made double the next time. First time was with actual Aleppo peppers, and second round was with paprika/cayenne. It was better Aleppo but still great. When the potatoes were done I spooned it over very dark chocolate. Yum!Christina Chicago1/29/2022This turned out so good!! I left out the raisins all the flavors were 👍 Anonymous12/26/2021I love these potatoes! I’ve made it several times now and found that I really like sundries tomatoes in lieu of the raisins. AnonymousNew York, NY11/25/2021I'd love to try this for my family, but the anchovies are a no-no (vegetarian). Any suggestions to substitute to get similar taste?\nejbDurango, CO11/18/2021This recipe is perfection. The only changes I made were: I doubled the anchovies (it was not fishy at all!) and I used dried tart cherries instead of the raisins. Every person at the table was raving about them. They stole the show at the table! AnonymousArcata, CA11/8/2021\nWonderful recipe. I have made it with crispy cauliflower and omitted the sour cream. Just as delish as with crispy potatoes. KHKOrinda, CA10/31/2021This is probably, for our household, the best new recipe that we've enjoyed this year...thank you!  Phenomenal, and so much fun was the anticipation of how these disparate tastes would blend so warmly, each element enhancing the overall dish.  Wish the world would do the same.  I can't wait to share with friends.AnonymousMonterey, CA8/25/2021I made these within a couple days of watching Molly make them on BA, the recipe just looked so good and so interesting. Wow, so amazing, so much flavor. I ordered Aleppo chili flakes and made them again, and did the recipe exact. What a lovely pepper, mild, but so much flavor. These were a big hit with my guests last night. Golden raisins, Aleppo chili, anchovy and walnuts...sounds odd, but really wonderful! Who knew? Thanks for expanding culinary horizons Molly!! BravoCriffySanta Barbara, CA5/9/2021Delish! This dish was a huge success in my household. So many good flavors and textures. However, I did add less salt when boiling the potates than what it called for. Will make it again! SarahOttawa, Canada4/11/2021This has the best flavor! I crave the garlicy, anchovy walnut sauce. I love to serve these potatoes with a simple tri tip roast. Everything just melds together perfectly. AnonymousToledo3/13/2021These are so yummy we just cannot stop eating them!  The dressing is addictive & combined with the sour cream it's out of this world.  I smash the potatoes individually with a mason jar which is a bit tedious but worth the extra time to get them to a consistent thickness.  Have made this several times now & is definitely on my list of go to recipes.  JenColorado 2/7/2021So delicious! I prepared with small red potatoes, out walnuts and replace sour cream with coconut cream, it was delicious!!ErinBrooklyn, NY1/9/2021Delicious!! Made it with short ribs instead of mashed potatoes.   Huge hits.AnonymousPort Orchard, WA1/3/2021i made this for Christmas Eve dinner and it was a hit. Everybody was a bit skeptical about the anchovy-walnut-raisins combo but it really blew our minds how tasty it was. 10/10 would make again.Paula PérezSpain12/25/2020Explore Bon AppétitPotatoVegetableWalnutNutAnchovyFishSeafoodYukon Gold PotatoEasySideGluten-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-16", "author": ["Condé Nast", "Molly Baz"]}