{"id": "dc71dea5095b9ad7799163a819cc8e00", "url": "https://www.bonappetit.com/recipe/halloumi-saganaki", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Halloumi Saganaki Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueHalloumi SaganakiBy Yasmin KhanApril 20, 20214.6(11)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintEveryone’s favorite squeaky cheese is also the island of Cyprus’s most famous export, says cookbook author Yasmin Khan, and the locals have dozens of ways of eating it. In this recipe from her book, Ripe Figs: Recipes and Stories from Turkey, Greece, and Cyprus, she serves it in a simple meze, which pairs the salty cheese with sweet honey and aromatic thyme. It’s the ideal appetizer: sweet, salty, crunchy, and fried.Ingredients4 Servings2Tbsp. honey1tsp. finely chopped thyme18–10-oz. package Halloumi cheese1large egg¼cup fine-ground semolina flour or cornmeal3Tbsp. vegetable oil½bunch arugula, tough stems trimmed¼cup pomegranate seeds8fresh black Mission figs, halvedFreshly ground black pepperPreparationStep 1Heat honey and thyme in a small saucepan over medium-low, swirling pan occasionally, until warm (do not let honey boil). Reduce heat to low and keep warm until ready to use.Step 2Cut Halloumi into 8 slices. Lightly beat egg in a small bowl, then place semolina flour in a medium bowl. Working with 1 or 2 pieces at a time, dip Halloumi into egg, letting excess drip back into bowl, then gently toss in semolina flour, shaking off any excess.Step 3Heat oil in a large nonstick skillet over medium-high. Cook Halloumi until golden brown, about 2 minutes per side. Transfer to paper towels and let drain 1 minute.Step 4Mound arugula on a large plate or platter and arrange Halloumi and figs on top. Drizzle with warm honey and scatter pomegranate seeds over. Season with a few grinds of pepper.Adapted from \"Ripe Figs: Recipes and Stories from Turkey, Greece, and Cyprus.\" Copyright © 2021 by Yasmin Khan. With permission of the publisher, W. W. Norton & Company, Inc. All rights reserved.\n\nBuy it from Amazon or BookshopHow would you rate Halloumi Saganaki?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis was easy and delicious. Used garbanzo flour instead of AP flourpatBelmont, NC2/4/2022Had me at saganaki!  My favorite small plate growing up on Crete. DavidBoise7/28/2021Loved this!  Great combination of flavors and textures. Brushjlsolon, oh7/16/2021Explore Bon AppétitSaladMediterraneanHalloumiCheeseArugulaLeafy GreensVegetableFigFruitPomegranateQuickEasySideStarterVegetarianGluten-FreeNut-FreeLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Yasmin Khan"]}