{"id": "dc712f592fae2a3d3093af9f39777488", "url": "https://www.bonappetit.com/story/velveting-meat", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "Velveting Meat Is a Chinese Cooking Technique That Will Improve Your Stir-Fry Game | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingVelveting Is the Chinese Technique That Takes Stir-Fries to the Next LevelTender, juicy meat! Clingy, glossy sauce!By Patricia Kelly YeoSeptember 9, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Sue LiFacebookTwitterEmailWhy is it that no matter what you order from an American Chinese restaurant, from egg drop soup to fiery kung pao chicken, the texture is out of this world? More often than not, it’s thanks to one simple pantry staple: cornstarch.Basically has written about the power of cornstarch before, but in this case it is more than just an ingredient: Cornstarch is the foundation of a Chinese cooking method known as velveting, which refers to marinating protein in cornstarch and, in the fullest sense of the technique, passing it briefly through hot oil or water before incorporating into stir-fries, soups, and stews. In food, as in other parts of life, language is a form of power, and velveting—an elegant skill wielded without much fanfare by home cooks and take-out spots alike—deserves as much recognition as a French roux.Growing up in a Chinese Filipino household meant that the meat I consumed went velveted without me even knowing. Once coated in cornstarch, slices of pork became incredibly tender when dunked into a steaming hot misua with sliced patola and vermicelli. Velveted inexpensive cuts of beef turned ultrasilky in a soup seasoned with ginger and black pepper. The cornstarch not only softened the meat but also thickened the broth, giving the soup an almost chowder-like consistency unlike any other dish I knew.It wasn’t until college that I connected the dots between family dinners and the cooking technique of American Chinese cuisine I witnessed during my routine runs to the campus Panda Express. With a wok purloined from my parents’ kitchen and a fair amount of internet research from early-aughts food blogs like Appetite for China, I taught myself the art of the stir-fry, from kitchen sink-style fried rice to shrimp-flavored chayote squash finished off with a last-minute steam.Photo by Emma Fishman, Food Styling by Yekaterina BoytsovaThe missing ingredient that made nearly any dish sing? Cornstarch, of course, added in the last minutes of cooking, or better yet, used to velvet the ingredients—to coat the pieces themselves in a cornstarch-based slurry. Velveting does more than tenderize your glistening orange chicken—it creates an even protective coating that browns meat more evenly, seals in its juices, and improves overall sauce adhesion. Velveting starts with making a slurry: For 1 pound thinly sliced meat or alternative protein (it can be anything really: chicken, pork, beef, shrimp, tofu, or even mushrooms), combine 1 Tbsp. cornstarch, 1 Tbsp. soy sauce, and 1 Tbsp. vegetable or light sesame oil. I like to add sliced onions or garlic as well, which gives the alliums additional time to soak up the oil and salt. Mix everything well, cover, and refrigerate for at least 30 minutes or up to one hour to allow time for the cornstarch to transform into a thin gelatinous layer. To give your velveted meat an even thicker coating of sauce, add an egg white to the slurry. Increase the cornstarch and you’ll end up with something thicker and more substantive, maybe a slurry better-suited to a stew or soup, like the Chinese Filipino misua I grew up with.For additional flavor, try adding 1 Tbsp. Shaoxing wine or 1 Tbsp. rice vinegar. The pantry possibilities are, in theory, endless: oyster sauce, Worcestershire sauce, or even ponzu for a light citrus twist. To complete the velveting process, you’d technically need to dunk the marinated protein in hot oil or water, which, according to chef Lucas Sin of Junzi Kitchen, activates the layer of starch and gives the meat its characteristic slippery texture. I’ve personally found that even just marinating the protein without completing this extra step makes a huge difference. I use the coated meat in soups, stews, or stir-fries, transforming them from mere sustenance into meals with restaurant-level finesse. With just one extra step, I’m my own favorite take-out joint.Patricia Kelly Yeo is a freelance food and health journalist based in L.A.Explore Bon AppétitStir-FrySoupStewChineseRead MorecookingAny Soup Can Be Egg Drop Soup If You Want It to BeBy Lucas SincookingCornstarch is a Powerful Tool That Must Be Used ResponsiblyBy Sarah JampelFresh Pepper Kung Pao ChickenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-09", "author": ["Condé Nast", "Patricia Kelly Yeo"]}