{"id": "dc722201127bc1f0aee42de2c8c86169", "url": "https://www.bonappetit.com/story/spicy-ginger-tea", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Spicy Ginger Tea Is the Homemade Cold Remedy I've Been Making For Years | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingNo Nose Is Too Stuffed for This Spicy Ginger TeaIf you aren’t tearing up, it’s not spicy enough.By Nico AvalleJanuary 5, 2022FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy you don't even need one. In It’s That Simple, we’ll talk you through the dishes and drinks we can make with our eyes closed. Today, spicy ginger tea.For some people college was a nonstop party. For me it was a nonstop head cold. Between traveling for debate, living shoulder to shoulder in dorms, and pulling all-nighters in the library, my immune system was overworked and under-rested. That’s before taking into account the crowded, dingy frat houses where reusing Solo cups was commonplace and “social distance” meant “close enough for a guy to shout about his startup directly in your ear.”So I spent four years sniffling, sneezing, and blowing my nose, trying every cold remedy I could find for any morsel of relief. I downed bowl after bowl of chicken noodle soup, slathered myself in VapoRub, and burned out not one but two essential oil diffusers perfuming my dorm room with a constant flow of eucalyptus. But of all the remedies I tried during that time, the one I’ve stuck with is my homemade spicy ginger tea.Spicy ginger tea is an amalgam of a few of my favorite cold remedies. There’s honey and lemon to soothe scratchy throats, fresh ginger and turmeric for their anti-inflammatory properties, and most importantly, a hot chile pepper. The capsaicin from the chile, along with the acidity from the lemon and the steam of the hot beverage, works its way through the sinuses as you sip. Drink a full mug and your nose will run; you’ll feel the heat behind your eyes; and shortly after, you’ll feel your airways start to clear.Here’s how to make my spicy ginger tea:Thinly slice a 2\"–3\" piece of ginger and a fresh hot pepper (jalapeño, Fresno, Thai chile, etc.). Add ginger and chile to a French press along with ½ lemon, thinly sliced, a dash of ground turmeric, and 1 tsp. honey. Fill the French press with boiling water, stir the ingredients to combine, then place the filter on top and press to submerge ingredients ½\" under water (otherwise everything will float to the top). Once the tea is deeply colorful, press the filter all the way down and pour into mugs. Drink while the spicy ginger tea is still hot and steamy for maximum relief.Everyone’s heat tolerance is different, so pick a pepper that’s spicy to you, whether that’s a jalapeño or a ghost chile, and remove the veins and seeds for even less heat. As for me, I like to use red Thai chiles, which pack a nice punch and pair incredibly well with the bright ginger flavor.Since graduating I’ve stopped getting so many colds. Part of that’s personal—no more frat parties—but it’s also due to the ramifications of COVID. Still, even though I’m nowhere near as sniffly as I was in the before times, I’m still making spicy ginger tea as often. The ginger makes for a relaxing sip at the end of a long day, and the heat from the chiles is like a caffeine-free pick-me-up when the sun sets before 5 o’clock. If there’s one thing I’ve learned since college, it’s that you shouldn’t wait until things are bad to take care of yourself. Also, that essay won’t get better after 2 a.m. Just get some rest, bud.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-05", "author": ["Condé Nast", "Nico Avalle"]}