{"id": "dc739b0f22098b1518aa7897f6f5a3ae", "url": "https://www.bonappetit.com/story/oxtail-stew-recipe", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Oxtail and Red Wine Stew So Luxurious, You'll (Almost) Want to Bathe in It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOxtail and Red Wine Stew So Luxurious, You'll (Almost) Want to Bathe in ItHerby Panko and horseradish beet relish toppings make this super savory stew a star.By Jesse SparksOctober 2, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethFacebookTwitterEmailEvery family has it: that one sacred food that marks all special occasions—and carries with it the threat of Eternal Shame and constant reminders of That Time You Messed Up. In the Sparks household, that dish is oxtails. They’re so important, in fact, that only the heads of each household is allowed to cook them during gatherings, leaving few chances for the next generation—i.e. Me—to show off their skills in the kitchen. So, the second I heard that Claire Saffitz had developed a group-sized oxtail and red wine stew so rich, silky, and luxurious you’ll want to bathe in it, I knew I had something to impress the whole family with.If you've never cooked oxtails, they can look more intimidating than they actually are (which is partially why it took me a few years to work them into my regular repertoire). That's mostly due to the bone at the center, which is rife with collagen and gives stews a smoother, deeper texture and flavor. But with this recipe, the approach is simple: After browning the oxtails in batches, there's little else to do than let them simmer for about three hours with some goldeny-brown chunks of leeks, garlic, and celery, plus one whole bottle of red wine, and skimming the foam off the top every so often.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethAfter that, I pulled the meat from the bones (and tried to not put it directly into my mouth), adding both back into the pot while discarding the fat and cartilage. The step that required the most effort was covering it all up, and sliding it into the fridge. Sure you could skip this step and eat it all then and there, but 12-hours of chilling gives the flavors time to deepen into a thicker, more concentrated bone broth. Plus, it encourages all the fat you won’t want to eat to rise to the surface and congeal, making it super easy to scrape out with a spoon before reheating.While the fridge worked its magic, I worked on clutch toppings like a salty-herby Panko and a horseradish beet relish, which add an essential punchy, crunchy dimension, and a DIY moment I knew my impossible-to-please aunties would love. And if your family’s anything like mine, that’s one heck of an accomplishment.Get the recipe:Oxtail and Red Wine StewOxtails contain a ton of collagen, which melts into the stew to create an ultra-rich, ultra-silky texture and flavor.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-02", "author": ["Condé Nast", "Jesse Sparks"]}