{"id": "dc7656796791544513a99bbf47f5ca0c", "url": "https://www.bonappetit.com/story/fairy-tale-eggplant-recipe", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Fairy Tale Eggplant Recipes to Make the Most of Summer's Last Haul | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Fairy Tale Eggplant Recipe That Comes With an Irresistible Cashew SauceWe're all about the Eggplant with Cashew Butter recipe at Drifters Wife, one of BA's Hot 10 Best New Restaurants of 2018.By Aliza AbarbanelAugust 14, 2018FacebookTwitterEmailPhoto by Elizabeth CecilFacebookTwitterEmailWhen it comes to eggplants, we generally find the smaller the fruit (yes, it’s a fruit!), the better the flavor and texture. And of all the miniature varieties cropping up at farmers’ markets right now, we’re especially digging fairy tale eggplants. And of all the fairy tale eggplant recipes we've made, the one at Drifters Wife (one of BA’s Hot 10 Best New Restaurants this year) is the one we can't stop thinking about.These tiny beauties, palm-sized and streaked with purple and white, are a dream to cook— they’re so tender and creamy, they don’t require salting—and they’re never seedy or bitter. At Drifters Wife, Chef Ben Jackson sears them on the stove then roasts them until tender and serves them over a bed of tangy-sweet cashew butter—with plenty of pickled peppers sprinkled on top for good measure. He keeps the Portland, ME restaurant stocked with several heirloom eggplant varieties by working with a group of local farmers, but he's especially partial to fairy tales. Their dainty size is ideal for cooking hard and fast, creating big flavor payoff in a small kitchen.So tiny. So pretty. So delicious.\nPhoto by Chelsie Craig“I don’t like overcooked eggplant because it becomes soggy, but it’s really easy to achieve an even cook on a fairy tale eggplant, so it’s nice and charred on the cut side and still retains the nice, fresh taste of eggplant without taking on too much oil,” Jackson says. Unlike large globe eggplants, which can sport tough skins and mealy, seedy insides when cooked, fairy tales are ideal for roasting or confiting whole until tender and creamy. Plus, they cook wildly fast. For perfectly cooked fairy tale eggplant, Jackson halves them lengthwise and places them cut side down in a hot cast-iron skillet to create a beautifully caramelized face and a custardy interior. As a bonus, leaving the eggplant skin-side-up can help preserve some of their gorgeous striated patterns (but don't be too disappointed if yours turns gray).The eggplant is then finished off in the oven until tender, then served with a cashew butter we can't stop thinking about. Garlic, shallots, and cashews get sautéed in oil, then blended with sugar, salt, lime, and a touch of fish sauce. It's an umami-packed condiment that goes with just about anything, but it pairs especially well with the slightly charred eggplant and the pickled peppers that finish the whole dish off.We love fairy tales for their delicate skin and fresh flavor, so snag them if you see them at the market. Look for firm, unbruised eggplant no larger than the palm of your hand. Other fairy tale eggplant recipes we love: Try rubbing with spices and serving over raita, or marinating in a fiery curry and charring on the grill. Fairy tale eggplants will only be around for a few more weeks, so look for them now—or risk missing out on some of the rarest, prettiest, and most delicious summer produce around.Get the recipe:Eggplant with Cashew Butter and Pickled PeppersMake this cashew butter once, and you’ll want to use it on roasted vegetables year-round.View RecipeExplore Bon AppétitEggplantHot 10 2018HealthyishRead MorecookingThis Eggplant Dish Inspired My Best Vacation Decision EverBy Adriana VelezRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Aliza Abarbanel"]}