{"id": "dc8133e60ee9354faab921e7d4cff2fa", "url": "https://www.bonappetit.com/story/cold-miso-noodles", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "Cold Miso Noodles Are the Perfect Easy Recipe to Make When You Need to Chill Out | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI'm Defffinitely Not Chill, But These Cold Miso Noodles AreThey're better than any free meditation app.By Jesse SparksAugust 23, 2019FacebookTwitterEmailFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.You know as well as I do that life can feel stressful. Working a full time job while trying to get a full night’s sleep, manage my credit, maintain some sense of a social life, drink enough water, figure out what exactly a 401(k) is and if I’m contributing enough to it (again, your guess is as good as mine???), and make room for some semblance of self-care is…a lot. Lucky for me, this recipe for glossy cold miso noodles is essentially a case study in doing the least—and it’s taught me the art of being a little more chill.First off, there’s no unwieldy equipment to wrangle, no finicky sauce to emulsify, and no must-serve-immediately mandate to follow. All I need to put together a super refreshing dinner that can be enjoyed on my own time is a pot to boil the noodles, a skillet to toast the sesame seeds, and a renewed commitment to not unconsciously sighing 17 times an hour.While I wait for the water to boil, I execute my checklist of relaxation techniques—release the tension in my shoulders, unclench my teeth, put on a soundtrack of whale noises, thunderstorms, or Lizzo affirmations—then throw the rest of the dish together. Once I've diced a chile, sliced some scallions, and chopped a few cucumbers, I start on the addictively salty miso dressing. The creamy sauce is simply a mixture of mild miso, toasted sesame oil, lightly brown sugar, grated garlic, and neutral oil. If I don’t have white miso, I just use a smaller amount of bolder miso (the dark stuff) in order to keep everything balanced. (See how chill I am?!)Once the water’s boiling, I throw the noodles in. One of my favorite parts of this recipe is that pretty much any type of noodle will work. I like switching between soba, udon, and cheap ol’ spaghetti, depending on my mood—I’ll just adjust the cook-time accordingly. See, I really can go with the flow.Once my noodles are done, I toss them in the sauce until everything’s glossy, then add the chopped veg. And just like that, I’ve made myself dinner for a week (like, all week: this recipe makes 10 cups!). These noodles can do so much more though: They’re a crowd-pleasing main for a casual dinner party and a delightfully accommodating desk lunch because they’re equally great cold or room temp.This versatility is the stress-relieving, anxiety-banishing key to making life feel simple and sweet. Even if I’m still googling that 401(k).Get the recipe:Cold Miso-Sesame NoodlesThe ultimate dinner-to-desk lunch dish.View RecipeExplore Bon AppétitNoodleMisoNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-23", "author": ["Condé Nast", "Jesse Sparks"]}