{"id": "dc8b89574e1c7cb5287a775cebfb3e1f", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/the-pie-shoppe", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "The Pie Shoppe Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverThe Pie ShoppeEast Vancouver’s beloved, scrappy, and downright delicious bakeryFacebookPinterestTwitterEmailCourtesy of The Pie Shoppe GO HERE: for the city’s best pies, hands down. Sisters (and pastry chefs) Stephanie and Andrea French have both talent and gumption, opening their first pint-size location in just nine days and surviving a fire that nearly ruined their new shop. Now The Pie Shoppe is busier than ever, sourcing thousands of pounds of British Columbian fruit to make their highly coveted pies.ORDER THE: salted honey with East Van honey and salt from Vancouver Island; chocolate peanut butter; and something seasonal, like the raspberry rhubarb or grapefruit and amaro custard.THE VIBE IS: serene, with light flooding in from both the front and back of the shop. There’s a long shelf filled with vinyls (courtesy of Mom and Dad French) and artful touches throughout from the sisters’ many crafty friends. But let’s be real: You’ll be spending most of your time hovering over all the latticed, sugar-crusted gems on the counter.PRACTICAL STUFF: Open Wednesday to Saturday, from 11 a.m. to 6 p.m.; and Sunday, from 11 a.m. to 5 p.m. Closed Monday and Tuesday. Need a whole pie? Call ahead to secure it!—Lindsay AndersonCourtesy of The Pie ShoppeCourtesy of The Pie ShoppeWE ALSO LOVEBeta5A Mount Pleasant sweets shop pushing cacao boundaries since 2011Ask for LuigiEat all the fresh pasta in Railtown’s most charming spaceBeaucoupAn outstanding bakery worth the (slight) trek to KitsilanoExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}