{"id": "dca83b8f25d3a0b42ce70e6cd372f05b", "url": "https://www.bonappetit.com/recipe/thandai-shortbread-cookies", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Thandai Shortbread Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueThandai Shortbread CookiesBy Amisha Dodhia GurbaniNovember 23, 20214.8(21)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman. Food styling by Pearl Jones.EmailPinterestPrintEmailPinterestPrintThink of thandai—a popular drink at Holi celebrations in northern India—as a lightly floral spiced milk punch. In this recipe from her book Mumbai Modern, author Amisha Dodhia Gurbani mixes some of the rosy, nutty masala used for thandai into tender-crisp butter cookies, where its flavor blooms in the heat of the oven. Use leftover thandai masala to flavor hot chocolate, eggnog, or apple pie, or to sprinkle over your morning oatmeal or yogurt.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronElectric Mixer$40 At AmazonRound Cookie Cutter Set, 12-Pack$12 At AmazonSpice Grinder$45 At Kitchen AidRolling Pin$13 At AmazonHeatproof Measuring Cup$18 At AmazonIngredientsMakes about 30Thandai Masala½star anise pod1½\" cinnamon stick5green cardamom pods2whole cloves1Tbsp. dried rose petals1½tsp. fennel seeds¼tsp. ground nutmeg⅛tsp. black peppercorns⅛tsp. saffron threads1Tbsp. plus 1½ tsp. raw almonds1Tbsp. poppy seeds1Tbsp. raw cashews1Tbsp. raw pistachios, preferably Persian or SicilianCookies and Assembly10Tbsp. unsalted butter, room temperature½cup (100 g) sugar1½tsp. vanilla extract1½cups (188 g) all-purpose flour½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt1cup (170 g) high-quality white chocolate chips1tsp. refined coconut oil¼cup (30 g) raw pistachios, preferably Persian or Sicilian, chopped1Tbsp. dried rose petals, crushedSpecial equipmentA spice mill; a plain or fluted 2\"-diameter cookie cutterPreparationThandai MasalaStep 1Finely grind star anise, cinnamon, cardamom, cloves, rose petals, fennel seeds, nutmeg, peppercorns, and saffron in spice mill to a powder. Transfer spice mixture to a small bowl.Step 2Working in batches if needed, finely grind almonds, poppy seeds, cashews, and pistachios in spice mill (but not so finely ground that the nuts turn to butter). Whisk nut mixture into spice mixture until well combined.Do Ahead: Thandai masala can be made 3 weeks ahead. Transfer to an airtight container; cover and chill.Cookies and AssemblyStep 3Using an electric mixer on medium speed, beat butter, sugar, and vanilla in a large bowl until light and creamy, about 3 minutes. Add flour, salt, and 5 Tbsp. (35 g) thandai masala and beat on low speed until just combined. Pat dough into a disk and wrap tightly in plastic. Chill until firm, at least 2 hours.Step 4Place racks in upper and lower thirds of oven; preheat to 350°. Roll out dough between 2 sheets of parchment paper to ¼\" thick. Transfer dough, still sandwiched between parchment, to a baking sheet and freeze until just firm, 10–15 minutes.Step 5Slide dough onto a surface and carefully peel away top sheet of parchment. Punch out cookies as close together as possible with cutter and divide between 2 parchment-lined baking sheets, spacing 1½\" apart.Step 6Bake cookies, rotating baking sheets top to bottom and front to back halfway through, until golden, 14–16 minutes. Let cool 5 minutes on baking sheets, then transfer to a wire rack and let cool completely; reserve baking sheets with parchment. Repeat process with dough scraps (chill dough again before punching out more cookies).Step 7Melt white chocolate and oil in a small heatproof bowl set over a small saucepan of barely simmering water (do not let bowl touch water), stirring occasionally, until glossy and smooth. (Alternatively, melt in a microwave-safe bowl in the microwave in 20-second increments, stirring after each, about 1 minute total.)Step 8Dip one third of each cookie into white chocolate and transfer to reserved baking sheets. Scatter pistachios and rose petals over white chocolate. Freeze cookies until chocolate is set, about 5 minutes.Do ahead: Dough can be made 1 week ahead; keep chilled. Cookies can be baked (but not glazed) 10 days ahead or glazed 2 days ahead; store airtight at room temperature.Excerpted from ‘Mumbai Modern: Vegetarian Recipes Inspired by Indian Roots and California Cuisine.’ Copyright 2021 Amisha Dodhia Gurbani. Reproduced by permission of the Countryman Press, a division of W.W. Norton & Company. All Rights Reserved.\n\nBuy it on Amazon.com or Bookshop.orgHow would you rate Thandai Shortbread Cookies?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThis recipe needs an adjustment. Despite that- the cookies are amazing!!  I made it from the magazine (yes- old school) and came to this site to read reviews when the dough just wouldn't come together.  This recipe needs an adjustment.  I, like many others, wound up adding a bit of liquid/fat.  I used about 2 Tbsp of light cream and just worked it into the dough. It was just enough to moisten it so it would come together. Once that was done - piece of cake. Great flavor and they're beautiful. I used a heart shaped cut out.  I used the extra spice mix in homemade granola with tart cherries.  OMG - decadent!SNVRivergirlBoston, MA1/10/2022I used Dark chocolate to dip as I’m not a fan of white chocolate. Also I could tell the dough was too crumbly having made similar types of cookies. I added all the spice mixture and 3 Tblsps butter and it worked fine. Quite yummy!Sally RPhilmont, NY12/25/2021Made the Thandai Masala on Friday night and the cookies on Saturday last week - letting the flavors meld and dipping them in white chocolate today.  The dough came together for me without issue - but I think it was more humid last weekend.  Yesterday, none of my doughs worked - even ones I've made before were all too dry and would not come together until I added liquid.  These cookies smell fantastic - I can't wait to serve them tonight!  I changed up the shape and opted to make teardrop cookies instead - I thought they would look really pretty with the white chocolate and chopped pistachios and rose petals.  One thing I would say is - watch your cookies closely - my first batch ended up being a little too toasty.  They still were really good/not burnt tasting - but the pale color looks better with the white chocolate.Dawn LandOld Brookville, NY12/24/2021I made these for after dinner dessert - I can't remember the last time I got such rave reviews.  I tried a cookie without the white chocolate and was a bit dissapointed in the flavor - for some reason the white chocolate really made the cookie sing.  The dough was very crumbly and fell apart when I tried to roll it out.  I melted 2 tablespoons of butter to try to bring the dough together.  Still a bit difficult to roll out but ultimately it worked.  Freezing the dough for about 10 minutes after cutting out the circles helped the cookies retain their shape.  I found this cookie a bit daunting with the number of ingredients and the numberr of steps but if you want a bit of a show stopper, I think they are worth it.JuleeSeattle, WA12/13/2021The dough smells incredible, but it will NOT stick together. I followed every step. It’s too dry. I had to add a couple tablespoons of milk. \nAfter adding the milk and baking, I have tasty cookies!Lindsay Sacramento, CA12/11/2021They look beautiful and the ingredients tell me they are delicious. I am anxious to make them.Helene, the adaptor.Milford, CT12/9/2021Explore Bon AppétitCookieDessertShortbreadHoliday CookiesBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-22", "author": ["Condé Nast", "Amisha Dodhia Gurbani"]}