{"id": "dcab03f5430befb7aa08d0d3d438fc3b", "url": "https://www.bonappetit.com/recipe/slow-roast-gochujang-chicken", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Slow-Roast Gochujang Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSlow-Roast Gochujang ChickenBy Molly BazSeptember 8, 20194.8(337)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintThis isn’t the crisp-skinned, high-heat roast chicken you’re probably familiar with. Instead, it’s a melt-in-your-mouth tender, schmaltzy, slow-roast version that’s more similar to rotisserie chicken—except (bonus!) it gets slathered in the funky-spicy-sweet gochujang. And while the meat might be the star of the show, don't discount those buttery-soft, nearly-confited potatoes, which cook gently in the chicken fat. Makes you wonder why you haven't always been roasting long-cooking vegetables—carrots, cauliflower, turnips (?!), winter squash, fennel—under the bird for a built-in side, huh?All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonOven Thermometer$7 At AmazonChef's Knife$34.53 At AmazonPastry Brush$9 At AmazonTongs$13 At AmazonMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketPaper Towels$13.45 At AmazonSmall Rimmed Baking Sheet$28 At AmazonWhisk$10 At AmazonMedium Bowl$17 At AmazonMicroplane$16 At AmazonVegetable Peeler$10 At AmazonKitchen Twine$4.99 At AmazonCutting Board$10 At IKEASpatula$12.99 At AmazonLarge Basting Spoon$16.37 At AmazonIngredients4 servings13½–4-lb. whole chicken1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, plus moreFreshly ground black pepper5Tbsp. gochujang (Korean hot pepper paste)¼cup plus 2 Tbsp. extra-virgin olive oil2heads of garlic1½\" piece fresh ginger1½lb. baby Yukon Gold potatoes (about 1½\" in diameter)5scallions2limes2tsp. honeyPreparationStep 1Place a rack in middle of oven; preheat to 300°. This is an important temperature for this recipe, so if you don’t have an oven thermometer already, now is the time to get one! Pat chicken dry with paper towels. Place on a small rimmed baking sheet. Season 1 3½–4-lb. whole chicken all over with 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt and lots of freshly ground black pepper, making sure to season the inside cavity.Step 2Whisk 5 Tbsp. gochujang and ¼ cup extra-virgin olive oil in a medium bowl until combined. Finely grate 3 garlic cloves (from one of the heads of garlic) into gochujang oil. Peel  1 ½\" piece fresh ginger (a spoon can get the job done), then grate into gochujang oil; whisk to combine.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Cut what’s left of the head of garlic in half crosswise. Repeat with second head of garlic. Stuff 2 garlic halves inside cavity of chicken. Tie legs together with kitchen twine.Step 4Using a pastry brush, brush half of gochujang oil over chicken.Step 5Toss 1½ lb. baby Yukon Gold potatoes and remaining 2 garlic halves and 2 Tbsp. extra-virgin olive oil in remaining gochujang oil until well coated. Season lightly with salt and pepper and toss again to combine.Step 6Arrange potatoes in a 12\" cast-iron skillet, scooting them toward edges of pan to make space for chicken. Nestle garlic halves (cut sides down) in center of skillet. Place chicken over garlic—as it roasts, it will infuse the fat (and thus, the potatoes) with flavor. If any potatoes have shimmied their way under the chicken, use tongs to arrange them around it (they won’t cook at the same rate if they’re under the chicken).Step 7Roast chicken and potatoes, turning potatoes once or twice to coat in juices and oil that accumulate in pan, until potatoes are very tender when pressed with the back of a spoon, and chicken skin is deep reddish-golden brown in color, 2½–3 hours. When you wiggle the legs of the chicken, they should feel loose in the joints, meaning the meat is fall-apart tender. Transfer chicken to a cutting board and let rest 10–15 minutes. Don't skip this step: Letting the bird rests helps the juices in the meat to settle (in other words, it makes the meat juicier).Step 8Meanwhile, use the back of a large spoon or a potato masher to gently smash potatoes in skillet, exposing some of their flesh to juices underneath so they can soak them up.Step 9Finish the potatoes: Thinly slice 5 scallions on a long diagonal. Cut 2 limes in half. Cut 1 half into wedges and set aside. Stir 2 tsp. honey and juice of remaining lime half into potatoes. Taste potatoes and season with more salt if needed. Scatter sliced scallions over potatoes.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 10Carve chicken, then arrange pieces over potatoes and scallions. Serve right out of skillet with remaining lime wedges alongside for squeezing, and squeeze out the sweet, slow-roasted garlic cloves as you wish.→  Nervous about carving the bird? This video should help.Step 11Do Ahead: Chicken can be seasoned 12 hours ahead. Chill chicken if you’re not going to cook within 2 hours of seasoning.How would you rate Slow-Roast Gochujang Chicken?Leave a ReviewTell us what you thinkReviews (174)Back to TopTriangleVery good! Dad & I loved it. For your reference:\n\n* Used 4 chicken quarters (thigh + drumstick) - took a smidge over 2 hours at 300\n* Potatoes were like 90% done at 2 hours. Smashed them and put in oven at 375 while chicken rested 15 min\n* Used 1/2 potatoes, 1/2 sunchokes. Great. Wouldn't use all sunchokes as they are pretty sweet, but if you're worried about the spice it's a great way to cut into that spice.\n* For a veg version, I could easily see making only with veggies (potato, sunchoke, turnip). Would avoid carrot. Rutabega - maybe? Serve with an Asian peanut noodle salad, or fried tofu cubes in either this gochugang marinade or something a little soy-shaoxing sweet/savory?sarinaboston ma3/11/2022I’ve made this as described without the squeeze of lime juice on the potatoes.  all else perfect.  I like lime juice on beef. Anonymous3/4/2022I made this exactly as written. 4 lb chicken and roasted completely by 3 hours. The garlic inside the bird I do not understand the significance. It was still raw and because of that it could not have added to flavor. The potatoes were excellent, and the chicken was very tender. My guests loved it. Next time no garlic in the bird and I may up the temp to 325 as the outside could have been browner and more caramelized. Served it with a side of Asian Slaw dressed with peanut sauce.AustinTxGalAustin, TX2/27/2022the recipe calls for 4 t honey but only 2 t are mentioned in the steps to make it\nAnonymousNew york, ny United States2/21/2022It was delicious, highly recommended!Alejandro JourdanMexico City2/20/2022It could just be a glitch. I'm having the same problem, doesn't mean that Bon Appetite is trying to make us pay for a recipe. This is the first time I've experienced this. I just screenshot the steps... easy enough. The chicken is baking right now and smells sooo good. JaimeePittsburgh2/18/2022I made this recipe exactly as it was given and it was absolutely delicious. My husband said he thought it was now his favorite dish.   The chicken was extremely tender ( heritage chicken was used) .The potatoes were Savory.  Will be making it again. If you are making this for company it's perfect because it will cook for 3 hours or so in the oven while you entertain and then you can just pull it out at the end and finish itAnonymousNew York2/16/2022Allow me to voice a dissenting opinion.  The chicken was fine.  The garlic underneath the chicken did not cook.  After adding the lime juice to the potatoes made them horrid.  Won't make this again.AnonymousNYC2/15/2022This was fantastic.  I used  bone-in, skin-on thighs.  They were done much sooner than anticipated, so I lowered the oven temp to 175, covered the pan with foil and let everything sit for another hour.  The chicken was still moist and delicious.  I mixed up the full recipe for the sauce, but cut back on the potatoes and garlic but next time I'll do as much as I can squeeze in the pan.  Since my husband is not a fan of spicy food I only used 3 tbs of go-chu-jang, but next time I'll use all 5 tbs.macaroni rascalUpper Southampton, PA2/14/2022We’ve made this 3 times now and each time I love it more. This may be our favorite chicken dish ever. The sweet, spicy, lime-y potatoes are so wonderful too. Perfect Sunday dinner. MaggieMBuffalo, NY2/14/2022Anyone having an issue viewing the recipe, when it loads, change to reader view in your browser. Should keep all the pertinent recipe info, and not kick you off the page.Anonymous2/13/2022Made this tonight for my husband's birthday.  Simple and delicious.  Liked the spice, and the freshness from honey, cilantro, and scallions.KateWashington, DC2/12/2022Check and make sure you're logged in. Although I was logged into the main site, I found that for this recipe I was not. As soon as I logged in it stopped disappearing. Aaron2/10/2022Same issue as others, and I do already have a subscription.  I am logged in, but the recipe disappears.Beth B2/10/2022Same complaint as others-- I sign in, see the recipe for a second, then it disappears. I'll give it another week or so for this to be worked out.DBColorado 2/8/2022Explore Bon AppétitKoreanEast AsianAsianChickenPoultryPotatoVegetableYukon Gold PotatoOne-Pot MealsEasyWeeknight MealsMainDairy-FreeNut-FreeRoastDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-08", "author": ["Condé Nast", "Molly Baz"]}