{"id": "dcb04b354345d42d777c839a8b1d6b70", "url": "https://www.bonappetit.com/story/best-cookbooks-2021-gift-guide", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "The Best 2021 Cookbooks to Give as Gifts This Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Cookbook Gift Guide That Covers EVERYONE You Know: 2021 EditionThe year’s best cookbooks also make the best presents.By Alex BeggsOctober 26, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Have we talked about how easy cookbooks are to WRAP? There are a lot of reasons why we think the best cookbooks of 2021 are the ideal gifts for any food lover, but it might come down to the fact that they’re all the same shape—and that shape is easy to wrap and slap a bow on. They’re also the best gift because you’re giving the gift of possibility. Whether it’s a book full of dinner inspiration (the Weekday Vegetarians) or dreamy desserts (Mooncakes and Milk Bread), your gift-receiver gets to, for a moment, consider the rest of their lives ahead of them. Full of food.For the person who has an elaborate holiday baking regimenShe got me with the Scallion and Cheddar Cathead Biscuits (as big as a cat’s head!). Cheryl Day’s Treasury of Southern Baking bows down to butter, flour, buttermilk, and cornmeal. When you scratch beneath the frosting, you learn that this book wouldn’t be here without Day’s great-great-grandmother, who was born enslaved and left behind many of the recipes that are found in the book. And I flagged so many of them to make that my book appears to have feathers. Sock-It-To-Me-Cake! Grown Folks’ Rum Cake! Razzleberry Pie! Jam-filled dumpling cookies that are shaped like chickens! We snagged a few recipes for Thanksgiving (that Sweet Potato Loaf!)—check them out here, but take my word for it, you’ll want the whole book once you have a slice.Cheryl Day's Treasury of Southern Baking$40 $34 at AmazonAnd because I couldn’t pick a favorite, queen of cookies Dorie Greenspan has a new collection, Baking with Dorie, that includes a bold follow-up to her famous World Peace Cookies—World Peace Cookies 2.0!—which is the kind of breaking news I’m here for. We also snagged the recipe for her Caramel Crunch–Chocolate Chunklet Cookies (baked in a muffin tin!), and if you didn’t think your winter was going to include chunklets, I’m happy to say: How wrong you were. The baker in your life will be psyched with either of these as a gift, so why not get both?Baking with Dorie: Sweet, Salty & Simple$35 $30 at AmazonFor the bread-head:Tell me you don’t want a fluffy, squishy, savory pork floss pull-apart bun right now. Liar! Kristina Cho’s debut cookbook, Mooncakes and Milk Bread, had the BA Test Kitchen swooning, and these people don’t swoon easily. If you know someone who got into bread, croissants, dumplings, or any other carby cooking project during the pandemic, get them this book and you’ll probably be rewarded with a loaf of black sesame–swirled milk bread on your doorstep in return. (That’s how giving cookbooks works, I’m pretty sure.)Mooncakes and Milk Bread$30 $27 at Amazon$30 $28 at Bookshop.orgFor the parent who really wishes these kids could feed themselves already:Jenny Rosenstrach’s the Weekday Vegetarians is the family cooking cookbook of the year, but the thing is...I don’t even have children. And I still want artichoke dip pizza, teriyaki-glazed crispy tofu and green beans, and definitely those caramelized shiitake tacos. I just needed a category for this cookbook, and the emphasis here is on flexible, crowd-pleasing family recipes, so there ya go. If there’s a caregiver in your life who might appreciate some cooking inspiration, buy them pizza! But then get them this cookbook.The Weekday Vegetarians: 100 Recipes and a Real-Life Plan for Eating Less Meat$32 $22 at AmazonFor salami lovers:YOU KNOW WHO YOU ARE. I have to say, when I saw Italian-American, I expected really good lasagna. But the appetizer chapter alone rewired my brain; every dish in here is so creative, so outrageously opulent, it feels like the team at Don Angie published every good idea they ever had and then sprinkled a little more parm on it. It makes me want to live more extravagantly, mostly via food. PEPPERONI RICE STUFFED IN MUSSELS. Salami and cheese croquettes. Again, these are just the apps. Shrimp parm meatballs! Swirling lasagna pinwheels! Vietnamese coffee tiramisu! Get this cookbook for the person who hosts the Feast of Seven Fishes every year, who always orders the limoncello, or who thinks shelf-stable parmesan shakers should be illegal.Italian American: Red Sauce Classics and New Essentials$35 $30 at Amazon$35 $32 at BookshopFor the person who has udon in their freezer at all times:Every time we publish a Hetty McKinnon recipe, I get excited because I know it’s going to hit all the high notes. Her sesame tofu with broccoli is a house staple. Kimchi mac and cheese—come ON. This cashew udon with crispy mushrooms, let’s GO. Don’t forget the pea and ricotta potstickers! Hetty makes recipes that are easy to follow, heavy on the veg, and just really damn delightful. Epicurious called To Asia, With Love the most “cookable” of the spring, and I’d go ahead and say, “of the year!” A great gift for newer and experienced cooks alike, noodle hoarders, plant-based people, world travelers and homebodies, and people named Alex. Did I miss any?To Asia, With Love$43 at AmazonFor Grainiacs:I’ll say it again and again: 2021 is the year of the grain, and these two cookbooks prove it. Buy Mother Grains for the baker who’ll have their world opened up by the nutty magic of einkorn flour and get Grist for the person in a meal-prep rut looking for ways to make beans, lentils, and farro more interesting. Both are surefire hits.Mother Grains$40 at Amazon$37 at BookshopGrist: A Practical Guide to Cooking Grains, Beans, Seeds, and Legumes$35 $30 at AmazonFor the plant-based and wannabe plant-based person:Don’t be scared, the vegan recipes won’t bite ya. In fact, you’ll be doing the devouring here because the chipotle barbecue sauce on the fried tofu torta is WOW. Jackfruit tinga, COOL. Edgar Castrejón’s Provecho is here for the vegans, the flexitarians, the plant lovers, and the all-around good time eaters. Let’s not put it in too tight a box. Give this to the person who never saw a taco they didn’t love, who could use a few new ways to fix up their frijoles, and who will appreciate having their mind blown by cashew cream tomato sauce slathered over their chile rellenos.Provecho$32 $22 at AmazonFor anyone who needs artistic inspiration:We shared an excerpt from Bryant Terry’s Black Food in our September issue, and if you haven’t made Jocelyn Delk Adams’s cinnamon roll pound cake, get on that. I’ll wait. Back yet? The book, which brings together a chorus of voices across the Black American diaspora, shape-shifts from recipes to art to essays, and you’ll find something new every time you open the book to a different page. It’s almost hard to call it a cookbook, because you’ll be gaining more than a few recipes from it.Black Food: Stories, Art, and Recipes from Across the African Diaspora$40 $36 at Amazon$40 $36 at BookshopFor kids who already have their own aprons:Look, it was a toss-up between this and Vegetables in Holiday Underwear, but May Your Life Be Deliciosa is just too sweet. Read this story with your kiddo and then make tamales together on Christmas Eve and start a new tradition (one that leaves with you a stack of tamales to stash in your freezer). It was actually a great year for kids’ books about food—check out Soul Food Sunday, Tomatoes for Neela, and the Waffles + Mochi cookbook to give a whole stack of ’em.May Your Life Be Deliciosa$18 $17 at AmazonFor the first person you know who threw a dinner party this year:When I had to feed a houseful of visiting cousins this year, I went straight to À Table by Rebekah Peppler because I knew the mayo chicken would knock ’em dead. And it did, along with the roasting pan of artichokes, potatoes, and shallots on the side. Her carrot salad was a hit on bonappetit.com this summer, and I made the easy persillade every time I had too much parsley (so, every time I had parsley). It’s French-y but uncomplicated, and Peppler writes like the friend who lets you crash at her Parisian apartment—she might even make you seven-hour lamb—in exchange for too much wine. Love this cookbook, and I’ll be getting it for all my friends who have a weakness for vintage glassware, good napkins, and, uh, mayo.À Table: Recipes for Cooking and Eating the French Way$30 $18 at AmazonFor those who believe in “eating the rainbow”:Mumbai Modern by Amisha Dodhia Gurbani is a mood-boosting cookbook for anyone who needs one. These bright, colorful recipes can’t not cheer you up. The recipes touch on Amisha’s Gujarati roots; now she lives in Northern California and the bounty of citrus and veg spills over on every page. There are strawberry-hibiscus jam-filled morning buns sprinkled with freeze-dried strawberry dust (based on a BA recipe, hi!), a citrus and roasted beet salad with breadcrumb-coated paneer nuggets (!), and aloo tikki arancini with saffron aioli—talk about pulling out all the stops. Every recipe is a stunner.Mumbai Modern$35 at AmazonFor the person who appreciates an indie project:Australian artist Alice Oehr put together this spiral-bound cookbook, Recipes with Friends, earlier this year, and I really admire the lounging pig on the cover—and the Snoopy illustration for Cure-All Chicken Soup. It’s a collection of recipes sourced from Oehr’s friends, none of whom I know, but I like the idea of acquiring someone else’s friends via a cookbook. (Also, I love her big cake slice prints for sale here.) I imagine if you polled all your friends for their best and favorite recipes, it’d make for a hell of a cookbook. Maybe an idea to borrow for your own holiday project...Shameless Plug section!Brad Leone’s first cookbook-slash-travelogue-slash-self-help-guide, Field Notes for Food Adventure, came out this fall, and anyone who’s seen the man stick his arm in a catfish’s mouth for the sake of YouTube needs this book faster than you can say “wourder.” You’ll read every word in Brad’s voice, which comes free of charge.Field Notes for Food Adventure$35 $30 at AmazonCarla Lalli Music’s second cookbook, That Sounds So Good, is—in my opinionated opinion—even better than her first. Buy it for the polenta sheet cake alone, which I’ve made three times now. A great gift for all the rice wizards out there, and anyone who has broccoli delight memorized.That Sounds So Good: A Cookbook$35 $31 at Amazon$32 at Bookshop.orgAnd lest we not forget our dear Molly Baz’s Cook This Book came out this spring and shot up the best seller list. The pastrami roast chicken is worth the price of admission alone. I recently made her steak au poivre again last week and will be making another run at the black sesame shortbread this holiday because I am, in fact, the person with a stash of cookie tins in her basement. It’s a great gift for newbie cooks, and it has handy QR codes (turned out to be a big year for THOSE, huh?) that link recipes to technique videos to show you how to carve that roast chicken, among other things.Cook This Book: Techniques That Teach and Recipes to Repeat$32 $20 at Amazon$30 at BookshopExplore Bon AppétitShoppingGift GuidesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-26", "author": ["Condé Nast", "Alex Beggs"]}