{"id": "dcc15e47f32145bda7b9386864102bd0", "url": "https://www.bonappetit.com/city-guides/venue/ginza-kojyu-tokyo", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Ginza Kojyu Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoGinza KojyuThe less-is-more tasting menu.FacebookPinterestTwitterEmailPhoto by Xavier Girard Lachaîne“The kaiseki menu at the Michelin-starred Ginza Kojyu doesn’t bombard you with 18 courses but rather seven or eight thoughtful, edited, fully realized dishes. It changes seasonally, and the master sommelier and chef, Toru Okuda, gets amazing ingredients like mature wild eel, which is difficult to procure and very expensive. You can taste the difference. He often finishes savory courses with kuromutsu (black-throated perch), a bluefish with a high fat content that grills exceptionally well. Also of note: the slow-grilled lobster encased in sea urchin. Dining here is always memorable.”—David Kinch of Manresa in Los Gatos, CaliforniaPhoto by Xavier Girard LachaîneChef Toru Okuda of Ginza Kojyu.\nExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}