{"id": "dccc58a94dbb4bbb2b70bf46af8f6998", "url": "https://www.bonappetit.com/recipe/tuk-trey-ping-poh-with-pork-chops", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Tuk Trey Ping Poh With Pork Chops Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueTuk Trey Ping Poh With Pork ChopsBy Chinchakriya UnMay 25, 20214.9(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis punchy dipping sauce is amazing with pork, but also works with just about any protein. We make it in huge quantities during tomato season since it freezes so well. My mom remembers eating it all the time when she was working in the fields in Cambodia—”food for the people” she calls it. Growing up, I remember camping out at the all-you-can-eat seafood buffet with my family for hours, and we’d always bring our own tuk trey ping poh for dipping. Make a big batch, then fry a cup in a bit of oil to concentrate flavors and create a base for soups, braises, and curries; add a few spoonfuls to a pot of cooked beans or lentils for heat and acidity; or set out as a dip for crudités, shellfish, or raw oysters. —Chinchakriya Un, Kreung Cambodia, Brooklyn, NYThis recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonCast Iron Skillet$30 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients4 Servings1pint cherry or grape tomatoes2shallots, quartered lengthwise4garlic cloves2green Thai chiles, stems removed4thin-cut bone-in pork chops (about 1½ lb. total)Kosher salt, freshly ground pepper2Tbsp. vegetable oilJuice of 2 limes¼cup coarsely chopped cilantro2Tbsp. (or more) fish sauce1tsp. sugarCooked white rice (for serving)PreparationStep 1Heat broiler. Spread out tomatoes, shallots, garlic, and chiles on a rimmed baking sheet; broil, turning halfway through, until tomatoes are charred and beginning to burst, about 10 minutes. Let cool slightly.Step 2Meanwhile, heat a large cast-iron skillet over high. Season pork chops generously with salt and pepper; rub with oil. Cook pork until browned, about 2 minutes per side. Transfer to a platter.Step 3Transfer charred vegetables to a food processor; pulse to a coarse paste (you want some texture). Transfer sauce to a bowl and stir in lime juice, cilantro, fish sauce, and sugar. Taste and season with more fish sauce if needed.Step 4Serve pork chops with rice and sauce for dipping.How would you rate Tuk Trey Ping Poh With Pork Chops?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleThe only way you're going to get sick from this recipe is if your pork also comes with a time machine to the past. Trichinella is no longer found in the modern world. MattDE8/19/2021Made this a week ago, and this will be added to our rotation most definitely.  The charred vegetable sauce with fish sauce was unbelievable- sweet and funky.  Using the thinly cut chops was great as it allowed for a lot of caramelized pork in a very quick cooking time.  Wifey and I were both members of the clean plate club!Chris from Boston7/12/2021It's safe to eat pork that still has pink in it. Trichinosis is in pork is a thing of the past. Look it up. That said, I will try this recipe next week. Sauce sounds fabulous!LynnWoodbury, CT7/9/2021An amazing sauce. Easy and delicious. My husband said we need to put it on everything! Pork chops were 1/2 inch thick and cooked through in a few minutes on each side in a very hot pan.AnonymousPhoenix, Az6/30/2021Freakin awesome. I got my cast iron pan blazing hot and blasted those thin pork chops. Its a very simple sauce just with few ingredients but utterly delish. I loved the sauce with the chops but I could eat it on some plain steamed rice and be very happy! It’s a keeper. WhistlejacketLaguna Beach Ca6/26/2021The exciting part of this recipe is learning what for most of us is how to make this - previously unknown to many of us - tomato sauce condiment, and people are arguing about the pork chops! Cracks me up!!Dan WConnecticut6/25/2021Y’all need to chill out, 2 minutes per side is perfectly adequate for thin-cut bone-in pork chops! A searing hot pan could OVERcook thin chops in four minutes. Anyway, you’re mainly cooking to kill the parasites (Trichinella spiralis) within the flesh so if you’re going to be squeamish be squeamish about that! “Pork is dry but at least I know my parasites are cooked!”\n\nThe sauce sounds lovely. RheaIreland6/25/2021Right off the bat, I'm thinking she meant to say \"thick\". Why because only 4 chop is a case for thick pork chops, not thin. Two minutes per side is ridiculous. Who are these chefs anyway? Lucy S.6/25/20212 mins for pork meat to cook is definitely a no for me. It's not like beef that you can eat rarely, done, well done? Pork needs time to cook very well as far as I know if don't want to get ill.RosLondon, UK6/25/2021The key is “thin cut.” Please specify an actual thickness! I haven’t made these yet because 2min per side is obviously way too little for a normal cut but how thin is thin? I left 3stars only because the site requires a measure, but that 3 stars is for the recipe not the result.  Amy BoggsSan Francisco, CA6/24/2021Delicious sauce! Definitely made more than needed for our pork chops. How long does it keep (refrigerator and freezer)? JodiCA6/23/2021Explore Bon AppétitCambodianSoutheast AsianAsianCherry TomatoTomatoVegetableGrape TomatoThai ChileChilePork ChopPorkMeatSummerEasyMainDairy-FreeGluten-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Chinchakriya Un"]}