{"id": "dce0b26be20545cb2d507c7297655d5c", "url": "https://www.bonappetit.com/story/a-beach-picnic-la-chefstyle", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "A Beach Picnic, L.A. Chef–Style | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredA Beach Picnic, L.A. Chef–StyleThe food from Kismet Chefs Sarah Hymanson and Sara Kramer is West Coast wonderful, and their beach-day menu is no exception. Best of all, this elevated-but-easy spread can be re-created anywhere. Here’s the trick to a next-level surfside menu that’ll draw hungry stares from two blankets over.By S.Pellegrino®June 13, 2018FacebookTwitterEmailHarry EelmanFacebookTwitterEmailThe vibe is chilled-out and distinctly West Coast at Kismet, the airy restaurant in Los Angeles known for its produce-forward, Middle-East-by-way-of-California cuisine. Chefs Sarah Hymanson and Sara Kramer, who opened the spot in early 2017, are its masterminds, and together they make running the show look easy. Keeping in motion the many moving parts of an all-day café is no easy feat: There’s caffeinated breakfast, which spills into casual lunch over S.Pellegrino sparkling water, which pours into moodily lit dinner, which morphs into late-night cocktails. Everything is set to repeat the next morning, which makes elusive off-time all the more precious.On those days, Hymanson and Kramer travel from Kismet’s digs on Hollywood Boulevard to the white sands of Zuma Beach in sun-drenched Malibu. But you can hardly expect chefs to stop being chefs when they’re not working: Their enhanced beach-day spread is a meditation on good living, both approachable and easy-to-replicate, but—much like the food at Kismet—bright, eye-popping, and deeply satisfying.Harry EelmanWhat are their secrets? Bon Appétit tracked down Hymanson and Kramer to find out.1. Power Up the Produce. In the Venn diagram of Middle Eastern and California cuisines, the overlapping bit is, without a doubt, fresh and massively flavorful produce. Convenient, considering there’s plenty of it on the West Coast. “A picnic is such a simple thing, and it’s just elevating it a bit by bringing some delicious produce from the market,” said Hymanson. Classic picnic foods—like, say, rich herbed labneh and crisp crudités—are all the more enticing with gorgeous blush-hued breakfast radishes or wine-colored baby carrots.Harry Eelman2. Elevate the Drink Situation. The fastest way to keep the beach mood light and bubbly is with literal bubbles. S.Pellegrino® Sparkling Natural Mineral Water has a way of making any meal feel instantly elevated and put together—plus, nothing beats the sight of its signature green bottle glinting in the sun. (S.Pellegrino® plus sand plus beach spread equals Instagram gold.)Harry Eelman3. Make It Travel. Unless your kitchen backs onto the beach (in which case, good for you!),  anything you prepare will have to brave the trip from refrigerator to beach blanket. You want “things that are good when they’re hot and when they’re cold,” said Hymanson, a.k.a. dishes that don’t spoil easily. Marinated salads—such as Kismet’s briny marinated feta with roasted onion, beets, and floral orange blossom—are your new best friend. Plus, preserved goodies like harissa-marinated olives and super-sweet dates dried at the peak of their ripeness.4. Snack It Up. At the beach, the less cutlery required, the better. That means finger food is the go-to move. Cue Kismet’s delicate, lemon-spiked chicken and pine nut hand pies. “They’re really easy to just grab and pass around,” Hymanson said. “They’re crunchy on the outside and rich and savory and tangy on the inside,” Kramer chimed in, adding that “they’re great dipped in tahini, which we also brought.” You didn’t think they’d skimp on the tahini, did you?Harry Eelman5. Get Salad-y. “We generally bring a lot of salads,” said Hymanson. That’s putting it mildly: Hymanson and Kramer have mastered the art of flavor-bombed, veg-forward dishes that elbow meat entrées out of the spotlight. Consider their ribboned cucumbers basking in citrus and creamy labneh shot through with rosewater. Or their bright orange, Moroccan-inflected carrots flecked with crunchy walnuts and fresh dill. Sure, they might be a little more work than your average three-ingredient salad, but the payoff is huge. “For the beach, you can make a few things a little bit differently than you usually do,” Hymanson stressed. “It’s fun to be a little bit creative with it.”Harry Eelman6. Think: More Is More. When planning a beach gathering, “we really like to over-prepare,” Kramer admitted. And yeah, sometimes that means bringing more food than your guests could possibly eat. Don’t sweat it, Kramer says: The aesthetic of abundance is always a hit, and there’s no shame in packing up the leftovers for tomorrow’s lunch. Plus, a sprawling spread means more friends can pop over on a moment’s notice—without anyone going hungry. That scenario plays out all too often for Hymanson and Kramer, who’ve crafted an artistic and supportive circle of L.A. friends who seem to crawl out of the woodwork on chef-catered beach days.Harry EelmanAll in all, the Kismet team’s surfside ethos can be boiled down to a single piece of advice, which Hymanson put succinctly: “Always have more food than you need!”Want to learn more stylish and satisfying ways to elevate hangouts with friends? Check out the complete S.Pellegrino® Taste Guide to see how in-the-know chefs on both coasts do it.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-31", "author": ["Condé Nast", "S.Pellegrino"]}