{"id": "dce2a6e98db4cdebe10cbc078e19df7e", "url": "https://www.bonappetit.com/story/what-is-silog", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "What is Silog? This Filipino Dish of Garlic Fried Rice Paired With Runny Eggs Is the Ultimate Savory Breakfast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Could—and I Will—Eat Silog for Every Meal of the WeekAdd whatever protein your little heart desires to the garlic fried rice and runny eggs.By Arlyn OsborneJanuary 20, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksFacebookTwitterEmailWhenever I’m in the mood for a savory breakfast (and most of the time, I am), I typically resort to the timeless equation: carb + egg + salty meat. Depending on the time and place, this can take the shape of a BEC, eggs Benedict, or huevos rancheros. It’s a remarkably flexible formula, a blueprint with a long-standing reputation that inspires endless possibilities. And there’s no question which version of this equation I turn to on the reg. It’s the Filipino breakfast staple silog, and I make it in one form or another multiple times a week. It’s my swift and hurried workday meal, my fancy family weekend breakfast, the object of my late-night hangover lust, and my champion ride or die.What is silog?Silog is a portmanteau of its two components: sinangag (garlic fried rice) and itlog (egg). Sinangag begins with a bounty of chopped garlic, which sizzles steadily in a blanket of oil and reemerges as crispy golden confetti. The garlic bits are strained from the oil and set aside, leaving behind a flavorful, savory fat. Cold leftover rice is added and tossed until warm and fragrant before it’s reunited with the crunchy garlic flakes. My ideal sinangag is earthy and flavorful but doesn’t overwhelm the dish at large. Since I don’t like my sinangag too greasy, I use half of the garlic oil to fry the eggs, which should be runny but viscous, so that the yellow yolk lazes into the rice when punctured. And like a cherry on top of dessert, the egg should gleam with a brilliant, inviting flourish.Silogs are usually served with a protein, and there are many variations. When I was growing up, my mom always kept our freezer stocked with vacuum-sealed packages of store-bought tocino (cured pork), brick-colored logs of longganisa sausage, and tuyo, a salty dried fish that’s notoriously smelly but tastes wonderful; in the pantry, metal cans of Spam and corned beef sat side by side. These were all indications (promises, really) of silogs to come.When serving sinangag and itlog with a protein, the shorthand of the protein is prefixed to “silog,” creating another portmanteau. Hot dogs plus silog equals “hotsilog,” bangus fish plus silog equals “bangsilog,” and so on. While pan-frying is the most common cooking method for silog proteins, grilling is another viable option. Just about anything can be served silog style, which means it’s a great meal for repurposing leftovers or using up whatever you have on hand.What is tapsilog?The most famous silog by far is tapsilog, made with beef tapa. (The term tapsilog was coined in 1986 by Vivian Del Rosario, who, working in the corner of a Quezon City parking lot, sold budget-friendly breakfast plates featuring tapa, sinangag, and itlog to local jeepney and tricycle drivers.)It’s commonly agreed that the origin of tapa dates back to the pre-refrigeration era, when meats were cured and dried under the sun as a form of preservation. Today, the thinly sliced beef is often simply marinated before it’s cooked. The typical marinade consists of soy sauce, sugar (from white or brown sugar or even Coca-Cola), garlic, an acid (like calamansi, lemon, or vinegar), and black pepper. There’s more than one right way to make tapa, and you can easily adjust according to your preferences. I always go for a sweeter tapa, so my recipe has an extra touch of brown sugar, which also creates crunchy caramelized edges and a sumptuous glossy finish. I like to include a sprinkle of crushed red pepper flakes to enhance the mild heat of the black pepper and add an extra spicy kick. Because beef has a tendency to release moisture when pan-fried, which can hinder caramelization, I also add a bit of cornstarch to the marinade, which helps lock in moisture.Like with the marinade, there’s more than one way to cook tapa. Some simmer the beef and marinade together until the moisture evaporates, but I prefer to remove the meat from the marinade and pan-fry it: It’s faster and less likely to produce dry, overcooked beef. Plus, the high and direct heat of the pan-fry gives me a better char. Top sirloin is the best cut for tapa—even better if you can snag one with some good marbling. Slice it against the grain into bite-size pieces (I usually cut my slices about ½\" thick).What’s served with silog?Silogs are complete on their own and don’t require anything else. But if you’re looking to refresh the palate from the rich savoriness silog delivers, sliced tomato, sliced cucumber, atchara (pickled papaya), and tart, spicy vinegar are welcome accompaniments.Remember: your silog, your rulesSilog can be whatever and whenever you want. You can choose any protein! You can make sunny-side up, over-medium, or scrambled eggs! Sure, it’s traditionally a breakfast dish. But it’s hearty enough for a family dinner, exciting enough for a weekend brunch, and can be scaled down for a simple afternoon meal, for those times when you forget to eat until noon. It’s sure to fill you up fast.Get the recipe!TapsilogSweet-salty peppery beef, crunchy garlic rice, and a runny fried egg make this Filipino breakfast perfect for any meal of the day. View RecipeExplore Bon AppétitFilipinoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-20", "author": ["Condé Nast", "Arlyn Osborne"]}