{"id": "dce5bcb1e91ec356a55f1eca56fcbcf4", "url": "https://www.bonappetit.com/recipe/zebra-striped-shortbread-cookies", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Zebra-Striped Shortbread Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueZebra-Striped Shortbread CookiesBy Chris MoroccoNovember 17, 20184.4(84)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susan Spungen, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWhy choose between the two greats, vanilla and chocolate? Each bite of this art deco shortbread has just the right amount of both. Stacking the dough in alternating colors and then smushing them into a roll is as easy as making shapes with Play-Doh. The method makes for a fancy-looking swirl that novices can succeed at too.IngredientsMakes 40–482⅓cups all-purpose flour, divided1½tsp. kosher salt, divided⅓cup Dutch-process cocoa powder1¼cups (2½ sticks) unsalted butter, room temperature⅔cup granulated sugar¼cup powdered sugar1large egg yolk1tsp. vanilla extract or paste1large egg, beaten to blend¼cup sanding sugar (any color)PreparationStep 1Whisk 1⅓ cups flour and ¾ tsp. salt in a medium bowl. Whisk cocoa powder, remaining 1 cup flour, and remaining ¾ tsp. salt in another medium bowl. These are the bases for your chocolate and vanilla doughs.Step 2Beat butter, granulated sugar, and powdered sugar in the bowl of a stand mixer on medium-high speed until light and fluffy, about 4 minutes. Add egg yolk and vanilla and beat until smooth. Divide mixture between the 2 bowls of dry ingredients (about 1 cup in each). Scrape vanilla mixture back into stand mixer bowl (save the mixing bowl) and beat on low speed just until combined. Return to reserved bowl. Repeat process with chocolate mixture.Step 3Arrange 2 large sheets of parchment paper on a work surface. Dollop one-quarter of chocolate dough in the center of each sheet and pat into rough 6x2\" rectangles. Dollop one-quarter of vanilla dough on top of each chocolate slab and pat into rectangles the same size and shape so that you have 2 layers each. Repeat entire process so you have 4 alternating layers. Tightly press stacked dough into cylinders about 1½\" wide and 8\" long, using the parchment to help you. Wrap logs in plastic wrap and chill until very firm, at least 2 hours.Step 4Place racks in upper and lower thirds of oven; preheat to 350°. Working one at a time, unwrap dough and brush with egg. Carefully sprinkle surface with sanding sugar and roll logs in sugar to coat well (really press dough into sugar so it sticks). Slice into rounds a generous ¼\" thick, rotating after every few cuts to keep slices round. Arrange cookies on parchment-lined baking sheets, spacing 2\" apart. Bake, rotating baking sheets top to bottom and front to back halfway through, until edges are just set, 12–14 minutes. Let cool on baking sheets.Step 5Do Ahead: Dough can be made 3 days ahead; keep chilled. Cookies can be baked 5 days ahead; store airtight at room temperature.How would you rate Zebra-Striped Shortbread Cookies?Leave a ReviewTell us what you thinkReviews (51)Back to TopTriangleThese turned out so delicious, just the right amount of crunch, and delicate and light just as a shortbread should be. I added less powdered sugar because I didn't have much, but with the sanding sugar coating they turned out just sweet enough and were even too sweet for my mom. Definitely making these again for gifting on Christmas! Anonymous12/18/2021These are lovely! taste is grainy shortbread.. Used Valrohona cocoa.. Starting to think abt playing with grown up flavorings.. cayenne, orange, cardamon.  As pretty and festive as the picturejenny BHudson ohio12/16/2021I made these last year for a cookie exchange and they were a huge hit. Nice texture and flavor -- i'm making them again soon.\nI.E.12/12/2021Third year making these. I usually make this GLUTEN FREE and they are Better than flour!!!! Bob's one to one. Wonderful cookie, easy and so tasty. I am giving this batch away so I used wheat flour and they are salty, not too much though just not as good as Gluten free. I like to roll the dough so it is spiral, very pretty and use those hard to stick decorating xmas sprinkles, they stick great and look so festive! Lori AnneOregon12/11/2021Excellent recipe, I added a speck of mace, mmmmm!Lori AnneOregon12/5/2021These are great cookies. Tender, tasty, and pretty easy to make.  About the salt issue:  the kosher salt measurement is for Diamond crystal kosher salt; Morton's is much saltier of which you should use half.AnonymousPhiladelphia, PA12/4/2021These were fun to make, but way, way too salty to everyone that tried them. I used half the salt called for and still much too salty. Ended up scrapping the vanilla dough and remaking with no added salt to make up for the salty chocolate dough I kept. Would highly advise using a fraction of the salt called for then tasting the dough to make up your mind. They did turn out aesthetically beautiful, though! Would make again with salt correction.HMSPhiladelphia, PA2/8/2021Delicious cookies! I made them twice… the first batch was delicious and disappeared within an hour so I decided to make another batch. I don’t know what happened because I did the same recipe,  but for some reason the dough just wouldn’t come together and crumbled apart when I tried to cut the cookies. Overall, great recipe… don’t know what happened the second time around!KenDenver, CO12/29/2020My daughter and I made these for the first time. Followed directions exactly and what a special cookie.  If you want to impress, make these.  My siblings and I are very competitive about cookies at Christmas and I just wish we could be together so they could see these.  One of my favorite cookies is a checkerboard cookie and takes it to another level for the holidays.  One of our rolls came out perfectly; looks like zebra, but the other not so much, although still nice.  The taste of the cookie is fantastic, so get a cup of coffee and enjoy a few of these. \n\nRecipe very well-written; we had no trouble with these. They will be a holiday staple on my cookie trayCathy CardamoneCape Cod12/22/2020I have made these cookies twice with the ingredients as listed as there is a very salty taste - not in a good way. I checked similar recipes and the salt in this recipes far exceeds that of other recipes so I reduced it to 1/2 tsp vs. the 1 1/2 tsp called for which is why I gave one star. AnonymousToronto, ON12/21/2020These cookies are seriously easy, tasty, and beautiful. This will be my third year making them and they have become my most beloved Christmas Cookie. They make me vv happy. AlexMiami, FL12/21/2020These are potentially a 5, I love this sort of cookie and these are a prettier, easier and more fun version to make than the traditional pinwheel.  But way too much salt.  I know all salt varies, but this was typical kosher salt and I even erred on slightly less and the cookies still taste salty.  I urge bakers to be careful and err to maybe half what is recommended here.  AnnaChicago, IL12/20/2020I loved these! I converted the ingredients to weights since I absolutely hate measuring by volume (303 g flour [173 g/130 g when split], 40 g cocoa powder, 133 g granulated sugar, 30 g powdered sugar). I was too lazy to get out a third cookie sheet and squished each log on one sheet, which was a mistake because they do spread significantly - next time I'll give them more space. But the end result was gorgeous and they taste wonderful - will be making these again and again!Alison MSan Francisco, CA12/15/2020Loved these cookies. They look so pretty and big hit for Christmas presents. Kids loved it. I’ll make them again. This recipe is a keeperAnonymousSan Francisco 12/14/2020these were very good! great when crisp on day one. with time they get tender, but don't lose their charm. used a blend of coconut oil (1/4 cup) and butter (1 cup) and a mix of regular cocoa and dark cocoa. they had a slightly coconut-y flavor. I decreased the salt by 1/4 tsp. in each dough (using mortons), and they were perfectly salty. saved the egg white to use with the sanding sugar. such a charming looking cookie. erin f. madison, WI12/8/2020Explore Bon AppétitCookieDessertCocoaOther IngredientsSnackNut-FreeBakingChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-17", "author": ["Condé Nast", "Chris Morocco"]}