{"id": "dd1a8fda49ffac3fe9199f9f4e398c4d", "url": "https://www.bonappetit.com/recipe/rutabaga-tacos-with-greens-and-queso-fresco", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Rutabaga Tacos  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRutabaga Tacos with Greens and Queso FrescoBy Gabriela CámaraMarch 19, 20183.8(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Andy Baraghani, Prop Styling by Emily EisenEmailPinterestPrintEmailPinterestPrintFilled with greens, roasted vegetables, and a little queso fresco, these veggie tacos are easy to make for a fun weeknight meal. This recipe from Gabriela Cámara is part of Healthyish Superpowered, a dinner series honoring female activists and chefs across the country, in partnership with Caviar.Ingredients4 servings1large rutabaga, peeled, cut into ½\" pieces (about 6 cups)5Tbsp. extra-virgin olive oil, dividedKosher salt1large white onion, thinly sliced1bunch curly kale, stems and ribs removed, leaves cut into 1\" pieces½tsp. crushed red pepper flakes1cup watercress1Tbsp. fresh lime juice8corn tortillas, warmed3oz. queso fresco or Cotija cheese, crumbled (about ½ ​cup)Hot sauce (for serving)PreparationStep 1Preheat oven to 425°. Toss rutabaga with 3 Tbsp. oil on a parchment-lined rimmed baking sheet; season with salt. Roast, tossing once halfway through, until golden brown and tender, 15–20 minutes.Step 2Meanwhile, heat remaining 2 Tbsp. oil in a large skillet over medium. Add onion and cook, stirring occasionally, until slightly softened and golden brown, 8–10 minutes. Add kale, red pepper flakes, and ⅓ cup water and cook, stirring occasionally, until kale is tender but still bright green, about 3 minutes. Add rutabaga, season with salt, and toss to combine.Step 3Toss watercress with lime juice in a small bowl; season with salt.Step 4Divide rutabaga mixture among tortillas. Top with watercress mixture and queso fresco. Serve with hot sauce alongside.How would you rate Rutabaga Tacos with Greens and Queso Fresco?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleAbsolutely love this recipe! Nice to have fresh tasting tacos using winter seasonal ingredients. It's not too difficult to make either so a good week night meal. HannahManchester, UK1/10/2022Explore Bon AppétitTacoMexicanLatin AmericanRutabagaVegetableKaleLeafy GreensWinterEasyWeeknight MealsMainGluten-FreeNut-FreeVegetarianHealthyishSautéRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-19", "author": ["Condé Nast", "Gabriela Cámara"]}