{"id": "dd1f001f60f3926bdcc5a231421d0fd1", "url": "https://www.bonappetit.com/story/the-poke-test", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "How to Tell If Dough Is Done Rising | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Easiest Way to Tell If Your Dough Is Done Rising The poke test should be applied to dough, never to family members.By Sarah JampelApril 14, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan SpungenFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.Here’s the scene: Your shaped Cinnamon-Date Sticky Buns have been rising for an hour and you’re not sure if they’re ready to be baked. You took a picture of them when they first went into the skillet, but it’s still hard to say just how much they’ve grown. You could take a chance—or you could do the poke test.The poke test, which is just what it sounds like, is an easy way to tell whether a shaped dough is ready for the oven, and it goes like this: Lightly oil or flour a finger or knuckle, then give the dough a gentle but assertive poke, as if you’re trying to get its attention. If the dough springs back right away (it’s saying, “Hey, why’d you do that!”), let it rise for a few more minutes. If the dough springs back slowly, like it’s waking up from a long nap, and your prod leaves a small indentation, it’s ready to go.Why does this work? You want to put your dough into the oven when the yeast has expanded as much as it can (it will have one final “feeding frenzy” once it hits the oven’s heat, at which point your dough will expand even more). When the dough springs back quickly, it’s an indication that the yeast is still producing gases and has not yet reached its limit—the air bubbles in the dough (which are trapped in the network of gluten) refill fast. But when the dough springs back in slo-mo, it’s a sign that gas production has slowed—you’ve pushed the air out of those bubbles with your finger and it’s not being replenished at high speed. Time for the last hoorah!And yes, it’s better to poke early than late. If the dough doesn’t spring back at all, you’ve likely over-proofed the dough. When the dough rises too much before it gets baked, it will collapse, rather than rise, in the oven’s heat, and the crumb will be uneven and ragged.The time it takes for your dough to rise will vary based on the temperature of your kitchen and the temperature of your dough—and the alignment of the stars in the sky. So while recipes can offer ranges—an hour to four, let’s say—the poke test is a better way to judge readiness and to get your know your dough, whether it's for buttery pull-apart rolls, doughnuts, or conchas, on a closer level.Poke, poke:Cinnamon-Date Sticky BunsThese fluffy buttermilk-laced buns are filled with a cinnamon-scented date purée to capture all that gooey sticky bun glory without being overly sweet.View RecipeExplore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Sarah Jampel"]}