{"id": "dd29d113652cf25b8ce614c6e0fdf089", "url": "https://www.bonappetit.com/story/how-to-keep-leftover-salad-from-getting-soggy", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "How to Keep Leftover Salad From Getting Soggy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Keep Leftover Salad From Getting SoggyLeftover salad looking super sad? You can do better. This easy trick will ensure that it tastes as good for lunch as it did for dinner last night.By Alex DelanyMarch 28, 2018FacebookTwitterEmailTED CAVANAUGHFacebookTwitterEmailLook, don't take this the wrong way, but: Your leftover lunch salad probably isn’t great. The wholesome intentions were there. Oh! Leftovers! I’ll bring them to work tomorrow! And eat them for lunch! And then I won’t spend money on lunch! And my bank account will thank me! And also salad is healthy! Hooorrraaayyy!Yeah, a tale as old as time. With an ending even older. You open up that cute little Tupperware (read: leftover takeout container), and make direct eye contact with the saddest pieces of lettuce you’ve ever seen. They’re soggy, slimy, and depressed. They feel even worse than they look. And they taste worse than they feel. This is not how salad should be. You can have it better.This unfortunate salad isn’t crappy because of the ingredients you chose or the container you packed it in. It’s bad because you dressed all of your salad at the same time. Dressing, more specifically the acid in dressing, makes greens wilt in a hurry. The vinegar or citrus juice you used in your dressing breaks down the cell structure of the leaves, releasing water trapped in the greens. Which is why your 18-hour-old leftover salad is all wet and deflated. Salad hates that. We hate that.Kale salad should always look this good.\nSo here’s what you do: You only dress as much salad as you’re going to eat, immediately before you eat it. It's that simple. That will fix your soggy salad situation, with a 100% satisfaction guarantee. Dress half your salad with half your dressing the night before, and pack the other half of the salad and the dressing for lunch. Oh, it’s 1:00 p.m. (the proper time for office lunch)? Bam: undressed greens. Bam: dressing. Bam. Bam. A leftover salad that actually tastes like it did last night.Are there times when this doesn't apply? Sure. Salads made with extremely hardy vegetables—think broccoli, cauliflower, etc—and non-lettuce greens like kale tend to stand up better to dressings, and sometimes even taste better after they've been marinating for a while. But when it comes to salads with more delicate greens, or even cold pasta salads that feature veggies like cucumbers, this whole dress-some-now, dress-some-later approach is a real game-changer. Because lunch is supposed to save you on a Tuesday, not spark an afternoon meltdown. No one needs one of those.Cold miso-sesame noodles count too! Dress them right before!Cold Miso-Sesame NoodlesThe ultimate dinner-to-desk lunch dish.View RecipeExplore Bon AppétitSaladBasicallySalad DressingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-28", "author": ["Condé Nast", "Alex Delany"]}