{"id": "dd3f61ae048f429d0a7faca7b150f32a", "url": "https://www.bonappetit.com/story/orange-wine-skin-contact", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "“Orange Wine” Is Just a Color, Not a Type of Wine  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture“Orange Wine” Needs to Go Away—Hear Me OutPeople seem to either love “orange wine” or hate “orange wine” but also don’t seem to understand what “orange wine” is.By Marissa A. RossMarch 20, 2018FacebookTwitterEmailPhoto by Marissa A. RossFacebookTwitterEmailBased on studies I’ve accidentally conducted by talking with strangers about wine, I have noticed a disturbing new trend. Like red and white and rosé before it, people have begun to use the color orange to define and judge wines. People seem to either love “orange wine” or hate “orange wine” but also don’t seem to understand what “orange wine” is. They know that it’s “natural” and “cool” and apparently  that’s what’s important (I guess?). I had a guy recently tell me he “only drinks orange wine” and would love for me to teach him about “orange varieties.” This guy proceeded to laugh in my face when I said that any white-wine grape can be used to make orange wine.I’m not saying you’d ever be that guy, but I also don’t want you to ever be that guy. That guy is the worst. Not only was he rude and wrong, but why in the world would you ever want to only drink one shade of wine?! “Orange” isn’t a type of grape or winemaking technique. It’s a color! And it’s only one color in the vast style, and color spectrum, of skin-contact wines.Skin-contact wines are white wines made like red wines. They ferment with the grape skins, which give wine its color. Depending on how long the juice ferments with the skins—anywhere from a few hours to many months—skin-contact wines can range in color from golden-straw yellow to vibrant amber to Tony the Tiger orange. The time with the skins also gives these wines more red wine characteristics, like bigger body and more tannin, while maintaining the acidity of a white wine. The longer the skins hang with the juice, the bigger and bolder the wine. You can end up with lighter skin-contact wines whose taste is reminiscent of the Jura’s oxidative white wines, with notes of bruised apple all the way to dirty bong water–colored bottles that taste almost like a sour beer.This is why the term “orange wine” as a category needs to die. I know, a bold statement coming from a woman who has a section in a published book with her name on it literally titled “Orange Wines.” Trust me, I’d take it back if I could, along with that trip to Tijuana on 'shrooms, but the term “orange wine” is limiting you as a wine drinker. It’s locking you into a color, and since skin-contact wines can be made with any white wine grape and use any winemaking technique, orange-hued wines can vary wildly. You may love a bright-orange Trebbiano but find the same colored Pinot Grigio to be overpowering and too tannic. But asking for a “skin-contact wine” opens you up to a world of colors, flavors, and possibilities you may never have otherwise experienced.I know it’s going to be hard breaking the habit. I catch myself still saying “orange wine” too, and this is a personal campaign I’ve been soapboxing around for months now. But you can get started by hitting the local wine shop and asking about some of my latest favorite skin-contact bottles.Photo by Marissa A. RossFor People Who Swear They Hate “Orange Wine”Clot de l’Origine “l’Original” White Blend, 2015$23, Lou Wine ShopClot de l’Origine’s “l’Original” screams spring in every way. It looks like the late-afternoon sun in March, just barely golden, and smells like a Pinterest-perfect bridal bouquet of white lilies, candied ginger, and sprigs of thyme, tied with an orange-rind bow. “l’Original” starts juicy with layers of spiced cantaloupe and soft apples but finishes dry with lemon zest and limestone minerality. Thirst-quenching but approachable, this blend of 85% Macabeu and 15% Muscat from France’s Languedoc is the perfect entry-level skin-contact wine. Also, it pairs fantastically with pappardelle with kabocha squash cream sauce. Just throwing that out there.Photo by Marissa A. RossFor PARTY PEOPLE!!! [Yelled Like Tag Team’s “Whoomp There It Is”]Sextant “Skin Bull” Aligoté Pétillant Naturel, 2016$27, Domaine LAIf your college drinking years had actually tasted good, they would have tasted like Sextant’s “Skin Bull.” Pale saffron in color, this Pétillant Naturel from Burgundy smells like a cider with stone fruit, dried papaya, and new carpet in an apartment near campus. Fresh, vibrant, and begging to party, “Skin Bull” has a bready beer taste to it and goes down easier than a 40 of High Life you didn’t pay for. Come for the party, and stay for the bright flavors of pineapple, barely ripe pears, wrists dabbed with rose hip, and zero notes of flavored vodka.Photo by Marissa A. RossFor People Who Need a Vacation But Will Settle for WinePartida Creus “Cart Ver” Cartoixa Vermell, 2016$30, Domaine LAPartida Creus’ “Cart Ver” is atomic tangerine in color and so delicious it’s trouble. Well integrated with lots of acidity, it smells like an Orange Crush and a strawberry michelada and tastes like strawberry ocean water (that’s right, two variations on a strawberry theme). There’s some nutmeg dusted in there, with rose petals and tangelo. Be careful not to finish the whole bottle yourself (or do, I sure did).Photo by Marissa A. RossFor People Who Usually Choose Beer Over WineDenavolo “Dinavolo” Vino Bianco, 2010$34, Lou Wine ShopThe copper-toned “Dinavolo” smells like orange rinds withering in the sun on a wet clay tennis court, with splashes of pineapple and mango. It tastes like eating tangerines and kumquats, with sips of a sour raspberry beer (preferably from the Rare Barrel, if I must say so myself). The blend of 25% Malvasia di Candia, 25% Marsanne, 25% Ortugo, and 25% mystery varietals is melodic and fluid but gritty and gripping with a warm and citrusy tannic finish.Photo by Marissa A. RossFor People Who Are Like, “Screw You, I Love Orange Wine!”La Stoppa “Ageno” Blend 2012$40, Domaine LADespite my agenda to stop using “orange” to describe skin contact as a style, there is no other word to describe the color of La Stoppa’s “Ageno.” It is orange, pretty damn close to Nacho Cheese Doritos orange. Fortunately, its color is the only thing that will remind you of Taco Bell’s Fourth Meal. On the nose, this Malvasia di Candia blend from Emilia-Romagna smells like driving into Palm Springs from Highway 111 with the windows down—an intoxicating breeze of squishy peaches, lemon, hot asphalt, and freshly watered lawns.Sipping on “Ageno” tastes similarly warm, with notes of apricot, navel oranges, leather, and sweat you accidentally licked off your own face. It’s bold but with balanced acidity and finishes with sandy tannins that feel just swept off a dune. (Not gonna lie, I love the 2010 vintage of this wine, but I couldn’t track one down. Keep your orange eyes peeled for either!)Once more all together now, repeat after me: SKIN-CONTACT WINES. You’ve got it. Now go drink them.Marissa A. Ross is the author of Wine. All the Time. Pick it up on Amazon for $13 and disregard that chapter called “Orange Wines” 😉.Explore Bon AppétitWineWhite WineRead MorecultureWhy Oxidized Is the Wine Word of 2017By Marissa A. RosscultureSo, What Exactly Is Natural Wine?By Belle Cushing and Marissa A. RosscultureIsabelle Legeron Is Leading the Natural Wine RevolutionBy Belle CushingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Marissa A. Ross"]}