{"id": "dd4001e44ad4643d85df772b74ae7e5e", "url": "https://www.bonappetit.com/recipe/bean-and-vegetable-salad-with-potlikker-vinaigrette", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Bean and Vegetable Salad With Potlikker Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueBean and Vegetable Salad With Potlikker VinaigretteBy Carla HallFebruary 8, 2022EmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintThis cold-weather salad from chef Carla Hall hits all the notes: sweet, savory, spicy, and salty. Here Hall uses her Country Ham Potlikker as an umami-rich base for a spicy vinaigrette that gets its silky texture from blended cannellini beans. More beans are then mixed with roasted squash, apple, and fennel for a delightful mix of crunchy and creamy textures. Making the Country Ham Potlikker is a crucial first step, so be sure to read through that recipe before you get started.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketTongs$13 At AmazonIngredients6 servings¼cup apple cider vinegar¼cup chilled Country Ham Potlikker1tsp. yellow mustard115-oz. can cannellini (white kidney) beans, rinsed, divided⅓cup vegetable oil2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, plus moreFreshly ground black pepper2medium delicata squash, halved, seeds removed and reserved, sliced crosswise ½\" thick3Tbsp. extra-virgin olive oil, divided¼tsp. cayenne pepper1large sweet-tart apple (such as Honeycrisp), cored, quartered, sliced ¼\" thick1large fennel bulb, quartered, thinly sliced115-oz. can kidney beans, rinsed¼cup chopped parsleyPreparationStep 1Blend vinegar, potlikker, mustard, and ¼ cup cannellini beans in a blender until smooth. With the motor running, stream in vegetable oil; blend until emulsified. Season vinaigrette with salt and pepper.Step 2Place racks in upper and lower thirds of oven; preheat to 400°. Divide sliced squash between 2 rimmed baking sheets; drizzle 2 Tbsp. olive oil over. Sprinkle with 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt; season with pepper. Roast 15 minutes.Step 3Meanwhile, rinse squash seeds and pat dry. Toss seeds with cayenne and remaining 1 Tbsp. olive oil in a small bowl; season with salt.Step 4Sprinkle seeds over squash. Continue to roast until squash is golden brown and tender, 13–15 minutes more.Step 5Combine squash and seeds, apple, fennel, kidney beans, and remaining cannellini beans in a large bowl. Toss with ½ cup vinaigrette. Taste and add more vinaigrette if needed. Add parsley, season with salt, and toss again.Step 6Transfer salad to a platter; serve any remaining vinaigrette alongside.How would you rate Bean and Vegetable Salad With Potlikker Vinaigrette?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerGluten-FreeDairy-FreeSaladCannellini BeanWhite BeanBeanVegetableKidney BeanDelicata SquashSquashFennelAppleFruitSideWinterFallRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Carla Hall"]}