{"id": "dd4b80013a96dcd453aa8604156ea2f1", "url": "https://www.bonappetit.com/story/can-you-bring-home-party-wine", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Is It Ever Okay... To Take Home the Wine You Brought to a Party? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay... To Take Home the Wine You Brought to a Party?No one drank it, and you would like to drink it. But-but-but-nooooo.By Alex BeggsDecember 14, 2018FacebookTwitterEmailPhoto by Fine Art Images/Heritage Images/Getty ImagesFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s etiquette column. Have a question? Email staff.bonappetit@gmail.com.If you are hosting a dinner party and invite each guest to bring a +1, how do you handle a guest who brings someone you absolutely HATE? —Hateful NateI dunno, serve them arsenic-laced wine? Depends on what level on your Hate Scale they’re at. But if you want absolute control over your dinner party, invite all of your American Girl dolls instead and leave humanity out of it. I have a friend who had the gall to marry a man I can’t stand. He likes to interrogate, quiz, and patronize you instead of “hold a normal conversation.” I’m not sure where he learned this technique, but I blame the Boy Scouts. Our last chat ended with me saying, “Well I’ve had enough of this!” Really, he’s harmless, but I’ve decided to hate him for annoying me so much. So I feel you there. When he inevitably comes over, I treat him civilly, like an alien from the planet Mansplainia on a tourism board sponsored press trip to see how we normies live. That is, if there’s any interaction at all (it’s amazing how movement works, you can just...walk away!). Then I talk mad shit the second he leaves. It’s cathartic! This is why post-party debriefs are as essential as the party itself. Let it out.If someone does something nice for you, like watch your dog or water your plants, while you’re out of town, what is an acceptable gift to give them? Wine, food, a small ceramic something, etc.? And what if you’re broke as a joke? —Cashless CarrieYou own a dog or some bougie succulents? You can afford a thank you present. It should be a gift certificate to the nearest grocery store in the range of $25–$100, depending on how many days you were lazing on a beach somewhere, and whether they sang the entire Phantom of the Opera playbook to the plants. If you know this person is a wino, get wine, but who knows if they want that leather booty malbec anyway! Also I’m not into the souvenir gift. This person got near your poodle’s poop—that’s gross. That’s more than a favor. They don’t want a pound of eerily familiar fudge. This is why I like the grocery store gift certificate, especially to Trader Joe’s, because it says: practical. Practically...cash.Thanks for bringing wine! Now LEAVE IT.\nPhoto by Alexandra GavilletPlease settle the proper etiquette when bringing beer/wine to a friend’s dinner party. I always leave the bottle behind as payment for the food, but I’ve had friends take theirs back or split a six pack. I think that’s rude, but I’m also upset to see the liter of natural wine I brought to a friend’s house sit unopened for months. — Thirsty EmilyI love how often “natural wine” as a concept comes up in this column. Why is natural wine so linked with asshole-ish behavior? Curious, curious. Anyway, I’d like to take this opportunity to call out my boyfriend’s friend Lock, who used to come over to watch Michigan football every weekend for like three years in a row (it felt like). Bill, my guy, would make elaborate bro feasts: chili, pulled pork, all kinds of Midwestern comfort foods that give you gas. Lock would stop by the pizza spot around the corner, purchase BAKED ZITI, and arrive with a 6-pack of PBR. He’d only drink the beer he brought, and then take the rest home. This is so many layers of bad behavior. How was this man employed? How did he find someone to love him? I had unending questions. Sometimes he sheepishly ASKED PERMISSION to take the beer home, which only merits a solemn head shake in response. Don’t do that. That’s tacky. If you just got out of college and you’re broke, you think there are exceptions to all the rules. You get trashed at the wedding but don’t send a gift. Take all of grandma’s Christmas checks but never write a thank you card (TEXTS DON’T COUNT). Who cares if the host drinks the wine, they can dump it on a campfire for all I care. The point is, you gotta bring the thing. And leave it. Goddammit, Lock, LEAVE IT.Snack BreakI’m freaking obsessed with these pimiento cheese crackers. I’m making them for every social gathering from now until I croak:Pimiento Cheese CrackersThe highly addictive, melt-in-your-mouth cheddar cracker is all grown up thanks to a little heat from the cayenne and a hint of sweet pepper from the pimiento.View RecipeI hate it when people ask me to take my shoes off upon entering their home—but I do it anyways. With this in mind, would it be too much to ask that my friends deposit their cell phones in a box by the door when they come over to my place? The dinner party scrolling is killing me! — Angsty AmielIt’s a special moment when you realize everyone you know has bad manners except you. This also applies to the principle of driving. Savor it, Amiel! Your friends are rude, selfish, and entitled. Probably millennials. Just kidding—everyone with a phone is addicted to it. Have you seen the memes? Memes are fantastic!! The only way to crawl out of this hole is together, so if you’re going to be a Bossy Host, which I fully approve of, at least cushion it with something self-referential: “I’ve realized I’m really addicted to my phone, it’s keeping me from living in the moment [THIS IS A GREAT MOMENT TO TEAR UP AND/OR MENTION A PET WHO DIED], so could you join me this evening in parking your phone in this Victoria’s Secret bag for the night?” In your other hand is a magnum of wine, which you’ll pour for your shoeless, phoneless, hapless guest. It’ll cushion the blow.**Ugh, are your friends new parents? The worst. Look forward to texts with the babysitter all night, the updates read aloud along the way. She sent us a pic of Henry in the bath! He made tooty bubbles! There’s no getting out of that one.My boyfriend often very kindly volunteers to do the dishes but he never cleans the sink after. Like it’s full of dirty water with pieces of dinner floating in it. How do I ask him to stop this disgusting habit without seeming ungrateful for his dishwashing service? —Tidy TinaAt some point, breaking up is easier than confrontation. This is that point.Is it ever okay to show up at someone’s house at the exact time they put on the invite? —Punctual PattyYES. CAN YOU IMAGINE A WORLD WHERE WE ALL DID THIS?!???? THIS WOULD LITERALLY ACCOMPLISH WORLD PEACE. IT’LL HAPPEN AT 6 P.M.What is the least gross way to tell your host that you used the last of the toilet paper? —Lastly LarryShow them what you did with it.Peden + MunkWhat are some Christmas cookies from the BA archives that I don’t know about? —Sugar-coated SusanRemember these pistachio sandies? An Alison Roman classic! So good. Also a sleeper hit: these peanut meringues that sound and look so French Culinary School but are actually very home-cookable. I make these chewy molasses cookies twice a December, they keep for dayssss. Pretty!! But whenever I see the photo for these curvy peppermint meringues I...feel things.That’s all for now, but if you have petty etiquette questions or recipe requests for me, email staff.bonappetit@gmail.com and be too specific. I want the juicy details!Love, AlexThe painting up top is: In a Roman Osteria, 1866. Artist: Bloch, Carl (1834-1890)Explore Bon AppétitEtiquetteholiday2018EntertainingIs It Ever OkayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-14", "author": ["Condé Nast", "Alex Beggs"]}