{"id": "dd7e339ffd6122f695a25d094c2dc7a4", "url": "https://www.bonappetit.com/story/a-taste-of-place", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "A Taste of Place | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredA Taste of PlaceTalbott Vineyards’ Chardonnay is the perfect pairing for fresh seafood this summer.By Talbott VineyardsJune 24, 2019FacebookTwitterEmailFacebookTwitterEmailCalifornia's Monterey Bay is home to a vast underwater canyon. Close to the shoreline and teeming with sea life, this canyon connects the deep, cold ocean to the wine-growing regions of Monterey in a unique union of land and sea. Its depth and nutrients are what make it a rich habitat for marine life, and the resulting climatic conditions inland in the Santa Lucia Highlands—cool, foggy mornings and sunny, windy afternoons—also make for great Chardonnay grapes, according to David Coventry, head winemaker at Talbott Vineyards in the Santa Lucia Highlands AVA (American Viticulture Area). “Chardonnay is a chameleon, but it finds its best expression in a cool climate,” says the Monterey native, whose motto is “Grow grapes in the coolest place where you can get them ripe.”Talbott's Chardonnays uniquely capture the essence of this setting, where the cooling ocean breezes temper the warm sunshine and prevent the grapes from ripening too quickly. Paying close attention to the curves of the terrain and the well-drained land, Coventry and his team cultivate Chardonnay from one of the area's coolest and most renowned vineyards, Sleepy Hollow, first planted in 1972. Although he has spent three years as Talbott's winemaker, Coventry remembers playing on the iconic Sleepy Hollow property as a child. “I know the vineyard, and most importantly I know what the vineyard needs from me,” he says. Here, thanks to that longer time on the vine, Talbott grapes develop thick skins, which concentrates their flavor on an epic scale. The resulting Chardonnays—with minerality from the soils balanced by fruit intensity—are fantastic with one of the Monterey Bay area's legendary draws: seafood. The tension between wine and food is important, Coventry says, and the freshness and acidity in the wine is key to successfully pairing it with different seafood recipes. “Acidity helps to activate your taste buds.”Thanks to its versatility, there's a Chardonnay match for any seafood dish, and Talbott's small-batch winemaking practices create vintages perfect for coastal cuisine. The grapes are gently pressed in small lots to preserve their character, and the fermentation and aging processes occur in a combination of stainless-steel tanks to enhance the fruit flavors and oak barrels to help build texture and richer complexity. The winemaking team chooses a blend of these techniques depending on the vintage and the style of each of their Chardonnays. Coventry recommends the bright, fruit-forward Kali Hart Chardonnay as an apéritif with raw bar selections such as fresh oysters; he also pairs it with shrimp, prawns, scallops and crab. He loves it with a local Monterey favorite, barred sand bass, as well as Dover sole, halibut or other delicate fish. “But consider the sauce,” he adds. For example, the bolder flavors of a dish like paella call for a smooth, luxuriously-oaked match like Sleepy Hollow Chardonnay, while Kali Hart Chardonnay pairs perfectly with cioppino: “Its fruitiness and lighter oak play well with tomato broth.” If you're serving wild salmon, swordfish or tuna steaks, the acidity of Sleepy Hollow Chardonnay works brilliantly with the oiliness of the fish. Similarly, the richness of lobster tail is offset by Sleepy Hollow Chardonnay. And when you're manning the barbecue this summer, the upfront fruit in Kali Hart Chardonnay creates the perfect tension with grilled squid or octopus. All of these pairings embody an exceptional marriage of land and sea—just like magical Monterey.SLEEPY HOLLOW VINEYARDCalifornia Table Wine, ©2019 Robert Talbott Vineyards, Salinas, CA. All rights reserved.Explore Bon AppétitWhite WineSeafoodSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-24", "author": ["Condé Nast", "Talbott Vineyards"]}