{"id": "dd80739f8e00eee4fa40abca2dc268de", "url": "https://www.bonappetit.com/recipe/ponzu-roasted-salmon-for-two", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "Ponzu Roasted Salmon for Two Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPonzu Roasted Salmon for TwoBy Chris MoroccoJanuary 2, 20184.5(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintSalty-tart and just-sweet-enough ponzu sauce is a great back-pocket finisher for everything from salads to roasted vegetables, especially when you are tired of your everyday vinaigrette.Ingredients2 servings2small sweet potatoes, halved lengthwise4tablespoons extra-virgin olive oil, dividedKosher salt112-ounce skin-on salmon fillet11-inch piece ginger, peeled, crushed1small garlic clove, lightly crushed3tablespoons fresh lime juice1tablespoon tamari or soy sauce½teaspoon honey¼teaspoon toasted sesame oil2celery stalks, thinly sliced on a bias1small Asian pear, cut on an angle into chunky piecesSliced scallions and toasted sesame seeds (for serving)PreparationStep 1Preheat oven to 325°. Coat potatoes with 1 Tbsp. olive oil on a rimmed baking sheet; season with salt. Arrange potatoes cut side down and roast until tender, 30–40 minutes.Step 2When potatoes are halfway done, coat salmon with 1 Tbsp. olive oil on another rimmed baking sheet; season with salt. Roast salmon until just opaque in the center, 16–18 minutes.Step 3Meanwhile, mix ginger, garlic, lime juice, tamari, honey, sesame oil, and remaining 2 Tbsp. olive oil in a small bowl; season with salt.Step 4Break potatoes and salmon into large pieces. Divide potatoes, salmon, celery, and pear among plates. Drizzle with ponzu dressing, then top with scallions and sesame seeds.How would you rate Ponzu Roasted Salmon for Two?Leave a ReviewTell us what you thinkReviews (35)Back to TopTriangleThis was FANTASTIC! My hubby isn't a fan of sweet potatoes but he loved this. I really enjoyed the combination of the  crunchy celery, the sweet potato, and the pear. Very umami. This will be part of our regular rotation! ClaraSanta Cruz, CA1/8/2022One of my all-time favorites. The first time I made this, I had fancy Asian pears and celery on hand and used fresh ginger and garlic. It was AMAZING. Since then, I've made it with canned pears, pre-chopped celery, and squeezy garlic and ginger, and it STILL tastes super super yummy! I often use tiny heirloom potatoes instead of sweet potatoes, too, to avoid chopping - so really, the prep time on this can either be 40 minutes or 10 depending on what you feel like! The only thing you absolutely cannot skimp on is the quality of the sesame seed oil and the quality of the fish (I made the mistake of trying canned tuna as a substitute and it was terrible - anything super fishy in this is bad). It tastes better the second and third days, so I've been making this on the weekends in my tiny city apartment and it's saved me many days of running my oven in the middle of August. Last thing - I reuse the marinade 1x and it holds up great, because no way in hell am I throwing away 1/4 cup of sesame oil every time I make this. Thank you for this recipe!SamWashington, DC8/12/2021This is one of my favorite dishes of all time. It is disarmingly delicious. The contrast of textures and flavor dance together, creating a meal so tender and comforting. The first time I tried it, it blew my mind. I always make extra so that I have plenty leftover. Overnight, there's time for everything to fully marinate in the ponzu sauce. Honestly, I think I prefer the chilled leftover portions to when it's first served hot! I imagine a goddess might bring this chilled to a picnic. When making the ponzu sauce I never measure. If I did, it would probably come out to extra lime juice, extra toasted sesame oil, and always extra garlic and ginger (I find it's easiest to grate them). I've used many different types of pairs, it doesn't really matter as long as they're crisp. Japanese sweet potatoes are my favorite here. You could win even your worst enemy over with this meal. AnonymousPhiladelphia3/23/2021Was not expecting this to be as good as it was! The sweet potatoes are creamy, the celery is crunchy, the pear adds sweetness, and that ponzu sauce packs a perfect punch. I made the salmon in the air fryer so I could roast the sweet potatoes at a higher temp and added broccolini to serve on the side. I also used a microplane on the ginger and garlic because I thought that would mix well into the sauce... and also because I'm lazy :)KristenSeattle, WA1/7/2021Wow! This is such a simple recipe and it's SO delicious. The added crunch of the celery is what really does it for me. I couldn't find a nice crunchy pear so I subbed some broccoli. I chopped it lightly let it roast with the salmon & potatoes for the last 7-10 minutes. I will certainly be making this again. AthornSC9/15/2020Really loved this recipe and am putting it into the rotation.  It's simple, but keeps you busy for the 50 minutes it takes to make it.  I added some broccolini to the plate to add some dark leafy greens, and am still experimenting to find the right pear texture (crispy is best) as I can't get the asian variety at my store. Highly recommend, and would be easy enough to double for guests.Anonymous6/29/2020Made this as last minute/something different from our normal routine under lockdown and holy cow it's amazing. I'm convinced serendipity brought this recipe to me because I've been watching a LOT of BA and we had supplies to make this already. I don't care much for celery or pears usually and never would have put them fish but it totally works and is necessary to add different texture and flavors to the dish. Prep/cook is stupid easy. I did sub d'anjou pears for the asian pears because no way I'd find those around here in these times, and jarred crushed ginger and bottled lime juice also works. Had 2 big sweet potatoes, quartered them and they cooked perfectly as instructed, not too firm or soft.AnonymousKansas City,MO4/17/2020I really enjoyed this meal. I served it with steamed broccoli.  My husband does not like anything with a sauce, finding meals that we both enjoy can be difficult.  This recipe worked well - he enjoyed the elements separately an with no dressing. We will have this again.AnonymousCalgary, AB4/8/2020My family LOVED this and my son actually said that it was one of the best things I have ever made. I, like other reviewers, would never have thought to use these ingredients together, but it was a surprising, light and delicious surprise.  I made the dressing a couple of hours earlier and removed the crushed ginger before serving. I would give it 6 stars if I could.lisemthomsVista, CA6/1/2018It's hard to find Western recipes that utilize ingredients I can easily find in Japan — so I was super stoked to make this dish, and even more stoked when I ate it. Unfortunately, Asian pears are not in season right now, and finding out-of-season produce is near impossible in Japanese markets. I considered using an apple, but opted against it and subbed roasted broccoli instead. I also fudged it a bit by adding a simple slaw to the bottom of the bowl, which added a nice crunch — something I assume the pears would have provided.  I'll admit, I was skeptical of this dish at first; this doesn't see particularly hearty or filling, and I was afraid my husband would be hungry an hour or two after dinner. Not so! Light, refreshing and perfectly flavorful. We'll be keeping this as a staple in our home to beat the hot, muggy Tokyo summer!AnonymousTokyo3/21/2018This might be one of my favorite dishes that i have ever made!kimslaton43703Irvine, CA1/24/2018I made this last night but for one. I made the regular amount of ponzu sauce and since it was so delicious, I ate it all. I forgot to get a pear, but I think the crunch and sweetness will go nicely so will remember it next time. I'm so happy that I've taken a liking to salmon in my later middle age. When cooked right (very rare) it's absolutely divine!Benjamin CrowAustin, Texas1/10/2018This recipe will become a standard at my house: the flavors are splendid, it comes together easily (especially once you have made it the first time), and the unusual ingredients (I never would have thought of the celery, pear, and sweet potatoes with the salmon) provide the right blend of crunch and silky salmon.  Most of it is no-cook which make it even easier. The ponzu sauce will also become a standard for all sorts of other things.  The recipe can be scaffolded: make the sauce and cut the veggies ahead.  Then amaze yourself with an easy, healthy and tasty meal.AnonymousChampaign, IL1/10/2018Possibly one of the worst things I have ever made.  I like each of the components on their own, but as a meal they just didn’t work for me.   AnonymousSeattle, wa1/10/2018Very good and well balanced. Absolutely yes to the celery. Used a Bosque pear. Minneapolis1/9/2018Explore Bon AppétitJapaneseEast AsianAsianSalmonFishSeafoodSweet PotatoPotatoVegetableCeleryGingerHerbs & SpicesAsian PearFruitEasyWeeknight MealsMainDairy-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-12-18", "author": ["Condé Nast", "Chris Morocco"]}