{"id": "dd86fb2818aee3d343a5bfcd0ece514e", "url": "https://www.bonappetit.com/story/adam-rippon-stress-strategy", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "Adam Rippon's One Technique For Staying Calm Under Pressure | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAdam Rippon's One Technique For Staying Calm Under PressureFor Adam Rippon, it all comes down to one strategy.By Aliza AbarbanelFebruary 15, 2018FacebookTwitterEmailFacebookTwitterEmailIn addition to being a brilliant Olympic figure skater and a burgeoning Twitter commentator, Adam Rippon would make a pretty good life coach. He's used his global platform to address gay rights and body image issues, and, when we spoke to him just before the 2018 Winter Olympics, he told us about how he handles performance anxiety. Read on for his master strategy and how to employ it, whether you're stepping onto the ice rink, the stage, or your boss's office.Beyond the jumps and triple axels, a huge amount of athletic performance comes down to mental game. How you handle nerves—from the cumulation of a lifetime of work or thoughts of the millions of people watching and commenting online—is often what separates the medal winners from the rest of the pack. “I know that, at twenty-eight, I’m a lot tougher than I ever thought I was,\" says Adam Rippon. \"It’s how you deal with the situations that’s important.”The first part of Rippon's strategy is to see anxiety as a good thing. “When I feel nerves, it’s like I earned them,” he says. “I’ve worked my whole life to be in the situation where I can be like, ‘Oh my god, I’m so nervous to compete at the Olympics.’\" This works because, when you feel grateful for something, you're less likely to feel terrified. Nobody lucks into competing at the Olympics, or interviewing for a high-level job, or a million other important life events. Recognizing your journey helps reaffirm your confidence.The second part of Rippon's strategy is to re-direct his attention. “I used to go out in competition and be like, ‘The weight of world is on my shoulders,’\" he says. But now, at 28, he looks beyond the ice. “To get a sense of reality and the things that actually matter in life, I’ll go to my coaches and ask how their family is doing,” says Rippon. “It reminds me that life is so much bigger than the arena I’m in.”Both techniques are about gaining perspective, and Rippon isn't the only Olympian using this strategy. From silver medalist luger Chris Mazdzer , who visualizes going down the track in a series of \"mind runs,\" to hockey player Meghan Duggan, who journals her goals and intentions every morning, the Team USA roster is stacked with athletes hoping to destress by keeping perspective.Dr. Brent Walker, Columbia University’s Associate Athletics Director for Championship Performance and former mental training consultant for the U.S. Soccer Paralympic soccer team, says Rippon's strategy is at the core of sports psychology. “Usually, when we struggle, things get out of perspective,” he says. And even people who aren't going for gold in Pyeongchang can put it to good use. Here are his five key tips for handling yourself in the most stressful situations.Do a \"validity check.\"Dr. Walker’s favorite way to keep perspective involves assessing the situation as it unfolds. “I call it a validity check: Are the thoughts you’re having realistic?” he says. “ I always ask athletes to consider the narrative that they’re using in a situation. We have more than one voice in our head—we have the voice of success and the voice of failure—and part of being successful is listening to the voice of success.”Visualize coping with pressure, not celebrating victory.“People commonly think of visualization as imagining victory, but most people benefit more from visualizing ourselves in difficult situations and seeing ourselves coping with that effectively,” says Walker. “When we do that, we’re essentially preparing for being calm and composed in the moment.”Ground yourself. Literally.“When you get in the high-stress situation, it’s all about using some mindfulness techniques,” says Dr. Walker. “A simple one is noticing how your feet feel on the ground and shifting your weight—you essentially center yourself and bring your focus into the current moment.”Just breatheBreathing exercises seem basic, but they’re well known for a reason. Walker is a proponent of doing a basic four count (inhale and count to four, exhale and count to four) to combat anxiety. “Research has shown that breathing in and out on that four count will start to bring your heart rhythm back to one that’s more synonymous with a lack of stress, and focusing on the breath brings you back to the present moment,” he says.  In other words, measured breathing diminishes your body’s physiological response to stress and tricks you into feeling calmer in the process.Start using these techniques early“A lot of athletes imagine being at the Olympics on a daily basis, so they’re used to being in that moment when it actually arrives,” says Walker. “It’s almost a time-travel approach, but I think that’s what a lot of high-level athletes do—they imagine themselves in the situation, and when they get there, they can put themselves back into the past.” Anticipating a high-stress situation months out gives you time to prepare and adjust, so when the day of your big presentation arrives, you’ll feel as natural as possible.Explore Bon AppétitHealthyishOlympicsRead MoreLifestyleWhat 6 U.S. Athletes Are Eating for Breakfast at the 2018 Winter OlympicsBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-15", "author": ["Condé Nast", "Aliza Abarbanel"]}