{"id": "dd93dc0523056ba5b12f748d6a1e83cd", "url": "https://www.bonappetit.com/recipe/salt-and-sugar-pork-rib-chops", "year": 2021.0, "month": 10.0, "day": 5.0, "content": "Salt-and-Sugar Pork Rib Chops Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalt-and-Sugar Pork Rib ChopsBy Carla Lalli MusicOctober 29, 20215.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintThis quick weeknight dinner for two from Carla Lalli Music’s That Sounds So Good feels like a fancy plate you’d order at the bar of a perfect neighborhood restaurant. The salt-and-sugar combo helps the pork chop quickly achieve a golden brown crust, and doing everything in the same skillet imparts a ton of flavor to the onion and radicchio as well. Grab Carla’s new book, That Sounds So Good, out now. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonInstant-Read Thermometer$35 At ThermoworksTongs$13 At AmazonCitrus Juicer$7 At AmazonIngredients2 servings2tsp. sugar2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, plus more1lb. 1\"-thick bone-in pork rib chops4Tbsp. grapeseed or vegetable oil, divided1small onion, thinly sliced crosswise, separated into rings1head of Treviso radicchio or other radicchio (12–14 oz.), coarsely chopped1lemon, halvedHoney (for drizzling)Flaky sea saltDijon mustard (for serving)PreparationStep 1Combine sugar and 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt in a small bowl. Lightly pound pork chops with a meat mallet, rolling pin, or the heel of your hand to ½\" thick. Pat chops dry; season all over with salt mixture.Step 2Heat a large cast-iron skillet over medium-high 2 minutes. Add 3 Tbsp. oil, followed by pork chops. Cook chops, pressing down to ensure good contact with pan and turning every minute, until very well browned and charred in spots and an instant-read thermometer inserted into the thickest part registers 135°, 5–7 minutes. (Chops will still be a little pink inside; if you prefer yours well-done, cook another minute or two.) Transfer chops to a large plate and let rest 10 minutes.Step 3While the chops are resting, carefully pour off fat from skillet and wipe out any burnt bits. Heat remaining 1 Tbsp. oil in skillet over medium. Add onion and season with kosher salt. Cook, stirring occasionally, until floppy and lightly browned, about 4 minutes. Working in batches, add radicchio, tossing and letting it wilt slightly before adding more; season with kosher salt. Cook, stirring occasionally, until radicchio is wilted and tender with just a little bite in the thickest ribs, about 3 minutes. Squeeze in juice from a lemon half; toss to combine. Transfer radicchio mixture to a platter and drizzle a little honey over.Step 4To serve, carve meat away from pork chop bones and slice against the grain; arrange on platter alongside radicchio. Drizzle any accumulated juices over meat and season with sea salt. Serve with Dijon for dragging pork through and remaining lemon half for squeezing over.Reprinted from ‘That Sounds So Good’ by Carla Lalli Music. Copyright 2021 by Carla Lalli Music. Published by Clarkson Potter, an imprint of Random House, a division of Penguin Random House LLC.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Salt-and-Sugar Pork Rib Chops?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleIt was super easy and simple to make and the flavors were really good. My husband doesn’t like Dijon mustard but he liked the addition of it on the side because the flavors all worked so well together. Overall just well balanced and easy to make. Lindsey GrandoitBuford, GA11/8/2021Explore Bon AppétitWeeknightCast ironDinnerRadicchioChicoryLeafy GreensVegetablePork ChopPorkMeatEasyQuickRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-29", "author": ["Condé Nast", "Carla Lalli Music"]}