{"id": "ddbdd8975b4d5fd005f127c518290d98", "url": "https://www.bonappetit.com/story/flourless-almond-cookies", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "Flourless Almond Cookies Are a Delicious Mix of Jewish Family Traditions | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Flourless Almond Cookies Put Canned Macaroons to ShameWe have Jake Cohen's great-aunt-in-law to thank for this fast, easy Iraqi Passover dessert.By Jake CohenMarch 25, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.After both swiping right on Hinge back in 2015, my husband and I met up for our first date, where I discovered I’d snagged myself a verified nice Jewish boy. A few weeks later we were having a conversation and somehow babka came up, as it naturally does. He looked at me with complete bewilderment. He’d never heard of it before, let alone tried its magical twisted layers. I mean, you can’t beat a babka—how could this NJB not know what it was?!? It was the moment when everything I thought I knew about Jewish food crumbled around me.I grew up in a very stereotypical Ashkenazi family in NYC that falls somewhere between Seinfeld and Marvelous Mrs. Maisel. Alex comes from an Iraqi-Persian Jewish family with the same familial mishegas tinted with a hint of Shahs of Sunset. For many secular Jews in the U.S., food culture is one of our strongest ties to identity. But when it came to Alex and me, our definitions of Jewish food were completely different. So we began a crash-eating course to educate each other. I made Alex gum down his first piece of Costco gefilte fish (I can attest it’s very good!) and inhale bowls of matzo ball soup, while he had me join his mother and aunts in the kitchen to begin to learn how to cook Iraqi beet kubbeh and Persian tahdig. We fell just as hard for each other’s food cultures as we did for each other.A few years into dating, we took a real leap of faith and went as far as combining families for Passover seder. I cooked a feast with his aunt Diana, spanning all the staple dishes from both the Ashkenazi and Mizrahi sides (minus the Costco gefilte fish, much to my mother’s chagrin. Our Manischewitz-stained apple charoset sat next to their charoset of date syrup and crushed walnuts. Platters of braised brisket alternated with kubbeh and tahdig. It was the ultimate blending of cultures, fusing our families and traditions. But for me, the highlight of the evening was the arrival of Alex’s ninety-something-year-old great-aunt Doris, who I had yet to meet. She entered the dining room holding a folded piece of paper for me with her recipe for hadji bada, Iraqi almond cookies, scribbled on it, knowing I was on a journey of learning family recipes to make for Alex.It’s the gift that keeps on giving, since this recipe has become a staple sweet for any occasion and is also one of my star kosher for Passover dessert recipes in my cookbook Jew-ish. They’re sort of like French macarons without the meringue, but much easier to throw together any time you want.Here's how to make them:You start in a medium bowl by mixing together 2 cups finely ground almond flour, ½ tsp. ground cinnamon, and ½ tsp. kosher salt. The flavorings can vary from family to family, with cardamom being the most common addition. Since my mother-in-law hates cardamom with a burning passion, I use cinnamon to give those same warm, spiced vibes. You can use cardamom or omit the spices altogether.Then, in a large bowl, whisk together 2 large egg whites, 1 cup (200 grams) sugar, and 1 Tbsp. rose water until foamy, but don’t get carried away. You’re not making a meringue, you’re just breaking up the whites and starting to dissolve the sugar. Add the almond flour mixture to your foamy egg whites and fold until well combined.Grab a small bowl of room temperature water and add a few drops rose water. This mixture is the magical concoction that allows you to make pretty round cookies and not a sticky mess, while also fortifying the cookies with a little more rosiness. (If you adore grandma-levels of rosewater like myself, this step also brings some very chill spa vibes IMHO. ) Wet your hands with the water and you’ll be able to easily roll the dough into tablespoon-size balls, which you can divide between two parchment-lined sheet pans, spacing them out 2 inches apart (you’ll get about two dozen cookies total). Grab 24 whole raw almonds and stud one into the center of each cookie, as a little nod to what’s inside and a bit of welcomed textural contrast.Bake in a 350° F oven for about 15 minutes, rotating halfway through. You’re looking for the cookies to spread out and have light golden edges. Like with most egg white-based cookies, you have to be patient. Let the cookies cool completely on the pans before you try to start unlatching them so that they come off cleanly.It’s a dessert that comes together in less than 30 minutes, which is nothing short of a Passover miracle. The sweetest part of this cookie, though, is that it gets to live on in our blended Jewish family for generations to come. Aww!Jew-Ish: Reinvented Recipes from a Modern Mensch by Jake Cohen$30 $23 at Amazon$28 at Book ShopExplore Bon AppétitIt's That SimpleKosher For PassoverGluten FreeCookieDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-25", "author": ["Condé Nast", "Jake Cohen"]}