{"id": "ddbf17bd6dc7057608a270d45d277a23", "url": "https://www.bonappetit.com/recipe/black-pepper-beef-and-celery-stir-fry", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Black Pepper Beef and Celery Stir-Fry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueBlack Pepper Beef and Celery Stir-FryBy Andy BaraghaniMarch 16, 20214.4(59)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThe secret to stir-fry success? Have all your ingredients prepped and ready to go, as this dish takes just minutes to come together in the pan. Senior food editor Andy Baraghani also recommends using a very hot pan to let the beef brown properly and cook quickly. If you’re looking for another crunchy veg besides celery, chopped bok choy or cabbage also work well in this mix.Ingredients4 Servings3garlic cloves, finely grated2tsp. finely grated ginger2tsp. freshly ground black pepper1tsp. toasted sesame oil2Tbsp. vegetable oil, divided1lb. sirloin steak, thinly sliced crosswiseKosher salt5celery stalks, sliced on a diagonal ¼\" thick, plus 1 cup leaves4scallions, cut crosswise into 1½\"–2\" pieces2Tbsp. low-sodium soy sauce1Tbsp. unseasoned rice vinegar1Tbsp. unsalted butter, cut into piecesCooked rice (for serving)PreparationStep 1Whisk garlic, ginger, pepper, sesame oil, and 1 Tbsp. vegetable oil in a medium bowl. Add beef, season with salt, and toss to coat.Step 2Heat remaining 1 Tbsp. oil in a large cast-iron skillet over high. Wait until you see some wisps of smoke—if it’s not hot enough, the meat will steam instead of getting deeply browned—then, working in batches if needed, arrange steak in skillet in an even layer (it’s okay to crowd it a bit) and cook, pressing down on pieces to ensure good contact with the pan, until brown around the edges, about 1 minute. Turn steak over and add sliced celery and scallions. Cook, tossing often, until celery is slightly tender but still has some good crunch and scallions are lightly charred, about 2 minutes.Step 3Remove skillet from heat and add soy sauce, vinegar, butter, and 3 Tbsp. water. Toss, until butter is melted and sauce coats steak (still off heat). Add celery leaves and toss until slightly wilted. Season with more salt if needed.Step 4Divide rice among bowls and top with beef stir-fry.How would you rate Black Pepper Beef and Celery Stir-Fry?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleVery nice.  Made with flank steak but otherwise followed to a \"T\".  Fun way to promote celery into the foreground of a recipe.  Both of my teenagers ate it.Annette H.Sparks, MD2/7/2022Made this tonight. Used some homemade stock and a bit of Bragg's Aminos in the sauce. Skipped the butter. Served it with brown rice. It was delicious! Simple and tasty. I will definitely make this again. AnnaRavenSillycon Valley1/5/2022great simple recipe! I added julienned red bell pepper in with the celery and it turned out well. Overall, the flavor was bland as other reviewers mentioned, so I added more black pepper and noticed the flavor was much more intense in leftovers the next day. AnonymousWashington DC7/17/2021Very quick, tasty and easy.\n\nI do recommend upping the black pepper, tossing in some sesame seeds and/or topping with a thinly sliced chile; as others have noted in the reviews, I found it just a bit bland when made exactly as in the recipe. BToronto, Ontario5/23/2021This was very, very good. I am not much a meat eater, but this recipe made my mouth water so I picked up some steak and no regrets! Very easy and delicious. It’s a new favourite at our house, my partner proclaimed it is his favourite thing we have ever made.AileenHalifax4/28/2021I wanted to like this. But it turned out very bland. We felt it really needed something for some flavor punch.AnonymousBellingham, WA4/25/2021Made this whole food plant-based, using the original recipe as a spectacular flavor scaffold (there are great minds working on the bonappetit staff)--turned out awesome! I made seitan steak-style cutlets from \"It Doesn't Taste Like Chicken,\" I subbed date sugar/date paste for the maple from that recipe and omitted any oil, sliced the seitan, then went back to this recipe:  Here, I use tahini instead of sesame oil, omitted butter, and cooked everything up in a little bit of broth on a great nonstick ozeri pan. SCRUMPTIOUS. I like to think I am pretty good at renovating a recipe, but I prefer to leave the real structural engineering to more qualified artists ;)Food-Lover Health-SeekerAsheville, NC4/24/2021This is great and pretty easy to prepare. Halve the amount of soy sauce and you'll still have an equally tasty dish. Tossing in some roasted sesame seeds will pull out the taste of the sesame oil.Evan GSan Francisco, CA4/16/2021Made this for my family and it was great! I used baby bok choy instead of celery, which worked really well in the recipe. Will definitely be made again. Jon Philadelphia 4/14/2021The meal was quite tasty. I purchased a bag of cole slaw and added it to the dish. The recipe was accurate, using pre-cut beef sirloin stir fry cut down on the prep and for a low carb household, it was quite ideal. I loved the crunch of the vegetables!MarionBoston, MA4/11/2021Beef seared perfectly. Had to add more veggies to make it a more substantial meal for the fam. I’d make this again!!CSToronto , ON4/7/2021This is delicious and so easy.  My bunch of celery did not have leaves, so I subbed fresh parsley for the celery leaves.KarenChicago4/7/2021Incredibly easy to make, and beyond the sirloin, used stuff that I had readily available. I agree with the other reviewer-- a great use for leftover celery! I think it would be nice with other proteins, too.AnonymousCape Cod, MA4/3/2021A great use of leftover celery! We used about twice as much celery as the recipe called for, because we had so much leftover from buying celery for the Yemeni matzo ball soup which barely used any celery. Made the mistake of not heating the pan high enough so our beef did not sear like I would have wanted, but still great flavor and would definitely make again. This will be our “leftover celery” dinner. Would be easy to riff on with other meats like ground chicken or pork, too. LeahBellingham, WA4/1/2021Explore Bon AppétitStir-FrySteakBeefMeatCeleryVegetableGingerHerbs & SpicesQuickEasyWeeknight MealsMainKetoDairy-FreeFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Andy Baraghani"]}