{"id": "ddd8eb13f7e29551a37a07d855b24e85", "url": "https://www.bonappetit.com/recipe/lunch-nachos-with-spiced-cauliflower", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Lunch Nachos With Spiced Cauliflower Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueLunch Nachos With Spiced CauliflowerFebruary 9, 20214.2(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintTest Kitchen director Chris Morocco relies on some version of these lunch nachos at least once a week as he brainstorms what to feed his two young kids. It’s worth it to commit the formula to memory: a bag of chips, a can of refried beans, maybe some leftover meat or roasted veg from the night before, shredded cheese, and some kind of quickly cooked, spiced veg like cauliflower or brussels sprouts. It’s a lightning-fast lunch (or dinner) that can be tweaked to suit anyone’s preferences.Ingredients2 servings1cup thinly sliced radishes, red onion, cabbage, carrots, or other firm vegetable½cup seasoned rice vinegar3Tbsp. extra-virgin olive oil, divided2garlic cloves, smashed½small head of cauliflower, halved through stem end, thinly sliced1tsp. ground coriander1tsp. ground cumin1tsp. paprikaKosher salt8oz. tortilla chips1cup refried beans (such as Amy’s)8oz. sharp cheddar, coarsely gratedChopped avocado, cilantro leaves with tender stems, and plain yogurt (for serving)PreparationStep 1Toss radishes and vinegar in a small bowl to combine; set aside.Step 2Preheat oven to 400°. Heat 2 Tbsp. oil in a large skillet over medium-high. Cook garlic, tossing often, until golden around edges, about 2 minutes. Add cauliflower; cook, undisturbed, until golden brown underneath, about 3 minutes. Toss, then continue to cook, tossing occasionally, until browned all over and crisp-tender, about 3 minutes more. Add coriander, cumin, paprika, and remaining 1 Tbsp. oil. Cook, tossing, until very fragrant, about 1 minute; season with salt.Step 3Spread half of chips on a small rimmed baking sheet. Arrange half of cauliflower on top. Dollop half of beans over, then sprinkle with half of cheese. Repeat layers one more time. Bake until cheese is melted, 10–12 minutes. Top with drained radishes, avocado, cilantro, and yogurt.How would you rate Lunch Nachos With Spiced Cauliflower?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleFast, filling, flavorful vegetarian recipe with plenty of protein from the beans + corn chips, and cheese of course. Loved all the veggies, and the pickled radishes are choice. Adding shredded purple cabbage makes it even prettier to look at. From personal experience, this is a great single sheet pan dinner for two (hunched over the tray like two seagulls over a spilled pile of fries). Anonymous1/23/2022Awesome! We are satisfying full & happy for the pile of vegetables. 😁 The pickled veg was dead-simple, I made extra. They pretty much take the place of salsa. I used store bought crumbled cauliflower which was a bit too moist, I'll use a fresh head next time. Terri Heal Victoria, BC Canada 2/28/2021This is one I will use often. Can't wait to try it. \nI like the fact that it's meatless. \nKeep the recipes coming!!Jodi 2/9/2021Explore Bon AppétitNachosCauliflowerVegetableEasyQuickWeeknight MealsVegetarianNut-FreeLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast"]}