{"id": "dddba879d8008ba5b5bd3c8185fd5dd8", "url": "https://www.bonappetit.com/story/glowing-is-the-new-having-it-all", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "How to Get Glowing Skin Is the 2018 Version of the Question, How to Have It All | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleGlowing Is the New ‘Having it All,’ and That’s Not a Good ThingOur obsession with glowing is about more than just coveting the skin of literal babies.By Emily SchildtNovember 30, 2018FacebookTwitterEmailIllustration by Elodie LascarFacebookTwitterEmailIt was a typical Tuesday afternoon in November, and I was making my way through a checklist of errands around Manhattan. As I crossed the street, a bus intercepted my path, slapped with an ad for collagen powder: “Let’s glow, babes.” A few blocks later, I encountered a sandwich board outside a beauty shop that read: “Want a glow? We’ve got a mask for that.” While I waited in line at Whole Foods, I popped open Instagram for a scroll through my feed and happened upon @namvo and her daily dose of #DewyDumplings. Later, I perused the newspaper at a local café and saw an article on the latest wedding diet trend—a high-fat diet that, you guessed it, gives you a glow. You get my point: We’ve become a culture obsessed with glowing. But why?The surface-level answer, of course, is found in our standards of beauty. As the label on my Kaffe 1668 “Glow” juice reminds me, we’ll do anything “for youthful skin.” Like it or not, we still live in a society in which having the complexion of a literal baby is a status symbol. Healthy, clear-looking skin also communicates good hygiene and self-maintenance—just ask any acne sufferer about the ridicule and judgment they’ve endured.People have coveted youthful, healthy appearances since the beginning of time, but today’s version of glowing goes deeper, literally. Not that long ago, the words “you’re glowing” was a compliment reserved for women at very specific life stages: new love, weddings, and pregnancy. It was a signal of feminine energy, of fertility. Now, we’re expected to glow every damn day. It’s the number one indicator of “wellness,” that concept that’s come to mean everything and nothing at all.Year after year, the global wellness industry continues to increase by the billions. It’s invaded just about every other industry from beauty to fitness to medicine to travel. We are all zealously striving for a healthy, well-balanced life; meanwhile, it’s all starting to look like a familiar trap.In 1982, writer and longtime Cosmopolitan editor Helen Gurley Brown came out with her iconic book, Having It All: Love, Success, Sex, Money . . . Even if You’re Starting With Nothing. The book is a symbol of the false promise of feminism: that women can raise kids, clean house, go to work, feed the family, and please their partners at the end of the night. Today, the wellness industry tells us we should be meditating, shooting apple cider vinegar, going to yoga, and following our 15-step skincare routine, all before we’ve whipped up our adaptogenic breakfast smoothie. If wellness is to 2018 what “having it all” was to the ’80s, then glowing is the modern equivalent of showing up to the potluck with a perfect perm, two well-behaved children, and a croquembouche.Our supplement shelves overfloweth with green powders like these that claim to help you glow.\nPhoto by Chelsie CraigAnd like \"having it all,\" chasing the glow is a never-ending pursuit, and an expensive one too, filled with acupuncture appointments, boutique fitness classes, organic food, and a pantry full of potions, powders, and pills. So what’s a modern woman to do? If there’s one lesson we can keep from the stereotypical glow—the love, marriage, and pregnancy kind—it’s that glowing comes from happiness, confidence, and pleasure, not hyaluronic-acid serums, raw food diets, or Instagram filters.And it’s those feelings we’ll have to pursue—not necessarily products—if we want to truly radiate. Happiness is a custom cocktail of our own creation, and we just won’t get there by chasing the version depicted on the side of a bus. We have to figure out what actually lights us up, and I'm not talking about the glare of your smartphone. In a world where there seems to be no end to the barrage of messages about what I should be doing, I find blissful, dewy joy in the things no one seems to care about selling: a walk through the residential streets of the West Village, posting up in a hotel lobby to observe and absorb passersby, a visit to Central Park just as the leaves have changed, complimenting a stranger’s shoe choice on the street, finding a Sweet Dumpling squash at the farmers' market and roasting it when I get home. Interestingly, it’s the things I do intentionally, just for me, that spark connection with something greater. And, bonus: None of these things come with a hefty price tag.As that Roald Dahl saying goes, “If you have good thoughts, they will shine out of your face like sunbeams and you will always look lovely.” It’s a line meant for children, but shouldn’t we all agree?Explore Bon AppétitHealthyishSelf CareTrendsRead MoreLifestyleWhy Are We So Obsessed with Making Healthy Desserts?By Zan RomanoffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-30", "author": ["Condé Nast", "Emily Schildt"]}