{"id": "ddded5946ce6335fe31dd534906e8ca7", "url": "https://www.bonappetit.com/story/family-dinner-etiquette", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "Dinner Etiquette for Families | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay…to Reeeeeeeach Across the Dinner Table?Solicited, ever-questionable advice from Alex Beggs for your next family dinner.By Alex BeggsSeptember 7, 2020FacebookTwitterEmailIllustrations By Cari Vander YachtFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.I need to douse EVERYTHING my mom makes with Tapatío sauce. Is that rude? —Picante PerryI bet she thinks you’re defective (but in a cute way) for being so sauce-obsessed, a nice stalemate to be in. She shakes her head. You hit the sauce. Everybody carries on.How many times is too many times to reuse a cloth napkin? —Rerun RandyThree. The first two uses are fine; the third is taking it too far. I don’t care if you can’t see any ranch dressing smudges—bacteria abound!Am I allowed to start eating without everyone at the table? Some people choose to hit the bathroom just as the dinner bell rings. Dinner is getting cold. Where IS everyone? I’m not waiting… —Famished FaraUsually the first person with a plate full of food sitting down to eat…didn’t cook it. Ever notice that? And the person who did cook definitely saw you burning the roof of your mouth on the enchiladas before anyone else had a chance. Wait the four minutes! The food isn’t going to get that cold.Illustrations by Cari Vander YachtI get that whoever didn’t cook is on dish duty, but is there an argument for leniency for someone who has been laboring away at online school all day, compared to another family member who has been, let’s say, playing video games? Or must both the workaholic and the gamer unite for dish duty? —Educated EugeneYou wish! Give your weary blue-light-ruined eyeballs a break and scrub some pans with your sib. This is your chance to ask them about their life, vent about your parents, and you might get some pretty good gossip out of it. Who knows who they’re gaming with? Could be a loooove interest.Can a family eat in front of the TV to drown out the sound of each other’s chewing, which is very, very loud? —Audible AureaYes, always. This is why Jeopardy! exists.But seriously, how do I tell a family member that they are eating too loudly? —Again, it’s AureaWhat is a loud chewer gonna do? It’s their BODY. You need to work on coping mechanisms instead because life is full of loud chewers, jaw clickers, and people who hiss-exhale “ss-aah” after the first sip of water. Take a deep breath, make stimulating conversation, or, you know, crank the Jeopardy!Coming from a family of nine opinionated siblings, is it ever acceptable to talk over someone who is holding court at length? —Second-in-line SueIn my experience the person already talking will just start talking louder and soon it’s THUNDERING MADNESS. But as I think we both know, that’s the only way in big families. Plus, it’s kinda fun, and it drowns out the cacophony of chew noises too.Illustrations by Cari Vander YachtWho gets the last chicken cutlet? —Metabolizing MateoIn order of availability:MOMThe middle childThe scrawny oneThe outnumbered stepsiblingMom’s special friend, Carl, who’ll buy us all root beer afterThe dogIllustrations By Cari Vander YachtWhen I met my boyfriend’s parents for the first time over dinner, I reached for the bread across the table and his dad called me out on it. I didn’t want to interrupt conversation! What should I have done? —Reachy RamonaYou’re not “supposed to” reach far across the table like a pauper, according to ancient rich people who were probably worried about their puffy sleeves catching fire. In this case it was ruder for Mr. So-and-So to publicly shame you. Look, you didn’t hurt anybody! Unless you whacked someone in the nose with your elbow mid-reach, which you conveniently didn’t mention here. You did a perfectly harmless thing. Next time ask when there’s a moment of pause. Protect both sleeves and septums.Illustrations by Cari Vander YachtCan you yell at your kid if he pulls out his iPhone at the table to check TikTok? —Peeved PapaUh-oh, are you talking about a TEEN? Good luck with that. Whether it’s taking out a phone to check to see how many guys get killed in John Wick III (94!), tomorrow’s weather, or share that video of baby Leah asking for “mo’ hot dog, mo’ hot dog”—who isn’t guilty of the phone check? And me of all three this week alone. If it bothers you so much, why not institute a no-phone-at-the-table policy where everyone drops their device in a serving platter? Done. Solved it.Explore Bon AppétitEtiquetteIs It Ever OkayFamilyFamily MealsFeeding A FamilySummerRead MorerecipesThese 81 Easy Pasta Recipes Are Your Weeknight-Dinner SaviorsGallery81 SlidesBy Bon Appétitrecipes95 Easy Summer Dinner Ideas You Won’t Break a Sweat OverGallery95 SlidesBy Mehreen KarimRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-07", "author": ["Condé Nast", "Alex Beggs"]}