{"id": "ddde916934a4f947590e492eecc934b6", "url": "https://www.bonappetit.com/story/climate-diet", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "I Followed the Climate Diet For a Week and Now I’m Afraid We’re Doomed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Followed the Climate Diet For a Week and Now I’m Afraid We’re DoomedEating for a healthy planet isn't hard...if you have plenty of money, plenty of time, and an office fridge that can accommodate a small castle of Tupperware.By Alejandra BorundaApril 11, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI am a climate-scientist-turned-climate-journalist, which means I basically stew in bad news. I track global atmospheric carbon dioxide concentrations like other people track the weather. There’s a strong chance that, a few beers in at a party, I’ll start telling you the details of how surface ocean dynamics in one part of the world strengthen storms in another.But while I often find myself up in the theoretical clouds, I want to be more on the (rapidly warming) surface of the planet, doing my part to keep the climate crisis from worsening. I bike nearly everywhere, fly as infrequently as possible, keep the thermostat low, and keep petroleum-based plastics out of my life. But one area of my life I’d never touched was my diet.Then, earlier this year, the Lancet (a very serious, very legitimate, often dour medical journal), published a paper outlining the “climate diet:” A detailed roadmap for how to eat in order to sustain a healthy planet in our climate-changed future.Food production makes up somewhere between 20 to 30 percent of all greenhouse gas emissions worldwide, and emissions creep higher each year. By 2050, there are likely to be over 10 billion people on the planet, all of whom will need to eat. In order to make sure we can feed everyone without continuing to dump planet-warming greenhouse gases into the atmosphere, we’re going to need a “Great Food Transformation.”Okay, I thought. Game on. I’ll leave the agricultural scientists, policymakers, and farmers to deal with the big-scale stuff, but, for one week at least, I would eat like it was 2050...and see what the future tasted like.The prepI started by reading all 46 pages of the dense, sweeping report (recommended if you’ve got an extra hour on your hands).Then, as a former scientist is wont to do, I made a spreadsheet.The authors roughly outline the different categories that fit into a human- and planet-friendly diet. About 34 percent of daily calories, they say, should come from the starchy stuff, like rice and potatoes and wheat. Another 23 percent should come from legumes like lentils, soy-based foods, and peanuts. And another 18 percent should come from fats—preferably liquid ones that aren’t derived from an animal. All the rest get split between fruits and vegetables (a surprisingly small eight percent of the recommended daily intake), dairy, meat, and sugary things.I spent a few hours entering some recipes into my spreadsheet and thinking about how to align my typical food choices with the climate diet. I thought the overall breakdown didn’t seem particularly far off from my normal diet.I was…well, let’s just go with “wrong.”Day 1I started off fully-stocked and cocky. Day 1, I sauntered into the office and filled a whole corner of the fridge with full Tupperware. I’d meal-planned down to the snack to make it easier to keep track of what I was eating and to help me address one of the big issues the study authors bring up: Food waste. A stunning 30-40 percent of all food in the U.S. ends up in the trash. That’s as greenhouse-gas-wasteful as leaving the car idling overnight or taking a helicopter to work instead of biking—but while I don’t take a lot of helicopters, I am very guilty of the food-waste sin.Then I made my breakfast: a big scoop of cooked farro with a dollop of ricotta, a sprinkling of raspberries, and some cinnamon.Oh no, I thought. That blob of ricotta was basically my dairy quota for the entire day. And it was March on the East Coast, so the raspberries probably had a Bigfoot-sized carbon footprint, something I hadn’t even thought about until now. And cinnamon? Would we even have spices in a hothouse future planet?? And my coffee—how far had it traveled to waft its sweet scent toward my under-caffeinated nose? (The authors do not explicitly discuss coffee, tea, or spices in their analysis, so those conversations can wait for another climate journalism challenge).I felt a little better about lunch, which consisted of pinto beans with a fat scoop of a sour, spicy pipian, a scoop of sautéed kale, most of a roasted sweet potato, abundant chopped cilantro, and a swipe of greek yogurt (I couldn’t bear to give up that sour tang, even though I’d already crossed my dairy threshold for the day)By mid-afternoon, I was starving. What was missing? I consulted the spreadsheet. Oh, I saw: I was way low on my fat intake. For a snack I hacked apart an apple (from the farmer’s market, so I avoided the raspberry panic of the morning) and spread it liberally with peanut butter. Legumes and fat, together: win-win.For dinner, I ate some big hunks of saucy, crispy tofu over rice and some wilted greens. I used a heavy hand with the oil—even after the peanut butter snack, I was behind on my fat intake for the day. But other than that, I’d done OK. So far, so good.Day 2Day two was essentially the same, minus the ricotta and plus a scoop of peanut butter in its place. Would eat again.I was quickly realizing that I’m no great friend of the legume. Lentils? Have yet to find a preparation I actually like. Chickpeas? Not a texture I gravitate toward. I’ll eat pinto beans all day because my abuelita taught me to make them perfectly, but the rest I could take or leave.I also discovered that I eat a fairly absurd amount of dairy. Greek yogurt, ricotta, milk in my coffee and butter on my toast. Limiting dairy to something like six percent of my daily intake seemed impossible.The other difficult shift was cutting out most animal-sourced protein. I’m not a heavy carnivore, but I did at one point work on a family-owned cattle ranch, and I have a deep and abiding appreciation for good meat. But both meat and dairy are deeply inefficient ways to get caloric bang for your carbon buck. So I had to pare down to just a few bites of animal protein—chicken and fish are preferred over other meat options, including eggs—each day.Day 3Day three was when things started going off the rails. I ate a super-dense piece of rye-and-seed toast from Seylou (they call it “Bird Bread” because it’s so full of seeds) with almond butter and apple slices, and it was so delicious and filling that I forgot to eat lunch. Then I got sucked into work drinks, and before I knew it, it was 9 p.m. and I was starving, far from home, and next door to a Shake Shack. I figured my two beers counted as starch (they’re grain-based, after all), but the chicken sandwich I ate basically filled my meat quota for at least two days.Day 4Okay, I thought when I woke up the next morning, let’s get back on track. Coffee, first (I know, I know). A few hours into the morning, a nearly overflowing bowl of farro, chopped apple, and a heaping two tablespoons of peanut butter.  This breakfast mashup is growing on me; previous attempts at grain-based breakfasts left me starving a few hours later, but generous dollops of legume-based fats seem to assuage the hunger-panic. Lunch is what I was supposed to eat yesterday, another bowl of pintos, pipian, and kale. I’d stashed a half avocado in the fridge, but after languishing for too many days, it was...less than appealing, so a generous coworker spotted me a fresh one and I put the withered husk into our compost bin. I’m painfully, overwhelmingly aware of every scrap of food I waste this week, and this one induces particularly acute guilt.I down another spoonful of peanut butter with some pecans and a handful of dried pears for a snack. Dinner is another hit of leftover tofu, rice, and greens, and it’s just as good as before. Shockingly, I feel no need for dessert or evening snacks. Am I...full?Day 5Breakfast: Two slices of bird bread with almond butter and a whole apple, which is so filling  that I can’t even finish it. I slowly snack on the leftovers over the course of the morning. Lunch is the last of the tofu and rice, but I ran out of greens, which is okay, because I’ve been exceeding my slender fruits and vegetables allotment. No need for afternoon snacks, and I don’t careen around the office in a sugar-seeking haze like I normally do in the late afternoon. The climate diet is winning me over. At dinner, a friend and I walk over to a local shop and pack bowls full of falafel and roasted vegetables, pushing me about 25 percent past my vegetable allotment. I don’t feel bad about it. I realize I’ve lost a mitten, which makes my chilly bike ride home miserable, but then I remind myself that in 80 years, winter will be a faint memory in many parts of the country, so I should appreciate this chill while I can.Day 6The next day is cold and miserable, but at least it’s Saturday. Things look up after my friend delivers some whole wheat cheddar scones, which are delicious. I drizzle some olive oil on one in place of butter: highly recommend. Lunch is a salad made from odds and ends I dig out of the fridge (#nofoodwaste). I miss the feta I would usually add but make up for it with an aggressive dose of nuts, olive oil, and briny olives, along with one egg, the first I’ve had in days. Mid-afternoon, the hunger monster appears and I pour glugs of olive oil over some labneh laced with chopped herbs—I don’t know if I can quit you, dairy. Dinner ends up being a solid half of a margarita pizza and a beer at a nearby bakery and bar.Day 7Have I made it? I’ve almost made it! Breakfast wasn’t really breakfast, because I went for a long run and by the time I got back it was time for lunch. I inhaled a mountain of pinto beans buried under a pico de gallo that I chopped up quickly, shoveling them into my mouth with a short stack of corn tortillas. That was, in fact, the only real meal I ended up eating all day—I ended up out with friends in the evening, grazing on sweet potato tater tots (fits into the starch category, I guess?) and maple-roasted brussels sprouts. Delicious, but I went to bed hungry once again.The verdictWhen I could plan ahead, I was fine—full, luxuriating in ample pours of olive oil and scoops of nut butters, and pleased to be eating the Mexican food of my childhood again. But if my routine got derailed and I ended up out with friends or coworkers, if was difficult to find climate-friendly food options. Meat was everywhere, and if it wasn’t meat, it was cheese, and if it wasn’t cheese, it was sugar. The cheapest option was almost never the thing that would leave me, or the planet, feeling our best.None of this is truly a surprise, but nor was it encouraging. We need to radically rethink the underpinning of nearly every aspect of our existence in order to stave off further climate catastrophe, but if that change is too hard—if it’s more expensive and time-consuming than the alternative—we’re setting ourselves up for failure. Eating for the planet can’t be something only for wealthy people with plenty of time and offices with big fridges that can accommodate a small castle of Tupperware.I can’t say I’ve lived a totally climate-balanced food life in the few weeks since I embraced the climate diet. I can’t shake my coffee, and I default to the easy option—rarely the most planet-friendly one—far too often, particularly when I’m traveling. But I’m glad to have a framework that helps me make thoughtful choices, and I’m more aware of this food system that pushes me to eat a burger instead of a bowl of lentils. And that’s the next step to tackle: Making climate-friendly eating the default for everyone rather than a challenge for the few.Explore Bon AppétitHealthyishScienceSustainableessayRead MoreLifestyleHow Whole30 Made Me Think LESS About What I AteBy Emily CappielloRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-11", "author": ["Condé Nast", "Alejandra Borunda"]}