{"id": "ddf2311271a1c41520c8706a1e08622f", "url": "https://www.bonappetit.com/story/kristyn-leach-restaurant-diary-3", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "My Farm’s CSA Has Become a Refuge for Asian Americans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Farm’s CSA Has Become a Refuge for Asian AmericansIn her third Restaurant Diary entry, farmer Kristyn Leach talks about her Asian American community in California and how she’s supporting it at this time.By Kristyn Leach, as told to Aliza AbarbanelApril 28, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week, you’ll hear from one of them: bartender turned brand ambassador Jenny Feldt, wine educator Kyla Peal, line cook Peter Steckler, and farmer Kristyn Leach. Here Leach explains why she’s keeping her farm in Winters, California, despite the hardships she’s faced, and how that’s important for her and her community. Read Leach’s first and second diary entries here.My partner coined a term for this time of the year: May Meltdown. It’s when all your optimism and dreams for the season meet reality and you’re troubleshooting in real time. We’re still experiencing drought, so I planted 12 days earlier than I did last year to capture what moisture there was in the ground. We also are dealing with an ongoing soil-borne problem and had big pushes to plant thousands of plants a week. This time of year takes sheer stamina.After how hard last summer was and how stressful this season already is, a lot of small-scale farmers in California are thinking about the feasibility of staying where they are. You look around the state and nowhere is insulated from climate chaos, extreme heat, and little rainfall. Friends in other states will forward me land listings—look how cheap it is to farm in this area! But in the midst of this flashpoint around anti-Asian violence, I’ve come to realize why I’m here. My community is here. They eat the food I grow without needing a ton of explanation about what it is. I feel really tied to California and I think a lot of Asian American communities feel that way too. You want to stay where your people are.The type of community that has formed through our CSA boxes has been sweet; it’s made up of Asian American families with kids that range in age. Food can build bonds, even our CSA’s virtual potlucks created that closeness despite people having never met in person. Food memories open the door to talk about a lot of things that people are hesitant to talk about. Especially in intergenerational conversations, there's reluctance to talk about pain and more violent experiences. Through our CSA program we tasked kids to interview people in their community, often elders, about the different crops. Parents in my generation heard their parents talk about things more freely than they had before. This greased the wheels to have harder conversations with their parents about safety as this violence was all coming to a head.Photo by Eugene Kan of MaekanThe listserv for our CSA has generally become a place where people ask for advice, but over the past year, as people have experienced different microaggressions due to COVID, the conversation has gravitated toward how to have hard conversations with kids. Community naturally happens as people get to know each other more, but we felt it at a more expeditious rate. After the shooting in Atlanta, people reached out to ask questions like, “At what age do you start talking to your kids about what happened in Atlanta?” Once that floodgate was opened, it was a lot for people to process.I think people have felt this anti-Asian sentiment for most of this year because of that very public narrative blaming Asian Americans for COVID. It’s been on the back burner nestled within this important national conversation around policing and violence against Black communities. The fact that this got some traction with the public was validating for people, but it’s been so incredibly saddening to hear how pervasive this has been.The range of things people are dealing with is pretty intense. One parent shared about having to explain to their six-year-old why someone pulled over their car, made a menacing gesture, and said, “This is your fault.” That’s not something a child should be exposed to. Even through this small microcosm, I’ve heard a lot of people being verbally harassed a lot more often, and one of our volunteers got physically assaulted back in February.These emails are all coming through my farm’s CSA, so I feel a certain amount of responsibility to try and facilitate these conversations. I put out a message to say that I understood the position everyone was in, as an Asian American person reading the news, and how hard this specific event was. I wanted them to know that I’m here if they need anything. So much positivity has been built out of this group because it’s about food and agriculture, and I felt it was important that people know the farm isn’t just a place that produces their food and brings it to the Bay Area. It’s a place of refuge if they need it.Explore Bon AppétitRestaurantsRestaurant DiariesCoronavirusRead MorerestaurantsI Don’t Know Many Farmers Who Have the Kind of Relationship I Have With This Restaurant GroupBy Kristyn Leach, as told to Aliza AbarbanelrestaurantsI Hope We All Survive This Year and I'm Still Farming by the End of ItBy Kristyn Leach, as told to Aliza AbarbanelrestaurantsIt Finally Feels Like There’s a Bit of Normalcy—and Hope—at the RestaurantBy Peter Steckler, as told to Allyson ReedyrestaurantsRestaurant DiariesBy The Bon Appétit StaffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-28", "author": ["Condé Nast", "Kristyn Leach", "As Told To Aliza Abarbanel"]}