{"id": "ddfaac4261af59c7801946f16467c624", "url": "https://www.bonappetit.com/story/callaloo-story-of-my-ancestors", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "Trini Callaloo Tells the Story of My Ancestors | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Simple, Soulful Dish Tells the Story of My AncestorsAs a kid, Brigid Washington was skeptical of thick, green callaloo…until her first bite.By Brigid WashingtonMarch 8, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailThere are some foods you can’t un-taste. These are the dishes that inhabit a world of their own, anchoring you to a place and time in a way that’s more powerful than memory alone. For me, a Trinidadian, callaloo—a beloved dish of my twin-island home—has indeed defined my life.Callaloo is a simple side dish made with aromatics, okra, pumpkin, and the heart-shaped leaves of the taro plant, the central ingredient. Taro is a plant species that grows wild and abundant in equatorial West Africa. During the transatlantic slave trade—from the 16th to 19th centuries—taro was frequently used in minimalist meal applications by enslaved Africans brought to the Caribbean islands as a labor supply. To this day, variations of callaloo abound throughout the West Indies. Making callaloo with taro leaves forever connects the region to the reach and realities of slavery.In my narrow childhood assessment, I hated callaloo. My mother made it every Sunday as part of her massive lunch spread, and every Sunday I avoided it, not even giving it the respect of a “no thanks bite” that my mum would frequently ask of me. In my young unseasoned eyes, callaloo looked like unsavory, swampy green glop that had no place next to any of the desirables: tangy-sweet lacquered stewed chicken; freshly steamed nutty rice; cheesy decadent baked macaroni pie; and fried ripe plantains so sweet and plump, I thought them candy.As I aged, I saw how culturally significant it was in Trinidad and Tobago, but I admittedly chose not to educate myself on its salience, until one Sunday, as a preteen, I got schooled. On that day, my mother, having no tolerance for my usual quips, eviscerated my ambivalence with a side of hard truth. She highlighted that callaloo hearkens back to a time when enslaved Africans brought to the Caribbean used indigenous plant life and ready aromatics to create a masterful meal out of seemingly nothing. She made me look beyond its appearance, underscoring that what callaloo lacks in looks and finesse, it makes up for in soul and substance. She challenged me to visualize a time when our ancestors crossed the Middle Passage, bound, branded, and beaten, and reminded me that “choice wasn’t an option for slaves.” That remark moved me to reconsider some of my own choices, as a girl who had it pretty good. Then she expounded on the majesty and merits of our unofficial national dish and its place in Trinidad and Tobago’s history. I, the most talkative person in our household, fell silent. I suspect it was a silence my mother waited a long time to hear.That Sunday, the callaloo was the first item on my plate. As I took a bite, I knew immediately it was the food I couldn’t un-taste. On that bite, I felt my cells shift into place. There was no way I can deny my identity and this unassuming green side was, unquestionably, a part of it.Callaloo was also astonishingly delicious (a surprise that came only to me). The heavy hand of fresh aromatics—onions, garlic, culantro, scallions, thyme—worked overtime, the bold base flavors relenting slightly but never dissipating. Even though callaloo simmers for close to an hour, it still sizzled with bright bursts of fruity heat from the addition of Scotch bonnet pepper. The leaves and stems of the taro plant supplied deep grassy vegetal flavors that stayed lively and dominant. Freshly sliced okra thickens the dish, the inclusion of pumpkin gives it a honeyed heft, and the nutty-sweet minerality of coconut milk compounds the power of each ingredient. Callaloo is an equally simple and stellar dish. And one that embodies both the forever lingering tragedy of the slave trade as well as the resilience of that time.When I make callaloo now, in my home in Raleigh, North Carolina, I feel the self-possession that comes from accessing both a part of my home and my history. Taro leaves can be difficult to source in the States, so I’ve become quite accustomed to using a mix of spinach and collard greens. This concession isn’t all that bad. By incorporating collards into a dish that I’ve only known through the life and lens of my Caribbean experience, I’m giving the South its fair due. In addition, in lieu of pumpkin, I use butternut squash, which is a strong enough substitution. Canned full-fat coconut milk makes for a simplified prep, but the canned stuff could never compare to freshly grated coconut meat, dunked into water, then hand-squeezed until pure creamy coconut milk runs through your fingers. The coconut milk reminds me that the process matters just as much as the finished product.Nowadays, when I simmer callaloo and it has finished cooking, I drape piping hot spoonfuls of it over steamed rice the same way my mother did. I can’t help but notice the expression on my six-year-old’s face. How well do I know that look of dislike. I’m careful and patient with him though, just as my mother was tender toward me. I always offer him a bite, even a “no thanks bite” and he, unsurprisingly, declines. Soon, however, I know that the time will come, when it will be my turn to explain to him why callaloo so deftly articulates our West Indian history in a way that other dishes seldom dare. And hopefully, I too, will be gifted the sound of that knowing silence.Trini CallalooAn equally simple and stellar dish, callaloo has variations across the Caribbean and its diaspora. This version from Brigid Washington subs collards and spinach for harder to find taro leaves.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-08", "author": ["Condé Nast", "Brigid Washington"]}