{"id": "de0de0e901ea86efa33ebe4b83b62b94", "url": "https://www.bonappetit.com/recipe/hanger-steak-with-chimol", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Hanger Steak With Chimol Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueHanger Steak With ChimolSeptember 22, 20205.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Andria Lo, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrint“If you’re eating at Mercado Central in El Salvador, you’ll likely get your steak with a side of chimol,” says chef Anthony Salguero of Popoca in Oakland. “Chimol is basically a radish pico de gallo. The combination of radish and chile delivers two kinds of heat: The radish gives that peppery, nose-clearing spice while the chile gets your tongue tingling. Crunchy, spicy, and acidic, it’s exactly what you want with steak.” And you’ll also want Worcestershire sauce. “In El Salvador, Worcestershire sauce—or salsa inglesa as it’s called there—is everywhere,” says Salguero. “It’s always on the table when you’re eating hanger steak.”Ingredients4 ServingsVegetable oil (for grill)Juice of 4 limes½small red onion, thinly sliced2serrano chiles, thinly sliced, seeds removed if desired1garlic clove, finely grated8oz. any kind of radishes, trimmed (peeled if using watermelon radishes), cut into bite-size pieces1cup torn cilantro leaves with tender stemsKosher salt, freshly ground pepper¼cup plus 1 Tbsp. extra-virgin olive oil11¼-lb. hanger steak, cut crosswise into 2–3 pieces, center membrane removedWorcestershire sauce and warmed tortillas (for serving)PreparationStep 1Prepare a grill for medium-high heat; oil grate with vegetable oil. Toss lime juice, red onion, chiles, garlic, radishes, and cilantro in a medium bowl. Season generously with salt and pepper. Stir in ¼ cup olive oil. Let chimol sit at room temperature while the steak cooks.Step 2Season steak with salt and pepper, then rub all over with remaining 1 Tbsp. olive oil. Grill, turning occasionally, until deeply browned on the outside and cooked to desired doneness, 8–12 minutes for medium-rare. Transfer to a cutting board and generously drizzle with Worcestershire sauce. Let sit 5 minutes before thinly slicing.Step 3Serve steak with chimol, tortillas, and more Worcestershire sauce.How would you rate Hanger Steak With Chimol?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleYUM. I didn't know what to expect of the chimol, but it was the perfect compliment to the steak. Served with the Super Refried Beans (in the same issue) and homemade Salvadoran style tortillas (mixed masa with water until a dough formed, formed small balls, patted flat, and cooked on a dry skillet until cooked). crs7Atlanta, GA10/14/2020Explore Bon AppétitSalvadoranCentral AmericanLatin AmericanSteakBeefMeatEasyWeeknight MealsQuickMainDairy-FreeGluten-FreeNut-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}