{"id": "de197a3997eafc6ede7eee49d024fdd3", "url": "https://www.bonappetit.com/story/hail-mary-toast-los-angeles", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "My Favorite Spot for Toast in Toast Town Is Actually a Pizza Place | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Favorite Spot for Toast in Toast Town Is Actually a Pizza PlaceLos Angeles’ ubiquitous fancy snack gets an exciting little jolt.By Elyse InamineJuly 3, 2019FacebookTwitterEmailPhoto Courtesy Hail Mary PizzaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Every toast in Los Angeles lives in the shadow of the one from Sqirl. You know, that cartoonishly perfect brioche spackled with ricotta and a pool of seasonal jam? Who can rival it?Funny you should ask. Because the last time I was in L.A., I found new toasts to obsess over, and they all come from Hail Mary, a funky little pizza parlor in Atwater Village. Pies make up the majority of chef (and Gjelina alum) David Wilcox’s menu, but the breakfast toasts are so well considered, they’re not to be missed.There’s the coriander-cured salmon with marinated cucumbers and a thick schmear of fatty cream cheese. There’s the cloud-like creamed ricotta toast, speckled with sesame seeds and drizzled with honey, atop hearty whole wheat slices. There’s the thick sourdough slathered with ricotta, some seasonal chunky fruit jam, and pistachio butter, which is made with organic nuts from Santa Barbara Pistachio Company. “They’re the most expensive ingredient we have at the restaurant!” Wilcox told me over the phone. “But I love them so much that I wanted to turn them into the star of the show.”All that, and none of the crazy, Sqirl-level waits? All hail Hail Mary.Go there: Hail MaryExplore Bon AppétitHighly RecommendRestaurantsLos AngelesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-03", "author": ["Condé Nast", "Elyse Inamine"]}