{"id": "de1fcc6105a97f699ad1d45cfde65005", "url": "https://www.bonappetit.com/story/superfeet-insoles", "year": 2020.0, "month": 3.0, "day": 5.0, "content": "I Can Stand All Day in the Kitchen, Thanks to Superfeet Insoles | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Can Stand All Day in the Kitchen, Thanks to These InsolesSuperfeet insoles provide not just physical support but emotional as well.By Chris MoroccoMarch 31, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.About five years ago, I had just read Born to Run, a manifesto on humans’s evolution as endurance runners, and was ready to burn my overly confining footwear and rediscover my biological destiny. I pictured myself growing my hair out and wearing those rubber-toe-sock shoes. Yes, even on the subway.Then my foot started to hurt.When I visited a local shoe store, a wise old runner working there questioned whether it was smart for me to go from standing in clogs eight hours a day in the kitchen to wearing floppy minimalist sneakers to live and run in the rest of my day. She politely but firmly insisted I needed to support my feet more. That meant wearing very stiff running shoes, like HOKA and New Balance, and using insoles that actually do something, like Superfeet.Virtually every pair of athletic shoes comes with wafer-thin, virtually non-existent insoles that have very little heel or arch support. This is where Superfeet Black Premium Insoles come in. With ergonomic support for heels and arches, they feel molded to my feet in ways that continue to astound me. They provide near-bespoke levels of support and comfort, plus they come in a myriad of shapes and sizes that work with any foot shape. I find it is imperative to switch my footwear at least once throughout the day to avoid fatigue, bouncing around the office in Superfeet-clad sneakers, then slipping into clogs whenever I am in the kitchen.The funny thing is I had forgotten that I had a pair of Superfeet Green Insoles about 20 years ago. I used them for my hiking boots when I spent a semester studying with the National Outdoor Leadership School (which I highly recommend as well, while we are at it). With the deepest heel cup and extra support, these insoles kept me on my feet, with a 60-pound pack, for three months. It was a hard time in my life, physically punishing and emotionally tough, with feelings of crushing self-doubt. It required endurance on every level. But my feet felt just fine.Now, I’ll never forget about Superfeet again. I have even gotten some of BA’s video crew to start wearing them. Just like me 20 years ago, whatever might be aching them at the end of the day, it won’t be their feet.Buy it: Superfeet Black Premium Insoles and Superfeet Green Insoles, $50 a pair on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRead MorecultureClaire Saffitz Introduced Me to My Favorite New ClogsBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-31", "author": ["Condé Nast", "Chris Morocco"]}