{"id": "de1fdc4571c42874ad883cdcc4879cf9", "url": "https://www.bonappetit.com/story/memorial-day-2018-kitchen-sales", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "The Memorial Day Sales to Shop This Weekend | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMemorial Day 2018: All the Kitchen Sales to Shop This WeekendLet the summer sales begin.By Bon AppétitMay 24, 2018FacebookTwitterEmailPhoto by Laura Murray, styling by Anna Bilingskog.FacebookTwitterEmailMemorial Day weekend is the opening game to a season of non-stop grilling, back-to-back weddings, and for the bargain-hunter in all of us, summer sales. From grilling accessories for an upcoming cookout to a Dutch oven to have on standby, there are a ton of discounts this weekend. Read on for a list of all the food- and cooking-related sales to shop from now through next week.Accompany: Get 20% off all orders from the globally curated store with promo code SUMMERLOVER20. Products, all of which are artisan- and ethically made, include:Wild Olive Wood Leaf Scoops, set of 4 for $22 (originally $28)Sunrise Hand Towels, $22 (originally $28)Light Taupe Dancer Trivet, $18 (originally $26)All Modern: Take an extra 15% off Memorial Day sale items from the home decor retailer.Anthropologie: For a limited time, full-price furniture and home decor items are 20% off.Best Buy: Through June 6, select small and large appliances are up to 40% off. Deals include:Kitchenaid Classic 4.5-qt. Stand Mixer, $210 (originally $420)Black & Decker Bagless Cordless Hand Vacuum, $50 (originally $60)KitchenAid 5-Speed Hand Mixer, $32 (originally $50)Kyle JohnsonHayneedle: Through May 28, grills and tableware sets are up to 35% off. Outdoor items, like fire pits, planters, and patio sets, are up to 60% off. Deals include:Weber Original Kettle Premium Limited Edition Charcoal Grill, $150 (originally $200)Cuisinart Octagonal Hanging Rack, $88 (originally $98)Red Ember Basin 30-in. Cast-Iron Fire Pit, $90 (originally $140)Home Depot: Through June 6, select appliances are up to 40% off; grills and smokers are up to 15% off.Houzz: Through May 30, furniture and home decor is up to 80% off.Huckberry: Through May 28, PK Grills are 10% off with promo code GRILL18; all portable gallon and half-gallon mini-kegs by GrowlerWerks are 25% off.Macy’s: Through May 28, get 20% off select departments with promo code MEMDAY, and an extra 15% off select small appliances. Deal includes:Cuisinart 14-cup Food Processor, $200 (originally $290)Pyrex 22-piece Storage Container Set, $35 (originally $80)Nordstrom: Through June 3, select items are 40% off at Nordstrom's Half-Yearly Sale. Expect lots of markdowns from All-Clad, Anthropologie Home, Le Creuset, and more. Deals include:Le Creuset Signature 5.5-qt Dutch Oven, $340 (originally $425)Anthropologie Alara Table Runner, $40 (originally $58)All-Clad Kitchen Scale, $100 (originally $150)Photo by Alex LauSur La Table: Through May 28, all ice cream products, like editor in chief Adam Rapoport's favorite Zyliss scoop, are 20% off. Through June 18, all barbecue and pizza products are also 20% off.Zyliss Ice Cream Scoop, $9 (originally $12)Breville Smart Scoop Ice Cream Compressor, $320 (originally $400)Sur La Table Baking Steel, $80 (originally $100)Target: Through May 28, home decor and patio items are up to 30% off. Get an extra 15 percent off online only deals with promo code HERO.Wayfair: Through May 29, select kitchen items are up to 70% off.World Market: Through May 28, get 15% off your order with promo code STARS15. A few deals, including the smocked apron our food editors love, are below:Gray Washed Cotton Apron, $17 (originally $20)Sear And Grill BBQ Plancha, $16 (originally $25)Joseph Joseph Graphite Waste Separation And Recycling Unit, $170 (originally $200)And now, what to cook this MDW:1 / 80ChevronChevronJalapeño-Marinated Grilled Pork ChopsView RecipeAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitShoppingMemorial DayRead Morerecipes80 Memorial Day Weekend Grilling RecipesGallery80 SlidesBy Bon Appétitrecipes63 Memorial Day Desserts to Get You Ready for SummerGallery63 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-24", "author": ["Condé Nast", "Bon Appétit"]}