{"id": "de2fdf1da809c896d3b3ff6600c7230b", "url": "https://www.bonappetit.com/story/sunscoop-ice-cream", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "This Vegan Ice Cream Is The Creamiest I’ve Tried—And I’ve Tried Them All | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Vegan Ice Cream Is the Creamiest I’ve Tried—and I’ve Tried Them AllLife is sweeter with a few cartons of Sunscoop in my freezer.By Amanda ShapiroJanuary 8, 2021FacebookTwitterEmailCourtesy of SunscoopFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!I'm a pretty indiscriminate ice cream eater. Ben & Jerry's and Talenti and the fussy small-batch stuff are all my favorite children; I'd never pick just one. But when it comes to \"healthy\" ice cream, I'm picky. I don't expect my frozen yogurt or nondairy pint to taste like the Tonight Dough, but it has to be delicious. Well, I've tried 'em all, folks, and Sunscoop is tops.The first thing to know about Sunscoop is that it's creamy right out of the freezer, even though it's dairy-free. No need to leave it out to thaw like some other vegan ice cream brands. Maybe that's because the first ingredient is coconut cream. The next thing to know is that every flavor I’ve tried tastes amazing. The Vanilla Tart is a Pinkberry surrogate (remember them?!); the Dark Cacao with Reishi is deep and rich; and the Moringa Mint Chip almost converted me to a mint chip fan.Sunscoop's founder, Carli Blum, has a ton of food allergies, which is why she developed a line of ice creams free of dairy, gluten, nuts, soy, and eggs. And as someone who has dabbled with brown rice syrup in kitchen experiments gone awry, I am convinced that she (and Sunscoop's recipe developers) are wizards. It's the only sweetener they use! Yes, the vegan ice cream flavors are laced with adaptogens and other trendy things. Roll your eyes, but also grab a spoon. It's not often that wellness tastes so sweet.Courtesy of SunscoopSunscoop 4-Pack$80 at Amazon$70 at SunscoopExplore Bon AppétitIce CreamHealthyish Loves ItHealthyishShoppingVeganRead MoreCaramelized Banana and Almond Nice CreamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-08", "author": ["Condé Nast", "Amanda Shapiro"]}