{"id": "de2f7a289120b3d3223585b6e8ad793f", "url": "https://www.bonappetit.com/recipe/mandazi-mahamri", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "Mandazi (Mahamri) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMandazi (Mahamri)By Zaynab IssaApril 26, 20214.0(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Heami Lee, food styling by Judy Haubert, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintThis East African snack is fluffy, hollow on the inside, mildly sweet in flavor, and crisp on the outside. (If that sounds to you like the best parts of French beignets and American old-fashioned doughnuts combined into one, delicious bite, then you’re right). The coconut milk in this recipe, which is adapted from my cookbook Let's Eat, adds a unique mellow sweetness to the dough that doesn’t feel overly indulgent. The key to achieving the perfect hollow mandazi is to continue to agitate the dough when frying by flipping them and pressing them down to submerge in the oil. To make this recipe vegan-friendly, substitute vegetable or coconut oil for the melted butter. —Zaynab IssaAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDeep-Fry Thermometer$29 $16 At AmazonLarge Pot$55 At AmazonSilicone Spatula$13 At BA MarketWhisk$10 At AmazonLarge Bowl$18 At AmazonIngredients4–5 servings1tsp. instant yeast1tsp. ground cardamom2¼cups all purpose flour, plus more for surface¼–⅓cup sugar½cup full-fat coconut milk2Tbsp. unsalted butter, meltedVegetable oil (for bowl and frying; about 8 cups)Chai, sweetened condensed milk, or Nutella (for serving)special equipmentA deep-fry thermometerPreparationStep 1Whisk yeast, cardamom, 2¼ cups all-purpose flour, and ¼–⅓ cup sugar, depending on your sweetness preference, in a large bowl to combine. Step 2Whisk coconut milk, butter, and ¼ cup water in a measuring glass. Microwave until lukewarm, about 15 seconds. (Alternatively, heat in a small saucepan until lukewarm.) Pour into dry ingredients and stir with a rubber spatula until incorporated. Dough will appear shaggy and a bit dry. Step 3Transfer dough to a lightly floured surface and knead until soft and dough springs back when gently pressed, 13–15 minutes. (Alternatively, you can knead in the bowl of a stand mixer fitted with the dough hook on medium speed, 8–10 minutes.) Transfer dough to an oiled large bowl, cover with a kitchen towel or plastic wrap, and let it rise in a warm spot until doubled in size, about 2 hours. Step 4Transfer dough back to a lightly floured surface, cut into 4 equal portions, and roll each portion into ⅛\"–¼\"-thick rounds. Cut each round into 4–6 triangle-shaped portions, depending on the desired size.Step 5Pour oil into a large pot to come 2\" up sides, clip thermometer to sides, and heat over medium until thermometer registers 325°. Working in batches of 2 or 3, carefully drop dough pieces into oil. They will sink at first, then float to the surface. Once they come to the surface, cook, pushing down, pouring oil over, and turning (this will ensure they puff up and are hollow in the center), until deep golden brown, 5–7 minutes. Using a spider or slotted spoon, transfer mandazi to paper towels and let drain.Step 6Serve warm with chai, sweetened condensed milk, or Nutella. Adapted from LET'S EAT by Zaynab Issa. Copyright © 2020 by Zaynab Issa. Reprinted with permission. All rights reserved.How would you rate Mandazi (Mahamri)?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis is easy to make and the result was delicious!Anonymous12/3/2021My mother-in-law makes these donuts and I tried to make them in her memory. I found the dough very very dry. I added more water to make it soft and smooth. The hydration index does not seem right. I also wondered why you don't show water in the ingredients list? Just because it's free doesn't mean that it should not be on the list. STNiagara Falls, Ontario. 5/7/2021I want to make this, yet please recommend gluten-free flours that would be great substitutes.\nLentil, Brown rice, Cassava, Chick pea, Tapioca, Bob's Red Mill, and or a blending of gluten free flours.\nI am anxious to make this! Blessings!Linda5/3/2021Always have to try new recipes multiple times before getting it right; this recipe is easy to follow and fail-proof. \nThe Mandazi came out airy and fluffy like a 🍩  on the first try!Abdul SLake Mary, FL4/27/2021Explore Bon AppétitPastriesDoughnutDessertEast AfricanAfricanCardamomHerbs & SpicesCoconut MilkOther IngredientsYeastSnackDeep-fryBakingKwanzaaRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-26", "author": ["Condé Nast", "Zaynab Issa"]}