{"id": "de310680dff1d13ad9256e42cea673a5", "url": "https://www.bonappetit.com/story/meet-the-avocado-centric-restaurant-thats-ruling-your-summer-agenda", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "Meet The Avocado-Centric Restaurant That’s Ruling Your Summer Agenda | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredMeet The Avocado-Centric Restaurant That’s Ruling Your Summer AgendaIt’s where avocados are always in season.By AvoEateryFebruary 25, 2020FacebookTwitterEmailKevin BrownFacebookTwitterEmailPut away the toaster, lime, and the red pepper flakes. You’re going out for extra-special avocado toast––and so much more. Now Dallas-area avocado lovers can experience their favorite fruit like never before at AvoEatery, the world’s first polished-casual restaurant dedicated solely to capitalizing on the fresh, versatile, creamy, and delicious aspects of avocados. Everything, from the décor to the 29 menu items (plus 10 avocado-based cocktails!) pay homage to the fruit. Light fixtures resembling avocado harvesters, with a bright color palette and avocado wall art are just a few of the aspects that contribute to this playful, upscale design.Dine at the first-ever polished casual avocado restaurant in the world.\nSo what did it take for someone to finally develop a restaurant dedicated to avocados?! It all started with Avocados From Mexico. This not-for-profit organization based in Texas is responsible for marketing this imported fruit from Mexico (which, by the way, makes up 84% of the US avocado market). The Dallas-Fort Worth metroplex is the fourth largest metropolitan area in the U.S. and was named the 2019 Restaurant City of the Year. When it came to revolutionizing the way we eat avocados, it only seemed right that Avocados From Mexico would team up with Dallas-based Trinity Groves, a restaurant concept incubator program. The program encourages chefs and restaurateurs to create and present extraordinary dining concepts to a team of experienced restaurateurs who then turn their dream into a reality. The result? Innovative ideas, like AvoEatery, from some of the most creative minds in the industry––and a wholly unique menu to prove it.Seven days a week, at lunch and dinner, you’ll find an avocado twist on familiar dishes you might expect and some you definitely wouldn’t expect. Diners will cross culinary continents in the Appetizers section alone, with everything from avocado & corn hush puppies with avocado remoulade––a nod to New Orleans, no doubt––to Asian-inspired dishes like avocado tuna poke with wasabi aioli and chives or red snapper ceviche with aji amarillo, orange, and soy.Avocado tuna poke with wasabi aioli and chives\nAs for the toasts, experience everything from maple-smoked salmon toast with avo cream cheese, capers, and eggs to labneh avocado toast with za’atar, pistachios, mint, honey, and thyme. Those who prefer their avocado over a fresh bed of greens can opt for something hearty like a grilled steak salad, which is no average salad––pickled carrots, crushed pistachios, and crispy vermicelli see to that. There are lighter options, too, like the grilled avocado bowl, which piles on nutrient-dense goodness like quinoa, roasted zucchini, baby spinach, and avocado citrus dressing.For the sandwich-lover, AvoEatery has you covered with the hits, like their hot chicken sandwich featuring pickled avocados, and an avocado ranch, and their B.L.A.T.—for an avocado twist on the classic B.L.T. Traditionalists, fear not: The burger with sliced avocado and AvoEatery’s Secret Sauce No. 2 is not to be missed.Entrées range from classic to eclectic, with a timeless steak frites including avocado butter and avocado chimichurri, or avocado chicken curry, featuring asparagus, mushrooms, turmeric, and a green avocado curry. But don’t forget dessert, like the fluffy and creamy avo mousse or chocolate avocado brownie with avocado vanilla ice cream, coconut salted caramel, and fresh berries. Oh, and about those cocktails? There’s a drink for everyone, from bourbon lovers to piña colada connoisseurs with beverages made from avocado chocolate bitters and an avocado leaf tea-based elixir.Creamy avo mousse\nNo matter your dietary preferences––vegan, vegetarian, pescatarian, meat eater––there’s something (a lot, actually) for everyone at AvoEatery. See for yourself when you dine in person at Trinity Groves, and for more information visit avoeatery.com.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-25", "author": ["Condé Nast"]}