{"id": "de563161d989326f2d872b008a4cf58f", "url": "https://www.bonappetit.com/story/phantom-thread-breakfast-scene", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "'Phantom Thread' Has One of Best Food Scenes of the Year  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf There Was an Oscar for Best Food Scene, 'Phantom Thread' Would WinYou'll be craving Welsh rarebit with a poached egg. Bacon. Scones, butter, cream, jam. A pot of Lapsang souchong tea. And some sausages.By Alex BeggsJanuary 17, 2018FacebookTwitterEmailFocus FeaturesFacebookTwitterEmailAfter seeing Phantom Thread, you’ll either be craving mushrooms—or you’ll never want to eat them again.\nBut no, it’s not a movie about food, exactly. This is the Paul Thomas Anderson movie you may have heard about because everyone adds, “Daniel Day-Lewis’s last movie before he retires” to their plot synopses. Other than Daniel Day-Lewis’s last mad hoorah, it’s a beautiful, twisted story about a dress designer in the 50s, named Reynolds Woodcock (I can’t) and his lover/muse, Alma, played by Luxembourg native Vicky Krieps. You can break the film into chapters between four breakfast scenes, pointed out by the New Yorker critic Anthony Lane, ending in a final, wild omelet dinner that I won’t spoil for you.My personal favorite, the scene that I couldn’t stop thinking about after I left the stale-butter scented theater, was the first breakfast, in which Reynolds meets Alma at a hotel restaurant in the country. I spoke to Krieps about filming the scene with the obsessive method actor, which was not only the first time the characters meet, but also the actors (though with Day-Lewis, they’re one in the same).Woodcock is a powerful designer with persnickety tastes and always has a look on his face like he’s just gotten a whiff of himself and the smell is God. Alma is a waitress at the hotel, and they can’t take their eyes off each other—especially after she trips over a table leg and blushes deeply.When it’s time to order, he looks her in the eyes and slowly requests: Welsh rarebit with a poached egg. Bacon. Scones, butter, cream, jam. A pot of Lapsang souchong tea. “And some sausages,” which cracked up the entire theater I was in. It seems like a flirtatious and light meet-cute scene—he’s hungry for her, obviously. And she’s willing to cater to his every need and then some sausages, for now. But as the movie progresses you see how calculated and symbolic the moment really is beyond the scope of these two fictional characters’ strange-as-hell relationship.Krieps prepared with a waitress at the Victoria Hotel in Robin Hood's Bay who gave her some pointers, like serve from the right and turn the tea cup to the customer so he can easily grab it. But the lesson was as much about the practical details as the unspoken ones: “Everyone working in service knows that it’s one of the hardest things you can do,” she said, “you have to completely forget your own needs because you have to function. And if you have a bad day, you still smile. And if your back is hurting you still walk.”All we can guess about Alma, whose backstory isn’t touched upon in the movie, is that she comes from a working class family and has unquestionably accepted her place. “He could go on for five hours and she’d have to stand there and take the order,” said Krieps, “It’s interesting that their relationship starts on such a clear power dynamic, where he is very much above her and she is very much beneath—and then it’s going to turn around.”When Alma enters his world of fancy embroidery and plentiful martinis and asparagus with olive oil, never butter, it’s clear that everyone in Reynolds’s life is serving him. And the man is needy. Alma nearly gets exiled from the house after scraping butter on toast too loudly (some of us can relate), and as tensions build, she realizes that the person taking orders might be the servant, but the one cooking dinner is in control. Without spoiling anything, let’s say that a guide to edible vs. poisonous mushrooms comes into play, a mortar and pestle has a minor starring role, and you haven’t seen a romance quite like this before.Phantom Thread has a 92% on Rotten Tomatoes right now. Huh, must be good. You should see it before the Oscars!Explore Bon AppétitPop CultureMoviesSausageCelebritiesRead Moreculture'Moonlight' Has One of the Best Food Scenes of the YearBy Julia BainbridgeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-17", "author": ["Condé Nast", "Alex Beggs"]}