{"id": "de8680c34de9f1351569b202f83680a2", "url": "https://www.bonappetit.com/city-guides/chicago/venue/the-spice-house", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "The Spice House Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginchicagoThe Spice HouseJust follow your nose to Old Town’s salt-filled, cinnamon-scented wonderlandFacebookPinterestTwitterEmailCourtesy of The Spice HouseGO HERE: if you love flavor. Okay, but also go here if you love to cook, bake, or buy gifts for someone who does. It’s Narnia for spices and spice blends, run by people obsessed with them. You can’t lose, but you especially can’t lose if you bring us some back-up garlic salt, chorizo spice, the crazy, near-wet Portuguese sea salt, spicy Vietnamese cinnamon, or the summer grilling essential Back of the Yards rub. Cross everyone of your holiday lists for all time by hauling back a truckload of the all-purpose cake spice.THE VIBE IS: kid in a candy shop, but all the candy is cumin-tinged. Apothecary meets perfumerie meets the most epic pantry you’ve ever wandered into—The Spice House is designed for discovery.WORD TO THE WISE: You can get spices in any quantity you dream of—just ask. Don’t limit yourself to tiny glass jars. Because trust us, that garlic salt is going to go fast.PRACTICAL STUFF: Open every day: Monday to Friday, from 10 a.m. to 7 p.m., and Saturday and Sunday, from 10 a.m. to 5 p.m.—Alex BeggsCourtesy of The Spice HouseWE ALSO LOVESawadaA Japanese coffee import in West Loop barbecue landAvecThe brilliant Chicago restaurant that launched a thousand wood-burning ovensCellar Door ProvisionsChicago’s best bread happens to be in one of our favorite daytime restaurants Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-07-13", "author": ["Alex Beggs"]}