{"id": "de890ad30b6ffc482915eda02483e84e", "url": "https://www.bonappetit.com/recipe/herb-jam", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "Herb Jam Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHerb JamBy Andy BaraghaniAugust 1, 20194.9(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Maggie RuggieroEmailPinterestPrintEmailPinterestPrintThis versatile condiment takes a page from Paula Wolfert’s original version in her book, The Slow Mediterranean Kitchen, in which a surplus of greens gets cooked down to a deeply savory jammy consistency. We simplified Wolfert’s steam-then-cook method and added toast and cheese for good measure. It’s the best way to use up a variety of herbs and greens that you might have in your crisper drawer. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.Ingredients4 servings4garlic cloves, crushed1lb. mixed hardy greens (such as Swiss chard, mature spinach or arugula, and/or broccoli rabe)3cups tender herbs (such as parsley, mint, cilantro, fennel fronds, and/or tarragon)¾cup extra-virgin olive oil, divided1red or green chile, thinly sliced11\" piece fresh ginger, peeled, finely grated1tsp. ground corianderKosher salt1tsp. fresh lemon juiceWhole-milk ricotta, farmer’s cheese, or feta (for serving)4½\"-thick slices country-style bread, toasted½lemonPreparationStep 1Place garlic in a large pot. Layer greens and herbs over. Pour 1 cup water over. Bring to a simmer over medium heat. Cover pot, reduce heat to medium-low, and steam until greens and herbs are wilted and garlic is very soft, 20–30 minutes.Step 2Using tongs, transfer greens and herbs to a medium bowl. Let sit until cool enough to handle. Pick out garlic and transfer to a small bowl; using a fork, smash to a paste.Step 3Squeeze any excess water out of greens and herbs. Transfer to a cutting board, finely chop, and set aside.Step 4Wipe out skillet. Heat ½ cup oil over medium-low. Add chile and ginger and cook, stirring frequently, until fragrant and chile has softened, about 1 minute. Add chopped greens and herbs and cook, stirring often, until most of the moisture is cooked out of the greens, 10–15 minutes. Add garlic and coriander. Using a wooden spoon, mash garlic into greens mixture and stir to combine. Continue to cook, stirring occasionally, until well combined and flavors have melded, about 5 minutes more. Remove from heat. Season with salt and stir in lemon juice and remaining ¼ cup oil.Step 5Spoon ricotta on toast and top with herb jam. Finely zest lemon over.Step 6Do Ahead: Herb jam can be made 5 days ahead. Wrap in plastic, pressing directly onto surface, and chill. Let jam come to room temperature before using.How would you rate Herb Jam?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleAbsolutely delicious!! I made it with kale, parsley, and dill– what I had on hand. I'm looking forward to trying this recipe with other combinations of greens. It was awesome on toast with feta cheese, and on quinoa with feta and harissa. \n\nMake sure to keep a close eye on the pot while steaming though. I got distracted for a few minutes and the bottom scorched, leaving a layer of crunchy burnt leaves (I pulled off the top layer for the rest of the recipe). Anonymous1/18/2021I used some discounted cavolo nero and coriander I found at the shop - result seems more crispy/fried than a jam exactly but it tastes good!AnonymousUK5/12/2020So good! I used Swiss chard, but wondering if kale would also work. Turned out beautifully!New York4/21/2020This is a great recipe to use up greens and herbs!AnonymousIthaca, New York10/7/2019How long will this keep in the fridge if I don’t use it all after making it? More than 5 days?AnonymousLos Angeles 9/8/2019Can we please talk about the liquid that is left over when you pull the greens, herbs  and spinach out to cool? A pinch of salt and it’s the tastiest veggie tonic i’ve had in a long time!AlohachanjHonolulu8/26/2019This is brilliant. Our garden is running amok with greens and herbs. Am going to boil the jars as in regular jam making so I can make in quantity. Absolutely fantastic recipe. I don't eat garlic but shallots or sweet onions work beautifully. lindagalleryCalifornia 8/12/2019Explore Bon AppétitToastJamSpreadsMediterraneanSwiss ChardLeafy GreensVegetableSpinachArugulaBroccoli RabeParsleyHerbs & SpicesMintCilantroRicottaCheeseSummerEasyWeeknight MealsStarterNut-FreeVegetarianKetoHealthyishLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-01", "author": ["Condé Nast", "Andy Baraghani"]}