{"id": "de8f8cdbe9089a969feea7ddd605604f", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/108", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "108 Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagen108Noma’s more casual spin-off in Christianshavn, with kombucha-shellacked pastriesFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: for Team Noma’s first spin-off, meant to be looser and more accessible, but alumnus Kristian Baumann’s concise menu of intensely thoughtful, precisely plated food wouldn't be out of place at the mothership.ORDER: whatever appeals to you that day, or splurge on the eight-course menu with wine pairings. The day’s eight dishes depend on what’s growing in Denmark right that second, which could mean carrots and roses with a chilled shrimp sauce or potatoes with smoked egg yolk and caviar. If you’re on a budget or can’t get a table, the attached coffee bar-wine-bar-mini-restaurant, The Corner at 108, is a marvel of culinary and coffee-geek excellence. Here, you’ll find coffee kombucha–brushed pastries; small plates of lamb tartare with smoked egg sauce; grilled lamb belly with asparagus; and stellar wine and beer, not to mention coffee beans from superstar Tim Wendelboe.THE VIBE IS: Noma 1.5. The light, airy space feels fresh and relaxed, despite the attention that has gone into every detail. In summer, sit on the patio and toast the late sunset with a glass of natural wine.PRACTICAL STUFF: Open for dinner every day, from 5 p.m. to midnight. You still need to book about a week in advance: The locals love this place too! Check the posters on the wall for upcoming winemaker and farmer dinners, as well as the weekly wine tasting and the beer happy hour every day.—Christine MuhlkePhoto by Ditte IsagerWE ALSO LOVENomaThe next evolution of René Redzepi’s destination restaurant in RefshaleøenJuno the BakeryFuel up for those canalside bike rides with these outstanding Østerbro carbsBarabbaMake the most of your jet lag by staying up all night at this Indre By chefs’ hauntExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}