{"id": "de9c67d2159739e21010732404645f15", "url": "https://www.bonappetit.com/story/pampered-chef-party", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "Whatever Happened to Pampered Chef? I Hosted a Party to Find Out | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhatever Happened to Pampered Chef? I Hosted a Party to Find OutHow an ‘80s and ‘90s juggernaut company is surviving the digital age.By Amanda ShapiroMarch 26, 2018FacebookTwitterEmailIllustration by Chrissie AbbottFacebookTwitterEmailCaryn Pollock is going to have a heart attack. At least that’s what she’s telling me as she stands in my kitchen next to two enormous tote bags and a suitcase on wheels. Caryn is my Pampered Chef consultant; she’s supposed to cook in front of a roomful of people in less than an hour, except there’s no food. The Peapod order never arrived! So Caryn’s having a heart attack, which turns out to be more of a metaphorical attack, thank God, because I adore Caryn, whom I met 10 minutes ago.Caryn has three small kids and her husband is a cop, so she knows how to handle a crisis. She’s on the phone with Peapod, she’s on the phone with Pampered Chef, she’s speaking very calmly. Did I mention her shirt says “we get paid to PARTY” in blue sparkly letters? She’s opening my fridge and my cabinets while I stand there, being totally useless. She’s asking me to route her phone to the closest grocery store, then she’s gone.And so begins my first Pampered Chef party.Say the words “Pampered Chef” to a Millennial, and they’ll either stare at you blankly or start raving about their parents’ garlic press. I’m in the latter camp. My mom went to a Pampered Chef party when I was a kid, and we could both tell you every single thing she bought: a green roller thing that removes garlic skin (discontinued), a pizza stone (used exclusively as a vessel for takeout pizza), a mini chopper (cool but a pain to wash), and an oil pump (aerosol-free!). Twenty years later, it’s all still in her kitchen, but I hadn’t heard a word about the company since.So I was curious: What are Pampered Chef parties like in the Internet age, now that there’s nothing remotely novel about shopping from home?Like Tupperware, Avon, and Mary Kay, Pampered Chef is a multi-level marketing company. No, it’s not a pyramid scheme; those are illegal. Doris Christopher, a home-ec teacher then stay-at-home-mom, started Pampered Chef in 1980, selling cookware and doing “kitchen shows” in her friends’ homes. \"People I knew didn't like to cook, because it wasn’t easy for them,” she said in a 1995 interview. “Part of me said, ‘Maybe I can never convert them.’ But another part said, ‘They’re using knives that aren’t sharp and forks with missing tines. If they had the right tools, it would be fun.’”Today Pampered Chef is a massive corporation with more than 40,000 “consultants.” The company sells every kind of cookware imaginable, but it specializes in gadgets—the kind of stuff you might not think you wanted until a bubbly woman from Staten Island is standing in your kitchen, soft-pitching a gravy separator to you.First I reached out to some consultants because I am a reporter. There are hundreds of Pampered Chef consultants on Facebook hosting “virtual parties,” which seem to be just event pages that encourage people to shop online. If this was what Pampered Chef had become—a bunch of people alone in their homes buying kitchenware on the internet—I thought, that seemed kind of sad. I sent messages to a bunch of consultants and got basically the same response: They’d love to talk as long as the company said it was okay. Then I got an email from a Pampered Chef’s PR. They were so excited that I was reaching out!!! They would be thrilled to connect me with the appropriate consultants!!!I realized I’d never truly understand the Pampered Chef experience in 2017 unless I hosted a party myself, even if PC orchestrated it for me, delivering Caryn straight from heaven via the Verrazano bridge.Speaking of my new friend, Caryn returns from the grocery store, laden with bags, and, within 20 minutes, my kitchen island has disappeared under a riot of Pampered Chef products, and she’s encouraging me to open a bottle of wine. Which I do. We’d agreed on the menu ahead of time: It’s called “Healthy in a Hurry” though somehow it involves pasta, pizza, pound cake, and the microwave, which Caryn emailed about multiple times to confirm that it existed and to ask about its size.Having people over to sell them stuff is kind of gauche, at least among twenty- and thirtysomethings in Brooklyn. Then again, we love ironically nostalgic activities—Dirty Dancing karaoke, ‘90s fests, and restaurants devoted to meatballs—so I have no trouble rounding up about a dozen friends, plus, of course, my mom.When they’ve amassed in my kitchen, Caryn begins the demo by telling us about herself: Brooklyn-born, communications major, TV producer, police officer husband, Staten Island, babies, more babies. (Here’s another adorable fact about Caryn: On Facebook, her job title is “Super Mom” at a company called “The Pollock kids.” Description: “24/7 job....cook, taxi driver, laundromat, butt wiper, song singer, book reader - no lunch breaks....paid in kisses & hugs.”) With three kids, she had no time for another job and no time to cook—until she discovered Pampered Chef. Now she does parties a few times a month and is an “advanced director,” which is very impressive but also less than halfway up the nine-step ladder of this multi-level marketing company, past “consultant,” “future director” and “director,” but still quite far from “national executive director.” Being a director means having a team of consultants, people you’ve personally recruited. Every month, Caryn and her team have to meet certain sales goals, and Caryn can only move up the ladder by selling more products, recruiting more consultants, and helping them sell more products. A PC publicist tells me later that Caryn has 150 consultants and 9 directors on her “team”—which means she has brought a lot of people into the Pampered Chef universe.But enough about Caryn; it’s time to cook. We’re making pasta, but not just any pasta. We’re making part-pasta, part-zoodle, in something called a RockCrok, and we’re cooking it in… wait for it… THE MICROWAVE. My food editor friends in the room grow pale. But, to everyone’s surprise except Caryn’s, it comes out 16 minutes later, nicely al dente, if a little… soupy from the chicken stock it was cooked in.Here’s the way it works: I’m the host, and Caryn is the consultant. She gets paid a percentage of what people spend at the party, and I get credit toward scoopers, strainers, spinners, slicers, and everything else in the Pampered Chef arsenal. One core belief of Pampered Chef I quickly learn is that sharp things are dangerous. There’s a gadget for slicing garlic, another for making zoodles, another for chopping basil that goes on top of the pasta. There’s a blade-free can opener and a tricked-out microplane that keeps your hands about a mile from the blades. With every new slicing and dicing device, Caryn has a story about a terrible injury, a cautionary tale about the normal version of that thing (i.e. a knife).Illustration by Chrissie AbbottI find this funny because Pampered Chef’s knives are actually really nice. The enthusiastic PR person had sent me a few to try, and they easily surpassed the hodgepodge collection I had before. But I guess you can’t stay in the kitchenware party biz for a quarter-century by selling knives alone. Also, children. A big part of Caryn’s—and Pampered Chef’s—sales pitch is about cooking with kids. Knives and blades don’t really get along with tiny humans and their flailing limbs.Caryn’s next dish is salad pizza, which turns out to be exactly what it sounds like. Salad pizza requires many more gadgets. There’s a slicer for peppers, another for cherry tomatoes, where you clamp the tomatoes in a plastic thing then slice through it sideways, another for onions. There’s a pair of scissors called “salad choppers” for lettuce.Caryn tells us with loving exasperation that her husband decided to eat healthier, so she has to make him salads for lunch every day. Men! The unmarried people in the room laugh uncomfortably. Meanwhile, my mom adds items to her wishlist and snaps photos on her phone.There’s a grill pan that cooks the pizza dough (store-bought) right on the stove. There’s a dressing container that has the dressing recipes right on the side of the container itself. “Who here is still friends with Pam?” Caryn asks. We realize she’s talking about the cooking spray. “It’s time to ditch her,” she says, revealing the familiar oil pump, rebranded in 2017 as a kitchen spritzer.Watching Caryn cook is like watching a magician. She’s pushing buttons and moving levers, talking through every step until, BAM, there's a meal, but I don't quite trust it. The thought of needing an arsenal of tools to make a green salad feels a little... extra. Couldn’t I make the same meal in the same amount of time with a knife and a cutting board? I wonder if this is just part of Caryn's show. She can’t possibly be using all this stuff at home. But then Caryn tells us she hated cooking before she started using Pampered Chef products. Having a tool for every task took the guesswork out of it for her. She says, when she’s in someone else’s kitchen, like her timeshare down South, she doesn’t know what to do without her toolkit of choppers, and this is confusing to me. It’s like Caryn came to teach us how to drive but is showing us how to juggle instead.Over a dessert of pound cake (store-bought) with grilled pineapple (pineapple corer) and fresh whipped cream (30-second whipper), I fantasize about starting a company that comes to your house and teaches basic knife skills. Am I just an elitist jerk? I have no kids. The guy I live with loves to cook. When I’m in the kitchen, it’s because I want to be. But I also grew up watching my mom in the kitchen, 7 p.m. on weeknights, chopping her way through meals that were supposed to take 30 minutes but always seemed to take twice as long. That little manual food processor meant she could steal a look at my math homework without slicing off a finger—and it was dishwasher safe! Who am I to tell my mom that she should’ve just learned to chop faster? Who is anyone to tell anyone how they should cook?This is something we’ve thought a lot about at Bon Appétit as we launched Basically. How do you help people become better cooks without talking down (or up) to them? How do you make cooking feel less intimidating and more enjoyable? Because we’re a food publication, our answer is to arm people with advice, recipes, techniques, and explainers. Because Pampered Chef is a kitchenware company, its answer is to arm people with products, and that, to me, is the fundamental divide.By the end of the afternoon, Healthy in a Hurry has become three hours, three carb-based dishes, and a couple bottles of wine. No one’s complaining. Caryn and I are best friends, reminiscing about that time the groceries never came. Eventually, people start filtering out while my mom orders a can opener, a slicer-dicer, a new oil pump and… an actual knife! Other people must have secretly placed orders, because I get 100 bucks of my own to spend! I buy a sheet pan, some colanders, and a pizza stone like the one my mom has had for all those years. It arrives on our doorstep a week later, and we christen it with a totally satisfying sausage pizza. We keep the salad on the side.Chrissie Abbott is an artist and designer in London. See more of her work here.Explore Bon AppétitShoppingRead MorecultureThe Only Sheet Pan You’ll Ever Need Costs $20 and Will Last a LifetimeBy Ali FranciscultureThe Best Kitchen Products to Buy Online This WeekendBy Bon AppétitshoppingThe Best Kitchen Scales and Why You Need One, Even If You Never Bake a ThingBy Alex BeggscookingThe 12 Kitchen Tools You Absolutely NeedBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-26", "author": ["Condé Nast", "Amanda Shapiro"]}