{"id": "de9e3dda2fbc0c246892af05da8ea696", "url": "https://www.bonappetit.com/story/what-to-buy-organic", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "What to Buy Organic According to a Nutritionist | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Nutritionist on Why She Doesn't Always Buy OrganicUntil the Organic Trade Association wants to subsidize my all-organic diet, I'll be buying conventional much of the time.By Brierley HortonApril 22, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailWhen I tell people that I’m a dietitian, the first questions I get are always, “Do you eat super healthy?” and “Do you always buy organic?” The answer to the first question is hard—what “healthy eating” looks like is personal and subjective. But the second question is easy, and the answer is no.The main reason is that organic is not necessarily healthier. Some studies have found organic and conventional produce and other whole foods to be nutritionally equal. Other studies (both one-offs and review studies) show the vitamin and mineral levels in organic produce to be higher. Organic dairy products and some meats likely will give you more of those good-for-you omega-3s than their conventional versions. But those nutritional differences are minor, and eating a couple servings a week of salmon, tuna, or mussels—all of which are packed with brain- and heart-healthy omega-3s—will essentially nullify any dairy and meat choices.Another reason I don’t go all-organic: there’s decades of nutrition research that shows eating a diet brimming with produce can cut your cancer and heart disease risk, and potentially lead you to live a longer life. Much of that research has looked at—uh-huh, you guessed it—eating conventional produce.I did think twice about my choice recently, when a new study showed that people who ate 100 percent organic had fewer pesticides in their bodies after just one week. In the study, published in the journal Environmental Research, participants first followed a typical conventional diet for five days. From there they switched to an all-organic diet for days 6 through 11. After the switch, researchers saw a significant drop in the amount of insecticides, herbicides, and other pesticides in the participants urine. This isn’t the first study of this kind. There’s also research that shows pesticide exposure in kids is associated with lower cognitive scores and increased behavioral and attention problems. In adults, it’s been associated with asthma, cancer, and adverse impacts on the reproductive and endocrine systems.But unless the Organic Trade Association wants to subsidize my all-organic diet, that way of eating just isn’t in my grocery budget. Let me get on my public health pulpit for a moment. When you consider the population as a whole—a big group of children and adults who typically fall short every day on their produce quota, we don’t need a single reason to discourage people from eating fruits and vegetables. And, as a public health advocate, I see it as a duty to tell people that I don’t always buy organic produce—and they don’t have to either.That said, I wouldn’t be doing my due diligence if I didn’t acknowledge that there’s also research that suggests that residues in conventional fruits and vegetables are a top source of our pesticide exposures. How much that impacts your health, though, is still TBD. An analysis by the University of California showed that a child could eat thousands of servings of a fruit or vegetable in a day (think 7,446 helpings of kale) and still not have any health effects from residues.Most people think organic equals healthier. But, really, organic is just a way that food is produced. It’s not necessarily safer or better for you, though it is designed to be better for the planet (plenty of folks will debate that point, too). So don’t let organic dominate your decision-making at the grocery store. If you can afford organic items, and you want to buy them, go for it. For better health, though, eating plants—whether they’re conventional or organic—should be the priority.Explore Bon AppétitHealthyishessayRead MoreLifestyleWhy You Shouldn't Start a Cleanse on January 1stBy Dana NahaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-22", "author": ["Condé Nast", "Brierley Horton"]}