{"id": "dea13ab2ee063634fc46b5fdc1f8b5a4", "url": "https://www.bonappetit.com/story/carrot-sambharo", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "Carrot Sambharo Is A Punchy, Crunchy Carrot Condiment That's Good With Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’m Not A Carrot Fan, but I Love Carrot SambharoThe best thing to make with that huge bag of carrots in your crisper.By Zaynab IssaJanuary 18, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah MortonFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we’ll talk you through the dishes and drinks we make with our eyes closed. Today, carrot sambharo.Carrots are boring. Don’t get me wrong, they’re much more visually interesting than a lot of other root vegetables, but they rarely have the star power to take center stage. And if you ask me, that’s the reason they end up chilling (pun intended) in the back of the crisper drawer for longer than most of the other produce you brought home from the store. Sure, you could make mirepoix or slice them up to snack on. But, I repeat, snooze. Your best option is to do what I do: Make crunchy, punchy carrot sambharo.Carrot sambharo is a popular condiment in Gujarat, India, and recipes vary from family to family—some have cabbage, some have mustard seeds, some are crunchy, some are tender, but all are delicious. The majority of the flavor comes from a quick masala that gets mixed with the thinly sliced carrots. This version is made with a mixture of tomato paste, garlic, turmeric, and lemon juice. Mix it with salted carrots and sliced chiles and you have a perfectly balanced sambharo with heat from the peppers, a little sweetness from the tomato paste and carrots, and just the right amount of brightness from the fresh lemon juice.To make it, all you do is chop 3 medium carrots into 2\"–3\" matchsticks and slice a few green chiles or jalapeños into any shape you like. Then add them to a bowl and sprinkle over 1 tsp. kosher salt to season and draw out some of the moisture. While that hangs out, heat 1 Tbsp. vegetable oil in a small pot on medium heat. If you wanted to add a few curry leaves and/or ½ tsp. mustard seeds, now would be the time, but if you don’t have them handy, don’t think twice. Once the oil is nice and warm, add about 3 Tbsp. tomato paste, ½ tsp. ground turmeric, and 2 garlic cloves, finely grated. Stir everything together and cook until the tomato paste gets a little darker and the oil is tinted red, about 5 minutes or so. Add the tomato paste mixture to the salted carrots and chiles, squeeze over the juice of ½ lemon, and toss everything together. The salty liquid released from the carrots will mix with the lemon juice and tomato paste to create the perfect viscosity to coat the carrots. If things are looking a little thick, just add a splash of water and mix until the carrots are coated. Taste for salt and lemon, and add more to your preference. I usually transfer it to a container to chill in the fridge for a few hours, but you can definitely eat it immediately.When it comes to serving, the options are endless. You could pair it with a big bowl of rice and daal, add it to your grain bowl, or my personal favorite, sandwich it between two slices of crusty bread for a surprisingly delicious and simple lunch with lots of crunch. Carrots, I take back everything bad I said about you.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-18", "author": ["Condé Nast", "Zaynab Issa"]}