{"id": "dea81f0e19b453bba0ebef53026208c8", "url": "https://www.bonappetit.com/story/drifters-wifes-crispy-skinned-roast-chicken", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Drifters Wife Taught Me the Secrets to the Crispiest-Skinned Chicken Ever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Secret to the Drifters Wife's Crispy-Skinned Roast Chicken Involves Salt and... Scuba DivingBut if you make the chicken at home, you can skip the scuba diving part.By Molly BazAugust 28, 2018FacebookTwitterEmailPhoto by Elizabeth CecilFacebookTwitterEmailDuring an early phone call with Ben Jackson, the chef of Drifters Wife in Portland, Maine, one of our Hot 10 Best New Restaurants 2018, I inquired about the iconic crispy half chicken dish that has a permanent place on the menu. Over the course of our call, it became abundantly clear to me that this was a man who took his chicken very, very seriously.In many ways, this is the same sort of cast-iron brick chicken you’ve seen in restaurants before. But then Ben mentioned the rocks.  What do rocks have to do with brick chicken? Apparently, everything. I’ll explain.A foraged rock out of the wild and into the kitchen.\nPhoto by Elizabeth CecilBen recounted that during a day-off scuba diving adventure off the coast of Maine, he managed to unearth a heavy rock from the ocean floor that seemed nothing short of a perfect stand-in for a brick. So he dove down for a few more, dragged them all back to Drifters Wife, and gave birth to a new kitchen staple that we will hereby refer to as: Chicken Under a Foraged Rock. Yes, thats Chicken Under a Brick, the locavore way.  It’s not everyday that that a chef and his restaurant are so tied to their location that even the rocks from a nearby shoreline are implored in the kitchen.Evidently, scuba diving for heavy rocks does not single handedly lead to crisp-skinned, juicy-as-hell chicken nirvana. Luckily, I had the pleasure of spending an afternoon with Ben in his two-man kitchen to unveil the rest of his secrets. If you've ever wondered why the roast chicken in a restaurant always seems to be that much juicier, the skin that much crispier, the color more perfectly golden, you've come to the right place.Just look at that golden brown skin.\nPhoto by Elizabeth CecilBen always seasons his chicken with salt and pepper well in advance of cooking it. In a perfect world, we're talking 24 hours in advance. This allows the salt to penetrate the flesh all the way through. After seasoning, he blends a handful of mixed herbs (they differ depending on the season) with garlic and olive oil into a coarse paste and rubs down the flesh side of each half-chicken.Then, the chicken is chilled without being covered in plastic so that the cool dry air of the refrigerator can evaporate any beads of moisture left on the skin, leaving it dry and taught. Moisture is the enemy of crispness.Checking the crowd-fave chicken.\nPhoto by Elizabeth CecilWhen ready to cook, the chicken gets placed skin side down, in a ripping hot cast-iron skillet that was pre-heated in the oven, on top of which Ben places another cast-iron skillet to apply pressure to the bird, inside of which he nestles the aforementioned foraged rocks for extra weight. He places the chicken over medium heat and periodically rotates the bottom skillet around the flame for about 10 minutes, so as to avoid any hot spots on the burner and therefore uneven coloring. And if that sounds like a whole lotta love to give to one half of a chicken, consider this: he simultaneously rotates the top (weighted) skillet around the chicken to create different points of contact with that skin and ensure even pressure from the rocks. Finally, the chicken finishes cooking in a 450°F oven for about 15 minutes, rests, and gets served with a bright glossy pan sauce made of the leftover crispy bits.Because it’s my job to bring Ben’s vision to life in our readers’ kitchens, I’ve made a few minor tweaks to the recipe (namely eliminating the foraged rocks). But the spirit of the dish and Ben’s technique are alive and well. So, now that the secret is out, you can bust out the best damn crispy-skinned Chicken under a Foraged Rock a home kitchen has ever seen. Scuba adventure optional.Get the recipe:Herb-Rubbed Cast-Iron Chicken with Pan SauceLetting the bird’s skin dry out before cooking is crucial to getting restaurant-worthy crispiness.View RecipeAnd more recipes from our 2018 Hot 10 winners:1 / 15ChevronChevronSwiss Chard–Tahini DipView RecipeExplore Bon AppétitHot 10 2018Hot 10roast chickenRead MorecookingA Fairy Tale Eggplant Recipe That Comes With an Irresistible Cashew SauceBy Aliza AbarbanelNapa Cabbage Salad with Parmesan and PistachiosRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-28", "author": ["Condé Nast", "Molly Baz"]}