{"id": "ded23afdabf75637d963bc5ff56874c8", "url": "https://www.bonappetit.com/story/food-for-thought", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Food for Thought | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredFood for ThoughtBy Bring Change to MindMay 14, 2018FacebookTwitterEmailFacebookTwitterEmailA lot of us assume that talking about mental health might feel weird or uncomfortable. But, in most cases, our friends are happy to listen and offer support. Not That Weird is all about making mental health conversations natural and normal so that we all feel comfortable speaking about our experiences or reaching out to friends. Bring Change to Mind can help you start the conversation. Learn more at bringchangetomind.org.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-14", "author": ["Condé Nast", "Bring Change To Mind"]}