{"id": "ded6f9490fc648ed6cefe4d66936835b", "url": "https://www.bonappetit.com/recipe/celery-green-bean-and-tofu-salad-with-chile-crisp", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Celery, Green Bean, and Tofu Salad with Chile Crisp Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCelery, Green Bean, and Tofu Salad with Chile CrispBy Chris MoroccoJuly 24, 20184.5(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintIf you have a batch of our Chile Crisp at the ready, you can make this summery, no-fuss pantry salad in just 5 minutes.Ingredients4 servings4celery stalks, trimmed, thinly sliced on a steep diagonal into 2\" pieces, plus leaves for serving2cups green beans, trimmed, sliced on a steep diagonal into bite-size pieces½8-oz. block firm tofu, preferably braised, sliced into thin batons¼cup unsalted, roasted peanuts2Tbsp. fresh lime juice2Tbsp. Chile Crisp, plus more for servingFlaky sea saltPreparationToss celery, green beans, tofu, peanuts, lime juice, and 2 Tbsp. Chile Crisp in a medium bowl to combine. Top with more Chile Crisp as desired, celery leaves, and sea salt.How would you rate Celery, Green Bean, and Tofu Salad with Chile Crisp?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleLOVE! we made this for dinner tonight alongside a batch of sesame noodles. i actually sautéed my tofu until golden first, seasoned with salt+pepper, then seared half of the celery in a hot pan (wok would be good next time) along with some bias-cut scallions. tossed those together with the raw celery and the chili crisp and lime juice — just PERFECT. it would certainly have worked just as well with all raw ingredients on a hot summer evening, but the subtle balance of textures here was really great. this will be a go-to for sure!typeforbreakfastnew haven, ct5/28/2020Love, love, love this recipe! It’s great for a quick lunch or dinner and hits that spicy spot for those who love hot! Sometimes I’ll sub 1 cup of the green beans for a cup of edamame to up the protein. I also typically sprinkle it with ground flax seeds to up the health punch. I find the chili crisp adds enough salt that I never need to add additional. ajgatorChicago, IL5/23/2020Love this! A festive and delicious dish! I used half peanuts and half cashew which was perfect! Searing the green beans as well as the tofu added richness. Thank you!Betsy AmitKibbutz Ein Hamifratz4/24/2020I was surprised by how much I liked this because I'm not typically a huge fan of raw celery, but I had a bunch hanging out in the fridge from cooking beans so I thought I'd give this a try.  I didn't wanna futz with making chili crisp, so I used chili oil I already had and fried up some crispy garlic to throw on top. Went with tempeh instead of the braised tofu and fried it til it was golden and crispy in the oil leftover from making crispy garlic. It was quick and really tasty.  If you're serving it as a main, it'll yield closer to two servings than four. cassidy.haightRichmond, VA8/8/2019So good! Summery, but also hearty. And that chile crisp is bomb. I had snap peas (not green beans), so used those instead. Also upped the lime and added fresh mint. It seems like you can add any number of things. I'm going to try green mango next time. AnonymousToronto4/12/2019So good! Was met with moldy green beans when I opened my fridge (yuck!) so spontaneously subbed Persian cucumbers. Added scallions, sesame seeds, and cilantro, and glazed my tofu with a gochugang/miso/dijon sauce whilst frying. kirafeldmanSt. Louis, MO9/25/2018I loved this! I sauteed the beans to provide some different texture, used cashews instead of peanuts. I served it with crispy skin salmon instead of tofu. My bf said it was one of the best accompaniments to fish I've ever made. Anonymouswashington dc8/1/2018Explore Bon AppétitSaladCeleryVegetableGreen BeanTofuOther IngredientsChileSummerEasyQuickWeeknight MealsSideMainDairy-FreeVeganVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-24", "author": ["Condé Nast", "Chris Morocco"]}