{"id": "dedbb4bf381dc2e5dd453cc5a1fc3a47", "url": "https://www.bonappetit.com/story/ba-test-kitchen-sustainability", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "10 Ways the Bon Appétit Test Kitchen Will Be More Sustainable in 2020 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture10 Ways the Bon Appétit Test Kitchen Will Be More Sustainable in 2020From composting to cooking more vegetarian recipes, we're committing to doing better by the environment.By Bon AppétitJanuary 6, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Sue LiFacebookTwitterEmailRecently we have been thinking about our impact on the environment and ways to build more sustainable practices as a magazine. The starting point for this effort is the BA Test Kitchen, where every recipe we create, whether for print, online, or in our videos, goes through multiple rounds of development and testing. That means groceries and supplies come in, and finished recipes, as well as food waste, trash, and recyclables, go out. Putting recipes through multiple rounds of testing consumes resources, but we believe the investment in our recipes is worth it. If a few recipe failures in our Test Kitchen mean that better food comes out of our readers’ kitchens, that means more smiles and less waste overall.So what does this mean in 2020? We have been looking at everything we are doing in the Test Kitchen, from where we source our food, to how we store it, how we handle waste, and what we want to say and do about all of the above. We came up with these guidelines, for how we plan to keep ourselves accountable, in 2020, and beyond.Thirty percent of new recipes we develop will be meatless. While experts have recently gone back and forth over the health benefits of eating meat, there is no doubt that plant-rich diets have less negative impact on the earth’s resources.We now compost all food scraps generated by the Test Kitchen. Yes, we were a bit late to the game there. But the fact is we don’t have a backyard here at 1 World Trade Center to start a compost heap of our own, and we needed to work with building management to develop a composting program that works within the logistical demands of a 100-story office tower. The upshot of that effort? We are now able to divert a lot of our waste from landfills.We have already significantly reduced the use of plastic. And will continue to seek sustainable alternatives. We now insist on reusable beverage containers in the office. We will also be asking outside recipe contributors to adhere to the same standards.We will encourage you to cut down on disposable materials too. That means our recipes may sound a bit different, calling for a bowl with a lid, a reusable container, waxed paper or beeswax wrappers in place of plastic wrap.We will buy organic ingredients when possible. We will continue to use organic milk, yogurt, eggs, and chicken.With regard to other meats, we will give preference to organic, local, pastured, grass-fed, and/or certified humane products with an emphasis on quality over quantity.Sourcing seafood for the Test Kitchen and deciding what to call for in recipes has always been complicated, as guidelines on sustainability are constantly shifting. We will do our best to call for sustainable fish, but for us, and our readers, nothing beats a well-informed local fishmonger.We have reduced our daily and weekly food deliveries and are exploring new ways to purchase food in bulk when it makes sense or in very small quantities when doing so will reduce waste down the line.We will use eco-friendly paper towels (they are kinder to the environment and can be composted).We recognize that over-purchasing food is one of the most harmful practices for the environment and that a certain amount of food waste is built into the process of testing recipes (the ones that don’t pass the test need to be made again). In recognition of the abundance of food we work with on a daily basis, we will continue to donate time and money to charities such as No Kid Hungry and World Central Kitchen that work to reduce food insecurity.Last, we want to know what you think and how you incorporate sustainable practices in your own kitchens and homes. We think it’s time for a conversation about how we can all take better care of the planet, and our kitchens seem like a great place to start.Explore Bon AppétitTest KitchenSustainableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-06", "author": ["Condé Nast", "Bon Appétit"]}