{"id": "deed49be19392cce74beec93f34affed", "url": "https://www.bonappetit.com/recipe/alicha-denich", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Alicha Denich Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAlicha DenichBy Fanta PradaMarch 16, 20214.6(27)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek Brown, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrint“I’m a classic melting-pot story,” chef Fanta Prada of Balinjera in Tel Aviv says. “I’m an Ethiopian married to a Yemeni man, and I cook all kinds of food at home. On Passover we always make this potato and cabbage dish. Like many Ethiopian recipes it does not contain many expensive ingredients but is rich in flavor and texture. Somewhere between a soup and a stew, it’s the perfect accompaniment to a larger meal with a meat component. The vegetables are roughly cut so that they maintain their shape and soak up the garlicky, spicy, gingery broth.” This recipe will yield more of the spicy condiment awaze than you need, but you can use what’s leftover in almost any other soup or stew, or mix it into mayonnaise to punch up your next sandwich. It even makes a great marinade for chicken or fish.Ingredients8 ServingsAwaze6medium red or green jalapeños, coarsely chopped1small dried chile de árbol2garlic cloves11\" piece ginger, peeled, thinly sliced1cup (packed) cilantro leaves with tender stems1Tbsp. plus 1½ tsp. extra-virgin olive oil2tsp. Diamond Crystal or 1¼ tsp. Morton kosher saltstew¼cup vegetable oil5large onions (about 2½ lb.), thinly sliced3large carrots (about 1½ lb.), peeled, sliced on a diagonal ¼\" thick6medium Yukon Gold potatoes (about 2½ lb.), peeled, halved, each half cut crosswise into 3 pieces½large head of green cabbage (about 1½ lb.), cut into 12 wedges1medium green jalapeño, coarsely chopped1medium red or green jalapeño, finely chopped3garlic cloves, coarsely chopped2Tbsp. Diamond Crystal or 1 Tbsp. plus ½ tsp. Morton kosher salt1½tsp. ground turmeric or 1 Tbsp. finely grated peeled turmericPreparationAwazeStep 1Purée jalapeños, chile de árbol, garlic, ginger, cilantro, oil, and salt in a small blender or food processor until smooth. Transfer awaze to a small glass jar or airtight container, seal tightly or cover, and chill until ready to use.Do ahead: Awaze can be made 1 week ahead. Keep chilled.StewStep 2Heat oil in a large pot over medium-high. Cook onions, stirring often, until softened and golden, 12–14 minutes. Add carrots and cook, stirring, 1 minute, then add 1 cup water and cook, stirring, until carrots are tender, 7–9 minutes. Add potatoes, cabbage, green and red jalapeños, garlic, salt, turmeric, ¼ cup awaze, and 2 Tbsp. water and mix well to combine. Bring to a simmer, cover, and reduce heat to low. Cook, stirring occasionally, until potatoes are partly tender, 12–15 minutes. Remove from heat and let sit, covered, until potatoes are completely tender, 8–10 minutes. Uncover stew and give it a good stir. Stew can be served hot, warm, or room temperature.Do ahead: Stew can be made 1 day ahead. Let cool; cover and chill. (The flavor will get even better.)How would you rate Alicha Denich?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleMy wife and I really liked this stew. It didn't seem too salty to us. I think that I cut up the potatoes smaller than suggested and they absorbed more of the salt. Really good flavor. I added a couple of tablespoons of coconut milk to a bowl of the leftovers the next day and that really upped the flavor.TracyOlympia, WA1/29/2022I loved this recipe! Definitely a bit too salty. But the flavor was amazing.Lindsey K6/16/2021It came out just right for me. \n\n1 TBSP salt was just the right amount, but I definitely weighed out all my food. 2.5 lbs of yukon potatoes came out to about 8 potatoes for me, and 2.5 lbs of onions were 3 large and 1 small onion for me. If you're not measuring weight, definitely salt to taste toward the end as opposed to doing the full 1 TBSP.\n\nLoved the flavors, it was just so well balanced across the board. Awaze is magic, and a new favorite of mine. We like things hot in this household so I added 2 serrano chilis as well, and it was just right. This stew with a thick cut of toasted sourdough just warmed my soul from the inside out. godsyllaLos Angeles, CA4/18/2021This was so delicious and comforting and even better the next day. Such a great balance of flavors and texture. I'll be adding this to my regular rotation of weeknight recipes. Not to mention the Awaze has become my new favorite condiment. AnonymousPhiladelphia, PA 4/8/2021Simple and yet very flavorful. The extra Awaze is great to have around.AnonymousNew York, NY4/8/2021I tried to rate this recipe 4 stars, but it defaulted to 5 and wouldn’t let me change it. Now I’m questioning all recipes on this website. This one was good, but WAY too salty. I used less than called for and it was still much too salty. Cut with vinegar and it helped. Will make again, but with 1/2 salt. QAlesterGeorgetown TX4/5/2021Explore Bon AppétitStewSoups and StewsEthiopianEast AfricanAfricanPotatoVegetableCarrotGreen CabbageCabbageLeafy GreensYukon Gold PotatoEasyWeeknight MealsMainDairy-FreeNut-FreeVegetarianVeganHealthyishBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Fanta Prada"]}