{"id": "deee11abe5a8fba620e34b2356c45062", "url": "https://www.bonappetit.com/story/tiptree-little-scarlet-strawberry-preserve", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "This Incredible Strawberry Jam Is Made with Rare, Extremely Tiny Strawberries | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Incredible Strawberry Jam Is Made with Rare, Extremely Tiny StrawberriesThey give the jam a super-concentrated strawberry flavor, but it sells out quick.By Zahra Pettican April 25, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThe queen loves it, James Bond loves it, and even commoners like me are quite partial to it.It’s strawberry jam. But not just any anonymous peanut butter and jelly filling. A jam made with special miniature strawberries grown in a small corner of the UK.It bursts with an intensely sweet aroma from that very first pop of the lid twisting open to the last desperate scrapes at the bottom of the glass jar. And the edges: Don’t forget to get the last sticky dregs from the edges, with your finger if you have to. Go ahead and shove your nose in for one last inhale.The unique flavor comes from the tiny strawberries grown by Wilkin & Sons Ltd. in the countryside surrounding Tiptree in Essex. The company has created a jam so quintessentially British, Tiptree Little Scarlet Strawberry Conserve’s label even declares “By Appointment to Her Majesty the Queen.” This makes it all the more impressive—and slightly confusing—that the main ingredient originally comes from North America.C.J. Wilkin, the company’s director, visited North America in the early 1900s and took the Fragaria virginiana plant back to England. His family had been manufacturing conserves since 1885 but with regular, unremarkable, dreadfully ordinary berries. Making the dime-size wild strawberries into the company’s signature fruit significantly upped its jam game.Fragaria virginiana, also known as Little Scarlets, are a fifth the size of regular strawberries but around five times as sweet. Whole juicy red berries are packed into a 12-ounce jar to guarantee an explosion of flavor that belies its syrup-smooth consistency. These adorable little strawberries grow in every U.S. state except Hawaii, but not for commercial purposes, so you won’t find them in stores. Instead, you can pick them in the wild or buy the seeds/plants from a nursery to harvest typically between April and June.Virginia Strawberry (Fragaria virginiana) botanical plate by Pierre Antoine Poiteau\nPhoto By DEA / A. DE GREGORIO/De Agostini/Getty ImagesIt’s this kind of gooey goodness that has won over a legion of devotees, including the royal family, who issued Wilkin’s the royal warrant in 1911. The warrant is the ultimate celebrity endorsement as it indicates the company is an official supplier of goods or services to the crown. Earlier this year the former royal chef, Darren McGrady, confirmed on Twitter that the queen always eats scones with Tiptree Little Scarlet when she runs out of homemade jam. In From Russia, with Love, Agent 007’s favorite breakfast is a boiled egg followed by whole wheat toast with butter and Tiptree Little Scarlet jam. As for me, I smother it straight on an oven-warmed baguette minus irritating distractions like butter.Part of the appeal is the fruit’s rarity. Wilkin is believed to be the only grower in the world to commercially cultivate the unpredictable croppers. The window to pick Little Scarlets lasts just three weeks in June and July. Once picked they’re usually at the factory and in a jar within a few hours to capture the freshest flavor. Artificial additives are kept to a minimum, and the pectin is fruit-based, so it is suitable for vegetarians. With a total sugar content of 67 percent (including those that occur naturally in the fruit), it’s not so great for dieters.A botanical print of wild strawberries, circa 1850\nPhoto by Hulton Archive/Getty ImagesTiptree’s website states that “due to its size, the fruit takes ages to pick and sort.” I can attest to the picking part. I grew up in a village six miles from Tiptree and spent the early summer weekends picking both regular and tiny strawberries for Tiptree jam. Little Scarlets took about five times longer to fill a bucket. And yet, with fingertips stained crimson red, dried juice and dirt embedded under my nails, and hay stuck on my knees, strawberry picking was still strangely satisfying. It meant summer had arrived, Wimbledon was on TV, and the school holidays were around the corner. I had no idea how special the strawberries were.As much as everyone loves an impromptu jam session, it’s best to buy Little Scarlet Conserve (around $15 per 12-oz. jar) in the summer as stocks dwindle and sell out by the end of the year. The good news is that its intense flavor means you don’t need as much of it as you do other jams. Of course, needing and wanting are two separate things.Buy it: Tiptree Little Scarlet Strawberry Preserve, 12 ounce jar for $18 on AmazonExplore Bon AppétitShoppingJamStrawberryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-25", "author": ["Condé Nast", "Zahra Pettican"]}