{"id": "defe03289ca4a9f6eae939b69687103f", "url": "https://www.bonappetit.com/story/kyla-peal-restaurant-diary-1", "year": 2021.0, "month": 2.0, "day": 1.0, "content": "We Knew What Was Missing in the Wine World—Diversity, Equity, and Inclusion—So We Set Out to Change It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWe Knew What Was Missing in the Wine World—Diversity, Equity, and Inclusion—So We Set Out to Change ItIn her first Restaurant Diary entry, Kyla Peal talks about how her wine education hub, Slik Wines, came to be, and what she’s learning about her community and herself.By Kyla Peal, as told to Angela BurkeFebruary 3, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week, you’ll hear from one of them, from a farmer in Winters, California, to a line cook in Denver. This week’s diarist is Kyla Peal, one of the cofounders of Slik Wines, an experiential wine education platform, on how she’s battling self-doubt as she’s starting something new. When the pandemic hit, I was a server and trainer at Elske in Chicago. My friend Marie Cheslik was Elske’s wine director. After we both left the restaurant (for personal reasons), she had the idea of starting a wine club. We were sitting on her back porch one afternoon when she pulled out a big white board that listed the pros and cons. We just kind of sat there for a while noticing that we had more cons than pros. Our conversation progressed to what we knew was missing in the wine world and in fine dining—diversity, equity, and inclusion—and how we could develop a platform to support the wine and hospitality community. Our friend Danielle Norris, who is a wine rep, came aboard shortly after, and last August, Slik Wines was born.I was introduced to wine early in my career when I was working at an upscale steak house in Texas. That experience taught me exactly how not to teach people about wine. Our manager, who was the restaurant’s wine instructor, regularly belittled staff if they asked questions he thought were silly or if we didn’t speak with an absolutely precise wine vocabulary. I’m not easily intimidated, but the truth is, that type of teaching style can really turn a lot of people away from learning about wine.When you’re tasting wine in a group setting, you need to feel safe as you explore. If you’re way off or guess the wrong grape, that’s okay. That’s the whole point. That’s how you learn. Blind tastings are really a time for curious drinkers to hone in on what they like and what they don’t like, so they’ll be able to purchase wine comfortably and confidently. This is how we approach wine education at Slik Wines. We’re making wine approachable and accessible while uplifting people and building a more inclusive wine community.I’ve spent my entire life working in restaurants. Back when I worked at Elske, the dining room was my domain and I felt like my energy was magnetic. The connectivity of the restaurant dining room meant that body language was worth a thousand words. I prided myself in picking up on even the smallest cues to make folks feel at ease and having them leave with big smiles. Maybe I took those little things for granted because, in transitioning to Slik, it was a bit harder to convey my personality over the phone, over a Zoom call, and through emails. I’d initially struggled with translating my style of communicating to the new methods we have to deal with today.I guess I thought I’d immediately be really, really good in my new role like before. But that wasn’t necessarily the case. My transition came with a learning curve that was steeper than I’d anticipated and that slowly began to eat away at my confidence.Photo by Alex J. RiveraThere were times when I felt like I wasn’t adding value to the Slik team in the ways that I’d wanted. I had these big ideas, things that I wanted to tackle, yet my efforts weren’t yielding the results I’d expected. I’d send a thoughtful pitch to a potential client and would get a curt rejection in return. I think it had a lot to do with a lack of confidence on my end and because I’m still building professional relationships in Chicago. While I concentrated the bulk of my career on hospitality more broadly, Danielle and Marie found their niche in wine, and they’ve worked hard to cultivate and nurture their extensive networks. During our weekly meetings, I’d contemplate how my partners had been able to add so many new clients to our roster. I certainly wasn’t having a pity party for myself, but I was like, “How can I contribute more?”Right before the new year, the three of us had dinner together. It kind of morphed into a business meeting. I shared how I’d been feeling and, I mean, I couldn’t ask for better friends, for better business partners, for better listeners. They understood where I was coming from and reassured me that, of course, they knew from the jump that I didn’t yet have those deep connections. They reminded me that the skills that I did bring to the table, along with my strong work ethic and my high level of commitment, were valued. They told me I’d been doing a good job. Sometimes you need to hear those things and you don’t even know that you need to hear them.I stepped into the new year feeling even more excited than I was when we launched. And I feel way more confident today. I’m really lucky to have these business partners. I trust these women and I appreciate them.Since the start of 2021, we’ve been focusing heavily on private clients. These clients choose the type of event they’d like, whether it’s a company-wide class on a specific wine region or a customized blind tasting. The options are endless. We have plans to work with a few local restaurants like Kasama in upcoming months. We were lucky enough to work with them in December on a fun virtual wine dinner that was super successful and sold out. We plan on collaborating with them again this month for an adobo-focused virtual wine dinner.Hosting private virtual events is how we’re able to support ourselves and that’s how we can continue to provide public events that aren’t cost-prohibitive for the community. We’re planning on hosting one virtual blind tasting a month on a pay-what-you-can scale. So we’ll find these super cool wines that are usually your standard blind varietals, nothing too crazy. The rate will start at around $10, but even if someone doesn’t have $10—perhaps because they’re a restaurant worker looking for a job or are still furloughed and really want to join the blind tasting—we’d be more than happy to provide that service at no cost at all.The response to Slik has been overwhelmingly positive. Everyone’s had such a great time and people have said, “Hey, we really needed that.” That never gets old, hearing people’s responses and them letting me know that they’re just as excited to be there as I am.Explore Bon AppétitWineRestaurantsRestaurant DiariesFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-03", "author": ["Condé Nast", "Kyla Peal", "As Told To Angela Burke"]}