{"id": "df0107e3b90e492f13ab4fd3812675b2", "url": "https://www.bonappetit.com/recipe/sesame-noodles-with-crispy-tofu", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Sesame Noodles with Crispy Tofu Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSesame Noodles with Crispy TofuBy Andy BaraghaniDecember 26, 20184.5(95)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe trick to this recipe is using the pan sauce as a base for the sesame noodles. The noodles will get silky and glazy and become a perfect complement to the crispy tofu and pickled cucumbers. This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right.Ingredients2 servings2medium Persian cucumbers, thinly sliced into roundsKosher salt1½\" piece ginger, peeled, finely grated5Tbsp. unseasoned rice vinegar, divided1red chile, such as Holland or Fresno, thinly sliced, seeded if you’re spice-averse¼cup low-sodium soy sauce3Tbsp. honey112-oz. block firm tofu, drained, patted dry¼cup neutral oil, such as grapeseed, canola, peanut, or vegetable4oz. dried soba noodles2Tbsp. tahini3scallions, thinly sliced on a diagonalPreparationStep 1Toss cucumbers and a few pinches of salt in a colander. Let sit until salt begins to draw out water from cucumbers, about 5 minutes. Massage cucumbers, gently at first to keep them from breaking, then more vigorously as they start to expel water. Drain and squeeze out excess liquid again. Transfer cucumbers to a small bowl. Add ginger and 1 Tbsp. vinegar and toss to combine. Chill until ready to use.Step 2Whisk chile, soy sauce, honey, and 3 Tbsp. vinegar in a medium bowl.Step 3Cut tofu into 9 square-ish pieces by cutting the block into thirds, then cutting each third crosswise into 3 pieces. Pat dry.Step 4Heat oil in a medium nonstick skillet over medium-high until shimmering. Cook tofu, undisturbed, until very crisp and dark brown underneath, 4–5 minutes. Transfer tofu to a plate; wipe out skillet. Heat skillet over medium-high. Return tofu to skillet and add soy sauce mixture (reserve medium bowl; you’ll use it again). Cook, turning tofu occasionally and reducing heat to medium if needed, until glaze is almost thick enough to coat a spoon, about 4 minutes.Step 5Meanwhile, cook soba noodles according to package directions; drain. Do not rinse noodles, even if the instructions tell you to—you want them to stay warm.Step 6Transfer tofu to a plate, leaving sauce in pan. Pour sauce into reserved medium bowl. Whisk in tahini and remaining 1 Tbsp. vinegar. Add noodles and toss until coated with sauce.Step 7Divide noodles among bowls. Top with tofu, pickled cucumbers, and scallions.How would you rate Sesame Noodles with Crispy Tofu?Leave a ReviewTell us what you thinkReviews (56)Back to TopTriangleThis is delicious. After reading a few comments we decided to sear both sides of the tofu, but otherwise followed the recipe exactly. We served it with millet/brown rice ramen noodles and it was delicious. Thank you, Andy!Stephani J.Minneapolis2/8/2022Easy and super delicious dish!AnonymousNew York, NY1/26/2022This is a family favorite. \nAnonymousWashington 11/20/2021Such a great veggie recipe, it's now a staple in our kitchen. I make it at least 2x a month. That sauce is addictive, and the crispy tofu is perfect.Fiona KDublin, Ireland9/15/2021I love this recipe!! Followed the recipe to a T. Definitely would make again.Anonymous2/8/2021This recipe is still a favorite of mine. I fry all sides of the tofu for some extra texture but other than that I follow the recipe exactly and love the results. Even better it makes for excellent cold leftovers for an easy lunch at work. KatyLos Angeles11/25/2020What a fantastic and simple recipe. Had some tofu getting near expiration and was looking for inspiration beyond our normal tofu dishes. We had all of the ingredients except for the cucumbers, so I added the ginger to the sauce instead. These noodles were sweet, luscious, and very comforting. I did toss the tofu in cornstarch before frying, it's something I always do to help it crisp up, and the tofu turned out beautifully browned and soaked up the sauce nicely in the end. I also fried 2-3 sides of each tofu cube for a little extra bite. Would very much recommend this recipe!mccarrotColumbus, OH11/12/2020We really loved this one. Only modification was to cut the tofu into 18 (by halving down the middle) and frying two sides. 1/4 cup of frying oil seemed excessive. Salt balance was totally fine. I might add more vegetables in future remakes. Nice heatcbruettSalt Lake City, Utah7/23/2020I had really high hopes for this, but it was just okay. The acid levels on the sauce were over the top, maybe a little grapeseed oil would help to cut the vinegar. The crispy exterior of the tofu was great, but the pieces were so big that it left the middle tasting quite bland. Maybe cutting it into smaller squares? Fourths instead of thirds to give 16 squares instead of 9? Idk, just wasn't a slam dunk for me. I was nervous after seeing the review below me saying it was way too salty, but mine didn't turn out salty at all. Not sure what happened for them, as there is hardly any salt at all in the recipe. I ended up having to substitute carrots for the cucumbers because mine had gone bad, but they were delicious! Great sub if you need one.sarahbear518Seattle, WA7/3/2020Unbelievably salty. Inedibly salty. I triple checked but we put the right amount of everything. I don’t know how I’d make this again without it being so salty. AnonymousPortland, OR5/29/2020Really good! But next time I'm going to rinse the noodles and cook them at the last minute. I cooked them 5 minutes too soon and, with the recommendation to not rinse them, they turned into one big congealed lump. Still very tasty and will definitely make again!Anonymous5/27/2020 Love this recipe and my non-tofu loving family loves it too! I like to steam some veggies to go with and I throw some thin cut carrots and lemon juice on top!AnonymousOhio5/14/2020I have made this recipe 3 times, I love it SO! I increase all the ingredients to make it work for a full block of tofu and full package of soba (its such a headache to later figure out what to do with random bits of ingredients left over from a recipe!). The sauce is really forgiving so it is easy to just increase the elements kinda randomly. As per other comments, after the first time, I washed my soba noddles, otherwise they gum together and the sauce gets too thick to coat them and I do end up frying my tofu for some time, turning them, so they crisp up on all sides of the small blocks. Enjoy!AnonymousSan Francisco, CA5/12/2020This was seriously delicious and made me a tofu convert. I found that it took a while to get the browning I wanted on all sides but it was *very* worth it in the end. In addition to the cucumbers and scallions, I added some Siracha on top for heat. Healthy, easy, and delicious! \nAnonymousMinneapolis, MN 5/11/2020Whole family loves this one.juenologyMontreal5/5/2020Explore Bon AppétitSoba NoodleNoodlePasta & NoodlesTofuOther IngredientsTahiniCondiments, Sauces & PastesCucumberVegetableQuickWeeknight MealsMainDairy-FreeVegetarianHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "Andy Baraghani"]}