{"id": "df0d9fc3e59848e68e28d2960fd2386c", "url": "https://www.bonappetit.com/story/emergen-c-reviews", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Emergen C Reviews of 14 Flavors So You Don't Have to Wonder Anymore | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Ranked 14 Flavors of Emergen-C So You Don't Have to Wonder AnymoreSenior editor Alex Beggs OD-ed on Vitamin C for the sake of science.By Alex BeggsMarch 7, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis story is part of the Healthyish Guide to Feeling Better Already, a collection of recipes, remedies, and distractions to get you back on your feet.There’s so much promise in a packet of Emergen-C, the Crystal Light of cold medicine, the glittery remains of crushed Flintstones chewables. But medicine, according to my doctor, Dr. Jerry, it is not. Still, all it takes is a slight throat soreness or spring sneezing to send me to Emergen-City. One thousand percent of my daily dose of Vitamin-C? SOUNDS GOOD. I mix an inch of water with the particles and wait for my hands to start glowing, my sight to improve, my credit score to soar. Bring me healthhhh!Photo by Chelsie CraigBut did you know there are SO MANY EMERGEN-C FLAVORS? As I did with the Kool-Aid packet display at Kenney’s pharmacy circa 1995, I stand in the aisles of Target and imagine my life with swoopy-fonted Blueberry-Acai Emergen-C in it versus old faithful Super Orange. The decision, it turns out, can be crucial. It takes some time to commit to a whole box of this stuff, and some flavors are downright swill. For the sake of health–or the perception of it—I taste-tested every flavor I could find in the vicinity and on Amazon to give you these Emergen-C reviews. Despite hopes and expectations, this overdose of V-C did not sprout me any extra limbs or heal that weird bump on my bicep. I even got a cold at one point! But whatcha gonna do. Here are my Emergen-C reviews, from bottom of the barrel to the top shelf.Ew, Never AgainI’m sorry, chemical engineers who invented these, but Blueberry-Acai tastes like a melted sugar-free popsicle mixed with sidewalk puddle. Nearly black and murky in color, this was the only flavor I couldn’t finish even sampling. There was a medicinal flavor that reminded me of torturously swooshing my mouth with fluoride at the pediatric dentist. Hard pass.Similarly, Triple Berry Blast had purple liquid Dimetapp vibes that I couldn’t shake. It was sweeter than other flavors and didn’t fizz up as much, and that was a textural disappointment for me (lol). I could see kids liking this one, though.Wouldn’t buy Raspberry again. The concentrated flavor was nearly syrupy and overwhelmingly bubble bathy. It could be saved by diluting with seltzer and adding lime, however. You’ve never made an Emergen-C cocktail before? Get with the program, people.Photo by Chelsie CraigSolidly MehThese wannabe matcha sleeves of “Energy” Emergen-C crack me up. There’s a tiny bit of caffeine in them. But like weddings and Super Bowl commercials, I felt nothing. They are, however, extremely fizzy and flavor-blasted. Peach-Mango was the liquid version of those gummi peach rings, and a part of me was into it, but it got old fast.Prepare for disappointment from Meyer Lemon—like a primetime drama season finale, there was too much to live up to here. Nothing like the real thing, this flavor had a slight bitterness that felt like it was going for sophisticated, but ends up making you smack your lips and wonder what went wrong. Some people in the office liked this one, so I can’t say it’s The Worst, but no one came running to my desk to steal handfuls of it like they did others. Shameless thieves.Photo by Chelsie CraigNot Mad About TheseLemon-Lime was straight-up Gatorade when watered down, but with less water, like Mountain Dew that’s been left in the backseat of your Corolla to boil. The milky yellow color looked like actual lemon juice—confusing, but not deterring.Cherry had a pleasant candy flavor, if you’re familiar with those plastic bags of cherry sours, which are tart but not actually sour—it was like that. Tangy! Begging to be mixed with lime La Croix.If you’re a pomegranate fan, Cranberry-Pomegranate is nice, like those flavored herbal, caffeine-free teas you keep years past their expiration date just in case you want to make sun tea. The pom flavor is intense, as is the brilliant violet color.For lemon lovers, Pink Lemonade is more lemony than Meyer Lemon or Lemon-Lime, so seek this one out. It’s not nearly as sweet as you’d expect after chugging too much Country Time at Sarah B.’s house that one summer. While it’s a lovely millennial pink shade, there is no taste of pink. For that, try Strawberry-Kiwi. A deep, Benetint magenta, it tastes like Fruitopia, or Snapple, or whatever was your vending machine juice of choice. Sweet as a melted Sno-Cone, I was delighted by it, but to each their own nostalgia.Photo by Chelsie CraigThe Fab FourMeet Tropical. A passionfruit-pineapple-led party that takes you to a beach where the sand is made of Vitamin-C crystals and the ocean is the peachy-pink of NARS’s famous Orgasm blush. Don’t you want to go there?! There’s a Coppertone/piña colada/frozen cocktail flavor that makes you wonder: Do I like the taste of sunscreen? Yes, I love the taste of sunscreen!You can’t knock Super Orange, the flavor that got us into this mess. Crayola orange with dark orange specks, it tastes just like Tropicana: familiar, buoyant and juicy, all-purpose. A hypochondriac's staple.But then Coconut-Pineapple walks in. Do you like piña coladas, and not getting pneumonia after getting caught in the rain? Well this Starburst yellow drink is your JAM. There’s something actually creamy about this flavor, like pineapple Jarritos mixed with Dole Whip. NICE. This is my vacation Emergen-C, for special occasions.At long last, jittery with Stevia and running to the ladies’ room to pee every 20 minutes, we have the winner. Tangerine! The subtle, sweet flavor has the citrus tang we love in Super Orange but isn’t as candy-like. It’s a crowd-pleaser that works any time of day, for any state of sniffles. And here’s the thing: It actually tastes like real, ripe tangerine juice. That’s hard to pull off in created-in-a-lab flavor factories, which is why it’s the winner. Good luck out there, germies!Buy Tangerine Emergen-C on Amazon for $10 (and other flavors ranging from $10-$17/box)But in all seriousness–you know what else is a great source of Vitamin-C? Fruit:Vitamin C Superfruit SaladFeeling under the weather? This superfruit salad will give you the perfect jolt of vitamins you need to get back on the path of recovery.View RecipeExplore Bon AppétitHealthyishVitamin CSuperfoodGet WellRead MoreshoppingI Tried the Best Teas for Sleep and Here’s What I ZzzzzzzzzzzzzzBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "Alex Beggs"]}