{"id": "df15dd9c354ba90b19071322723ac098", "url": "https://www.bonappetit.com/story/new-trader-joes-products-reviewed-2018", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Trader Joe’s Newest Products in 2018, Reviewed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopfeaturesTrader Joe’s Newest Products in 2018, Reviewed (Part I)We’re on a hare-brained mission to try every new product at TJ’s in 2018. Here’s what came out from January-July.By Alex BeggsJuly 18, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailFor the newest reviews, see here.Trader Joe’s has it all figured out. The new products, they just keep coming. We’re on a hare-brained mission to try every new product at TJ’s in 2018. Trying. A noble pursuit, a “good use of time,” “what is this, an ad?” call it what you will. New this week: Crunchy chocolate-mint cookies (uh huh), greasy good samosas, a MUST-HAVE frozen treat, and more, below!The Week of July 18Unsweetened Almond, Cashew & Macadamia Nut Beverage, $2.29That’s a lot of nuts. This “beverage” of juiced nuts has the creamy, expensive flavor of macadamia—nice—though watery and thin, which comes with the alt-milk territory. I made thrilling overnight oats with it, plus a touch of peanut butter that really brought out the nutty nut nutness.Mini Dark Chocolate Mint Coins, $1.99You know what these are, right? They’re quarter-sized Thin Mints. The texture is near potato chip crunchy and thus, you can’t stop eating them. They’re slightly waxy on the outside, like prime time TV newscasters. They would be decidedly brilliant if frozen and put atop a bowl of vanilla ice cream. The minty aftertaste can remind you of freshly brushed teeth, if you brushed your teeth with a Hershey bar. My kind of hygiene.Mini Vegetable Samosas, $3.49Since they’re mini, I made them in the toaster oven, which took nearly 30 minutes. Once finally golden, a close inspection of eating nine in a row gave me the expertise needed to review them here. They’re greasy (in a drinking snack good way), nearly all pastry with scant potato (and I think I tasted some onion) filling, and somewhat spicy (after the third or fourth). If you’re throwing a party and don’t know how to make...dip...I could see these disappearing when put out into the wild. I paired them with a glass of acidic Grüner, which I recommend replicating for all the winos out there. (Should I be doing more wine pairings here???)Bite Size Crispy Cookies Filled with Belgian Chocolate, $2.49How do you spell M-I-L-A-N-O? When you have big shoes to fill, the expectations are impossibly high. The coin-sized cookie here is “crispy” to the point of “rock hard”, meaning they’re no match for their vaguely European distant cousins out on the farm. The chocolate filling is bold and espresso-like though, and in a measured proportion that pleased the staff of BA as they came by to “help me” review. “At first I was like no way! and then I was like, okay!” said Chelsie Craig, who snacked on a few after taking this photo. I saw that, Chelsie.Peach Bellini Jam, $3.99What is this, *hold monocle up to eye* brunch jam? I saw a handful of “boozy” jams at the Fancy Food Show this year so I guess this is a trend. The texture is chunky fruit-filled Jell-O—high in gelatin, or maybe a slight overdose in pectin? Either way, it’s nearly solid in there. But the chunks of ripe peach are a sweet complement to toast with chèvre (TJ’s is a solid choice there). The prosecco adds a dryness to offset the sweet, but I’m not sure I’d notice if it weren’t written on the label in the TJ version of Comic Sans.Gone Berry Crazy! $2.29Hey, does everyone have their ticket? Because you’ve boarded the train to BRAIN FREEZE STATION. Gahhh it hurts so good!!! Maybe you’ve had the banana version of these frozen bites covered in a delicate shell of chocolate. But the tiny strawberries are DELISH, especially after you’ve gotten over the shock of brain shattering freeze. I emptied the plastic bag into a takeout container and kept them in my freezer, popping a berry before/after a workout, or when I got home from work and was sweaty from two flights of stairs. I love this kind of versatility!Apple Crumble Pie, $6.99When they say crumble, they mean crumble. There were crumbles all over the box, all over the table, and then all over the carpet when we tasted this in the office. Everyone declared the pie: sugar bomb! The bottom crust was limp and flabby, like a weak handshake, and the pallid color of a vampire’s buttcheeks (that’s even paler than the face, okay?). The crumble top—a mess of toasted oats, not enough clumps!—reminded everyone of crushed up cinnamon cereal, which was nice. The apple filling, though a little watery, and while we all wish the apples had cooked a little more, it was still a solid grocery store pie option. And $7? Can’t beat it.PreviouslyThe Week of June 25Chelsie CraigThese Peanuts Go On A Date Bars, $2.99These are soft, pliable rectangles of peanut butter and sweet date paste, with tiny pieces of peanuts to appeal to eaters with 10-32 teeth. Afternoon sugar rush: UNLOCKED. I appreciate that they’re minimalist in ingredients, not trying to convince me they’re a nutritious godsend like some bars we know, and that these two peanuts on the box found love. You could also throw them in a blender with some frozen bananas and almond milk and call it a smoothie. I can’t help but picture using the pasty bars as grout between bricks of Trader Joe’s gingerbread when I grow into my true identity, fairy tale witch. One thing at a time.Chelsie CraigRosemary Balsamic Steak Tips, $9.99/poundJoe wasn’t joking about that balsamic, which left a bitchin’ sugar coating on my nonstick pan. And sugar is the predominant flavor in these just-the-tips. To counter the sweet, I dipped them in mustard, which helped. I’d buy these again if there were a garlicky marinade, hold the grape juice concentrate (y tho), because they’re fast-cooking and juicy-tender. My favorite part about them was the fact they were steak. Not a gimmicky snack, not a novelty cheese, not a frozen whatever. Steak. The food of my people. (Texans.)Chelsie CraigMixed Mushroom & Spinach Quiche, $2.49This groovy flower-shaped quiche is about the size of my hand, which made me reaaaaaally not want to pre-heat the oven. So small, such energy. And yeah, my warm oven has been known to attract mice. So I attempted to bake it in my toaster oven and it took foreverrr. Lot of extra letters in this review, lot of exasperation. For some reason, there was still too much...liquid...in the center, but I ate around the sides, until I could go on no longer into the watery abyss. The mushrooms were nice with the funk of Emmental cheese, but life is too short for mini quiche. Even if for one or two people, a full-sized quiche means you get to eat it cold for breakfast. Mini quiche, stop wasting my time.Chelsie CraigHot Smoked Scottish Salmon, $15.49/poundDid you know Kim Kardashian is Scottish? Huh. Not sure what to do with that irrelevant information, I’ll just fill you in on what is one of the best new products at TJ‘s lately. Unlike the too-thickly sliced, sometimes stringy TJ lox, this smoked (but not too smoky) salmon comes off the filet in silky smooth chunks that you can flick on salad, add to a piece of ricotta toast (+squeeze of lemon, flaky salt) or grain bowl, or stir into pasta. Would buy again. Would probably not fact-check that Kardashian detail.The Week of June 11Chelsie CraigSpicy Cheese Crunchies, $1.99Here’s a photo of me when I saw that Trader Joe’s went and made their own Flamin’ Hot Cheetos: 👻I grabbed two bags and zoomed to the cashier, who told me that she likes them, but her son prefers the original. “There’s something...extra about these that he doesn’t like,” she said. Intriguing! It turns out that the spicy cheese coating has powdered buttermilk, which adds this pleasant tang right when your chin is starting to sweat and your eyes are expanding from their sockets and your life is taking on new meaning. These dusty arthritic knuckles are what the devil would have tossed Eve from behind a bush in Paradise, had apples been out of season. I absolutely smashed them, literally all over my keyboard, which is making a loud vroomWHIR noise now. Spicy cheese crunchies are the 11 a.m. snack that ruins you for lunch but who even cares because you brought QUINOA and didn’t really want it anyway! I pecked the burnished crumbs from my keyboard like a seagull on the Coney Island boardwalk. CRUNCHIESSSSS!Chelsie CraigBerry Flavored Soft Licorice Twists, $2.49Per the sweet poetry of Trader Joe’s copywriting, this soft licorice hails from a “small, family-owned business in New Zealand,” though no word yet on whether they let their kids watch Dateline all night or recreate the hike to Mordor or other cool family things. What I can surmise is that the fam has some teeth sensitivity issues and a capitalist drive, so they cooked up these soft, chewy candies and the rest is history (on the back of a recycled paper package). This is a thinker’s snack, because you can get a lot of thinking done while you chew it. The berry flavor had a distinct medicinal taste that turned off a few staffers here, but everyone loved the thought-provoking texture. Next time we’d try the strawberry.Dark Chocolate Toasted Sesame Caramels, $2.99The sesame-caramel filling is too solid! I need ooze! Maybe some flakes of salt on top too! There’s a crunchy secret inside that caught my attention.* But now it’s moving on.*It’s biscuit pieces and sesame seeds!Chelsie CraigMouthwash, $3.99; Peony Blossom Foaming Hand Soap, $2.99 while supplies last; Cucumber Avocado Body Butter, $4.99This mouthwash sends a minty tea tree oil zing to the nostrils, on the tongue-buds, it leaves a lingering bitter aftertaste. The peony hand soap (foaming soap, like peonies, lasts about a week in my house) has a subtle floral perfume that dare I say reminded me of Plumeria?! Another mall-throwback was the cucumber avocado butter, which was too too sweet; I’d have added cilantro or another herbal green note—or some white onions and jalapeño and make some guacamole instead—to balance out the Bath and Body Works circa 2003 vibes.Chelsie CraigChèvre with Honey, $2.99“Now in a five-ounce log with an updated label”! This isn’t a new product, but it’s in a smaller size that’s more amenable to the life of a person who spends her evening hours eating toast and drinking cold red wine on the couch. IMPORTANT: You must let the cheese come to room temperature, otherwise it crumbles and is annoying to spread. I toasted a slice of TJ’s San Francisco-style sourdough, rubbed a half clove of garlic over it, spread the chèvre, and topped with Maldon salt. The honey is fully incorporated in the goat cheese, there’s no sticky business to deal with, and it’s not overboard in sweetness. If you’re bored in your breakfast routine or trying to cut down on cream cheese or loneliness, try it!Chelsie CraigSmoked Salmon Poke Bowl, $5.99This “poke” bowl is made with smoked salmon, a reasonable alternative to expensive, sushi-grade raw salmon when you’re a giant company with a lot of poke bowls to distribute across the lands. My sesame-marinated salmon was smushed under the little container of a sweet ponzu sauce (blood orange I suppose?), which was fine. Everything was fine! The seaweed sprinkles were fine. The quantity of salmon was fine. The plentiful pickled ginger was fine. The general near-mush texture was just fine.The week of May 21Giardiniera (Slightly Spicy Pickled Vegetables), $1.99They added extra cauliflower, because people love pickled cauliflower (please scroll down for the review of cauliflower gnochhi 🧐). However. A GIANT floret clogged up my jar and no other veg could get past. I had to stab it to death with a paring knife to break it up and clear up the traffic. If you love giardiniera but are secretly scared of spice, and tell everyone at dinner you can “handle spicy”, and politely ignore all recipe instructions to “add jalapeño”—this is your giardiniera. It’s sweet, mild, tangy, and the carrots look like Ruffles. I like that.Mexican Style Corn & Quinoa Salad, $4.99Ever had a good idea ruined by kale? It happens. What was almost a brilliant take on elote—elote grain bowl!—is taken over by stringy ribbons of raw kale and the occasional dried-out kale stem. I wrote a postcard to the kale, it’s a photo of a sunset and it says “wish you were shallots.” Otherwise, this is a SUBSTANTIAL salad, great to bring to a picnic or as a side at a TJ-themed dinner party. Maybe I’ll throw one! You’re all invited. I’ll be under the table, crying.Smoked Paprika, $2.29This is actually a Rubik’s Cube. After spending minutes shaking, whacking, and breaking fingernails attempting to open this thing, I googled, “how to open paprika tin” and it turns out this is a common question people search. Isn’t nice to feel known? A three-fingernail approach ended up working. I sprinkled some on my palm and licked it like a sailor kissing the sand after a journey at sea (I like to stay on Trader Joe’s nautical theme). My cat observed, head tilted, wondering what other behavioral tics of his I will assume. Oh right, the paprika. It tastes like the seasoning on BBQ potato chips.Shawarma Chicken Thighs, $4.49/poundCalling all meal-preppers! Fans self with blue Ziploc lid. These pre-marinated chicken thighs taste great (cumin, we see you), are juicy, and ready in minutes. There were four thighs in the package I picked up. Yes, you could raid the spice cabinet and do this kind of marinade yourself, but who has the time! That’s time better spent working, never not working, always working, thinking about work, getting ready for the work week ahead, work work work.Liquid Dish Soap, $2.99My life is greasy. I cook with a lot of oil, my skin tends to be shiny, and I love a poodle skirt. How does dish soap fit into this equation? It needs to clean the grease off of my various takeout containers. With a gentle, everything-free dish soap like these, I needed to use two rounds of suds to get grease to budge, so I went though a lot of soap every round of dishes. Maybe you’re not so greasy and don’t have these requirements! In that case, enjoy the scent citrus, which is so faint it only smells, to my nose, of the idea of citrus.Gluten Free Norwegian Crispbread, $4.29Ah yes, the Norwegians and their healthy cracker-breads. Close your eyes and picture the Northern Lights and some reindeer and people skiing and Jo Nesbø novels. Are you there? Are you in Norway? Now crunch down on this huge seedy, slightly soft cracker. It feels right, doesn’t it? They’ve really captured it. Norway. Gluten free Norway.Thousand Island Dressing, $2.99Chunky! Love a chunky dressing. Chunky anything. Chunks give life dimension, topography, heft. The chunks in this Thousand Island dressing are dehydrated cucumbers and garlic, which I never thought about dehydrating but good idea. Other good ideas: soy sauce. I’m already a lifelong fan of 1000 Isle, so my heart was open, and the salty umami undertones here won me over. Normally I’m an advocate for Making Your Own Damn Dressing, but sometimes a mood strikes. A salad bar mood. All you need to complete the fantasy is a clear glass plate, some flavorless cherry tomatoes, and crisp iceberg lettuce.The Week of April 7Party Cake, $6.99How about them sprinkles? The round, crunchy sprinkles on this quintessential grocery store birthday cake were the best part. Well, the other best part was how excited everyone in the BA office was to eat it and then tell me how they felt. For food director Carla Lalli Music, it inspired visceral memories: “You know how babies at restaurants play with sugar packets, sucking on it until it dissolves? This is like that—drinking moistened sugar.” The cake crumb is so moist it leaves an imprint of oil on the bottom of the cake plate (and on every surface you touch because you obviously ate this with your hands); the blank cake flavor means you can eat this when you’re sad. Or happy! The result will be the same: your blood sugar will spike to record-breaking heights, the dopamine will tickle your brain, and your forehead will hit the desk in an afternoon sugar coma. Life’s a party!27 Layer Croissini, $3.99Oh they got me. Frozen croissant STICKS? Well, twists, but in my box, some were twisted and some were straight lines. Joe is unpredictable like that. But it doesn’t matter, because they’re buttery croissant sticks and I want to eat the whole box. You could serve them with labneh or creamy gorgonzola dip at a party, but I lacquered them with peanut butter and jelly and went to town. Town is my couch. These are BUTTER. I LOVE THEM.Part Skim Ricotta Cheese, $3.49What else can I say? It’s ricotta cheese, made with watery skim milk. It has a sort of cottage-cheesy bumpy texture, which I don’t mind one way or the other. Ate in on pizza. Pizza is pizza. Moving on.Seedy Almond Salad Topper, $3.99HOLY RED PEPPER FLAKES. I dumped a little bag (this is a bag with other bags inside of it FYI) in my lunch salad and it became half of my salad. There’s a lot in there! This “salad topper,” aka sprinkles for grown-ups, is a prolific batch of crunchies: seeds, other seeds, slivered almonds, and a heavy dose of red pepper flakes, which I love... until my mouth is burning and my teeth pockmarked with seeds like an out-of-season Jack-o’-lantern. If you don’t have time to toast your own seeds and/or combine seeds with almonds at home, this novelty purchase is for you. Sprinkle away.Cauliflower Gnocchi, $2.69Everything was chill until the cauliflower gnocchi showed up. People are very excitable about cauliflower not-things, like TJ’s cauliflower crust, and bags of cauliflower “rice.” I am one of those people! Here, we have a soft, gnocchi-like nugget made of cauliflower, cassava flour, and potato starch, in place of potato, flour, and egg. Pretty impressive chemistry if I say so myself! (I failed Chemistry.) Right out of the bag you get a whiff of that raw cauliflower stank, but once cooked (I did the stovetop method: add water, cover, add butter, brown, done in 12 minutes) it tastes of nothing at all. The cassava flour and potato starch coated my Dutch oven and spoon with a thick, gooey layer of starch sludge, which took ages to clean. However, Joe nailed the chewy-gummy-pillowy texture that attracts us to potato gnocchi. I dressed up my two bags of gnocchi for two people with red pepper flakes, garlic, Parmesan, spinach, and a squeeze of lemon. Please don’t tell any Italians mad at food about this.Grapefruit Scented Candle, $3.99This is a candle that smells of grapefruit and only grapefruit: extremely acidic, sour, and astringent. Useful, in my case, for getting the smell of fish out of my entire apartment.Springy Sodas, $3.49/pack of 4I tasted these by pouring the fizzy liquid in a goblet, taking a big inhale, and swishing the soda around my gums—I need to assess with the utmost professional tactics. On the nose, strawberry-rhubarb is all strawberry, with hints of chapstick. Oh wait that’s my chapstick. The rhubarb comes through in taste, pleasantly tart and sweet. This drink is liquid pie filling; adding tequila sounds like a very good idea indeed. Avoid lemon-elderflower, which is much sweeter, with notes of super overripe citrus and an acidity that sucks the moisture from your saliva glands. I would never lie to you.Chocolate Whole Milk made with Fair Trade Cocoa, $3.99Don’t be distracted by the excessive use of buzzwords, stay focused on the task at hand: drinking a cold glass chocolate milk. Creamy, perfect chocolate milk. I hear that in some homes, people even pour it into glasses rather than drinking straight from the carton after a grueling “long run” (1 mile).Organic Pepper Jack Cheese, $7.99/poundTJ cuts these blocks of PJ into thin rectangular prisms, also known as cuboids. As you grate the cheese for quesadillas or whatever, the structurally unsound block tends to crumble off into cheese boulders that you MUST eat as a snack because that’s too inconvenient to shred. When I’m shredding the PJ into a mountain inside of my box grater, the cheese begins to break off, and I shout AVALANCHE!!! into the kitchen where my cat, Roger, is at the ready for any falling boulders that I haven’t yet captured. You thought this was going to be a review of a block of cheese?!? You might, in certain terrains, come across icky long slivers of red jalapeño pepper skin. But again, unpredictable. Check the forecast. This is a cheese that melts, and it melts well. If your concern is “spicy??” know that it has minimal spice, save the whisper of a jalapeño in the breeze.The Week of April 23Coffee Toffee Shortbread Cookies, $2.99I searched all over for these until Juan, a nice man with a pencil in his ear—not behind his ear, through a huge hole in his lobe (must be a writer)—helped me track them down in the frozen section. Thanks, Juan! These are very crunchy cookies, with tiny shards of toffee in them, which do exactly what toffee is supposed to do: sorta stick in your teeth and provide daylong pleasure. I especially loved dunking these in coffee, which softened the cookie and semi-melted the chocolate coating. The small cookie size is good for portion control, she told herself as she lay awake at night, thinking about all the cookies she stress ate that day.Such variety.\nSriracha Shrimp Bowl, $3.49Hard to really expand on the name here but what you get is a bowl of frozen shrimp and veg, including TINY CORN. What I wrote down in my notes: “Would like entire bowl of baby corn, plz!” So that’s the highlight. The move at TJ’s is to buy frozen shrimp (which we prefer to fresh!) and then make our curry with it, or scampi, or a stir fry.Cream Cheese Brioche Pastries, $2.99 (box of 2)It never occurred to me to buy frozen pastries but what the heck?! Trader Joe‘s makes me do crazy things. The instructions on the box tell you to defrost the brioche Danish bun thing for an hour, and then it’s ready to go. After that, I put it in the toaster oven for like 39 seconds to push the limits. It was a surprisingly chewy and tender sweet dough, with a HUGE plop of cream cheese in the center. What this does is it forces you to lick a swipe of cream cheese and then bite into the outer brioche ring so that each bite contains both. Like I said, crazy things.Crunchy Maple Ladders Cereal, $3.49Dare I say there’s something Hitchcockian about these cereal. Ladders, really? And no chutes? Seems like a missed opportunity. Also no marshmallows. Another womp womp. These oaty basement windows taste like pancakes, and have a high resistance to milk, which never softens them. If you’re constantly in fear of failure, a fall from the top, or climbing endless corporate ladders going nowhere, this cereal is not the metaphor for your complete breakfast.Oaty.\nThe Week of March 26Chocolate Mousse Eggs, $2.99These aren’t new to 2018, but they were new to me, seasonal, and so damn good that I had to share them with you, anonymous Internet friends. What first appears to be a badly decorated chocolate egg candy is actually a delicious tiny cake. It’s half moist, spongy chocolate cake, half airy chocolate mousse. All of that is encased in the outer—and I can’t emphasize this enough—sloppily decorated frosting. Sprinkles dropped from a distance of 50 feet, squiggly lines done by a robot with the shakes, and stripes, well the stripes are okay. If you’re going to get one impulse Easter candy purchase this week, get these. Or two.Milk Chocolate Truffles, $2.29Like wearing white tights to church on Easter, I have to skip this one. A half bite did me in. The “crème” inside is an ultra-cloying white paste that I had to swish out of my molars with water. So much water. And a little bit of red wine. I think Mr. Joe was going for a Cadbury thing here but something got lost in translation: taste.Photo by Alex LauHoneycomb Honey, $6.49So it’s a jar of honey with honeycomb in it….to bring out the extra honeyness? This is not explained in the enthusiastic product description. To remind you of the nature from whence it came? Seems like a visual ploy to me. Honey with a waxy prize! The flavor of the honey is honey, with slightly more depth than the one-note processed honey bear (luv u, honey bear!). However, I prefer the rich flavor and creamy texture of TJ’s organic raw honey, which is the cheapest in town ($5.99).Banh Mi Inspired Noodle Bowl, $4.99What we have here is a bowl of coleslaw. There’s some dried out baked tofu that reminds me of grocery store brand smoked gouda; wet, wilty pickled carrots; about 12 rice noodles; and a creamy sriracha mayo dressing. Bahn mi inspired is some bold poetic license if you ask me. What’s one of the most exhilarating details of a bahn mi? Obviously the huge baguette! As Judge Judy once said, don’t pee on my leg and tell me it’s raining.Photo by Chelsie CraigDate & Nut Bites, $3.99You’ve got two flavor options here: Cashew Apricot or Blueberry Almond Peanut. If you’re like, going on a hike or something, the lesser of two evils is Cashew Apricot. The texture is: a Clif bar smashed into a cube. And I’d rather eat this little bite than suffer through an entire Clif Bar when we live in a world with food. Unfortunately the date bite’s orange zest leaves a bitter aftertaste, but maybe you packed some Gatorade or warm coconut water to wash it down? The blueberry flavor, reminiscent of stolen hotel vanity soap gathering dust on your bathroom shelf, is extremely dry and grainy with chia seeds. It’s a chore to eat, and I already have too many other chores right now.Sprouted Whole Grain Pizza Crust. $3.99Being a natural born hater, I was emotionally prepared to spit out this perfect circle of “pizza crust” the second it came out of the oven (in 12 minutes!). It’s a big ass cracker, people. However, when covered with olive oil, mozzarella, dollops of ricotta, garlic slivers, and jalapeño—I had myself a pretty swanky white pizza. Or flatbread, I guess. I made a second, because there are two crusts in a bag! The lesson here: Life is like a sprouted pizza crust. The toppings are in your control, so don’t blow it. And by blow it, I mean make a “salad pizza.”Sumatra Coffee Brownies, $2.99Obviously this is a good idea. Instead of cakey-brownies, you have two individually-wrapped duos of dense, fudgy brownies (four total, but I guess they know you’ll eat two at a time because you’re a hapless victim of the sugar lobby). The coffee grounds sprinkled on top create a muddy brick-like texture, which you get over pretty quick because your body is getting what it wanted all along while you tortured it with date bites: coffee and chocolate, together. The package is wrapped in crinkly plastic that comes with a tiny card, like the ones on bouquets, which leads me to assume this is a Teacher Gift, aka the emergency grocery store present you get for teachers, and friends with broken legs, and cat-sitters. Thoughtful.Crunchy Cinnamon Squares Milk Chocolate Bar, $1.99Put some Cinnamon Toast Crunch in a chocolate bar, see what happens. This. A sandy, milky chocolate bar the texture of semi-set cement. The kind that if you hurry up, you can still carve your initials into it, or the word “butt.” The cereal wanted to be as crispy and delightful as Rice Krispies, but never quite made it there. Too bad!The Week of March 12Photo by Alex LauChocolate Caramel Yolkies, $2.69Easter is coming, Big Chocolate’s third favorite holiday, and TJ’s is doing their part with these cute-as-hell chocolate fried egg squares. While I had to dig through a pile to find a few with unbroken yolks, it was almost worth it. Once you eat the cloying default-tasting milk and white chocolate out of the way, the yolk is filled with caramel. A delightful, sticky surprise! But not as big as a surprise as realizing the cashier only rang up one of them. I guess this is what it feels like to be a criminal mastermind! Happy Easter!Please note: Extremely inconsistent yolk to white ratio and unnatural spreadage.\nPhoto by Alex LauPhoto by Alex LauChicken-less Mandarin Orange Morsels, $3.29These are vegan wish-u-were-chicken-nuggets made of soy flakes and mystery starches, served with a sugary sweet glaze. When I sautéed them in a cast iron, the “breading” separated from the soy nuggets, leaving naked nuggets behind. Avant garde! Once the nuggets were coated in just a splash of the slippery packet of garlic-ginger-soy-orange-sugar-salt sauce, I ate the entire bag, which was 60 percent of my daily sodium requirement. My skin started to pucker and wrinkle into itself, crying out for water. I took a sip of my negroni and sunk deep in between the couch cushions thinking, being a vegan ain’t so bad.Photo by Alex LauBlarney Scone, $3.99St. Patrick’s Day is near! The only time of year I remember I’m vaguely Irish other than all the nights I leave parties 6 minutes after arrival. This hybrid scone-soda bread has a dense, cake-like texture and unpleasant licorice aftertaste from a heavy hand of caraway seeds. It crumbled in the toaster and didn’t improve much when smothered with butter. Visually, it does resemble a big, dusty rock from Biblical times, so save it for Easter and use it to recreate the scene where an angel rolls the rock away from the cave and Jesus asks Mary Magdalene what’s new at Trader Joe’s this week.See what I mean? Geographic.\nPhoto by Alex LauPhoto by Alex LauCinnamon Sugar Muffin & Baking Mix, $2.99There’s nothing more economical than buying a box mix that’s the same price as a huge bag of flour. You got me, TJ! I added egg + water and made some muffins on a Tuesday morning. The sell on these is that they want to taste like old-fashioned doughnuts, which, not quite. They’re cinnamon nutmeg cupcakes. You need to dip each guy in (six tablespoons of) butter and then roll it around in a bowl of cinnamon sugar. What I highly recommend is standing in the kitchen and dipping each BITE in butter and sugar, because at some point there’s no turning back—and 6 tablespoons is way too much anyway.Photo by Alex LauChicken Sausage Breakfast Burrito, $3.99One of my entry-level Trader Joe’s creations was a breakfast burrito I made with their excellent flour tortillas, a toaster-oven-toasted frozen hash brown patty, scrambled eggs, and the “Mexican” shredded cheese. Salsa verde if I had any. I ate this for lunch in college for a whole year, slowly turning into a burrito myself. No regrets. Unfortunately I did regret this particular burrito, which was filled with little balls of chicken sausage and a murky white gravy. Tiny white cubes of flavorless potato were a waste of valuable real estate, and I yearned for that fried potato of my past. Coincidentally, that’s the title of my upcoming potato-themed memoir.Photo by Alex Lau100% Mango Juice from Carabao Mangoes, $2.99 for pack of 4This exists to mix with tequila and club soda. That is all.Photo by Alex LauOrganic Hearty Minestrone Soup, $3.99This not-really-that-hearty minestrone really makes its mark with mushy soft orzo and the occasional kidney bean that floats around like the reason the whole pool had to be drained last summer. An overpowering potpourri flavor from bitter dried oregano, basil, and other once-green herbs can’t be covered up with oyster crackers and red wine vinegar. I had to toss this after a few spoonfuls, which is sad, because it’s just soup.The Week of March 5Photo by Alex LauZhoug Sauce, $2.99Oooo! This was an unexpected spicy delight, apparently made by a “California vendor well-versed in the art and science of Middle Eastern foods.” That’s about as close at TJ’s has ever gotten to revealing a source so consider this the Pentagon Papers. What we have here is super bright cilantro, tons of jalapeño, warm cumin + cardamom, garlic, and chile flakes. Heat, baby. And that green, green herb. I dipped crackers in it, but you could swirl it in labneh to tone down the fire, but like throwing a blazer over your mesh tank, it will only tone down so much. Delicious. Good job, vendor!Photo by Alex LauOrganic Italian Artisan Pastas, $2.69You can’t beat the price on these fancy pasta shapes, which can go for $5 at other stores. The orecchiette is a little thick and doughy, but that didn’t stop me from shoveling them into my pasta hole like a garbage truck swallowing a holiday weekend’s worth of waste. What can I say? I live a glamorous life. Tubular Capunti are fun, if you can disregard their resemblance to worms. I CAN. But the Gigli are my favorite. These wiggly-edged noodles not only remind you of one of J. Lo’s most iconic roles, but they also pair well with every sauce, even if it's a whole pyramid of Parm you never said “when” to while grating. 😉Photo by Alex LauBrownie Crisp Coffee Ice Cream Sandwiches, $3.99If you insist! Some stoner savant in a Hawaiian shirt decided to turn brownies into cookies, turn those cookies into cookie sandwiches, and then fill them with coffee ice cream in order lure newly 30-somethings into buying two boxes at 8:56 a.m. I’m weak! I can’t just stand here and not buy them! My freezer is on the fritz so I squeezed my slightly melted sandwiches from their plastic bags into a cereal bowl and ate them like mousse. The brownie cookie edge is chocolatey and soft, especially as it soaks up the hearty portion of ice cream filling. The coffee flavor is rich and potent, insanely creamy. Because of the high ratio of ice cream to cookie bookends, you are guaranteed to make a mess eating these. Get a bowl or a plate or be smart like SOME PEOPLE and eat these in the tub on a Friday afternoon.Photo by Alex LauSelect Harvest Curated Coffee—Guatemala & India, $7.99I’ve always struggled with TJ coffee, but honestly this was the best one I’ve ever had. Definitely worth that awkward moment when you pretend to know how the gigantic grinder works but then it still spews coffee everywhere. The coffee’s smooth and extremely low acidity, perfect for my eroding teeth. (I’m sorry but it’s TRUE. Real life is ugly!) My corrupt dentist would be proud of this change I’ve made in my lifestyle, even if it doesn’t entail paying for his “in-house” nutrition expert. A light-medium coffee, this isn’t for you espresso/French roast/battery-acid-in-the-biggest-tumbler-you-have folks. I couldn’t really taste the non-volcanic soil terroir, but then again can anyone, really?The Week of February 12Deep Dish Chocolate Chip Cookie, $3.99WOW YES OKAY. A giant cookie you can eat with a spoon. I tested this (frozen) cookie the two ways the instructions list: first, I microwaved it at half-power in my great aunt’s shiny microwave for 4 minutes (because I don’t have one). She insisted we slice the cookie and eat it on dessert plates with tiny forks while watching Rachel Maddow—which seemed to give the cookie more gravitas than it deserved. And what a disappointment it was: dry, over-microwaved, and bready. Cooled, it was a piece of cookie concrete, impossible to cut. Afterwards, we hula-hooped and then she sent me home with pockets stuffed with cough drops.In my regular oven, I baked my second cookie in its somehow-oven-safe plastic base, covered in foil, for 30 minutes. This was much, much better, but still not gooey-and-underbaked as I’d hoped. You really need vanilla ice cream to provide the moisture this cookie product has been deprived. The flavor is comforting chocolate chip cookie, except for a faint aftertaste, as if you gargled with molasses. I’ve had better mall cookie cakes, and, just sayin’, nothing holds a candle to BA’s cast-iron cookie. MAKE THAT.Citrus Medley Greek Whole Milk Yogurt, $.99Eating this thick, cold yogurt in the warmth of my bed, I thought back on flavored yogurts I’ve known. All are unapologetically sweet and this citrus medley is no exception. However, the combination of flavors—grapefruit and blood orange with a little zing from lime—don’t overpower the creamy yogurt base. I like this. It would be nice in a tropical smoothie, or served with berries for dessert. Honestly it was also satisfying in bed, or wherever you experiment with yogurt. High in protein.Creamy Tomato Soup Seasoned Crackers, $1.99These tomato soup roof shingles have a coating of asiago cheese dust that delighted my delicate LADY Dorito palate and confused my senses. Was I eating...soup? Hard, impossibly crunchy soup? The crack of each bite was so loud, I couldn’t hear the voices in my head telling me to stop eating foods covered with dust. The people in surrounding cubicles—too polite to speak aloud—Slacked me, “What...are...you eating?” Then rushed to my desk to try these strange snacks. If you’ve ever wondered what soup tastes like, I highly recommend soup.Chipotle Toscano Cheese, $9.99/poundTrader Joe’s is king of the seasonal novelty-flavored cheese. In college (humblebrag) I bought the truffle gouda all the time and thought I was the height of sophistication, even if sophistication meant my breath smelled like Daniel Boulud’s gym socks (presumably!). Sorry, DB. Anyway, this acne-speckled cheese is actually delicious. Here’s the thing–it doesn’t taste like chipotle. The rind does, very intensely. Instead, the Toscana cheese is like a creamy cousin of Parmesan, salty and as great on crackers as it is melted in a grilled cheese. There’s a subtle hint of smoky chipotle in some bites, but not all—depends on the distribution of flecks in your wedge, which are inconsistent. Searching for more chipotle bites, I accidentally ate ¼ pound of cheese, and realized I really, really like this cheese. The heart wants what it wants.The Week of February 5Organic Oven Roasted Turkey Breast, $4.99These floppy shingles of roasted turkey are a lunch meat staple, though I’ve never tried to bind two pieces of paper with them. Instead, I roll them with sliced Swiss cheese and dip them in mustard like the grown adult person with an expired license I am. A subtle, roasted flavor elevates the turkey from its natural state of taste (soggy meat Kleenex) to a whisper of Thanksgiving leftovers. Good product. Reliable sandwich material. Real meat. Gluten-free. Protein. Precisely circular. Not salami.Gummy Xs & Os, $2.99In time for Valentine’s Day, we have a big bag of gummies. The ”natural flavors” flavor reminds me of rosé–supposedly grapefruit, strawberry, and mixed berry—but they all blend together to me in the way you’re pretty sure gummy bears are different flavors for different colors but are they, really?? All I know is that the Xs taste better than Os. The big downside–sorry, gummy enthusiasts—is that the texture is too soft. Like that moment you’re making out with your Valentine and finally come to terms with the fact that he’s a body pillow named Ted. Gummies need a little bit of chew, some struggle, a reminder that it’s not gonna be easy all the time. A nice metaphor for love if you ask me.Electric Buzz Coffee Cups, $5.49I drink coffee the old-fashioned way—by pouring off-boiling water into a filter directly in my mouth—so I enlisted a guest reviewer for these TJ branded K-cups that are supposedly EXTRA CAFFEINATED! “It’s no special cup of mud,” texted my friend Keith, a man who puts plastic cups in a machine expecting roasted bean juice to come out. BA’s Alex Delany described these coffee pods like he does beer, ridiculously: “It tastes like someone walked across your tongue with brand new dad sneakers on. Rubber soles.” Did he really need to offend all of dadkind like that? Probably yes.Organic Sweet Italian Chicken Sausage, $5.99Like many chicken sausages, it tastes like chicken sausage. Throw in some garlic powder and basil particles and poof, Italian. Out of the package, they have a slimy smooth, bouncy hot dog texture because the casing has been removed. I don’t get how this works, but I‘ll try anything once. A sweet, kind cashier with a striking resemblance to my Uncle Manny (RIP) said he loves to make sausage and peppers with them, so that’s what I did. I mean, we’re practically family. The sausages are smaller side, more the size of Ball Park Franks, and crisp up in the pan as intended. Two people in my household ate the entire package of five links, dipping each bite in mustard and trying to find something more meaningful to say about something as mundane as chicken sausage. Notes of peppercorn tingle the tastebuds. Solidly Not Bad.Coconut Sesame Seed Clusters, $1.99These are little shards that aren’t quite granola and yet aren’t anything else. Purgatory snacks! They’re crunchy pieces of toasted coconut covered in sesame seeds, sealed together with coconut sugar and tapioca syrup. Okay so they’re candy. Serving suggestions include: casually eating out of a hollowed coconut shell, on ice cream, but more likely, by the handful until you read the nutrition facts and realize the bag is empty but hey, at least they’re gluten-free? If this isn’t impulse purchase material, I don’t know what is.The Week of January 22Churro Bites, $2.49The only thing these churro bites share in common with hot-off-the-oil churros is a coating of cinnamon sugar. Other than that, these crunchy nuggets are their own category of cookie-chip. They have a near-velvet outer texture, the combination of shiny hardened butter and sandy sugar, like when you dropped a doughnut hole at the beach but ate it anyway, because seagulls. (Because you’re a monster). Sort of like giant Corn Pops, rolled cinnamon sugar. I won’t even begin to describe what they visually resemble (😺 💩). The cashier at TJ’s looked at the nutritional details and then slowly raised her eyes to mine. Me: “These are not good for you.” Her: “Then why are you buying two?”Gluten Free Oat Cranberry Flaxseed Cookies, $2.99As a general life principle, you should never trust a cookie with more than three names. These gluten-free-oat-cranberry-flaxseed-cookies seem to think that they can trick us into believing they’re some kind of health food but we know, ohhhh we KNOW. These are cookies. With plenty of butter and sugar. Because of that, I have some great news: They taste like cookies! Like a very good grocery store oatmeal raisin cookie, with a surprisingly soft and chewy texture (I see you, molasses and rice flour.) They crumble a little, but then again who doesn’t in this current political climate? Still not sure what a flaxseed is, but I’m already starting to see definition in my abs.Thai Green Curry Simmer Sauce, $1.99This so-called simmer sauce is the pale minty green of my grandmother’s bathroom walls, with much more flavor (and a lot less lead!). Even though a simple green curry is easy to make, at this price, it costs the same as just the can of coconut milk, and there’s Kaffir lime peel in here. It’s fragrant with lemongrass and ginger, and super creamy, a little sweet—overall, delicious. You cook some protein or veg, add the sauce, serve over noodles/rice. What does this sauce have in common with a certain presidential marriage? There’s absolutely no heat. BYO-chile if you need to spice it up.Tahini, Pepita & Apricot Slaw Kit, $3.99Inside one plastic bag you get four more little plastic bags! It’s like a Russian nesting salad of environmental doom. Or something. The slaw is a combination of veggies from the aisle-land of misfit produce. Spiky broccoli stems. Faded carrots the color of construction cones abandoned by the highway. The curly split ends from a kale haircut. Cabbage. Unfortunately the dressing, a sweet honey tahini (try this one!), which is pretty good, can’t mask the musty taste of the veg. The pepita and apricot sprinkles are a nice idea, but like hoping the 14 throw pillows on your couch hide all of the cat hair, they can only do so much.PreviouslyThe Week of January 8Photo by Chelsie CraigFrosted Sugar Cookies, $2.99Trader Joe’s imitation of Lofthouse’s iconic packaged cookies is the best thing they’ve brought to the new year. The freakishly smooth, delightfully underbaked sugar cookie is topped with frosting and randomly distributed purple-pink sprinkles. Whoever was in charge of sprinkles appears to have sneezed them out, some gather along the edges, holding on for dear frosting life.But they really did it. It’s mythic, and it dissolves into dust the second it touches your saliva. The minute you bite into it, you forget it was ever there. And it’s everything you’ve missed since the last time you had one, stoned at 10 p.m. in Kroger with your middle school friends who’ve all had babies on Facebook by now. It’s a cookie that will send you back in time, in memory, in a sugar-induced nostalgia nap.Photo by Chelsie CraigCocoa Almond Cashew Beverage, $2.29Who doesn’t love a beverage? AKA the FDA-approved term for milks that aren’t milk. Remember milk? Pause to pour out some beverage in the memory of milk. Those days are over.This incredibly silky not-milk is chocolaty and sweet, with a vaguely nutty aftertaste, like a burp after too many bar peanuts. The creamy texture, thanks to the beautiful food science that is locust bean gum and other emulsifiers, ends on a near slimy note, reminiscent of the inside of the cardboard chocolate milk carton. It would be nice in a banana smoothie, heated as faux cocoa, mixed into iced coffee, or given as a bribe to children who have never known the cult of cow.Photo by Chelsie CraigItalian Marinara Sauce with Barolo Wine, $3.49Have you ever spooned straight marinara sauce into your mouth? It’s acidic and sweet, smooth save for the little toenails of tomato skin here and there. The saltiness left my chapped lips burning and tingling, like I’d exfoliated them with French fries. The addition of Barolo seems to say, “I know wines other than red,” while the black-and-gold Deco packaging suggests a Gatsby-themed party at the Olive Garden. It tasted like pretty good pizza sauce. Sign me up.Organic Fruit and Seed Granola, $3.69These little clusters of organic seeds, held together by plasticky tasting tapioca syrup, are nuggets of health. I think. No pesky oats here, just seed bombs that I imagine are only slightly larger than what well-fed pigeons expel. The sharp and crunchy texture is appealing to parents who bring healthy snacks to the movies. They’re also the perfect snack for mindful eaters, as you will mindfully spend every bite doing tongue yoga to get chia seeds out of your molar fillings from the 90s. There are surprise bites of sweetened dried cranberries that will make you exclaim, “SUGAR, for MEEEE?” Somehow you will eat the whole bag.Stay tuned for more, more, more.Explore Bon AppétitTrader Joe'sShoppingRead MoreshoppingTrader Joe's Butter Is as Good as the French StuffBy Christine MuhlkecultureThe Best Cheese at Trader Joe'sBy Tia KeenanPhotography by Alex LaucookingThe Best Thing to Do to Your Trader Joe’s Cheese? Marinate ItBy Tommy WernercultureThe Best Frozen Trader Joe's Apps for Your New Year's Eve PartyBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Alex Beggs"]}