{"id": "df18ea0dc83a24bd8b8a7dbabc0d1083", "url": "https://www.bonappetit.com/story/how-to-make-cranberry-sauce", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "How to Make Cranberry Sauce, Whether You're Going for Super Simple or a Little Bit Try-Hard | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Cranberry Sauce, Whether You’re Going for Super Simple or a Little Bit Try-HardSave your fussing for the pie–cranberry sauce can be easy!By Priya KrishnaOctober 25, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we make with our eyes closed.My mother’s Thanksgiving dinner is the stuff of legend. Seriously, it’s the talk of the Dallas Indian aunty community during the holidays. It’s probably because my mom takes the meal very seriously, pulling out all her greatest hits: matar paneer stewed in a heady tomato gravy, sweet and tangy fenugreek-coated butternut squash, smoky roasted aloo gobhi, and puffs of puri, an Indian fry bread.While there isn’t a turkey in sight (because we all know no one actually wants that), the somewhat curious mainstay on our Thanksgiving table is the bowl of unadorned, burgundy-red cranberry sauce. We’re not talking the canned stuff—this is homemade cranberry sauce, and it’s probably the least elaborate dish on the table.How did it get there? A few years ago, my mom was looking for a festive, seasonal, chutney-like condiment to put on the Thanksgiving table to counterbalance all those spice-heavy dishes. Then she remembered the cranberry sauce she had at a family friend’s place: Sweet, sour, good on everything, it was kind of like...well...chutney. So she bought a bag of frozen cranberries and followed the instructions on the back of the packet. The recipe was stupid simple. White sugar, cranberries, a little orange zest. It was an instant hit, and now we can’t have Thanksgiving without it.When I emailed my mom for the cranberry sauce recipe, she responded, “It seems silly to just write down the recipe from the back of the bag. Is that what you want me to do?” Yep.So how do you make traditional cranberry sauce?My mom’s loosely adapted version has less sugar (my family loves the pucker-inducing tang!), plus orange zest, for a little zip. To make it, combine one 12-oz. bag fresh or frozen cranberries, ¾ cup granulated sugar (you can also use some brown sugar in its place for a deeper, more caramelly flavor), 1 cup water, and 1 Tbsp. orange zest (and, if you’re feeling frisky, 1–2 Tbsp. orange liqueur like Cointreau or Grand Marnier) in a medium saucepan. Cook over medium heat until the cranberries start to pop and get soft and jammy—they should easily coat the back of the spoon—stirring frequently so nothing sticks and burns at the bottom. This takes about 10 minutes. Turn the heat off and let the cranberry sauce cool to room temperature (or you can refrigerate it! Dealer’s choice).In my family, it has to be this basic version. I’ve tasted all the gussied-up cranberry sauces, with various spices and infusions and toppings. But to us, simple is best. Put the rosemary and chile flakes on the vegetables and that fancy nut topping on the pie. Cranberry sauce requires no dressing up.How do you make cranberry sauce better?While I’ll stand by my opinion that when it comes to the best cranberry sauce, simper is better, there are endless ways to fancify it. To name a few ideas…Swap in fresh orange juice for some of the water (or, for a more dramatically ORANGE effect, add a chopped-up orange, skin and all, to simmer along with the cranberries—just be sure to boil it first to get rid of some of its pithy bitterness)Go savory and spicy: Before you add the cranberries and water, sauté chopped shallot and jalapeño until they’re beginning to softenOr, on the other end of the spectrum, stay sweet, but use maple syrup or honey in place of some of the sugarToss in spices (a cinnamon stick, smashed fresh ginger, crushed red pepper flakes, a bay or cinnamon leaf, allspice, black peppercorns, a split vanilla bean, dried hibiscus) or woody herbs (thyme, rosemary) and let them infuse the sauce with flavorAdd a pat of butter for richness and bodyOr toss in a handful of dried fruit, like chopped figs, tart cherries, or golden raisins, to plump up as the cranberries release their juicesStir in finely chopped raw fresh cranberries and candied ginger at the end for zing and crunchFinish with lemon juice and finely chopped mintWhile these are not necessarily better iterations of cranberry sauce, they might be more at home on your Thanksgiving table than my family’s pared-down version.No matter what sort of cranberry sauce you make for your Thanksgiving meal, don’t let it be something you stress about. Spend your time on literally anything else—the latticework on the pie, making sure your stuffing doesn’t over-dry in the oven, selecting the wine. You have our permission to serve plain ol’ cranberry sauce. It’s what the people want.This article was originally published on November 12, 2019.Explore Bon AppétitIt's That SimpleThanksgivingCranberryCranberry SauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-12", "author": ["Condé Nast", "Priya Krishna"]}