{"id": "df34b847157d6e6f1543c1aea3c338c7", "url": "https://www.bonappetit.com/recipe/wheat-berry-bowl-with-merguez-and-pomegranate", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Wheat Berry Bowl with Merguez and Pomegranate Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueWheat Berry Bowl with Merguez and PomegranateBy Jenny RosenstrachJanuary 9, 20184.9(8)Read ReviewsTriangleEmailPinterestPrintBobbi LinEmailPinterestPrintEmailPinterestPrintIf you cooked a big batch of grains on Sunday, you’re halfway to a weeknight dinner. You can use any cooked grain for this recipe, such as freekah, barley, or farro. No merguez? Sub with sweet Italian pork or chicken sausages instead.Ingredients4 servings 2cups wheat berriesKosher salt4tablespoons extra-virgin olive oil, divided1pound merguez sausage, casings removed1garlic clove, finely grated½cup plain whole-milk Greek yogurt2tablespoons fresh lemon juice, divided2teaspoons za’atar, plus more for servingFreshly ground black pepper½cup pomegranate seeds¼cup coarsely chopped mint, plus leaves for serving4scallions, thinly sliced, divided3Persian cucumbers, thinly sliced into roundsSpecial IngredientZa’atar, a spice blend of herbs, sumac, and sesame seeds, is available at Middle Eastern markets, specialty foods stores, and online.PreparationStep 1Simmer wheat berries in a large saucepan of salted water until grains are tender and hulls have just started to split open (cook time will vary and can take up to 1 hour). Drain and rinse under cold water, then thoroughly drain again. Transfer to a large bowl.Step 2Meanwhile, heat 1 Tbsp. oil in a medium skillet, preferably cast iron, over medium-high. Cook sausage, breaking up with a wooden spoon, until browned and crisp, 8–10 minutes. Transfer to a medium bowl with a slotted spoon.Step 3Mix garlic, yogurt, 1 Tbsp. oil, 1 Tbsp. lemon juice, and 2 tsp. za’atar in a medium bowl; season with salt and pepper. Set yogurt sauce aside.Step 4Add pomegranate seeds, chopped mint, half of scallions, remaining 2 Tbsp. oil, and remaining 1 Tbsp. lemon juice to bowl with wheat berries and toss to combine. Season with salt and pepper.Step 5Divide wheat berry mixture among bowls and top with cucumbers, sausage, and remaining scallions. Drizzle with reserved yogurt sauce, scatter mint leaves over, and sprinkle with more za’atar.How would you rate Wheat Berry Bowl with Merguez and Pomegranate?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis is fabulous, easy, and different from your everyday fare. I simplify it by using farro, which cooks quickly, and by purchasing my tsatziki sauce, which eliminates the sauce-making step. My family loves it served over dressed greens. AnonymousAlexandria, VA11/12/2020So surprisingly filling!! I'm a vegetarian so I subbed out the merguez for Beyond sausage (Italian), cooked it to a crisp and it complimented the dish perfectly. Refreshing & packed with flavor - highly recommend!AnonymousLos Angeles, CA6/22/2020i don't know why, but i wasn't expecting a lot from this recipe, but it actually turned out AMAZING! the flavors and contrasting textures are amazing (shout out of the cucumbers providing crunch up against the chewiness of the rest of the flavors).\n\nin contrast to the other reviewer of this, i used the full two teaspoons of za'atar and loved it.\n\nthings i did differently: i made my own merguez with a spice mixture and ground lamb cause my local grocery store doesn't carry merguez sausages, i don't think that added too much time to the process. i also used barley instead of wheat berries, because again, that's what i have access to (which i cooked with garlic and chicken stock). i also didn't have a pomegranate, however, i would have loved to have one, and i could see how this dish would pop even more with the pomegranate seeds.\ni'm in the middle of eating this, and i already am excited for leftovers during lunch tomorrow.bees???2/6/2019hey! frequent bon appetit recipe maker here. First one i've found where i've had multiple gripes, but don't let that deter you from an otherwise delicious and easy recipe. \n\n1. first gripe is very big and everyone should definitely pay attention to this. DO NOT, do not put 2 teaspoons of za'atar in a half cup of yogurt. i was skeptical and did it with on teaspoon of za'atar and it was MORE than enough. i recommend using a half teaspoon to a teaspoon depending on how spiced you want it\n\n2. this isn't too much of a gripe as it is a matter of process. just make the wheat berries a while before you mix this thing. don't rinse them in cold water. that's so weird and makes them slimy. Anonymousnew york city12/12/2018Explore Bon AppétitRice and Grain BowlWheat BerryRice & GrainsSausageMeatZa'atarHerbs & SpicesPomegranateFruitQuickEasyWeeknight MealsMainHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Jenny Rosenstrach"]}