{"id": "df4bbcb838687d27683abc3084cdfa82", "url": "https://www.bonappetit.com/story/beef-stir-fry", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "This Beef Stir-Fry Is The Perfect Way to Send Off Summer  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Stir-Fry Recipe For When You Can't Focus on Dinner But Still Want It to Taste GreatA ginger and lemongrass marinade provides a weeknight-friendly last hurrah of summer flavor.By Chris MoroccoSeptember 25, 2018FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Olivia Anderson, Prop Styling by Bea ChastkaFacebookTwitterEmailI love to cook, but, after spending a full day in the Bon Appétit test kitchen, the last thing I need to do is start chopping onions all over again when I get home. That means dinners can be a bit scrappy: reheated leftovers from my weekend prep, fridge-dump salads, or just taking whatever I can find and putting a scoop of cottage cheese on it. It’s a tricky time of day, trying to get dinner together while my kids scheme to avoid bedtime, suddenly intensely curious about what I am cooking, how MY day was, and whether Robin Hood and other favorite characters are “real,” all of which would be cute if they didn’t need to be asleep.This is a beef stir-fry that I can actually handle cooking from start to finish on a weeknight. I can watch our three-year old demonstrate Ninjago spins while I grate the aromatics for the marinade, and I can trim beans while retaining enough brainpower to decide whether our five-year-old will be allowed a real bow and arrow for his Robin Hood Halloween costume (no). I only truly need to pay attention for a minute while slicing the meat, long enough that they might slip past the kitchen, but short enough that they won’t get far.The key to slicing the short ribs (these may also be labelled Denver steak depending on your butcher) is to cut thinly across the grain. Chicken (thinly sliced) or fish (cut into chunks) would also work just fine. Put it in a bowl and grate the lemongrass, chile, ginger, and garlic right over the top. Add the sesame oil and brown sugar and toss to combine. Let that sit at least 10 minutes or up to 1 hour.Meanwhile, prep your veg. I like to slice the green beans in half-ish lengthwise so they cook a bit more quickly. Transfer them to a bowl, and, unless you are into perfection, slice the corn kernels off right into that bowl (a few scatter across the counter, no big deal).Cook the meat in two batches so each one can get a really good sear, then add the veg, which only need a few minutes to go from raw to vivid and crisp-tender. Add the meat back to the skillet along with the tomatoes and half the basil and cook, tossing everything to let the aromatics in the marinade hit everything in the skillet as they get knocked around.Serve topped with the rest of the basil, a sprinkle of flakey salt, and lime wedges. It's a last hurrah of summer flavor with all the bright aromas of lemongrass and ginger on top. Best of all, it doesn’t require a sauce since there is so much flavor in the marinade. My kids know that anyone still awake and skulking around the kitchen has to eat whatever I make, so by the time my wife and I sit down for dinner, they may not be asleep, but they're definitely in their rooms.It's beef stir-fry time:Beef Stir-Fry with Green Beans and TomatoesOlive oil works great in stir-fry recipes; its sharp grassy notes complement flavors like lemongrass and basil.View RecipeExplore Bon AppétitHealthyishStir-FryWeeknightShort RibPeaLemongrassRead MorecookingA Spicy Pork Tenderloin Bowl That's So Easy You Hardly Need This RecipeBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-25", "author": ["Condé Nast", "Chris Morocco"]}