{"id": "df58e17716d9362f41cd922589401c52", "url": "https://www.bonappetit.com/recipe/roadie-hoagie", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Roadie Hoagie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueRoadie HoagieBy Sohla El-WayllyOctober 7, 20194.9(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintThe flavors in this sandwich get more delicious and robust as it sits. Assemble it in the morning, and when lunchtime comes around, the peppery mustard greens will have become tender and mild, while the bread and mozzarella will have soaked up the briny olive vinaigrette. It can hang out and get squished in the bottom of your bag for hours and will taste all the better for it. (For extra protection from vinaigrette spillage, place in a reusable plastic bag first.) This dish is part of the Bon Appétit Guide to Actually Enjoying Your Lunch at Work. Find more recipes, tips, and tricks here.IngredientsMakes two 10\" sandwiches1lemon3Tbsp. red wine vinegar1Tbsp. chopped parsley1tsp. kosher salt½tsp. crushed red pepper flakes½tsp. dried oregano½tsp. sugar¼cup extra-virgin olive oil115.5-oz. can cannellini beans, drained, rinsed210\" hero rolls, split in half lengthwise, toasted1bunch mustard greens, Tuscan kale, or escarole, stemmed, torn into small pieces (about 8 cups)½cup Castelvetrano olives, pitted, chopped1Tbsp. chopped peperoncini6oz. low-moisture mozzarella, cut into ¼\"-thick slices3oz. provolone, preferably aged, shaved with a vegetable peeler (about ⅔ cup)PreparationStep 1Zest lemon into a medium bowl. Cut lemon in half and squeeze juice into same bowl. Add vinegar, parsley, salt, red pepper flakes, oregano, and sugar and whisk to combine. Whisking constantly, stream in oil until dressing is emulsified. Reserve half of dressing in a small bowl.Step 2Add beans to remaining dressing and mash with a fork or potato masher until mostly mashed. Divide dressed beans between bottom halves of each roll.Step 3Place greens in same bowl beans were in (no need to wipe out). Add 2 Tbsp. reserved dressing and massage with your hands until greens are barely wilted. Pile on top of beans.Step 4Toss olives and peperoncini with remaining reserved dressing in same bowl. Spread olive mixture across top half of each roll. Layer mozzarella and provolone over olive mixture.Step 5Close sandwich and gently press closed. Tightly double-wrap sandwich in foil. Sandwich can sit unrefrigerated at room temperature for up to 8 hours.How would you rate Roadie Hoagie?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI doubled everything for 4 days of small sammies for two people. It's the best sandwich I've ever made. Everything held up in the fridge (the beans, the greens). I got good mozz but couldn't get good provolone and it was better than fine. I ate one every day last week monday-thursday and still want one more. Truly made my workday better.JessaminRaleigh, NC2/21/2022I love meat, I often eat it with all three meals, and even for snakes in between. I was a little cautious of this sandwich but it’s amazing. It does more than hold its own, it shines brightly. It doesn’t get soggy and it’s got such a delicious  and unique flavor. Defiantly one of my favorite go to sandwiches. KrugDallas2/20/2022Y’all need to repost this so people make it during the summer for outdoor physically distanced adventures or backyard picnics. It’s amazing. I made it using a round boule loaf and arugula from my garden, because that’s what I had and it’s a pandemic substitution. Everything else was available from my fridge or pantry. We have one vegetarian household member who was thrilled to finally have a delicious meat free sandwich, and we were all very happy with the flavor components. Other meat free sandwich recipes, like eggplant, have been disappointingly bland and boring. I suggest one could even eat the bean and olives mixed together as a salad over greens, if you didn’t have or want the bread. I did drizzle a bit of olive oil on the top bread piece, just to give it a little more cohesion with the rest of the layers. Would totally make again!AnonymousSWFL7/8/2020SO good! I made the beans ahead and constructed my sandwich for lunch two days in a row. I’ll definitely make this again AnonymousAustin5/6/2020Excellent sandwich...but living in California I just had to add Jalapeño peppers and Cilentro. When my Broccoli is in the garden I will use the leaves with the Kale.  Very adaptable sandwich. Northern California in the Country.3/12/2020This was so so so yummy! I was skeptical that the components would be soggy by the time lunch came around but it was perfect! I will definitely be making this again!AlyCMend12/7/2019Explore Bon AppétitSandwichCheeseMozzarellaBeanVegetableCannellini BeanWhite BeanMustard GreensLeafy GreensQuickEasyVegetarianNut-FreeLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-07", "author": ["Condé Nast", "Sohla El-Waylly"]}