{"id": "df5c8ec2b167481c6272e1cdbd17ebf8", "url": "https://www.bonappetit.com/recipe/buttered-potatoes-with-salted-lemon", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Buttered Potatoes With Salted Lemon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueButtered Potatoes With Salted LemonBy Andy BaraghaniMarch 15, 20225.0(5)Read ReviewsTriangleEmailPinterestPrintGRAYDONHERRIOTTEmailPinterestPrintEmailPinterestPrintThis comforting dish mimics the fall-apart potatoes that soak up the savory stewed meat juices in a Moroccan tagine, but you can also just think of it as a warm potato salad. Small golden potatoes are boiled until fluffy, then dressed with a combination of bright preserved lemons (plus their brine) and rich butter, which mellows their punch, to create a salty, creamy side. To make the dish dairy-free—or to serve it at room temperature without the fat setting—swap in ⅓ cup extra-virgin olive oil for the butter.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonColander$11 At AmazonSmall Bowl$13 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAIngredients4 servings2lb. small waxy potatoes (such as peewees, fingerlings, or new potatoes)Kosher salt1preserved lemon, seeds removed, finely chopped, plus 2 Tbsp. (or more) brine½cup (1 stick) unsalted butter, cut into pieces1small bunch chives or 3 scallions, thinly sliced1cup coarsely chopped dillFreshly ground black pepperPreparationStep 1Place potatoes in a large pot of salted water and bring to a boil. Cook until potatoes are very tender and easily pierced with a paring knife, 10–15 minutes, depending on the size of your potatoes. Drain and let cool 10 minutes.Step 2Lightly crush potatoes with your hands (or press with the bottom of a small bowl); transfer to a serving bowl.Step 3Add preserved lemon, brine, and butter to bowl with potatoes and toss until butter is melted and potatoes have soaked up dressing (they should taste extremely lemony). Add chives, dill, and lots of pepper and toss again evenly distribute. Taste potatoes and add more brine and season with more salt and/or pepper if needed.Excerpted with permission from ‘The Cook You Want to Be: Everyday Recipes to Impress’ Copyright © 2022 by Andy Baraghani. Published by Lorena Jones Books, an Imprint of Penguin Random House.\n\nBuy on Amazon or Bookshop.orgHow would you rate Buttered Potatoes With Salted Lemon?Leave a ReviewTell us what you thinkReviews (2)Back to TopTrianglethe lemon butter is genius - I pulled the pasta water trick and scooped up a bit of the potato starchy boiling water to emulsify the butter lemon sauce, it worked well.  Was creamy and bright and fresh and vaguely potato salady.. AnonymousIrvington, NY3/22/2022I added some canned chickpeas because I had not quite enough potatoes. It was amazing! and so easy.Hannah BPortland, OR3/21/2022Explore Bon AppétitDinnerSide5 Ingredients or FewerEasyQuickVegetarianNut-FreePotato SaladSaladPotatoVegetable Fingerling PotatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Andy Baraghani"]}