{"id": "df5da23972fc23f9ab72f9415cb192ec", "url": "https://www.bonappetit.com/recipe/classic-cannoli", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Classic Cannoli Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesClassic CannoliBy Victoria GranofDecember 5, 20183.2(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintVictoria Granof, who developed this cannoli recipe, typically makes hers with sheep’s-milk ricotta. If you can find it, skip the goat cheese and cow’s-milk ricotta and use a total of 27 oz. sheep’s-milk ricotta. Alternatively, if you don’t want to use goat cheese, use a total of 27 oz. cow’s-milk ricotta. But try not to make this with supermarket ricotta if you can avoid it. Remember, the higher-quality ingredients you can find, the better the cannoli will be.IngredientsDough5tsp. superfine sugar½tsp. ground cinnamon½tsp. kosher salt2cups 00 flour, plus more for surface2Tbsp. plus 1 tsp. chilled vegetable shortening or high-quality lard2large eggs2Tbsp. apple cider vinegar2Tbsp. (or more) dry or sweet Marsala or white wineFilling1½lb. fresh cow’s-milk ricotta2oz. fresh goat cheese, room temperature1cup superfine sugar1.5 oz. semisweet chocolate, chopped, or mini chocolate chipsKosher salt (optional)AssemblyVegetable oil (for frying; about 8 cups)All-purpose flour (for surface)Candied orange peel, finely chopped raw pistachios, and/or finely chopped chocolate (for serving)Powdered sugar (for dusting)Special EquipmentA deep-fry thermometer; a 4\"-diameter cookie cutter; 4 cannoli tubes; a large disposable pastry bag; large round piping tip (optional)PreparationDoughStep 1Whisk sugar, cinnamon, salt, and 2 cups 00 flour in a large bowl to combine. Add shortening and work into dry ingredients with your fingers until mixture is crumbly and no pieces of shortening are larger than a lentil. Separate white from 1 egg and place into a small bowl; set aside. Place yolk in another small bowl and add whole egg; lightly beat to combine.Step 2Make a well in the center of dry ingredients and pour in egg yolk mixture. Using a fork, gradually work in dry ingredients, mixing in a circular motion to nudge dry ingredients into well, until a thick paste forms (you will not have mixed in all of the dry ingredients). Add vinegar and wine to paste in well and continue mixing in dry ingredients until fully incorporated and dough becomes hard to mix (if dough gets too hard to mix, knead in bowl with your hands to work it in). Transfer dough to a lightly floured surface and knead until dough is very supple, about 3 minutes. Wrap in plastic and chill at least 1 hour.Step 3Do Ahead: Dough can be made 12 hours ahead. Keep chilled.FillingStep 4Press ricotta and goat cheese through a fine-mesh sieve into a large bowl by scraping firmly with a rubber spatula. Mix in sugar and chocolate until just combined (you want the mixture to stay aerated and fluffy). Taste filling and add a two-finger pinch of salt if you think it needs it.Step 5Cover bowl and chill filling at least 1 hour to give sugar time to dissolve.Step 6Do Ahead: Filling can be made 12 hours ahead. Keep chilled.AssemblyStep 7Pour oil into a medium saucepan fitted with thermometer to come 2\" up the sides. Heat over medium-high until thermometer registers 375°.Step 8Meanwhile, divide dough in half; rewrap one half and chill until ready to use. Roll out remaining half on a lightly floured surface to an 11\" round about 1/16\" thick. (You want it thinner than pie dough but not as thin as phyllo—too thick and it’ll become challenging to chew; too thin and the dough won’t develop its characteristic bubbled surface.) Punch out rounds with cutter (you should have 5). Reroll scraps to yield 1 more round.Step 9Lightly beat reserved egg white to loosen. Working one at a time and covering remaining rounds with plastic wrap, roll out 4 rounds to about 5x3½\" ovals; prick each one in several places with a fork. Using your fingers, lightly wipe some egg white over the edge of one long side. Wrap ovals loosely around cannoli tubes, overlapping long side with egg wash over the other long side; gently press seam to flatten and adhere. Transfer to a rimmed baking sheet as you go.Photo by Chelsie Craig, Food Styling by Kate BuckensStep 10Line another rimmed baking sheet with a double layer of paper towels. Fry shells with tubes, gently encouraging them to move around in the oil to color evenly, until deep golden brown, 4–5 minutes. Transfer to prepared baking sheet. Let cool slightly, then slip shells off of tubes. Let tubes and shells cool completely. Repeat process 2 more times, frying 4 at a time, to yield 12 cannoli shells total.Step 11Fill pastry bag with filling and snip off end (or use large round tip). Pipe into shells, working from the center to one end, then turning shell around and piping from the center to the opposite end.Photo by Chelsie Craig, Food Styling by Kate BuckensStep 12Decorate exposed filling on each end with candied orange peel, pistachios, and/or chocolate. Generously dust cannoli with powdered sugar. Consume immediately!How would you rate Classic Cannoli?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleNOTE: I have not used this specific recipe, but it looks pretty straightforward and similar to others. In reading through it I saw a missing tip that I received when making my first cannoli:  Strain the cheese in cheesecloth overnight (or at least a few hours) to remove excess water. That may have helped a user or two with the filling texture.\nJFloSilicon Valley, CA6/18/2021I was intrigued. I love cannolis. But this sounds like WAYYYYY too much work. I usually don't mind if a recipe calls for a reasonable amount of my time (and $) if I know the end results will be worth it, but from most of the reviews it sounds like not. I love cannolis, but I'd rather pay someone else to do this much work and enjoy my free time. Walk in the park and dessert anyone?? 🙂Ferment4LifeHalifax, NS6/16/2021Waay too much sugar in the filling!  Made homemade ricotta and had to trash it.  Very disappointing filling  recipe.Anonymous5/9/2021Too much sugar in ricotta filling. Dough is way too dry. AnonymousToronto2/14/2021I cant see whether chocolate matches the filling.. does it really adds to the filling? Id rather add something lime-y, some lime zest or something like that. Anyway Ill try the recipe with the possible brazillian ingredients soonKelly HigaSão Paulo, Brazil12/6/2020This recipe just did not work for me :( but the shells did taste nice after fried.\n\nThe part of the dough stuck over the closure would always bubble up. The ricotta mixture ended up too loose too... not as stiff and holding its shape as I expected it to.AnonymousLondon, UK12/30/2019My mother-in-law and I made these over the weekend.  The ingredients were easy to find and the process was a lot of fun.  My in-laws are Italian and have historically been very particular about food so I was hesitant to serve them at dinner.  As it turns out, everyone loved them!  Will def make again. AnonymousBay Area, CA 11/15/2019Explore Bon AppétitPastriesDessertItalianEuropeanRicottaCheeseGoat CheeseBakingEasterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-05", "author": ["Condé Nast", "Victoria Granof"]}