{"id": "df5e822d8e38340c447a03976369bc4c", "url": "https://www.bonappetit.com/recipe/raw-and-crispy-kale-salad-with-ginger-and-coconut", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Raw and Crispy Kale Salad With Ginger and Coconut Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueRaw and Crispy Kale Salad With Ginger and CoconutBy Andy BaraghaniOctober 20, 20204.8(23)Read ReviewsTriangleEmailPinterestPrintPhotograph by Kelly Marshall, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintIn this refreshing Thanksgiving salad, half the kale gets crisped up in the oven like chips while the rest is tossed with a gingery soy-tahini dressing. Some cut-up grapefruit goes in, and there’s extra crunch from toasted coconut flakes. The grapefruit adds a touch of bitterness that goes well with the salty soy-and-ginger dressing, but oranges and tangerines also work.Ingredients8 Servings4bunches Tuscan kale (1½ lb.), ribs and stems removed2Tbsp. plus ½ cup grapeseed or vegetable oilKosher salt⅓cup fresh lemon juice3Tbsp. low-sodium soy sauce or tamari3Tbsp. tahini2tsp. honey2tsp. toasted sesame oil2tsp. finely grated peeled ginger1small garlic clove, finely grated1medium shallot, thinly sliced1small red or green Thai or serrano \tchile, thinly sliced1½cups unsweetened coconut flakes2medium grapefruits¾cup cilantro leaves with tender stems or mint leaves, torn if largePreparationStep 1Preheat oven to 375°. Divide half of kale between 2 parchment-lined baking sheets. Drizzle each with 1 Tbsp. grapeseed oil, season with salt, and toss to coat. Spread out in a single layer and bake until crisp and lightly browned in spots, 8–10 minutes. Set kale chips aside.Step 2Meanwhile, whisk lemon juice, soy sauce, tahini, honey, sesame oil, ginger, garlic, and remaining ½ cup grapeseed oil in a large bowl. Mix in shallot and chile, season dressing lightly with salt, and let sit at least 5 minutes.Step 3Toast coconut in a dry medium skillet over medium heat, tossing once or twice, until most flakes are golden, about 5 minutes. Transfer to a small bowl.Step 4Using a paring knife, remove peel and white pith from grapefruits. Slice however you want, working to avoid cores.Step 5Tear remaining raw kale into bite-size pieces and add to bowl with dressing. Season with more salt and give kale a good scrunch to soften. Add grapefruit, coconut, cilantro, and reserved kale chips and gently toss to combine.How would you rate Raw and Crispy Kale Salad With Ginger and Coconut?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleMy husband made fun of me for buying so much kale, but he ate his words because he was stunned by how good this was. I omitted the coconut and added chickpeas, but kept everything else the same. Really, really great. Definitely will make again.AmandaDetroit, MI1/26/2021What a dazzling winter salad. The dressing, as everyone else mentioned, is outstanding. I'm docking one star because the addition of the serrano pepper was extremely controversial at this dinner table. Without the chile, this salad would be broadly popular— refreshing, yet somehow deeply satisfying — but the waves of heat made it unpalatable to some. Yet everyone loved the textures, colors, and balance of flavors.Kevin ZSan Diego, CA12/4/2020This dish was delicious - all the tastes are present. Recipe pretty easy to follow. My guests loved it. Thanks for creative ways to serve greens. MillieCalifornia, Mo11/29/2020This salad was my favorite dish at the Thanksgiving table. All of the flavors worked really well together. I wasn't really sure how to add in the kale chips...tossed they get chewy, topping the salad just hid all the other colors and textures. I will make this recipe again, just maybe omit or save the kale chips for snacking.Nicole STruckee, CA11/27/2020Made this recipe for Thanksgiving, as I'm always disappointed by the salads made as an afterthought side \"because we thought we should.\" While it's a little more effort than the chop-and-toss status quo, I really loved this salad and look forward to making it again! It's got great texture and the creamy umami rich dressing pairs beautifully with the sharpness of the grapefruits.TrishaPortland, OR11/27/2020This salad was a pleasant surprise.  The grapefruit with the dressing was delightful.  I would use this salad dressing again and again.  I originally made this salad because I had all of the ingredients and didn't want to go out of the house.  Was not expecting the flavors to work so well together.  It was easy to make and absolutely delicious.  If, for no other reason, you should try this for the dressing.AnonymousDallas, TX11/24/2020Explore Bon AppétitSaladKaleLeafy GreensVegetableGingerHerbs & SpicesCoconutFruitFallSideDairy-FreeVegetarianKetoHealthyishThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Andy Baraghani"]}