{"id": "df71948bdfd64ed26d7eac424493c0c2", "url": "https://www.bonappetit.com/recipe/fridge-clean-out-nabe-with-mushroom-dashi", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "Fridge Clean-Out Nabe With Mushroom Dashi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueFridge Clean-Out Nabe With Mushroom DashiBy Christina ChaeyOctober 24, 20204.3(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintWhen associate editor Christina Chaey is short on time, she opts for a quick nabe, or hot pot, using her beloved Japanese donabe as a catchall for whatever vegetables she needs to use up. The ingredients listed in the recipe are merely suggestions; you could easily use kabocha squash or sliced sweet potatoes in place of the butternut, carrots in place of the turnips, or broccoli florets instead of (or in addition to) leafy greens. The vegan mushroom dashi is made by steeping meaty shiitakes and umami-rich kombu in water overnight (like cold-brew coffee) and useful to have around for making light soups on a whim.Ingredients1 - 2 ServingsMushroom Dashi4dried shiitake mushrooms14x3\" piece dried kombuNoodles and Assembly2oz. dried udon or soba noodlesKosher salt1Tbsp. mirin (sweet Japanese rice wine)1Tbsp. soy sauce12-oz. piece butternut squash, peeled, halved, seeds removed, sliced ½\" thick2small hakurei or baby turnips, trimmed, cut into quartersA big handful of greens (such as baby bok choy, kale, or Swiss chard), thinly sliced4oz. firm or extra-firm tofu, patted dry, cut into ½\"-thick pieces1scallion, white and pale green parts thinly sliced into 2\"-long pieces, dark green parts thinly sliced on a diagonalToasted sesame oil and shichimi togarashi (for serving)PreparationMushroom DashiStep 1Combine mushrooms, kombu, and 2½ cups cold water in a 1-qt. jar or small bowl. Cover and chill until dashi takes on a light golden hue, at least 8 hours or overnight.Step 2Strain dashi into a clean jar or bowl. Squeeze mushrooms to release excess liquid into jar, then remove and discard the woody stems; thinly slice mushroom caps and reserve. Discard kombu.Step 3Do Ahead: Dashi can be made 2 days ahead; cover and chill. Cover and chill rehydrated mushrooms separately.Noodles and AssemblyStep 4Cook noodles in a medium saucepan of boiling salted water according to package directions. Drain in a colander, shaking off excess water, and set aside.Step 5Pour dashi into a 1.5–2-qt. donabe or small saucepan and stir in mirin and soy sauce; season with salt. Bring to a simmer over medium heat. Add squash and turnips, cover, and cook until vegetables are almost completely tender, 5–7 minutes. Uncover; add greens, tofu, white and pale green parts of scallions, and reserved mushrooms. Cover and cook until greens are wilted, tofu is warmed through, and squash and turnips are tender, about 2 minutes.Step 6Add reserved noodles to donabe and top with scallion greens. Drizzle with oil and sprinkle with shichimi togarashi.How would you rate Fridge Clean-Out Nabe With Mushroom Dashi?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis was very good! I used what I had at home, including frozen udon, a few shrimp, broccoli, white sweet potato, and spinach. I found the broth to be lightly flavored, even after soaking for 24 hours, so I added ample salt, as well as the mirin and soy from the recipe. Definitely go for all the toppings, including sesame seeds/oil and scallions. For a cold day, it was a delicious and light dinner with leftovers for lunch. Next time, I'd like to include the tofu for the extra protein.AnonymousWashington, DC1/19/2022I mean… DELICIOUS! it’s cold here and i was looking for something just like this and happen to have literally all of the recommended ingredients, so I didn’t even have to go to the store (bonus!). I love a mushroom dash i vs the traditional bonito dashi, I tend to shy away from recipes using bonito, or simply replace it w/the mushroom dashi. It’s a personal preference due to the smoky-ness of bonito. This was clean, comforting delightful!angelitacarmelita Fredericksburg, VA12/4/2021Being stuck at home gave me the time and desire to experiment. Typically Japanese cuisine is the last cuisine I would try at home. Glad I tried this recipe. Now I know I can make Dashi, which seems to be the foundation of many Japanese soups. The resulting soup was clean, simple yet delicious. The greens and soba noodles - in the broth of course - were the best part. Used spinach for the greens which worked well. Would like next time to try bok choy or cabbage. . I may try a few shrimp and see how that goes. Refrained from the togarashi- to me it muddies the clean flavors. Give this recipe a try if you have never made home style Japanese food before!  EssieDee Stamford CT12/13/2020In true Japanese fashion, this soup is very, very simple and focuses on the flavors of each ingredient rather than trying to create something more harmonious. I found that even with an overnight soak, I craved more flavor from the broth and ended up adding instant dashi powder to the mix.\nAs a catchall dish, I think this works if you're very into each item being the star as you're eating it. Not bad, not amazing. Still a warm and soothing easy meal at the end of the day.Nikole SoteloSeattle11/2/2020Explore Bon AppétitSoupSoups and StewsJapaneseEast AsianAsianSoba NoodleNoodlePasta & NoodlesUdon NoodleKombuSeaweedOther IngredientsEasyWeeknight MealsQuickMainDairy-FreeVegetarianVeganHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-24", "author": ["Condé Nast", "Christina Chaey"]}