{"id": "df798a2590c76c14ab1b12efae165dbd", "url": "https://www.bonappetit.com/recipe/spiced-coconut-chicken-rice", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Spiced Coconut Chicken Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueSpiced Coconut Chicken RiceBy Shayma Owaise SaadatFebruary 9, 20214.6(200)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food Styling by D'Myrtrek BrownEmailPinterestPrintEmailPinterestPrintIn this one-pot meal, fragrant basmati rice simmers with chicken, spices, and coconut milk until it’s absorbed all of the delicious flavors in the pot. It’s inspired by recipe developer and food writer Shayma Owaise Saadat’s love of pulao, a rice dish with variations all over the world, including her native Pakistan. (Find Saadat’s Chicken and Tomato Pulao recipe here!) For fluffy, perfectly-cooked rice, Saadat employs time-honored techniques she’s learned from family members over time: 1. Start with the highest-quality basmati (she likes Daawat and Zebra brands.) 2. Layer a kitchen towel between the pot and lid to prevent condensation from dripping down into the rice below, which leads to mushiness. 3. Be patient: As tempting as it is to peek at the rice as it cooks, keeping the lid on creates steam that produces fluffy, evenly cooked grains. Once you get the hang of the technique, the sky’s the limit: Use canned chickpeas instead of chicken for a vegetarian option, or swap the kale for spinach or sliced zucchini. Saadat will also sometimes add crushed cardamom, cinnamon sticks, or whole cloves to the pot along with the turmeric and cayenne.Ingredients4 servings1½cups basmati rice2Tbsp. grapeseed or vegetable oil1large shallot, finely chopped2cloves garlic, finely chopped1½lb. skinless, boneless chicken thighs (6–8)1tsp. ground turmeric½tsp. cayenne pepper2½tsp. kosher salt, divided113.5-oz. can unsweetened coconut milk½bunch Tuscan kale, ribs and stems removed, leaves thinly sliced crosswise into strips (about 2 cups)Store-bought sliced pickled red chiles (optional)Lime wedges (for serving)PreparationStep 1Place rice in a medium bowl and pour in cold water to cover. Agitate rice with your hands until water is cloudy. Drain and repeat until water is almost clear (about 3 times). Pour in water to cover rice by 2\"; let soak 30–45 minutes.Step 2Heat oil in a heavy pot with a wide base (preferably 10\") over medium-high. Add shallot and cook, stirring occasionally, until golden, about 3 minutes. Add garlic and cook, stirring until softened, about 1 minute.Step 3Add chicken, turmeric, cayenne, and 1½ tsp. salt. Cook, turning and moving around chicken thighs as needed, until chicken begins to turn opaque, about 2 minutes. Pour in ¾ cup water and bring to a simmer. Reduce heat to low, cover, and simmer, turning chicken once, until chicken is cooked through and very tender, about 20 minutes.Step 4Drain rice and add to pot with chicken, then add coconut milk and remaining 1 tsp. salt. Stir to incorporate and bring to a boil. Drape a kitchen towel over pot; cover with lid. Bring corners of towel up and over lid and secure with a rubber band. Reduce heat to lowest setting and cook, undisturbed, 15 minutes.Step 5Remove from heat and remove towel and lid. Arrange kale in an even layer over chicken and rice and cover with lid. Let sit until wilted, about 10 minutes.Step 6Divide chicken and rice among bowls. Top with chiles if using. Serve with lime wedges.How would you rate Spiced Coconut Chicken Rice?Leave a ReviewTell us what you thinkReviews (67)Back to TopTriangleVery yummy! This is going into our regular rotation. I followed the instructions exactly and had not trouble with the rice cooking through. I used a 12 in wide x 2.5 in tall stainless steel pan to cook and everything fit well. I also added garbanzo bean in addition to the chicken for added protein. For just two of us it make a lot but leftovers the first night and I repurposed the remaining rice this evening (chicken all gone by now) by charring some broccoli and carrots and mixing all together. Then I fried up a steak as the main dish. We would have both been happy to eat the leftovers another day if there was any left. Yum! Can’t wait to make it again. I’m considering trying making 1.5x the portions I’m a large durch oven for a group of 5+. We’ll see how it goes! Marci TNashville, TN3/22/2022I followed the recipe exactly and it came out perfectly! The texture of the rice was perfect, and the spicing was just right-very flavourful. We will definitely keep this in our rotation. It was a very tasty and satisfying one-pot meal. A keeper!AnonymousWinnipeg, Canada3/22/2022For those that got under cooked rice, it may be your pan size / height. I've cooked this numerous times, and it always comes out perfectly. Make sure to follow the rice soaking instructions for the longer time suggested. I cook mine in a 2.5 inch high x 12 inch wide Le Creuset.  For added color I also add a layer of halved cherry tomatoes, cut side down, and lots more shredded kale on top of those for the final step.  carolineDurham NC3/16/2022I agree with the reviewer who got undercooked rice.  I even added more water and cooked longer (at the expense of tenderness of the chicken) and the rice was still crunchy.Sara SchroeSan Francisco Bay Area3/14/2022This recipe’s easiness and taste is so good even though the rice was undercooked my family still loved it\nHanna from Ca, I’m with you, I can’t figure out how to cook so the rice comes out perfectly! I also used a Le Creuset Dutch oven with the towel but it was the worse rice I ever made! Undercooked and mushy all at the same time!\nHelp!JacintheCalgary, CA3/14/2022This recipe is a winner. One pot, easy to execute, cheap, and yummy for the whole family. I've made it twice, and I added a lot more kale at the end with still great results. Mind that the chicken and rice will stain anything it touches a highlighter-yellow from the turmeric.Herbal-TSan Antonio, TX3/10/2022This immediately went into our favorites pile- absolutely the best one pot dish I've ever made. So good I made it twice in one week. Doubled it the second time and it all worked just fine, just gave the rice 20 minutes. I threw in a whole big bag of spinach, too.\nFollowed the other reviews and added a dollop of greek yogurt and I won't eat this any other way now! I also tossed in a few pine nuts for crunch, highly recommend! KatieWilmington NC1/11/2022Wonderful spiced dish for winter! I was a little worried about the \"dish towel\" process, but everything cooked perfectly according to the directions. Will definitely be making this again - might add more kale next time, it always disappears! Mary P Washington, DC 1/4/2022My family and I love this recipe! We have made it probably five times now and it’s always a hit, with everyone going back for seconds (including my four-year-old). I echo other reviewers that it’s important to follow the process exactly, including the dish cloth. I make this with chicken stock instead of water but otherwise make no modifications. Would highly recommend for a tasty and easy dish!   Rachel British Columbia 12/10/2021LOVE this dish. I make it with chicken breasts, but that is our personal preference. I use pimentos instead of the chilies based on what I can find and add pistachios (or shaved almonds). The crunch is really nice!\n\nCurious what people have served this with and if anyone has made a vegetarian version!taylorsan francisco, ca11/5/2021This recipe is SO delicious! I’ve made it exactly as written 5 or 6 times now, adding the cinnamon stick and cardamom pods. My one year old loves it, as does my husband. But I need help - WHY does my rice always end up undercooked? I’ve tried everything - I soak it longer, I cook it longer, I always use the kitchen towel…. What am I doing wrong? I end up frantically pouring in more water/broth and setting it at a high simmer at the end for an extra 20 min. Is it my pan (Le Creuset)? My rice?… Is it me? Help!HannahOakland, CA8/13/2021Rice should never be cooked with the “curry” that accompanies it. The rice becomes soggy and that’s not good.  As a south Asian, I should have known better, even to try this.Kozhikodan GA7/3/2021Easy to prepare and comes out perfect each time. I have used several types of cooking pans with success, always cooking a bit longer than the recipe thoughKerryJax, FL5/6/2021I followed the recipe exactly, except for adding a cinnamon stick and two cardamom pods and using spinach rather than kale, but found that the rice was over cooked. I also salted the chicken before putting it into the pot. Otherwise, the dish was comforting and my kids surprisingly enjoyed the dish, which is no easy feat!AnonymousBrooklyn, NY4/22/2021This recipe is fantastic! We replaced the 3/4 cup of water with chicken broth and it helps make it even more flavorful! This one is definitely in our weekly rotation now. Definitely recommend following the other comments and adding cinnamon sticks. SageNorfolk VA4/13/2021Explore Bon AppétitPilafPakistaniSouth AsianAsianChicken ThighChickenPoultryCoconut MilkOther IngredientsRiceRice & GrainsEasyWeeknight MealsOne-Pot MealsMainGluten-FreeDairy-FreeHealthyishSimmerRamadanDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Shayma Owaise Saadat"]}