{"id": "df7abcd2a304cb777526d57c3186566b", "url": "https://www.bonappetit.com/story/advice-for-service-workers", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "We Could All Use This Therapist's Advice Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWe Could All Use This Therapist's Advice Right NowMelody Li works with patients in the hospitality industry, but she's got words of wisdom for us all. By Priya KrishnaMarch 19, 2020FacebookTwitterEmailIllustration by Igor BastidasFacebookTwitterEmailIt’s been an anxiety-inducing week—not least for the restaurant industry, which has seen closures and job losses on an unprecedented scale. By now, you’ve hopefully supported your favorite restaurants by purchasing gift cards or merch, and donating to hospitality non-profits. But what about the mental health of the workers affected? Many restaurant employees already face limited access to healthcare, despite being a population uniquely vulnerable to issues like addiction and anxiety, and right now, those resources may seem farther than ever. That’s why former food writer Melody Li, now a therapist, launched a network of therapists offering reduced-fee teletherapy for those being impacted most in the hospitality industries. We spoke with Li over the phone about the issues she sees the most, how you can help, and tips that everyone can use for staying mentally healthy during these tough times.If you work in restaurants and are looking for reduced-fee therapy, click here for more information, and if you are a therapist in the U.S. or Canada looking to be a part of Li’s network, you can join here.In the conversations you’ve been having with your hospitality clients, what are you hearing the most?The announcement to shut down bars and restaurants in the U.S. is still new, and so the uncertainty has been very unnerving for people. How is this going to impact their financial situation? Are restaurant workers able to support themselves in the interim? All those uncertainties are coming to the surface, and people are feeling a lack of safety net. For some of my clients, their work may not have offered health insurance, so they don’t know what options are available, which compounds the stress. They also feel responsible for their teams, families, and loved ones.What tips have you been giving them?For business owners, it’s important to be really clear about their awareness and concerns for their teams’ well being. Having regular but not overwhelming updates, and making themselves accessible for feedback. Talk about how to pool resources together, how to stay connected, how to help one another whether that’s childcare or grabbing groceries. Fortifying that sense of community is important because one thing I am seeing in combination with anxiety is isolation because of social distancing. This is a time to be proactive and put systems in place to help each other feel resourced and connected.General self-care strategies are especially important right now—staying healthy and spending some time outdoors. Maintain a sleep schedule and eat nutritiously—those are things that often get sidetracked in moments of crisis. Let’s also keep one another accountable by checking in, doing things like workout routines over Zoom together. It’s important to think about what you’re able to offer without overextending yourself, and to remind yourself that this is a temporary situation, and this is not forever.What about for those who have lost their entire livelihood in a matter of a week?The abruptness is often the most difficult part. This is a form of loss, and there is a grief process happening right now. You feel like you’re losing your community and autonomy and sense of purpose. I think it’s important to address the loss and make room to grieve. Disappointment and despair are normal, and you shouldn’t ignore it because those feelings can catch up later on. Hope is really important. Evaluate the things that we can still be grateful for, the things we are in control of, and the things that remain constant for us.I also like to strategize with the client on how they can gain resources. When a person is experiencing sudden loss, they can feel frozen and have difficulty thinking about ideas. That’s where a therapist can come in and say, “Let’s slow down and think about the resources that are available in your community.” Are there things that can act as safety nets like unemployment insurance or access to food pantries? Helping a client manage the day to day practicalities is a big part of this.A lot of people are buying gift cards and merchandise to support their local restaurants. How can we mentally and emotionally support our friends in the industry right now?You can reach out and offer your skills and connections, and see if any of that would be helpful for someone. And instead of constantly checking in—because that can be helpful for some people or burdensome for others—ask them, “Would you like me to check in? How frequently would you like me to check in?” Putting the power in that person’s world so they can have some control over what this check-in process looks like is important.For those (both in the restaurant industry and not) who don’t have access to therapy right now, how can they promote their own mental health from home?Don’t keep the news on a constant loop, and don’t check social media so frequently. There is so much sensationalizing material out there, and the frequency can be triggering or reinforcing. Also, what are we adding? What is good for our mind, body, and spirit? There are great meditation apps right now, like Headspace, and tons of online workouts.How would you suggest avoiding cabin fever?This could be a good time to exercise our creative brains. If there are art projects you have been putting off, creative writing you want to do, music, painting, this is the time to start engaging in that. If there are home improvement projects you have been putting off, books you have been wanting to read, actually celebrate that and say, “Now I have time to do these things.” Having a sense of purpose can be empowering and restorative.Do you have any strategies for coping with the day-to-day anxiety of this?Start the day with quiet time, where you do some quick writing, maybe planning out the day. Sometimes, thoughts and feelings play on loop because they have nowhere to go. Put them somewhere. Do something active. Let the body release anxious energy through movement. Establish a routine that feels balanced—productive but not overextending oneself. Set aside time to check in on friends and family. If you are doing anything that gives you stress, put those activities in 15-minute time containers. If we don’t create time containers, we can go down rabbit holes and put ourselves in stressful loops that can worsen anxiety.How do we create those small moments of joy for ourselves throughout the day?Give yourself permission to indulge in joyful activities. This is going to give us the sustainability to move through this together. It helps to make a list of joyful things from a holistic perspective. What is intellectually joyful? Physically joyful? Socially joyful? Emotionally joyful? And pick one or two to participate in each day.For intellectual joy, it could be reading, writing, puzzles, podcasts. For social joy, having a virtual happy hour with friends, playing with your pets, or playing with your kids. Have sex if you can, and don’t feel guilty about it! And for emotional joy, allow yourself to tap into the creative parts of yourself. Sing, learn a new dance routine. Create something for your soul, whatever that looks like for you.Explore Bon AppétitHealthyishSelf CareInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-19", "author": ["Condé Nast", "Priya Krishna"]}