{"id": "df7edb99a8ad3d4bdf1a66d4856d5fe2", "url": "https://www.bonappetit.com/story/studio-shamshiri-kitchens", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "4 Design Ideas That Will Make Your Kitchen Feel Brand New | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture4 Design Ideas That Will Make Your Kitchen Feel Brand-NewYour kitchen had a hard year too. Show it some love with these upgrades from the renovation experts at Studio Shamshiri.By Sam Cochran and Ali FrancisAugust 23, 2021FacebookTwitterEmailPHOTO BY YOSHIHIRO MAKINOFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.“Everyone touches the kitchen,” Pamela Shamshiri says. Before the workday starts, you’ll find the Iranian-born principal designer in her ‘office kitchen’ preparing a Persian breakfast spread: feta cheese, eggs, and “lots of things to nibble on for hours.” The enviable space, tucked inside a 1920s Spanish Colonial building on Sunset Boulevard in Los Angeles, is the heart of Studio Shamshiri—a widely-admired multidisciplinary design firm opened by Shamshiri and her brother, Ramin, in 2016. As much a storyteller as she is a designer, Shamshiri’s narrative-driven and research-heavy approach comes to life in both residential buildings (like Anne Hathaway’s historic Californian country home) and commercial properties (like the eccentric, more-is-more Maison de la Luz hotel in New Orleans). After a year of near constant cooking and working from our dining tables, our kitchens are starting to feel as tired as we are. An expert in breathing life into any space, we enlisted Shamshiri to school us on mixing metals, balancing form and function, and incorporating natural materials like wood and slate.1. Commit to ColorPHOTO BY SHADE DEGGESWhen updating an existing kitchen, a bit of color works wonders. In this Manhattan home Shamshiri added new fronts to the standard developer cabinetry and painted them an unexpected shade of mustard. Want something similar? Try Backdrop’s Pablo Honey.Get the Look:Backdrop Pablo Honey Paint$59 at Backdrop HomeCone Pendant Light$171 $160 at All ModernWooden Counter and Bar Stools$195 at Food522. Lean into WoodPHOTO BY YOSHIHIRO MAKINO“We’re moving more and more toward wood,” says Shamshiri, who finds the naturally occurring grain of bleached walnut or oiled oak to be timeless. In this La Jolla, CA, home, Shamshiri complements wood cabinets with green slate countertops and metals like copper Waterworks faucets and a stainless steel Wolf Dual Fuel range.Get the Look:COURTESY OF KOHLERCrue Kitchen Faucet by Kohler$622 $467 at Kohler$467 at Home DepotBrighton Floating Wood Shelf$149 at Pottery BarnTurkish Hand Towel$17 at Olive & LinenVilla Single Copper Sink$1,274 at Rejuvenation3. Skirt the ProblemPHOTO BY TREVOR TONDRO PHOTOGRAPHY, INC. Traditionally used to mask plumbing or storage in country kitchens, sink skirts “can hide a lot of things,” Shamshiri says of the vintage Indonesian fabric she hung beneath the kitchen sink at her L.A. office. DIY’ers can use a tension rod and a sewing machine.Get the Look:COURTESY ANN SACKSZellige Tile$30 at Wayfair (per square foot)$30 at Ann Sacks (per square foot)Hammered Copper Tray$80 at AmazonHandwoven Indonesian Fabric$79 at Etsy4. Mix Your MetalsPHOTO BY STEPHEN KENT JOHNSONTop-quality equipment doesn’t have to sacrifice style. For the Ojai, CA, home of Anne Hathaway, Shamshiri went with a handcrafted La Cornue Château 120 range with a pale gray finish and mixed-metal trim. But she’ll often go even bolder, choosing bright appliances by Lacanche. (We also love Smeg.)Get the Look:Mauviel 10” Copper Frying Pan$350Backdrop Skywalker Paint$59 at Backdrop HomeBarber Wilson Swing Arm Pot Filler$932 at AmazonEmery Pot Rack Bar$189 at RejuvenationExplore Bon AppétitShoppingLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-23", "author": ["Condé Nast", "Sam Cochran", "Ali Francis"]}