{"id": "df99f73a5637f1244db33fb6f8bfa6e9", "url": "https://www.bonappetit.com/story/spinach-namul", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "Spinach Namul (Blanched and Seasoned Korean Spinach) is How I Eat A Whole Bunch of Spinach in One Sitting | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSpinach Namul Is How I Eat A Whole Bunch of Greens in One SittingNearly any vegetable can benefit from this classic Korean treatment.By Hana AsbrinkMarch 3, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I’m probably not the only Korean American who’s had to tag along on fernbrake-picking excursions at least once during childhood. Though largely reserved for adults, the ritual of foraging for this edible fern (also known as bracken fiddleheads or gosari in Korean) during road trip rest stops in the New York tristate area is peak nostalgia.We would dry out bags full of gosari on newspapers, store them, and then share. At some point, we’d rehydrate and boil them to grace our dining table in the form of seasoned greens, or namul, which is one of the most essential types of Korean side dishes, or banchan. (You might also recognize gosari namul as one of the components of vegetable-loaded bibimbap.)Gosari was just one of many types of namul I had growing up. In fact, it seemed every banchan was some version of namul, the definition of which always seemed somewhat vague to me. Namul can be any kind of vegetable, root, seaweed, or sprout. In preparation, they’re often blanched and then seasoned, but you can also find them raw, pickled, stir-fried, and more. In my mind, namul is an umbrella term for a seasoned vegetable dish. And while non-Koreans may generally associate Korean food with beef-laden barbecues, the fondness for vegetables is one of the quiet underpinnings of our culture’s cuisine.“Much of Korea is mountainous and covered in forests, and Koreans have always used the countryside as foraging grounds for wild vegetables, roots, tubers, and mushrooms,” popular Korean food blogger and cookbook author Maangchi explains in her latest book, Maangchi’s Big Book of Korean Cooking. “Partly because of this, our cuisine has a long and heartfelt tradition of vegetable and plant-based dishes.”It comes as no surprise, then, that Korea has the highest per capita vegetable consumption in the world, a direct result of namul consumption, according to a study published by the Journal of Ethnic Foods published in May 2020.Chef Sohui Kim’s namul is made with quick-cooked kale and perilla oil.\nPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelThe authors broadly define namul as “foods made by seasoning and mixing edible plants or leaves.” By parboiling or stir-frying the vegetables, their volume decreases considerably, making it easier to meet your recommended daily intake.One of the most common (and delicious!) types is spinach, or sigeumchi namul. You’ll find these in everything from lunch boxes to bibimbap, and there’s a reason it’s so popular—it couldn’t be easier to prepare.Here’s how to make sigeumchi namul:First, bring a medium-size pot filled halfway with water to boil. You’ll need about 1 pound of spinach. If you’re lucky enough to find the type still connected at the blush-hued root ends, keep these intact! If the spinach bunch is too big for the pot, feel free to trim it a bit at the base. Give the spinach a good wash as your water heats; it’ll be blanched in a moment so you don’t have to be a stickler about drying it well. Alternately, if you can’t get your hands on a bundle of spinach, you can also use the bagged variety. (In this case I would opt for the larger, more mature spinach and not baby spinach.)When the water is at a gentle boil, hold the bunch of spinach upright in the water so that the roots get blanched first for about 10 seconds. Drop the rest of the spinach in and blanch the entire lot for no more than 30 to 60 seconds, depending on how large your spinach is. You want to ensure the spinach gets tender while retaining its bright green color.Immediately remove the spinach and plunge it into an ice bath or rinse it in a bowl with a few changes of cold water. Drain and squeeze (not too hard) the spinach before cutting into bite-size lengths and transferring to a mixing bowl.Now comes the fun part: seasoning! Start with about 1 tsp. each soy sauce, toasted sesame oil, and toasted sesame seeds; 1 crushed garlic clove; and 1 pinch each sugar and salt. Mix well (with your hand, preferably), separating and untangling the leaves as you do so. Adjust seasoning to your taste. Plate it up and shower it with more toasted sesame seeds. Enjoy with rice and don’t be alarmed if you find yourself eating an entire bunch of spinach in one sitting.You can easily tweak the seasoning depending on your mood. If you’re hankering for spice, add a bit of Korean chili paste (gochujang) or Korean chili flakes (gochugaru). If you want a deep, rich flavor boost, a touch of Korean soybean paste (doenjang) will get you there.Remember, you can make namul out of just about any green or vegetable. Some of my favorites include steamed eggplant (gaji namul) seasoned in the same way as you would the spinach; blanched soybean sprouts (kong namul), mirroring the spinach method with the addition of gochugaru and chopped scallion; and julienned Korean radish (musaengchae), a raw preparation of namul with the addition of sugar and vinegar that almost resembles a type of salad or coleslaw.Of course, as a child, I never appreciated the vast assortment of vegetables, preparation methods, and seasonings involved in what we ate daily. It was all just normal food to me, highway-foraged fernbrake and all. As an adult, and especially as a mother, tasked with creating quick, balanced meals day in and day out, I lean on all sorts of namul to get my family’s fill of greens in a tasty way. It spares me from imploring my daughter to “eat your vegetables!” because she enjoys them on her own.Hana Asbrink is a writer, editor, and recipe developer based in New York. She likes long walks and the elusive egg bagel.Explore Bon AppétitIt's That SimpleKoreanSpinachVegetableVegetarianSpring SidesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-03", "author": ["Condé Nast", "Hana Asbrink"]}