{"id": "df9ea70b7c728186fd31ba67fa9cce7e", "url": "https://www.bonappetit.com/city-guides/las-vegas/venue/momofuku-las-vegas", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Momofuku Las Vegas Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlas vegasMomofuku Las VegasThe reliably delicious (and group friendly!) standby in The CosmopolitanFacebookPinterestTwitterEmailPhoto By Anthony MairGO HERE: for the ideal predictable-in-a-good-way meal in a city with a lot of unknowns (wait, what time is it?). It’s everything the Momofuku empire does well but tailored to the Vegas crowd.ORDER THE: the usual buns and large-format meals, like bo ssäm and five-spice rotisserie duck that feel at home in Vegas. Go to town on the show-stopping bigeye tuna and strawberry dish, which gets covered in a mound of shaved foie gras, and the seafood grand lisboa, the mouthwatering result of paella, seafood pasta, and David Chang all hanging out.THE VIBE IS: familiar. Between the food and the room with its usual sleek wood-heavy design, you might just forget that you’re in neon-lit Vegas—until you see the \"Eiffel Tower\" out the window.PRO TIP: Going with a big group? Ask for the secret karaoke room.PRACTICAL STUFF: Open everyday for lunch, from 11 a.m. to 3 p.m., and dinner, from 5:30 to 11 p.m. Hit Peach Bar, located at the restaurant entrance, for late-night refueling: Sunday to Thursday, 11 p.m. to midnight, and Friday to Saturday, 11 p.m. to 1 a.m.WE ALSO LOVEBeijing Noodle No. 9Authentic hand-pulled noodles in the middle of the Strip’s busiest casinoGolden SteerEverything a steakhouse should beIn-N-Out Go animal style. DuhExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-05-25", "author": ["Rachel Karten"]}