{"id": "dfa2cddae38330699ab6efc9437055f4", "url": "https://www.bonappetit.com/recipe/enfrijoladas", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Enfrijoladas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueEnfrijoladasBy Rick MartinezAugust 18, 20204.8(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Rick MartinezEmailPinterestPrintEmailPinterestPrint“Traditionally, enfrijoladas are made by dipping stale tortillas into leftover frijoles from the night before,” says Rick Martinez, who is writing a cookbook on regional Mexican food. “But here I’m feeling extra so I’m bulking them up with chorizo and gooey cheese. They are also great topped with a fried egg, or with roasted vegetables instead of chorizo to make this a plant-based breakfast.”Ingredients4 Servings5Tbsp. vegetable oil, divided8corn tortillas12oz. fresh chorizo3garlic cloves, crushed½medium white onion, thinly sliced, plus more for servingKosher salt215-oz. cans black beans, rinsed, or 3 cups Frijoles de la Olla, drained1½cups low-sodium chicken broth6oz. queso fresco or Cotija cheese, crumbledCilantro leaves with tender stems and sliced avocado (for serving)PreparationStep 1Using 2 Tbsp. oil, brush both sides of each tortilla. Heat a large skillet over medium-high. Working in batches, cook until lightly browned and starting to crisp, about 1 minute per side. Set aside.Step 2Heat remaining 3 Tbsp. oil in same skillet over medium-high. Cook chorizo, breaking up with a wooden spoon, until browned and cooked through, 7–9 minutes. Using a slotted spoon, transfer to a medium bowl; set aside.Step 3Add garlic and ½ onion to same skillet, season with salt, and cook, tossing occasionally, until tender and beginning to brown, 6–8 minutes. Using slotted spoon, transfer garlic mixture to a blender; reserve pan with oil. Add beans and broth to blender and purée until smooth (it should be the consistency of yogurt); season with salt.Step 4Set reserved pan over medium-high and heat oil. Transfer bean purée to skillet and bring to a boil. Reduce heat to low. Working one at a time and using tongs, dip tortillas in bean purée, turning to coat and leaving until softened, about 3 seconds per side (they will soften more as they sit). Transfer to a baking sheet as you go. Spoon 1 Tbsp. chorizo and 1 Tbsp. queso fresco across the center of each tortilla; fold over like a taco.Step 5Divide among plates and spoon remaining bean purée over. Top with cilantro, avocado, more onion, remaining chorizo, and remaining queso.How would you rate Enfrijoladas?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleMade this with leftover black beans (Cuban-style — sorry!) and leftover roasted vegetables (as suggested), instead of the chorizo. The tortilla technique is foolproof — so much simpler than trying to pass them through shallow oil. An easy and indulgent brunch with a fried egg. Thank you, Rick!Dan TBoston, MA12/29/2020I made these enfrijoladas exactly like the recipe.  They were fantastic.  A friend told me they were exactly like he had had them in Mexico City 40 years go.  Another friend told me to invite him whenever I made them.barbara6207San Diego9/24/2020This recipe was so good! I used canned beans but def will be using his bean recipe next time for better color and flavor. Also used soyrizo from trader joes and it was delicious! AnonymousLos Angeles 9/16/2020These were great! A good way to mix up having plain old tacos :) I just wish my grocery store had better chorizo :(Anonymous9/15/2020We went meat-free dinner on this one! Was quick, easy, and very tasty. We're planning on incorporating it into our meal-planning lineup! AnonymousOxford, MS9/12/2020This was a huge win for me! I've dedicated my whole week of cooking to Rick's recipes from this issue and so far this has been my favorite. Definitely worth making the frijoles de la olla to use for this recipe. Makes a fabulous savory brunch! AnonymousPhiladelphia, PA9/9/2020Deeply savory and so dang delicious. AnonymousSeattle, Wa8/25/2020Explore Bon AppétitMexicanLatin AmericanChorizoSausageMeatBlack BeanBeanVegetableQueso FrescoCheeseCotijaQuickEasyMainGluten-FreeNut-FreeBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Rick Martinez"]}