{"id": "dfb3e9af921f012ef639c9c561e6864f", "url": "https://www.bonappetit.com/recipe/kadhi-turmeric-yogurt-soup", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "Kadhi  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesKadhiBy Priya KrishnaFebruary 24, 20204.6(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by yekaterina boystovaEmailPinterestPrintEmailPinterestPrintKadhi is similar in texture to cream of [fill in the blank] soup, but with no cream, and…well…better. All you need to make it are yogurt, chickpea flour, and spices. But don’t let the simplicity fool you: Kadhi is both deeply comforting and insanely complex in its flavor, like a cozy blanket draped over a hot bowl of white rice. The exact recipe varies from region to region in India, and sometimes includes add-ins, like chickpea flour–based fritters called pakoras, but we like it thick, rich, and spice-forward, with a pleasant tanginess at the end. If you don’t like peppercorn flavor, feel free to nix them or cut the amount in half.Ingredients4 servings1cup whole-milk plain yogurt (not Greek)¼cup chickpea flour1tsp. ground turmeric1Tbsp. plus 4½ tsp. ghee or extra-virgin olive oil, divided5whole cloves2bay leaves½tsp. black peppercorns½tsp. black mustard seeds½tsp. fenugreek seeds1½tsp. cumin seeds, divided2tsp. kosher salt, plus more if neededFresh lime juice (optional)3dried red chiles½tsp. asafetida (optional, but really great)¼tsp. red chili powderCooked rice (for serving)PreparationStep 1Mix yogurt and chickpea flour in a large measuring glass until smooth and homogeneous. Stir in 1 cup water, followed by turmeric—the mixture should be a pale yellow color; set aside.Step 2Melt 1 Tbsp. ghee in a medium Dutch oven or other heavy pot over medium heat. Add cloves, bay leaves, peppercorns, mustard seeds, fenugreek seeds, and ½ tsp. cumin seeds and cook, stirring, until mustard seeds start to pop, about 1 minute. Reduce heat to low and add reserved yogurt mixture and 3 cups water; mix well. Season with 2 tsp. salt. Taste—the mixture should be tangy, rich, and distinctly flavored by the spices. Add lime juice to taste and more salt if needed.Step 3Increase heat to high and bring to a boil, stirring constantly (if you stop stirring, it will curdle). Insert a large long-handled spoon into the pot to prevent soup from boiling over and let cook 10 minutes without stirring (if at any point it looks like it might boil over, reduce heat to medium-high for a minute before turning it back up). The kadhi should become thicker and brighter in color and look like a creamy soup. Taste again and add more lime juice if needed.Step 4About 5 minutes before kadhi is done cooking, melt remaining 4½ tsp. ghee in a small saucepan or butter warmer over medium-high. Cook remaining 1 tsp. cumin seeds until they start to sputter and turn brown, a matter of seconds. Immediately remove pan from heat and stir in chiles, asafetida (if using), and chili powder.Step 5Stir spiced ghee into kadhi and serve in bowls over rice.How would you rate Kadhi?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleThis was so yummy and was the perfect consistency! Thank you so much! So a few things I did: avoided the lime juice, added 2 cups during boiling stage of water as my mixture was 2% yogurt.  my stove gets very hot so after stirring for 10 min, I did bring it down to low and it boiled softly for 10 min. for the last tadka, I added 3 chilies and some curry leaves too! RheaToronto, Canada8/4/2021Absolutely delicious and crave-worthy. We used White Mountain brand Bulgarian yogurt from Austin which was really nice and tart to begin with, so no need to add lime or amchoor. The salty/sour hit in a creamy and comforting base really hit the spot. AnonymousWashington, US10/26/2020\nThis was really bad - watery and bland. It was not at all authentic, we definitely don’t use cloves or lime in kadhi, and also kadhi is not a soup. I feel bad for people who have never tasted kadhi, and make this recipe and think that this is it. You can look up a proper traditional kadhi recipe on an authentic Indian website - This had no depth in flavor and a bad texture, much too thin. Anonymous9/26/2020Completely inauthentic. Traditionally, we don’t put lime or clove in kadhi. It was ok but not much depth of flavor and much too thin. Also, kadhi is not a soup. I feel bad for people who have never tasted real kadhi, and who make this and think that this is it. Look up a traditional recipe on a true Indian site for much better flavor and texture. Anonymous9/26/2020Great recipe! I am so glad to see someone bring this beloved Punjabi dish to a global platform. \nSide note- now that Priya has gone on record, in a BA interview no less, to say that calling her Kadhi a Tumeric-Yogurt \"soup\" to make it more accessible to a white audience was irksome, and is a representation of the racial bias and oversimplification of non-white cuisines at BA and other food magazines, maybe consider removing it? simran23India7/30/2020AMAZING. LOVE YOU PRIYAAnonymous7/26/2020Have made this a couple of times (once w roasted pumpkin bobbing in it, and once with spinach) and it was delicious both times - got the creamy texture second time around and it was so comforting, but still pretty healthy. Very meditative to make too. Thank you so much for sharing!AnonymousAustralia7/23/2020Soooo yummy. I could eat this again and again. I wouldn't go adding ginger/onion/garlic... For me, this recipe is perfect as is! If it seems a little bland I'd recommend really letting the Kadhi cool down before you dig in—you want it to be warm but not piping hot. ShayTUK6/16/2020This was amazing! As a swede, I'm quite confused with the term \"whole-milk plain yoghurt\" because we don't have any terms that translates to anything like that here in Sweden regarding our different yoghurts. I ended up using Turkish yoghurt, as it said \"not Greek\". It worked great! I also didn't find any fenugreek seeds in store, so I bought ground fenugreek and put like 1/2 teaspoon along with the turmeric. Oh and I also couldn't find black mustard seeds, so I went with brown. Everything was delicious! For next time, I will order some fenugreek seeds along with some black mustard seeds to see the difference. But honestly- this was soooo gooood. I will definitely make this again and again! Thank you Priya!AnonymousStockholm5/21/2020I didn't have the exact ingredients but was still so good! a really satisfying mealAnonymousmontreal5/15/2020Super tasty! I used vegan soy yoghurt and added a bit more to make up for it being thinner (about 375g total). I also added in a handful of curry leaves and was feeling lazy so added all the spices to the ghee at the beginning instead of making a tadka, first the whole spices, then ground, and finally added some chopped ginger and spring onion, too.hannah__Uni4/27/2020So good!  It's a bowl of comforting deliciousness.  This is definitely going on my meal rotation list.  I just ate a bowl and I want to make it again! kimberozCanberra, Australia4/9/2020Oh gosh comfort foot ? I wish my feet smelled like sweet toasted cloves ...food**Anonymous🇨🇦 4/6/2020My new comfort foot 👏🏼👏🏼Anonymous🇨🇦 4/6/2020\n 2 things; mine didn’t thicken and maybe add onion/garlic/ginger to it for more flavour as one reviewer suggested? Will try it again though. I think this is acquired taste recipe?FentonjToronto3/29/2020Explore Bon AppétitIndianSouth AsianAsianTurmericHerbs & SpicesChickpea FlourFlourYogurtOther IngredientsMainGluten-FreeVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-24", "author": ["Condé Nast", "Priya Krishna"]}