{"id": "dfb9718db1001531e8b73b479731c53d", "url": "https://www.bonappetit.com/story/kadhi", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "Kadhi Is the Creamy-Sour Soup I Need On All Sick Days (And Winter, In General) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Creamy-Sour Soup I Need On All Sick Days (And Winter, In General)Kadhi over rice is the food equivalent to your favorite cozy cold-weather sweater.By Priya KrishnaFebruary 24, 2020FacebookTwitterEmailFacebookTwitterEmailWhen I was on tour for my cookbook Indian-ish last summer, I got asked the same question a lot: “What’s the dish that causes that Ratatouille moment for you?” You know the scene. When the snobby critic Anton Ego eats Remy the rat’s deconstructed, fancy ratatouille and the flavors flash him back to his childhood and his mother serving him ratatouille after he’s fallen off his bike.For me, the answer is so obvious it requires zero consideration: kadhi.Kadhi is the food equivalent to that colorful, well-fitting wool sweater in your perpetual winter rotation. It’s a creamy, cozy, tangy soup thickened with chickpea flour and yogurt, stained with turmeric, and seasoned with a lot of pungent spices (fenugreek, cloves, cumin seeds, mustard seeds, bay leaves, peppercorns) meant for blanketing over rice, a pairing also known as “kadhi chawal.” The base of this dish—chickpea flour, yogurt, and turmeric—is a trio of ingredients found readily in Indian cooking. Turmeric gives food its bright color and earthy depths; yogurt is the cooling accompaniment to spice-heavy meals; and chickpea flour is used as a thickener or a base for spicy fritters and in milky sweets.The recipe for kadhi varies from region to region in India. In Gujarat, kadhi can be lightly sweetened with a little jaggery, and the Sindhi version has vegetables, usually okra. I have tried many versions of kadhi, made by various aunties and uncles. Some aren’t sour enough. Or they’re too thin. Or the flavor of the spices isn’t pronounced enough. My mom’s is, in my opinion, as close to perfect as it gets.Watch Priya make kadhi\nKadhi is the dish my mom pulls out for birthdays, when I come home for the holidays, or when everyone in the house is feeling cold and stuffy. I have distinct memories of sitting on the kitchen counter doing my high school math homework, watching the cauldron-like pot of the bright yellow soup bubble away, the smell of smoky, earthy spices filling the room. My mom, clutching her requisite goblet of red wine, would stand next to the stove, intuitively turning the heat up and down to get it to that ideal thicker-than-soup-but-not-quite-sauce texture.She makes it with my dad’s tart homemade yogurt and a bunch of whole spices that pop and crunch between your teeth. It has a thick, heavy cream-like texture, thanks to the abundance of yogurt. Think of your favorite Cream of ____ soup. Kadhi is that, but better. It’s also delightfully easy (just a few minutes of stirring!), requires no fresh produce to make, and comes together in one pot. You start by sautéing the spices until they get toasted and fragrant, then you add the chickpea flour, yogurt, turmeric, and water, and let it cook until it thickens. The last step is making a chhonk—tempered spices—with ghee, cumin seeds, dried red chiles, and red chile powder, and drizzling it over the top. That’s all.There’s one thing I will say about my mom’s version: She likes to add pakoras, fritters made of chickpea flour, to her kadhi while it’s cooking, which is traditional in Uttar Pradesh, where she’s from. My controversial opinion is that I DON’T LIKE PAKORAS IN MY KADHI. I’m sorry, Mom, but I don’t want stuff floating around in my soup! I don’t top my kadhi with anything but chhonk. But you do you.The key to kadhi is that you have to babysit it. Kadhi, like risotto, is a dish that needs to be coddled. You have to stir it to prevent it from curdling, and then you have to keep watching it to make sure it doesn’t boil over (but it’s worth it, I promise!). The other trick is to use the oldest yogurt you can find, because it brings that characteristic tangy flavor. That month-old container in the back of your fridge that you forgot about until just now? That works. Not that kind of yogurt hoarder? A few drops of lime juice will do the trick, too.Here is the final cardinal rule: The only pairing for kadhi is white rice, preferably basmati. My mom once went through this low-carb phase where she exclusively made quinoa or farro. But let me assure you, it ain’t kadhi chawal without those fluffy, gorgeously textured grains of white rice.How much do I love kadhi? Let me count the ways. I love how kadhi coats rice like a satin pillowcase. I love the intense bite of the whole cloves and peppercorns, which get soft but maintain a slight crunch. I love the puddles of chhonk that enrich and enliven everything around them. I love the smooth, sour flavor that makes it like no other soup I’ve ever had.Get the recipe:KadhiThis deeply comforting, spice-forward Indian soup is deceptively simple, easy to pull off, and perfect over a bowl of white rice.View RecipeExplore Bon AppétitIndianishWinterSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-24", "author": ["Condé Nast", "Priya Krishna"]}