{"id": "dfbb2260b2b844e983bb142de1d1ad3f", "url": "https://www.bonappetit.com/story/spring-cleaning-wines", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "5 Spring Cleaning Wines to Drink While You KonMari Your Closets | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture5 Spring Cleaning Wines to Drink While You KonMari Your ClosetsA wine for every chore, even if you end up drinking it in a hammock all afternoon instead of cleaning out the garage.By Marissa A. RossApril 19, 2018FacebookTwitterEmailIllustration by Maryse ChevriereFacebookTwitterEmailSpring cleaning sucks. I’m diagnosed OCD and compulsively clean my house every morning, and even I am like, “Spring cleaning suuuuucks!” You can love making your bed every morning or get a sense of completion doing all of the dishes, but there are plenty of chores around the house that you ignore all year because, well, you can. It’s easy not to care about your tile grout, and suddenly it’s black.That’s why once a year you have to bust out the never-used supplies under the sink and recalibrate your life. It’s totally boring, but it doesn’t have to be awful with the help of these five springy wines.Illustration by Maryse ChevriereFor Scrubbing Down: Chenin BlancThis is a judgment-free zone. I don’t care how all those handprints got all over your walls (hopefully it was something sexy, but we both know it was probably kids), but they are there, just like there is grease on the backsplash and dirt on the baseboards. Scrubbing is the most tedious part of cleaning, but you’ve got to do it, and damn, how good does it feel after you’ve really scrubbed something clean? You feel liberated! That’s why you need Chenin Blanc. A glass of *dry Chenin Blanc captures that same energy of empowered cleanliness, smelling and tasting like apples, Meyer lemons, and the first sweet grass after the final snow melts. You are suddenly rejuvenated and free, like everyone at the end of The 40-Year-Old Virgin dancing around to that song from Hair.*Dry is key here. Chenin Blanc varies in sweetness, and by varies, I mean it can be very sweet. Ask for a dry Chenin at your local shop, and keep your eyes peeled for bottles labeled “Sec.”Try: Melaric “Billes de Roche” 2014, $25; Lincoln Fine WinesIllustration by Maryse ChevriereFor Cleaning Out the Garage: RomorantinI am audibly groaning right now just thinking about cleaning out the garage. It’s dusty, it’s hot, and it’s inevitable that there will be an argument about unused skis or boxes of Beanie Babies. Keep your cool with a glass of Romorantin. This white wine from France’s Loire Valley smells like baked lemon bars and clean concrete, and if you close your eyes, you can imagine your garage is already clean and you’re rewarding yourself with a bit of dessert. That sounds like it’s going to be sweet, but on the palate, the wine has a bolt of acidity to keep you energized while digging through camping gear, and tastes like ruby red grapefruit lemonade with a rim of salt and brown sugar. Also a great wine for discovering a lawn chair you forgot about, saying screw this, and taking a seat on the driveway for the rest of the day.Try: Etienne Courtois Romorantin, $46; Domaine LAIllustration by Maryse ChevriereFor Getting Back in the Garden: Grüner VeltlinerDoesn’t matter if you have award-winning roses or can barely keep basil alive, everyone has a green thumb while drinking Grüner Veltliner. No, seriously, it comes in dark green bottles, and the wine itself is a pale yellow-green color. This central European white wine smells like the garden of your dreams with notes of evergreen herbs, snappy green beans, and fresh-peeled citrus. Perfect for going on a Pinterest spree of what you may or may not actually ever plant, Grüner Veltliner is even better when taken to the yard/porch/windowsill. Juicy but dry with notes of green apple, lime, and hints of thyme, Grüner is that refreshing gulp you want in the sun after digging your hands in some soil.Try: Nikolaihof Grüner Veltliner, $26; Domaine LAIllustration by Maryse ChevriereFor Sprucing Up Your Living Space: GrilloIt’s true: Your once highly curated bookshelf is now cluttered, the side table you inherited from your mom doesn’t quite fit in that corner, and honestly, your bed might look better against the other wall. It’s time to make some moves, so you might as well do it with some jazz and a bottle of Grillo. This Sicilian grape makes a fuller-bodied wine that looks like yellow tulips but smells like white irises with herbaceous stems that belong in that vase you’ve never used, with a side of overripe cantaloupe. Great for slowly sipping while sorting through piles of magazines or pondering whether the fiddle-leaf fig would do better in the kitchen, Grillo is satin in texture and tastes like Louis Armstrong and Ella Fitzgerald’s “Summertime” if it were sung by salted honeydews, tangerines, and those same beautifully droopy white irises that are going to end up making a mess all over your coffee table.Try: Tami Grillo, $17; Domaine LAIllustration by Maryse ChevriereFor Reorganizing Your Desk: PoulsardOnce upon a time you had a space that was used for working. It was called your desk, although you now know it as your extra closet and/or the pile of mail that shall not be opened. The light French red Poulsard is ideal for drinking while folding sweaters, opening holiday cards you can’t put on your fridge now, and tossing mile-long CVS receipts you don’t even know why you have. It inspires you to use your desk as an actual desk with its bouquet of clean laundry, newly sharpened pencils, and crunchy cranberries, and goes down smoother than your hand gliding across freshly Pledged wood. Poulsard tastes like Bing cherries, tart plums, and a bonfire softly wafting in on a salty Pacific breeze. Before you know it you’ll have found that screenplay you forgot you wrote crumpled in the back of your desk drawer. (So that’s why it never shut!) Thanks, Poulsard!Try: Domaine de la Pinte Arbois Poulsard, $27; Lou Wine ShopFor Everything Else:Drink what you have open and go talk to Martha Stewart.Marissa Ross is the author of ”Wine. All the Time.” Pick it up on Amazon for $14 and thank us later for all your new wine knowledge.Maryse Chevriere is a sommelier, illustrator, and writer whose hilarious Instagram @freshcutgardenhose won a James Beard Award for humor in 2016.Explore Bon AppétitWineCleaningSpringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-19", "author": ["Condé Nast", "Marissa A. Ross"]}