{"id": "dfbd33192819f54090ae8da4c9c12772", "url": "https://www.bonappetit.com/story/bida-manda-laotian-sausage", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "I’m a Self-Dubbed Sausage Expert and This Sausage Is the Best | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’m a Self-Dubbed Sausage Expert and This Sausage Is the BestSorry, but it’s true.By Alex DelanyAugust 23, 2019FacebookTwitterEmailPhoto Courtesy Bida MandaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I have spent much of my life eating sausage, one of the world’s great ingredients. Grilled kielbasa. Sausage with peppers and onions. Anise-heavy longanisa. Sausage, egg, and cheese breakfast sandwich. Currywurst. Pasta with sausage and broccoli rabe. Curry-laced sai ua. Boudin blanc. Fried rice with—you guessed it—sweet Chinese sausage. And you know what these sausages have in common? They’re not the pork and rice sausage at Bida Manda in Raleigh, which is the best sausage I’ve ever had. Hands down.For the uninitiated, it’s a Laotian sausage made with pork, tons of aromatics, and—surprise!—rice. At Bida Manda, chef Lon Bounsanga makes it with a high-fat blend of ground pork (including pork belly) and jasmine rice, which in the past was used to stretch the meat in leaner times. Bounsanga continues to do this because the rice helps the sausage retain the flavor of the pork fat and all the other ingredients added to the sausage: lemongrass, dill, garlic, scallions, cilantro, and makrut lime leaves.The result is an incredibly complex sausage with a texture that’s somewhere between crumbly and creamy and a flavor that juxtaposes lively, fresh herbs with salty, fatty pork. It comes grilled, sliced, and served with pickled ginger. And I now rest my case for the best sausage out there.Go there: Bida MandaExplore Bon AppétitHighly RecommendSausageRestaurantsRead MorecultureI’d Like to Induct Olympia Provisions’ Pepperettes Into the Salty Meat Snack Hall of FameBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-23", "author": ["Condé Nast", "Alex Delany"]}