{"id": "dfcdd0829f4d0a12480e520b9cee3c1f", "url": "https://www.bonappetit.com/story/kindeli-wines", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "Kindeli Otono and My Column, Which Is and Is Not About Specific Bottles of Wine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Shouldn't Be Writing About These New Zealand Wines, But I Just Can't NotThe only problem with Kindeli's line-up? You might never be able to try it.By Marissa A. RossJune 18, 2019FacebookTwitterEmailIllustration by Katie BennFacebookTwitterEmailHey! I’m Marissa Ross, Bon Appetit’s wine editor, and welcome to the new home of my column, Unfiltered, here on Healthyish. This is where I’ll be sharing my latest favorite bottles and—you guessed it—unfiltered thoughts on wine. Please come in, grab a glass, make yourself comfortable. The bathroom is the first door on the right.The first time I tasted Alex Craighead’s Kindeli wines was at Percy Selections’ Los Angeles trade tasting last June, and I had no recourse but to run off with the bottles. I yelled for permission to no one in particular, without caring if I got it, and was out the back door of Bar Bandini like I was going to slide over the hood of a ’69 Dodge Charger for a dramatic getaway. I settled for a sunny spot on the porch, where I could write about the wines without being crammed crotch-to-butt against buyers wearing too much cologne and yelling at each other over Tame Impala. I finished my notes and snapped a photo before returning the bottles to the bar, nervous I’d never see the small-production New Zealand wines again. Unable to control myself, I posted the photo on Instagram and proceeded to piss people off because the wines weren’t available retail yet, and when the limited amount finally was, it sold out in a matter of weeks.Kindeli is one of the only true natural wines being imported from New Zealand, where it’s made with organically farmed fruit and no sulfur additions. But that isn’t enough to make me impulsively abscond with bottles at an industry event; it was the incredible cohesiveness of the line-up that did that. Despite being insane blends that you would never expect to fit together, the vintage had a beautiful through-line that smelled and tasted like taking one more step down a tropical garden path lined with roses.Drinking wine is not about having a specific bottle. Drinking wine is about having an experience.Kindeli’s 2018 vintage arrived along with spring, and while I could take off into the night with any of the releases, the “Otoño” got me good. I didn’t realize how much I missed summer until I poured myself a glass of the Gewürztraminer blended with Riesling and Pinot Gris. It looks like a sepia-toned late Sunday afternoon through your favorite cheap sunglasses and smells of ripe mangoes and tea roses in peak bloom, soft in the heat. Drinking it is like taking all those mangoes and roses, whipping them up with pulpy guava, and shaking it all up with hot gravel before garnishing with an orange rind. “Otoño” is an old Polaroid that you never took; a portrait of life in the sun where day jobs and disputes have never existed, and every last dime was spent on gas, grass, and general gallivanting.The good news: The Kindeli wines are more widely available this year than last, and I hope you get to try them. The bad news: There’s a chance you may not. Honestly, there’s a good chance you won’t even see many of the wines I write about. This is a complaint I’ve gotten regularly since starting at BA in 2016. Whether it’s from my bosses or our readers or even Instagram followers who see photos like the one I posted of the Kindeli wines last summer, people become frustrated when they can’t find the bottles I’m recommending. I get it, especially in the age of social media, where certain wines seem to be all over your feed but nowhere to be found in real life.The truth is we’re in similar situations. I generally buy the bottles I write about at retail because contrary to popular belief, I’m not out here swimming in free wine. This means we’re both limited to what is available around us. Granted, I live in Los Angeles, where natural wine is abundant, so I’m lucky, but there are still plenty of wines I see all my East Coast friends drinking that will never make it onto a shelf in California. I used to get envious (okay, I still do sometimes), but if writing about wine has taught me anything, it’s that drinking wine is not about having a specific bottle. Drinking wine is about having an experience.I write about wines I have to write about. Not because it’s my job, but because I physically can’t not write about them. They’re wines that bring me (notebook in tow) to my knees. Wines that have caused me to collapse onto cold Spanish tiles in the middle of a dinner party because they transport me to the pink lemonade I drank after swim practice; wines that pull me to sit on wet cellar floors and write about lovers I’ve never had. Those are the kind of wines I write about.That doesn’t mean you’re going to have the same reaction. Maybe it’s bottle variation, or maybe you don’t like it because you just don’t like it. There are plenty of wines I don’t like. One of the most popular bottles of natural wine over the last two years I consider so undrinkable that it has made me question whether I should start writing negative reviews. I don’t, though, because that wine—and many others—brings people joy. Just like the wines I write about bring me joy.That’s what I want you to take from this column. Of course I want you to try all the wines I write about, and if your wine shop doesn’t carry them, ask for them because (a) people can’t supply if they don’t know there’s a demand and (b) in the meantime, they can point you in the direction of something similar. Maybe they don’t have the Kindeli wines, but they might have other natural blends from neighboring Australia or interesting skin-contact Gewürztraminer, Rieslings, or Pinot Gris. But the truth is, even if you drank the exact same bottle of Kindeli’s “Otono” that I drank, you may not feel the same way about it that I do. And that’s okay. Because I want to inspire you to seek out wines that bring you joy. That take you somewhere new or remind you of something you love.It’s easy to fetishize bottles, especially ones that people praise and that have beautiful labels, like Kindeli with its painted topless foxes. But drinking wine isn’t about drinking what everyone else is; it’s about drinking wines that give you—and maybe only you—a fantastic experience.Explore Bon AppétitUnfiltered natural wineHealthyishWineRead MoreLifestyleWe'll Be Drinking Co-Fermented Wines All Summer LongBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-18", "author": ["Condé Nast", "Marissa A. Ross"]}