{"id": "dfce212bff3b90b997fe87db595b6159", "url": "https://www.bonappetit.com/story/homemade-cheese-crackers", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "These Homemade Cheese Crackers Are for Sharp Cheddar Lovers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Homemade Cheese Crackers Are for Sharp Cheddar StansYou can go home now, mild cheddar.By Carey PolisDecember 10, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiFacebookTwitterEmailOn Sunday night, my husband was shaving in the bathroom. So I barged in to tell him something very important. “I love these crackers!” I announced, because I definitely couldn’t wait until he didn’t have shaving cream all over his face.Cheese crackers are a year-round food for me: Cheez-Its are my official airplane snack and I buy Goldfish from the Rite Aid by my apartment on the regular. But for the holidays, you want some special. Something homemade even. Something a bit more sophisticated, maybe? So if you’re hosting a holiday party this year and your eggnog is too sweet, your cookies are overbaked, or the ham a bit dry, as long as you have a giant pile of these cheese crackers, it’s all going to be okay. Plus, they’re way easier to make than attempting a beautiful royal icing pattern on said cookies.Don’t expect a super crispy cracker; instead, these have a bit of pleasant chewiness that we attribute to the fact that there is a lot of cheese involved. They are almost like a soft frico. They are a little bit spicy, a little bit buttery, and a lotta bit cheesy.All you do is blitz almost a pound of grated sharp cheddar with flour, salt, cayenne, jarred pimiento peppers, butter and a couple tablespoons of water in the food processor until it forms a dough. Form into a log, chill in the fridge for 4 hours, then slice and bake.Sure, your fingers might be slightly greasy after you scarf down four in just as many seconds, but that’s a small price to pay for holiday appetizer perfection.Get the recipe:Pimiento Cheese CrackersThe highly addictive, melt-in-your-mouth cheddar cracker is all grown up thanks to a little heat from the cayenne and a hint of sweet pepper from the pimiento.View RecipeYou know what would make a pretty great holiday gift? Our magazine! And a cool tote bag, plus some great baking tools for holiday cookies. More details here.Explore Bon Appétitholiday2018CheeseCrackerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-10", "author": ["Condé Nast", "Carey Polis"]}