{"id": "dfd7267c86e8a66cf22730e643e29943", "url": "https://www.bonappetit.com/story/matcha-dipped-strawberries", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Chocolate Covered Strawberries With a Twist | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMatcha-Dipped Strawberries Are the Dessert We're Bringing to Every Summer HangEdible Arrangements who?By Aliza AbarbanelJune 5, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Rebecca JurkevichFacebookTwitterEmailChocolate-covered strawberries are cheesy. Not that I haven't impulse-bought a few during the post-Valentine’s Day clearance sales, but the designated dessert of romance has long been ripe for a revamp. And it deserves one! Because chocolate-covered strawberries are a pretty perfect make-ahead dessert, especially for large groups.Luckily, Bon Appétit senior food editor Claire Saffitz made a matcha-dipped strawberry that feels totally modern—not mail order. “Matcha is so grassy and vegetal that it pairs really well with that sweet white chocolate,” says Saffitz. Not a matcha fan? Consider this recipe an invitation for experimentation.Start your magic shell by combining chopped white chocolate and melted virgin coconut oil in a heatproof bowl set over a saucepan of simmering water, which helps the chocolate melt smoothly and evenly. Then mix in a powder like matcha or freeze-dried fruit pulverized in a blender for added color and flavor. When the chocolate mixture is nearly smooth, remove it from the heat and stir until the chocolate is totally melted, then chill it in a bowl of ice water and stir until it's thicker and starting to lose its sheen. If the mixture gets too thick and hardens, just remelt it.The chocolate mixture sticks best to cold, dry fruit, so avoid using wet berries or fruit with cut edges. We recommend chilled stem-on strawberries, cherries, or frozen bananas. Just make sure to pat your fruit dry, then dip into the chocolate. Let  the excess drip off, then place each fruit on a parchment-lined baking sheet, quickly sprinkle with toppings, and chill until set.These matcha-dipped strawberries use a mix of black and white sesame seeds for added color and texture, but the topping options are endless. Try toasted coconut flakes, flakey salt, toasted chopped almonds, bee pollen, or even citrus zest. Here are some combinations to get you started:Cherries + White Chocolate Shell + Crumbled Freeze Dried StrawberriesDouble up on fruit for added sweetness and a beautiful color contrast.Strawberries + Blueberry White Chocolate Shell + Toasted Coconut FlakesMix freeze dried blueberry powder into your magic shell for a festive Fourth of July treat.Frozen Bananas + Matcha White Chocolate Shell + Bee PollenBee pollen provides crunch, color, and a hint of earthiness to play off the matcha.Whatever combination you choose, these riffs on dipped fruit are the perfect end to a summer dinner party. You can make a batch up to a day beforehand; just cover the sheet tray with plastic once the shell hardens so they don't pick up any fridge odors. You should probably make a double batch while you're at it—these berries go fast.Get to dippingMatcha-Dipped StrawberriesMatcha and sesame seeds take these strawberries to a place chocolate-dipped berries only dream of.View RecipeExplore Bon AppétitHealthyishHealthy DessertsStrawberryWhite ChocolateMatchaSummer DessertsRead Morecooking82 Healthy Summer Recipes to Make Over and Over AgainGallery82 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-05", "author": ["Condé Nast", "Aliza Abarbanel"]}