{"id": "dfdc1eff5708b9ec72128e7a3ed48f58", "url": "https://www.bonappetit.com/story/how-to-hold-a-knife", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "How to Hold a Kitchen Knife Like a Pro | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Hold a Kitchen Knife Like a ProThe finger protection program.By Sarah JampelNovember 12, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailWant to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: knives.There is only one entirely incorrect and extremely dangerous way to hold a knife. If you’re gripping it by the handle, you’re already doing it mostly right.That said, not every knife grip provides the same level of control and safety. The goal with any grip is to help you be precise (that’s obviously more important if you’re dicing an onion than halving a winter squash) while providing protection for your valuable and vulnerable fingertips.Perhaps the most natural way to hold a knife is the handle grip—you wrap all five fingers around the handle—there’s no contact with the blade. But for the most power and dexterity, consider the pinch grip (a.k.a. the blade grip). Rather than curling all your fingers around the handle, wrap only your pinky, index, and middle finger. Put your bent pointer finger on one side of the blade and your thumb on the opposite side, like you’re pinching the blade between them. While this takes some practice and might feel a bit awkward at first, it will help you make thinner, more direct cuts. It’s like the difference between holding a pen or pencil in the middle versus moving your fingers very close to the tip, which will allow you to make more detailed strokes in smaller writing.Choke up on the knife, then tuck your fingertips under when you slice.\nWhat you do with your other hand is just as important. The claw (a.k.a. the guide hand) helps you make even cuts while keeping your fingers out of harm’s way. To do it, hold the ingredient like you’re imitating a cat, with your fingertips curled under and tucked away: Your knuckles will press into the ingredient and your thumb, positioned back and below, toward the cutting board, will help to stabilize it. The knife should be flush against your knuckle and you’ll move your hand backward as you continue to slice.Once you’ve mastered the gripper and the guider, the one thing left to do is to practice your knife skills:For Your Own Safety, Please Learn These 18 Basic Knife SkillsTime to practice.View StoryExplore Bon AppétitKnivesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-12", "author": ["Condé Nast", "Sarah Jampel"]}