{"id": "dfe95fe7609acb0bfd444059ba7c9542", "url": "https://www.bonappetit.com/story/dansko-cooking-shoes", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "The Cooking Shoes I Can’t Live Without | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt Never Occurred to Me to Have Cooking Shoes, Now I Can’t Cook Without ThemHow Carla Lalli Music changed my shoe game forever.By Alex BeggsMay 8, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I often bite off more than I can chew. The third slice of pizza. The fourth helping of any potato product. Stacks from the library I’ll never finish by due date. And on the weekend, I think it’s relaxing and fun to take on four to seven cooking projects. Double that if people are coming over. By the time guests arrive for cocktails, all I want to do is sit down and never get up again.BECAUSE MY FEET HURT.Cooking all day—and this is no surprise to any professional cook, nurse, or teacher—puts a lot of weight on the ol’ feet. Mine happen to be nearly flat. I have an array of slippers at home for various seasons, occasions, and suitors, but none of them offer sole support. I needed the clogs Carla wears. Carla clogs.Bon Appétit food director Carla Lalli Music is the inventor of a famous burger special sauce and the author of a fantastic cookbook, but she’s one of my personal heroes for her choice in  shoes alone. Carla has fancy clogs and work clogs, and it’s the work clogs I needed. She confirmed this when I asked her about them and all she said was: YOU NEED THEM, BEGGS!So I bought a pair of deep brown leather Danskos with a wooden sole for wearing to work. A year later I bought a summery pair in “professional honey distressed” (an eternal mood). But the best move was the white leather pair I got as a birthday gift, which my entire family knew I wanted (I talk about the gifts I want a lot—it’s subtle and effective). That’s my cooking pair. I like their sanitary, Nurse Ratched vibe. I wear them on the weekend when I’m making a fresh batch of chile crisp, boiling a pot of lentils, and waiting for the timer to go off on a butter-based cake. I might do some laundry or throw away things people I live with won’t notice are missing. I get shit done in my Danskos.*Cue infomercial host voice.* Danskos support your sticks while you stand for hours. The design is intent on keeping your foot stable. Please note the anatomically contoured sole, the rounded and rock solid “reinforced toe box,” and the “anti-fatigue rocker bottom.” The design is purposefully, functionally ugly. It’s an acquired look—after a while they start to appear downright beautiful to the beholder. They can repel water and oil; the leather develops patina with age. They’re heavy, sturdy shoes with an unusual fit (your heel is supposed to barely slip out of the back as you walk, it’s almost loose-fitting), and therefore not for everyone. But for this flat-footed kitchen wench they’re godsent. By the time the fire alarm stops yowling and the drinks are poured, I’m ready to stand until I can’t stand it anymore. But usually that’s not until the third martini.Buy it: Dansko Professionals, $120All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-08", "author": ["Condé Nast", "Alex Beggs"]}