{"id": "dff9ce742e58272130d0e1e8deb3ea78", "url": "https://www.bonappetit.com/recipe/soy-glazed-tofu-and-mushrooms", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Soy-Glazed Tofu and Mushrooms Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSoy-Glazed Tofu and MushroomsBy Andy BaraghaniDecember 26, 20194.3(64)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintChoose your mushrooms carefully: Crimini and white button will never get as crispy as oyster or maitakes. This recipe is part of the 2020 Healthyish Feel Good Food Plan, a ten-day headstart toward eating well all year long. Ingredients4 servings114-oz. block extra-firm tofu, drained3Tbsp. vegetable oil, divided12oz. mixed mushrooms (such as maitake, shiitake, and/or oyster), stems trimmed, torn into 2\" pieces3celery stalks, thinly sliced on a diagonal12\" piece ginger, peeled, thinly sliced½–1serrano chile, thinly sliced3Tbsp. low-sodium soy sauce1tsp. toasted sesame oilKosher salt1lime, halved½cup coarsely chopped cilantroCooked short-grain rice (for serving)PreparationStep 1Cut block of tofu into thirds crosswise, then cut each piece crosswise again into 3 pieces (you should have 9 square-ish pieces). Pat dry with paper towels.Step 2Heat 2 Tbsp. vegetable oil in a large skillet, preferably nonstick, over medium-high. When oil is shimmering and easily slides across surface of pan, cook tofu, undisturbed, until golden brown underneath, about 4 minutes. Turn and continue to cook until browned on second side, about 4 minutes. Transfer tofu to a plate, leaving oil in pan.Step 3Pour remaining 1 Tbsp. vegetable oil into skillet and heat over medium-high until shimmering. Add mushrooms to pan and cook, undisturbed, until crisp around the edges and browned underneath, about 4 minutes. Give mushrooms a toss and continue to cook, tossing often, until browned in most spots, about 4 minutes longer. Add tofu, celery, ginger, chile, soy sauce, and sesame oil to pan. Season lightly with salt and cook, tossing often, until celery is crisp-tender, about 3 minutes. Remove from heat and squeeze in lime juice. Scatter cilantro over and toss once more.Step 4Divide rice among bowls. Top with tofu and mushroom stir-fry.How would you rate Soy-Glazed Tofu and Mushrooms?Leave a ReviewTell us what you thinkReviews (30)Back to TopTriangleThis recipe was really yummy. I sliced the tofu lengthwise in half and put it in the toaster oven for about 5 minutes to dry the ouside better and have crisper tofu after frying. It worked really well. I skipped the lime and cilantro at the end because I didn't have any.  Even with that omission,  it was really flavorful,  fast and easy to make too. I'm already planning on making it for my sister. LalaLos Angeles, CA 11/24/2021Delicious and easy to make. I cut the block into 18 pieces instead of nine; they were crispier and absorbed more flavor.Tom CPhiladelphia, PA10/17/2021I liked the mushroom preparation and suggested seasonings for the whole dish. But the celery is weird in this. The tofu is a truly disappointing treatment! Delightful crunch with totally bland tofu underneath.SummerChicago9/8/2021Great dish! Have made it often. Latest variation subbed the tofu with oven roasted Japanese eggplant (brushed with EVOO and seasoned with salt and ground coriander). Added some slivers of garlic, 1tsp maple syrup and 1/2tsp garlic chili crisp. Broiled some farm CSA shishitos on the side Joanna8/17/2021I tried it exactly by the recipe the first time and found it lacking in flavor and texture so I made some adjustments when I made it again; I cut the tofu thinner to get a better crisp and to the sauce I added 2 tbsp chili crisp, 2 tbsp mirin, and1 tbsp of oyster sauce. I also threw in some sliced onions and freshly minced garlic with the onions. Perfect. Meegs7/26/2021I loved the quality of the ingredients and we even added some green beans but thought it lacked flavor. I added a bit of honey and chicken stock at the end but still something was missing. I finally added some truffle oil and that helped it out. Perhaps seasoning the tofu would help. Sana F.Concord, CA1/14/2021One of the best things I've ever tasted. Rich, flavorful and satisfying. This is going to be a real go-to. I'd serve this at a dinner party, proudly!LilyCanada, WA12/27/2020Great dish!! Love it!!Maria Del CarmenNew Jersey12/8/2020Perfect for post Thanksgiving.  I added a little extra soy and some honey and scallions and sesame seeds when playing but followed recipe closely.  This was so delicious! Definitely adding to my winter rotation. I recommend marinating the tofu beforehand but not necessary if you don’t mind a medley of flavors. EnriqueBrooklyn11/28/2020This recipe is quick, delicious, and easy to sub ingredients. I added 4 cloves of garlic and 6 sliced scallions. conniethecookWatertown,MA9/30/2020I thought this meal was pretty tasty, although quite salty! While stuffing my face watching Keeping Up with the Kardashians, I thought that it would be better with some added peanuts and a touch of honey! I also added green onions which was a good call. Santa Cruzz8/6/2020This was easy and delicious.  I was so excited when I read the recipe to see that I had all of the ingredients on hand.  My only difference was I used brown baby bell mushrooms.  It was fantastic. I served over a mix of quinoa and brown rice.  I will definitely make this again AnonymousMississauga, Ontario 7/20/2020So good! So, definitely use the low sodium soy sauce option. I didn’t and it was definitely a tad too salty but the extra lime helped balance that out. I used couscous to keep in the healthyish theme. My partner loved this and we’ll definitely eat it againadamleclairOsaka, Japan5/29/2020I like tofu. With a vegetarian wife, I make it all of the time. But it’s very easy to make bad, bland tofu recipes. This is unfortunately one of those. \n\nWhen you cook with tofu, you basically either need to marinate it before hand for about an hour or more, or you need to drench it in sauce. Otherwise it will taste like nothing. This recipe doesn’t call for either. I followed it anyway, because I’ve used quite a few recipes from the same author and loved all of them. I was severely disappointed in this one. \n\nEverything just tasted like salt, and I even used a high quality-low sodium Japanese soy from the local h mart. The mushrooms are good, but otherwise it was a big miss for me \n\nIf I were to make the recipe again, I would probably marinate the tofu ahead of time. I would also probably add some mirin or something a bit sweet, and swap lime for rice wine vinegar (a much more fitting acid imo).AnonymousPhilly5/20/2020Soooo - quarantine life! Made this semi close to the recipe but added/subtracted a lot of things based on what I had. I marinated the tofu first for an hour (garlic, ginger, soy sauce, rice vin, honey). Used a mix of shitake and cremini mushrooms. I made sure to take my time getting a good sear on the mushrooms - this is key.  Ran out of soy sauce half way through making this so towards the end I tried to up the flavor by adding a little white miso while sauteeing everything and also added some scallions. Overall - very good but I felt that if I hadn't made these flavor/ingredient tweaks it would not have been as good. jwolf829Nashville, TN5/1/2020Explore Bon AppétitStir-FryTofuOther IngredientsOyster MushroomMushroomVegetableMaitake MushroomCeleryShiitake MushroomWeeknight MealsQuickEasyMainDairy-FreeVegetarianVeganHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Andy Baraghani"]}