{"id": "dffe7aaad7bea730107747cf9d306b79", "url": "https://www.bonappetit.com/story/best-mini-spatula-gir", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "My Love for This GIR Mini Spatula Is Borderline Unhealthy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Love for This Spatula Is Borderline UnhealthyI don't have a problem, you have a problem.By Carey PolisJuly 17, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.In my utensil crock at home, I have 10 spatulas. And the thing is, I actually use all of them, from my fish spatula (pancakes!) to my offset spatula (frosting a cake!). I get strangely attached to my spatulas—and wooden spoons for that matter—they are like my kitchen children, each with their own special skill and traits.But if I had to start voting spatulas off the island, I know that my  silicone GIR mini-spatula would be one of the last ones standing. It doesn't bend too much like a lot of the rubber ones do, and it's just the right size (about 8 inches long) for a range of tasks from stirring a pot of rice to scooping the last remains of cake batter from the bowl.Most important, it's the only spatula I'll use for scrambled eggs; it perfectly shapes the eggs into the fluffy mass I crave. It's dishwasher-safe, but is also really easy to hand-wash, unlike a few other of my spatulas which will remain nameless. In short, it's sturdier than any other spatula I own, yet still giving the right amount of bend.I've had this spatula for years, and it looks as good as new. I've freaked out when I couldn't find it because my husband accidentally put it in the wrong place. And after our staff photographer shot the photo above, I sort of frantically got in touch with the photo team to ensure that I would get it back soon—I might have even used the phrase \"I just wanted to keep track of my spatula that I love dearly.\"So here's where it gets really weird. For my bachelorette party two years ago, I wanted to give my friends a small gift as a thank-you for traveling to a cabin in upstate New York for the weekend. I ended up buying the GIR mini-spatula in all the colors. Everyone got a spatula! And thus, my bachelorette hashtag was born: #spatularette.GIR Mini Silicone Spatula$15 $13 at AmazonExplore Bon AppétitWere Into ItToolsShoppingRead MorecultureThe Perfect Dish Rack for (Very) Small KitchensBy Alex BeggstechniquesPre-Cut Parchment Paper Keeps Me From Losing My MindBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-06-07", "author": ["Condé Nast", "Carey Polis"]}