{"id": "e00521ae50825f0a3ce3d315bc64cff5", "url": "https://www.bonappetit.com/story/how-to-choose-the-right-hot", "year": 2019.0, "month": 8.0, "day": 5.0, "content": "How to Choose the Right Hot Sauce for the Job | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Choose the Right Hot Sauce for the JobVinegary hot sauce? Fermented? Garlicky? Ultra-spicy? There's a right answer.By Alex DelanyAugust 29, 2019FacebookTwitterEmailPhoto by Marcus NilssonFacebookTwitterEmailWe have hot sauce YouTube shows. Hot sauce internet challenges. Hot sauce t-shirts. Hot sauce conventions. Hot sauce subscription services. Hot sauce shops. And hot sauce sommeliers. Hot sauce culture is alive and well in the world. But in all this hot sauce hysteria and with all these hot sauce varieties, we shan't ignore one glaring fact: Not all hot sauce is the same.And that becomes especially important when it comes to cooking food at home with hot sauce. Or topping the food you just spent your valuable time making with some liquid heat. You need to know what kind of hot sauce is going to make your food taste the best it possibly can. Grab a glass of water, because we’ve got the hot sauce answers for you right here:Photo by Chelsie CraigCrystal, Texas Pete’s, Frank’s RedHot, and TabascoAll of these hot sauces contain more vinegar than they do water, which means they taste just as acidic as they do spicy. Vinegar-based hot sauces are tangy in the  clean, sharp way you’d expect from something made with a base of white vinegar (at least usually). These hot sauces are bright in flavor and they have an approachable spice level and clean pepper flavor.When it comes to using hot sauces like Crystal or Tabasco, you have to take the high acid level into account. They’re great for delivering flavor and acid in marinades, sauces, and dips, as well as adding a little flare to a slice of pizza, among other low-acid or high-fat foods. And if you’re making Buffalo wings, you’ll need to use one of these vinegary hot sauces to get that spicy, tangy, buttery sauce tasting right.Those big hunks of burrata needs a hit of Crystal or Frank's to cut some richness.\nBut if what you’re adding hot sauce to already has a bit of acid in it, you might want to consider using a hot sauce in the next category. That brings us to...Tapatio, Cholula, and ValentinaThese are all Mexican hot sauces, and while the country of origin doesn’t hold any real restriction over the contents of a hot sauce, you’ll find that these hot sauces all contain more water than they do vinegar. That means that the emphasis is on the chile, not the acid. Generally thicker-bodied, they have the same clean, approachable chile flavor of vinegar-based sauces but without the tang.We like to use these chile-forward hot sauces on dishes that already contain some sort of acidic component or don’t need any acid at all. Tacos with a squeeze of lime don’t need more acid, and soft-scrambled, buttery scrambled eggs don’t really want any acid to disrupt the pillowy creaminess. A hot sauce like Cholula works perfectly for both.When we've already got pickled veg, we go for a non-vinegary hot sauce like Cholula.\nAlex LauSriracha, Sambal, and the Funky BunchThere are more flavors than just spicy or acidic to talk about in hot sauce, and those flavors become especially important (and interesting) when there are additional ingredients or factors—like fermentation!—in the mix.For hot sauces and pastes like sriracha and some varieties of sambal oelek, a handful of additional ingredients like lime juice, garlic, and sugar add more flavor. Sriracha and sambal are great to use in marinades, braises, and sauces, since they bring a more complex profile. But they can still be used as condiments too (you've seen sriracha drizzles all over the internet, right?).And then there are fermented hot sauces. Yes, they’re good for gut health, but fermented hot sauces are also funkier and more umami-loaded than their non-fermented counterparts. The fermentation process (what happens when the peppers are mixed with some kind of sugary substance and left to sit out, giving yeast and bacteria in the air a chance to process the sugar) mellows the spice of the peppers and creates a tang. Most fermented hot sauces often contain additional ingredients.Sambal is the key ingredient in the sauce for these Spicy-Sweet Pork Noodles.\nPhoto by Chelsie Craig, Food Styling by Pearl JonesThe XXX, Near-Death, Violent SauceWhen we talk about adding hot sauce to your food, this isn’t what we’re talking about. If there’s some kind of note on the bottle that makes it seem like the people who made the hot sauce were intending to hurt you, it probably won’t add much to the experience of enjoying your food. That’s not to say you can’t touch the stuff. If you’re the type of person who likes to impress friends with feats of bodily destruction, by all means, go for it. But we prefer to eat with our taste buds intact.And now for some Buffalo wings:Basically Buffalo WingsWant crispy-spicy chicken wings without having to deep-fry at home? We got you.View RecipeExplore Bon AppétitBasicallyPepperHot SauceChileCondiment/SpreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-29", "author": ["Condé Nast", "Alex Delany"]}