{"id": "e01339d5a60d348e8f5e117fa175343d", "url": "https://www.bonappetit.com/story/never-fail-pesto-potato-salad", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "This Pesto Potato Salad Doesn't Know It's Beautiful | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Pesto Potato Salad Doesn't Know It's BeautifulDon't let this salad be a wallflower—it really deserves to be the first one on the dance floor.By Carey PolisApril 19, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I have come to terms with the fact that, while I am a decent cook, I am not a very good food stylist. My meals will taste good, sure, but my galettes will always err on the side of \"too rustic,\" my avocado toast will inevitably be a bit too brown, and my pasta will never look as glossy as it does in the pages of a magazine. I have adapted—I can normally cover various blemishes with a shower of fresh herbs, or a strategically placed dollop of yogurt.But I don't have to resort to such trickery with this recipe for pesto potato salad, which not only relies on—but in fact doubles down on—ingredient imperfections. You see, there are no perfectly sliced eggs or uniformly round potatoes in sight. Instead, you use your hands to tear craggy boiled potato chunks and uneven eight-minute egg pieces (a real life raft for those of us that can't peel an egg without leaving at least a few pockmarks). Plus, you plop a sort of muddy-green chunky pesto all over the platter, further hiding anything that doesn't want to be seen.Okay, okay: I get that terms like \"muddy\" and \"plop\" don't necessarily invite you to take a giant spoonful. But the rough edges of this dish are what's so wonderful about it—what makes it beautiful, if you will. Because everything on the platter is in an amorphous shape, the lack of uniformity becomes the dish's selling power. The ugly duckling was the swan this whole time!The dish has become something of a having-people-over signature for me. Finicky guests are generally okay with the ever-so-slight jamminess of an eight-minute egg and those that love a runny yolk are glad the eggs haven't gotten to the Grayish-Yellow Point of No Return. Eggs for all people! And the pesto is one of my all-time favorite versions: a mix of toasted walnuts, basil, garlic, lemon zest and juice, Parm, olive oil, salt and pepper. It's what makes the salad feel like a salad and not just a platter of eggs and potatoes. To finish the dish, top with more basil and shaved Parm to create a glorious and gorgeous mess.Get the recipe:Pesto Potato SaladTo test boiled potatoes for doneness, use a skewer or the tines of a fork rather than the tip of a knife so you know they’re truly tender (a knife slides through the flesh way too easily). To test boiled eggs for doneness—wait, you can’t! Just make sure the eggs are room temperature when you drop them in the water (otherwise they’re prone to cracking), set a timer right away, and have an ice bath at the ready.View RecipeExplore Bon AppétitPotatoPestoBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-19", "author": ["Condé Nast", "Carey Polis"]}