{"id": "e026f72e7bbd4e1f81c152f9fc6f6457", "url": "https://www.bonappetit.com/story/food-allergy", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "Why Food Allergies Aren't As Common as We Think | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThink You Have a Food Allergy? This Study Says There's a Good Chance You’re Wrong.And if you're cutting out entire food groups because you think you're intolerant, you could be doing more harm than good.By Dana NahaiMarch 22, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Anna BillingskogFacebookTwitterEmailThink you have a food allergy? Join the party. Nearly 20 percent of adults in the U.S. think they’re allergic to one or more foods, but research published earlier this year found that about half of them are right. The survey looked at a nationally represented group of more than 40,000 adults, and the results were stunningly consistent. As a dietitian, I see this play out in my practice all the time: Clients come to me suspecting that they “can’t” eat something, often wheat or dairy, but contrary to what they think, there is no diagnosable offender. So if you suspect that food is making you feel bad, how do you figure out if it’s an allergy or if there’s something else going on?We need to start by getting the terminology straight. There are food allergies and food sensitivities, both of which can be referred to as food intolerances. Ruchi Gupta, M.D., lead author of the new research study, says that many people talk about allergies and sensitivities interchangeably, when in fact they represent “very different conditions that often require different strategies for day-to-day management.”The quick-developing skin rash, mouth swelling, or breathing trouble triggered by an allergy are severe immune reactions that are easy to diagnose through a blood or skin test. This is the life-threatening, EpiPen-carrying category of food intolerance. There are more than 170 foods that cause allergic response, the most common offenders being shellfish, milk, peanut, tree nut, finned fish, egg, wheat, soy, and sesame.A food sensitivity, on the other hand, is not so much life-threatening as troublesome. Symptoms are less severe and often delayed, including headache, brain fog, fatigue, stomach upset, joint pain, or other debilitating side effects. Unlike an allergy, having a sensitivity to a food is harder to diagnose because blood tests can be inconsistent, and some people with sensitivities aren’t always obviously reactive to that food. For example, many people who are sensitive to raw eggs or milk can eat these ingredients cooked. And, unlike allergies, food sensitivities will often wax and wane with the health of one’s immune system.If you suffer from digestive cramping, bloating, or chronic fatigue, there’s a reason why, but I tell my clients to avoid self-diagnosis; the results are often wrong and potentially hazardous. When I’m diagnosing a food intolerance, I begin by listening. If a client says to me, “I eat hummus and get a rash” or “I eat ice cream and run for the bathroom,” then that’s an obvious reason to eliminate a food and head straight for testing. People who tell me they are picky eaters may have an undiagnosed food intolerance: When you don’t know which foods make you feel sick, you learn to eat from a very narrow list of choices.If they complain of unexplained pain, fatigue, bloating, or stomach cramping, I comb through their medical history and lifestyle routines. Does autoimmune disease run in the family? Does the client have a recent history of prolonged antibiotic use? Do they have a high stress job or Type A personality? Answering yes to one or more of these questions can put people at risk for symptomatic digestive problems that can appear like a food intolerance. Add to this a regular habit of fast food, fried food, soda, and processed snacks, and the symptoms will amplify.But the path to healing is not always as simple as switching to a strict, clean-eating routine. On several occasions, I've seen clients try to ‘reset’ their gut health with a raw food or ketogenic approach, but these styles of eating can stress an irritated digestive tract and result in increased pain.If I can’t identify a clear food intolerance, I’ll have them cut out the most common dietary offenders: processed convenience foods, added sugar, flours, fried food, excessive meat, sodas, unfermented dairy, artificial additives and flavorings, and preservatives. Thirty days of this no-processed, plant-based approach allows most people enough time to heal dietary inflammation without too much suffering. But just as important as the food we do (or don’t) eat is the way we manage stress and calibrate our physical energy. The human body is built to move, rest, and recover, and without an adequate amount of each, even the best food can’t do its job.So if you’re wondering whether you have a food intolerance, know that there is no stand-in for being evaluated by a trained clinician, but improving how you eat, move, sleep, and manage stress can help reverse dietary inflammation and get you feeling better with real food; no long-term restrictions required.Dana Nahai is a registered dietitian nutritionist, cook, and writer. She uses science-based nutrition to teach people how to eat food they love and feel great.Explore Bon AppétitHealthyishTrendsessayRead MoreLifestyleA Lactose Intolerant's Guide to Loving Cheese AgainBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-21", "author": ["Condé Nast", "Dana Nahai"]}