{"id": "e02956f563fa05ad96f719415be7ede0", "url": "https://www.bonappetit.com/city-guides/washington-dc/venue/sfoglina", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Sfoglina Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginwashington dcSfoglinaAs close as you'll get to an Italian villa this side of the AtlanticFacebookPinterestTwitterEmailPhoto by Beth KennedyGO HERE: for a rotating mix of all-day handmade pastas and Healthyish options that you could eat for lunch and still manage to go back to work afterward. Plus, an impressive-yet-unintimidating wine menu that breaks down wines into simple descriptors like \"bigger, bolder reds\" and \"full and round whites.”ORDER THE: trio of pastas, served family style, for a “surprise me” situation. There are new hand-rolled specials daily, but mainstays are the carbonara-style spaghetti chitarra; translucent, tender pappardelle with a simple butter and Parm sauce—and optional shaved truffles in season—and inventively-filled tortellini. Also look out for \"not pasta\" options like 72-hour braised short ribs over polenta with tender, sweet onions agrodolce or whole fish. There are also gluten-free options for those friends who usually can’t do Italian with you.FOR A LITTLE MORE BALANCE: At lunch, “Maria’s Menu” offers a two-course healthyish Mediterranean menu (from grilled cod and chickpeas to summer gazpacho), giving you a nice excuse to end the meal with house-made soft-serve gelato.THE VIBE IS: bright and spacious by day, cozy and homey by night. As casual or as formal as you’d like—you could just as easily come from work or take a date here. Sit at the bar and watch pasta fed through the extruder into dozens of shapes, or lean into comfortable pillows at a wooden booth in the back. In the warmer months, pick a table in the covered veranda or outdoors on the patio. It’d be excellent for a birthday party.PRACTICAL STUFF: Reservations available via Reserve or by phone at at 202-350-1312. Open 5 p.m. to 10 p.m. Mondays, 11:30 a.m. to 10 p.m. Tuesdays through Thursdays, 11:30 a.m. to 10:30 p.m. on Fridays, 10:30 a.m. to 10:30 p.m. on Saturdays, and 10:30 a.m. to 9 p.m. on Sundays. (Brunch served until 2:30 p.m. on weekends.)Photo by Greg PowersWE ALSO LOVEBad SaintBold Filipino cooking that tastes best with beer and loud musicPineapple & PearlsThe café slash fine-dining restaurant from the folks at Rose’s LuxuryTimber Pizza CompanyYour (dream) neighborhood pizza jointExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-01-25", "author": ["The Bon Appétit Staff"]}