{"id": "e032f1965ff96b6da2921f53c90f9099", "url": "https://www.bonappetit.com/recipe/strawberry-raspberry-fools", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Strawberry-Raspberry Fools Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueStrawberry-Raspberry FoolsBy Chris MoroccoJuly 9, 20194.4(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThere are few joys greater than eating ripe berries straight from the carton. But here’s one: tossing them with sugar so they’re juicier and sweeter, then folding them into freshly whipped cream. Whipping the cream by hand means soft, billowy peaks—just right for folding in macerated berries. If you’d like, hold back a few berries for topping.Ingredients4 servingsWhipped Cream1cup chilled heavy cream1Tbsp. sugar1tsp. vanilla extractSmall pinch of kosher saltMacerated Berries1lb. raspberries and/or strawberries, halved, quartered if large¼cup sugarSmall pinch of kosher saltPreparationWhipped CreamStep 1Using the largest (and widest) whisk you have, beat cream, sugar, vanilla, and salt in a large chilled bowl until soft peaks form, 3–6 minutes, depending on how many breaks you take.Step 2Do Ahead: Whipped cream can be made 2 hours ahead. Cover and chill. Just before serving, whisk cream once or twice to refluff, but don’t overwhip it.Macerated BerriesStep 3Combine berries, sugar, and salt in a medium bowl. Let sit, tossing occasionally, until juicy, at least 15 minutes.Step 4Add berries to whipped cream and fold gently until mixture is streaky but barely combined (just one or two strokes should do it). Scoop into small glasses.Step 5Do Ahead: Berries can be macerated 2 hours ahead. Leave at room temperature.How would you rate Strawberry-Raspberry Fools?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleEasy fancy delicious! I may use it for a Christmas dinner dessert bacause it's so light and festive. Could I thaw and drain frozen berries? So so yummy!CathyGod's Country- North Bay ON Canada9/12/2021So simple, so delicious. My friends devoured their bowls in seconds! The perfect summer dessert, period.alizaraeNew York 7/15/2019Explore Bon AppétitFruit DessertDessertBritishEuropeanStrawberryBerryFruitRaspberrySummerQuickEasy5 Ingredients or FewerGluten-FreeNut-FreeHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Chris Morocco"]}