{"id": "e03886952f4545832ca3a774a30d3cd8", "url": "https://www.bonappetit.com/recipe/creamy-shrimp-on-crackers", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Creamy Shrimp on Crackers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueCreamy Shrimp on CrackersBy Omar TateJune 2, 20204.7(4)Read ReviewsTriangleEmailPinterestPrintPhotographs by Mamadi Doumbouya, food styling by Pearl Jones, prop styling by Shannon MaldonadoEmailPinterestPrintEmailPinterestPrintTangy cream cheese and sour cream play up the shrimp’s natural sweetness in this traditional appetizer from Omar Tate, chef-owner of the pop-up dinner series Honeysuckle. Hot tip: Poach your shrimp and make your dressing in advance to save time, but don’t mix them until an hour before serving, or the shrimp will get tough.IngredientsMakes about 321lb. shrimp, peeled, deveined1Tbsp. plus ½ tsp. Diamond Crystal or 2 tsp. Morton kosher salt3Tbsp. sour cream2Tbsp. cream cheese, room temperature¼cup finely chopped celery2tsp. extra-virgin olive oil1tsp. finely grated lemon zest1Tbsp. fresh lemon juice32butter crackers (such as Town House)1Tbsp. Barbecue Seasoning or paprikaPreparationStep 1Combine shrimp, 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, and 1 quart water in a medium pot.  Set over medium-low heat (you want water to slowly come to a bare simmer) and cook until shrimp are just cooked through, 10–12 minutes total. Drain and transfer shrimp to a plate; let cool.Step 2Meanwhile, mix together sour cream, cream cheese, and remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a medium bowl. Mix in celery, oil, lemon zest, and lemon juice.Step 3Slice chilled shrimp in half lengthwise, then crosswise into ¼\"-thick pieces. Fold shrimp into dressing.Step 4To serve, top each cracker with 1 Tbsp. dressed shrimp; sprinkle with seasoning.Step 5Do ahead: Shrimp can be poached and dressing made 1 day ahead. Cover and chill separately.How would you rate Creamy Shrimp on Crackers?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI've made this a couple times and it hits all the right notes. Crunchy, creamy, smoky, bright. Served it on Memorial Day with some sliced watermelon with mint and smoked salt. The barbecue seasoning sprinkled on top of the shrimp salad really set it off. Great recipe.AnonymousDenver, CO4/1/2021Explore Bon AppétitShrimpShellfishSeafoodEasySnackStarterJuneteenthKwanzaaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Omar Tate"]}