{"id": "e03e7f1b456e1ccf269363c72087dc3a", "url": "https://www.bonappetit.com/recipe/broccoli-soup-with-turmeric-peanuts-and-crispy-shallots", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Broccoli Soup With Turmeric, Peanuts, and Crispy Shallots Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueBroccoli Soup With Turmeric, Peanuts, and Crispy ShallotsBy Andy BaraghaniJanuary 12, 20214.2(82)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jessica Pettway, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintYou won’t find a drop of dairy in this bright green version of the cafeteria standard cream of broccoli soup. It gets extra color from spinach and a perfectly creamy texture from potato. To make the soup vegan, replace the fish sauce with a spoonful of white miso.Ingredients4 Servings2medium shallots, thinly sliced into rings½cup plus 3 Tbsp. vegetable oil⅓cup unsalted dry-roasted peanuts, coarsely chopped½tsp. ground turmericKosher salt2small heads of broccoli (about 1½ lb. total)1large onion, finely chopped1serrano or other green chile, thinly sliced4garlic cloves, coarsely chopped1medium Yukon Gold potato, peeled, cut into 1\" pieces1bunch mature spinach, thick stems trimmed1Tbsp. fish sauce½cup mint leaves and/or cilantro leaves with tender stemsPreparationStep 1Combine shallots and ½ cup oil in a medium pot and set over medium heat. Cook, stirring occasionally, until shallots turn pale golden, 7–9 minutes. Add peanuts and turmeric and cook, stirring occasionally, until shallots are golden brown and mixture smells very nutty, about 2 minutes. Remove pot from heat and strain through a fine-mesh sieve set over a medium bowl. Let oil cool, then stir shallot mixture back in. Season with salt; set aside. Clean pot and reserve.Step 2Trim 1\" from bottom of broccoli stalks, then peel. Remove stalks from crowns and thinly slice; set aside. Coarsely chop florets into 1\"–2\" pieces; set aside separately.Step 3Heat remaining 3 Tbsp. oil in reserved pot over medium-high. Add onion and cook, stirring occasionally, until softened and beginning to brown in spots, 7–9 minutes. Add chile and garlic and season with salt. Cook, stirring, until garlic softens, about 3 minutes. Add potato and reserved broccoli stalks to pot and stir to coat in onion mixture. Pour in 5 cups water, season with salt, and bring to a boil over high heat. Reduce heat to medium-low, cover pot, and simmer until potato and broccoli stalks are tender, 12–15 minutes.Step 4Add two thirds of reserved broccoli florets to pot, cover, and cook until bright green, about 4 minutes. Add spinach and cook, stirring, until wilted, about 1 minute. Remove pot from heat. Working in small batches, purée in a blender until very smooth. Transfer to a large bowl as you go, then return to pot. (Or use an immersion blender if you have one and blend directly in the pot.)Step 5Set pot over medium heat and add remaining broccoli florets. Cover pot and cook until florets are bright green, about 4 minutes. Stir in fish sauce; taste and season with more salt if needed.Step 6Divide soup among bowls and top with herbs and reserved shallot mixture.How would you rate Broccoli Soup With Turmeric, Peanuts, and Crispy Shallots?Leave a ReviewTell us what you thinkReviews (28)Back to TopTriangleThis became an INSTANT family classic when I first made it in 2021. Everyone in the family loves it from my 1 year old and 3 year old to both adults. We use almonds in the topping because I'm allergic to peanuts. And we use fresh turmeric. I basically eat the topping while I'm making the rest of the soup. It's really delcious. Definitely make it! Natasha Los Angeles, CA 1/19/2022This soup rocks. I make it often and it’s one of my faves. Jen mad 12/29/2021This is our new favorite soup recipe! I will second the suggestion of frying shallots in oil and reserving, and we sub a cup of water for a can of coconut milk like commenter SN suggested, and it is stellar. We also use this recipe as a base for other veggie soups and have subbed butternut squash and swiss chard for the broccoli and spinach and we're working on one with fennel, leek and either turnip or parsnips. this is such a great recipe!Jenna MKansas City, MO, United States12/28/2021I have made this soup quite a few times now and it is delicious!  Like some of the other reviewers, I used a slotted spoon to take out the shallots and peanuts and used that oil for the onions.  The only other change I made was to add extra garlic.  Once everything is chopped up it comes together quickly.  My family and I found the soup quite flavorful.  As far as the heat goes, I have substituted in a jalapeno when a serrano pepper wasn't available.  When using jalapeno, I usually take out the seeds and ribs for those who can't tolerate much heat.   Lisa NSacramento, CA12/7/2021The end result was healthy and delicious, but based on the reviews, I made a lot of adjustments. First off, not sure why the recipe has you dump back your nicely crisped shallots back into the oil to soften? I ignored this. Like other reviewers, I fried the onion with some of the shallot oil. I also added cumin and coriander seed with the garlic for some added flavor. Instead of water, I used half chicken, half vegetable stock. Tried to use my immersion blender, but it doesn't break down the spinach enough to get a smooth soup, so I put it in the blender for that bright green you see in the photo. I finished it off with 3tbs fish sauce and the juice of a lime, which really brought it together. I topped it with some toasted coconut and coconut milk, but it's creamy and filling enough without it. Would definitely make it again like this!SNAmsterdam, NL11/9/2021One of my favorite soup recipes and have made it multiple times for dinners.  I follow the recipe exactly.  That one potato does WORK in making it creamy and filling.TaylorMilwaukee, WI10/10/2021I just tried to give this a 3 star rating and it wouldn't let me select anything other than a 5.... what the heck?\nThis is food stylist soup. Looks beautiful, but doesn't have much flavour. I read the reviews before making it, thinking I could tweak it to be better, but it still took a lot of changing. I'd much prefer to have a flavourful soup recipe from the get-go instead.\n\nThe crispy shallots and peanuts are tasty on their own, but once I added them to the soup they felt out of place. The stars are for the fact that I'll probably remake the shallots and peanuts for other dishes where they won't feel like an afterthought (sorry).AnonymousToronto, ON4/24/2021I liked this soup, didn't love it.  The soup needs a lot of salt to taste good and I'm not sure about the shallot topping, it adds flavor but a little a something is missing overall.  That being said, the base soup is very solid and relatively healthy.  I would make it again but add some tweaks to make it more delicious. C in San Francisco4/19/2021This was really nice! The shallot peanut topping is fantastic. One of those heck yeah I'm so happy I have a immersion blender recipes! I added just a small tablespoon or so of better than bullion caramelized onion flavor instead of salting the water more which was lovely and worked out great. I served with some super easy flatbreads and added a little turmeric to the dough to tie it all together - was a great meal! Would love to hear what other folks served this with as it is on the lighter side. kmarxmarxchicago, il4/13/2021Lots of reviews say too many steps but if you chop up the veggies ahead of time it’s very easy and not a labor intensive recipe at all. Next time I’ll probably cook the onions in the turmeric oil and blend in the mint and cilantro for more depth. Otherwise a beautiful and light soup. HannahPortland girl in LA4/4/2021Wow this is seriously delicious! I love the crispy shallots on top!Audrey4/1/2021Loved this recipe! Like others I used olive oil instead of vegetable oil and it was great. I think I missed a part with getting the shallots crispy but I liked them how they turned out - very soft. Next time I'd try for the crisp! Also, I used four cups of water instead of five because I was worried about the consistency. I thought it came out great, maybe a little creamier/thicker than it would have with five cups. I considered using chicken or vegetable stock instead of water but with a large onion and all the veggies, the flavor was fab.Gabi MSeattle3/12/2021This is a delicious soup! After looking at other reviews, I decided to add some toasted coconut to the shallots and peanuts. This took it over the top! Otherwise I followed the recipe. Definitely a keeper!DottymOradell, NJ3/2/2021Tastes like blended broccoli. Anonymous2/25/2021This was really good! It was spicy with 1 whole serrano (I liked it but too spicy for my bf). Next time I will remove the seeds. I used 4 cups vegetable broth 1 cup water for more flavor. I also blended some mint and cilantro into the soup.\n\nI consolidated some of the steps because it seemed unnecessarily labor intensive. I simply cut the broccoli stems into the center instead of peeling them. I used extra florets instead of having to peel all the stems because I prefer the taste of the florets anyways. Overall this was really good! I also subbed for olive oil and separated the shallots and peanuts from the oil to keep them crispy.AnonymousBrooklyn, NY2/9/2021Explore Bon AppétitSoupSoups and StewsBroccoliVegetableSpinachLeafy GreensEasyWeeknight MealsOne-Pot MealsMainDairy-FreeGluten-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Andy Baraghani"]}