{"id": "e04261b5439a79b53335b6f8a13ea894", "url": "https://www.bonappetit.com/story/branded-5-portland-restaurants-to-eat-at-right-now", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "5 Portland Restaurants to Eat at Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored5 Portland Restaurants to Eat at Right NowThe playfulness, deliciousness, and diversity of Portland cuisine can be found in every neighborhood.By Travel PortlandJanuary 21, 2020FacebookTwitterEmailFacebookTwitterEmailBefore farm-to-table made its way into our everyday vernacular, before food trucks were “a thing,” Portland had already begun making a name for itself as one of the nation’s most diverse and exceptional food cities. And for good reason. They weren’t following food trends; they were creating them.Divided by five distinct quadrants—North, Northeast, Northwest, Southeast, and Southwest—the city is teeming with legendary hot spots and emerging icons. You’ll find fresh oysters and a beer at a modest local haunt as quickly as you’ll find storied chefs whipping up new creations that draw lines down and around the block. The only trouble? Hungry diners (and you should come hungry) couldn’t possibly hit all of the city’s greatest restaurants in each quadrant.Whether you’re in search of a global adventure or brunch that will keep you coming back seven days a week, here are five of the most noteworthy restaurants in Portland right now, each in a different quadrant. There’s so much more to explore, but with only 36 hours, this ought to give you the perfect taste of PDX today.Eem, North PortlandTexas-style BBQ meets tropical influences at Eem, where Thai-inspired dishes and lively decor bring island vibes to life in the Pacific Northwest. It all began when Hat Yai co-founder and chef Akkapong \"Earl\" Ninsom and Matt’s BBQ pitmaster Matt Vicedomini joined forces to develop a menu that would marry the low-and-slow sensibilities of southern barbecue with the sweet, savory, spicy, saucy, and sticky flavors of Southeast Asian cuisine. To craft the drink menu, they brought on Eric Nelson, famed for his vacation-inspired cocktails, both boozy and spirit free. Together the trio has captured the hearts of Portland, and is exemplifying the diverse culinary fusion that’s continuing to define the city’s trailblazing attitude when it comes to food.At first glance, the menu may look familiar—sweet and sour fried chicken and BBQ fried rice (thoughtfully charred to perfection) are no doubt two Eem spins on comfort food favorites—but look closer and you’ll find nuanced combinations that define a new era of food in Portland. Try, for example, the white curry, which is a take on the vinegary white barbecue sauce of the south, with brisket burnt ends. This includes hunks of meat with roasted cauliflower, scallion, and pickle. The not-so-ordinary baby back ribs feature grapefruit, cucumber, Thai basil, toasted rice powder, and pickled shallot. A tamarind curry with steamed halibut is light and bright year-round. It’s this menu and a cheerful atmosphere that has earned the place “best restaurant” accolades from local and national press.Bhuna, Northwest PortlandChef Deepak Kaul worked in noteworthy kitchens in both San Francisco and New York City before coming to Portland, but that’s not how the locals know him. Portland loves chef Kaul for the Indian soul food of his youth that he shares at his fast-casual restaurant. This is not your run-of-the-mill Indian restaurant, but don’t worry, you can expect a few traditional dishes with a twist.There’s pork vindaloo with jaggery, a type of sugar often used in Asian cooking, and palak paneer with Kashmiri spices, fennel, and turmeric. Other favorites include Kashmiri Lamb Rogan Josh, mushroom naan, and fried calamari—their version famously dusted with chickpea batter. It’s these staples that created popular demand for chef Kaul’s cuisine. Before Bhuna’s brick and mortar opened in late 2018, chef Kaul was hosting pop-ups at spots like Culmination Brewing and Dick’s Kitchen. The people wanted more.Bhuna is Kashmiri in genre, but local in preparation. No matter which menu item catches your eye, rest assured that the ingredients are sourced in the Pacific Northwest. The beer, wine, and cocktail menus feature collaborations with local brewers and winemakers to offer selections that best complement the cuisine, and fall seamlessly in line with the eclectic menu (think: an Old Fashioned with garam masala syrup). Cheers to that.Yonder, Northeast PortlandEveryone knows that fried chicken is a staple of the American South—and don’t worry, Yonder’s got plenty of the popular mainstay, offered Dusted, Dipped, or Hot. But native Southerners, especially those familiar with the Appalachian variety, understand that the cuisine is inclusive of much more. That’s why North Carolina native Maya Lovelace also serves dishes like brunswick stew and sweet onion and catfish hushpuppies next to a cocktail menu that would appease anyone south of the Mason-Dixon line. The Hurricane Maya features cacao nib–infused rum, passionfruit, and clarified buttermilk, or there’s MeeMaw’s Tea, which is served with spiced peach tea, lemon, moonshine, and “unconditional love.”Chef Lovelace has been perfecting the cuisine of her childhood all over the country in hot spots like Atlanta, GA, and Charleston, SC, but it was in Portland where she launched her pop-up supper club, Mae, in which the storytelling of each dish came to be as anticipated as each menu item. Now at Yonder, chef Lovelace has curated a menu that pays homage to her past while utilizing ingredients from the Pacific Northwest. Comfort food is the language of all Southerners, one that (thankfully) extends to the rest of us. Whether you’re a local looking for a cozy plate of collards or a visitor hankerin’ for a little honky tonk and fried chicken, Yonder covers all the bases in Portland.Hey Love, Southeast PortlandHey Love is a tropical-themed, retro-inspired utopia full of global cuisine, boldly flavored beverages, lush interiors, and thoughtfully crafted music. Owned by industry vets Emily Mistell (Rum Club), Sophie Thomson (Bar Bar), and Dig A Pony co-owners Nicholas Musso and Aaron Hall, Hey Love puts chef Roscoe Roberson at the helm of the kitchen to serve international cuisine in a vibrant atmosphere.On the dinner menu alone, one can expect to cross continents with dishes like gochujang pork ribs, fried chicken chow mein, and chilaquiles verdes. And now with brunch served daily, diners can fully embrace the locale’s anything-is-possible-here vibes starting at 10 a.m., seven days a week.One of the major highlights of the spot, however, is its expertly crafted cocktails. Playful twists on classic libations, as well as inventive new creations, play a major role in spicing up the Hey Love experience. With everything from the Highballer (Suntory Whisky Toki, super sizzy soda, science, lemon oil) to the Master of Karate and Friendship (Funky Rums, Strawberry, Rosé), there’s a little something for everyone, whether you’re a neighborhood regular or just passing through.Lardo, Southwest PortlandMeat is the main idea here at Lardo, which started out as a food truck back in 2010 and now boasts two locations in Portland, as well as an outpost at The Cosmopolitan of Las Vegas. Favorites include the pork meatball banh mi and dirty fries. (That’s pork scraps, marinated peppers, fried herbs, and parmesan. If you weren’t hungry before, you probably are now.)Chef and owner Rick Gencarelli was trained at the Culinary Institute of America and went on to work at Aqua in San Francisco and Todd English’s Olives. But it was Portland’s burgeoning and unique food scene that caught his eye, inspiring him to open a spot “using old-world techniques, contemporary flourishes and a gonzo approach.”Most of the menu is pork or steak-based, though they’ve also got a Nashville hot fried chicken sandwich that’s worth writing home about, too. But what’s a bucket-list sandwich without a cold, crisp beer to go with it? Lardo prides itself in an extensive menu of rotating local brews, ranging from cider to stout. If you’re looking for a not-so-average deli experience, look no further—and prepare to be full.Just when you think you’ve seen it all, Portland continues to reinvent its culinary quests with diverse dining options and eclectic fusions from creative minds. From north to southwest, there’s a little something for every appetite (and then some).Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-20", "author": ["Condé Nast", "Travel Portland"]}