{"id": "e04b4e18f334b0d81734a36aff94fcc7", "url": "https://www.bonappetit.com/city-guides/montreal/venue/loic", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Loïc Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealLoïcAll roads (and great pét-nat) lead to this Saint-Henri wine barFacebookPinterestTwitterEmailMatthew PerrinGO HERE: for a predinner pregame. Loïc is just up the street from Elena and a bit farther down from Arthurs Nosh Bar, so it’s worth stopping in for an early pét-nat and a better-than-it-needs-to-be bar snack.ORDER: whatever visiting wine producer is pouring that night. For food, get the seafood platter, which is classic enough to satisfy and creative enough to impress; any of the pastas; or small snacks listed at the top of the menu.THE VIBE IS: chill yet a tad reserved. The intimate space (read low ceilings) encourages that kind of zen-like atmosphere; this isn’t isn’t the place to rage.PRACTICAL STUFF: Open Tuesday to Sunday 5 p.m. to 3 a.m., with the kitchen serving food until 11 p.m. Closed Mondays. Call for reservations, which are recommended.—Claire SaffitzMatthew PerrinWE ALSO LOVELe Vin PapillonLittle Burgundy’s natural wine hubLarrysA natural wine bar that also serves the best breakfast in Mile EndElenaPizza and natural wines go hand in hand at this Saint-Henri pie shopExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}