{"id": "e06592aafdeb0593cd4188896c3eb443", "url": "https://www.bonappetit.com/story/howard-conyers", "year": 2020.0, "month": 6.0, "day": 3.0, "content": "This Rocket Scientist is Tracing Black Ingenuity Through Barbecue | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Rocket Scientist Is Tracing Black Ingenuity Through BarbecueFrom Clarendon County, South Carolina, to the Southside of Chicago, Dr. Howard Conyers, PhD, proves that cooking over fire is a roadmap to the past.By Howard Conyers, PhD, as told to Hilary CadiganJune 16, 2020FacebookTwitterEmailPhoto by L. Kasimu HarrisFacebookTwitterEmailEvery weekday, Dr. Howard Conyers goes to work at NASA’s Stennis Space Center outside New Orleans, where he designs facilities for testing rocket engines. Then every night he comes home and gets to work on his second job, the one that doesn’t pay: documenting the history of Black barbecue. For the past six years, Conyers has been working to compile oral histories from Black whole-animal pitmasters across the South and tracing the traditional methods of roasting hogs and other animals over pits in the ground—a practice that dates back well over 400 years. I caught up with Conyers over a series of phone calls to learn more about this work, how it began, and why he does it. —Hilary CadiganOne of my earliest memories is my father cooking a whole hog in a refrigerator. He gutted one of those old white International Harvesters, took out all the insulation and plastic, and put metal pipes through it with pieces of wire. On the farmland where I grew up in Clarendon County, South Carolina, we used it as a barbecue pit—a reusable update on the traditional method of digging a hole in the ground. Other places use cinder blocks. In Chicago they use fish tanks. You can trace the ingenuity of Black people through barbecue across the country.I barbecued my first hog when I was 11 years old. We’d cook them nice and slow—12 to 15 hours each—and use literally every part of the animal. It was always one of the biggest things that brought my family together. But being a Black farmer in America, like my father was, comes with many injustices and little economic viability. In the 1970s and ’80s, Black farmers were constantly denied loans. They made less than their white counterparts on the same commodities: tobacco, cotton, hogs. My father became a welder to make ends meet; he held on to our land out of passion for it. And like most farmers of his generation, he wanted his children to get an education, which took us away from that land.So I went to college. Then I took it a step further, got my Ph.D., moved to New Orleans, and became an aerospace engineer for NASA, where I still work full-time. But about six years ago, I asked myself: How can I use this education to go back home and build up my own community? My answer: barbecue.This was right around the time Wendy’s came out with their pulled pork sandwich, I was suddenly reminded of my past and how special it was. It struck me as hypocritical: turning barbecue—which is all about slow cooking and community—into fast food. I realized that because of the community I grew up in, I already knew a lot more about the subject than most people. So I started reading narratives and found the gaps. I began speaking at universities and barbecuing publicly at festivals and events. I cooked almost every animal that was domesticated in the American South: hogs, lambs, goats, chickens, and whole turkeys. Then in 2018, at the Gumbo Jubilee in New Orleans, I built a giant custom pit and barbecued a whole cow: something I’d read about in history books but never seen with my own eyes, before or since. It came out just as the history books said—tender, juicy, good fat content. Like all the best steaks you ever had, in one bite.To me, whole-animal cooking is the most foundational part of American barbecue. People talk about “no waste” like it’s something new, but that’s what Black pitmasters have been doing for centuries. And yet when I go to all these barbecue festivals and national food events, I hardly see any other African Americans there. Same thing on top 10 barbecue lists—they weren’t getting the credit they deserved. That’s why I’m doing this work. The history of Black barbecue has never been fully documented by someone from inside the culture, who can fill in the gaps with passed-down knowledge. If I don’t record it, it’ll end up in the cemetery.I’ve visited all the Black-owned whole-hog barbecue restaurants left in the U.S. There are less than a dozen. I’m recording the pitmasters’ oral histories and noting the linkages. For example, I already knew from the archives that enslaved Africans were cooking for wealthy planters in long open trenches at political rallies back in the Virginia colony before the United States was even a country. That traces to the present day; these pitmasters all learned to barbecue hogs in a hole in the ground.Stephen Grady of Grady’s Barbecue in Dudley, North Carolina, told me his grandfather traveled around the county with a metal grate and two tobacco sticks, digging holes to cook over. At Campbell’s Quick Stop in Rembert, South Carolina, they used old hay rakes. At Jones Bar-B-Q Diner in Marianna, Arkansas—the country's oldest Black-owned restaurant—Mr. Jones told me that on the Fourth of July, when they’d reach capacity on their cinder block pits, his grandfather would dig earth pits to meet demand.Then there’s the vinegar-pepper barbecue sauce, which we know was used during slavery because that’s all they had available back then—ketchup, mustard, and Worcester sauce werent invented yet. All these Black pitmasters across the south are still using it, including my own family. We all call it the same thing—mop sauce— because it’s so liquidy you can literally apply it with a mop. We all butterfly hogs to cook them. We all use hardwood embers for heat. We share the same techniques, the same jargon. Most of these pitmasters are over 65, living in rural communities; none of them got this information via YouTube or Facebook or Google. Somebody taught them. And the only people I know who could carry a message like this across the South are the descendents of enslaved Africans. Because that’s who was doing this work.Even long after the Civil War, up through the 1970s when you started to see a lot of white barbecue institutions popping up, somebody Black was usually doing the cooking. But all the credit went to the white owners. I would love to one day ask people like [the high-profile, third-generation white pitmaster] Sam Jones, “Who was cooking with your grandfather on that farm? Whose hands were working the pit in that cookhouse? You never talk about those people.”Most of the Black pitmasters I’ve visited could retire any day now. And most of their children aren’t interested in taking over. I can't argue with them because I understand the hard work that keeps it going. Would I love barbecue the way I do if my father had forced me into it? I don’t know. There are a few younger Black pitmasters who have started new whole hog spots in bigger cities, like Bryan Furman at B’s Cracklin’ BBQ in Atlanta and Rodney Scott’s BBQ in Charleston. Maybe they will inspire others.Now I’m in the process of turning my years of research into a book about Black barbecue. I’m traveling around the country sharing knowledge at universities and food events. I hosted a show on PBS Digital Studios called Nourish about food, culture, and science. But the best way to share this information is to send people to the places it comes from. Barbecue is an evolving process, and it’s going to continue to evolve, but you should always keep a road map to the past. You have to go there and live it. You have to taste it.Want to taste it all? Here’s Conyers’ list of must-try Black-owned whole animal barbecue spots:Grady's B.B.Q. in Dudley, NCScott's Bar-B-Que in Hemingway, SCRicky’s BBQ in Hell's Half Acre, SCCampbell's Quick Stop in Rembert, SCSugarhill BBQ in Manning, SCJones Bar-B-Q Diner in Marianna, ARRodney Scott's BBQ in Charleston, SCB's Cracklin’ BBQ in Atlanta, GA, and Savannah, GAHelen’s Bar-B-Que in Brownsville, TNExplore Bon AppétitBarbecueFirst PersonRead MorerestaurantsTexas Meets China Meets Vietnam at Blood Bros. BBQBy Daniel VaughnrestaurantsEvery New England Road Trip Requires a BBQ Plate From B.T.'s SmokehouseBy Amanda ShapirocookingHeaven Is an Entire Lemon-Pepper Chicken Doused in Honey ButterBy Hilary CadiganrestaurantsThe Unmistakable Bryan Furman, Georgia’s New King of BarbecueBy Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-16", "author": ["Condé Nast", "Howard Conyers", "Phd", "As Told To Hilary Cadigan"]}