{"id": "e074daff9e42efd1f8332fccf5f8621b", "url": "https://www.bonappetit.com/recipe/greens-eggs-and-ham", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Greens Eggs and Ham Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGreens Eggs and HamBy Molly BazApril 12, 20194.9(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintThis weekend brunch project is a springtime party showstopper. And fear not, everything will fit in your 13x9\" pan. Two pounds of greens is a lot of greens, but when blanched, they cook down substantially.Ingredients6 servings8oz. country-style bread, torn into 1½\" pieces2Tbsp. extra-virgin olive oil1tsp. kosher salt, plus more2lb. greens (such as baby or mature spinach, kale, Swiss chard, and/or mustard greens)12oz. thick-cut bacon, cut crosswise into 1½\"-thick pieces12scallions, thinly sliced10garlic cloves, thinly sliced2red Fresno chiles or jalapeños, thinly sliced, or 1 tsp. crushed red pepper flakes2cups heavy cream½cup coarsely chopped dill2oz. finely grated Parmesan (about ½ cup), plus more for serving6large eggsFreshly ground black pepperPreparationStep 1Place a rack in middle of oven; preheat to 400°. Toss bread and oil in a 13x9\" baking dish; season with salt. Bake until golden brown and crisp, 18–22 minutes. Let cool. Reduce oven temperature to 325°.Step 2Meanwhile, bring a large pot of heavily salted water to a boil. Remove tough ribs and stems from greens; discard. Add leaves to pot by the handful, pushing down with a spoon to submerge before adding more. Cook until all greens are just wilted, 1–2 minutes (it’s okay if the water does not come back to a boil). Drain in a colander, then rinse under cold running water until cool, about 30 seconds. Squeeze out as much water as possible with your hands. Transfer greens to a cutting board and coarsely chop.Step 3Set pot over medium heat and cook bacon, stirring often, until golden brown and crisp, 10–12 minutes. Add scallions, garlic, and chiles and cook, stirring often, until scallions and garlic are softened but not browned, about 3 minutes. Add greens and 1 tsp. salt and stir to coat. Remove from heat and mix in cream, dill, and 2 oz. Parmesan.Step 4Spoon greens mixture evenly over croutons, allowing some croutons to peek through. Drizzle any sauce left in pot over. Using a spoon, create 6 deep divots in greens mixture and crack an egg into each one. Season eggs with salt and pepper.Step 5Bake casserole, rotating baking dish halfway through, until egg whites are barely set and yolks still jiggle and are slightly runny, 25–30 minutes. Let cool 5–10 minutes. Sprinkle with more Parmesan to serve.Photo by Chelsie Craig, Food Styling by Kate BuckensStep 6Do Ahead: Greens can be blanched 1 day ahead. Transfer to an airtight container and chill.How would you rate Greens Eggs and Ham?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleWas 99.9% true to the recipe. It was...amazing. Every single vegetarian reformed was gushing, Every meat eating, dairy loving couldn't get enough. Just WOW. Follow the recipe an reap the best. ClaireNew Orleans11/8/2021yup this is a show stopper. highly recommend for a veggie heavy but still decadent tasting brunch dish (is 2lb of greens plus heavy cream and bacon what they mean by a well-balanced diet?!)! the greens do cook down but you can get away with using closer to 1lb if desired. i used kale and collared greens. cooked about 4 minutes longer for a slightly jammier egg yolk (per my family's preferences). tdog4/5/2021AMAZING FIRST TRY! \nMade this for our priest when he came over for brunch. Was looking for a widely appealing American breakfast with vegetables. This recipe turned out amazing first try. Will ABSOLUTELY make this again. The only thing I did differently was use about 8oz (1/5 lb) less greens, but Molly is right, it seems like a lot bit completely shrinks down to a “normal” looking amount once blanched. I used spinach and kale. Oh and I also used a roasted garlic loaf of bread (lerv garlic). HIGHLY RECOMMEND. It is beautiful and flavorful and delicious and everyone will be impressed. Sam I am, green eggs and ham.Sam I amDetroit, MI12/20/2020HUGE HIT. Multiple people said it might have been the best breakfast they've ever had. Half of them want the recipe. I used fewer greens than requested and did add shallot to the scallion mix and gouda to the cream. Thanks, Molly! Mei.Makes.ThingsNew York, NY1/10/2020Like another reviewer, I made this recipe for Christmas Day brunch, and I think it was perfect for the occasion. I assembled most of the parts ahead of time and finished the dish while everyone was still waking up. I used bacon, and I think that if I made the recipe again, I would crisp it up on the stovetop before going into the oven. My bacon turned out a little chewy and fatty - maybe breakfast sausage was the way to go. I also think that this didn't need as much cream as the recipe calls for. I would half the amount next time so everything gets a bit crispier!AnonymousNew York, NY1/8/2020There are definitely more “make ahead” options than the recipe indicates. I baked this for Christmas breakfast, so I got things ready the day before and simplified a bit.\n\nDAY BEFORE: I toasted the bread and stored it in a ziplock bag. I cooked the meat (I used breakfast sausage) in a skillet with the garlic and red pepper. Then, like other reviewers, I stirred a single bag of chopped baby spinach directly into the same pan until it wilted - because honestly, who has time to do the blanching step? I stirred in the cream and parm, and dumped the mixture into a bowl and covered in the fridge overnight.\n\nMORNING OF: all I had to do was spoon the greens mixture over the pre-toasted bread in a pan, crack the eggs on top, and throw it in the oven. It was delicious - leaving the mixture overnight helped all the flavors meld, and I liked how some of the bread stayed toasty after baking.AnonymousNJ12/26/2019This is delicious.  I cut some corners because I was making during a busy brunch and got a late start, and it might have been even better.   I used kitchen shears and snipped the bacon into smaller pieces while it was cooking.  I threw in some cherry tomatoes.   I used less greens and used bagged baby spinach so skipped boiling water step, just dumped raw spinach into the cooking bacon. Instead of putting in 6 eggs to bake, I scrambled 10 eggs and poured it over the whole bread/egg mixture and it was great!akday20oakland4/22/2019My whole family loved this dish for Easter brunch. The flavors all went so well together, and it turned out wonderfully even after I made a few modifications as follows: the step of blanching the greens was a little too fussy for the limited kitchen supplies I had while cooking in a rental cabin, so instead I wilted the greens in the pot after the scallion and garlic softened. Skipped the chilies since my family doesn’t love them. And I’ve got a couple family members with an aversion to soft-cooked eggs, so instead of cracking them into the dish, I whisked them first and stirred them into the rest of the mixture. This was the perfect way to get a delicious, hearty meal that feels a little healthy-ish thanks to the greens. Would be great for brinner, too.mloefflerSeattle4/21/2019Explore Bon AppétitCasseroleSpinachLeafy GreensVegetableKaleSwiss ChardMustard GreensBaconCured MeatMeatEggSpringMainNut-FreeEasterBreakfastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-12", "author": ["Condé Nast", "Molly Baz"]}