{"id": "e078522958563d023db135f497d2ba11", "url": "https://www.bonappetit.com/story/green-curry-eggs", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "This Green Shakshuka Is the Most Satisfying Way to Eat Two Pounds of Greens | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Shakshuka Is the Most Satisfying Way to Eat Two Pounds of GreensWe took the shakshuka formula and subbed green curry...plus tons of greens.By Sarah JampelJune 28, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailThe first thing to confess is that I was tasked with developing a recipe for green shakshuka and I took a, um, extreme deviation. I am sorry for veering off course. But I am not sorry for the end result!In my defense, this dish really does have a couple of things in common with actual shakshuka: Like, a) There are eggs gently cooked in a spicy sauce. And b) You can make it for brunch or dinner or that 4 p.m. on a Sunday…snack? (Mealtimes are a construct.) And c) You’ll probably end up eating half of it yourself, even if you think there are going to be leftovers the next day.But it strays from the traditional Middle Eastern dish in its very foundation: Instead of tomatoes and peppers, you’ve got spinach and kale cooked in a Southeast Asian-style green coconut curry that’s full of the sort of herby-spicy-acidity I crave all summer long.You start by blanching two pounds of greens. Yes, you have to do this: Flash-cooking them in hot, salty water, then quickly wringing them dry seasons them, softens them, and means that they won’t leak their unwanted moisture into your sauce.You’ll be tempted, if you’re like me, to stop cooking and start eating at two different points in this recipe. First, once you’ve blended the sauce—a creamy and crazy-fragrant mixture of coconut milk, toasted coriander seeds, lemongrass, curry leaves, ginger, chile, and garlic. And, second, after you’ve poured it over the greens and allowed the two to join forces. Here is a delicious and complete thing—you could eat it as is, like creamed greens, or add pan-fried tofu or cooked chickpeas or seared shrimp or blanched snap peas.But persevere: It’s worth it to get to the eggs! I like to leave them runny so that their yolks will mingle with and enrich the sauce, but cook them a little longer if you’re a hard-boiled kind of eater. Instead of sopping up my plate with bread or pita, I like to serve this shakshuka-y situation over rice so that the sauce can trickle down into all of the grains.If you want true shakshuka, you can make this one with chickpeas and feta, or this one with butternut squash and sambal, or this 30-minute shorty with fried garlic and shallots, or this one with cherry tomatoes, basil, and chile flakes.But if you want something that’s slightly different and surprisingly delicious…green curry shakshuka is here for you.Let's crack some eggs:Coconut Curry Greens with Runny EggsThis shakshuka-inspired dish is green because it forgoes the traditional tomatoes and red peppers for spinach and kale.View RecipeExplore Bon AppétitHealthyishEggBrunchKaleRead MorecookingWeekend Plans: This Quiche With a Magic Sweet Potato CrustBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-28", "author": ["Condé Nast", "Sarah Jampel"]}