{"id": "e07deaa98d5be62265bd04e33a1d981b", "url": "https://www.bonappetit.com/story/almond-paste-vs-marzipan", "year": 2021.0, "month": 12.0, "day": 4.0, "content": "What Is Almond Paste and How Is It Different From Marzipan? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Almond Paste? (No, It’s Not Marzipan)This might drive you nuts.By Sarah JampelDecember 22, 2021FacebookTwitterEmailPhotograph by Emma Fishman.  Food Styling by Micah MortonFacebookTwitterEmailSome arrangements in the grocery store seem designed for trickery. The coconut milk is right alongside the lite coconut milk, the peanut butter is indistinguishable from the peanut butter spread, and don’t get me started on the proximity of the cucumbers and the zucchini, the jalapeños and the serranos, and the parsley and the cilantro.Same goes for the almond paste and the marzipan, two nearly identical tubes among the chocolate chips and toffee bits in the baking aisle. While almond paste and marzipan share almonds and sugar as their core ingredients, they’re far from interchangeable. So what’s the difference between almond paste and marzipan, and when do you use each?What’s the difference between almond paste and marzipan?As Luisa Weiss writes in her book Classic German Baking, almond paste, a foundational ingredient in many German baked goods, “is nothing more than almonds and sugar processed together so finely that they turn into paste.” It’s soft, moist, relatively coarse, and a bit gritty. Rather than being a treat on its own, it’s often incorporated into recipes as an ingredient: creamed into cake batters and cookie doughs to add almond flavor, sweetness, moisture, and chew; rolled out and tucked into brownies, pies, tarts, and galettes; cut into cubes and folded into scones, muffins, and quick breads for soft pockets of nuttiness.Can you spy the thin layer of almond paste in these brownies?\nPhoto by Alex LauCompared to almond paste, marzipan has a higher proportion of sugar, which makes it sweeter, smoother, and more pliable—think Play-Doh. It’s typically rolled, molded, dyed, and/or shaped (like into these adorable fruits!) and served as its own or used as a decorative element in larger desserts. Depending on where in the world you are, marzipan might come from the store flavored—in Germany, for example, it often contains rose water.Can I use almond paste and marzipan interchangeably?Will you hate me if I say no? The two products are different enough that, just like those near-doppelgängers cucumbers and zucchini, you shouldn’t be swapping them willy-nilly.You can, however, MacGyver marzipan from almond paste by mixing it with additional sugar in the form of powered sugar, simple syrup, and/or corn syrup. And, while you can’t make almond paste from marzipan, you can make almond paste at home fairly easily.How can I make almond paste at home?All you need is a food processor and a bit of patience. In Classic German Baking, Weiss instructs puréeing blanched almonds with sugar, almond extract, and rum until you have a very smooth paste, which could take 10 minutes if not longer. Use the almond paste immediately or store it in the refrigerator, where it keeps for several weeks.Or take a shortcut and use almond flour instead of whole nuts. In The King Arthur Baking Company’s All-Purpose Baker’s Companion, almond paste is made by combining almonds with powdered sugar, almond extract, and pasteurized egg whites (some almond paste recipes contain egg whites, others do not), then kneading the mixture by hand until it holds together. If you’re seeking out the light color and delicate texture of commercially made almond paste, be sure to use almond flour that’s made from blanched (i.e., naked) almonds—the pesky skins would make for a darker paste with a deeper flavor.But then there’s frangipane...Frangipane contains eggs, butter, and flour in addition to ground almonds and sugar (there’s sometimes liquor, juice, cocoa powder, or spices too!). It’s a much looser mixture that’s made at home (rather than purchased in the store) and used, most commonly, as a filling in pies, cookies, and pastries—it puffs lightly in the oven and takes on a rich chewy-tender texture. To confuse things more, frangipane can be made with almond paste as its foundation (which allows you to skip grinding almonds or almond flour entirely!), and also without almonds—and without nuts, what?!—entirely.If all of this seems confusing, just remember that while almond paste, marzipan, and frangipane are all members of the almonds-mixed-with-sugar family, they’re individuals. Treat them as such and know your baked goods (and displays of miniature edible snowpeople!) thank you.Have almond paste, will make cookiesCocoa-Coffee Almond CookiesAlmond paste makes these supremely fudgy cookies extra chewy, while coffee adds a savory note that complements the chocolate and nut flavors.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-22", "author": ["Condé Nast", "Sarah Jampel"]}