{"id": "e086f1e19652a0a120316d1426688996", "url": "https://www.bonappetit.com/story/butternut-squash-parmesan", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "A Butternut Squash Recipe for the Worst Winter Days | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWinter Is Terrible But At Least There's Butternut Squash ParmesanThe cold is getting me down, but this hot, melty baked squash is lifting me up.By Amanda ShapiroFebruary 15, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailFebruary isn't an easy month to be healthyish, even when it's your job. I started January extremely ambitiously, but now I'm staring down the contents of my fridge, unable to contemplate another root-vegetable-centric meal. So it makes sense that, when this Butternut Squash Parmesan recipe emerged from the Test Kitchen a few weeks ago, I had a complete meltdown...a happy meltdown. \"It's SO goooooood,\" I told freelance recipe developer Lauren Schaefer, who developed this riff on eggplant Parm for Healthyish. Then basically everyone else on staff got their hands on a piece, and they agreed. It's everything we want in a Parm, with the ideal ratio of tomato sauce to cheese and squash that cuts like butter and melts in your mouth. Winter, touché.Remember our friend squash pasta from last year? He's still great, but I give Parm a slight edge for coming together faster (no need to pre-cook the squash) and being optionally gluten-free (if you omit the bread crumbs). \"Making eggplant Parm is usually an all-day affair, and there are so many dishes involved because you're frying, transferring, baking, all of that,\" Schaefer says. This Parm, on the other hand, can be done in under two hours and involves mostly just assembly. You start by making a quick tomato sauce using a can of whole tomatoes, anchovies (it won't taste fishy, we promise!), garlic, and red pepper flakes. While that cooks, you peel and cut the squash, which is the only real labor here. \"Everything else is pure satisfaction,\" Shaefer promises, and she's right.Eggplants have tons of water in them, which is why you have to salt and fry the slices before baking. Squash, on the other hand, is a very different vegetable (it's actually a fruit, but what kind of annoying person says that?). It will release a little liquid in the baking pan, but just enough to soak up the sauce and cheese and bind all the delicious flavors together.Speaking of the cheese, Schaefer uses Parmesan because, uh, it's a Parm; mozzarella for that photogenic cheese pull; and a dark-horse addition of Greek yogurt, which adds richness and tang. (And protein? Sure!) The dairy gets mixed together, then all that's left to do is put it together—sauce on the bottom, then squash, then cheese, then repeat until you're out of stuff to layer—and bake. Ten minutes before it's done, Schaefer adds some breadcrumbs for a crispy bite.I'd make this Parm on a Sunday night and serve it alongside a romaine salad with a bright, lemony dressing, and I'd be very happy reheating it for lunch the next day. But the nice thing about this Parm is that it's sized for a very reasonable 8x8\" dish—not one of those massive casserole pans—so you're not drowning in leftovers for weeks. If you're into long-range meal prep, you could assemble it, seal it tightly, and pop it in the freezer for the next time you have an impromptu winter dinner party. It'll thaw beautifully, and hopefully, someday, I will too.Get the recipe:Butternut Squash ParmesanThis twist on traditional eggplant Parmesan has fewer steps (no need to fry!) but no less satisfaction.View RecipeExplore Bon AppétitHealthyishWinter SquashSquashParmesanRead MorecookingButternut Squash Baked Pasta Is the Ultimate Healthy Winter Comfort FoodBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-15", "author": ["Condé Nast", "Amanda Shapiro"]}