{"id": "e08658b8a17518a7c1541a468a7923d3", "url": "https://www.bonappetit.com/story/what-does-it-mean-to-be-prepared", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "What Does It Mean to Be Prepared? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Does It Mean to Be Prepared?I don’t call it meal prep because I hate that phrase...but it's meal prep.By Amanda ShapiroMarch 5, 2020FacebookTwitterEmailFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I made a lot of food on Monday night because that’s what I’ve been doing on Monday nights. I don’t call it meal prep because I hate that phrase: The word “prep” makes me feel like a fitness competitor (sorry, don’t go down that rabbit hole), and I’m not making meals, really, more like ingredients. Butternut squash, roasted and mashed. A big pot of greens. Chickpeas, crisped on a sheet pan. Kinda boring, TBH. But lining up those containers in my fridge is one thing that makes me feel better about the week, every week that I do it.As I was packing up everything this time, I found myself calculating how long this food would last me if I couldn’t leave my apartment for a while. If I were quarantined. I’d seen photos online of grocery stores with empty shelves and empty freezer cases. I’d seen a lot of people using hand sanitizer on the subway that day. We’ve been told for weeks to prepare for a coronavirus outbreak in the U.S., and now it’s happening, and we’re being told to keep preparing because it’s going to get worse.I come from a family who loves to be prepared. There are three generations of Eagle Scouts among us. We show up for holidays and immediately start asking each other “what the plan is.” My mom sometimes emails itineraries, including meals and sleeping arrangements, in advance of family gatherings, just to ease everyone’s minds. I think planning is our way of dealing with anxieties; we all feel better when we know what to expect.When faced with uncertainty, our brains like to go to work, solving problems and accomplishing tasks. Sometimes this work is helpful; in fact, it’s often crucial. I started cooking weekly because I needed to stop spending ten minutes in front of the salads at Pret, debating falafel vs. chicken and sweet potato. I needed to stop spending the money too.Another good thing to prep: chickpeas.\nPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiWhen it comes to preparing amid the coronavirus, there are things I know I can do: buy food, water, and other essentials, wash my hands more. And there are scenarios I can plan for, like how I might get to my parents if, say, travel is restricted. What I would pack. My dog. But the reality is that I don’t know what to expect. And since I don’t have a doomsday bunker or a private jet to get me there, I can’t do a whole lot more than that.I had dinner with a friend last night. She and her partner are pregnant with their first child—a big, scary unknown of another sort. We talked about her fears about being a parent and how hard it was to prepare for this major life event when it was all so theoretical. She could read all the books and blogs and Reddit threads on parenting, but, as everyone who’s ever done it says, you just figure it out as you go.I feel anxious about coronavirus in a vague, free-floating way. My brain wants to plan more, think harder, solve all the potential problems that might arise. But instead I’m doing what I always do—riding the subway, going to the gym, going to my favorite Chinatown grocery store for dried shiitake mushrooms, so I can make Andy Baraghani’s new vegetarian ramen recipe. I wash my hands when I get home. I count the containers in the fridge and wonder how long the food could last. I keep one eye on the news and wait for information and trust that I’ll figure it out as I go. And maybe that’s what preparing looks like, too.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletteressayCoronavirusRead MoreLifestyleBig Bean MoodBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-05", "author": ["Condé Nast", "Amanda Shapiro"]}