{"id": "e0861bc42302b44b6fe592372a744600", "url": "https://www.bonappetit.com/story/october-cookbook-club-season-nik-sharma", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Meet Our October Cookbook Club Pick: Season by Nik Sharma | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMeet Our October Cookbook Club Pick: 'Season' by Nik SharmaDo you always buy spices you use just once and forget about? This book is for you.By Christina ChaeyOctober 1, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailYou can tell it’s cookbook season at Bon Appétit by the limited amount of surface area on our desks.From late summer to early fall, galleys of the year’s biggest batch of new cookbooks arrives; by October, the ever-growing stacks threaten to completely obscure certain editors from view.All this to say: It’s incredibly easy for a book to get lost in the glossy, homogeneous pile. But every so often a title shows up that refuses to be cast aside, and Season by Nik Sharma, our very first Cookbook Club pick, is one of them. Flipping through Sharma’s recipes for dishes like Chaat-Masala Grilled Pork Chops and Apple Masala Chai Cake will make you want to raid your own spice cabinet for the cumin, coriander, and cardamom (or perhaps go out and stock up on fresh spices, because yes, they go bad!). It will also inspire you to run to the nearest spice shop for smoky Kashmiri chile powder and fresh curry leaves. But this isn’t like the time you decided to make 30-ingredient curry from scratch and then never again used 28 of the ingredients. Sharma’s recipes teach you how to use spices in your cooking the way you do salt and pepper.In the book’s introduction Sharma describes Season, out this month, as “the story of a gay immigrant, told through food.” It’s a natural extension of his blog, A Brown Table, which he started in 2011 as a creative outlet to turn to after long days of working as a medical researcher in Washington, D.C. Across 100 recipes that Sharma wrote, photographed, and developed, he tells the story of his life, from Mumbai (or Bombay to Sharma) to the Midwest to the Bay Area, where he now lives with his husband. His recipes transcend any one geographic location: Goan-style chouriço and jaggery ice cream coexist with sweet potato fries and popcorn chicken. Yet nothing in Sharma’s world feels out of place or lacking intention.The Masala Chai Apple Cake from Season.\nPhoto by Chelsie CraigRecently, a few of us got together one night in the BA Test Kitchen to cook a few recipes from the book. Senior associate food editor Molly Baz made a warm salad of crispy roasted cauliflower, spiced lentils, and cubes of paneer. Social media manager Rachel Karten opted for oven sweet potato fries with a basil-yogurt dipping sauce (I took home the leftover sauce and dipped pretty much everything in it for the next three days). Associate social media manager Emily Schultz made addictive little stuffed potato “chops,” which are like pancakes made out of mashed potatoes that get stuffed with spiced ground lamb, jacketed in breadcrumbs, and fried until the exteriors are golden brown and crunchy. And the former fry cook in me obviously jumped at the Curry Leaf Popcorn Chicken, which is marinated in buttermilk infused with incredibly fragrant fresh (yes, they must be fresh!) curry leaves, dredged in a spiced flour mixture that has even more chopped curry leaves, then fried into nuggets. (No joke: This chicken was so good we had to share the recipe here. Is also excellent eaten cold for breakfast the morning after...I have heard.)Sharma's popcorn chicken gets tons of flavor from fresh curry leaves that go in both the marinade and flour dredge.\nPhoto by Chelsie CraigAlthough spices and other ingredients from the Indian pantry such as Kashmiri chili, asafetida, and nigella seeds regularly appear throughout the book, Sharma wants to be clear: Season is not an “Indian cookbook.” He intentionally shies away from what he feels are misconceptions in American conversations about Indian food. “If I say I’ve made a soup people will be like, ‘Oh, so you made curry?’” he told me on the phone. Actually, there isn’t a single curry recipe in the book, because it’s not the Indian food specific to Sharma’s experience.Sitting down to eat the meal we had prepared, the smell of rich spices rising from the dishes on the table, we surveyed our spread. Some dishes were familiar but just a little different, like the fluffy griddled homemade garlic naan, or the spicy and sweet Chile-Sumac-Pomegranate Nuts I ate five or 50 of. Others felt entirely new, like those lamb and potato \"chops,\" inspired by a traditional Goan snack. All of it channeled Sharma, someone I hadn’t yet met, but somehow felt like I already knew.Get the Recipe: Curry Leaf Popcorn ChickenPick up a copy of Season wherever you buy cookbooks. And if you want to learn more about the BA Cookbook Club and how to start your own club, you’ll find all that right here.Explore Bon AppétitCookbookscookbook clubRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-01", "author": ["Condé Nast", "Christina Chaey"]}