{"id": "e0afd84938fc5966e62a3a9a470ba550", "url": "https://www.bonappetit.com/story/new-school-paris-restaurants", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "These Paris Restaurants Prove That There's Something New-School In an Old-School City | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eat8 Restaurants That Prove Paris Is Anything But Old-SchoolHopped up on natural wine and unbridled by tradition, a wave of ambitious chefs is transforming the world’s most storied food destination.By Christine MuhlkeNovember 5, 2018FacebookTwitterEmailPhotographer: Emil O. FloreaFacebookTwitterEmailIt used to be that New Yorkers—especially chefs—wished they were in Paris. Now everyone opening a restaurant in Paris wants to be in Brook-LEEN. In the 10th and 11th arrondissements, young chefs are forgoing the Michelin route to start their own lo-fi, high-energy spots where open kitchens, mash-up menus, and scruffy servers are the norm. How not-stuffy are they? Many of these places are vibey natural-wine bars that happen to have creative chef-driven food. You can dip in for a five-euro glass of Gamay—imagine!—and a dish or two without strapping in for a whole “experience.” It’s that kind of effortless French chic that we can never seem to re-create after our vacation—luckily, we’ll always have Paris.La BuvetteIt wouldn’t be accurate to call Camille Fourmont the godmother of natural wine in Paris—she’s only in her 30s! But her tiny DIY-distressed wine bar has converted many a drinker to the noncommercial side. Her spot-on palate extends beyond interesting wines: Even without a kitchen she assembles unforgettable plates from the country’s best raw, cured, fermented, and jarred ingredients. Trust us when we tell you that you will eat a bean off a toothpick and rank it among the best bites of your trip, if not year. So, yes, it’s worth waiting for the chill regulars to leave so you can snag one of the empty seats or an inch of the zinc bar.Vibing in Paris at the construction yard turned hip restaurant-wine-bar hybrid Yard.\nPhoto by Xavier Girard LachaîneChambre NoireThe closest Paris has to an American-style bar—if bars in the States drew so many good-looking 20-somethings in search of the next underground wine release from the Auvergne that the crowd spilled into the street for an impromptu weekend hang. (One can dream.) Tapas, like tacos made on a crepe iron, absorb all that funk. If you’re really hungry, Oliver Lomeli, the young Mexican filmmaker who owns this spot, also runs Café Chilango next door, where you can sink into queso and tostadas.DéviantIn addition to having the coolest design we’ve seen in ages, Déviant is an open-air destination for the Le Fooding set, where the only things missing are windows and chairs. Sure, you could just order pét-nat and hang at the snazzy terrazzo bar, but Pierre Touitou, chef at sister restaurant Vivant, is (literally) right there in the kitchen. You can rack up a few seasonal small plates—the spicy wings, which are simmered in a tamarind-galangal glaze for ten hours, have the sole permanent spot on the menu— without spending a fortune, leaving you wiggle room for a bottle of something intéressant.Tender octopus with fresh peans brings all the boys... er, everyone to Yard.\nPhoto by Xavier Girard LachaîneMokonutsHusband-and-wife team Omar Koreitem and Moko Hirayama have something magical. Their alchemical combination of Middle Eastern, Japanese, and French food, natural wine, and life-altering cookies is why this place bubbles over from breakfast until they leave to pick up their kids around 4:30 p.m. It’s casual and welcoming even to clumsy tourists and generous in both flavor and spirit. Whether you’re ordering a bowl of clams with chermoula and a cloudy glass of white or a slice of halvah cake with buckwheat tea, you’ll feel the magic.Le RigmaroleHere it’s all about yakitori and...pasta! (And a funky wine list, of course.) The Japanese-style counter seating encourages you to focus on the food in front of you—in this case, binchotan- grilled skewers of poultry (try the pigeon), fish, and vegetables—each of which has its own brilliant flourish. There’s also a pasta of the day (maybe with liver, if you’re lucky) and other inventive bites from Franco-American chef Robert Compagnon. And because this is still Paris—and his wife and partner, Jessica Yang, worked pastry at Guy Savoy—the desserts are not to be missed. Order the 49-euro tasting menu and feel sorry for people eating at uptight three-star places.Sipping wine at La Buvette.\nPhoto by Xavier Girard LachaîneSeptime La CaveGetting a table at Bertrand Grébaut’s Septime is worth the effort—there’s a reason it’s on the World’s 50 Best list—and so is securing one of the handful of stools at Septime La Cave, its spin-off wine bar nearby. This is the kind of place you wish you had in your hood: an atmospheric but relaxed little bar where you can enjoy a zippy pét-nat, a plate of thinly sliced ham, and some thoughtfully assembled seasonal dishes that Grébaut could easily serve as an amuse at his mothership—all for under 25 euros. La vie, she is not fair!Sur MerOriginally the seafood offshoot of the seminal natural-wine bar Le Verre Volé—still a must— young Belgian-Ugandan chef Olive Davoux bought the space last year to showcase her talents. Imagine raw seafood with gochujang mayo and Bordier seaweed butter, or an octopus bun with XO sauce. And you can have it all at lunch for under 30 euros. Or dip into Davoux’s Asian-accented creativity at night, sit at the communal tables, and drink a lot more wine.Hanging out at Déviant.\nPhoto by Xavier Girard LachaîneYardSome come for its well-respected Mediterranean-ish food, like the stunning grilled peach salad with almonds. But this airy restaurant also attracts a devout following among natural-wine-bar owners and cult-wine importers. (You’ll find them Instagramming the latest Patrick Bouju bottles.) Recently, wine merchant Clovis Ochin, who made Action Bronson’s natty wine a sold-out success with Bouju, became a partner at Yard, expanding the space and increasing the wine focus with a bigger bar. Lunches are mellow affairs, while weekends go off the rails in a delightful way.For even more, check out our full Paris City Guide here.Read MorerestaurantsThe Well-Crafted Kitchen: Inside the Raucous New Paris Restaurant, DéviantBy Christine MuhlkeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-05", "author": ["Condé Nast", "Christine Muhlke"]}