{"id": "e0bc76a8e3717b2b6debfadb0b43363d", "url": "https://www.bonappetit.com/story/how-to-make-egg-drop-soup-instant", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "How to Make Egg Drop Soup Out of Any Broth | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoptechniquesHow to Make Egg Drop Soup Out of Any BrothIf you can boil water and scramble eggs, you can make egg drop soup.By Alyse WhitneyFebruary 15, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailPost-work dinner is my laziest cooking—it must be lightning fast and without much additional shopping. Most nights that means scrambled eggs and toast or empty-out-the-fridge soup, but lately it’s been a combination of both: egg drop soup. It’s somewhere in between Chinese takeout-style egg drop and Italian stracciatella, made with leftover stock, broth, or Better Than Bouillon doctored up with vegetables and seasonings and a drizzle of eggs.I learned how to make egg drop soup by experimentation, cooking with senior food editor Chris Morocco. We found that adding a cornstarch slurry (1 Tbsp. cornstarch to 1 Tbsp. of water mixed together) to the simmering broth gave the soup more body, and that you shouldn’t salt the eggs beforehand to kept them from getting thin and watery.How It’s DoneSeason the broth however you’d like—we have a great dashi stracciatella recipe, but it also works with this quick miso soup. Whisk in your cornstarch slurry. Then, for every two cups of broth or stock, whisk one egg in a separate bowl. Drizzle the eggs over the hot broth and give it a light stir—they should set immediately once they hit the hot broth, and the slurry helps them disperse evenly throughout the liquid. Without the cornstarch, we found that the eggs all floated on top instead of creating one homogenous soup. Fight the urge to whisk the soup after you add the eggs, because that will create a lot of tiny pieces of egg rather than longer, smooth ribbons. Also, the ratio of 1 egg to every 2 cups of broth is important. If you overload the soup with too much egg, it can sink to the bottom and make scrambled eggs.Butternut squash and kale are also great egg drop mix-ins.\nAlex LauA sprinkle of scallions and soy sauce is enough for me most nights, but sometimes I feel a little more motivated and sauté onions, carrots, garlic, and sliced shiitake mushrooms before adding the stock, and finish with shredded leftover rotisserie chicken, wilted spinach, ramen noodles, and miso paste. Those are staples in my kitchen, but you can use whatever you have in the pantry or what’s going bad in the crisper drawer. This is by far my favorite way to use eggs as something other than breakfast for dinner, and it’s a habit I’ll never... drop.Make 30-minute chicken stock in your Instant Pot for egg drop soup:Explore Bon AppétitEggSoupBrothRead MoretechniquesBone Broth Common MistakesBy Rochelle BilowcultureWhat Tastes Better: Boxed Stock or Better Than Bouillon?By Alyse WhitneytechniquesStart Making Your Own Stock and Quit the Boxed Stuff for GoodBy Christine MuhlkeChicken StockRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-15", "author": ["Condé Nast", "Alyse Whitney"]}