{"id": "e0c03a7eb02252c66ff06b9134ab39e1", "url": "https://www.bonappetit.com/recipe/chorizo-and-potato-stew", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Chorizo and Potato Stew Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChorizo and Potato StewBy Andy BaraghaniNovember 20, 20184.4(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis is the hearty, rustic, and deeply warming comfort food you'll be craving on all snowy days. Yes, it’s a large amount of paprika, but it serves as a base flavor for the stew and gives it a deep red color and smoky aroma.Ingredients8 servings6bacon slices, chopped2medium sweet onions, finely chopped8garlic cloves, thinly sliced3Tbsp. tomato paste2½lb. russet potatoes, peeled, cut into ¾\" pieces2lb. smoked Spanish chorizo, cut into rounds, halved into half-moons1lb. button mushrooms, cut into ½\"-thick wedges8cups low-sodium chicken broth⅓cup hot smoked Spanish paprika½tsp. cayenne pepperKosher salt1cup sour cream2cups torn dillFreshly ground black pepperPreparationStep 1Cook bacon in a large pot over medium heat, stirring occasionally, until beginning to brown but not yet crisp, 5–7 minutes. Transfer to paper towels.Step 2Add onions to same pot and cook, stirring often, until golden and softened, 8–10 minutes. Add garlic and cook, stirring, until softened, about 3 minutes. Add tomato paste and cook, stirring, until slightly darkened in color, about 2 minutes. Return bacon to pot, then add potatoes, chorizo, mushrooms, broth, paprika, and cayenne and bring to a boil. Reduce heat so liquid is at a bare simmer and cook, stirring occasionally, until potatoes are tender, 25–30 minutes. Remove from heat; season with salt.Step 3Stir sour cream and 2 Tbsp. water in a small bowl to combine; season with salt.Step 4Divide stew among bowls and top with sour cream, dill, and a few grinds of pepper.How would you rate Chorizo and Potato Stew?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleThis was excellent!! I wondered after looking at the ingredients if this would work (my wife thought the '1/3 c. of paprika' was a typo), but it tasted wonderful. The only changes I made were to add a can of cannellini beans as suggested in some comments here. Note that this took up almost an entire 7 qt. Dutch oven, so go big! This might be 8 servings to a football team, but for the rest of us I'm sure that there are at least 10 generous servings, so plan for plenty of leftovers. Thanks, Andy!John M.Colorado3/8/2021The stew is wonderful...spicy, but not too hot, and the bacon add such warmth and more depth of flavor.  I didn’t have tomato paste and used a whole can of stewed tomatoes instead.  Also used red onion instead since it was what I had on hand.  Came out wonderfully!  Definitely will make again and again!Daphne BGLos Angeles, CA12/14/2020Seriously one of the best ba recipes. Thanks a bunch, Andy!Anonymous5/31/2020This recipe is delicious! I had raw lamb chorizo on hand so I decided to brown it in a separate pan before adding it into the stew along with the other ingredients per the recipe. Don't doubt the amount of paprika. I did not have Spanish paprika unfortunately so substituted for half regular paprika and half smoked and it came out great. I did up the tomato paste as one reviewer suggested (about 20%) and the stew came out nice and thick. I also threw a bunch of bok choy in for the last few minutes because I was wanting something green in there. I would make this again!AnonymousBoston5/4/2020The potatoes take way too long to cook, which leaves the chorizo rubbery. Definitely did not take 25 minutes. It also could benefit from some acid. AnonymousChicago11/6/2019I just halved this recipe and made it right now and it is sooo tasty! I did have to make a few changes. I couldn't find the chorizo that was called for so I used a package of regular Mexican chorizo from the grocery store and cooked it before adding it in. I also added a can of cannelini beans to bulk it up and a spoonful of Sambal Oelek to make it spicier. Next time I think I would add more bacon and I'd use regular chicken broth instead of low-sodium because I had to add quite a bit of salt. I will absolutely make this again!AnonymousChicago3/18/2019Great recipe! This reminded me of a recipe I made years ago fro Bernard Clayton's The Complete Book of Soups and Stews. That recipe added a bunch of hearty greens.susanannlopezSaint Laurent du Var, France2/15/2019I typically don't leave reviews because I am a chronic recipe changer but I LOVE this stew and the balance of flavors was amazing. At the last minute I decided to add a can of cannellini beans and would highly reccomend that to anyone looking to add some extra protein. Such a great winter dish and so easily modifiable to what's in the fridge!AnonymousDC1/31/2019Delicious! I would cut the sausage into smaller pieces and add more tomato paste for a thicker stew. I also subbed out full for cilantro!McSabbieWashington1/28/2019Works well with many types of grilled sliced sausage.\nBut the dill was weird and totally out of place.\nDo it again but not with any dillAnonymous1/26/2019This was incredible!  The broth was so delicious.  I was leery of using 1/3 C of paprika but, so glad I did.  I cut both the sour cream and dill in half.  It was perfect to cut the heat from the stew.  angelab017St. Louis, MO1/21/2019Delicious! Have made this twice now and it's been amazing both times. I leave the skin on the potatoes. Adding chickpeas was a wonderful decision and I totally recommend it -- they soak up the flavor so well and add another texture to the mix. Yields a ton of stew, but the leftovers are just as good as (and honestly, probably even better than) the first time it's served. A must make for the winter.AnonymousBerkeley, CA1/20/2019i would rather use cilantro than dill.  and riddle me this:   why do the taters have to be peeled?  (i like the peels.)  a nice amount of onions, mushrooms, and smoked paprika, IMO.  would some kind of greens work in this?  collards, mustard, turnip3 kale?  suggestions?  i'd choose bitter greens and a splash of some kind of vinegar over sauerkraut.hollis5Vero Beach, FL1/19/2019I would totally make this stew but the recipe calls for 2 cups of dill and only has us put a little on top when serving. Andy am I reading this wrong?AnonymousSaratog, NY1/18/2019Made this last night for a pot luck. Prep work takes a while (depending how fast you cut), so make sure you allot a good amount of time before you actually turn the stove one. But it really does yield a lot of stew and is worth the prep time it takes - arguably more than 8 servings. To ease anyone's concern - the amount of paprika IS correct - make sure you find the smoked one, as indicated in this recipe. The stew is ready a little sooner than 25-30 minutes, so make sure you're checking around the 15-20 mark. And err on the safe side and use a larger pot! Andy's right when he says that this is really warming and appropriate for snowy weather - highly recommend!TilbiusAstoria, NY12/15/2018Explore Bon AppétitStewSoups and StewsSpanishEuropeanChorizoSausageMeatPotatoVegetablePaprikaHerbs & SpicesRusset PotatoWinterEasyOne-Pot MealsMainNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Andy Baraghani"]}