{"id": "e0cd33ead55fa73c61a94bf59c811ba5", "url": "https://www.bonappetit.com/story/is-natural-wine-better-for-the-planet", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "Is Natural Wine Better for the Planet? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIs Natural Wine Better for the Planet?The answer is, you guessed it, complicated.By Katy SeversonJanuary 30, 2020FacebookTwitterEmailIllustration by Justyna StasikFacebookTwitterEmailThis story is part of The Healthyish Guide to Eating for the Climate...Without Stressing Out, a collection of our best tips for living sustainably and eating well while doing so.I’ll be the first to admit that drinking natural wine makes me feel cool. I’m fully engulfed in the trendy, gotta-catch-em-all game of this world. I have an entire album of screenshotted bottles on my phone. I’m guilty of choosing wines based on beautiful labels or rumored funk. But I also know that natural wine carries a torch much brighter than its trendiness. As a movement, it’s asked us to demand transparency in what we drink as much as what we eat. But amid this looming climate crisis, I’ve found myself wondering: Is natural wine better for the environment?Like most things, the answer is complicated.Natural wine isn’t immune to the problems of a complex global economy and supply chain. It travels long distances. It sits in ships and trucks and boxes in air-conditioned distribution centers. Even some of the most holistic, socially conscious wine distributors are caught in an extractive economic model simply because those are the systems that exist. As Amy Atwood, a natural wine importer in L.A. puts it, “There’s no magic wand we can wave to get goods from one place to another without sitting in a ship or a truck”—not yet anyway—“But I don’t think that diminishes the fact that these wines come from organic and biodynamic farms. That’s still a win for planet Earth.”So we can’t do much to avoid the carbon footprint of the supply chain, though buying domestic wine limits the distance it travels. But we can seek out wines that are responsibly farmed.Most of the conventional wine we drink comes from vineyards that borrow farming practices from industrial agriculture—using pesticides, synthetic fertilizers, and intensive tilling and plowing that damage the biological health of the soil.Long degraded by industrial agriculture, regenerating our soil is one of our most promising solutions to climate change, and the natural wine movement fits...naturally...into that conversation.Of course, it’s not safe to assume that every natural winemaker is growing grapes with biodynamic or regenerative farming practices, or that traditional producers aren’t. In countries across Europe, many winemakers have been farming this way for decades without using the term “natural.” While some wines have organic or biodynamic certifications on the bottle, many small producers can’t afford certifications or don’t want to bother with the process.Natural wines, for the most part, are made with organic grapes at a minimum—meaning no pesticides or herbicides are used in the vineyard—but they often come from biodynamic vineyards, which use natural preparations to build fertility in the soil. Because natural wine is made without “corrective additives” that can fix flaws in the fruit, after it has been harvested and taken to the winery—say, sugar when the grapes aren’t quite ripe enough, tartaric acid when they’re too ripe, or sulfur to keep microbial populations that affect the flavor in check—there’s a particular emphasis on the farming. Many small producers grow the fruit themselves, hand-pick it as opposed to machine-harvesting, and pay meticulous, if not obsessive, attention to the soil.“Soil life is the main topic,” German producer Michael Voelker of 2Naturkinder said to me when I asked him how he made his 2017 Bacchus pet-nat taste like the sun, the ocean, and the Earth all at once. Like most of the natural winemakers I’ve talked to, Voelker calls himself a farmer first. The wine pretty much makes itself. “You need an intense population of microorganisms in the soil to make it work.” Microorganisms, wild yeasts, deep root systems, underground fungal networks that pull nutrition into the vines—all of which have a huge impact on the flavor.Seven years ago, when Voelker started the process of converting his conventionally-farmed family vineyard to biodynamic, he saw tremendous improvement in both the soil and the flavor of the wine. “It’s increased in length,” he said. “Last year it tasted like water. This year it has backbone.”This all comes at a time when soil is the talk of climate change. Long degraded by industrial agriculture, regenerating our soil is one of our most promising solutions to climate change, and the natural wine movement fits...naturally...into that conversation. \\The wine industry is already facing the effects of a warming planet: flooding, fires, and droughts are damaging vines. And increasingly humid summers and winters encourage pests and molds, leading some wine producers to seek cooler, less humid climates or higher elevations. But these problems are solvable, says Mimi Casteel of Hopewell Wine in Oregon, and it starts in the vineyard itself.“We can’t just throw our hands in the air. If we don’t see ourselves as part of the solution, we should have the keys taken out of our hands.”Casteel employs the principles of regenerative agriculture—a new term for an old way of farming that aims to rebuild soil strength and fertility through mimicking natural ecosystems.Her vineyard is wild and vibrant, with a variety of cover crops (plants growing between the vines) and swaths of birds, gophers, and insects. “There are no species out there—even the ones we call invasive—that don’t have some sort of function in an ecosystem,” she says. Diversity builds resilience. And growing green forage on the vineyard floor provides food for rodents and other animals that might otherwise snack on the vines.It’s a stark contrast to a conventional vineyard of pristine vines with bare soil between them. That bare soil, she says, is literally leaking carbon into the atmosphere rather than absorbing it and puddling water where strong soil would be holding onto it.Rebuilding the soil even slightly can boost its ability to hold water by 18,000 gallons per acre, says Kelly Mulville, a regenerative vineyard consultant at Paicines Ranch. Doing so minimizes flood risk and reduces or eliminates the need for irrigation: That could save 10.8 trillion gallons of water per year in California alone. At the same time, it sequesters 3.5 metric tons of CO2 per acre; if we applied these practices to the 18 million acres of vineyards worldwide, we could potentially sequester enough carbon to offset the fossil fuel emissions of the industry’s supply chain. Some wineries are already proving it can be done at scale—Montinore Estate in the Willamette Valley farms over 200 acres of biodynamic vines.Some newer certifications such as “Sustainable” and “B-Corps” aim to address climate change through resource management, energy efficiency and worker welfare—but don’t necessarily refer to farming practices.Even under these certifications, our current distribution model pays farmers last—says Molly Madden, founder of Red Hen Collective—which puts wine growers under tight economic restraints that limit their ability to adopt regenerative farming practices.Through Red Hen Collective, she aims to completely upend the supply chain and economic framework of the wine world by building a distribution model that pays farmers first.“What’s so exciting about tackling the economic piece is that it’s not just going to sustain and maintain the good farming practices,” says Madden. “It’s going to diversify it and make it more inclusive and we’re going to see an explosion in the natural wine world.”For now, we have to empower ourselves to do our own research—and engage with our local wine shops, wine bars, and winemakers themselves—to learn about their practices.Both Molly Madden and Mimi Casteel think the natural wine movement can lead the way to a much larger revolution against Big Agriculture. “Wine has a unique power to start a conversation, and not just because of the ethanol,” says Casteel. “There’s an ancient, historical feeling attached to it. It provides a platform for people to have a different kind of conversation about their food.”“Thank god there’s wine,” Madden said with a sigh at the end of our conversation. “Because revolutions are hard.”Explore Bon AppétitHealthyishnatural wineessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-30", "author": ["Condé Nast", "Katy Severson"]}