{"id": "e0d2ab8006ff8da507d78ae74b9de8b2", "url": "https://www.bonappetit.com/story/sweet-vs-sour-cherries", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "Sweet vs. Sour Cherries: Everything You Need to Know Before You Get Baking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSweet vs. Sour Cherries: Everything You Need to Know Before You Get BakingSweet cherries are fun to snack on, but when it’s time to cook, sour cherries are our pick.By Alex BeggsJuly 23, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Kat BoytsovaFacebookTwitterEmailWhen it comes to cherries, you don’t have a lot of decisions to make. This isn’t frozen pizza or cereal, where the aisles stretch as long as the profit margins. You’re either going to buy sweet or sour cherries, depending on where and when you’re shopping, even though there are over 1,000 cultivars of cherries according to The Illustrated Encyclopedia of Fruits, Vegetables, & Herbs. Most cherries sold in supermarkets are sweet cherries—and those are the ones you’ll grab, take to the beach, and eat, spitting out the pits into the sand and burying them with your feet. So what about sour cherries? What’s the difference?Sweet Cherries: Snack AwayThere are around 900 varieties of sweet cherries out there, largely grown in the U.S. and Turkey. Sweet cherries are high in natural sugars, and can range from deep reds that are nearly black to light yellow-pinks. They’re usually pretty big and sturdy, with firm flesh. Bing, Rainier, and Lambert are all sweet cherries. In the US, Washington produces the most sweet cherries, so those are often what you’ll find in supermarkets.“I taste enough sweet cherries that I can taste the nuances, but my guess is the general public probably can’t taste those differences,” said Nikki Rothwell, my cherry educator from the Northwest Michigan Horticultural Research Center. If you can, try a few sweet cherry varieties side by side to see what she means. “But you know what Americans really like?” Nikki asked. “They like crunchy sweet cherries; they do not like soft, squishy, sweet cherries.”So at sweet cherry breeding programs, cherries are literally bred to be as firm as possible. Fun fact!When you’re buying sweet cherries, know that they’re already ripe when they’re picked so they’re ready to eat—get after it. Look for shiny, good-looking cherries with as few bruises as possible. Whether or not they have stems intact DOES NOT MATTER. This is a common misconception. Some cherries are picked with machines that shake the cherries off the trees so they lose their stems. It doesn’t affect the taste or quality at all. If you notice a bag of cherries with stems intact, that probably means the cherries were hand-picked.If your kitchen is relatively temperate, you should be able to store your cherries on the counter for around three or four days, but most experts recommend keeping them in the fridge where they’ll last a bit longer. (Plus, who doesn’t love a cold cherry?) They will start to break down and get mealy in colder temperatures, so try to eat them within a week.Sour Cherries: Get BakingSour cherries are also called “tart” cherries because even fruit needs marketing. I still call them sour cherries. These are our JAM around the Bon Appétit Test Kitchen because these are the cherries you want to bake with. They have less sugar than sweet cherries and that’s a good thing because their high acidity brings a bright, vivid flavor while their sugars will concentrate as you cook them. Once cooked, they’ll taste sweeter. When you bake with sweet cherries, the sugar is so high without acidity to balance it out so the flavor is one-note, and sometimes too sweet. “Sour cherries also have a supple texture,” said senior editor Andy Baraghani, “They fall apart, they give in more than firm sweet cherries. A sour cherry wants to be turned into jam.” See? Told you.Nikki, my cherry guru, is based in Traverse City, Michigan, the “cherry capital of the world”—sour cherries, specifically. Every year they host the National Cherry Festival, where you can participate in a cherry pit spitting contest (contingent upon the presence of a global pandemic). While there are sweet cherries in the area sold at farm stands along nearly every road, most sour cherries grown in the Traverse City area end up being processed into the cherry goo at the bottom of yogurt cups, frozen cherries, cherry juice, etc. (Why? Because they’re not in as high demand as sweet snacking cherries, and they’re more fragile and prone to smushing when being harvested.)“The newest, biggest, kind of hip thing to do with sour cherries,” said Nikki, “is to turn them into dried cherries. If you were to dry a sweet cherry, it just wouldn’t have the acidity and that distinctive cherry flavor—it would tend to just get sweet and bland.”Montmorency, Morello, and Balaton are all sour cherry varieties. They’re usually soft, and smaller than sweet cherries. Some are sweet-tart, others are so sour your cheeks pucker. Use them to bake pie, crumbles, compotes, salsas, and to top yogurt.When you’re buying sour cherries, again, don’t worry about the stem. Look for blemish-free cherries without any mold on them, which can spread fast. Because they’re softer than sweet cherries, sour cherries have a shorter counter life. Try to cook or eat them within a day of buying them, or stash them in the fridge if you need to buy yourself a bit more time.Explore Bon AppétitcookingtechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-23", "author": ["Condé Nast", "Alex Beggs"]}