{"id": "e0e1ff4450b2c548bf482ad10e592fa3", "url": "https://www.bonappetit.com/story/support-these-awesome-female-run-restaurants-next-time-you-order-caviar", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Support These Awesome Female-Run Restaurants Next Time You Order Caviar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredSupport These Awesome Female-Run Restaurants Next Time You Order CaviarBy Caviar June 11, 2018FacebookTwitterEmailFacebookTwitterEmailThere’s beauty in being able to order mouthwatering dishes from some of the country’s best restaurants and have them delivered right to your door, but also supporting super talented, female chefs and restaurant owners while you’re at it? That’s a bonus we’re all about celebrating. From Boston to Brooklyn, Philadelphia to Seattle, we sought out some of our favorite neighborhood spots to share with you. So, next time you go to order lunch or dinner delivery from Caviar, try one of these local favorites and support female-owned and operated businesses while you’re at it.Say “Yes” to a Mouthwatering Plant-Based Meal from Philly’s HipCityVegcaviarWhile people told Nicole Marquis she was crazy to open a vegan restaurant in the cheesesteak loving city of Philadelphia, she knew there was a demand for something a little different. It was actually her father that inspired her to open her plant-based fast-casual restaurant chain HipCityVeg—when he was diagnosed with Type 2 Diabetes in 2009, Nicole helped him adopt a healthier diet with some of the same vegan smoothies and recipes that she made for herself. Skip to the opening of her first location in 2012; it was so popular she sold out of food by 1 PM! Now with 3 locations in Philly and one in Washington, DC, Nicole plans on opening more. If you haven’t already, order and try one of their delicious smoothies, salads, wraps or veggie burgers. Our fave? The Bistro Bella, with herb-glazed, grilled portobello, dijon, olive tapenade, tomato, artichokes, red onion, and arugula.Boston’s Asian Fusion Restaurant From An Ex Harvard Grad & Award Winning Pastry ChefCaviarBefore her career in the culinary industry, Joanne Chang graduated from Harvard with honors with a degree in Applied Mathematics and Economics—hardly the prerequisite for her switching gears and becoming an award-winning pastry chef of Flour Bakery. After critical acclaim for her baked goods, Joanne opened Myers + Chang with her husband in 2007 and along with Chef Karen Akunowicz (who recently won the James Beard award for Best Chef Northeast) offer diners a very personal interpretation of Chinese, Taiwanese, Thai, and Vietnamese specialties. Locals in the South End love the restaurant’s indie diner setting, but you can sample some of their tasty dishes via Caviar. Aptly named Tiger’s Tears, this steak and herb salad has a chili-laden dressing that kicks up the heat in this spin on a traditional Thai dish.The Couple Who Created Their Own Favorite Date Night SpotcaviarWhen Tiah Hardy and her husband Jeremy couldn’t seem to find a spot for an affordable date-night in Seattle, they dreamed up the idea of creating their own. Enter Mioposto, the Italian restaurant modeled after traditional Neapolitan pizzerias that first opened in Mt. Baker and now has a total 4 locations in the city. Tiah, the restaurant’s Chief Food Officer, dreams up recipes and ideas for the menu with inspiration to keep it simple, source the best possible local ingredients, and cook correctly—their open-flame ovens are the only heat source in the kitchen. She’s also not afraid of flavor and creates consistently delicious small plates, entrees, and open-flame cooked pizzas. A highlight on their seasonal menu is the Zucca Balsamica Pizza with an olive oil base, roasted butternut squash, pancetta, mozzarella, caramelized onions, garlic, rosemary, goat cheese, red pepper flakes, and balsamic reduction. Bellissima!The East Village Middle Eastern Favorite with a Hip Williamsburg OutpostcaviarRivka Orlin was born in Mogador, Morocco (now known as Essaouira) before she and her Jewish family moved back to Israel. It was growing up where she discovered a love for sharing time with her mother in the kitchen. Fast forward twenty-five years when she moved to New York City, Rivka opened (what would become) one of the most-loved restaurants in the East Village, Cafe Mogador, with her brother. Now with an equally popular Williamsburg, Brooklyn outpost, fans of Orlin’s delicious Moroccan-inspired cuisine can enjoy a menu full of dips, skewers, pita sandwiches and slow-cooked tagines with couscous. Next time you’re ordering and want a healthyish lunch or light dinner, we’re fans of the Tunisian Sandwich filled with house-made merguez (spiced lamb sausage), Arabic salad, tahini, and pickles served in a warm pita.Explore Bon AppétitHealthyishCaviarSuperpoweredRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-11", "author": ["Condé Nast"]}