{"id": "e0e6b42ca9f899ef36dd5a306b8ebce5", "url": "https://www.bonappetit.com/story/als-bar-tequila-and-mezcal-cocktails", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "4 Easy Tequila (and Mezcal!) Cocktails, No Margarita Mix in Sight | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking4 Easy Tequila (and Mezcal!) Cocktails, No Margarita Mix in SightGive these majestic agave spirits the respect they deserve.By Al CullitonMay 2, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically's resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.If the thought of groups of wasted people bellowing about shots and \"chilly margs\" makes you shudder, well: same. And for me, it's doubly cringe-y, because that's unfortunately what too many people think of when they think of tequila. The thing is, tequila—and mezcal, which has grown in popularity in the States of late—is so much more than a party-starter. These are incredibly delicious, complex, and storied spirits, and they're every bit as deserving of serious cocktail attention as anything else on your bar.Before we start making drinks, what are these spirits exactly? And what distinguishes tequila from mezcal? Well, tequila and mezcal have a lot in common. Both are made from the agave, which are large desert plants with succulent leaves. An agave plant can take between seven and 25 years to mature, depending on the species. The plants are harvested, and the leaves are removed, revealing the heart of the plants, which are called piñas. The piñas are cooked and then crushed, fermented, and distilled to make liquor. Cool!There are differences between tequila and mezcal, though. The really important ones are the type of agave used and where they're made. Mezcal can be made from a whole host of agave species, many of which are wild, rare, and cannot be cultivated, and produced in any one of eight different states within Mexico. Tequila, on the other hand must be made from only blue agave, and must be made in one of five states. Beyond those two main distinctions, it’s primarily the traditions surrounding the production of these spirits that create the typical flavor differences between the two.In tequila production, it’s more common to use autoclaves, or steam ovens, to cook the piñas. For most mezcals, the piñas are often cooked over fires in big pits, imparting the smoky flavor we associate with the spirit. The lesson here is that there are smoky tequilas and there are milder mezcals, because these differences in production are a result of tradition, not regulation.OKAY, that was all very interesting, but now it’s time for the fun part! You can choose to make the following four(!) cocktails with tequila, or mezcal, or a \"split base,\" which is a mixture of two spirits instead of one. Bartenders often do this to create a more dynamic flavor, and it works really well for tequila and mezcal. If you don’t know exactly which you and your pals favor, it’s safest to buy a bottle of each. (It doesn’t go bad, after all!)The Lineup.\nPhoto by Chelsie CraigYour Shopping List:1 bottle blanco (unaged) tequila (I like Pueblo Viejo)AND/OR1 bottle Mezcal (Sombra and Vida are both great options)Agave nectar8 oz. pure pomegranate juiceSugarSalt10-12 limes2 grapefruits3 orangesSeltzerPeychaud’s bitters (optional)Some Pre-Mix PrepBefore we get to mixing, let’s get ourselves set up. We’re going to make our own (quick!) grenadine. (Look, I’m not even asking you to make a simple syrup this time—thanks, agave nectar!—so no complaining.) You probably know grenadine from the Shirley Temples you were downing while your grandpa drank Scotch. This stuff got its name from the French word for pomegranate—grenade—and combines pomegranate juice with sugar, which creates a syrup that’s both tart and sweet. Our grenadine will go into two different drinks. It won’t take very long, but it will need to cool a bit, so you should budget in a little time for that.Remove and reserve the peel from half an orange. Pour 1 cup of pomegranate juice into a small saucepan, and add 1 cup of sugar. Simmer over medium heat, until sugar is dissolved. Let it cool! (This is the perfect time to juice your citrus. Cut a bunch of lime wedges, too.) Once cool, express the oils from your reserved orange peel into the grenadine. That was easy, right? And it will taste so much better than the bottle of glorified dyed corn syrup you can buy at the store. Okay, time for a drink!Photo by Chelsie CraigThe Tommy's MargaritaEverybody loves margaritas, but a lot of them aren’t all that great. Bad tequila and gross sour mix can make this fantastic cocktail sink to levels of mediocrity untold. Seriously though, when this drink is properly executed, it’ll appeal to pretty much anyone at the party. Get ready for the best (and most simple) margarita of your life. We don’t need to buy orange liqueur (i.e. triple sec, Cointreau, and the like), which can be pricey and isn’t at all necessary (or recommended!) here. We’ve got something better—the Tommy’s Margarita! It’s named after Tommy’s Mexican Restaurant in San Francisco, where it was invented by Julio Bermejo in the early 1990s. It’s comprised of just tequila, lime juice, and agave nectar—the simplest tequila sour.Salt or no salt? Let's split the difference! Pour some salt onto a small plate. Cut 1 lime into wedges. Make a slit in the lime crosswise. Take a rocks glass and insert the lip of the glass into the slit in the lime and run it 180 degrees around the glass. Dab that section of the glass onto the salt, trying not to get any on the inside.Now, let’s get to mixing. Pour 2 oz. tequila or mezcal, 1 oz. lime juice, and ¾ oz. agave nectar into a shaker. Fill with ice and shake heartily, about 10 seconds. Fill your salt-rimmed glass with ice, and strain your marg into it. Garnish with a lime wedge. Drink one of those while you make drinks for your friends.Photo by Chelsie CraigThe PalomaHere’s a fizzy little number that you might already have met: the Paloma! This tall drink is pretty much nature’s best answer to a hot afternoon. It’s typically made with tequila, lime, and grapefruit soda, but I like putting real grapefruit juice in with just a little lime, sweetening with agave, and throwing in a pinch of salt, too.In a shaker, combine 1½ oz. tequila or mezcal, 1 oz. grapefruit, ½ oz. lime, ½ oz. agave nectar and a pinch of salt. Fill with ice, seal the shaker and shake well. Strain into a collins or highball glass filled with ice and top with soda. Garnish with a lime wedge.Photo by Chelsie CraigThe Mexican Firing SquadNext up is the Mexican Firing Squad, a cocktail with a bit of a mysterious past. History indicates that it was likely invented in Mexico City sometime in the early twentieth century. It was first made known to American audiences by globetrotting bon vivant Charles H. Baker, Jr. who encountered it at the bar La Cucaracha in 1937. Serve this one to the friend voted most likely to travel around the world on a steamer ship.Add to a shaker 2 oz. tequila or mezcal, ¾ oz. lime juice, and ¾ oz. grenadine. Shake well and strain into a small rocks glass over fresh ice. See what you did there? You made a delicious Margarita, only it is sweetened with grenadine instead of agave. But if you want to get really nerdy with me, let’s add 3 dashes of bitters on top as a garnish. (I like Peychaud’s here, but Angostura is great, too, and truer to the original recipe.) Garnish with a lime wedge.Photo by Chelsie CraigThe Tequila SunriseFinally, the pièce de résistance! A Tequila Sunrise. Yeah, you read that right. This one goes out to the one at the party radiating groovy vibes. (I mean, the Eagles wrote a song about it.) It was invented at the Trident in Sausalito way back in the 1970s. Thing is, it hasn’t always been good. But with fresh juice, the addition of lime, and real homemade grenadine, this drink would be downright glorious next to a quiche lorraine at your next summer brunch.Pour 2 oz. tequila (best to skip the mezcal on this one, I think), 1¼ oz. orange juice, ¾ oz. lime juice, and 1 bar spoon of agave into your shaker. Shake well and strain into a large rocks glass over fresh ice. Now, measure out ½ oz. grenadine. Take your bar spoon and turn it so the bowl of the spoon is upside down. Position it against the inside wall of the glass and slowly pour the grenadine down onto the back of the spoon so it runs down the side of the glass and settles on the bottom. Garnish with—you guessed it—a lime wedge. (You’re going to want to stir it up to incorporate the grenadine before sipping on it—after you’ve taken a picture, of course.)There you have it, folks. Four beautiful, easy, completely homemade agave spirit cocktails, no screaming or margarita mix in sight. And you made your own grenadine. No. Big. Deal.Al Culliton is a bartender and writer working in New York City. She is the general manager of the beloved Red Hook bar and restaurant Fort Defiance. Al loves poring over menus and cocktail books from bygone eras, visiting the New English countryside, and cooking for her partner at their home in Brooklyn.Want to equip your bar with the essentials? Right this way:All the Gear You Need to Make Killer Cocktails at HomeYou need more than just a shaker—but not that much more. Here's our list of essential cocktail gear.View StoryExplore Bon AppétitBasicallyHappy Hour with AlCocktailTequilaMezcalRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-02", "author": ["Condé Nast", "Al Culliton"]}