{"id": "e0e79175aee2b2660d646f94314ec874", "url": "https://www.bonappetit.com/story/merlot-comeback", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "Merlot Wine is Back and Better Than Ever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleYou're Not Going to Believe I'm Saying This, But Merlot Is BackYes, you heard me right. By Marissa A. RossNovember 22, 2019FacebookTwitterEmailIllustration by Katie BennFacebookTwitterEmailIn Unfiltered, Bon Appetit's wine editor Marissa Ross shares her latest favorite bottles and—you guessed it—unfiltered thoughts on natural wine.The year is 2004. The film Sideways is released in theaters. Paul Giamatti’s down and dumpy character Miles Raymond throws a temper tantrum fit for a spoiled tween famously crying, “If anyone orders Merlot I am leaving! I am not drinking fucking Merlot!” I was 18, clenching everything from the armrests to my ass as I experienced my first full-frontal male-nudity on the big screen while sitting next to my overprotective mother who only ever let me watch Disney. And NO ONE WANTED TO DRINK CALIFORNIA MERLOT. EVER. AGAIN.Or so it seemed for the last fifteen years. Merlot didn’t die per se, but it had a hard Fade Out. The darling California red of the 1990s was kicked off its pedestal and replaced by the Sideways-approved Pinot Noir. (Merlot disappeared to the point where I didn’t even include it in the chapter of my 2017 book on grape varieties.) It wasn’t because of Sideways, but it was: My only exposure to the wine had been when I was a broke 23-year-old buying dusty $3 bottles at the gas-station-adjacent liquor stores when they were out of the $2 Cab. Merlot simply wasn’t around, and when it was, it felt antiquated and commercially California, boring in a sea of foreign varieties you’d never see at King Liquor Junior.In 2019 though, Merlot has been sneaking its way back onto shelves, and I don’t have to be psychic to know you’ll see more of it in 2020. Today’s winemakers are just as keen on returning to tradition as they are on experimentation, and many wine buyers are bored with light reds and seeking the next new thing, which is almost always something old. Merlot is primed to return as the pendulum swings back from glou-glou. Heavier styles of wine will become en vogue once more, and unavoidable with climate change (hotter temperatures = grapes produce more sugar= more alcohol = bold wines!). But does that mean you want to drink it?Yes! I’m drinking one right now! From Napa! And I love it! I know! Me! Marissa A. Ross! I’m just\\ as surprised as you are! Ashes & Diamonds, the project of proprietor Kashy Khaledi with esteemed winemakers Steve Matthiasson and Diana Snowden Seysses, is on the main highway of California Wine Country, Highway 29. In a sea of faux chateaus, all beige in color with wines nearly as indistinguishable, A&D is a bright, mid-century modern mecca serving up 1960’s inspired California wines including a salute to the velvety Merlots of yesteryear without ignoring contemporary taste-buds longing for acid-driven levity.Ashes & Diamonds “Merlot №1\"” is an opaque maroon at the dining table but more of a cranberry ink in daylight. The nose is warm and opulent, like pulling a cashmere sweater of toasted blueberries over your head and curling up in a plum sauce blanket. It tastes like ripe black cherries wrapped in clove, held by a hem of zinging acidity, with a just-ever-so chocolatey finish and tannins that hang out like good friends long after the party’s over. Well balanced, walking a tight rope between bold and bright, A&D’s “Merlot №1” is mature but mischievous with a personality of its own.I think that’s what’s best about today’s California Merlots. Unlike Cabernet or Chardonnay, Merlot is untethered from outdated expectations. Producers like A&D, Inconnu, Les Lunes, and Forlorn Hope are able to bring Merlot into the modern landscape by embracing their individuality as winemakers without losing the wine’s smooth, dark fruit moves that lured us in to begin with. And with consumers more open minded than ever, Merlot may not just fade back in, it may steal the spotlight.PS. NONE OF THIS SHOULD HAVE EVEN HAPPENED SINCE THE MOVIE LEFT OUT THE PART IN THE BOOK WHERE MILES ONLY HATES MERLOT BECAUSE IT WAS HIS EX-WIFE’S FAVORITE, WHICH IS A LOT TO UNPACK ON ITS OWN, BUT WHATEVER. MERLOT, YOU’RE BETTER FOR IT, BABY.Geeky Wine Editor’s Note: Ashes & Diamonds’ “Merlot №1” is the winery’s first “zero-zero” natural wine, meaning no sulfites added. They have fourteen wines in total, all of which are organically farmed and at or under 50PPM total sulfites, and twelve of the fourteen are fermented with native yeast only. They would probably be filed under “low-intervention.” While I’m generally against additions, I also think it’s important to start recognizing producers that are taking steps in the natural direction. It’s also important to note that Kashy Khaledi, owner of A&D, is a long-time friend of mine but this review was in no way informed or influenced by our relationship. It was just a really damn good Merlot.Explore Bon AppétitUnfiltered natural wineHealthyishessayRead MoreLifestyleThe Wine That Changed My Life Has a New Vintage, and I Can't Stop Thinking About ItBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-22", "author": ["Condé Nast", "Marissa A. Ross"]}