{"id": "e0ec56e9ac7596c2a20a1e087d0211c3", "url": "https://www.bonappetit.com/recipe/new-potatoes-with-mimolette", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "New Potatoes With Mimolette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueNew Potatoes With MimoletteBy Rebekah PepplerMarch 15, 2022EmailPinterestPrintPhotograph by Joann Pai, food and prop styling by Rebekah PepplerEmailPinterestPrintEmailPinterestPrintAs with many things in life, these tender, deeply golden new potatoes from À Table author Rebekah Peppler are even better showered with a flurry of cheese—in this case sweet, nutty Mimolette. If you can’t find the electric orange French cheese, use Parmesan, aged Gouda, or aged cheddar as a substitute. Each alternative will lend its own flavor to the final dish, but at the end of the day they’re still potatoes covered in cheese, and that’s never a bad thing.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonMicroplane$16 At AmazonCitrus Juicer$7 At AmazonIngredients6 Servings¼cup extra-virgin olive oil2lb. new or other small waxy potatoes (about 1\" in diameter), scrubbed, halvedKosher salt, freshly ground pepper2Tbsp. unsalted butter, cut into pieces3Tbsp. fresh lime juice, divided2tsp. piment d’Espelette or smoked paprika, plus more for serving4oz. Mimolette, Parmesan, aged Gouda, or aged cheddar, finely gratedPreparationStep 1Heat oil in a large heavy skillet, preferably cast iron, over medium. Add potatoes and season with salt and pepper. Cook, tossing occasionally, until potatoes are golden brown all over, 10–12 minutes.Step 2Add butter, 2 Tbsp. lime juice, 2 tsp. piment d’Espelette, and ½ cup water to skillet. Cover, reduce heat to low, and cook, tossing occasionally, until potatoes are fork-tender and no liquid remains, 10–12 minutes. Remove from heat and stir in remaining 1 Tbsp. lime juice. Taste and season with more salt and pepper if needed.Step 3Transfer potatoes to a platter and blanket with cheese. Dust generously with more piment d’Espelette.Recipes adapted with permission from  ‘À Table: Recipes for Cooking + Eating the French Way’ by Rebekah Peppler. Copyright © 2021 by Rebekah Peppler. Published by Chronicle Books.\n\nBuy it on Amazon or Bookshop.orgHow would you rate New Potatoes With Mimolette?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerSideEasyQuickGluten-FreeNut-FreeVegetarianSimmerPotatoVegetable Fingerling PotatoYukon Gold PotatoCheeseGoudaCheddarParmesanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Rebekah Peppler"]}