{"id": "e0edba989706c59f024d16f5e3f2dad3", "url": "https://www.bonappetit.com/story/climate-migration-change-how-we-eat", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Climate Migration Will Change The Way We Eat. Here's a Taste of What's Ahead | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureClimate Migration Will Change The Way We Eat. Here’s a Taste of What’s AheadI traveled to the Eastern Mediterranean, where millions of refugees have already been displaced by political strife, to understand what a markedly different future will look like.By Yasmin KhanApril 21, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailFor thousands of years the Eastern Mediterranean has been a place that bridges cultures and continents through empire, trade, and migration. To think of Greece, Turkey, and Cyprus is to picture cobalt blue skies and shimmering seas, sun-drenched islands filled with olive groves and citrus trees, and mezze-laden tables with crisp rings of calamari and vibrant chopped salads. It’s a place where family is central, tradition is honored, and meals are meant to be savored slowly and always with good company. It is also a place that is rapidly changing. Since 2015 an estimated 5 million political refugees have come through the region, the largest movement of people Europe has seen since World War II. This is a huge number by any standard but perhaps just the tip of the iceberg.The link between climate change and food systems has long been documented, from the impact of environmental damage on crops and farmland to calls for eating a more local, seasonal, organic, and plant-based diet in order to sustain natural resources. But the climate crisis and food are connected in other ways too, most notably through migration. As changing weather patterns, rising sea levels, and environmental destruction lead to crop failures and food scarcity, large areas of the earth are steadily becoming uninhabitable, and people are being forced to move. The World Bank estimates that by 2050 we’ll see over 143 million climate migrants, a global challenge likely to shift our ideas about the movement of peoples. It’s also likely to change how we eat, as new migrant communities influence local foodways.Writer and cookbook author Yasmin Kahn \nPhoto by Matt RussellTo learn more about the struggles faced by those who are forcibly displaced, I traveled to the Eastern Mediterranean on a mission to cook with and interview refugees from all walks of life, sharing their tales in my new cookbook, Ripe Figs: Recipes and Stories from Turkey, Greece and Cyprus. It was a journey through clay-red soils and air rich with the fragrance of orange blossom and thyme, punctuated by hundreds of conversations over small cups of dense, sweet black coffee. At the kitchen tables of immigrants from Syria, Iraq, Palestine, Yemen, and Myanmar, I kneaded bread stuffed with Kalamata olives, rolled cigarillos of vine leaf dolmas, and marinated chicken with pomegranate molasses and allspice to be grilled over hot coals.Mozhdeh, a young woman from Iran (who didn’t share her last name), spoke about how re-creating the food of her homeland provided solace and comfort in times of calamity; the kitchen had become one of the few places where she could maintain a sense of identity and dignity in the context of losing so much. We swapped recipes and agreed our favorite Persian dish was kashk-e badinjan, a rich and creamy eggplant dip with fermented yogurt. I also spoke to people working on refugee food projects, such as Lena Altinoglou, who set up a restaurant called Nan (named after the Central Asian word for bread), where locals and refugees work alongside each other on the Greek island of Lesbos. Her aim was to create employment for both communities, along with a space in which they can work together, share meals, and perhaps understand one another a little more.The recipes that follow are a selection of my favorites from my travels, each one highlighting a unique and delicious attribute of this ever-diversifying region. Climate migration will force us to reimagine how we live together on our shared planet, and it is my hope that it will also make us reassess our notions of man-made borders so that people can move in safety and live in dignity. I returned from my trip knowing this was a topic we need as a society to urgently discuss. And in my mind there is no better place to have these conversations than at the dining table.Join us May 18 at 6 p.m. ET for a live Zoom conversation between Bon Appétit executive editor Sonia Chopra and Yasmin Khan. Register here and get a discount code for 10% off online orders of Ripe Figs from Politics & Prose.Get the Recipes:Chana MasalaThe key to Yasmin Khan’s excellent chana masala? Chickpeas so soft that they melt in your mouth.View RecipeHot Yogurt and Spinach SoupHot yogurt soup? Yes, hot yogurt soup. It’s creamy, savory comfort in a bowl.View RecipeHalloumi SaganakiDid somebody say fried cheese? Halloumi drizzled with honey and aromatic thyme makes for an ideal sweet-salty-crunchy appetizer.View RecipeKisir (Spicy Bulgur Salad in Lettuce Cups)In this dish from southeastern Turkey, chewy, nutty bulgur meets sour-sweet pomegranate molasses meets spicy Aleppo-style pepper meets crunchy-cool lettuce cups.View RecipeIstanbul’s Famous Mackerel SandwichesIstanbul is famous for its grilled mackerel sandwiches dressed with fresh lemon and plenty of crunchy veg—best eaten while strolling along the Bosporus, but equally delicious at a cookout or picnic.View RecipeSour Cherry CheesecakeTangy sour cherries meet sweet and pillowy cheesecake in the ultimate spring-to-summer dessert.View RecipeExplore Bon AppétitTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-21", "author": ["Condé Nast", "Yasmin Khan"]}