{"id": "e1053b9206aca371e8511f9e63eef9e4", "url": "https://www.bonappetit.com/story/i-tried-a-fibroids-diet", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "What’s a Fibroids Diet? And Can It Ease My Uterine Pain? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Simple Dietary Changes Eased My Fibroid PainWith expert guidance, I tried a fibroids diet. The results were life changing.By Julie PooleJanuary 12, 2022FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiFacebookTwitterEmailEarly last year, at 41, and after years of painful periods, I was experiencing abnormal bleeding that made it difficult to walk. My lower back ached. My upper thighs went numb. And I experienced sharp, sudden stomach cramping like never before. After I started seeing stars, I finally called my insurance plan’s telemedicine hotline and admitted to the doctor that I’d been bleeding heavily for over a month. “You need to go to the ER right now,” he said, explaining that prolonged bleeding can cause anemia, which can be fatal if not addressed.I had three uterine fibroids, the ER doctor explained, which are non-cancerous tumors that grow in the uterine wall. I’m not alone: fibroids affect up to 80 percent of people with periods. Many are asymptomatic, and others cause symptoms—like bloating, abdominal pain, heavy and prolonged bleeding—ranging from mild to severe. Though it was all overwhelming information, I did feel relieved to finally have a diagnosis. For so long, my periods had been painful, but growing up Catholic, I’d always been told that it wasn’t something to talk about but something to endure—quietly. The two ultrasounds (a transabdominal and a transvaginal ultrasound) that I had done at the ER told me what I should have known years earlier: neglecting my pain was no longer an option. I had to take charge of my health.While I waited for a follow-up appointment with an OBGYN to discuss treatment options, I started searching for a diet to promote uterine health. I found plenty of books and search results about prenatal and hormone balancing diets but very little related specifically to fibroids. Confused, I decided to talk to the experts—Elizabeth A. Stewart, M.D., a gynecologist and reproductive endocrinologist, and the author of Uterine Fibroids: The Complete Guide, and Ana Rhoden, a certified plant-based nutritionist and health coach and the author of Ready for Wellness: A Wellness Guide and Cookbook for Women with Uterine Fibroids & Feminine Issues—to get an overall picture of what fibroids are, how they might be impacting my health, and what I might be able to do about it.With their guidance, I decided to try a fibroids diet filled with anti-inflammatory and easy-to-digest foods. I cut out red meat and traded most of my carbohydrates for an array of green vegetables, seasonal fruits, legumes, nuts, and herbal teas. I said goodbye to dairy products (welp) and hello to non-dairy milks and cashew butter. I stopped drinking alcohol years ago, so that beverage wouldn’t be missed, but I drew the line at caffeine. I just couldn’t give up my morning cup of English Breakfast tea, especially after the years it had taken for me to wean off coffee. I did, however, reduce the strength from two bags to one.I stuck to my new habits, determined to find some relief. I baked carrot fries garnished with fresh parsley, made gluten-free chicken soup, and tried Rhoden’s umami-packed recipe for mushroom steak—destemmed and thickly-sliced portabella mushrooms that are baked and drizzled with Worcestershire sauce. I satiated my sugar cravings with sliced Pink Lady apples and nut butter. I made homebrewed ginger tea. (Cool a portion in the fridge and add sparkling water for a tummy-soothing tonic.) Within a couple of weeks, I was actually having fun in the kitchen. I poured the years of pent-up body shame into preparing nourishing meals, started to see my uterus not as a curse but a part of me that needed tenderness and care, and noticed my lower back pain had eased significantly. My moodiness and fatigue did persist, and Stewart said—noting a link between high levels of cortisol and fibroid symptoms—that this could be stress related. Regardless, I kept my goal in mind, reaching for a better quality of life.A fibroids diet, as Rhoden and Stewart reminded me, isn’t a one-size-fits-all plan; it takes some tinkering to find what works for you—and should always be accompanied by gynecological advice. While many of my symptoms have eased dramatically with the various dietary changes outlined below, perhaps, most importantly, I finally feel more connected to my body. After all those years of cursing my uterus, I’m finally taking care of her (she goes by Marge) while acknowledging that I deserve to live without chronic pain. Here’s what I’ve learned along the way:First, what are fibroids?Fibroids, also called leiomyomas or myomas, are benign (non-cancerous) growths located in the uterine wall and typically ranging in size from a marble to a grapefruit. (Though, the largest fibroid ever removed reportedly weighed 61 pounds.) “Although size influences fibroid symptoms, location can be even more important,” Stewart wrote in Uterine Fibroids. Meaning, the type of fibroid present dictates how a patient might feel.What causes fibroids?Unfortunately, not a lot is known about what causes fibroids. “It’s astonishing, given how common fibroids are, that many of the most basic questions haven’t been answered,” Stewart tells me over the phone. “We should know as much about fibroids as we do heart disease but we don’t.” While studies haven’t concluded why fibroids develop or what makes them grow, family history plays a role, as do the reproductive hormones, estrogen and progesterone. And Black people, whom Stewart says are most at risk for fibroids, usually show symptoms at a younger age (20 to 30s, versus 30s to 40s). Fibroids can shrink on their own, says Dr. Stewart, when menstruation ends and menopause starts, at which point they may no longer cause pain.What are the symptoms of fibroids?The people Stewart treats exhibit a range of symptoms based on the number of tumors they have and their locations and sizes. “For some,” she says, “pain is localized in the uterus, while others might experience back and leg pain.” And various patients only experience fibroid pain during their periods, whereas others experience both menstrual and non-menstrual pain. The most common fibroid symptoms include: pelvic cramping, heavy and/or long periods, irregular bleeding, bloating, frequent urination, lower back and leg pain, and pain during sex.How could a fibroids diet help?The following fibroids diet suits me but might not be ideal for you; take the suggestions that help and leave the rest. Common fibroid symptoms, like constipation and bloating, are indicators of what’s working and what’s not. “Your body knows what it needs,” Rhoden says. And tuning into that data is an empowering first step in anyone’s uterine health journey.Go big on fiberRhoden advises her clients to “crowd in” plant-based foods, especially leafy greens like kale, spinach, broccoli, collard greens, swiss chard, and fruits such as oranges and apples. The fiber in whole fruits and vegetables, and whole grains, like oats, is intended to relieve constipation, a symptom (which, unfortunately, I can attest to) that often accompanies fibroids.Minimize processed and inflammatory foodsAccording to Rhoden, foods that are already difficult to digest will likely cause problems for those suffering from fibroid pain, because, as the intestinal tract expands, it puts pressure on neighboring organs like the uterus. Red meat, for example, can take days to move through the digestive tract. And nearly 70% of the global population have difficulty processing dairy. It’s also important to stay clear of: products that have added growth hormones (like meat, dairy, and eggs), which may interfere with the body’s hormone regulation system; processed foods, like boxed mac and cheese and sugary cereals, which not only lack fiber and nutrients, but might cause diarrhea; “white foods” like bread, white rice, and flour, which could exacerbate bloating; and sugar, which can increase inflammation in the body.Make simple swapsFoods like mushrooms and walnut “meat” (great for tacos) satisfy cravings without exposing you to added hormones. Ideally, replace caffeine and alcohol, says Rhoden, with hydrating beverages that aid digestion, like red raspberry leaf, mint, and chamomile teas, along with plenty of water.Ramp up the vitamin-DStewart says that the key to a good fibroids diet is vitamin-D. Sunlight is the best source of vitamin-D but since it’s hard to come by year round, taking a supplement helps. The trick, Rhoden adds, is to be consistent. (I bought a pill organizer to stay on track.) Vitamin-D rich foods, like some mushrooms and fortified non-dairy milks are also solid choices for people sticking to a plant-based diet, which is what Rhoden recommends. (Green tea extract has also shown promising results in reducing the size of fibroids and improving heavy bleeding.)How does food complement other fibroid treatments?According to Stewart, fibroids are the leading reason for hysterectomies in the United States. “If the only option you’re being given is a hysterectomy, then I think it is reasonable to think about getting a second opinion,” she heeds, because there are a variety of other treatment options available for fibroids. These can include: hormone therapies (birth control pills, injections, and IUDs) to reduce bleeding; non- or minimally-invasive treatments, such as focused ultrasounds, arterial embolization, and radiofrequency ablation, to help shrink or destroy fibroids; and surgeries (like abdominal myomectomy) to remove the fibroids. While surgical treatments can be effective, Stewart says, they may impact the ability to get pregnant, so it’s important to thoroughly discuss options with your doctor. It’s also important to add that, even if removed, new fibroids can grow back, according to Stewart.My own treatment journey has been holistic. Well over a month in, the dietary changes have already diminished my cramps, hormonal headaches, bloating and constipation, and general moodiness. I’m sleeping better, my adult acne is under control, and my hair is softer and not falling out as much. Aside from switching up my diet, I found a new birth control pill that helped with heavy bleeding. I also tried massage, qigong, meditation, and long walks to help reduce stress and boost my mood and energy. Thinking back to when it was painful to simply walk across my apartment, I feel elated to track my steps again.Explore Bon AppétitLifestyleCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-12", "author": ["Condé Nast", "Julie Poole"]}