{"id": "e11a91748682439d42a7f0983c7f2dc3", "url": "https://www.bonappetit.com/story/tech-free-sundays", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "I Tried Going Tech-Free on Sundays and Boy Was It Hard | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Tried Going Tech-Free on Sundays and Boy Was It HardWhat I learned from disconnecting for twelve hours (like, the extent of my phone addiction).By Rachel Sugar November 5, 2018FacebookTwitterEmailIllustrations by Igor BastidasFacebookTwitterEmailThis story is part of the Healthyish Guide to Sunday, a compilation of recipes, suggestions, and obsessions to make the first day of the week your favorite.The night before I am to begin my adventure in “Tech-Free Sundays,” it occurs to me that I should Google “Tech-Free Sunday,” which I’m pretty sure I won’t be able to do once it’s Tech-Free Sunday.There are various approaches to Tech-Free Sunday, but they are all, in spirit, pretty much the same: you are supposed to forswear your various devices—phone, computer, TV, Kindle, all of it—and instead connect with the non-digital world around you, like your partner, or your children, your feelings.It sounds very, very hard.Like everybody else, I am addicted to my devices. I wake up to the alarm on my phone, which usually rings from inside my bed, because that is where I left it, when I fell asleep reading WebMD. I am online at work, and online at home. I check Twitter constantly: what if someone said something? I read the newspaper on my phone. I read novels on my phone. “Go to sleep!” my boyfriend says to me, on a somewhat regular basis, when it is 2 a.m. and I am reading the personal blogs of non-famous people I do not know. Usually, when he says this, he is gazing at his phone.But the people recounting the virtues of tech-free Sundays are ecstatic about the virtues of disconnecting from the internet. “The first time we unplugged, it felt like the longest day ever,” filmmaker Tiffany Shlain told Greatist. “And that was wonderful. I knew then that it was something I wanted to do every week.” She and her family have for years been observing what they call “Technology Shabbat”—a modified version of the Old Testament sabbath that plenty of people have been practicing for, well, millennia.I read blog posts about all the things I’ll notice when I’m not checking my phone. It will be just like it was in the old days on the prairie, or in 2006.“I’m doing Tech-Free Sundays now!” I tell my boyfriend, on the Saturday night before my no-tech journey starts. “Oh,” he says. “So are you giving up, like, the wheel?” I define my terms. No: computer, phone, iPad. No: email, Twitter, Instagram. Yes: wheels, modern medicine.And then I wake up in the morning and fail. The problem is work: I need to meet a deadline. Could I do it without a computer? I mean, sure. Galileo accomplished amazing things! (What “things” exactly I would have to Google.) “It’s fine,” I announce, to no one. “I’ll just use the computer for work, but I won’t check Twitter or anything.” And I don’t, for many hours. And then I do. It’s right there! And though I check it very briefly, just in case anyone died or is mad at me, the spell is broken. Every minute I spend on my computer-but-only-for-necessary-reasons is a test of willpower; it is like playing don’t think of pink elephants, where the elephant is social media. I am not blissed out. I am miserable.But the beautiful thing about Sundays is that there is always another one. The next week, I refine my approach: no tech, at all, between the time I wake up and 9 p.m.This time, I am prepared. On Saturday, I make a list of everything I want to accomplish over the weekend, and then work my way through all the parts that require technology: I send emails. I print return labels. I look up directions. That night, I research everything I can think of: I Google exes and early signs of colon cancer. I read the entirety of the New York Times. And then I put my phone down, and when I wake up on Tech-Free Sunday, I do not pick it up again.Instead, I read. I finish a book—one with paper!—and then move onto magazines. Do you know how pleasurable it is to read a magazine by touching it? It is a delight, like petting a very literary cat. I read articles I didn’t even know I was interested in, just because they were there! I laugh. I weep. “Look at me, doing Tech-Free Sunday,” I think, reading a long article about the financial crash of 2008.The first hitch comes when I go to meet a friend. I’m running late, on account of all the magazines, but have no way to tell him. Also, after leaving the house, I have no idea what time it is, because my watch is my phone and my phone is at home. You’re supposed to notice things on Tech-Free Sunday? Here is what I notice: there are no public clocks, anywhere. I know that now. I also know that maybe I should buy a watch. I pass a dog I want to take a picture of—it is very fluffy, and sitting like a child—but I can’t, so I don’t. I want to check my grocery list, but I can’t do that either.I meet my friend and apologize for being both 15 minutes late and unreachable on account of Tech-Free Sunday, and he chuckles at my stunt journalism and is, I think, impressed. (Oftentimes I am 20 minutes late.). I do not pick up groceries, but we don’t need any. I worry that my parents won’t be able to reach me in a crisis, but there are no crises. And at 9 p.m., I check my email, and find I have missed several sales promotions from Old Navy and nothing else.Was I relaxed? It is an unfamiliar feeling, but I was. I felt a semblance of control over my life; for the first time in weeks, it seemed like there was a healthy buffer between myself and the world. It was like a wilderness vacation, only in my house. (I have never taken a wilderness vacation.)But because life is nothing if not a learning process, the next weekend, I told everyone who might need to get in touch with me that I would not be reachable on Sunday. Did this feel obnoxious? Yes. But it also felt necessary: I live in a city, with a cell phone, in 2018. If I’m going off the grid, it seems obligatory to inform the people who might need me—how else will they know I won’t get the message that they’re running late? A friend I’d told texted me anyway. He was running late. Conveniently, I was also running late. Tech-Free Sunday is all about embracing serendipity.Again, I read. I thought. I used a pen to make a grocery list on paper. I walked my dog, and then, because I had nothing else to do, I took her to the dog park. “See how present I am!” I thought, as she cowered in a corner.But by 8 p.m., I was counting down the minutes until the experiment ended. For better or worse, my life is online, and I wanted to live it. I also wanted to order a sports bra on the internet. And then the clock struck 9 and the experiment was over.I had hoped to emerge a different person: someone who has a “night time routine” and “work/life balance.” Someone who enjoys “candles” and “beach vacations;” the kind of person who does not sleep cuddling her phone. I did not. Over the course of my Tech-Free Sundays, I did not spend any time on my “personal artistic projects,” like the tech-free Sunday bloggers said I might. Nor did I particularly bond with the people close to me, because while I was very present, all I could talk about was Tech-Free Sunday. Also, they were mostly on their phones.And yet I loved it. Or at least, I liked it? Or at least, I would recommend you do it, once or twice, just to see. There is so much time, when you are disconnected from the internet; it is shocking, how much time there is. I don’t know that I will continue Tech-Free Sundays, but I will continue taking tech-free baby steps: leaving my phone at home; reading book-shaped books; spending intentional periods away from my computer.Cutting myself off from technology was a temporary reprieve from the looming dread that someone might ask something of me. How could they? I imagined I would find this stressful, all this not-knowing—What if someone wanted something? What if I was being awarded a very urgent prize?—but it’s really quite easy to adjust to a total lack of demands. I didn’t know what anyone else was doing, in real life or on Instagram, and it was a relief, for one day only, not to care.Explore Bon AppétitGuide to SundayHealthyishessayRead MoreLifestyleThe Little Doodad That Turns My Apartment into a Fancy HotelBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-05", "author": ["Condé Nast", "Rachel Sugar"]}