{"id": "e12797ea6accc984753179dcddfe218a", "url": "https://www.bonappetit.com/story/family-dinner", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "I Dread Making Dinner Every Night, But It’s Also the One Thing I Look Forward to Each Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingI Dread Making Dinner Every Night, But It’s Also the One Thing I Look Forward to Each DayEverything everyone said about family dinner is true.By Carla Lalli MusicApril 9, 2020FacebookTwitterEmailPhoto by Gentl and Hyers, food styling by Susie Theodorou, prop styling by Nina LalliFacebookTwitterEmailEvery Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.How many dinners is an amount of dinners to cook before the cook has had enough of making dinner? In my case I would say the fatigue kicked in around number 16, which is more dinners in a row than I have ever cooked in my natural-born life. Before all the stay-at-home orders and other life-altering events of the past month, my sons ate with their babysitter hours before I even got home from work, and my own weeknight dinners were pretty slap-dash, usually consumed at the kitchen counter, catching up with my husband and kids after a long day spent grazing on whatever was cooking in the Test Kitchen. I loved to make dinner on the weekends, but to be fair, at least one weekend night was spent at a restaurant, where some of our absolute favorite family meals have taken place. Ah, the memories. Now, I start thinking about what we’re going to eat around 4:30 p.m. every single day, and some meals are definitely more successful than others.What I’ve learned about making our nightly meal is that my work day will be usurped a lot earlier than I want it to be. I’ve learned that the kitchen needs to be cleaned (again) before I can even start cooking, otherwise I feel chaotic and scattered. I’ve learned to suppress my cravings and use only what we have in the house, rather than making a quick market trip for a piece of fish when I’m in the mood for that, or to the corner store for eggs when I realize we only have one left. Those normal things that I used to do all the time now feel shrouded in Kryptonite; I am still disoriented by the thought that the bodega is a risky place, and saddened that all of my beloved restaurants have closed their dining rooms. But being forced to be resourceful has validated truths about home cooking I believed in since “before”: Any assortment of simple things that are cooked properly and seasoned well can be a perfectly acceptable meal. That is true even when the dinner menu consists of steamed sweet potatoes, a plate of bacon, and fried plantains with a side order of kimchi, which is a real thing we had one night.Truly, though, most of our meals have gotten pretty loose. Breakfast is a rolling stop of smoothies and cereal, staggered to meet our varied waking hours. Lunch is leftovers, cut-up cucumbers, grilled cheeses, last night’s rice crisped-up with the beans that are always in the fridge. I think leaning into simple solutions, even if a bit boring, is just part of the evolution of this home-centric lifestyle.Want this letter before it hits the website? Sign up for our newsletter!Never not relying on pesto.\nPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioBut dinner still commands a little respect, somehow achieving the scrap of formality that this sweatpant-clad family can lay claim to. We set the table with placemats and real napkins and someone lights candles. We turn off the news and turn on music. We wait until everyone sits down to start eating and we try to remember to clink glasses, too. Some nights require a little upselling: Why yes, we are having brassicas two ways tonight—roasted broccoli to accompany your pasta with kale pesto. Black beans flavored with cumin and chiles in adobo goes great with lemongrass-braised short ribs from three days ago as long as there’s grated cheese to put on top! But you know what? We eat. We sit and we eat, and then when we’re done eating there’s even some talking and hanging out afterwards. As a parent, it’s my job to coax as many minutes as possible out of table time, and recognize how rare and special it is.There will be a lot of things I won’t miss about sheltering at home: The monotony, the anxiety, the separation from my friends and family, the constant simmer of worry about my parents, to name a few. But I know I will miss these meals, meals that no one rushes away from because there’s nowhere to go. I am squeezing a year’s worth of Sunday suppers into a single month, filling the bank on family time, knowing it will transition to a series of big withdrawals as soon as the outside world opens up again. My teenager is laughing at my jokes, the vegetarian gobbles up whatever I serve him, my husband always tells me everything I cook is the most delicious thing he’s ever had, and the time we spend together represents 100 percent of the comfort and community I have in my life right now. The best thing about dinner is that we’re here to have it. It might be random, but it sure happens regularly these days, and I’m happy to keep showing up.Explore Bon AppétitCarla NewsletterCoronavirusRead MorecookingMy Kitchen Is Small But I Swear It’s MightyBy Sarah JampelLifestyleAsk Andy: I’ve Started Texting My Ex During Social Distancing...Should I Stop?By Andy BaraghanicookingYou Probably Don’t Have Enough Dish TowelsBy Ali FrancisCoronavirusThere's No Better Time to… Make Yogurt at HomeBy Caroline LangeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-09", "author": ["Condé Nast", "Carla Lalli Music"]}