{"id": "e1283e6400b125f98e44a59ee7ebd005", "url": "https://www.bonappetit.com/recipe/bison-rib-eye-with-pickled-vegetables", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Bison Rib Eye With Pickled Vegetables Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueBison Rib Eye With Pickled VegetablesBy Brian YazzieApril 20, 2021EmailPinterestPrintPhotograph by Jaida Grey Eagle, prop and food styling by Rose DanielsEmailPinterestPrintEmailPinterestPrintBison have been crucial not only to the Indigenous community but also to the land. They restore the prairie ecosystems on which they graze, increasing plant diversity, fertilizing soil, and sequestering carbon underground to help reverse climate change. “Bison are indigenous to North America, and they represent the resiliency of Indigenous communities,” says Brian Yazzie, the executive chef of Gatherings Cafe inside the Minneapolis American Indian Center. He’s a big fan of Brownotter Buffalo Ranch bison, owned by Ron Brownotter, who has let his bison roam and graze on 200,000 acres of native grasses for the past two decades.For this recipe, Yazzie seasons bison rib eye with smoked salt and juniper, then cooks it in a hot pan with aromatics like sage and garlic. Because bison is rich in flavor but relatively lean, you can substitute it with grass-fed beef. He finishes the meat with sweet pickled radishes, which take two hours to pickle, so plan accordingly.Ingredients4 ServingsPickled vegetables1tsp. sunflower or extra-virgin olive oil1garlic clove, crushed2scallions, cut into 2\"-long strips½tsp. cracked black peppercorns½cup maple vinegar or ⅓ cup apple cider vinegar plus 3 Tbsp. maple syrup1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt1lb. radishes and/or summer squash, radishes trimmed, thinly slicedRib eye and assembly2tsp. juniper berries, finely chopped212-oz. bison or beef bone-in rib-eye steaks (½\"–¾\" thick)Smoked or kosher salt1Tbsp. sunflower or extra-virgin olive oil, plus more for drizzling2sprigs sage2garlic clovesspecial equipmentA spice mill or mortar and pestlePreparationPickled VegetablesStep 1Heat oil in a small saucepan over medium. Cook garlic, tossing, until light golden and fragrant, about 3 minutes. Add scallions and peppercorns and cook until scallions start to wilt, about 1 minute. Add vinegar and salt and bring to a simmer. Transfer to a small bowl and add 1 cup cold water. Add radishes and/or squash; let sit at least 2 hours, or cover and chill up to 12 hours before using.Rib eye and AssemblyStep 2Heat a large cast-iron grill pan or skillet over medium-high. Toast juniper berries, tossing occasionally, until very fragrant, about 2 minutes. Transfer to a small plate and let cool. Finely grind in spice mill or with mortar and pestle. Reserve pan.Step 3Sprinkle steaks all over with ground juniper, then season with smoked salt. Lightly coat with oil and let sit 5 minutes.Step 4Heat 1 Tbsp. oil in reserved pan over medium-high. Cook steaks until golden brown underneath, about 3 minutes. Turn over and add sage and garlic to pan. Continue to cook steaks, basting with oil, until golden brown underneath, about 3 minutes for medium-rare (internal temperature should hit 120°). Transfer steaks to a cutting board and let rest 10 minutes before slicing.Step 5Sprinkle steaks with more smoked salt; serve with drained pickled vegetables.How would you rate Bison Rib Eye With Pickled Vegetables?Leave a ReviewTell us what you thinkExplore Bon AppétitNative AmericanAmericanBisonMeatWeeknight MealsMainDairy-FreeGluten-FreeFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Brian Yazzie"]}