{"id": "e12aee028d175efb8bccd8e5f12de8dc", "url": "https://www.bonappetit.com/story/tomato-candle", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "This Scented Candle Lets Me Hold Onto Tomato Season All Winter Long | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Tomato-Scented Candle Lets Me Hold On to Summer All Winter LongTomato season is dead. Long live tomato season!By MacKenzie Chung FeganSeptember 25, 2020FacebookTwitterEmailEmma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!There’s a routine to my September—switching from iced tea back to hot, rotating fall jackets to the front of the closet, and preserving food with a zeal both obsessive and slightly desperate. I buy boxes of imperfect Romas to make tomato sauce, fill my freezer with spent cobs for future corn stock, and jar as much peach jam as will fit in my pantry. These are my insurance policies against the relentlessness of New York winter, the late summer nuts I unearth in January and February like a seasonally depressed squirrel.While I don’t know if Malin+Goetz had me specifically in mind when developing its limited edition tomato candle, I appreciate having another way to sock away a bit of summer for the cold days ahead. The vegetable wax candle bursts with floral green abundance, like a garden baking in the hot afternoon sun. There’s green pepper base notes, lavender top notes, and sandwiched somewhere in the middle, subtle enough not to be polarizing, is the scent that clings to your fingers when you rub a tomato leaf—sharp and verdant with a hint of gasoline. It smells like freshly laundered sheets hung out to dry in a greenhouse.The 9-oz. candle has a burn time of 60 hours, so I figure if I limit myself to half an hour a day, that’ll take me from December straight through to March, at which point ramp season will rescue me from winter despair. And, like late summer’s heirloom tomatoes, it’ll only be around for another couple of weeks, so get it before it's gone.Emma FishmanTomato Candle$55 at (MALIN+GOETZ)Explore Bon AppétitHealthyishTomatoSummerHealthyish Loves ItShoppingWinterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-25", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}