{"id": "e13faf4456a7277d264b9c371a1de461", "url": "https://www.bonappetit.com/recipe/why-is-it-so-good-gravy", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Good Gravy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueWhy-Is-It-So-Good GravyBy Carla Lalli Music and Molly BazOctober 15, 20194.5(59)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintA make-ahead gravy that doesn’t rely on turkey drippings or a roux. The gravy’s depth of flavor comes from roasted poultry bones and—surprise!—a sprinkle of MSG, which has an umami-to-the-max effect. (Despite exaggerated fearmongering reports in the ’70s, MSG is harmless in such small quantities; read more here.) If you have the backbone from breaking down the turkey into pieces, use it in tandem with the wings. See all of the Absolutely, Positively Perfect Thanksgiving recipes here.Ingredients8–10 servings3lb. turkey and/or chicken wings, flats and drumettes separated4Tbsp. extra-virgin olive oil, divided2heads of garlic, cut in half crosswise2large shallots, unpeeled, halved14\" piece ginger, scrubbed, thickly sliced4oz. crimini, shiitake, or white button mushrooms, torn into large pieces2tsp. black peppercorns, lightly crushed6Tbsp. all-purpose flour4Tbsp. unsalted butter, room temperature½cup amontillado sherryHandful of parsley or parsley stems6cups turkey stock or low-sodium chicken broth, warmed2tsp. sherry vinegar or red wine vinegar1tsp. MSGKosher salt, freshly ground pepper (optional)PreparationStep 1Preheat oven to 450°. Toss wings in a large cast-iron skillet with 2 Tbsp. oil until coated. Roast, tossing halfway through, until golden brown and starting to crisp, 25–35 minutes.Step 2Remove wings from oven and add garlic, shallots, ginger, mushrooms, peppercorns, and remaining 2 Tbsp. oil to pan; toss to coat. Return to oven and roast, tossing halfway through, until wings are deeply browned and crisp and vegetables are browned, 30–40 minutes more.Step 3Meanwhile, mash together flour and butter in a small bowl with your fingers or a fork until homogenous. Set beurre manié aside.Step 4Remove skillet from oven and set on stovetop over medium-high heat. Add sherry and cook, stirring and scraping up any browned bits with a wooden spoon, until sherry is almost completely reduced, about 2 minutes.Step 5Scrape wings and aromatics into a medium pot and add parsley and stock. Bring to a low simmer over medium-high heat. Reduce heat and simmer gently, skimming fat from surface occasionally and turning wings so both sides get a chance to be submerged, until liquid is flavorful, mahogany in color, and reduced by about one-third, 30–40 minutes.Step 6Fish out wings; discard. Pour mixture through a fine-mesh sieve into a large measuring glass; discard solids. Rinse out pot and pour turkey mixture back in. Bring to a simmer over medium. Whisking constantly, add reserved beurre manié and whisk until completely incorporated. Simmer, whisking often and skimming any foam from surface, until gravy is thick enough to coat a spoon, 6–8 minutes. Remove from heat and whisk in vinegar and MSG. Taste gravy and season with salt and pepper if desired.Step 7Do Ahead: Gravy (without vinegar and MSG) can be made 5 days ahead. Let cool, then cover and chill. Reheat over medium until simmering, then add vinegar and MSG.How would you rate Why-Is-It-So-Good Gravy?Leave a ReviewTell us what you thinkReviews (36)Back to TopTriangleI’ve made this recipe at least 4 times now for various thanksgivings and christmases, and it always has rave reviews from my very large family. I have modified it a little over time- I always use the backbone from the turkey as well as the neck of the turkey as well, and don’t use the chicken wings at all anymore- helps make it more cost effective as well, as chicken wings are over $20 a pack at my local grocery store! I do every step in a cast iron dutch oven, and only transfer to a pot for the last step when whisking in the beurre manié (I usually make it 2 days in advance). I have never made it with MSG, not because I’m averse to it myself, but because I’m always making for a large crowd and I don’t want to deal with the hassle of someone having an issue with it. I still think it tastes amazing without! MarieHenOntario, Canada12/23/2021Please everybody stop with the msg myth. It is eaten all over the world AND YOUR OWN BODY MAKES IT. Anonymous11/28/2021I might try this again but modified without the msg. It tasted good but we didn’t feel well afterward. Growing up, I always got terrible headaches from msg and I thought I should give it try as an adult. My husband and I both got very bad headaches and felt a bit sick to our stomachs afterward, which are unusual food reactions for us. To the angry little reader who commented that “racist” “idiots” get headaches from msg: we are neither; we hope you can get through the holiday with a little more open-mindedness and less bitterness in your heart.HeidiNew York11/25/2021I only yielded about 1-1/2 cups of gravy. Maybe I reduced it too long. The recipe was easy to follow and execute. I used turkey wings. It came out pretty good. I wouldn’t say it’s “out of this world”. I haven’t added the vinegar and msg yet because I’m making this ahead of time so we’ll see how it all comes together once those last ingredients are added. I didn’t have a cast iron big enough for my turkey wings so I used a sheet pan. Works just fine. When reducing the sherry wine I just removed the wings and put the sheet pan on top of a burner. Worked great. Not sure if I’ll make it again since it is time consuming and not exactly “exceptional”.Poua YangAustin, TX11/23/2021You're an idiot if you believe the racist propaganda that MSG gives you headaches. Doritos have a ton of MSG and no one's complaining about a headache after eating Doritos.AnonymousMoon11/22/2021Has anyone made this with cornstarch? My Mom is gluten free and I have to cook GF gravy for her.Emily 11/17/2021Can this be made ahead and frozen?AnonymousMenlo Park, Ca11/10/2021So good, I'm making it for a third year in a row and I wouldn't change a thing. Worth all those wings (and you can snack on the meat), and all that work.APHouston11/10/2021Nooooooo to MSG! That stuff makes me so sick- for 3 days! No, No, No!AngelaCharlotte1/1/2021Perfect. I couldn't find any amontillado so I used cabernet sauvignon and it turned out fantastic, way better than I expected. Forget what you heard in the 70's, MSG is almost the most important ingredient, don't sleep on it. Will make this again every year and probably a couple more times in between.MarajeChicago11/24/2020As a veteran cook with nearly 75 years experience, I know 2 things about this recipe simply by the ingredients and instructions: 1) this gravy will be exceptionally and insanely delectable; and 2) it’s exactly the sort of time-consuming but oh-so-worth-it recipe I loved to prepare for family and/or friends over the years when younger. I do, however, suggest one small change; viz., use a bit of umami (to taste) in place of the MSG (which I thought is now illegal in the US (?!) anyway). Alas, alone now this pandemic holiday season, I plan to make a turkey breast in my Instant Pot. In the past, I’ve had great success making it in my microwave, complete with dressing and salt pork strips that replicated the taste of the oven roasted birds with which we’d grown up, for small gatherings of 3 to 5 people. However, the recipes for Instant Pot gravy that go with the turkey are singularly unappealing, as they tend to be nothing more than an afterthought and consist of plain cornstarch and water with a bit of pot juices for flavor. In order to avoid a depressingly bland Thanksgiving turkey experience, I will use my skills to adapt the best elements of this over the top gravy recipe, which I have starred and archived toward a day when family and friends can once more safely break bread over a festive table loaded with wonderful creations and familiar favorites.Munch88NYC11/22/2020Recipe name matches the results! Super tasty. We made a double batch and that was plenty for the meal, though not quite enough to use amply with leftovers. Also, we used the Trader Joe's umami seasoning instead of the MSG due to food sensitivities, and it turned out great! We used 2 teaspoons of that, but we probably should have done 3 or even 4. midmadelinePortola, CA12/27/2019Can I ask why the msg should be added just before eating?KkomadinaAustralia12/19/2019Convinced my family to let me make this slightly time-consuming recipe for Thanksgiving and it was totally worth it! I started the day before and saved the liquid after removing solids and straining. Day of, I added turkey drippings and finished the recipe. It was so good that even my snobby second cousin from LA said he was impressed. I'll be making this (and the Making Perfect turkey) every year!AnonymousCharlotte, NC12/7/2019Foolproof! This recipe has so much umami Flavor and complements everything on a thanksgiving plate! 10/10 making it next year.EnoughpotentialNorway12/5/2019Explore Bon AppétitSauceGravyAmericanTurkeyPoultryMushroomVegetableSherryAlcohol & Other DrinksSideNut-FreeSimmerThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Carla Lalli Music", "Molly Baz"]}