{"id": "e140390be986661c2b176e53b6fd2465", "url": "https://www.bonappetit.com/recipe/dairy-free-corn-chowder-with-clams-and-chorizo", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Dairy-Free Corn Chowder with Clams and Chorizo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueCreamy Corn and Clam Chowder With Crispy ChorizoBy Andy BaraghaniAugust 10, 20214.4(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Julian Cousins, food styling by Adriana Paschen, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis silky corn-and-clam chowder is a slurpable ode to summer’s golden child. Puréed corn lends body to the briny yet light broth from the clams, giving this soup its creamy texture while keeping the dish dairy-free.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronImmersion Blender$100 At AmazonLarge Pot$55 At AmazonKamenoko Tawashi Scrub Brush$7 At AmazonLadle$27 At AmazonIngredients4 Servings5Tbsp. vegetable oil, divided4oz. fresh chorizo, preferably Mexican, casings removed1tsp. hot smoked Spanish paprika or smoked paprika1medium onion, finely chopped6garlic cloves, thinly sliced24littleneck clams (about 2 lb.), scrubbed4ears of corn, kernels removed (about 4 cups)1–2Tbsp. fresh lime juiceKosher saltCilantro leaves with tender stems (for serving)PreparationStep 1Heat 3 Tbsp. oil in a large pot over medium-high. Add chorizo and cook, breaking up into smaller pieces with a wooden spoon and stirring every minute or so, until browned and crisp, about 5 minutes. Sprinkle in paprika and stir to combine, then scrape chorizo and oil into a small bowl. Wipe out pot.Step 2Pour remaining 2 Tbsp. oil into same pot and set over medium heat. Add onion and garlic and cook, stirring often and adding a splash of water if starting to brown, until softened but not browned, 10–12 minutes. Add clams and toss to combine. Cover pot and cook until clams open, 5–7 minutes. Uncover and transfer opened clams to a medium bowl, leaving liquid behind. If any clams are still closed, cover pot again and cook remaining clams until opened, about 4 minutes more. Transfer open clams to bowl; discard any that have not opened at this point. Tent bowl with foil.Step 3Pour 3 cups water into pot and bring to a simmer. Add corn kernels and cook until tender, about 3 minutes. Remove pot from heat and purée one third of chowder in a blender until very smooth. Return purée to pot and mix well. (Or use an immersion blender if you have one and blend directly in the pot until you’ve blended about one third and chowder is partly thickened.) Stir in lime juice; taste and season with salt if needed.Step 4Divide chowder among shallow bowls and add clams. Spoon chorizo and oil over and scatter some cilantro on top.How would you rate Creamy Corn and Clam Chowder With Crispy Chorizo?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis was incredible! The flavors all complemented each other so well. I crumbled some queso fresco on top and it took it to the next level. I plan on adding some diced potatoes next time to make it a little more hearty.AnonymousPortland, OR9/4/2021This was wonderful. It had great depth of flavor and came together quickly. Next time I will probably shuck the clams before serving for ease of eating and just toss a couple back in to each soup plate for eye appeal. The chorizo and cilantro played off the creaminess of the dish well. Excellent!DFinVTBarre, Vt9/1/2021We just loved this recipe! It didn't take long to make, and the flavors were complex and beyond delicious. I tested it out on my family, and I plan to make it this weekend for guests. I added shrimp to the soup, four per person. As a main dish, this served three people along with a salad and bread.Caryn Albuquerque, NM8/31/2021This was delicious.  I actually used a little more chorizo and just mixed it in.  Also—I boiled my corn, then removed from cob, and then used that water when it came time to add 3 cups.  MattOmaha, NE8/23/2021Explore Bon AppétitChowderSoupSoups and StewsChorizoSausageMeatClamShellfishSeafoodCornVegetableSummerEasyWeeknight MealsOne-Pot MealsMainDairy-FreeGluten-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Andy Baraghani"]}