{"id": "e15c17986d4bcaff727fc07c4bb4f34e", "url": "https://www.bonappetit.com/recipe/gluten-free-apple-and-oat-muffins", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Gluten-Free Muffins Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGluten-Free Apple and Oat MuffinsBy Anna StockwellOctober 22, 20184.5(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintInspired by bircher muesli, these protein-packed muffins get extra texture and flavor from almonds, grated raw apples, and oats folded into the gluten- and dairy-free batter. Spiced with just enough cinnamon and sweetened with maple syrup, they’re the breakfast treat of the season.IngredientsMakes 124large eggs½tsp. finely grated lemon zest1Tbsp. fresh lemon juice⅔cup plus 1 Tbsp. pure maple syrup⅔cup plus 1 Tbsp. virgin coconut oil, melted1½cups (145 g) gluten-free oat flour1cup (98 g) almond flour or meal1Tbsp. (7 g) flaxseed meal2tsp. baking powder1tsp. ground cinnamon1tsp. kosher salt1large Pink Lady apple (about 8 oz.), grated¾cup (98 g) skin-on sliced almonds, divided¾cup (80 g) gluten-free old-fashioned oats, dividedPreparationStep 1Preheat oven to 350°. Line a standard 12-cup muffin pan with paper liners. Whisk eggs, lemon zest, lemon juice, ⅔ cup maple syrup, and ⅔ cup oil in a large bowl. Whisk oat flour, almond flour, flaxseed meal, baking powder, cinnamon, and salt in a medium bowl until no clumps remain. Gently add to egg mixture and whisk to combine. Mix in apple, ½ cup almonds, and ¼ cup oats. Divide batter among prepared muffin cups, filling each to the very top.Step 2Mix remaining ¼ cup almonds, ½ cup oats, 1 Tbsp. maple syrup, and 1 Tbsp. oil in a small bowl to combine. Sprinkle oat topping over each muffin.Step 3Bake muffins, rotating pan halfway through, until tops are golden brown and a tester inserted into the centers comes out clean, 25–30 minutes.How would you rate Gluten-Free Apple and Oat Muffins?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThese muffins are so, so good, what a fantastic recipe. I never would have paired lemon zest with apples but it really brings out their flavor and adds a uniqueness that is so yummy!ErinMNY2/20/2022Great, healthier muffins. We replaced the coconut oil with butter due to an allergy and the maple syrup (ran out at home) with honey. Added a bit allspice based on someone else's suggestion. Very dense, rich compared to regular muffins, you have to be OK with it.  MBLiberty Lake, WA9/18/2021Great muffins . Be good if you gave the calories .P.C.Rotorua NZ7/26/2021I was really excited to try a gluten-free muffin with so many positive reviews. Unfortunately I found them way too sweet and the coconut oil too rich. It was a good idea and possibly with some alterations I would like it better but I am not sure it is worth the effort. Anonymous1/12/2021I really enjoyed baking this recipe! I had whole wheat flour to use, so I used that instead of oat. I added in a handful of sliced strawberries and rhubarb I had to use up as well as the apples. Tasty recipe! I also didn't have almonds so I used walnuts. \nSo in other words, I didn't follow the recipe perfectly, but I liked the result and would make them again! Thanks Bon Appetit. Only reason I gave 4 out of 5 that I don't typically have all these items in my pantry at one time. AnonymousVancouver4/23/2020Delicious! I altered the recipe a bit because I had overripe bananas to use. Substituted 3 small bananas for the oil, added a pinch of allspice, and substituted 1 cup of all purpose flour for oat. Really love the fluffy texture and rise of the muffins.AnonymousWashington, DC3/30/20205 Stars cannot justify the rating deserved by these flawlessly delicious muffins! Thank you for allowing me to add a little sunshine to my wife's day!AnonymousArizona8/8/2019This was fantastic, and highly versatile. I added in a ripe banana that needed to be used up. I also halved the maple syrup (really didn't need that much) and added a generous dash of allspice (I prefer it to cinnamon). Cooked for the full 30 mins and could've gone a little longer just to brown the bottoms fully. I used slivered almonds instead of sliced, and I loved the texture they added. Made my own oat and almond flours by pulsing in the food processor, so this was all done with pantry staples.Anonymous12/14/2018These are delicious! My only feedback is that the recipe and article mention cinnamon, but cinnamon is not actually listed as an ingredient. I added both cinnamon and brown sugar in the oat topping to make them more savory, and I used a full 8oz of grated apple. Will make againAnonymousDallas, TX10/29/2018Explore Bon AppétitMuffinPastriesAppleFruitOatRice & GrainsAlmond FlourFlourAlmondNutFlaxseed MealSnackDairy-FreeGluten-FreeVegetarianHealthyishBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-22", "author": ["Condé Nast", "Anna Stockwell"]}