{"id": "e164e5eafb963a67bb49a0bdda4fd32e", "url": "https://www.bonappetit.com/recipe/vegan-creamed-spinach", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Tofu Creamed Spinach Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegan Creamed SpinachBy Andy BaraghaniNovember 8, 20183.9(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintA Healthyish take on classic creamed spinach: Puréed silken tofu lends such a smooth, velvety consistency, your guests just might be fooled.Ingredients4 servings114-oz. package silken tofu, drained¼cup grapeseed, vegetable, or other neutral oil8scallions, thinly sliced13\" piece ginger, peeled, finely grated1chile (such as serrano or Fresno), thinly sliced5garlic cloves, thinly sliced4bunches mature spinach (about 2 lb.), trimmed, torn into large piecesKosher saltPreparationStep 1Purée tofu in a blender until smooth and the consistency of heavy cream. Transfer to a small bowl.Step 2Heat oil in a large nonstick skillet over medium. Cook scallions, stirring occasionally, until softened, about 3 minutes. Add ginger, chile, and garlic and cook, stirring occasionally, until garlic is softened and mixture is fragrant, about 2 minutes. Working in batches, add handfuls of spinach, letting it wilt slightly before adding more and stirring occasionally, until all the spinach is in the pan. Cover and cook until spinach is wilted and bright green, about 3 minutes. Uncover and reduce heat to medium-low. Stir in tofu mixture and cook until warmed through, about 2 minutes. Taste and season with salt.How would you rate Vegan Creamed Spinach ?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleFound this recipe to be good with about 1lb of spinach (for two people). Sarah Santa Monica2/28/2022I make this a few times a year for winter holiday meals - it's simple, scalable, delicious, and a crowd-pleaser (across dietary choices)! Because silken tofu is creamy, yet mild and light, the spinach shines, which I think is an improvement over dairy-based creamed dishes. The aromatics enhance the brightness of the dish, and it pairs nicely with heavier traditional holiday dishes by cutting through the richness. For those accustomed to a thicker cream, I found that a little cornstarch slurry stirred in at the end does the trick, and it still reheats beautifully. AlexAtlanta, Georgia11/2/2021Where is nutritional info? I cannot make anything with these numbers!AnonymousAlsip, IL10/23/2021Explore Bon AppétitSpinachLeafy GreensVegetableTofuOther IngredientsFallEasySideDairy-FreeVeganVegetarianGluten-FreeNut-FreeHealthyishSautéThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-08", "author": ["Condé Nast", "Andy Baraghani"]}