{"id": "e16627af42e04b415e400d9cd5317fa8", "url": "https://www.bonappetit.com/story/moon-juice-beauty", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Moon Juice Founder Amanda Chantal Bacon Has a New Beauty Line and, Fine, I'm Into It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMoon Juice Founder Amanda Chantal Bacon Has a New Beauty Line and, Fine, I'm Into ItConfession from a wellness skepticBy Deanna PaiJune 25, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI look at most things considered to be “alternative” with a raised eyebrow. Sure, I’m down with kombucha and attend weekly vinyasa yoga, but show me a crystal, and I’ll call it a rock. I do not believe in vibrations, and positive thinking does nothing for my road rage.Wellness has an especially firm foothold in the beauty industry, what with jade rollers and rose quartz-infused products, and, as a beauty writer, I’ve been feeling the fatigue. So when I learned that the mother of adaptogens Amanda Chantal Bacon had created a new skincare collection, Beauty Shroom, I sighed so loudly that my boyfriend thought I was mad at him. For the founder of chain juice shops in LA that sell powdered supplements called “Moon Dust,” a beauty line at Sephora seemed inevitable...and maybe a little opportunistic.But as someone who prides herself on knowing what's up in every corner of the beauty world, I was curious. In other words, I had to try it. The Exfoliating Acid Potion ($39) features a blend of acids (glycolic, lactic, salicylic) and reishi mushrooms. The watery formula felt nice on a humid day, and it felt gentle, a little too much so for me. (To be fair, I dunk my face in 15% glycolic acid every night, and I’ve grown to love the sting.)Moon Juice's vegan collagen protection and plumping jelly serum.\nPhoto by Chelsie CraigThe Plumping Jelly Serum ($58) is no misnomer. It has an herbal scent that’s an upgrade from the antioxidant serum I usually use, which smells like a fish ate Brie before dying in the bottle. I couldn’t tell if my face looked smoother—few things short of a needle will fix my baby laugh lines—but my skin did feel softer and more hydrated after a few days. The magic ingredients are the reishi and silver-eared mushrooms, which bring the purported stress-reducing, energy-boosting adaptogenic powder that made Moon Dust so famous. “They help with inflammation and stress in the skin on a cellular level,” explains Bacon.Rounding out the line is Vegan Collagen Protection ($58), an ingestible powder. The supplement contains trenella mushrooms and a type of vitamin E that helps preserve collagen—and doubles as a great milk substitute, according to Bacon. She’s right: While my boyfriend said it looked like baby formula, it tasted like watered-down nut milk. I followed the instructions, mixing two tablespoons of the powder with six ounces of water (although you could swap in matcha tea, a green smoothie, or coffee, depending on your level of enlightenment).Its benefits are mostly preventative so, understandably, my skin didn’t take on a preternatural glow. (I’ll revisit that after a year or two.) I actually enjoyed it, and could easily pair it with cereal in the morning. But one thing bugged me. Not only does the jar last just a month with that serving size—a pricy milk substitute for sure—but also: What was it doing that Beauty Dust wasn’t?“At the heart of the Beauty Dust is adaptogens,” Bacon explains. “The Vegan Collagen helps specifically with boosting your body’s own collagen production, reducing fine lines, and keeping the elasticity in your skin.” (Translation: If your skin is trashed from pulling all-nighters at the office, go for stress-reducing Beauty Dust. If it’s just gravity doing its thing, take the Vegan Collagen. If you’re not sure but got a tax refund, you can take both, as Bacon does.)Still, I wanted to know why Bacon had branched out into topical beauty products before I finished calibrating my BS meter. I mean, she once said in an interview that she didn’t use sunscreen. (“I wish that I had now, I do,” she says.) She’s also known for her bare-bones beauty routine, and admitted to me that it’s typically bar soap, a healthy diet, and the occasional oil.If Bacon had told me her reason for creating the collection was that she’d discovered some magic cure-all ingredient, or because Moon Juice fans kept asking for it, she would have confirmed my doubts. Because while wellness is supposedly above the mainstream fray, it’s still the wellness industry—there’s got to be some sort of financial incentive for it, right? Even the holiest of meditation apps, Headspace, charges a monthly fee to share enlightenment. Ashwagandha doesn't come for free—unless you're growing it in your backyard.But Bacon has the most relatable—and plausible—reason for her new venture: “I hit my mid-30s and began to notice some changes in my skin.” So she began using Biologique Recherche’s P50 Lotion, the cult-favorite chemical exfoliant known for its acrid smell, harsh active ingredients, and insanely good results—and loved it. “Once I saw the effects and it worked that well, I thought, I can’t not use this now,” she said.But she couldn’t get on board with the not-so-natural formulation. So she set about developing a Moon Juice-y version—and thus the Exfoliating Acid Potion was born. The Vegan Collagen powder had already been in the works, but then Bacon learned that its ingredients could also be absorbed transdermally. That resulted the Plumping Jelly Serum, which I will definitely continue to use.Bacon is now working on two additions to her skincare line, and hopes to one day create a sunscreen. (“I haven’t found a facial sunscreen that I want to wear on my face every day,” she explains.) As suspicious as I am, so far Beauty Shroom checks out—and that’s a feat when it comes to wellness. Or maybe I’m just drinking the moon juice.Explore Bon AppétitHealthyishTrendsRead MoreLifestyleAmanda Chantal Bacon's Wedding Cake Was Laced with Sex Dust ObviouslyBy Christine MuhlkeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-18", "author": ["Condé Nast", "Deanna Pai"]}