{"id": "e18301302775c25376431534d5cd42af", "url": "https://www.bonappetit.com/story/aerogarden-sprout", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Thanks to My AeroGarden Sprout, I’ll Never Need to Buy Herbs Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThanks to My AeroGarden, I’ll Never Need to Buy Herbs AgainIt’s compact, dead simple to use, and keeps me in fresh greens all through winter.By Alana Al-HatlaniNovember 26, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now. Next up, contributor Alana Al-Hatlani writes about her love for her AeroGarden.I am not a plant person. I kill everything, even the plants that “thrive on neglect.” But as an aspirational green thumb, I’m always trying desperately to grow food within the confines of my one-bedroom apartment. I want to be able to produce my own fresh ingredients, even if I don’t have the traditional garden space to do so. My mother, an illustrious gardener, gifted me the solution last Christmas: the AeroGarden, an indoor gardening system small enough to sit on your kitchen counter.Photography by Isa Zapata.  Prop Styling by Paige HicksAeroGarden Sprout$100 $70 at AeroGarden$100 $70 at AmazonI have the smallest model, the AeroGarden Sprout, which uses biodegradable seed pods—they look like elongated Keurig cups but are packed full with peat instead of coffee—to hydroponically grow up to three plants at once. I began my AeroGarden journey with the heirloom salad kit, which included three lettuce varieties: Black Seeded Simpson, Deer Tongue, and Parris Island—all lettuces I would be hard-pressed to find at my local grocer. Each variety sprouted in a few days and was ready to harvest in just over three weeks. I plucked enough fresh lettuce for a side salad with dinner each night and ditched those boxed salad mixes, half of which always wilted before I could get around to eating them.Next, I grew herbs and had fresh basil and dill at my disposal for months. I stopped buying those clamshells from the grocery store, which are both relatively expensive and packaged in single-use plastic. During much of the pandemic, when I was trying to limit grocery trips but also had to contend with shortages, having fresh lettuce and herbs at home was especially convenient. Now I’m experimenting with hot peppers and more salad greens in Aerogarden’s Grow Anything pods, which allow you to seed any plant of your choosing.I love that the AeroGarden requires only water and the liquid plant food supplied with it to start growing. There’s no soil, so no mess, and a light on the device automatically lets you know when it needs more water or food. (If only regular plants could communicate this way.) While small enough to sit on a window sill, the device doesn’t require natural light, which means it can live anywhere as long as it can reach an outlet. The LED grow lights operate on a timed cycle but are quite bright, so I program them to be on during the day to avoid light beaming like a UFO into my bedroom at night. With how easy the AeroGarden Sprout is to operate, I like to think of it as my Tamagotchi—except way harder to kill.Explore Bon AppétitHighly RecommendShoppingCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-26", "author": ["Condé Nast", "Alana Al-Hatlani"]}