{"id": "e19ac53b5114f842daacd39ff9aa63b7", "url": "https://www.bonappetit.com/city-guides/montreal/venue/patisserie-au-kouign-amann", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Patisserie Au Kouign-Amann Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealPatisserie Au Kouign-AmannA carby, sugary haven in the PlateauFacebookPinterestTwitterEmailLuisa Gonzalez P.GO HERE: for excellent croissants, pain au chocolat, quiche, and most importantly, Patisserie Au Kouign-Amann’s namesake pastry. Buttery, sugary, flaky, and tender doesn’t even begin to describe this magical Breton invention.ORDER: everything above, plus the large-format kouign-amann. Sure, you’ve probably seen the pastry in small individual-size wheels, but we can’t get enough of these super-size ones that are baked and sliced into wedges. It may just be the best $2 CAD you’ll ever spend.THE VIBE IS: tiny and unassuming, until you walk into the storefront. It smells like heaven. Before you grab one of the few tables, admire all the shiny golden-brown kouign-amann in the pastry case.PRACTICAL STUFF: Open every day: Monday to Friday 7 a.m. to 7 p.m., and Saturday and Sunday 7 a.m. to 6 p.m.—Molly BazLuisa Gonzalez P.Luisa Gonzalez P.WE ALSO LOVESt-Viateur Bagel ShopSettle the great bagel debate by getting a dozen at the famed Mile End mini chainCafé OlimpicoGet your caffeine fix at this Mile End espresso shopDrogheria FineRun, don’t walk to this Mile End window shop doling out perfectly tender gnocchiExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Molly Baz"]}