{"id": "e1a93e7d9dc7f080cc2ed781aaf7a90a", "url": "https://www.bonappetit.com/story/rent-week-diner-omelet", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "This Rent Week Diner-Style Omelet Will Save You a Trip...Outside | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingNot to Brag BUT This Rent Week Omelet Rivals Any Diner'sDiners are great—but this diner omelet is better.By Alex DelanySeptember 6, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailHere’s my diner order: Turkey club. Extra mayo. Side of coleslaw. Onion rings. Diet Coke.You will hear those exact words leave my mouth if I you find me in literally any diner any time after 11:00 a.m. and maybe—if the circumstances are just right—in the hours prior. It’s what I always order at a diner. You know what I never order at a diner? An omelet. You will not catch me in a diner eating a diner-style omelet. That’s a promise. Why? Because I can make a better one at home.This isn’t an attack on diner cooks or diner-style omelets—you know, the large, slightly browned, American counterpoint to the precise, delicate French omelet. It’s just a display of the confidence I have in my ability to make a superior diner-style omelet at home. It’s kind of a brag...but not entirely. Because making a diner omelet at home is actually quite easy. What I’m trying to say is that you could be bragging about your diner-style-omelet-making skills too. Really, it’s doable.And it’s also perfect for Rent Week, especially when you add some low-budget cheese and herby mushrooms into the mix. So get back into the kitchen after your 15-minute cigarette break. Strap your stained diner apron on. Grab your spatula. Smash the play button on this Blanket Statement playlist I made for you (it, too, is good in just about any scenario—and it's absolutely free of charge). And get ready to shout Order up! through a small window over the griddle. We’re making diner omelets.Feeds four! Or two! Or just one. You decide.\nPhoto by Chelsie Craig, Food Styling by Pearl JonesYou know what diner omelets never come with? Pickles. You know what diner omelets need? Also, pickles. So that’s where we’ll start:Thinly slice 1 red chile and 1 green chile (such as Fresno, Anaheim, jalapeño, or something similar). The thinner the slice, the more manageably spicy your pickles.Pour 1 cup of rice vinegar    into a small bowl. Add 1 Tbsp.  sugar and 1 Tbsp. kosher salt and whisk to dissolve the sugar.Place the sliced chiles in your brine (yeah, that’s a brine!), then set them aside while we make an omelet.Next up is our filling. We’re going to keep it simple, affordable, and deeply flavorful with some garlicky crimini mushrooms:Peel and roughly chop 3 cloves of garlic. Roughly chop 1½ cups of mixed parsley and chives (I usually go with 1 cup parsley, 1/2 cup chives, but a 50:50 ratio is also fine). De-stem __1 10-12 oz. pack of crimini or baby bella mushrooms__ and quarter the caps.Melt 2 Tbsp. of butter in a non-stick skillet over medium heat. Add the quartered mushrooms and the garlic, stirring to coat in butter. Let them cook undisturbed for 4 minutes (that'll give you a good sear), before giving them a stir and letting them cook for another 4 minutes. You're looking for mushrooms that are deeply browned and shrunken (meaning: they've lost some of their water).Remove the mushrooms from the skillet and toss with the chopped herbs, a few cranks of black pepper, a couple pinches of kosher salt, and couple squeezes of lemon juice.Time for eggs:Wipe the same non-stick skillet clean, and use a box grater to shred 4 oz. of Monterey Jack cheese.Crack 6 large eggs into a large bowl and whisk until very smooth and a little frothy (this should take about a minute—longer than you think, but we're aerating them, which will make the omelette nice and fluffy).Season your eggs with a couple pinches of kosher salt . I like to season eggs before I cook them to ensure every bite is properly seasoned. Then add about three-quarters of the cheese to the eggs.Next, melt 1 Tbsp. butter in your non-stick and cook eggs in over medium heat. The key to a stellar diner omelet that’s brown on the outside and fluffy and moist on the inside is to stir constantly when you first add the eggs to the pan, scraping the cooked egg from the bottom of the skillet. Once larger curds start to form and fold over each other, tilt your skillet in a circle, so the uncooked egg in the middle spreads evenly to the edges of the pan.And now, the fold 'n flip:When the eggs are cooked about 80% of the way—about 5-6 minutes after you've added them—spoon your mushrooms slightly to one side of the omelet (you don't have to use all of them—you can save some for the top or for leftovers), then sprinkle the remaining 1 oz. of cheese over top.Continue to cook until the bottom of the omelet takes on a light golden-brown color (use a spatula to check!), but the surface remains slightly wet-looking. Fold one side of the omelet over the filling (like—in the words of food director Carla Lalli Music—a taco) and—finally, gloriously!—slide the omelet onto a cutting board or large plate.That slide might seem a little scary, but if your omelet is properly browned, there shouldn't be any resistance against the non-stick pan. Don’t hesitate. Just do it.When you do, you’ll be looking at a cheesy, umami-rich diner omelet that, to be quite honest is better than the Denver omelet at your local. Slice it in half (or just take down the whole thing solo), top it with the pickled chiles, and get to work, knowing your in-diner diner omelet days are behind you.But again, if you’re in the mood for a turkey club, some onion rings, a side of coleslaw, and a tall fountain soda, well, you know where to go.In the mood for noodles instead? We have those too.These Cold, Pesto-y Rice Noodles Are Incredibly ChillHot noodles? During Rent Week? In this heat? Hell no.View StoryExplore Bon AppétitRent WeekOmeletRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-06", "author": ["Condé Nast", "Alex Delany"]}