{"id": "e1b23a95de3b6be8d31f94a6ba243c32", "url": "https://www.bonappetit.com/story/what-is-adobo", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "What Is Adobo, and What's the Difference Between Mexican, Filipino, and Puerto Rican Adobo? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPeople All Over the World Love Adobo—But What Is It?That answer depends on where you are (Puerto Rico? Mexico? The Philippines? Your kitchen table?) and who you talk to.By Bettina MakalintalOctober 19, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by D'mytrek BrownFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.All over the world, people love adobo. In Puerto Rico, Mexico, and the Philippines, adobo is essential and multipurpose. But what is adobo, exactly? The answer depends on where you are and who you’re talking to.Derived from the Spanish word adobar, or “to marinate,” adobo unites the many places that once fell under the Spanish Empire. But adobo is also an example of how separate cultures persisted and evolved despite the Spanish influence. The word adobo speaks to a shared history of Spanish occupation, but taste adobo from Mexico beside adobo from the Philippines and you’ll instantly witness how traditions diverged.What is Spanish adobo?We can start with Spain, where adobar, the verb, becomes adobo, the noun, meaning dressing or marinade. (Etymology suggests the word has even older roots: The Spanish adobar came from the Old French adober, which referred to dressing a knight in armor but came to apply to food as well.)These vinegar-and-olive oil marinades are usually flavored with pimentón, oregano, salt, garlic, and black pepper. They came about in the centuries before refrigeration, as they helped preserve proteins—a particularly useful practice in humid coastal areas where meat spoiled quickly. The port city of Cádiz, for example, is known for cazon en adobo, in which dense chunks of dogfish get a long marinade in vinegar and spices.What is Mexican adobo?After conquistador Hernán Cortés led the expedition that overthrew the Aztec Empire in 1521, Spain controlled Mexico for 300 years. As the Spanish Empire took over the world, it imposed Spanish culture upon its new colonies. In Mexico, the Old World technique of adobo met New World ingredients, namely the chile peppers native to Central and South America.In Mexico, adobo sauce starts with dried chiles like guajillo and ancho peppers. The chiles are rehydrated and combined into a thick paste with an acid like vinegar or citrus juice and flavorful additions like onions, garlic, cumin, and oregano. Mexican adobo, like Spanish adobo, is often used as a marinade for meat and seafood. A protein marinated in adobo is referred to as adobada—you’ve likely seen the pork version on the menu at taco shops. Adobo can be thinned out with broth to make a sauce, turned into the base of a stew, or used as a condiment.Mexican adobo can also be found in the form of canned chipotle peppers in adobo sauce from brands like La Costeña. The peppers and sauce add instant smoky flavor and heat to anything you add them to without the whole process of making adobo from scratch.What is Puerto Rican adobo?The colonization of Puerto Rico began in the early 1500s, bringing many of the same Spanish influences to the island. As is the case in Mexico, adobo in Puerto Rico most traditionally refers to a wet marinade consisting of garlic, some kind of acid (vinegar or citrus), oregano, salt, pepper, and olive oil.The ratio of ingredients depends on what meat is in play, says Von Diaz, a journalist, professor, and author of the cookbook Coconuts & Collards. A dense protein destined for slow-cooking, like pork shoulder, can handle an adobo with more garlic and stronger acid like vinegar or naranja agria (bitter orange), Diaz explains, whereas a delicate fish requires a sauce with less garlic, less salt, and citrus instead of vinegar.Not only does adobo preserve, but it also helps infuse flavor into the tougher cuts of meat once common on the historically under-resourced island. Just as some cooks might think of salt and pepper as nonnegotiables, “I would argue that for most Puerto Ricans, we would never prepare any kind of protein without applying some kind of adobo,” she says.There’s another kind of adobo for which many people in the Puerto Rican diaspora have affection: the dry seasoning that comes in a plastic shaker, launched by Goya in 1966. This blend of salt, granulated garlic, oregano, black pepper, and turmeric can be added to anything, from sauces and stews to popcorn. “It's just a super tasty flavor punch,” says Diaz, who didn’t grow up with it herself since her family prefers to season without premade blends. But, she points out, the components of the wet spice paste and the dry stuff are similar—basically, different ways to get to a similar goal.Goya now sells multiple adobo blends, including one with saffron and another with cumin, and the options for this kind of adobo have grown as smaller producers like Loisa and Seattle chef Eric Rivera sling shakers of their own. You can even make it yourself.Photo by Isa ZapataLoisa’s Sazón and Adobo$19 at Loisa (Combo-Pack)$11 at Amazon (Adobo)$11 at Amazon (Sazón)What is Filipino adobo?In the Philippines, which was claimed by the Spanish in 1521, adobo is most often a braise featuring vinegar, soy sauce, garlic, bay leaves, and black peppercorns—the ratio of which is dictated by both your family’s palate and your own. While I might like my chicken adobo saucy and more savory than sour, my cousin might want theirs slightly sweet and reduced into a sticky glaze; another cousin might go for pork, not chicken, because anything can become adobo, even squid, eggplant, or mushrooms.Considered by many to be the national dish of the Philippines, adobo reflects the regionality of the archipelago’s 7,640 islands. In some regions, coconut milk is added for adobo sa gata, and not all adobos even contain soy sauce. It might be replaced with fish sauce and annatto to make adobong pula (red adobo), with turmeric to make adobong dilaw (yellow adobo), or skipped entirely for adobong puti (white adobo).Given the way colonialism goes, the long-standing story has been that Filipino adobo came from the Spanish and Mexican dishes. But food historian Raymond Sokolov has posed another hypothesis: Because the ingredients for adobo, like the country’s many vinegars, were already present in the Philippines by the time Magellan showed up in the 16th century, Sokolov argues that what the Spanish, after seeing similarities to their own marinade in the native braise, contributed the name. White adobo, in fact, was identified as an Indigenous practice in 1613 by the Franciscan missionary Pedro de San Buenaventura, who called it “adobo de los naturales.” While history may be disputed, one thing is for certain: Everyone loves adobo.If you can dream it, you can adobo it:Adobo Mushroom TacosMeaty mushrooms get spiced to perfection and roasted until crisp before they're tucked into warm corn tortillas.View RecipeExplore Bon AppétitcookingShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Bettina Makalintal"]}