{"id": "e1c2554fe0cc0c7946e291af018b131b", "url": "https://www.bonappetit.com/recipe/miso-chocolate-chip-cookies", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Miso Chocolate Chip Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueMiso Chocolate Chip CookiesBy Marcus Samuelsson and Tiana GeeDecember 1, 20204.4(47)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura MurrayEmailPinterestPrintEmailPinterestPrintA salty-sweet chocolate chip cookie from chefs Marcus Samuelsson and Tiana Gee, which was originally on the menu at Samuelsson’s Harlem spot Ginny’s Supper Club.IngredientsMakes 362¾cups (344 g) all-purpose flour1tsp. baking soda1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1cup unsalted butter (2 sticks), room temperature1cup (packed; 200 g) light brown sugar¾cup (150 g) granulated sugar¼cup white miso2large eggs2tsp. vanilla extract2cups bittersweet chocolate chipsPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 375°. Whisk flour, baking soda, and salt in a medium bowl. Using an electric mixer on medium-high speed, beat butter, brown sugar, granulated sugar, and miso in a large bowl, scraping down sides of bowl as needed, until light and fluffy, about 3 minutes. Add eggs one at a time, beating well after each addition and adding vanilla with the final egg. Using a wooden spoon, stir in dry ingredients, then stir in chocolate chips. Chill dough until firm, about 1 hour.Step 2Using a 1-oz. scoop (2 Tbsp.), portion dough into balls and divide between 2 large parchment-lined baking sheets, spacing at least 2\" apart. (You will have dough leftover.)Step 3Bake cookies, rotating top to bottom and front to back, until golden brown and crisp around edges, 12–15 minutes. Transfer cookies to wire racks and let cool. Let baking sheets cool completely, then repeat process with remaining dough.Do ahead: Cookies can be baked 3 days ahead. Store airtight at room temperature.How would you rate Miso Chocolate Chip Cookies?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleI think the ratios must be off for these. Or maybe the baking temperature or time? I did 350F for 13minutes and the cookies turned out cakey in the middle and crunchy on the outside. The miso flavour is very very minimal but there is a slight saltiness to them from the miso. I’ll probably try them again with a little less flour and baking soda and a lower oven temp. FrancescaDublin, Ireland3/24/2022My question exactly : why are we told to pre-heat the oven at the start of the recipe, and then told to put the dough in the fridge for an hour? Why do far too many recipes tell us to pre-heat the oven, rather than using the smarter, more energy-conserving directive of \"place baking sheet into pre-heated 375 degree oven?\"Zan SaalfieldHarvard MA11/20/2021The cookies tasted very good, but I couldn't taste the miso at all. I also followed what the other comments said and baked for 12-13 min at 350 instead of 375. They came out very soft, so I left the cookies on the baking tray for 5 min to cook a little longer in the residual heat, and then moved them off the tray.Anonymous10/21/2021why did i just preheat my oven in order to chill my dough for an hour... hungry for cookies Brooklyn, NY, United States7/30/2021The cookies burned every time at 375, which affected the flavor, and resulted in a drier cookie. 350 degrees for the same time as in the recipe resulted in perfectly browned but not burnt cookies. With all that said, the miso is subtle. It's a good cookie, but not as good as BA's Browned Butter cookies, so why not just make those?AlexLos Angeles4/5/2021We made these cookies today. They have been a curiosity to me since I saw the recipe around Christmas time.  The cookie dough was delicious and I definitely ate enough dough to satisfy my sweet tooth.  The finished product was interesting and very yummy.  They are not quite The Best chocolate chip cookie I have ever had but I saved some cookie dough in the frig and will make a batch tomorrow and compare.  I prefer a chewy CCC and next time will add a little tapioca flour to the dry ingredients. Over-all, it was an interesting recipe to add to my collection of cookie recipes.Lisa A.San Diego1/24/2021Delicious! Tastes SO good. Wish the recipe was consistently in grams though. AnonymousLondon, UK1/22/2021My friend made the old miso chocolate chunk cookie recipe a few years ago and they were SO GOOD. Where can we find the old recipe? These look very different, hers were flat and crispy and chewy. We even found a picture of them on Pinterest but the link takes us to this recipe. It just can't be right! Please advise. ChristyHartford, CT1/15/2021Tasty variation on a classic! Love that the miso cuts the sweetness a bit. I baked at 350 for 12-13 minutes due to the other very helpful reviews and I was happy with that decision. The bottoms were nicely browned, with a bit of crisp, chewy texture and a soft inside. Perfect!DJKentucky1/8/2021Excellent cookies! I am gluten free and used Cup4Cup in place of flour. They came out perfectly. You do need to be on top of rotating the trays. A week later, these cookies are still moist and soft. (I have had to ration them, they are that good.)AnonymousPortland ME1/1/2021 Made this recipe today and the only thing that I did different was I used finishing salt on top of the ball just before baking.  Turned out great.AliPNW12/27/2020Flavor of dough is good but like others have said my cookies burnt on the bottom and are cake like otherwise. Will continue to experiment w/ temp & timing. Han Boone, NC12/24/2020Delicious cookies and cookie dough. The miso definitely brings out the umami flavor. I couldn't stop eating the leftover dough before baking. They bake/brown super fast so I pulled them out around 10:30-11 min mark. I made half the recipe and it made about 16 cookies.SSan Francisco, CA12/23/2020There are few things I love more than a good chocolate chip cookie and this is a good one. Crispy on the edges, soft in the middle, and the miso balances out the sweetness by adding a salty/rich element. Other reviews mentioned issues with burning, but I didn’t have any trouble. I followed the baking instructions, including using the parchment paper and adjusting the cookie sheets mid-bake. My bake time was about 14 minutes. ColleenChicago, IL12/21/2020The flavor of these cookies is great! The dough is probably the best I've ever eaten. I second the other reviewer about the cook time/burning. The first tray burned at 12 minutes. They still burned when we only cooked them for 10 and 8 minutes even. Very odd, but still very tasty even through the toasty crust. Almost cake-y inside. Will likely make again, if only to eat all the dough. ChelseaBerkeley, CA12/20/2020Explore Bon AppétitCookieDessertChocolateOther IngredientsMisoCondiments, Sauces & PastesNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson", "Tiana Gee"]}