{"id": "e1cbf049e76184b9dcd2d38097be7ced", "url": "https://www.bonappetit.com/story/the-food-waste-problem", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "To Stop Food Waste, We Need to Confront Our Food Anxiety | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleTo Stop Food Waste, We Need to Confront Our Food AnxietyFinding solutions starts with understanding the problem.By Patrick SymmesMay 18, 2021FacebookTwitterEmailIllustration by William LuzFacebookTwitterEmailHumans throw away about 1.3 billion tons of food a year, or—at the very least—one third of all food in the world. If you loaded that refuse into trucks, they’d wrap bumper-to-bumper around the world seven times. All that waste is detrimental to our planet. In terms of carbon emissions, we toss tomatoes, let the bread go stale, age out our cilantro, and ignore our mustards until we are doing as much damage as every single car and truck on the planet. If food waste were a country, it would be the third-biggest emitter worldwide.It is more than simply scraps in your fridge going unused that contributes to the problem. It is the whole series of systems, from wasteful habits in the kitchen—Britain generates 3,885 tons of CO2 every day from boiling too much water for tea—to harmful practices on our farms. It is true in our own households but also in corporate cafeterias and stadiums, at weddings and conferences. The problem is so large it’s easy to feel powerless. But the truth is, there are people, companies, municipalities, even app developers working to get it right. To understand their solutions, you first have to grasp the problem.In the U.S. the biggest source of food waste is food abundance paired with food anxiety. Amid some of the cheapest food in history, many of us over shop, fill the pantry and fridge, and let it rot, to the tune of about $1,600 per person a year, driven as we are by a deeply rooted, maybe even primordial fear that we never have enough food. From this fear of “nothing to eat” springs our love of the big-box store, 12-packs of strawberry yogurt, and three-pound boxes of crackers, plus the dopamine rush of seeing multiple shopping bags in our kitchens.Endpoint consumers—home cooks and restaurant lovers—are directly responsible for just 1 percent of the total impact of food waste, with 80% of all emissions from food waste occurring on farms. But it’s more layered than that. An onion plowed back into a field (often because it is too small, blemished, or oblong to meet our exacting standards) is not the same as an onion that goes unused in your house. The latter has accumulated a long trail of other wastes—the time and effort of harvesting, the burdens of sorting and transporting, the energy needed for cold storage and display, the money, gasoline, and electricity that bring it to your counter. Letting that onion go soft, and then tossing it, is squandering more than an onion. And it follows that preventing that one piece of end waste makes for a less wasteful marketplace: grocers stock less, thereby cutting their storage bills; truckers deliver less, reducing petrol consumption; and farmers plant, water, fertilize, harvest, and process a more suitable amount. “Right sizing” our food systems will leave more for the 700 million people worldwide last year who had too little.“Reducing food waste at the household level creates a chain reaction,” says Kate Astashkina, a professor at the University of Michigan’s Ross business school who does systems analysis on food waste. “It reduces emissions not just at the downstream tier, it also reduces emissions at every level in the supply chain, all the way back up to the farm.”There is also massive waste on the industrial scale, when others do the cooking for us. America is filled with food carts and white tablecloth restaurants, fast-food chains and event caterers, hospitals, schools, corporate cafeterias, and wedding event spaces where abundant, even absurd amounts of food are prepared daily. Pre-pandemic we were spending almost $800 billion a year on commercially prepared food of all types. Commercial and institutional kitchens generate 30 to 40 billion pounds of food waste a year, most of it sent to landfills. There it produces large amounts of methane, a global-warming chemical 25 times as potent as carbon dioxide, compounding the environmental damage.8.2 Percent of worldwide greenhouse gas emissions come from food waste.So what are we going to do about it? This broken system has come into focus over the last decade, and in 2015 the United Nations issued a goal of eliminating 50% of global food waste by 2030. But the 2020 pandemic, and the unfamiliar sight of barren shelves, forced many Americans to rethink the connections in our food system now, not 10 years from now. What was charming, twee, ecological, or just a good idea pre-pandemic—vegetable gardens, baking your own bread, regrowing scallions on the windowsill—suddenly became essential. More people took more steps to reduce food waste, not with the UN’s goals in mind, but with the supply chain on the brain and a desire to make the most out of every grocery run. The threat of shortages has connected our meals back to their social and economic roots better than abundance ever could.According to Emily Broad Leib, faculty director of Harvard’s Food Law and Policy Clinic, these new habits create an opportunity: “People are being more thoughtful about their food now, looking at food as a crucible for a bunch of different concerns: local and regional food, farm to school, discrimination in those systems. And once you start looking at food, you come to an understanding of how much is going to waste.”At the consumer level there are small-scale changes each of us can make that ripple up the food chain, from throwing kale stems into smoothies to putting leftovers and other need-to-be-eaten foods front and center in the fridge so we don’t forget about them. (You’ll also find many more suggestions on these pages.) On YouTube, you’ll find advocates for the zero waste movement offering tips on repurposing squash skin for cheese boats, and apple peels into fruit soup. Companies like Apeel, a start-up creating plant-derived skins for fruits and vegetables that increase their shelf life, offer us the chance to choose produce that won’t spoil quite as quickly.Another way to waste less at home: Shop more often. When we buy what we need for dinner that night, much of it gets cooked. When we buy what we anticipate needing for the week, more of it gets wasted; plans change, parsley wilts. Driving to the store more frequently has its environmental downsides, of course, but according to Astashkina, the Michigan expert on food waste, tossing a piece of food, with all the energy, water, transport, and refrigeration that went into creating it, is significantly more costly to the environment.One study demonstrates that meal kits, like Blue Apron, are another unexpectedly ecological option. Even factoring in the carbon footprint of all that plastic packaging, researchers have found surprisingly strong environmental upsides because they are carpooled to your door with other orders in your neighborhood. And critically, they offer exact portion sizes, so there are no remaining single celery stalks or quarter cans of tomato paste for you to forget about.And what about the waste that happens outside our homes, in restaurants, grocery stores, and corporate cafeterias? One solution is a bundle of apps focused on food redistribution. In London, the social media app Olio lets volunteers (“food waste heroes”) distribute expiring food from supermarkets to communities in need. The app Too Good to Go tracks end-of-day food sales everywhere from Copenhagen to New York, alerting users when the bakery down the block is selling that day’s goods at a steep discount. Discounts can change by the hour or pop up along your route as you head home, effectively gamifying food waste.For commercial kitchens, there are also new smart scales that track food waste and refrigerators that notice when the very first strawberry goes bad—warning you to use the rest, now.Of course there are nonprofits tackling the problem of large-scale waste from cafeterias, retailers, and industrial kitchens, like Urban Gleaners in Portland, Oregon, which collects surplus, often from grocers rotating new goods into place, and sends it to schools and communities experiencing food insecurity. Last year the Gleaners collected 1.2 million pounds of uneaten food. When I talked to Tracy Oseran, who founded the Gleaners 16 years ago, she told me her original motivation was a heartsick feeling as she left a restaurant and saw how much food was in the dumpster as others went hungry. But now she summed up her motivation to end food waste in two words: “Climate change.”Even with hundreds of foot soldiers in the fight against such waste, the systems of redistribution are so inefficient that there are many missed opportunities to send food from those who have too much to those who have too little. What if we could mechanize it? That, it turns out, is what Google is trying to do. It jumped into the fray with the Google Food for Good project, which aims to help food banks collect and distribute with peak efficiency. Right now there’s no good way for food producers or retailers to communicate with food banks; a grocery store might have excess bananas without the neighborhood food bank—or a group like the Gleaners—knowing it. The initiative has developed software to help facilitate communication and to better predict waste from institutional sources. This could turn the guessing game of how many donations a food bank will get from, say, a major sports venue with periodic oversupplies of food, into a science. Google has also deployed an artificial intelligence system in its own cafes that orders less of anything routinely wasted. Food for Good project leader Emily Ma predicts that within a few decades, machine learning could introduce so much efficiency into food markets that total food production could be matched to consumption almost exactly, a vision of near zero waste.Tech companies, Good Samaritans, apps, and appliance engineers are all chipping away at the problem. What about governments? Some states are turning to legislation, like Massachusetts, which has effectively run out of room in its landfills. As a result the state government sharply raised its fees for dumping garbage while steadily cutting how much food can be dumped by big institutional kitchens and restaurants that find it cheaper to waste food than have too little to sell. Massachusetts is one of six states that has capped how much food can be dumped by food service companies, and it works. Food waste declines as caterers, grocers, and restaurants reduce, reuse, repurpose, and compost what they produce. And it gets better: Food donations increase as well. Massachusetts saw donations jump 22% when it imposed limits. “It’s the single most transformative thing we are seeing,” says Broad Leib of Harvard’s Food Law and Policy Clinic. “It forces people to see that food has value.”Date labeling is another critical step the government could take in the fight against food waste. There are no federal laws on how foods are marked for expiration—only a 50-state patchwork of “best by” or “use by” recommendations. Few consumers can navigate the difference between mandatory “sell by” dates (required for certain highly perishable foods like dairy) and the more common array of ambiguous “best by” and “recommended by” labels (which are mere suggestions, timed for peak flavor, that are placed on foods often safe far longer). The confusing nomenclature “is a driver of so much of the food that’s wasted in the household and by grocery stores and retailers,” Broad Leib says, as grocers and home cooks toss perfectly good food with approaching “best by” dates. Creating national standards for date labels would be “an easy win” and the single most cost-effective way to reduce food waste, she says.And within agriculture, the regenerative farming movement seeks to make agriculture into a net gain for the environment. Conventional farming with tilling, pesticides, and herbicides, kills off microorganisms and makes most soil release more carbon than it absorbs. Regenerative farms reverse this, paring back wasteful production practices, reducing water and fertilizer use, and planting crops that store carbon in the soil instead of the atmosphere, making soil “the most overlooked carbon sink on earth,” according to Josh Tickell, author of Kiss the Ground, a book (and subsequent film) on the movement.20 Percent of meat produced globally is wasted. That’s like 75 million cows.There’s another easy step that we can take in the fight against food waste: View it as a chance to eat better. Claire Sprouse, a bartender and sustainability activist and the owner of Hunky Dory in Brooklyn, described wasted food to me as “a lost opportunity to learn, a lost opportunity to find flavors.” Sprouse has become a teacher and an advocate for cutting food waste across the service industry. But she doesn’t do it by lecturing her peers or her customers. “We’re not in the business of saying no to people,” she says of the hospitality industry.She has stopped using the term zero waste because “it makes sustainability sound unachievable.” Instead, she focuses on the delights—and cost savings—of trimming waste. That positivity lures diners into trying recycled ingredients, like the flavored syrups she makes from celery leaves, rosemary stems, and even coffee grounds. Any leftover ingredient plowed back into cuisine is “free food!” she exults. Even the whey left over from making yogurt or mozzarella can add a touch of viscosity and acid to a drink or dish. “We’re discovering flavors and ideas we never came across before,” Sprouse says. The result is “creative and unique offerings for the menu that put us ahead of the curve.”Food waste is really about lost knowledge, Sprouse told me. The key is simply opening our eyes to the issue, because “being better is always a good start.”Explore Bon AppétitHealthyishSustainableessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-18", "author": ["Condé Nast", "Patrick Symmes"]}