{"id": "e1e485943deaae16e5a34c9a7eaa9b2b", "url": "https://www.bonappetit.com/recipe/spinach-thepla-and-vaghareli-dahi", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "Thepla With Vaghareli Dahi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpinach Thepla and Vaghareli DahiBy Hetal VasavadaMarch 22, 20214.4(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintThepla, unleavened Gujarati spiced flatbreads, is one of my favorite go-to Gujarati comfort foods. Typically made with fenugreek leaves, I’ll often sub with spinach when it’s hard to find or not in season, just like my mom does. Another trick I borrow from her is to roll out the dough in oil instead of flour, which gives you soft, supple thepla. Keep in mind that the amount of water needed to bring the dough together depends on the brand of flour you are using (I used Bob’s Red Mill), so add sparingly. In the end you want a stiff dough that has just enough moisture for it to come together into a ball. You can freeze the theplas for future use by parcooking them. Cook the thepla for 45 seconds on each side, then place on a wire rack to cool. Stack and wrap them in plastic or foil and place in a plastic bag and freeze. When you’re ready to make them, just heat up your pan and cook per directions. I like to serve my thepla with vaghareli dahi, or tempered yogurt. The vaghar (also known as chhonk or tadka) is simple and adds an immense amount of flavor to the yogurt. You can also enjoy thepla with chai, athanu/achar, or on their own.Ingredients4 ServingsVaghareli Dahi2cups plain yogurtKosher salt2½tsp. vegetable oil¼tsp. cumin seeds5garlic cloves, finely choppedPinch of asafetidaPinch of red chili powderSpinach Thepla3cups (375 g) whole wheat flour1Tbsp. vegetable oil, plus more1Tbsp. sesame seeds1tsp. Diamond Crystal or ½ tsp. Morton kosher salt½tsp. ajwain (carom) seeds¼tsp. cumin seeds¼tsp. ground turmericPinch of asafetida (optional)1small Indian green chile or serrano chile, finely chopped into a paste (optional)4garlic cloves, finely grated1tsp. finely grated ginger4cups spinach leaves, finely choppedPreparationVaghareli DahiStep 1Heat oil in a small saucepan over medium-high. Once oil is shimmering, cook cumin seeds until fragrant and oil around seeds starts to sputter, about 2 minutes. Add garlic and asafetida, reduce heat to medium-low, and cook, stirring, until garlic is golden brown, about 1 minute. Remove pan from heat and stir in red chili powder. Pour over reserved seasoned yogurt and mix well.Spinach TheplaStep 2Using your fingers, rub together flour and 1 Tbsp. oil in the bowl of a stand mixer until well combined, about 1 minute. (This will help the thepla stay soft after cooking.) Add sesame seeds, salt, ajwain seeds, cumin seeds, turmeric, and asafetida and mix well. Then mix in chile, garlic, and ginger, followed by spinach. Add ½ cup room-temperature water and mix with your hands or a large spoon, adding more water by the tablespoon as needed, until a shaggy dough forms.Step 3Fit bowl onto stand mixer and attach dough hook. Mix dough on medium-low, scraping down sides of bowl once or twice, 5 minutes. Transfer dough to a clean surface; gather with your hands and knead dough, adding more water a tablespoonful at a time if it feels too dry, until you have a semi-stiff dough. Knead dough another minute, then form into a ball. Coat dough with a little oil and place back into bowl and cover with a kitchen towel. Let sit 15 minutes.Step 4Heat a large nonstick or cast-iron skillet over medium-high. Divide and roll dough into about 20 walnut-size balls (about 40 g each). Rub your work surface and rolling pin with a little oil (about 1 tsp. total). Working with 1 ball at a time and keeping the rest covered, flatten balls against work surface, then roll, rotating occasionally for an even shape, into 6\"-diameter rounds, about ⅛\" thick. Cook thepla in skillet 1 minute, then flip and brush with a little bit of oil. Cook 30 seconds, flip, and cook another 30 seconds. Continue cooking, turning every 30 seconds, until thepla is browned in spots on both sides, about 5 minutes. Transfer to a paper-towel-lined plate.Step 5Serve spinach thepla with vaghareli dahi alongside.How would you rate Spinach Thepla and Vaghareli Dahi?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThe theplas were good, but I found them extremely underseasoned (and my family agreed). I'd probably almost double the salt next time. The Dahi is also nice but very simple. The quality of your yogurt is everything there, obviously.AnonymousKansas City6/8/2021Explore Bon AppétitFlatbreadBreadIndianSouth AsianAsianSpinachLeafy GreensVegetableGarlicYogurtOther IngredientsVegetarianLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-22", "author": ["Condé Nast", "Hetal Vasavada"]}