{"id": "e1e93957cc01ebd10f1b41ebb8d56a5c", "url": "https://www.bonappetit.com/recipe/charred-leeks-with-honey-and-vinegar", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Charred Leeks With Honey and Vinegar Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2020 IssueCharred Leeks With Honey and VinegarBy Andy BaraghaniMarch 17, 20204.7(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintDon’t be afraid to take the leeks to the point where they almost look burnt. A well-charred exterior means the interiors will be creamy, soft, silky, and delightfully sweet.Ingredients4 servings4medium leeks (about 2½ lb.), white and pale green parts only, tough outer layers removed (root ends left intact)2Tbsp. sherry vinegar or red wine vinegar2tsp. honey2Tbsp. extra-virgin olive oil, plus more for drizzlingPreparationStep 1Prepare a grill for high heat. Rinse off any sand and dirt from leeks and pat dry. Arrange directly on grate (no need to oil) and grill, turning every few minutes with tongs, until outsides are completely blackened (leeks should start to soften and may begin to release some juices), 12–16 minutes.Step 2Transfer leeks to a cutting board and let rest 10 minutes (the interiors will continue to steam and get even softer as they cool).Step 3While the leeks are resting, whisk vinegar and honey in a small bowl until honey dissolves. Set dressing aside.Step 4Cut leeks on a diagonal into 1½\"–2\" pieces. Transfer to a medium bowl and toss with 2 Tbsp. oil; season with salt.Step 5Transfer leeks to a platter and spoon reserved dressing over. Drizzle with more oil and season with pepper.How would you rate Charred Leeks With Honey and Vinegar?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleI cannot recommend this recipe enough. Delicious, tangy, rich, an amazing side. Not only is it regularly a crowd-pleaser (serve it with fresh bread & cheese to turn a low-effort snack into a genuinely impressive lunch) but I use the same treatment on cabbage, bok choy, pearl onions, and just about any sturdy semi-green vegetable. Caito MooreSarasota, FL10/19/2021The dressing was very sweet and tangy, however the char on the leeks mixed with the vinegar flavor didn't translate super well for me and I LOVE vinegar. This wasn't a favorite at the dinner table.Chef_sadgalLos Angeles7/24/2020Wow, fantastic simple recipe!  I was wondering if it would taste burnt, but the honey & vinegar perfectly balance out the char.  Loved it.AnonymousBay Area, CA5/21/2020Holy crap! I can’t think of a dish that I’ve tried using leeks, but I know they’re in the allium family and have heard good things on cooking shows, so my partner and I picked them up while at he store a week ago. Well, they were getting VERY close to going bad, so I figured I’d look up a Bon Appetit leek recipe and I am SO happy I did. A 4 ingredient recipe that takes 15-20 minutes that tastes AMAZING. I cooked this on a ridged griddle on the stovetop with another griddle pan and heavy Dutch oven on that to press the leeks into the grill while it cooked. The char flavor mixed with the mild oniony flavor of the leek and the sweet, bright character of the dressing... OH, MAN! Fantastic. Will be a go-to weeknight side dish from here on out. If you’re looking at this and still reading, YOU HAVE TO MAKE THIS.gguidr7New Orleans4/25/2020Would it be possible to do these in a pan rather than on the grill? LaraCBMelbourne, Australia4/14/2020What do you serve this with??Anonymousthousand oaks, CA4/3/2020Amazing!!!! impressed by leeks!Eli AjaLondon4/2/2020I made this recipe to go with a roast chicken tonight.  The extra dressing was great with the chicken.  And the leeks were tender and savory and to die for.  Also, fit on my diet, at about 200 calories for half the recipe.chandram3/27/2020Explore Bon AppétitLeekVegetableSpringQuickEasy5 Ingredients or FewerSideDairy-FreeGluten-FreeNut-FreeVegetarianHealthyishGrillingPassoverDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Andy Baraghani"]}