{"id": "e2043141980fe0e1103fa1cb46ed52fa", "url": "https://www.bonappetit.com/story/a-skeptic-tries-pancakes", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "A Skeptic Tries: Pancakes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Skeptic Tries: PancakesTo me, they just seem like the first draft of a breakfast food—floppy, bland, plenty of room for improvement.By Maggie LangeMarch 14, 2022FacebookTwitterEmailPhotograph by Isa Zapata. Food Styling by Judy Kim.FacebookTwitterEmailA Skeptic Tries is a series examining our food resistances and what happens when we try them anyway. Next up, writer Maggie Lange tries to love pancakes in the name of, well, love.Dating someone with a precise palate often means hearing utterly surreal reports about flavor: There’s rotten blueberry in this espresso. Is that eau de tree bark in the beets? It’s one of the qualities I love most about them. I ask Megan about an oyster, and they give me the word grass or honeysuckle. But no one is purely fascinating. We all have our contradictions, and the glitch in Megan’s heightened sense of taste is their affection for soft, boring foods: mashed potatoes, plain pasta from a box with truly nothing on it, and, most upsetting, pancakes.On the mornings when they are vulnerable (hungover), I hear them whisper, softly into the distance, like an unanswered prayer: I wish we had pancakes. But to me, pancakes just seem like the first draft of a breakfast food. I don’t understand how they became a staple—and who they convinced to let them remain one! If something is bland its texture better be virtuosic. Waffles (crispy containing cakey) understand this. Toast (roasted brittle against springy carb) understands this. Crepes (pliant, firm) understand this. They are like pancakes, but crepes know to get out of the way for the stars of the show: the toppings (Brie and ham, for me).This brings us to pancakes’ gravest fault. For such bland little things, you’d think they would try harder to make friends. But, in my experience, pancakes are companionable with two flavor combinations: butter and maple syrup, and [insert fruit of choice] and whipped cream. Where is the Pecorino and shaved fennel topping? Where’s the prosciutto or smoked salmon or spicy-herby slather? The fried chicken and pickles? These are all combos that crepes, toast, and waffles have no problems hanging out with. Pancakes are the Charlottes of the breakfast menu: boring and fussy.This does make them an easy target. In the first season of Succession, one of the most devastating insults cast was that Connor, the floppy dud eldest brother, was “the first pancake,” named for the phenomenon whereby the initial pancake is always the lousiest one of the batch. In a recent episode of Big Mouth, two characters have sex for the second time and are trying to lovingly describe how it was just fine: “Like pancakes without syrup: Kinda okay!” A rough first try and a faltering second attempt are inevitable parts of the human experience, but can we not ask for more from our food? When it comes to breakfast, pancakes are the first pancake.Megan has tried countless unbeloved foods (mushrooms, Bloody Marys, tuna salad sandwiches) for me, and what have I done for them? Nothing, is what. So it’s Megan’s impending happiness alone that finally coaxes me to try them one morning in mid-January. Even though they’re the one with a fuzzy-Saturday-morning brain and I’m hangover-free, Megan is going to make us the first pancakes I’ve had in years.Even I must admit, the way pancakes exit the frying pan—one by one like they’re in a beauty pageant or a parade—is iconic! On first glance, fresh-off-the-griddle pancakes are prettier than I remembered, with some lacy-swirly Robert Smithson aesthetic going on. But we encounter another hiccup in the experiment: I don’t like maple syrup anymore than I like the dough under it. So I shuffle to the table with thick pads of butter and dollops of cream on my stack. The first bite is eggier than I expected—in a nice way—and the texture is a little more buoyant than I thought it would be. The morsels covered with whipped cream (January berries looked absolutely too deflated to purchase at the co-op) are almost lively. But nothing thrills me about the experienceI find one very good thing about this breakfast, which no one talks about but should: Pancakes are filling as hell, dude! I had four and I was full—like, just ate a bagel full—for hours. Despite near constant satiation attempts, I’m almost always hungry. It’s so convenient to not be hungry; you don’t have to keep getting food.The second time we have pancakes, I come into the kitchen to find Megan, who simply won’t give up, has laid out a buffet of savory toppings for my experimenting: slices of avocado, egg, Gruyère, smoked salmon spread, dill, meats. Let me tell you, I truly gave my stack a fighting chance to get along with various combinations. The pancakes just didn’t want to hang. Like a trampoline, the taut top rebuffed everything I tried to pile on it, from the hard stuff (an aged cheddar) to the soft stuff (my Usinger’s liverwurst, a.k.a. gorgeous creamy-salty perfection) to the gooey stuff (a perfect over-easy egg).The breakthrough this time—and it is a big one—occurs when I drizzle my pancakes with ChChCherry Bomb hot sauce. It’s smoky, so slightly sweet, and the texture isn’t far off from maple syrup (pancakes’ comfort zone). Finally, I can see the appeal. If you have a viscous sauce with a thick flavor that you want to drink, but you can’t for reasons of propriety or intensity, then the pancake is an acceptable sopper-upper. While now is not the season, I also have a vision of the hot sauce with ripe summer peaches. It’s promising that I’m thinking of a future with pancakes involved.The third time my partner makes pancakes for us, it’s the first big snow on the East Coast and I try out my birthday present cross-country skis—making infinity loops in the block-wide city park by our house. This is an activity eccentric as it is appetite-building. And when I get home, pancakes are there: warm and cozy and extremely filling. As I shovel buttery, hot sauce-covered bites into my mouth, I am tentatively optimistic. I see my partner and I sharing plates at a diner four hours into a road trip, or ravenous after too much birthday—moments when I would be benevolent and weak enough to include them at my breakfast table despite their shortcomings.Even I must admit, the way pancakes exit the frying pan—one by one like they’re in a beauty pageant or a parade—is iconic! Pancakes seem like they’d be easygoing and adaptable, but they’re not at all, and this is perhaps what I admire most about them, spiritually if not gustatorily. They collect in a stack, but they are confident and individualistic. They may be bland, but they refuse to act like it.Explore Bon AppétitA Skeptic TriesCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-14", "author": ["Condé Nast", "Maggie Lange"]}