{"id": "e20c143b879e5b9048f6369b49222794", "url": "https://www.bonappetit.com/story/roulpat", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "If You’re Rolling Dough, You Need a Roul’pat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf You’re Rolling Dough, You Need a Roul’patSave the tastefully flour-dusted marble for pretty photos.By Melissa WellerDecember 21, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I’ve had my Sasa Demarle Silpat Roul’pat for over 15 years and would never consider rolling out pie dough without it. Mine was given to me by my boss and mentor, Gina DePalma, at my first professional pastry job at Babbo in 2005. And after years of working in pastry kitchens and baking at home, I’ve found that it’s the superior nonstick rolling surface, better than anything I’ve rolled dough on. And that includes marble, which is beautiful, but actually needs to be chilled for the best results.Silicone pastry mats are excellent nonstick work surfaces. Dough that would normally require a lot of flour to prevent sticking, suddenly does not. The dough will slide and turn and roll easily. It works for literally everything—cookies, pie dough, babka dough, Danishes. If it’s dough and you roll it, then you can count on me to pull out the Roul’pat. I also like that the bottom of the mat is not coated so it does not slip around on your counter or table. Only the dough moves on a Roul’pat. Silicone can also withstand high temperatures, so it’s good to bake on too, as those of you with Silpats already know. But I use my Roul’pat only for rolling dough because of its large surface area. The one thing I don’t do with a Roul’pat is cut on it, because if I were to accidentally cut through the mat, it would no longer be food-safe. If I need to trim or cut, I move the pastry onto a piece of parchment paper, cutting board, or directly onto the underlying work surface.So my advice to those of you looking to cut down on baking stress at home is to roll out your dough on a Roul’pat and save the marble for your beautiful photos after the bake.Ty Mecham/Food52Jumbo Silpat Roul'pat$65 at Food52$70 at AmazonMelissa Weller is a professional baker based in New York City and the author of ‘A Good Bake.’ Explore Bon AppétitHighly RecommendBakeShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-21", "author": ["Condé Nast", "Melissa Weller"]}