{"id": "e22608d9cbf6a702a4b81bab6a289a41", "url": "https://www.bonappetit.com/recipe/khoresh-bademjan", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "Khoresh Bademjan Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueKhoresh BademjanBy Andy BaraghaniOctober 5, 20203.7(53)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek Brown, Ceramics by Meilen CeramicsEmailPinterestPrintEmailPinterestPrintThis Persian stew of tomatoes and spiced eggplant is typically made with lamb or beef, but it’s faster and just as savory without meat. If you’re using dried limes, puncture them with a knife to further release their unique tangy and musky flavor into the stew. Lime juice isn’t a perfect substitute, but it adds a hit of much-needed, brightening acidity.Ingredients4 Servings8–9Tbsp. vegetable oil, divided6small Japanese eggplants (about 2 lb.), peeled, halved lengthwiseKosher salt1large onion, finely chopped1tsp. turmeric¼tsp. ground cinnamonFreshly ground black pepper¼cup double-concentrated tomato paste3medium tomatoes (about 1 lb.), seeds removed, coarsely chopped3lemon omani (dried black limes) \t\tor 2 Tbsp. fresh lime juiceCooked basmati rice, parsley leaves, plain yogurt, and flatbread (for serving)PreparationStep 1Heat 6 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Working in batches, cook eggplant in a single layer, adding another 1 Tbsp. oil if pan looks dry, until deeply browned, about 3 minutes per side. Transfer to paper towels; season with salt.Step 2Add remaining 2 Tbsp. oil to same pot and cook onion over medium-high, stirring occasionally, until softened and browned around the edges, 8–10 minutes. Sprinkle turmeric and cinnamon over and season with salt and pepper. Cook, stirring, until fragrant, about 30 seconds. Stir in tomato paste and cook, stirring, until slightly darkened in color, about 2 minutes. Add tomatoes; cook, still stirring, until tomatoes have burst and mixture is very thick, 7–9 minutes.Step 3Nestle eggplant into sauce and season lightly with salt. Pour in 5 cups water; bring to a simmer. Pierce dried lemon omani with a paring knife and add to pot. (If using lime juice instead, add when dish is finished cooking.) Cook, gently stirring occasionally, until thickened and eggplant is almost creamy in texture, 40–50 minutes.Step 4Divide rice among bowls; ladle stew over. Top with parsley and yogurt and serve with flatbread.How would you rate Khoresh Bademjan?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleDelicious recipe and one I've already made a few times.  I'm sure it's great as is, however the cook in me can't help but to add spices I feel would go well with it.  I always add cumin, garlic, paprika, harissa, and sometimes ground beyond/impossible beef and/or chickpeas and it's fantastic.  The only downside is how much oil the eggplant slices soak up when you fry, next time I will try other's suggestion to spray them with oil and bake them to soften it.  Hector M Napa, CA 2/25/2021Really easy and delicious, with minimal ingredients. Next time I'd add garlic and use less water or cook longer to get a slightly thicker consistency. We served it over basmati rice with sautéed kale on the side. LaurenPortland, OR12/18/2020YUM.  I was surprised this had so much flavor with so few spiced.  I let mine go for a little longer to get a really nice stew consistency.  I couldn't find double concentrated tomato paste, so I used a regular can of tomato paste.  I served with a Persian spiced snapper and basmati rice.  I will most definitely be making this again, especially next summer when my garden comes in!Rebecca QIndianapolis11/18/2020I made this last night - followed the suggestions of other reviewers and added: 1 clove garlic, stock instead of water, a pinch of red pepper flake, 1/3 tsp of cinnamon, roasted eggplants instead of frying, and cooked it with some ground beef I had left from a different recipe. It was tasty, but lacked some umami depth. I think more tomato paste or a bit of miso paste, as another reviewer suggested, would have improved this. The lemon omani were a great addition though! AnonymousConnecticut 10/27/2020This was so delicious. It smelled great and tasted even better. It reminded me of our Lebanese eggplant dish butanjane (spelling is just a guess) with just a slight difference in the flavor profile. I followed the recipe with just a few differences in procedure, The eggplant was very long so I cut it in smaller chunks. The browning time per batch was less than called for but I had 3 batches.I only had double concentrate tomato paste but I don't think it changed the flavor much. The stew cooked much faster than the 40-50 minutes called for.- after about 25 minutes, the eggplant was tender- much longer and it would have been mush, and the sauce was perfect for a stew ( I used only about half the water called for). It was just right. The lime juice, parsley and yogurt were fine additions to a wonderful meal. Daly City, California10/27/2020I had a very good experience with this recipe and would definitely make it again. For me it came out super flavorful — in fact, so intensely so that I absolutely wanted rice to balance the intensity for servings 2-end — and I'm someone who likes pretty intensely flavored food. Things I did, some based on previous comments, some not: \n1. Used a mix of Japanese and Thai eggplants (? they were about the size of larger zucchini). \n2. Peeled, then sweated the eggplant halves while I prepped the rest of the ingredients.\n3. Fried, rather than roasted the eggplant halves in a wide, 5.5 quart saucepan that handled most in one batch AND used a Suvir Saran trick for roasting that kept the oil down. After I'd applied the first slick, which soaked up quickly, I sprinkled water from a Pyrex into the pan regularly to keep the eggplant from sticking as it browned. This seemed to work reasonably well.\n4. Increased the spices a little (?), added a pinch of red pepper flakes, and some saffron per another recipe.\n5. Added 1.5 cups of dried garbanzo beans that I'd cooked beforehand. Not sure what that cooked up to, but it was exactly the right amount.\n6. Possibly a key to the flavor: rather than water, I used 5 c. of homemade, unsalted chicken stock.\nTo finish it, I added the lime juice called for, and plenty of salt. I ate the first two bowls without rice, but found the flavor so intense that I made sure to have rice for the rest of the leftovers. Overall, very flavorful and delicious. I will almost certainly make it again when I can get a good price on eggplants.Anchorage, AK10/22/2020My husband is one-half Persian (and one-half Italian) and he really enjoyed this.  I usually make his mother's bademjan recipe, and every Persian family is going to make their koresh bademjan a bit differently from the next for sure - like an Italian family pasta sauce recipe vs. another family sauce recipe.  But, we thought we'd give this a try.\n\nI did roast the eggplant, wasn't going to stand & fry them for sure.  I followed the recipe, did toss in a minced garlic clove with the onion - habit.  My tomatoes (seeds out and chopped), did burst from the skins - I think that is what was meant by that part of the recipe.  I added the 5 cups water & let it simmer for almost 2 hours.  The texture & thickness was PERFECT for a stew.  Just needs more time, I think, than the posted time in the recipe.  Even when he lived in Iran, hubby said he didn't enjoy cinnamon in his food, so he did ask next time I omit the cinnamon entirely- and the dish was very good with it, he just prefers his Persian food to be without it.  I squeezed 1/2 lime over it at the end as I didn't have the Persian Limes on hand.  My picky 13-yr old even enjoyed dipping the koobideh I made on the side into the dish.  \n\nI despise eggplant so can't comment on it the dish myself, other than it looked really good - PERFECT consistency after 90 minutes - 2 hours simmering uncovered.  Hubby asked me to keep this recipe to mix it up from his mom's now & then!Palatine, IL10/19/2020Loved it!  It came out perfectly.  AnonymousNorth Carolina10/19/2020My wife is Persian and I cooked this for her. She was not impressed by the outcome, nor was I.\n\nFirst question was where are the split peas!\n\nGoing to speak to my morther-in-law and get a better recipe for next time.Sunny DLondon, England10/18/2020I liked the recipe that put eggplant together with flavorful seasonings without meat. Unfortunately, after following the recipe exactly, it came out like a bland tomato soup. Many reviewers talk about adding 5 cups of water. The recipe that I used, directly from Bon Appétit magazine, calls for 6 cups of water. I doubt that if I'd used 1 cup less water, it would have made much difference. Also, even with 5 cups of water, it needed much more time than 40-50 minutes to thicken. I admit, that I'm tempted to try it again, taking one cook's advice and adding no water!! It also seems that some cooks did not peel eggplant as instructed. I think that leaving the skin on would have helped to add a depth of flavor.AnonymousSanta Barbara10/18/2020I was immediately excited about This recipe when I opened my magazine, and then the wide spectrum of reviews intrigued me even more, and helped me make what I thought was totally delicious. \n-Roasted the eggplant slices (used a combo of Japanese and small Italian, as available).\n-Used 1 whole teaspoon of cinnamon  because I know I love cinnamon in middle eastern tomato dishes\n- used only 4 cups of liquid, 2 of which were beef broth.\n- I was lucky to have dried lime, which I find a bit strong, so I used 2, and took out of dish after about 15 minutes of simmering. \nIt was well flavored, thick and hearty, and the day later left overs were even better.\nA little left on the 3rd day I used for a shakshuka style breakfast over olive bread toast. \nAnonymousPeshastin10/17/2020Alright, I don't usually review recipes but this one seems to be extra controversial, and I think I have something useful to add, so I'm here for a review.\n\nMy dish came out delicious, well-spiced, meaty due to the eggplant flesh, and overall delicious. However, I didn't make it exactly to the recipe, so that's why I can't give this 5 stars. \n\nAfter reading a few reviews, I decided to do the whole salt-sweat-roast of the eggplant first. I cook with eggplant a lot so I'm familiar with this added step. It certainly adds time, but I had the time so I didn't mind. Note that I only roasted the eggplant before adding to the stew, I didn't also fry it in oil. I ended up actually needing a lot LESS oil than the recipe called for because the roasting method only needs a small brush of olive oil. I used 6 Japanese eggplants total and about 2 tbsp oil for brushing and roasting, and one for frying the onion. \n\nIn terms of ingredients, I followed closely except that I did add a pinch of red pepper flakes and some chopped mint to the stew, which I saw in other similar recipes. These are by no means necessary, but I really liked the flavour they added.\n\nAs for the water: 5 cups did seem like a lot, but this is a stew so I decided to add it all. I simmered with the lid on for about half an hour, and off for about 45 minutes to thicken it. The consistency was really nice. I should have just skipped simmering with the lid on altogether to save time, I don't think that really was necessary. \n\nAnyways, this recipe and Andy introduced me to this dish, which I'm thankful for because it was delicious, even if it wasn't written the way I cooked it. I'm a prolific home cook so I was able to rely on my instinct to correct the recipe as I went, but for a newer home cook this might cause some problems or turn out less than ideal.jannebroVancouver10/15/2020I feel this was a recipe that never saw a test kitchen (let alone proofreader) before publication (please explain to me how 3 medium tomatoes, de-seeded and coarsely chopped, “burst” during cooking). Following this to a tee (no adds, substitutions, alterations, etc.) results in a bland tomato soup (5 cups of water is not going to reduce to a stew consistency in 50 minutes on “simmer”). A quick Google for other recipes for this dish quickly show the problems with this one (I did try another, and it was delicious).  JustSomeGuySeattle10/15/2020So I realized after leaving my review: I completely missed the part of the recipe which calls for adding 5 C of water. That is a LOT of water to dilute the flavors! Making this recipe a second time, I added about 1/2 C water and that was still too much. The first time I made this - with a flavor rating of 5 stars, after broiling my sliced Italian eggplants, and slightly increasing increments of ground spices - I added no water at all. It resulted in a thick and flavorful, warming stew that sat nicely on top of rice! I do prefer the thicker, no water method.AnonymousBoston10/14/2020This was delicious!  For those carrying on about what they'd add and change, please consider that this may be a cuisine that is different from what you're accustomed to , eg, adding garlic is in no way customary.  If you used lime juice instead of dried limes, think about finding them somewhere before you judge.Sandy LevyNorth Carolina10/13/2020Explore Bon AppétitStewSoups and StewsPersianMiddle EasternIranianEggplantVegetableTomatoEasyMainNut-FreeVegetarianHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-05", "author": ["Condé Nast", "Andy Baraghani"]}