{"id": "e22af67caa0ea3c521b15002c6963662", "url": "https://www.bonappetit.com/story/water-filter-love", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "This Water Filter Belongs To My Ex-Boyfriend, And I'm Still In Love With It  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI'm In Love With My Ex-Boyfriend's Water FilterWe broke up months ago, but I can't stop thinking about his Waterwise 8800.By Anya TchoupakovFebruary 13, 2018FacebookTwitterEmailPhoto by W & K/ullstein bild via Getty ImagesFacebookTwitterEmailWhen my boyfriend and I broke up after three and a half years, I missed his harem pants and the lessons on lucid dreaming, but what I missed the most—what I still miss—is his water.One of Thomas’s favorite causes was the quality and safety of tap water. From fluoride conspiracy theories to a general distrust of government interference in a basic human need, he went deep into the water wormhole and never came out. The pièce de résistance of his obsession was the Waterwise 8800, a large, very expensive water filtration system that took everything out. All the minerals, additives, chemicals: all but the two Hs and the O. It took four to six hours for the Waterwise 8800 to purify a gallon of water, and the thing generated so much heat that we used it as an extra radiator in the winter.What’s left in the first canister is the incontrovertible evidence: brownish, yellowish, sticky, and very stinky gunk. Once I saw that, I was all in.At first, I teased him about his latest pet project, then I saw how it worked. According to the website, the unit boils the tap water to kill bacteria, as well as cysts and viruses (bet you didn’t think that could even be in your water). The steam rises and leaves behind dead microbes, dissolved solids, salts, heavy metals, and other bad stuff. Then the steam is condensed, and the purified water goes into a second canister via an organic coconut-shell carbon filter. What’s left in the first canister is the incontrovertible evidence: brownish, yellowish, sticky, and very stinky gunk. Once I saw that, I was all in.But, ever the skeptic, I decided to do some more research. I found a lot of discussion out there, from whether over-exposure to fluoride causes cancer and mind-control to startling discoveries that there’s a whole bunch of other crap in tap water, even in NYC, where we like to think we have some of the best water in the country. I found a tap water database from an organization called The Environmental Working Group that showed NYC water to have more than double the amount of chloroform, for example, than national health guidelines recommend. Eek!But more convincing than my research was the fact that drinking filtered water made me feel amazing. I felt lighter, healthier. When I would go out of town, away from the filter, I noticed a stark difference in my levels of energy and thirst, my skin health, and general wellbeing. I started to think: If we’re spending our lives focusing on the kind of food we put in our bodies and what products we use on our skin, why aren’t we paying attention to our tap water as well?Thomas and I had very different understandings of “healthyish.” I’ve been known to order “The Trucker’s Breakfast” at brunch when he went for “The Naturalist.” While he veered dangerously close to veganism, I once got three types of meat on a single burger (in case you’re wondering, they were bison, bacon, and brisket). Our differences went deeper than food choices, of course. Throughout our relationship, I was the head and he was the heart. I kept him tethered to the earth, and he unglued me from it.We met when I was 18 and he was 27. We always knew our life plans didn’t quite add up, but we always figured we’d cross that bridge when we came to it. Last summer, we got to the bridge. He was ready to leave the city and spend the rest of his life meditating in the woods. That was not part of my plan, and he wasn’t about to do the whole early twenties thing with me all over again. There was no big blow-up fight; nobody screamed or threw things. We had a few difficult conversations and decided to break up.A few weeks later, I moved into my new place, a sublet just a block away from our old apartment. I share the place with one other person, and it’s the first time since before college that I’ve had a room to myself. The independence is liberating, but the learning curve is steep. No one’s there to share the basic things like cooking or cleaning my room; it’s up to me to take care of myself, to create the homelife I want, and to hydrate.At first, I was going to Thomas’s apartment for water rations about once a week. I would bring a couple empty jugs, and he would fill them up with that super-filtered H2O while we caught up and swapped advice about everything from job interviews to Tinder matches. Maybe it was weird, but, if the alternative was screaming matches and avoiding each other and all our mutual friends, I figured we were doing okay.Then Thomas started dating someone else. This was a surprise, especially because I found out by bumping into them in our neighborhood one afternoon. It wasn’t easy to come to terms with this new shift in our relationship; maybe our closeness since the breakup had given me a false sense of security. Suddenly, it didn’t feel right to come over for water anymore. Not only did I not want to infringe on their new relationship, I also needed to focus on my own life. I needed to stop relying on him: for water, for dating tips, for career advice. This new phase has been a little bit lonelier, but it’s made me extra grateful for my friendships, renewed my drive for independence, and helped me start to look inward for fulfillment instead of waiting for it from the outside.And one thing hasn’t changed: I still refuse to drink the tap water at home, so I bought a Brita filter. It’s no Waterwise 8800, but it’s a start.Explore Bon AppétitHealthyishShoppingRead MoreshoppingI Can’t Stop Drinking Water Ever Since I Got This ThingBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Anya Tchoupakov"]}