{"id": "e22e91371e4700403443e757f70480cc", "url": "https://www.bonappetit.com/story/donostia-anchovies", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "These Luxury Anchovies Are So Good, I Eat Them Straight from the Jar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Luxury Anchovies Are So Good, I Eat Them Straight from the JarHow do they get so plump and pink?By Alex BeggsMay 3, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Gaby MelianFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Not to brag, but I’ve been on vacation before. Earlier this year, in fact. And it was a big one. We went to Barcelona and San Sebastian, and I spent most of the trip drinking vermouth and eating anchovies and reading mystery novels. I was in heaven!I’d loved anchovies before I left, but I came back a changed woman. I’d never had ‘em so meaty you eat them plain, by the tiny plate-ful, sometimes doused with good olive oil and red wine vinegar. They tasted sweet and fishy—of the sea, but not fishy-fishy. I noticed they were somehow boneless, or at least the bones were sparse. I was used to cheap jars of anchovies that break off in the oil and then choke me with their hairy bones. These were almost a different product.The best anchovies come from Donostia, a.k.a. San Sebastian—or at least that’s what everybody in San Sebastian told me. We brought some back with us from Maisor (go there!) and after that stash was gone, I needed more snacking anchovies (as opposed to cooking anchovies, in which case, these’ll do). One of the importers of Really Good Anchovies is Donostia, a company that imports Spanish tapas tinned fare: olives, tuna, mussels, anchovies, and anchovy-stuffed olives. Instead of looking like gray-brown flaps, their anchovies are red in color and plump. They’re sustainably sourced, wild-caught, etc. They’re subtle in the fishy flavor, buttery and tender, and I’ll confess there are some unavoidable bones, but not 5,000 of them. I eat them on toast with a slab of butter, on pizza, or plain, lightly dressed with sherry vinegar and olive oil. I included them in a tinned fish round-up last year after having them at a restaurant I can’t remember, and since then, they’ve been my standby.One thing, out of at least three, you can do with luxury anchovies.\nNow, $10 a jar is nothing to sneeze at, which is why you should probably buy a second jar, plus some anchovy-stuffed olives, sardinillas (little sardines!), sherry vinegar, and mussels in vinegary escabeche sauce too. When they arrive at your door, pick up a bag of potato chips, pour some vermouth, and pretend you’re on vacation again. Or at least my vacation, which again, was very nice.Buy It: Donostia Cantabrian anchovies in olive oil, $10 at donastiafoods.comExplore Bon AppétitHighly RecommendAnchovyFishShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-03", "author": ["Condé Nast", "Alex Beggs"]}