{"id": "e2381b7bd9c341e91e772251cb81bb3a", "url": "https://www.bonappetit.com/story/how-to-roast-sweet-potatoes", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "How to Roast Sweet Potatoes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Roast Sweet Potatoes That Are Charred on the Outside and Pudding-y in the MiddlePlease accept that they'll never be “crispy.” By Sarah JampelNovember 15, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I want to shout my love for sweet potatoes from every corner of this here internet. I don't save them for fall, or for \"sweater season,\" or for Thanksgiving. I eat them on the hottest days of summer and the rainiest days of spring. I don't discriminate between the varieties (though Japanese are the best TBH). I like them steamed, fried, braised, sautéed, and—on most nights of the week—roasted.It couldn't be much simpler to do and—since my friends regularly text me to ask me my \"secrets\"—I'm going to lay it all out now. (This one's for you, Mackenzie.) But first, a disclaimer. People seem to be clamoring for \"crispy\" roasted sweet potatoes, to which I respond, \"They don't exist!\" I've made plenty of charred, deeply browned roasted sweet potatoes in my life, but none have been crispy or crunchy—you'd need to fry or dehydrate for that. The best you're going to get is a burnished exterior and a custardy middle, and once you've accepted that reality, you're ready to roast.Start by heating your oven—I aim for somewhere in the 400° to 450° range regardless of whether I'm roasting the sweet potato whole, halved, or sliced. While the oven comes to temperature, scrub your sweet potato with a vegetable brush or designated sponge (or, worst case scenario, a paper towel). Remember, these tubers were ripped from the ground, after which they spent a fair amount of time hanging out in transit and in your grocery store. They're dirty! Washing the sweet potatoes not only eliminates actual particles of dirt, but it also introduces some moisture to the skin, which prevents it from turning tough or leathery in the high heat of the oven.How to roast whole sweet potatoes:If you're going to roast the sweet potato whole—say you're planning split it open and dress it liked a baked potato—coat it in a little olive oil and sprinkle it with salt. This is for taste purposes only, so if you're going to peel the skin off and mash the flesh, don't bother. Stick the potato on a baking sheet in the oven—no need to wrap it or prick it—and cook until it's totally tender: A cake tester should pierce the skin and slide through the soft center. Depending on the size of your potato and the heat of your oven, this can take anywhere from 40 to 60 minutes.How to roast cut sweet potatoes:But let's say you want to cut the sweet potato—down the middle into two halves, or into wedges, rounds, or big pieces. Do your knife work, then toss the pieces with a generous amount of oil (oil conducts heat, which increases browning) and season with salt and whatever spices you'd like: I often go with smoked paprika or a mix of ground coriander, cumin, and turmeric.These babies cook at 450° for 15 minutes. \nDistribute in a single layer on an unlined baking sheet (the more contact with the pan, the browner your potatoes will be) and roast until cooked through—anywhere from 15 to 45 minutes (or more!) depending on the size of the pieces. I usually position my trays as close to the heat source as possible (in my oven, that's the bottom) to maximize caramelization. If you're cooking sweet potato halves, like for Molly Baz's Sweet Potatoes With Charred Lemons and Crunchies, there's no need to stir since you're only trying to brown the sliced face. But if you're roasting sweet potato pieces with more than one cut side (wedges, wheels, cubes), you'll want to toss once or twice through the cooking duration so that every edge gets a little love from the baking sheet.While the sweet potatoes cook, take a moment to rummage around your kitchen for something to serve with them. Maybe it's an easy-breezy mixture of yogurt and lemon juice, or miso thinned with tahini and vinegar, or a tangy-salty-sweet riff on okonomiyaki sauce. Sweet potatoes are on the mild end of the flavor spectrum and happy with a little assistance from a punchy condiment.But whatever you do, don't be disappointed with yourself when your sweet potatoes emerge from the oven well-browned but not crispy enough to pass for a chicken cutlet. It's not you—it's them!Get the recipe:Sweet Potatoes With Charred Lemons and CrunchiesWith custardy insides and charred exteriors, these sweet potatoes are everything you always wish roasted sweet potatoes could be. A crunchy mixture of toasted nuts and seeds provides pops of texture and spice, and a cooling lemony yogurt sauce cuts through the richness. View RecipeExplore Bon AppétitSweet PotatoIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-15", "author": ["Condé Nast", "Sarah Jampel"]}