{"id": "e23ce26102bd18f6e230d4cff260b5f7", "url": "https://www.bonappetit.com/recipe/crispy-fried-shallots", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Crispy Fried Shallots Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueCrispy Fried ShallotsBy Molly BazMarch 19, 20194.1(23)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintStarting the shallots in cold oil guarantees that every ring will be perfectly crisp and golden brown, with nothing burnt or oil-drowned.IngredientsMakes about 2 cups8small shallots, peeledVegetable oil (for frying; about 1¼ cups)Kosher saltPreparationStep 1Set a fine-mesh strainer over a medium heatproof bowl. Thinly slice shallots crosswise into rings on a mandoline (they should be about the thickness of a dime).Step 2Place shallots in a medium saucepan and pour in oil to submerge. Set over medium-low heat and cook, stirring often with a fork to encourage rings to separate, until shallots are golden brown, 20–25 minutes. (Keep an eye on them; once they start to brown they’ll darken fast.)Step 3Pour shallots into strainer to drain, then transfer to paper towels. Season with salt and let cool. Reserve shallot oil for another use, like vinaigrettes, stir-fries, and soups.Step 4Do Ahead: Shallots can be fried 5 days ahead. Store airtight at room temperature.How would you rate Crispy Fried Shallots?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangle\"Thickness of a dime\" slices make for shreds. Next time, I'll go for a tad thicker.  At the recommended dime thickness, it took about 35 minutes to get the shallots to golden brown. At the 25 minute mark, I cranked up the heat to nearly medium high.  When I first started the process, the rings all blobbed together so I was concerned they'd finish up that way.  Not to worry.  At about the 30-minute mark, you could definitely see the shallot rings separating from each other and gaining some individual personality.  ;)  The last five minutes was when they needed the most attention and a watchful eye.  Kind of messy but worth the effort.  These are very tasty!Nana BananaVenice, CA11/24/2021Omg! Now I see why these are so hot, I added 5 cloves of garlic and some sichuan peppercorns. Hope I can save some for the noodles!David ParackaLittle Falls NY2/7/2021Explore Bon AppétitCondimentShallotVegetableDairy-FreeGluten-FreeNut-FreeVeganVegetarianFryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Molly Baz"]}