{"id": "e25a590e8dad9188c000c2536cce24b4", "url": "https://www.bonappetit.com/recipe/pork-katsu-sandwich", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Pork Katsu Sandwich Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssuePork Katsu SandwichBy Konbi, Los Angeles, CASeptember 17, 20194.6(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis is it! The famous katsu sandwich from Konbi in Los Angeles, the No. 1 restaurant on our 2019 Hot Ten list. The koji brine deeply seasons the pork and keeps it juicy. You can skip this step, but we highly recommend it.IngredientsMakes 4Pork12oz. boneless pork loin, fat trimmed ¼\" thick⅓cup shio koji seasoning2tsp. kosher saltAssembly½small head of green cabbage, core removed, very thinly sliced (about 3 cups)2Meyer lemons or regular lemonsKosher salt2large eggs, beaten to blend3cups panko (Japanese breadcrumbs)1cup all-purpose flourVegetable oil (for frying; about 6 cups)Tonkatsu sauce, preferably Bull-Dog, and Dijon mustard (for serving)8½\"-thick slices milk bread, crusts removedIngredient InfoShio koji, a fermented seasoning made of rice koji, salt, and water, can be found at Japanese markets, in the Asian foods section of some supermarkets, and online.PreparationPorkStep 1Slice pork crosswise into 4 medallions. Place between 2 sheets of plastic wrap; gently pound with a meat mallet to 5\"-wide pieces.Step 2Whisk koji, salt, and 1 cup water in a medium bowl until salt dissolves. Add pork; cover and chill at least 8–24 hours.AssemblyStep 3Drain pork (no need to rinse off koji if it sticks); set aside. Place cabbage in a medium bowl. Finely grate lemon zest over; slice lemons in half and squeeze in the juice. Season cabbage with salt. Using your hands, toss and squeeze cabbage until slightly wilted, about 5 minutes. Chill until ready to use.Step 4Place eggs, panko, and flour in 3 separate shallow bowls. Whisk 2 Tbsp. water into eggs. Line a rimmed baking sheet with paper towels and set a wire rack inside; place near stovetop. Working with 1 piece of reserved pork at a time, dredge in flour, shaking off excess. Dip in eggs, letting excess drip back into bowl, then coat in panko, pressing to adhere before shaking off excess. Transfer to another rimmed baking sheet or a platter.Step 5Pour oil into a medium heavy pot to come 2\" up sides. Heat oil over medium-high until an instant-read thermometer registers 350°–365°. Carefully lower a piece of pork vertically into skillet, letting it slide away from you into oil until it eventually lies flat. Cook, using tongs to keep meat submerged in oil, until golden brown underneath, about 1 minute. Using tongs, carefully turn over and cook until golden brown on the other side, about 1 minute. Transfer to prepared baking sheet; immediately season with salt. Repeat with remaining pieces of pork.Step 6Drizzle tonkatsu sauce over cutlets. Spread mustard on 1 side of half of bread slices; top with cabbage mixture, then cutlet, sauce side up. Close sandwiches and slice each into thirds.How would you rate Pork Katsu Sandwich?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleOutstanding...ours turned out just like the photo.  That doesn't happen very often.\nAnonymousCentral California5/7/2021One of the best sandwiches I've had. It's simple and perfect. Every flavor and texture you could possibly want in one place. Crispy, juicy meat - tangy sweet sauce - crunchy, fresh, lemony cabbage slaw. All wrapped up in a cloud of milk bread! I was able to source some amazing bread from a Japanese bakery. If you can't find this, pan de mie or another mild, soft loaf would be a fine substitute. I couldn't find prepared shio koji, but it was delicious even without it! I have a batch of homemade shio koji (made from frozen rice koji I got at my local Japanese market) fermenting for next time! Go to a proper butcher for your pork and they will slice and pound it for you - huge time saver!MarcellaVancouver, BC2/15/2021At first it feels like a lot of work for a sandwich, but you can make a bunch of cutlets, cool and freeze them and bake them later at 400 degrees. Future you thanks you. wannappetitMiami10/22/2019I just travelled to Japan for the first time, and the convenience store sandwiches were wonderful--nothing like U.S. convenience store food.  The fried chicken, pork and fish in restaurants was light and crisp on the outside and tender on the inside, just like this recipe.  The directions for frying the pork worked really well, and I liked the lemon coleslaw and mustard on the sandwich.  I made my own tonkatsu sauce, and it wasn't that good, so next time I'll purchase the sauce.  The marinade I bought had a fermented, daikon radish-like smell, either acquired taste or I bought the wrong brand?  It didn't hurt the flavor of the end product, but didn't help it either. I'd use a different marinade next time.  Didn't have milk bread, so I used small, pillowy-soft hamburger buns, kind of like pork sliders.  Delicious!FishinbassSan Diego10/1/2019Made without the milk bread but still very satisfying. Get the oil the right temp (350-365) and these should cook relatively easy. A lot of work up front for just a sandwich but still delicious. Suggest more tonkatsu sauce as opposed to less to cut the citric acid of the cabbage. Enjoy!AnonymousWashington,DC9/30/2019Wasn't crazy about this sandwich. I'd rather just have tonkatsu!AnonymousSeattle9/27/2019Explore Bon AppétitSandwichJapaneseEast AsianAsianPork LoinPorkMeatMainDeep-fryLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Konbi", "Los Angeles"]}