{"id": "e26d05ac1066188e7e704fddbb082c2b", "url": "https://www.bonappetit.com/recipe/lazy-caesar-salad-easy", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Lazy Caesar Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesLazy Caesar SaladBy Claire SaffitzJune 19, 20184.5(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintMaking a traditional Caesar salad dressing—which requires you to whisk oil drop-by-drop into raw egg yolk to form an emulsion—isn't hard per se, but it's also nobody's idea of no-sweat cooking. Our weeknight hack? Using store-bought mayo as the base for the sauce. This streamlined version has everything you want—creamy, pungent dressing, crunchy romaine, umami-rich Parm, and freshly toasted croutons—all in perfect balance, with no special equipment or raw egg yolk required.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketLarge Bowl$18 At AmazonSmall Rimmed Baking Sheet$28 At AmazonMicroplane$16 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonWhisk$10 At AmazonVegetable Peeler$10 At AmazonPlatter$29 At AmazonIngredients4 servings½medium boule or loaf sourdough bread (about 10 oz.)3Tbsp. plus ⅓ cup extra-virgin olive oilKosher saltFreshly ground black pepper1garlic clove1(or more) oil-packed anchovy fillet, drained2Tbsp. Dijon mustard2Tbsp. fresh lemon juice2Tbsp. mayonnaise13-oz. piece Parmesan2–3romaine heartsPreparationStep 1Preheat oven to 425°. Tear ½ boule sourdough bread into 1\" bite-sized pieces, using only the fluffy white interior and discarding the crusts (you should have about 3 cups).Step 2Place bread in a large bowl and drizzle with 3 Tbsp. oil. Season with salt and pepper and toss to coat.Step 3Transfer bread to a small rimmed baking sheet and arrange in a single layer (reserve bowl for making the salad). Bake, shaking sheet to toss once halfway through, until croutons are golden and crispy all over but still squishable in the center, 10–12 minutes. Let cool. (You’re done with the oven, so shut it off.)Step 4While croutons bake and cool, assemble your dressing. Finely grate 1 garlic clove into reserved bowl with a microplane.Step 5Place 1 anchovy (if you’re a fan of anchovies and want to taste them in the dressing, use 2) on a cutting board and mash into a paste with the flat side of a chef's knife. Add to bowl with garlic.Step 6Whisk 2 Tbsp. mustard, 2 Tbsp. lemon juice, and 2 Tbsp. mayonnaise into bottom of bowl until mixture is incorporated.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 7Whisking constantly, slowly stream in remaining ⅓ cup oil. Continue whisking vigorously until you have a thick, creamy, smooth dressing.Step 8Using a vegetable peeler, shave 3 oz. Parmesan into shards, then break up any larger pieces with your fingertips.Step 9Tear 2 romaine hearts into bite-sized pieces directly into bowl with dressing. Season lightly with salt, then generously with pepper.Step 10Add about three-quarters of cheese and about three-quarters of croutons to salad and toss gently with clean hands until lettuce is coated. If romaine hearts were small and salad looks a little overdressed, add some of the remaining romaine heart.Step 11Transfer salad to a platter. Top with remaining cheese and croutons.How would you rate Lazy Caesar Salad?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleNever buying bottled Caesar dressing again… so easy. I tossed all the ingredients in a wide mouth mason jar and hit it with an immersion blender.\n\nAlso making your own croutons makes a world of difference. Honestly use whatever bread you have on hand - I’ve tried this with several different kinds of bread and even sandwich bread works in a pinch!\n\nPerfectly quick and so delicious!!!SKLos Angeles 10/29/2021This is a great recipe. I used half the mustard. (Not a fan of mustardy) And to think that I made this on the spur of the moment, then to my huge dismay I had NO fresh garlic. Nada. What?!!! That Has NEVER happened in my kitchen since 1982! Omg! I always always have garlic! I subbed a lot of dried garlic granules and it STILL turned out great! Stored 3/4 of the beautiful  emulsified dressing for another time. Ate 1/4 of the salad in a state of bliss. \nDivine! O-Sushi-QAnacortes, Washington10/26/2021Great dressing recipe! I doubled it and made the entire dressing in a mason jar using an emersion blender. Only 3 tweaks: 3 anchovies, HALF a cup of oil (as opposed to 2/3) and 2 tablespoons of Worcestershire sauce for the DOUBLE dressing recipe. AnonymousNova Scotia, Canada4/24/2021\"..and toss gently with clean hands until lettuce is coated..\"  How entirely pretentious and unnecessary to use your hands. Use one of your several utensils.My name is going here3/25/2021Can this be made ahead of timeCheryl ZukowskiFlorida 12/28/2020Yum! Made this for lunch today for the first time.  Thanks for being so awesome BA!  I have binged your videos during quarantine and it's been delightful.  Much love to all of you in front of the camera and behind it ♥angela_mcSan Antonio, Texas4/19/2020Love this recipe, it is literally one of my husband's favorite dinners. I throw some chipotle in with my croutons and its so good!danideviousLos Angeles11/18/2019absolutely perfect!\nand YES...we used two anchovies!\n❤️sassygirl711chicago4/14/2019Absolutely love this recipe! Made it for the first time today, I’ve been looking for a salad recipe that I wouldn’t hate, smashed it! Soph121xoxUnited Kingdom2/13/2019This is a great recipe!  I’ve made it three times, added extra anchovies being my only modification.  The home made croutons really stand out, so take a few minutes and do that.  Store bought would not do as well.  Big hit with company and family, fast and easy.angelaspWashington8/30/2018Explore Bon AppétitSaladRomaineLettuceLeafy GreensVegetableParmesanCheeseEasyQuickWeeknight MealsSideMainLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-19", "author": ["Condé Nast", "Claire Saffitz"]}