{"id": "e26d1cc5b1463330757b3ee7445ec6ff", "url": "https://www.bonappetit.com/story/marijuana-mom", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "I Went From Middle School Narc to Marijuana Mom | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Went From Middle School Narc to Marijuana MomHow I finally crossed \"learn how to smoke pot” off my to-do list.By Jane ParkerMarch 22, 2018FacebookTwitterEmailIllustrations by Igor BastidasFacebookTwitterEmailI was a narc in middle school. An official one. We wore blue “Honor Patrol” windbreakers and wrote up pink slips for running in the halls. In high school and college, the main reason I was out late was because I was studying. I had my first drink on my twenty-first birthday. I lost my virginity on my wedding night.I thought doing those things meant life would turn out as planned. But, last year, my career stalled and my kids became surly teenagers. Then I watched Hillary Clinton do everything she was supposed to only to lose, and I was done. I needed something to help me deal, or at least to take the edge off. If I ate any healthier, my life would be super sad. I didn’t have time to run any more miles or do any more vinyasas. Booze was out—drinking turns my skin the color of a plum, and hangovers suck. So, I turned to weed.Although still illegal under federal law, it’s legal(ish) in California where I live, so I wouldn’t be breaking rules. It’s supposed to help you relax, which I haven’t done, like, ever. On the downside, it may impair memory. But I’m at that stage where I can’t remember anything anyway, like the name of that movie—you know, the one with that guy?So I put “learn how to smoke pot” on my to-do list. And when I write something on that list, I work hard at it until I get to cross it off. I just didn’t realize how hard it would be.Everything Ben Stiller did on screen made me giggle. And I am not a giggler.I first met my friend P years ago. He had always impressed me with his work ethic, drive, and smarts. When we reconnected last fall, he told me he smokes pot. A lot. I was surprised; he just seemed too on top of things to be high all the time. But if I could be high like that—kill it at work and life while being nice and chill—then I wanted what he was having.One night, when I didn’t have deadlines looming or kids to watch, I asked P to teach me how to smoke weed. He ground some green buds, stuffed them into a one-hitter, and lit up. He handed it to me and told me to inhale “all the way.” I did. Or I thought I did. But he said, “You’re just holding the smoke in your mouth. Get it into your lungs.” He took a long drag, leaned over, and blew a ton of smoke hard and fast into my mouth. It burned like lemonade going down my windpipe. At first I couldn’t breathe, then I couldn’t stop coughing. When I finally did, I asked, “Now what?” He told me to just enjoy the high.We got under some blankets and started a movie. Within minutes, I felt a happy lightness, as if I was a birthday balloon. Everything Ben Stiller did on screen made me giggle. And I am not a giggler. But then there were two Ben Stillers in the frame and they were all wavy. I wanted to touch P’s arm to ask, “Is this normal?” But I couldn’t tell how near he was. I felt like I was on a roller coaster, rising, falling, spinning, going in endless loops.I stumbled to the bathroom and slumped in front of the toilet. It was the worst type of nausea—I felt like I had to throw up but couldn't. I might’ve fallen asleep on the cold tile floor at some point. P came in every once in a while to try to give me water and to see if I was alive, I guess. I finally vomited; the nausea passed.I crawled to bed and slept hard.When I woke up, everything looked bright and clear and new, like the moment I first put on glasses. I had so much energy, felt so clear-headed. Most mornings, it takes a cup of coffee and an hour for me to even function.I was so happy with this new morning me that I decided to give pot another go, to get that lightness, unbinding happiness, and morning-after clarity—this time without puking. P was (understandably) not interested, so I found another teacher.I love control, so I wanted to know exactly how much cannabis I could take before I went from happy high to bad trip.The only other regular cannabis user I know well enough to ask this favor is a sharp, savvy restaurateur I'll call T. He promised me he’d walk me through inhaling step-by-step. We figured I just got way too much in my system the first time, so we’d start with low doses.First he gave me a pep talk: “You’re always in control, okay? Weed can mess with your head, but you’ll be fine no matter what.” I love control, so I wanted to know exactly how much cannabis I could take before I went from happy high to bad trip.We started with a vape pen from dosist that buzzes after you’ve drawn in 2.25 mg so you can gauge how much you’ve had. T told me to rest my hand on my chest, open my throat the way I would to guzzle water, and breathe in as deeply, slowly, and evenly as possible. He said, “Feel that? Your chest should expand and rise if you’re inhaling right.” We practiced: inhale one-one-thousand-two-one-thousand, hold it one-one-thousand-two-one-thousand, then blow out in a steady stream. Just like yoga.I put my lips around the dosist pen, which looks disturbingly like a tampon, and inhaled until it buzzed, then held and blew. T clapped. I drank water. We waited five minutes to see the effects, but I didn’t feel anything. I did it again. This time, T and his husband both looked extra shiny. So did the cheese plate they put out.Twenty minutes later, I was back to normal, so I graduated to taking a hit from his freshly ground weed. T warned me, “This burns way harsher in your throat than vaping.” He refilled my water glass, and I inhaled. When I coughed, he yelled, “You can control it! Just tighten your throat and stop it.” And I did. Within minutes, I started to feel a little paranoid. Were they laughing at me? Maybe, but I decided to control that thought too. We were laughing together, right?Even though we had agreed that I’d sleep over or take an Uber home if things went wrong, I was totally fine an hour later. More than fine. Sober enough to function normally, but without the usual tightness in my shoulders and mental calculating of work-life duties.When my dog’s tail wagging made me crack up, I knew I had had enough.A week later, I inhaled on my own. I had just turned in a book manuscript and wanted to celebrate. I pulled out my Chemdog pre-roll from Henry’s Original, which is made with a Sativa strain. T taught me a mnemonic device to remember that the other strain, Indica, will make you so tired you’ll need to ride home “in da car” because you’ll be too tired to walk. It was noon; I still had plenty of walking I needed to do that day.I went to the furthest corner of my yard, held the joint between my lips, and lit a match.When I got the joint crackling, I counted off my inhales and exhales while preparing what I’d say during the neighborhood moms’ chitchat. “Oh, I know! Those kids with their terrible pot smoke around here. Yeah, must be that house on the corner.”When my dog’s tail wagging made me crack up, I knew I had had enough. Also, my usual post-book-delivery freak-out—“What if they hate it? What if I never get another job ever again?”—faded. I stubbed out the joint, wrote down “smoked 62.5 mg x 19.1% THC = 11.94 mg THC” in my “THC/CBD” notebook, and headed in.Now I know that I can handle 10-15 mg of THC and that I need at least three hours before driving or seeing my kids. (The one time they came home unexpectedly early from school while I was still high, they asked, “Why are you so happy?” When I replied, “I’m always this happy!” they rolled their eyes.) Given how hectic work-life “balance” is, I’m an occasional user at best. When I can’t sneak out to smoke but really need to chill the fuck out, I stir 10 mg of Ripple or Mondo, both dissolvable cannabis powders, into mint tea and sip innocently.Cannabis has replaced drinking wine on bad work days, screaming into a pillow when my kids give me attitude, and eating ice cream to soothe heartache. But it’s best when nothing’s wrong. It lets me enjoy all the goodness of the moment—of life—without worrying about work’s next assignment, getting the garage door fixed, and how to run between one kid’s soccer game and another’s band concert. My middle school self would be appalled; my middle-aged self doesn't care.Explore Bon AppétitHealthyishCannabisessayRead MoreLifestyleHow to Entertain with Weed: An Etiquette GuideBy Mackenzie WagonerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-19", "author": ["Condé Nast", "Jane Parker"]}