{"id": "e26f99849cd9d8292175f4adb1f212c0", "url": "https://www.bonappetit.com/story/ashley-novoa", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Ashley Novoa Wants Everyone to Experience Their Periods with Dignity | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAshley Novoa Wants Everyone to Experience Their Periods with DignityThe founder of the Chicago Period Project is our Superpowered Chicago honoree.By Britt JuliousJuly 13, 2018FacebookTwitterEmailPhoto by Ryan SegediFacebookTwitterEmailWe're honoring Ashley Novoa as part of Healthyish Superpowered, a new kind of dinner party celebrating women around the country who are redefining wellness. We'll be partying with Novoa and our partner Caviar at Mott St in Chicago on July 17th. Tickets are sold out, but we may be coming to a city near you soon. Wherever you are, you can read all our Superpowered stories here.It’s one of those blistering-hot early summer day in Chicago, when the humidity makes it difficult to breathe, and Ashley Novoa wants to stay indoors. We meet in Pilsen, the neighborhood where she grew up, but we abandon our first stop quickly after realizing that the air conditioning is no match for the temperatures hovering in the mid ’90s. Instead we end up at Simone’s, a comfortable, unpretentious bar and restaurant with multiple TVs showing the World Cup. We settled in at a high top table in the back, next to a group of actors and filmmakers preparing for a shoot.Simone’s, like many of the establishments in this part of the city, represents the changing face of Pilsen. What was once a predominantly Latino working and middle-class neighborhood has undergone massive gentrification within the last decade. Vintage boutiques, Michelin-starred restaurants, and upscale cocktail bars line the streets. Novoa, who grew up in Pilsen during the ’80s and ’90s but now lives in Logan Square with her husband and young son, finds the changes both positive and negative. “I wish there were more of a middle ground,” she admits. “It’s like part of the neighborhood is gone. But, no matter what, it’s still so lively. It has so much character.”Novoa on the streets of Pilsen.\nPhoto by Ryan SegediNovoa still spends three to four days every week in Pilsen, as well as nearby communities, through her work with the Chicago Period Project, the nonprofit she founded in 2016 to provide homeless and in-need people the supplies and knowledge they need to experience their periods with dignity. Within its first year, the Chicago Period Project (CPP) distributed 5500 pads, 10,000 tampons, and 200 “period kits” (comprised of 20 tampons or pads, underwear, a water bottle, hand sanitizer or gels and wipes, and a piece of chocolate) to people both in and outside of the city.Like many people, the 2016 presidential election was a moment of fight or flight for Novoa. A stay-at-home mother, she asked herself what she could do to better her immediate community. “I’ve always been a girls girl, uterus power, and all that stuff,” she says. “At the moment [of the election], I felt like every uterus in the world needed an extra hug.” After she saw a video on the feminist media site Bustle about a homeless person experiencing their period in NYC, the idea to create the Chicago Period Project was born.“I’ve done my fair share of volunteering and helping my community before, but I felt ashamed that I didn’t think about this before seeing this video,” admits Novoa. “As a menstruating person with privilege, I can take my seven dollars and go into the store and buy a box of tampons.” She was particularly struck by the Bustle video’s focus on the lack of safe spaces for trans or non-binary people to maintain their period. “Just the small sound of a tampon wrapper can put them in danger,” Novoa says.Novoa and the Chicago Period Project hope to offer both menstruation supplies and safe public spaces to acquire and use them. “We want every menstruating person to know we’re there for them, whether they identify as women or not,” Novoa says.Novoa kicked off her organization’s efforts with a crowdfunding campaign and a donation drive at Lost Lake tiki bar in January of last year. She credits Shelby Allison, her sister-in-law and the co-founder and co-owner of Lost Lake, with giving her the extra push to get the organization off the ground. (Allison now serves as Vice President of the CPP.)Two months after the donation drive and crowdfunding efforts, the Chicago Period Project distributed their first kits at Turkey Chop in West Humboldt Park, where, every Monday, owner Quentin Love shuts down the restaurant for three hours to provide a meal for free to anyone who needs it.They now donate menstrual items in bulk to local shelters, including La Casa Norte, which serves youth and families facing homelessness in Humboldt Park, Logan Square, and the Back of the Yards neighborhood, and the recently opened UI Health Pilsen Food Pantry, where they plan to open a “hygiene pantry” soon. “Being able to give back to people who don’t have those necessities makes me feel good,” says Novoa, especially in Pilsen.The organization has also expanded into the Chicago public school system, which has been especially important to Novoa. “I don’t know if it was a cultural thing or a generational thing, but my mom never really talked to me about my period,” Novoa says. Novoa got her period during a basketball game when she was 12 and described the experience as “scary.” Despite this initial introduction to her period, Novoa never had to worry about access to supplies or information about menstruation. “[My school] was pretty diverse, but it was mostly just privileged kids. Their parents had money to talk to them about those things,” Novoa says.Because of budget cuts, many public schools in Chicago only have a nurse on staff once a week. Novoa spoke to many teachers who admitted to purchasing menstruation supplies themselves. And with a reported 18,000 homeless Chicago Public School students, many go without any menstruation items because they can’t afford them and are too shy to ask for them. “We get our periods every single month. It’s going to come, and if you don’t have the supplies for that while you’re a student, and you miss two days a month or three days a month, that’s going to play a big role in your future,” Novoa says.CPP recently received a mention on the Instagram account Social Works, Chance the Rapper’s Chicago-based youth empowerment charity. Novoa hopes to partner with the organization to make menstruation supplies even more widely available in schools. She hopes to further expand the CPP’s work by creating period projects in other cities. Some of that national outreach began in the early months of the organization, when the CPP donated menstruation supplies for hurricane relief in Florida and Texas. As the CPP expands, its mission will stay the same. “Periods are normal,” Novoa says. “It’s about education and bettering our knowledge to get to know our bodies. No period left behind.”Explore Bon AppétitHealthyishSuperpoweredChicagoprofileRead MorecultureRukaiyah Adams Is Changing the Face of Wealth and Wellness in Portland, ORBy Hannah WallaceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-13", "author": ["Condé Nast", "Britt Julious"]}