{"id": "e27bf97af42194b3855f3f17399f65eb", "url": "https://www.bonappetit.com/recipe/jerk-spiced-duck", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Jerk-Spiced Duck Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueJerk-Spiced DuckBy Chris MoroccoNovember 20, 20184.2(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintDuck has an unfair reputation for being fussy, but not this recipe. We bathe it in a spiced (nutmeg, allspice) and spicy (habanero) marinade, stick it in the oven, ignore it for five hours, and serve it with fixings for build-it-yourself tacos. FYI: Many butchers stock only frozen duck, so make sure to call ahead and pick it up two days before cooking so it can defrost. Plus, a single-edge razor blade, which is very thin and sharp, works particularly well for scoring the duck skin and fat.Ingredients8 servings25–5½-lb. ducksKosher salt2Tbsp. allspice berries2whole nutmegs16habanero chiles, stems removed1cup soy sauce½cup spiced rum½cup unseasoned rice vinegar4tsp. sugar22\" pieces ginger, scrubbed, crushedHoisin sauce, small flour tortillas, sliced Napa cabbage, sliced scallions, julienned peeled ginger, sliced serrano chiles, mint sprigs, cilantro sprigs, and lime wedges (for serving)Special EquipmentA razor blade and a spice mill or mortar and pestlePreparationStep 1Lightly score skin of both ducks using a clean razor blade, cutting most of the way through skin and fat but not into flesh below (a very sharp, thin knife will also work). Season ducks generously with salt and place each one in a large resealable plastic bag.Step 2Finely grind allspice in spice mill or with mortar and pestle and place in a blender. Finely grate nutmeg into blender. Add habanero chiles (we recommend keeping the seeds in as the ducks’ fat will keep it from absorbing too much heat), soy sauce, rum, vinegar, and sugar. Purée until smooth. Divide marinade between bags; add a piece of ginger to each. Seal bags, pressing out air, and work marinade around to coat ducks. Chill, breast side down, 12 hours.Step 3Preheat oven to 450°. Remove ducks from marinade and place, breast side up, on a wire rack set inside a foil-lined rimmed baking sheet (don’t worry about any marinade that may be inside ducks; it will add flavor as they cook). Roast ducks just until beginning to brown, 10–12 minutes. Reduce oven temperature to 250° and continue to roast until ducks are very dark brown, leg joints wiggle freely when flexed, and an instant-read thermometer inserted into the thickest part of breasts registers 195°, 4½–5 hours. Let rest 30 minutes before shredding.Step 4To serve, pile meat on hoisin-slicked tortillas and top with cabbage, scallions, ginger, serrano chiles, mint, and cilantro as desired; squeeze lime wedges over.How would you rate Jerk-Spiced Duck?Leave a ReviewTell us what you thinkReviews (6)Back to TopTrianglePut the duck in for 5 hours at the temperature indicated in the oven. It never reached 195F, we took it out at 170F (minimum internal temperature for the duck is 165-170F). The duck ended up being too dry. I think the 195F is a typo, which is a shame, because it kind of ruined the duck.Anonymous5/19/2020I made this for dinner last Christmas Eve and it was such a hit! I followed the recipe exactly, except omitted the habaneros because we don't do spicy. The duck came out perfectly tender, juicy, and shreddable in the time suggested. We made our own mini-flour tortillas, which came out kind of thick and bao-like. All together, the meal very much resembled a cheater Peking duck, which was completely awesome!AnonymousSLC12/1/2019Made this for New Year's Eve party, and guests asked for it to be a regular menu item each year! You want internal temp high enough for shredding, but I pulled my birds around 185F - 190F. Tender and juicy, I shredded one duck and served the other whole for people to pull apart themselves. Bao buns were great addition, along with fresh accouterments! AnonymousPhiladelphia, PA1/8/2019I suspect that the internal temperature is a typo. My experience with roasting duck tells me it should be 165-170, not 195. Can the editors please review and correct as indicated?Lisa SaundersBay Area12/29/2018Good intro to cooking duck, enjoyed the marinade and the ducks look really impressive pulling out of the oven for a party. \n\nA couple of notes\n1) For a Saturday party I bought the duck on Tuesday, then let them defrost in the fridge for a day. On Wednesday I removed the ducks from the packaging, scored the skin, heavily salted them, covered in plastic wrap, and let them sit in the fridge until marinading them on Friday. Then started the cooking on Saturday morning\n2) You will need a 2 or 2.5 gallon zip lock for marinading\n3) There is something wrong with the cook time or temp. 5 hours for 2 ducks at 250 (including the first 10-12 min at 450) is not enough to reach an internal temp of 195. I put convection on at the 3.5 hour mark and they got to ~187 at about 5 hours and 15 min. I pulled them out at that point. \n4) Instead of serving with tacos I bought frozen baos from the local Asian market. \n5) The recipe suggests a lot of fixings to go along with the duck for the tacos, I would only put out 3 from the list so you don't spend too much time/money on sides. I would skip the ginger for sure.\n6) Pay attention to the yield of 8. \nAnonymousChicago12/17/2018After five hours my duck was at 174. I ended up cooking for an extra hour and got it to 190 and took it out. It was quite dry. I wonder if the goal temperature was misprinted and is supposed to be 175? It was tasty, but we definitely needed lots of hoisin on the tacos to combat the dryness of the duck!hewitt_aVancouver 12/16/2018Explore Bon AppétitTacoCaribbeanDuckPoultryChileVegetableMainDairy-FreeKetoRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Chris Morocco"]}