{"id": "e29bb7874742b7d8534b44182b07b9ae", "url": "https://www.bonappetit.com/story/naturally-fermented-hard-cider", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Americans Have Been Doing Hard Cider Wrong Forever, and It's Time to Change | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAmericans Have Been Doing Cider Wrong Forever, and It's Time to ChangeMore akin to natural wine than beer, the new crop of naturally fermented ciders are pleasantly funky and never too sweet.By Alex DelanyOctober 9, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWe’ve been wrong about hard cider for so, so long. For the past few decades, cider has been sold to us as a sweet, gluten-free alternative to beer. But from the process of growing and harvesting fruit to fermenting its juices, this is a drink that has much more in common with wine.Now that American cider makers are embracing old-school, hands-off fermentation techniques and heirloom apple varieties, cider is getting a well deserved rebrand. It turns out that in this punk rock-ish era of natural wine, there’s just as much unconventional flavor to explore in naturally fermented and spontaneously fermented ciders. If you already have a thing for skin contact wines, you’ll feel right at home, and if you don’t, well, this is a beautiful new world to explore.The epicenter of the naturally fermented cider movement is the Northeast, the Napa Valley of the American cider world. From New York’s Finger Lakes to southern Maine, heritage apples (native breeds that you probably won’t find at your grocery store) have been growing for more than 300 hundred years. It’s here that cider makers are embracing fermentation techniques that are just as old, turning blends of wild and orchard-grown apples into still and sparkling apple wines that contain tantalizing acidity, tannins, and whispers of the lands in which they were grown. (Yes, you can also call them apple wines. And no, we won’t judge you.)A sparkling apple wine from Vermont's Fable Farm.\nPhoto by Alex LauSmall-scale producers like Vermont’s Fable Farm Fermentory, use yeasts native to the area instead of controlled industrial blends for ciders that taste nothing like Mott’s. “The key is to step out of nature's way by not filtering, heating, or manipulating the wine with ecology-destructing chemicals,” explains Fable co-founder Jon Piana. “The result is an electric symphony of flavor that, if we've succeeded, evolves even in the glass.”So how do we find a naturally fermented cider that gets it right? Reading the bottle is a good place to start. Here’s what to look for:“Wild” or “Naturally” FermentedThis distinction means that the yeast used to turn the apple sugars into alcohol was collected from the fruits’ environment (in the air or on their skins) rather than grown in a lab. The resulting fermentation reflects the terroir and provides deeper, funkier flavors like lemon pith, strawberries, sage, or bleu cheese (in a good way).Sparkling/StillNot all cider is bubbly! Like wine, there are still and sparkling varieties. For a smooth drinking experience, go still. For a livelier one, bubbly.UnfilteredYou might see a little sediment at the bottom of your bottle. That’s totally cool! It’s the leftover bits of yeast and apple that usually get filtered out of the finished product. They help give the cider that wild flavor we’re after.RawPasteurization kills all of the living bacteria and yeast in a cider, making it more shelf stable. If a cider is “raw,” it was not pasteurized, giving it a tingling vibrancy in both body and flavor. Think fresh-squeezed orange juice versus the stuff that comes in the carton.A line-up of some of our favorite ciders.\nPhoto by Alex LauApple VarietyMost ciders are made from a blend of apple varieties, but you want to see specific names, like Northern Spy, Golden Russet, or Newtown Pippin, listed. Avoid anything that just says just “apple juice.”ConcentrateDefinitely steer clear of the word concentrate. Large-scale apple juice is often shipped across countries and continents as a concentrate, because it’s less expensive, and then gets diluted before it makes its way into the final product. The process results in cider with a fraction of the flavor of fresh juice.The SourceGood cider will tell you where the apples came from, most of the time down to the orchard or farm. We tend to prefer natural ciders from the Northeast, but California, Michigan, and the Northwest also produce high-quality stuff.The ProducerExploring new producers is half of what makes drinking these wild ciders exciting. But there are certain producers we trust to make ciders we’ll be returning to again and again. Here are six of our favorites:Oyster River Wine Growers - Warren, MEBlackduck Cidery - Ovid, NYRocky Ground Cider - Newburgh, ME\\Redbyrd Orchard - Trumansburg, NYFable Farm Fermentory - Barnard, VTSundstrom Cider - Hudson Valley, NYWant to learn more about spontaneous fermentation? This way, friends:What Is Spontaneous Fermentation, and How Does It Affect the Taste of Wine, Beer, and Booze?The hands-off fermentation method makes wine, beer, and even rum more fun to drink. We’re very, very into it right now.View StoryExplore Bon AppétitCiderApple CiderAppleAlcohol & Other DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-09", "author": ["Condé Nast", "Alex Delany"]}