{"id": "e2a6a9f228c3a2704b96eba3f70eaa75", "url": "https://www.bonappetit.com/recipe/big-eggplant-sandwiches-with-ricotta-and-pickled-onions", "year": 2020.0, "month": 8.0, "day": 5.0, "content": "Open-Face Eggplant Sandwiches with Ricotta and Pickled Onions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOpen-Face Eggplant Sandwiches With Ricotta and Pickled OnionsBy Sarah JampelAugust 31, 20204.5(34)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Tami HardemanEmailPinterestPrintEmailPinterestPrintWhile pan-fried eggplant is extraordinarily delicious, sometimes you need a preparation that’s quick and low-mess. For this dinner-worthy sandwich, you’ll sear the eggplant on the stove, then marinate it in oil and vinegar to make it silky-soft and flavor-packed. The eggplant is great on its own—chop it up and serve it with hummus and pickled vegetables—but works well on an open-face sandwich paired with creamy ricotta and crunchy red onion. Feel free to use sherry vinegar, Champagne vinegar, or white wine vinegar in place of the red wine vinegar. This recipe is part of the 2020 Healthyish Farmers Market Challenge. Get all 8 recipes here.IngredientsMakes 4½small red onion, thinly slicedBig pinch of sugarKosher salt3Tbsp. red wine vinegar, divided1small eggplant (about 8 oz.), sliced ¼\" thick1Tbsp. plus 1½ tsp. extra-virgin olive oil, plus more for brushingFreshly ground black pepper½cup walnuts½cup basil leaves¾cup fresh whole-milk ricotta¼tsp. honey1garlic clove4slices country-style bread, toastedGreen leaf, red leaf, or romaine lettuce leaves (for serving)PreparationStep 1Preheat oven to 350°. Combine red onion, sugar, a big pinch of salt, 2 Tbsp. vinegar, and 2 Tbsp. hot water in a small bowl. Let sit, tossing occasionally, until you’re ready to assemble sandwiches.Step 2Brush eggplant rounds generously with oil on one side. Heat a large skillet, preferably nonstick, over medium-high. Working in batches if needed, cook eggplant in skillet, oil side down, in a single layer, until well browned, about 4 minutes. Brush each round with oil, turn over, and cook until other side is browned and eggplant is tender, about 3 minutes. Transfer to a baking dish or wide shallow bowl.Step 3Whisk 1 Tbsp. plus 1½ tsp. oil and remaining 1 Tbsp. red wine vinegar in another small bowl to combine; season with salt and pepper. Pour over eggplant, toss gently to coat, and set aside.Step 4Toast walnuts on a rimmed baking sheet, tossing halfway through, until golden brown, 6–8 minutes. Let cool slightly, then pile on a cutting board along with basil. Add a pinch of salt and finely chop. Transfer to a clean small bowl and add ricotta and honey. Finely grate in garlic and mix well; season with salt and pepper.Step 5Spread ricotta mixture over toast. Top with lettuce leaves, pickled onion, and reserved eggplant.How would you rate Open-Face Eggplant Sandwiches With Ricotta and Pickled Onions?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleWhat is meant by \"fresh ricotta?\"  Is it different than the ricotta sold in tubs in most grocery stores?  One site said fresh meant ricotta salt, which is a crumbly texture, quite dry in comparison to the ricotta in tubs. AnonymousSan Francisco3/13/2022Chopping the warm walnuts with fresh basil is lovely and I never would have thought of it! This is delicious but I couldn't eat much as it is very rich - I used a local fresh-made ricotta, which was already pretty rich on its own, and adding walnuts made it quite a bit richer. The ricotta mix would make a lovely filling in something bite-sized and geared towards the hors d'oeuvres side of things. AnonymousSC8/16/2021This was a yummy lunch! I second another reviewer's comment about the honey being weird; it overwhelmed the flavor profile a bit in my opinion. Next time I may exclude altogether or just use a tiny drop and/or add some Aleppo chili flakes to balance out the sweetness. I left out the walnuts because I wasn't in the mood to preheat the oven, dirty another pan, etc... which leads me to another point: this is quite fussy for a sandwich. But I suppose many good things are fussy... I appreciated the artistry and combination of flavors and textures, but it took *forever* to pan fry all the eggplant even with the widest pan I have. I may broil the eggplant in the oven on a sheet pan next time for faster results. All in all, a fun way to mix up the lunch repertoire! SAArlington, VA7/20/2021Excellent idea for eggplant..its savoury sweet tangy all rolled into one, and carbs are low cause its OPEN FACE YEAH!!GillianToronto Canada7/19/2021Super delicious, and a lovely end of week \"reset\". I ended up doing a full pickle of the red onions the day before, and used sunflower seeds instead of walnuts due to an allergy. Very yummy, filling, flavorful, and colorful. BilliePittsburgh, PA4/26/2021So good! Did not have the walnuts on hand but it was still wonderful and minimal mess!AnonymousHouston, TX3/28/2021Loved the idea of chopping the nuts up with the herbs, I will definitely be using this technique with other ingredients. Wasn't a fan of the honey in the recipe, didn't pair well in my mind. I didn't have ricotta but this worked great with plain greek yogurt. \nIt is fussy and you could lose some of the ingredients without missing out too much, pickles onions for example, but worth making as is at least once.  Jocelyn2/19/2021Amazing!! I made my own ricotta for this too and would definitely recommend. AnonymousNevada12/9/2020This was DIVINE. I expected it to be tasty but not quite this tasty! The combination of the pickled onions with aubergine and ricotta is just so fantastic. Could not recommend enough. Only tip I'd suggest is try cooking your aubergine all in one go in the biggest pan you've got; save yourself some time. RokehliciousLondon/Brisbane11/14/2020Delicious but the eggplant is a little potchke for a sandwich, I'd be happy with the ricotta spread and pickled onions!nechjayTel Aviv10/6/2020Sandwich was tasty but a bit too fussy for me. The only thing I will make again is the ricotta, honey, walnut spread. It tastes good as a  dip for sliced apples as well or as a sweet spread.Anonymous9/26/2020I love eggplant and when I read the recipe, I knew it was going to be good. But when I made it tonight it totally exceeded my expectations. The toasted walnuts really tied the room together. My wife and I will be making this again for sure. nschmiBoothbay Harbor, ME9/17/2020Loved this recipe! We fried the eggplant and used that as the bread and it was delicious. Will definitely make this again. AnonymousMaine 9/13/2020Very easy recipe and delicious!! I loved the texture the walnut and pickled red onion added. Made a great appetizer to share and excited to have the leftover for lunch. AnonymousPhiladelphia, PA9/9/2020Great recipe. Very easy to make and relatively quick. I used pita bread instead of the country style and loved it. AnonymousBoston, MA9/8/2020Explore Bon AppétitSandwichToastMediterraneanEggplantVegetableRicottaCheeseRed OnionOnionSummerWeeknight MealsMainVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-31", "author": ["Condé Nast", "Sarah Jampel"]}