{"id": "e2b5fdc26a415fce4e0ff2748c116bf7", "url": "https://www.bonappetit.com/story/best-bloody-mary-mixes-doctor-up", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "The 5 Best Bloody Mary Mixes—and How Bartenders Doctor Them Up | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe 5 Best Bloody Mary Mixes—and How Bartenders Doctor Them UpSemi-homemade cocktails you can make by the pitcher for your next brunch party.By Alyse WhitneyApril 12, 2018FacebookTwitterEmailMike Di Tota/The BonnieFacebookTwitterEmailBloody Marys are one of those things that you probably only get at weekend brunch. They’re not difficult to make, but here at Bon Appétit, we don’t have a super basic recipe. We like to make them a little more elevated, like the New-New Bloody Mary and a so-crazy-it’s-good shrimp stock Bloody Mary. But if you’re making big batches for a party at your apartment, you might be tempted to take a shortcut and buy pre-made mix at the store. It’s okay, because we talked to five bartenders to find the best Bloody Mary mixes. Some of them are classics (hello, Mr. & Mrs. T’s) and others are a little more artisanal. They all need a little help to get to the next level for your friends, and lucky for you, bartenders gave a five-ish ingredient list to doctor up Bloody Mary mix—plus either vodka or another spirit to make ‘em boozy.Check out five semi-homemade Bloody Mary ideas below, starting with a Greek version that includes a large garnish of feta cheese (pictured up top).1. Add a Super Savory Greek Twist“I start with a pitcher full of Mr. & Mrs. T’s classic mix ($6 on Amazon). It’s the best Bloody Mary mix because it’s fairly bland and not too spicy, so you can doctor it up however you like; I let guests either spike with Tito’s vodka or leave virgin. Our neighborhood of Astoria is predominantly Greek, so I was inspired recently to experiment with a Greek twist on a Bloody Mary. To make it, add 1–2 Tbsp. of slightly sweet Greek white wine Retsina, 1 tsp. puréed jarred roasted red peppers, and 1–2 Tbsp. chicken broth to each glass. The broth adds a nice meaty flavor without weighing the drink down. About ⅛ teaspoon of anchovy paste gives it even more umami, 1 tsp. of jarred horseradish is essential for heat, and a squeeze of lemon juice adds brightness. A big cube of feta as garnish is like the funky icing on the cake—I like Arahova or French if you can find it.” —Mike Di Tota, bar director and general manager at The Bonnie in Astoria, NYThis Peruvian take on a Bloody Mary uses Pisco instead of vodka and a spicy pepper paste.\nCourtesy of Yuyo2. Try a Bloody Mary-Pisco Sour Hybrid“I like Red Eye’s original Bloody Mary mix ($16 on Amazon) because it’s not too vinegary and has a nice celery taste. I start with 3 oz. mix and shake together with ice, 1½ oz. Pisco (preferably BarSol Pisco Primero Quebranta), three dashes of aji amarillo pepper paste (thinned with a little water), a dash of Worcestershire, and a dash of wasabi powder. Rim with togarashi and garnish with speared nori, encurtidos (pickled sweet bell peppers), and Botija olives (Peruvian olives).” —Tamy Hoang, bartender at Yuyo in Austin3. Make a Mezcal Michelada“Whenever I think brunch, I think Micheladas. When I can’t get my hands on one I’ll spice up my Bloody Mary à la Michelada into a Smoky Maria. I really like using V8 Bloody Mary mix ($4 on Amazon). It’s light and refreshing and a pretty good canvas to play around with. For a Smoky Maria, I typically start with 2 oz. of a good mezcal like Reyes y Cobardes, or another mezcal made with wild grown cupreata agave. Then add a dash of Maggi seasoning (a Mexican hybrid between soy and Worcestershire sauce), two dashes Tapatío hot sauce, ½ oz. lime juice, two dashes Bittermens Xocolatl Mole Bitters, and salt and pepper to taste. Top everything with V8 Bloody Mary Mix and rim your glass lightly with Tajin. As for toppings... I’m still perfecting a way to skewer a taco on top!” —Rui Silva, beverage director of Scratch Restaurants in Los AngelesThis rendition from Nicky’s in Nashville is classic, but a little elevated with extra pickle juice, Old Bay, and pepperoncini brine.\nNicky's Coal Fired4. Pickle It“If I use mix, it’s Zing Zang ($14 on Amazon). It’s a good base that is already well seasoned—it has a nice spice to it and it’s properly salted, which can be hard to balance. It makes a great jumping off point, and I combine 4 oz. mix with 2 oz. Pickers vodka, 1½ oz. Claussen pickle juice, 1 tsp. Gulden’s mustard, 1 tsp. pepperoncini brine, a squeeze of lemon and lime juice, and salt and pepper. To finish, rim the glass with salt and Old Bay seasoning, and pour over ice.” —Caroline Galzin, general manager and partner at Nicky’s Coal Fired in Nashville, TN5. Turn Up the Heat with Habanero Scotch“I really enjoy Zing Zang Bloody Mary mix ($14 on Amazon). For me to bring the already really solid mix to the next level, I start with the addition of something a bit spicier, so I roast six habaneros in the oven at 400° until they have a nice char on them (about 12 minutes). I rub off some of the char—leaving some is fine, you don’t have to go too crazy—and infuse them into a blended Scotch like Famous Grouse. To do so, chop them up and let sit with the Scotch for two hours, and strain. Build the final Bloody Mary with 1½ ounces infused Scotch, ¾ oz. Oloroso Sherry, ¼ tsp. Hungarian paprika, ¼ oz. lemon juice, two dashes Worcestershire, and 1 dash fish sauce. Add everything to a tall glass with ice and gently stir. Top with Zing Zang, mix again, and serve with garnishes like pickled pearl onions, Spanish chorizo, and a lemon wedge. The Sherry adds a nice background nuttiness, and the rest allows the salinity and umami to be pumped to 11.” —Josh Relkin head bartender at Proxi in Chicago.6. Make It Taste Kind of Like a Taco“The best Bloody Mary mix is Gordy’s, a local D.C. brand that you can buy for $12 on their website. I combine 5 oz. mix with 2 oz. of El Silencio mezcal for smokiness, a dash of our Loco hot sauce (or your personal favorite), a sprinkle of Tajin seasoning for a little kick and zest, and a pinch of cumin for warm spice. If I have it around, a splash of juice from Pico de Gallo—yesterday’s party, or from ordering in—helps make it the ultimate hangover cure.” —Vanessa Miller, bartender at El Techo  in Washington, D.C.Here’s a crazy shrimp Bloody Mary:Explore Bon AppétitBloody MaryPitcher DrinksCocktailRead MorecultureThis Shrimp Stock Bloody Mary Is Not Disgusting. Really.By Josie AdamscookingOur Bloody Mary Gets a MakeoverBy Dawn PerrycookingBartenders Are Putting Yogurt, Granola, and Chia Seeds in Cocktails NowGallery9 SlidesBy Nikita Richardson Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-12", "author": ["Condé Nast", "Alyse Whitney"]}