{"id": "e2bb33c33a174b9cf23225d4e7c57016", "url": "https://www.bonappetit.com/recipe/tomato-and-mango-salad-in-aguachile", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Tomato and Mango Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueTomato and Mango Salad in AguachileBy Tom CunananMay 21, 2019EmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco and Tom Cunanan, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintAguachile is the spicy relative of ceviche that leans heavily on chiles for heat and lime juice for acidity. In this recipe from Tom Cunanan of Bad Saint in D.C., hearts of palm, mango, and tomatoes replace the traditional raw shrimp.Ingredients8 servingsAguachile12oz. tomatillos (10–12), husks removed, rinsed6serrano chiles, halved lengthwise, seeds removedVegetable oilKosher salt2Tbsp. fresh lime juiceAssembly1large or 2 small mangoes, peeled, cut into bite-size pieces¼white onion, thinly sliced1lb. tomatoes (about 2 large), cut into bite-size pieces114-oz. can hearts of palm, drained, \tcut into 1\" piecesFresh cilantro sprigs (for serving)PreparationAguachileStep 1Prepare a grill for medium-high heat. Combine tomatillos and chiles on a rimmed baking sheet. Drizzle with a bit of oil, season with salt, and toss to coat. Grill, turning occasionally, until lightly browned all over, 8–10 minutes for tomatillos and about 4 minutes for chiles. Return to baking sheet; let cool.Step 2Purée tomatillos and 2 chile halves in a blender until smooth. Add lime juice; taste and season with salt. Set remaining chiles aside for serving.Step 3Do Ahead: Aguachile can be made 2 days ahead. Cover and chill. Bring to room temperature and stir in a splash of water to loosen before using.AssemblyStep 4Arrange mangoes, onion, tomatoes, and hearts of palm on a platter. Drizzle aguachile over and top with cilantro and reserved chiles.How would you rate Tomato and Mango Salad in Aguachile?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladFilipinoSoutheast AsianAsianTomatilloVegetableSerrano ChileChileMangoStone FruitFruitTomatoHearts of PalmStarterSideDairy-FreeGluten-FreeNut-FreeVegetarianVeganHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Tom Cunanan"]}