{"id": "e2beafbc719acf08e7177bdba5fb5062", "url": "https://www.bonappetit.com/story/big-winter-braises", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "The Big Braises I'm Eating All Winter Long | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Big Braises I’m Eating All Winter LongSteamy broths, Dutch oven dinners, and potlikkers galore.By Dawn DavisFebruary 20, 2022FacebookTwitterEmailPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Stephanie YehFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.In the office we have been playfully referring to this month’s magazine as the Pot Issue. Not pot as in cannabis! But rather a reference to the fact that so many of the belly-warming recipes in this issue come out of a big steaming pot. First we turn the spotlight on potlikker, that residual goodness left behind after you boil greens, vegetables, or beans. Carla Hall, the inventive Southern-born chef, shares how she uses one base to flavor two recipes each, for a total of three potlikkers and six recipes. There is little I like more than a two-for-one deal, so I can’t wait to try the Smoked Paprika and Sun-Dried Tomato Potlikker out of which both Braised Chicken Thighs With Olives and Herbs and Brothy Pasta With Miso-Butter Turnips can be created.We also have an informative piece on hot pot, a method of communal DIY dining common in East and Southeast Asian cultures. Chef Eric Sze not only gives us the hows and whys but also recipes for both a vegan herbal mushroom broth and a rich beef one.As you can imagine there is a lot of talk of cookbooks in our proverbial halls (a.k.a. Zoom calls), and occasionally it seems everyone is in love with the same book. This month the brilliantly titled I Dream of Dinner (So You Don’t Have To) by Ali Slagle is a house favorite. Recipes from that book—like this weeknight-ready One-Pot Puttanesca and these quick-cooking smash burgers—have been lovingly adapted for our readers. We already know you’ll love them.I Dream of Dinner (so You Don't Have To)$27 at AmazonAnd if the only thing you find inspiring about dinner is dessert, get lost in the sweet Technicolor dream world our test kitchen editors created. From our cover darling, the Chocolate Matcha Butter Mochi Cake, to zingy Passion Fruit Bars, these bold and beautiful baked recipes are ready to do battle with the it’s-still-winter blues.Explore Bon AppétitLetter From The EditorCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-20", "author": ["Condé Nast", "Dawn Davis"]}