{"id": "e2c797717fc2c8e9995c5e53aacaca4b", "url": "https://www.bonappetit.com/story/vermicular-pan-review", "year": 2022.0, "month": 1.0, "day": 5.0, "content": "BA Reviews the Vermicular Frying Pan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingBA Reviews the Vermicular Frying PanCan a featherweight cast-iron pan compete with the OG cast-iron skillets?By Lauren JosephJanuary 29, 2022FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Last summer I wrote about cast-iron pans on this here very site, insisting that you absolutely need one. (I stand by that.) “If you’ve already got one, move along!” I added. I believed it—and for many cooks one cast-iron workhorse will do. But ever since I wrote that article, fancy cast-iron pans have been following me around, popping up in targeted ads and earnest conversations from fellow cooks. Happily, finally, I caved to temptation; I tried the sleek Vermicular Frying Pan.Vermicular Frying Pan$155 at Vermicular$155 at Food52The Vermicular Frying Pan claims to do everything you’d expect from a classic cast-iron skillet, like this dependable Lodge that often goes on sale for $18. Meaning, you can expect the pan to be durable, even-heating, and ideal for high-heat cooking. But beyond that, Vermicular says its frying pan will “recalibrate your expectations of cast-iron cooking” with its “featherweight design” and “heavyweight performance.” Unlike traditional cast-iron pans, the Vermicular also sports a nonstick enamel coating and claims to offer the best of both worlds—the slickness of the best nonstick pans coupled with the high-heat capacity of cast iron. I loved the idea of a pan that didn’t require two hands to go from stovetop to table. But I worried that without the heft, the Vermicular pan would cool down quickly when it came into contact with a big cut of meat and wondered if the pan could really be as low-maintenance as advertised. Plus, this pan is $155, with a corresponding glass lid for $40—would it be worth it?To test those factors I used my Vermicular in place of my fallback Lodge for everything for three months. (Well, almost everything—more on its limitations later.) I browned mushrooms and wilted bok choy, seared this looks-fancy-actually-breezy one skillet steak, fried shallots, and steamed plump clams using that $40 lid. I also cooked a few things I would normally only trust on the glossy surface of a nonstick skillet: this weeknight crispy tofu, for example, and scrambled eggs.After a couple of months of frying and searing, I can say that the Vermicular pan is lightweight and heats evenly and quickly, just as advertised. If you’re after a pan that will live permanently on your stovetop, this is the one. Its design is eye-catching enough you’ll never want to put it away anyway; while much cast-iron cookware is rustic and homey, the Frying Pan is more modern than it is prairie-ish. You’ll sear meat and fish, stir-fry vegetables, crisp tofu, toast nuts, and caramelize onions in here happily, thanks to the ripping hot surface and quick moisture evaporation. The nonstick enamel coating will stay in fairly good shape with little upkeep, making it ideal for anyone intimidated by the rigors of cast-iron care. It’s a gorgeous piece of cookware that offers precision where a traditional cast iron just provides a whopping dose of heat.Still, the wooden handle, while ergonomically designed and lightweight, is not oven-safe and cuts the pan’s use in half. For that reason alone, the Vermicular Frying Pan is best for someone who already has a traditional cast-iron skillet for all their skillet cookies and roast chickens.Score: 9/10ProsLightweight and even-heatingNearly nonstickEasier to care for than traditional cast ironConsSteep priceHandle is not oven-safeThe basicsThe Vermicular frying pan comes in two sizes: a 9.4\", which has a 2\" depth for easy frying, and a 10.2\", with a depth of 1.6\". The 9.4\", which I tried out, clocks in at just 2.3 lb. By comparison, a 9\" Lodge cast-iron skillet weighs 4.17 lb. The base of the pan itself is as thin as a nonstick skillet and has a slick enamel coating, which essentially means that the pan is even better at evaporating liquid than a standard cast iron, leading to faster and more even frying, searing, and caramelizing. Think of the enamel coating on your Dutch oven: This is a thinner layer of that. It’s not quite as scratchproof as the thick, glossy coating on a Le Creuset; it’s but a step up from standard, naturally porous “raw” cast iron.The other main difference is that the handle is made of wood. That gorgeous oak or walnut feels great in your hand and lends to the pan’s lightness but isn’t oven-safe. (The company plans to release a pan with a metal handle this fall.)What does the Vermicular frying pan do well?All those little tweaks in a classic design result in a pan that is superior in many ways to your everyday cast-iron skillet. For one—and this is a big one for many home cooks—the Vermicular’s lightweight design makes it approachable to cooks with limited mobility or strength. I found that I could pick up the pan easily with one hand and take it to the table, whereas I’d prefer two with my Lodge. The wooden handle, which overall is a negative, is ergonomically designed.It also doesn’t need to be seasoned because of the enamel coating. My beloved Tawashi scrubber and archaic-looking Ringer chain mail, both key for scrubbing away little crusty bits on an old school cast-iron skillet, have sat untouched. I mostly just wiped the Vermicular out with a warm damp cloth and then quickly and thoroughly dried it, occasionally using a bit of soap on a soft sponge—but that’s it. The pan has stayed free of rust or scabby bits even with use three or four nights a week for months.Because of that enamel, liquids evaporate more quickly than with traditional cast-iron pans. The team at Vermicular says that it takes three seconds for a teaspoon of water to vanish in their pan. When BA tested evaporation time in a traditional cast iron skillet, it took around 30 seconds. What does this mean, practically speaking, for you? Superior caramelization and intensified flavors. In order for the Maillard reaction to occur (when the proteins and sugars in your food transform into the caramelized, savory brown crust we love) you need heat and a dearth of water. That’s why we suggest patting dry a steak before you sear it or making sure you give chunks of beef or lamb for stew plenty of room when you brown them—if the pan is crowded, your meat will just steam in the liquid it gives off instead of searing. The enamel coating on the Vermicular pan essentially nudges you along toward the Maillard reaction, even in the case of veggies that have a tendency to wilt and steam.The third benefit of the enamel coating is its glossiness. I love this pan for crisping the skin on a duck breast, which has a high enough fat content to easily separate from the pan once caramelized. But I find the biggest difference is with vegetables and other foods with a low fat content, like slices of tofu. The base of a standard cast iron pan can easily become nubbly and rough, meaning delicate and lean foods often need plenty of oil in order to release naturally from the pan in an even, golden layer. This pan’s coating stayed slick enough to sear slices of tofu, delicate greens, and in a pinch, even scramble eggs without a pool of butter. (I’d still go for a standard nonstick pan for a scramble, but as long as I had wiped a thin bit of oil around the pan carefully and didn’t agitate the eggs wildly while scrambling, they didn’t stick.)The enamel coating also means you can cook acidic food like tomatoes in it. (While a well-cared for and evenly seasoned regular cast iron can handle acidic foods just fine, a neglected one will impart metallic taste to long-simmered acidic foods, like a tomato sauce.) I slowly reheated a batch of rasam in there and found that the pan left no metallic bite in the tomato broth.About that beautiful wooden handle…The one big bummer? That unique wood handle. Dutch babies won’t work. Browning chicken thighs and then nestling them into a bed of vegetables to finish cooking in the oven, also out. Using my pan for a pull apart bread or this skillet phyllo pie? Big nope. I seared a rib eye in the pan, and while the results were just as evenly brown as if I’d cooked it in a heavier skillet, I then had to switch pans to finish it in the oven. For that reason alone the Vermicular pan can’t really replace your existing cast iron—but for stovetop use, I prefer it, and it can maybe even replace your nonstick skillet.Lodge Pre-Seasoned Cast-Iron Skillet$34 $18 at AmazonIf you do not yet have a cast iron, I’d still say go for a classic, delightfully inexpensive Lodge. But If you’re looking to expand your cast-iron collection, and you’re ready for a well-designed, stovetop-only pan, the Vermicular is worth the price. Then put it to use with both the delicate proteins, vegetables, and all the saucy, oil-coated things you normally cook in your OG cast iron. For now, I’d rate the Vermicular Frying Pan, which has barely left my burner, a 9/10. And when that metal-handled pan comes out, I’d easily give this beauty a 10/10.Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-29", "author": ["Condé Nast", "Lauren Joseph"]}