{"id": "e2d41ee3a4ded2ef987550e6c79b49f0", "url": "https://www.bonappetit.com/story/zumba-fitness-class", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Why Zumba is my Social Media Anxiety Cure | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleForget the Fancy Fitness Studios, Zumba Is the Only Exercise Class I NeedIt's never been cool to Zumba, so why have I been doing it for over a decade?By Flora TsapovskyAugust 28, 2018FacebookTwitterEmailIllustration by Igor BastidasFacebookTwitterEmailA children’s magazine I was subscribed to ages ago had a recurring feature with the \"coolest\" boy and girl of the month. The winners were chosen from a pool of contenders, presented over the weeks in the magazine’s pages. I’d look at the chosen ones, at their perfect little faces and their expensive sneakers, and try to wrap my nine-year-old mind around what makes them different than me. They were cool, see. I knew I wasn’t, but I didn’t know why. Today the grown-up equivalent of that children’s magazine is Instagram, and the coolest boys and girls are crowned by hundreds upon thousands of likes. I’m trying to enter the competition, studiously photographing my #ootd and documenting my night stand. But this time around, I know of at least one thing standing between me and the cool bunch: I do Zumba and they do not.You’ve probably heard of Zumba just like you’ve heard of Pitbull, Zumba’s unofficial mascot and musical icon. It’s the salsa-party-meets-'80s-aerobics workout that your aunt is probably sweating to as we speak. Zumba was invented in the ’90s by Colombian dancer Beto Perez and quickly spread all over the world thanks to its genius business model: For about $300 and just a day of training, anyone can become a Zumba instructor. Classes range from $10 to $15 a drop-in (one Zumba studio I used to go to offered $5 classes and childcare on site). It’s insanely popular. It’s also totally ridiculous.My personal affair with Zumba began accidentally over a decade ago, when a friend introduced me to a class led by a bleached-blond, high-energy instructor. After an hour of shaking my hips and throwing my limbs to Shakira and Daddy Yankee songs, I was hooked. It was the dance party of my dreams, and a hot mess. My dancing partners of all shapes and ages exhibited little coordination or rhythmic talent, and instead cut loose and let their J.Lo flag fly. It was line-dancing on steroids, both communal and completely open to creative interpretation.Sweaty and happy, I swore loyalty to Zumba and have since carried my love for it across the universe, from Tel Aviv to Oakland where, joined by a diverse group of women, I attend one class a week religiously. “If you’re confused about the steps, just come three times,” my instructor always says with the slightest Venezuelan accent. We have a woman that’s been coming for months and still pivots left when everyone goes right during that catchy Marc Anthony anthem. No one raises an eyebrow.In the Instagram-era of fitness, styling is key. Pristine workout studios, stylish logos, and cute color-blocked leggings have defined cool fitness brands like Soulcycle, The Class, and Barre. For many, working out today is a natural extension of a social media persona, carefully curated and well-planned. The harder and cultier the class, the better; it caters to my generation of purpose-seekers.Zumba, though hugely successful, has never been a trendy workout for all the obvious reasons. The music is a mix of salacious reggaeton, perky Cumbia numbers, and pop hits too embarrassing to mention. The uniform? Whatever you pulled out of your closet, plus a very supportive bra. The moves? Utterly silly, and not overdone. And, age-wise, I’m one of the few borderline-millennials on the floor, with plenty of women in their forties, fifties, and even seventies around me. My Zumba ladies aren’t trying to impress their peers, nor are they rushing to post a post-workout selfie, all pastel glow and beige backgrounds. I’m both fond and envious of them.All things considered, it’s very uncool to Zumba. Perhaps that’s why it’s also one of the most inclusive, judgement-free, and enjoyable experiences I’ve ever had. It's a refuge from the pressures that social media puts on us to look, act, and workout a certain way. It’s the one hour a week that I have to do my ugliest, all-over-the-place happy dance with zero pretense. (If you haven't seen us doing a dance-off to Celia Cruz, you haven't seen abandon.) Put down your phones, get over yourselves, and join me.Explore Bon AppétitHealthyishTrendsRead MoreLifestyleWhen Did It Stop Being Cool to Go to the Gym?By Kyle BeecheyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-28", "author": ["Condé Nast", "Flora Tsapovsky"]}