{"id": "e2d5a2b94d7a043513a991bf9d454fc1", "url": "https://www.bonappetit.com/story/how-to-make-stovetop-popcorn", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "How to Make Stovetop Popcorn Perfectly, Every Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Stovetop Popcorn Perfectly, Every TimePut down the pre-bagged stuff, shut the microwave door, and learn how to make stovetop popcorn—the best popcorn, if you ask us—once and for all.By Carla Lalli MusicNovember 8, 2018FacebookTwitterEmailFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed. This week: how to make stovetop popcorn perfectly, every time.I don’t know when exactly it happened, but at a certain point in my life, popcorn usurped pasta as my ultimate comfort/procrastination/cooking for one/hangry food, and it continues to be a fulfilling relationship to this day.I love the sound of popcorn makes when you combine it with oil and stir it in the bottom of a big pot—like tiny marbles clattering around on a frozen pond. I love the pop-pop-pop noise it makes from behind the cooking vessel’s walls. Gentle but persistent at first, then excited and relentless, then determined but diffused. I love the heady popcorn vapors that escape when you crack the lid over after all is said and done. And there is no greater satisfaction than pouring out a pot’s worth of popcorn into a giant bowl and discovering that there is not even a single un-popped kernel in the whole batch. Oh, the thrill of it all!The sad thing is that most people never experience these small triumphs, because most people either a) buy pre-popped, pre-flavored popcorn in a big bag, which is a big waste of money, b) make microwave popcorn, which is marginally better but still has a cardboard-y texture and is more expensive than it needs to be, or c) only eat popcorn at the movies, where all of the seasoning is artificial and heavy-handed (and is THE BIGGEST SCAM OF ALL TIME).That’s why I’m planting a sunny yellow flag in favor of popcorn cookery, and I want you to know exactly how to summit this snackfood mountain. That's right: I'm going to teach you how to make stovetop popcorn. And nothing will ever be the same.First up: Get yourself some popcorn kernels. Even if you spring for organic, which is entirely optional, popcorn is very inexpensive, generally less than $1 for a 4-ounce portion, whereas store-bought will set you back $4 for the same amount. You will also need cooking oil (extra-virgin olive oil is my fave, but peanut, canola, grapeseed, and vegetable will all work) and kosher salt. If you want to season it my way—which I highly recommend, though I'm obviously biased—go ahead and pick up a canister of nutritional yeast and some crushed red chili flakes (ideally Aleppo pepper, but you can make it happen with regular ones). The combination of these ingredients adds up to a cheesy-spicy flavor dust for the popcorn that challenges the dominance of Nacho Cheese Doritos.To make the popcorn, you need a cooking vessel with a lid that offers room to grow. The popcorn is going to multiply in volume dramatically, and it needs empty space to hurtle into. The lid keeps it from ricocheting all over your kitchen, although that is a fun party trick. You also want to use a pot with good heat conductivity. A large Dutch oven is ideal, but a heavy duty stockpot will do in a pinch.A enameled Dutch oven is the best tool for the job.\nPhoto by Chelsie CraigGrab your olive oil. For ½ cup popcorn kernels—a decent amount for 4 normal popcorn people or 2 insane popcorn eaters—add 3 Tbsp. of oil to the pan. Yes, it seems like a lot of oil, but without it, steam won’t build up in the pot, and without steam’s concentrated, moist heat, there will be no popping.Put the pan over medium heat, pour in ½ cup popcorn kernels, stir to coat with oil and keep stirring occasionally until the kernels start to sizzle. Put the lid on the pan and nudge the dial halfway between medium and medium-high. Don’t go anywhere! Soon, but not too soon, popping noises will emanate from the pot. After that’s been happening for a minute or two, pick up the pot with the lid closed and shake it up and down. This is to prevent the dreaded scourge of unpopped kernels—you’ll hear them clinking around in there. Let the popping continue, but if you see any tendrils of smoke escaping from under the lid, immediately lower heat to medium.When the pops have subsided to an eruption every couple of seconds, turn off the heat. Set the lid askew so that some steam can escape, because soggy pops are an abomination. After a minute of steam release, pour the popcorn onto a rimmed baking sheet, or your biggest, widest bowl. Immediately drizzle ¼ cup olive oil all over the popcorn. This needs to happen while it’s still hot, and then you have to toss thoroughly and with intention to coat the kernels with oil. When they’re glossed up, sprinkle nutritional yeast, chile flakes, and kosher salt overtop liberally, then toss vigorously to disperse it. If you're more of a melted butter person, or want to add grated cheese or lots of pepper or what have you, you should feel free to do you. The important thing to remember is that you need to add the fat—olive oil, coconut oil, butter—first, then add anything dry—spices, salt—and toss, toss, toss, otherwise the dry bits won't have anything to stick to.You might find yourself eating more popcorn than you ever have before. You might find yourself making popcorn on the regular, now that you know how to do it, and have experienced first-hand how much better the homemade stuff is. You might like to know that popcorn is a whole grain, and that this whole plant-based endeavor might even be good for you. As they say, knowing is half the battle, and as long as we’re conquering popcorn, I stand with you.More It's That Simple, right this way:How to Make Homemade Cold Brew and Save Yourself a Whole Bunch of $$$If you thought you couldn't make cold brew coffee at home, think again.View StoryExplore Bon AppétitBasicallySnackIt's That SimpleCornRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-08", "author": ["Condé Nast", "Carla Lalli Music"]}