{"id": "e2ebd62cbbd030c3f46851b3a7267302", "url": "https://www.bonappetit.com/recipe/hojichai", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Hōjichai Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueHōjichaiBy Julia MomoseDecember 1, 20204.0(6)Read ReviewsTriangleEmailPinterestPrintPhotographs by Yudi Ela, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“I originally created this as a nonalcoholic pairing for a dessert course,” says Julia Momose, creative director, Kumiko, Chicago. “The roasted, earthy notes of the hōjicha (roasted green tea) carry the warming toasted baking spices for a comforting low-caffeine wintertime brew. Now I make this for my husband and myself at home all the time. I love it with shortbread cookies and coffee cake in the morning or with ice cream at night. My parents are back home in Japan and I sent my mom this recipe for a gathering they had last year. She made a big batch and kept it warm in the CrockPot for guests to serve themselves. There’s no situation where this wouldn’t be good.” Momose likes to buy her hōjicha from kettl.co and rareteacellar.com.IngredientsMakes 27green cardamom pods5star anise13\" cinnamon stick1tsp. pink peppercorns¾cup (8 grams) hōjichaHoney, sugar, or molasses (for serving)special equipmentA mortar and pestlePreparationStep 1Preheat an oven to 350°. Lightly crack cardamom, star anise, cinnamon, and peppercorns with a mortar and pestle (cardamom seeds should be fully exposed). Spread out on a baking sheet and toast until fragrant, 5–7 minutes.Step 2Transfer spices to a small saucepan and pour in 2¼ cups water. Bring to a boil over medium heat. Remove from heat immediately. As soon as water settles, add hōjicha and let sit 2 minutes. Strain through a fine-mesh sieve into a heatproof measuring glass; discard spices. Divide between mugs and sweeten as desired.How would you rate Hōjichai?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleHow much dry tea to add to recipe.  is it 3/4 cu brewed or dry tea.\n\nthanks geneAnonymousBowie, MD12/17/2020Question:  Does one really use 3/4 c. of dry tea leaves to make 2 drinks?  That is a lot of tea!  Thanks for letting me know.Food&Drink12/12/2020Explore Bon AppétitHot DrinkDrinks AllGreen TeaAlcohol & Other DrinksCardamomHerbs & SpicesWinterQuickEasyDrinksDairy-FreeGluten-FreeNut-FreeVegetarianVeganNonalcoholicHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Julia Momose"]}