{"id": "e30cbe2422aae1b0323bedc81d54d74f", "url": "https://www.bonappetit.com/story/ssamjang", "year": 2021.0, "month": 4.0, "day": 5.0, "content": "Korean Ssamjang Is My Favorite Condiment (Don't Tell the Others) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSsamjang Is My Favorite Condiment (Don't Tell the Others)Spicy, intensely savory, slightly sweet, wholly umami.By Joy ChoApril 29, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Walk into any Korean barbecue restaurant and among the slew of banchan, you’ll notice a dark red, slightly chunky, pastelike sauce offered on the side. Though the main attraction at these meals is usually the meat, the experience wouldn’t be the same without the unassuming yet uber-flavorful seasoned soybean paste called ssamjang.So what is ssamjang?More of a dipping sauce than an “incorporate-into-cooking” sauce, ssamjang in its most basic form is a mix of doenjang (Korean fermented soybean paste), gochujang (Korean red chile paste), sesame oil, sesame seeds, garlic, and sweetener (honey, sugar, and cooking syrup called yoridang are a few options). Spicy, intensely savory, slightly sweet, and wholly umami, the paste cuts through the richness of food much like kimchi provides welcome acidity to everything from stews to mac and cheese. Ssamjang’s potency means a little goes a long way.Ssamjang literally translates to “paste for wraps,” alluding to its traditional use as a condiment to add to ssam when wrapping protein and rice in leafy vegetables (or sometimes seaweed/kelp). But its applications are wide-ranging: It can easily be mixed into bibimbap or gyeran bap for a hit of savory flavor, thinned with mirin for a punchy dip for a whole lineup of vegetables (carrot sticks, bell peppers, crunchy romaine leaves, and raw or blanched broccoli, to name a few), or even dabbed on foods like frittatas or dumplings to perk things up. A few months back, I wrapped rice in steamed cabbage with a spoonful of ssamjang—the sticky rice and natural sweetness of the cabbage contrasted perfectly with the salty, assertive ssamjang. *Drool emoji*Where to buy ssamjang: You can find ssamjang by the (green) tub in Korean grocery stores, usually next to other pastes like gochujang and doenjang, and online. If you don’t love spice, opt for a ssamjang labeled “mild”; otherwise, pick a brand that catches your eye and go for it—on the whole, store-bought options are fairly similar across the board. Regardless of the one you choose, you can adjust it to your taste: Add sesame oil and honey to temper the saltiness, minced garlic or chopped green onions for freshness, or even canned sardines for a pleasant brininess.And how to make it yourself:Or, if you have the ingredients on hand, make ssamjang at home. Adapted from this recipe, my barebones version uses just five ingredients: 2 Tbsp. doenjang (I’ve found that white miso also works well), 1 Tbsp. gochujang, 2 ½ tsp. toasted sesame oil, 2 ½ tsp. honey, and 1 clove garlic, minced. Simply mix the ingredients in a bowl, adjust to taste, add any mix-ins (toasted sesame seeds, diced onions or chile peppers, and even diced nuts are all fair game), and transfer to an airtight container. Depending on your choice of mix-ins, your homemade ssamjang will keep in the fridge for several days and up to two-ish weeks.Ssamjang’s savory, bold, complex flavor profile makes it an excellent addition to your fridge’s condiment collection, not just an occasional dip to enjoy at Korean barbeque restaurants. Whether you smear it on meat, use it as a dip for your favorite veggies, or wrap it up with rice in steamed cabbage leaves (no, I won’t stop talking about this), you’ll discover that ssamjang is so versatile it just might become your new favorite condiment. (I won’t tell the others.)Get a tub!Photo by Isa ZapataSEMPIO Samjang Seasoned Soybean Paste$6 at Asian MartJoy Cho is a freelance pastry chef and writer based in Brooklyn.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-29", "author": ["Condé Nast", "Joy Cho"]}