{"id": "e32321cf7211987b73225f1294ccc376", "url": "https://www.bonappetit.com/recipe/collard-green-wraps-with-curried-tofu", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Curried Tofu Wraps Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueCurried Tofu WrapsBy Molly BazJuly 10, 20185.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintStore-bought curry pastes come in varying degrees of spiciness, even if their labels all say the same thing. If the cooked tofu isn’t as hot as you’d hoped, amp it up by tucking a slice or two of Fresno chile into your wrap.Ingredients4 servings 5scallions4garlic cloves, finely grated12\" piece ginger, peeled, finely grated1Tbsp. virgin coconut oil or vegetable oil2Tbsp. Thai red curry paste114-oz. package firm tofu, drained, broken into 1\" pieces1cup unsweetened coconut milkKosher salt1Tbsp. fresh lime juice1Fresno chile, thinly sliced (optional)1bunch collard greens, leaves halved lengthwise, ribs and stems removed, covered, chilled½cup cilantro leaves with tender stems½cup Dang Original coconut chips or toasted unsweetened coconut flakesLime wedges (for serving)PreparationStep 1Remove dark green tops from scallions and thinly slice on a diagonal. Place in a small bowl, cover with a damp paper towel, and chill until ready to serve. Thinly slice remaining white and pale green parts crosswise and place in another small bowl; add garlic and ginger. (Have scallion mixture, curry paste, tofu, and coconut milk near the stove and at the ready so you can work quickly.)Step 2Heat oil in a large skillet over medium-high. Cook scallion mixture, stirring, until just beginning to brown, about 1 minute. Add curry paste and cook, stirring, until it begins to stick to pan, about 1 minute. Add tofu and coconut milk, season with salt, and bring to a simmer. Reduce heat to medium-low and simmer gently until sauce is almost completely evaporated and you can see the bottom of skillet, 5–7 minutes. Stir in lime juice.Step 3Transfer tofu mixture to a platter and top with chile, if using. Arrange collard greens, cilantro, and reserved scallion tops on platter so that each component is visible and easily accessible. Place coconut chips in a small bowl and arrange lime wedges on a small plate.How would you rate Curried Tofu Wraps?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI really liked this.  I browned the tofu in the pan before making the sauce for a little more texture then incorporated it back in to soak up the flavors.  Seems like it'd be a little soggy without doing that. I also used lettuce instead of collards. The tofu would be good in noodle bowls, salads, and more if you didn't feel like wraps.cassidy.haightRichmond, VA7/12/2019These were great! Perfect for a light (but filling) summer meal. I got spicy curry paste and loved it.AnonymousLos Angeles4/3/2019Explore Bon AppétitWrapTofuOther IngredientsCollard GreensLeafy GreensVegetableCoconutFruitQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeVeganVegetarianHealthyishSimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Molly Baz"]}