{"id": "e32c33c3c469577cafd055d9c8f65d94", "url": "https://www.bonappetit.com/recipe/spicy-lightly-pickled-cucumbers", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Spicy Lightly Pickled Cucumbers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueSpicy Lightly Pickled CucumbersBy Andy BaraghaniNovember 20, 20184.4(35)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWhat raw cucumbers lack in cheer, pickled cucumbers make up for in zip, zing, and crunch. The brine can work with any crunchy veg, but we like them best with cucumbers. We guarantee they'll be the sleeper hit of your next party spread.Ingredients8 servings2lb. medium Persian cucumbers (about 12), cut lengthwise into spears¼cup white wine vinegar or unseasoned rice vinegar1tsp. sugar¾tsp. crushed red pepper flakes2tsp. kosher salt, plus more2Tbsp. chopped dill2Tbsp. fresh lemon juicePreparationStep 1Toss cucumbers in a large bowl with vinegar, sugar, red pepper flakes, and 2 tsp. salt. Chill, tossing once, at least 1 hour and up to 6 hours.Step 2Just before serving, add dill and lemon juice and toss to combine. Taste and season with more salt if needed.How would you rate Spicy Lightly Pickled Cucumbers?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleLove this simple recipe. Perfect fresh crispy cucumbers to serve with holiday dinners.K. JonesLos Angeles1/2/2022Great recipe! It was a star of last dinner party. Easy to make and with interesting tasteAnonymous12/6/2021Finally, something new and tasty to do with cucumbers. We had this recipe for our vegetable last night along with Pork Loin and mashed potatoes. It was spicy and much better than any pickle I have had.Maureen BrinkerhoffEugene, OR8/26/2021easy and good\nMargynj8/26/2021Excellent!  I used 1 lb kirby's.  Added dill seeds and dried pepper pods to make spicy.  So easy, will make many more times.  Addictive!AnonymousNew Haven, CT8/4/2021These are delightful, fresh, and delicious, however, they would be improved with a couple of crushed cloves of garlic thrown in.  9/15/2020Incredible pickles. This recipe is simple and quick... I have made it twice in two days. My boyfriend and I devoured the first batch in one day... they are amazing. I am going to keep making them to have on hand and to snack on. Highly, highly recommend!lilykatshoreFayetteville, Arkansas5/18/2020This was such a simple recipe/procedure - makes me wonder what took me so long to make my own pickles! Mine kept in the fridge for a while until we ate them all (about a week) AnonymousBoston, MA5/6/2020PLEASE warn people about the anchovies.  I am intolerant of fish and seafood and I would not die, but I would lose three days if I ate this.  \nWe'll try without the anchovies or offer at the end.\nAnonymousSouth Carolina12/27/2019These were so good and so easy!  I didn't see a video as some people mentioned, I let mine sit for 5 hours before a party and they were perfect.  Seriously, everyone loved them and there were none left.  Delish and a nice contrast to some of the heavier apps at holiday get togethers.  Will def make again (probably all the time)!Anonymous12/24/2019Not sure where any of you see a video, but this recipe is SOOOO easy why would you need one. The recipe does not say 10 days (hmm...perhaps the video wherever it is says 10 days). It says 1 hour, up to 6 hours. It is called LIGHTLY pickled and having made them I know that 1-6 hours is enough time to achieve this. I think they would be mushy or rubbery by 10 days. 1-6 hours keeps them crisp and lovely. I made them when the recipe was 1st posted. Then made them again and again! I couldn’t stop eating them! Similar to a recipe I kept making last summer. I love them all!Ferment4LifeHalifax, Nova Scotia, Canada6/22/2019MMMMMMM! says there's a video.  Where is it?  soak 10 days v. soak 6 hrs. -- it's a HUGE difference.  supposedly recipe and video aren't the same, so i need to see the video, because the recipe seems a bit ... too briefly pickled.  i'm leaning towards 10 days, not 6 hrs.hollis5Vero Beach, FL3/1/2019Can’t wait to try these! Love me a good pickle! Be sure to watch the video, as it is completely different than the recipe! Soak 10 days vs. 6 hours!? Well, I’m sure they both taste great! I’m inspired! Mmmmmmm!CA2/25/2019These were great! We ate them for the Superbowl and they were an easy bright addition to a carb and cheese heavy meal. I only had an hour to let them marinate so I left them at room temp and tossed every 10 min. AnonymousFlorida2/19/2019Oh honey. You need to come South. You have totally missed the point of pickles 😘AnonymousCenter Star, Alabama 2/19/2019Explore Bon AppétitPickleCondimentCucumberVegetableEasy5 Ingredients or FewerSnackStarterVegetarianVeganDairy-FreeGluten-FreeNut-FreeKetoHealthyishPickle and PreserveFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Andy Baraghani"]}