{"id": "e333e0448160f5804b875b21d5e62a05", "url": "https://www.bonappetit.com/story/garlic-fried-rice", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "I Could Eat an Entire 4-Serving Platter of This Garlic Fried Rice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Could Eat an Entire 4-Serving Platter of This Garlic Fried RiceBeware: It is seriously addictive.By Emma WartzmanOctober 18, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie TheodorouFacebookTwitterEmailOn the most recent episode of the Bon Appétit Foodcast, which was devoted to all things garlic, editor in chief Adam Rapoport declared there was one mistake in our recently published garlic primer from the October issue. The Garlickiest Fried Rice, he explained, was definitely one portion—not four. His exact words: “I would house that plate.” Having made it myself, I can safely say that while he is technically incorrect, he is not wholly out of line. I had to apply some serious self restraint in order not to do exactly that.You start by making crunchy, golden, fried garlic chips, a pure genius condiment—seriously, just try not to eat them all the moment you pull them from their hot, glistening oil. But Andy Baraghani, a very smart man and the mind behind the recipe, knew their purpose was twofold: To be an addictive topping with countless applications beyond this particular dish, and a necessary byproduct on the path to a garlic-infused oil used to cook everything else that goes in the dish. This way, garlic makes its aromatic, slightly spicy way into every single bite, taking the recipe from garlic fried rice to the garlickiest fried rice.So good, you could eat ’em straight.\nPhoto by Alex LauAfter the chips, you’ll sauté some ginger, scramble an egg, then dump some day-old, dried-out rice into the pan. (Those adjectives are important: “day-old” and “dried-out” mean the grains get properly crispy.) Toss in some scallions for bite, which will wilt and mellow just enough, and then lay it all out on a platter. Your work here is done after a scattering of chopped cilantro (for freshness), toasted sesame seeds, and, of course, the fried garlic chips. We won't tell if you cancel plans and feed yourself straight from the bowl.Get the recipe:The Garlickiest Fried RiceCrispy fried garlic on top, garlic oil leftover, and rice fried up in all of it. Garlic heaven.View RecipeExplore Bon AppétitGarlicRiceWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-17", "author": ["Condé Nast", "Emma Wartzman"]}