{"id": "e3588784dc51c002e56d99a712150f0f", "url": "https://www.bonappetit.com/recipe/lemony-glazed-cake-doughnuts", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Lemony Glazed Cake Doughnuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesLemony Glazed Cake DoughnutsBy Chris MoroccoMay 15, 20194.8(53)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintWe set out to make a sour cream doughnut, we really did. We tried and we tried, and when it wasn’t working, we switched to Greek yogurt. Adding yogurt to the batter for these cake doughnuts made them light, tangy, and rich, and gave us a dough that was easy to work with. Have we all been calling them yo-nuts ever since? Yes—and we’d like it if you did too.IngredientsMakes 82½tsp. baking powder2cups all-purpose flour, plus more for dusting1tsp. kosher salt, plus more2large egg yolks1cup whole-milk Greek yogurt½cup granulated sugar2Tbsp. unsalted butter, melted, slightly cooled1tsp. vanilla extractVegetable oil (for frying; 6–8 cups)1cup powdered sugarZest from ¼ lemonSpecial EquipmentA deep-fry thermometerPreparationStep 1Whisk baking powder, 2 cups flour, and 1 tsp. salt in a medium bowl to combine.Step 2Whisk egg yolks, yogurt, granulated sugar, butter, and vanilla in a large bowl until smooth. Mix in dry ingredients with a spoon or rubber spatula until dough comes together and is smooth with no spots of flour remaining.Step 3Turn out dough onto a well-floured sheet of parchment or waxed paper (you can be generous with the flour since you’ll brush off excess later). Dust dough with more flour, place another large sheet of parchment or waxed paper over, and roll to ½\" thick. Remove top sheet of parchment and brush off any excess flour with a dry pastry brush.Step 4Punch out circles about 3½\" in diameter with a biscuit cutter, large glass, or mug. Punch out centers from dough about 1\" in diameter with a small biscuit cutter or bottle cap (or poke a hole with a chopstick, then gently pull open to widen the center hole). Reroll any scraps and punch out additional doughnuts and holes.Step 5Fit a large pot with deep-fry thermometer and pour in oil to a depth of 1½\". Heat over medium-high until thermometer registers 350°. Fry doughnuts, turning once, until puffy and browned (somewhere between golden brown and mahogany), about 2 minutes per side (time will be slightly less for doughnut holes). Transfer to a wire rack and let cool 10 minutes before glazing.Step 6While doughnuts cool, whisk powdered sugar, lemon zest, a tiny pinch of salt, and ¼ cup water in a small bowl until smooth. Dip each side of doughnut into glaze, letting excess run off before returning to rack. Eat as soon as you can’t stand the suspense anymore.How would you rate Lemony Glazed Cake Doughnuts?Leave a ReviewTell us what you thinkReviews (41)Back to TopTriangleThese are so delicious and easy to make. I'm adding them to our breakfast menu ay our BnB--what a great way way to start your day!Paula--Villa ValentinaLevanto, Italy2/17/2021These were very quick, light, fluffy and delicious! I used the two whole eggs and needed to add about half a cup more flour to the dough, and then really flour the parchment paper and top of the doughnuts very well (the excess flour brushes off very easily). The icing was a bit thin when I coated the first one, so added more sieved powdered sugar and that worked fine.  Will definitely do these again!StuSydney, Australia2/10/2021As usual, Chris Morroco delivers on a recipe that is perfectly balanced, realistic and fail-proof.. It’s almost like he actually cooks at home in a tiny normal person kitchen with kids and laundry to fold. Made on a whim this morning. \nThey’re gone now and have earned a permanent home in the rotation.  I’m an experienced cook and usually shop around a few recipes before I make it official that “ I can make X”. No need here. We’re all good with this one. Perfect donut base to play with fun glazes and toppings.  michelle MorganConnecticut9/27/2020Followed the recipe with two yolks (figured the recipe was tried and tested many times before publish). Super delicious result! The video was helpful to follow the rolling method. Made most with the recipes lemon glaze, then did a couple with a vanilla bean glaze (added milk instead of water to mixture, and vanilla bean paste) WOW, that was super good! Overall a successful and tasty experience! AnonymousAstoria, NY8/23/2020These were Sooooo Good! Followed the recipe as written (not as in the video) [used 2 yolks.]  I didn’t find the dough overly sticky as many mentioned. I didn’t really even need the top parchment to roll it out. Used a pastry brush to remove all flour once doughnuts were cut. Also a good tip to remove all flour before re-rolling. \nMade sure oil was at 350° before frying and they fried up golden and crispy. \nGlazed with 1 cup icing sugar, juice and zest of one lime and 4 finely sliced leaves of lemon verbena - This brought them to next level. \nMy first time making donuts. Easy and fun for myself and my 4 yr old son. Highly recommend this recipe. \nAnonymousToronto 7/13/2020I followed the recipe exactly and they turned out perfect! It’s good to watch the video too because there are extra tips - like brushing off flour when re rolling the dough and preheating your oil (maybe that’s obvious but I’m a novice at frying). They’re cooling right now, can’t wait to try them!! AnonymousToronto,ON6/12/2020I just finished making these! I decided to follow the video instead of the above recipe given the discrepancies (whole eggs vs yolk and adding sugar into wet vs dry ingredients). Mine turned out great! I was surprised how quickly these came together. I didn't have any issues with the dough being too wet to work with as some have mentioned. I just made sure to over-flour my surfaces and dust off the extra as Chris does in the video. AnonymousDenver, CO6/5/2020This is a superb recipe, thank you! I substituted Arthur King Flour's measure for measure to make it gluten-free and it worked great! I would happily make this every weekend :)gmheneghan2883Minneapolis, MN5/24/2020Could BA post weights on future recipes? Volume, especially for baking, can be innacurate. AnonymousCaldogno, Italy5/18/2020Had to balance my son's veggie smoothies with something wholly indulgent--and that's where these doughnuts came in. They. were. perfect. So if this recipe didn't come out as expected, you effed something up. I probably got about a dozen doughnuts plus holes out of this recipe, but if I had doubled it, the tray would still be empty now. Thank for another smash recipe, Chris.laureen boninPortsmouth, RI5/17/2020This is such a great basic doughnut recipe. SO much faster than BA's delicious but fussy apple cider doughnuts that have to chill for 3 hours. \n\nIn an attempt to impart some lemoniness to the dough (not just the glaze), I added lemon extract, zest, and two bags of my favorite lemon herbal tea. The result was a subtle lemony cake, so I call that a win! Since the doughnut was now lemony, I put ginger in the glaze instead of zest for a little contrast. Totally awesome, would make again. MissMystraAustin, TX5/16/2020I love Chris too much to leave a bad review- but I must warn some people about how difficult it is to work with the dough. And so I will also be leaving some tips on what helped make it more manageable to work with.\n\nThe dough was IMPOSSIBLE to work with even after adding 1/4 cup more flour and being VERY generous with the dusting. I am quite a seasoned baker and am very sure I got all the other measurements right. (including the proper way to measure a cup of flour!) \n\nCould not work with the dough AT ALL. After adding more flour, and ~finally~ being able to roll it out, 1. I couldn't cut it out in shape 2. had to oil my doughnut cutter 3. after getting very ugly shapes, i couldn't even get it off the parchment into the oil!\n\nSome tips for those who might need it: \n- Work with a bench scraper to mix the dough as you add in more flour because it gets very sticky. I tipped it onto my mat and decided it still needed more flour but couldn't get it back into a bowl to mix. So I used my bench scraper and mixed it with more flour. Worked out great without creating a mess!\n\n- Managed to salvage it by scraping everything into a piping bag and piping them into the oil directly. Came out as little balls/ovals. (If anyone needs this tip, use it! Worked great!)\n\nThe taste is lovely (and I would reckon without the additional flour, would've been even lighter and more fluffy). Mine came out quite cakey, I suspect due to the additional flour. But they tasted nice and had a nice tang to it. Anonymous5/15/2020Such an easy recipe to follow and make. The dough can be little sticky but adjusting the flour to your own liking is not that hard. Everything about these doughnuts will make you happy. A must try for everyone. Thank you, Chris! You're a gem.Anonymous5/7/2020So light and fluffy! I saw this recipe in the magazine and was instantly excited. I followed the recipe for the dough as closely as possible while doing a dairy free sub: vegan butter for butter, goat yogurt for Greek. I found that the dough was very wet with 2 cups flour and added about 1/4 c more; even then, I had to pat the dough with excess flour before and throughout rolling and cutting. I made 12 3-inch donuts, using a 3/4” pastry tip for the holes. They came out amazing, with craggy old-fashioned like bottoms and smooth tops. DELICIOUS. Beautiful. Like some other reviewers I thought that the lemony glaze should be more lemony and used about 2.5 Tbsps lemon juice in addition to the zest, and then added more powdered sugar and water as necessary until I got a thick glaze. Would definitely make again! I plan to save this dough as a base for other flavors. AnonymousRedmond, WA5/3/2020These. Were. Amazing. I hadn’t ever made donuts before- and Chris was right, they are so easy to make! The insides were soft and fluffy while the outsides I let crisp up a little bit. And the glaze was awesome. Love a little lemon glaze. Make sure the yonuts are cooled before adding! crkraeling6271Kansas City 5/3/2020Explore Bon AppétitDoughnutDessertSnackNut-FreeFryBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-15", "author": ["Condé Nast", "Chris Morocco"]}