{"id": "e35c983fdff75b5205e33be298e82822", "url": "https://www.bonappetit.com/story/burgers-and-meditation-can-in-fact-carve-a-path-for-wellness", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "Burgers and Meditation Can, In Fact, Carve a Path for Wellness | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredBurgers and Meditation Can, In Fact, Carve a Path for WellnessBy KeVitaSeptember 1, 2019FacebookTwitterEmailFacebookTwitterEmailJesse Israel wants people to know that you can lead a lifestyle of both practicing meditation and enjoying cheeseburgers. He’s living proof, and recommends pairing that cheeseburger with something light and uplifting, like his go-to KeVita Master Brew Kombucha Raspberry Lemon. It’s a refreshing tidbit from this keeping-it-real entrepreneur who’s led some of the largest meditations in the world. It really is all about balance.While meditation wasn’t always his jam, he’s always appreciated a good burger. Israel was a sophomore at New York University when he and his roommate started managing a musical act. By graduation, the band was award-nominated and a global sensation, and he was soon running Cantora, a major record label that he co-founded in 2005. That’s when he began suffering from debilitating anxiety and panic attacks.During this time, Israel resorted to internet-sourced meditation techniques to cope, simply because meditation classes weren’t as popular as they are now. “When I was 29 and had a regular practice, I found a deep calling to move on from my business and start exploring new things.”This eureka moment began with what he calls community experiments: the first being a “cheeseburger club.” It started with a group of guys who would meet for beer and burgers. “It became a support group for 10 of my closest friends, and a place for us to talk about real stuff that we didn’t always have permission to talk about. It was a sense of small community that I didn’t have,” says Israel and adds, “It was the first time I got a taste of the power to be yourself and be supported and heard.” They called themselves the Burger Boys and the group expanded to Europe and Los Angeles. Soon thereafter, in 2013, a new community experiment began during a casual bike ride with 18 friends from the music industry. “We went on a slow cruise to Coney Island, went on the Cyclone roller coaster, and when we came back, the sun was setting and we decided to become a bike club and called ourselves the Cyclones.” 40 people joined the next ride and by the end of summer, the Cyclones consisted of hundreds of people. Through this Israel learned to conquer his fear and anxiety of public speaking by literally leading bike rides and leaning into the community experience he helped to create.“When I left Cantora I didn’t know what I wanted to do next, but I knew I wanted something with similar values of community experience.” As it turns out, it was another group—this time a meditation club that he called Medi Club: a group of 20 folks who gathered in a friend’s loft apartment to meditate. “It was amazing but also awkward,” he said because the room was filled with a bunch of successful people who’d never been together in silence. The result? Sharing real-life experiences and feelings and Israel’s realization as to what he’d do next. Within four or five months, there would be 100 people jammed into the loft.This led to The Big Quiet, his mass meditation movement. It began in June 2015 at a Central Park outdoor music festival held in Rumsey Playfield where tons of New Yorkers showed up for a big quiet experience. “I was terrified but it was a huge part of what I was meant to do, and I’ve since dedicated myself to this work.” It was this very moment when his music career and new passion came full circle. He’s since performed in a jam-packed arena, lead the first meditation at the World Trade Center Oculus, and organized a session under a giant blue whale in a museum.Today, Israel brings his expertise to Fortune 500 companies where he helps people understand that by ushering self-care into their personal lives, you can then weave it into your corporate culture. After his talk, he’ll lead a guided meditation with the group, and for longer sessions, he works with human resource teams to dedicate a conference room for meditation. “If a corporation is willing to invest this time, it will change their corporate culture and how they reach their customers; it’s so powerful.”At this point, when he’s not teaching the importance of self-care to professionals, he’s practicing a modern version himself, where balance and burgers aren’t off the table. With a KeVita Master Brew Kombucha Raspberry Lemon and confidence in his authentic and relatable true-self, Israel feels that he can try something new that makes him feel alive. Mornings begin with meditation, exercise, and work. He might indulge in one of those burgers he loves for lunch, and because of the whole balance thing, Israel will later meditate in his co-working space where hundreds of people are milling about. “I’ll still eat cheeseburgers and l love rap. I think of meditation as a modern lifestyle, not my lifestyle.” His self-care extends into what he calls his “J Night.” He explains, “I take an epsom bath, put on a face mask and stream some shows or read.” Now that’s refreshing.The information in this article is the opinion of the author(s) and in no way reflects the policies or positions of KeVita. This is not intended to be a substitute for professional medical or nutrition advice.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-01", "author": ["Condé Nast"]}