{"id": "e37707b46bee1f737dfdacb34964df12", "url": "https://www.bonappetit.com/story/the-five-sauces-every-home-cook-should-know", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "The Five Sauces Every Home Cook Should Know | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredThe Five Sauces Every Home Cook Should KnowWhile it’s true that the secret’s in the sauce, it’s also in the sauce pan.By All-CladNovember 26, 2018FacebookTwitterEmailFacebookTwitterEmailBehind every good culinary tradition is a great sauce: simple in theory, but so precise, they often require patience and practice to master. While French chef Marie-Antoine Carême is recognized as the first to identify four sauces as the foundation of culinary basics, it was French chef Auguste Escoffier who added hollandaise, to what became known as the “five mother sauces” when he published them in recipe form in his Le Guide Culinaire in 1903.It’s no surprise that some of the world’s top chefs, like Thomas Keller, Hugh Acheson, and Paul Kahan all use sturdy, reliable All-Clad pots and pans in the kitchen. The brand's reputation for even heating, durability, and craftsmanship make them an obvious choice, especially when a delicate roux is at hand. With gorgeous All-Clad sauce pans and sauciers at the ready, learn how to make the five most essential sauces in the culinary game, and impress all your friends at your next dinner party.HollandaiseThis creamy yellow sauce appears to be quite simple–its only ingredients are egg yolks, lemon juice, water, salt, and butter. In reality, however, it's a process to master, as the key lies in the timing and the whisking. If it was up to Thomas Keller (take it away, Tom!), he’d prefer to make his hollandaise straight out of a saucier. We recommend the c4 Copper 2.5 Quart Saucier. The eggs can be whisked into a condensed surface area, allowing for a nice emulsion. Once you’ve perfected your hollandaise, serve it with everything from eggs to asparagus to artichokes.EspagnoleThis brown sauce is often paired with meat dishes like roast lamb or as the base of a beef bourguignon. A rich, flavorful espagnole starts with browned mirepoix (carrots, celery, and onions), brown beef or veal stock, and fond (deglazed brown bits) from beef bones. From there, tomato purée or paste is added, and the whole sauce is thickened with a dark brown roux. A sturdy 3-quart pan like the c4 Copper 3-Quart Sauce Pan is optimal for consistent, even heating.BéchamelWhile all the mother sauces have a distinct decadence about them, béchamel may very well be the most mouthwatering of the group. You know it as the sauce that takes your macaroni up a notch, or as the secret weapon in your latest lasagna. And like the other four, this creamy white sauce has basic ingredients: butter, flour, milk, salt, and pepper (though we add Parmesan, cayenne pepper, and nutmeg to ours for a flavorful twist). Craft the sauce in a medium to large saucepan, like the 2-Quart Stainless Saucier which with its wide mouth and curved sides, allow for good mobility while whisking and adding ingredients.VeloutéWhile velouté is a flavorful sauce in its own right, often served over poached or steamed fish or chicken, it's also often used as a building block to gravies and other mixtures like bisque or pot pie. It starts with a white roux, and is then mixed with a light stock from fish, chicken, or veal, making it an easy addition to rich-in-flavor recipes. Use the c4 Copper 2-Quart Sauce Pan to make a large batch and keep on hand, so the next time you need to whip up a comfy, cozy chicken pot pie, you’ve already done half the work.Sauce TomateYou don’t have to stroll the aisle at your local grocery store to know that there are about a million iterations of tomato sauce. Traditionally, however, tomatoes would be simmered with onions and garlic, and cooked down until thickened to one’s liking, or with a roux. The classic French version, sauce tomate, is also flavored with pork and aromatic vegetables. Because of its versatility, we say skip the small saucepan and whip up a big batch with the Stainless 5.5-Qt Dutch Oven. You can freeze what you don’t immediately eat—and voila! Old World meets New in a matter of minutes.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-26", "author": ["Condé Nast"]}