{"id": "e386cd9c6692d5de59a038d09098416a", "url": "https://www.bonappetit.com/recipe/mala-beef-broth", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Mala Beef Hot Pot Broth Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueMala Beef Hot Pot BrothBy Eric SzeFebruary 8, 20225.0(2)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintSpicy, tingly mala broth, which gets its inimitable sensation from a mix of chiles and Sichuan peppercorns, is on the menu at most hot pot restaurants. Each step in this homemade version from chef Eric Sze—toasting the spices, frying the chili bean paste and aromatics, gently boiling the broth—requires a small investment of time and love, but the payoff is huge. “Broths are the building blocks of your hot pot,” Sze says, and as you dip in umami-rich additions like mushrooms and meat, its flavor will only get richer.Read our ultimate guide to making hot pot at home here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonColander$11 At AmazonSmall Skillet$40 At AmazonMesh Sieve$13 At AmazonLadle$27 At AmazonIngredientsMakes about 2½ quarts3lb. 2\"–3\" sections mixed beef soup bones (such as neck, marrow, and/or oxtail)4star anise pods2Tbsp. Sichuan peppercorns15dried chao tian jiao chiles or dried chiles de árbol, plus more for serving2Tbsp. vegetable oil4Tbsp. Pixian chili bean paste2large onions, cut into 2\" pieces3large shallots, quartered1bunch scallions, cut into 3\" pieces1head of garlic, cloves separated, peeled13\" piece ginger, scrubbed, cut into 1\" pieces½cup Shaoxing wine (Chinese rice wine), michiu, or dry sake1oz. white rock sugar or 2 Tbsp. granulated sugar6Tbsp. soy sauce (preferably Kimlan)1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus morePreparationStep 1Place beef bones in a large Dutch oven or other heavy pot; pour in cold water to cover. Bring to a boil, then reduce heat to medium-low and cook 20 minutes. Drain bones in a colander (blanching the bones and discarding the liquid yields a clearer, tastier final broth). Rinse and wipe out pot; set aside.Step 2Toast star anise, Sichuan peppercorns, and 15 dried chiles in a dry small skillet over medium heat, tossing often, until fragrant and peppercorns are beginning to crackle, about 2 minutes. Transfer spices to a plate and let cool.Step 3Heat oil in reserved pot over high. Cook bean paste, stirring constantly, until fragrant and slightly darkened in color, about 2 minutes. Add onions, shallots, scallions, garlic, and ginger. Cook, still stirring, until onions are softened, about 5 minutes. Pour in wine; cook, stirring and scraping up any browned bits, until combined, about 30 seconds.Step 4Return bones to pot; add toasted spices, rock sugar, and soy sauce. Pour in 13 cups cold water and bring to a boil. Reduce heat to medium-low; cover pot and cook, adjusting heat as needed to maintain a gentle boil, 4 hours.Step 5Using a fine-mesh sieve, scoop out solids from broth. Pick out any meat and set aside in a small bowl for serving if desired; discard remaining solids. Stir 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt into broth; taste and season with more salt if needed. Top with more dried chiles.Do ahead: Broth (without topping) can be made 3 days ahead. Let cool; cover and chill, or freeze up to 3 months.Why serve hot pot with just one broth when you can have two? Get the recipe for Eric Sze’s Herbal Mushroom Broth here.\nPhotograph by Jenny Huang, Food styling by Tyna Hoang, Prop styling by Nicole LouieHow would you rate Mala Beef Hot Pot Broth?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis came out great. I didn't have quite enough time to boil the broth for 4 hours, so I settled for 3. We had such a fun time doing hot pot at home, and the broth was really delicious. We saved and froze what was left. We had a ton of veggies (yu choy, Shanghai baby bok choy, lotus root, radish, Napa cabbage, enoki and oyster mushrooms) as well as thinly sliced pork and beef, shrimp, and a variety of fish balls. I would definitely do it again!\n\nEquipment note:\n- I bought an Iwatani butane burner as it's more versatile than the electric induction type (can be used for car camping, travel, etc.). The fuel canisters were inexpensive at my local H-Mart. When it came time to eat, we set it on a sturdy metal sheet pan and kept a window open for ventilation.\n\nIngredient notes:\n- I couldn't get chao tian jiao chiles in time, so I used a few dried japones chiles and a few Thai chiles (I always keep some in the freezer), and that worked great.\n- I had a Japanese brand of spicy bean paste (labeled \"tobanjan,\" you can also look for \"doubanjiang\"). The step where you fry it creates some pretty intense fumes, so make sure you're ventilating well at that point!EricaBoston, MA2/25/2022Explore Bon AppétitDinnerStockTaiwaneseEast AsianAsianBeefMeatSichuan PeppercornHerbs & SpicesChile de ÁrbolChileVegetableLunar New YearMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Eric Sze"]}