{"id": "e38e484a7423b85cd125f6d51065c112", "url": "https://www.bonappetit.com/story/maangchi-big-book-korean-cooking", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "I Want to Be Like Maangchi and Her New Cookbook Taught Me How | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Want to Be Like Maangchi and Her New Cookbook Taught Me HowIt involves bulgogi-style eggplant, and a whole lot more. By Elyse InamineDecember 2, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailI can’t imagine life without a Korean mom. Someone who cuts and peels apples into bite-size pieces for you. Someone who has an endless supply of pajeon and banchan to fuel long nights of cramming for high school exams. Someone who will interrogate you on where you’ve been all this time, even though she knows exactly where you’ve been: studying at a college across the country. Someone who smiles ever so slightly with pride as you tell her about university life, career goals, and a very dormant romantic life—as if she were your actual mom.Even though I’m Japanese, I grew up with a lot of Korean moms in tiny Valencia, California. My friends’ mothers treated me as their own, feeding me and loving me in all their particular ways for years until I decided to stay in New York City to pursue my dream of becoming a ~food writer~. It was then that I first experienced a big Korean-mom-size hole in my life.So I did what people my age do best, and looked to the internet for an answer. This is how I met Maangchi, a.k.a. Emily Kim. Through her eponymous blog and YouTube channel, she taught me how to make pajeon and banchan and everything else I missed back home from within my teensy Manhattan apartment. She was bubbly and quirky—think lots of ;) in the recipe directions and little bits of motherly, do-as-I-say-not-as-I-do advice woven throughout cooking demonstrations: “Use a bigger pot than this,” she instructed in one video, as she divided her frying chicken into smaller batches. But I, and millions of other people, didn’t just go to Maangchi for recipes: We turned to her YouTube channel or posted comments on her blog to feel connected to the Korean culture we grew up with or missed out on, and yet longed for all the same. Yes, she’s been hailed as the “Korean Julia Child” by the New York Times, but everyone who’s a fan just calls her their mom.Maangchi’s “vegetarian bulgogi,” stir-fried eggplant spiced with gochugaru, soy sauce, and onions\nPhoto by Laura Murray, food styling by Yekaterina BoystovaA few years ago, Maangchi published her first book, which I have now lost after lending it to friends. She didn’t think she would publish another—“So much work!” she told me over the phone—until her editor came to her with an idea for another cookbook. This would be bigger. It would go beyond the basics of Korean cuisine and explore things that intrigued her, like temple food (“They don’t use garlic or ginger, so how do you make it tasty?!”) and lunch boxes (“I’ve made this for my family for decades!”).My copy of Maangchi’s Big Book of Korean Cooking is already stained and dog-eared, and it only came out in October. That’s because, while I’ve experienced first-hand the joy of having multiple Korean moms in my life, this book taught me the joy of acting like one. There is a buoyant kind of satisfaction you get in cooking for the people you care for, but Maangchi takes it to another level. Make the smoky anchovy-radish-kelp stock and you’ll see. Maangchi says to save the broth-bloated radish and kelp for a quick stir-fried snack. When my husband, a classic kitchen lurker, wandered over, I gave him the treat instead of admonishing him to wait just 10 more minutes for dinner. Here Maangchi doesn’t just teach you how to cook Korean food for the people in your life, but how to inject surprise and a little bit of fun to show them just how much you enjoy doing it.She really breaks it down.\nPhoto by Laura MurrayRecently, I got my chance to do my best Maangchi impression, when a close friend underwent surgery and requested Korean food to help her recover. So I flipped open the book and followed the internet’s Korean mom. I tore dough into thin, ragged pieces for kimchi sujebi, a fortifying soup with kimchi and that delicious anchovy stock. I simmered soft tofu, hunks of cauliflower, and dried shiitakes for a vegetarian take on sundubu jjigae, still as potently spicy and flavorful as meat- or seafood-powered ones. I stocked my fridge with banchan, like blanched watercress enlivened with sweet-salty doenjang. I marinated slivers of eggplant twice—once in salt, then in a gochugaru, soy sauce, and onion mixture—for her “vegetarian bulgogi.” Charred around the edges and custardy inside, it was the first thing demolished at the table, which made me feel only the slightest bit proud. (Okay, fine. I was extremely pleased with myself.)I get why my Korean moms never shooed me away when I arrived awkward and hungry to their homes as a teen. I get why Maangchi constantly retests her recipes to make them better or vegetarian or faster to cook, and answers all the comments posted to her videos and recipes, even when it’s the middle of the night and she’s headed to the bathroom. I get why I pored over this cookbook, making notes of all the recipes I wanted to cook for my friends and family coming to my teensy Manhattan apartment. And, sorry, the reason is cliché: We do it because we care.If Maangchi is our collective mom, then we’re her collective kids. And through her latest cookbook, she passes on not only her recipes, but also the special kind of joy, warmth, and love only a Korean mother knows how to show.Get the recipe:Bulgogi-Style EggplantThis easy weeknight pan-fried eggplant is so flavorful and pleasingly chewy, it’s practically meaty. View RecipeBuy it: Maangchi’s Big Book of Korean Cooking, $25 at AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon Appétitcookbook clubCookbooksKoreanShoppingRead MorecultureHow Much Kimchi Do I Have to Eat to Stop Feeling Like a Bad Korean?By Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-02", "author": ["Condé Nast", "Elyse Inamine"]}