{"id": "e39149b27e6647594e1187da808598f0", "url": "https://www.bonappetit.com/recipe/dry-brined-turkey", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Dry-Brined Turkey Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2013 IssueDry-Brined TurkeyBy Alison RomanPhotography by Marcus NilssonOctober 16, 20213.9(441)Read ReviewsTriangleEmailPinterestPrintMarcus NilssonEmailPinterestPrintEmailPinterestPrintShort on time? This dry-brined turkey recipe requires an early start on Thanksgiving day, but no prep leading up to the holiday—unlike wet brines, which can take up to 72 hours (and create a lot more mess). The dry brine is a salty mixture rubbed all over the turkey and allowed to sink in, in this case 6–7 hours, delivering big flavor with minimal hassle. Choose your own adventure and pick out a dry brine to match your menu: There’s bright Citrus and Peppercorn, traditional and versatile Garlic and Herb, or Fennel, Chile, and Maple, which tempers heat with sweetness.Leftovers from a dry-brined turkey breast won’t disappoint. Try using them to make a French Toast Sandwich, Turkey Posole, or Spicy Cabbage Salad with Turkey and Peanuts.Editor’s note: This recipe was originally published October 15, 2013..Ingredients8 to 10 ServingsCitrus and Peppercorn Dry Brine, Garlic and Herb Dry Brine, or Fennel, Chile, and Maple Dry Brine112–14-lb. turkey, giblets and neck removed1medium onion, quartered1head of garlic, halved1–2bunches of herbs¼cup (½ stick) unsalted butter, room temperature2cups (or more) low-sodium chicken brothPreparationStep 1Rub dry brine all over turkey; chill uncovered, 6–7 hours.Step 2Preheat oven to 425°. Rinse turkey under cold water; pat dry and place, breast side up, on a rack set in a large roasting pan. Stuff turkey with onion, garlic, and herbs. Working from neck end of turkey, gently loosen skin from breasts and rub butter under skin and all over outside of bird. Tie legs together with kitchen twine, pour broth into pan, and roast turkey 30 minutes. Reduce oven temperature to 325° and roast, basting with pan juices every 30–40 minutes, adding more broth as needed to maintain some liquid in pan, and tenting with foil if skin is browning too quickly, until an instant-read thermometer inserted into thickest part of thigh registers 165°, 2½–3 hours.Step 3Transfer turkey to a platter; tent with foil. Let rest at least 30 minutes before carving.Nutrition Per Serving8 servings 1 serving includes: Calories (kcal) 640 Fat (g) 9 Saturated Fat (g) 4.5 Cholesterol (mg) 570 Carbohydrates (g) 3 Dietary Fiber (g) 1 Total Sugars (g) 1 Protein (g) 129 Sodium (mg) 370How would you rate Dry-Brined Turkey?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis is a practical, easy brine that doesn’t fail.  The Turkey is juicy, tasty and looks wonderful.  Thank you for creating a successful presentation and delicious dinner.AnonymousHenderson, NE11/24/2021I've done the citrus dry brine several years in a row now. I love it!SunnieSeattle, WA11/14/2021Love this recipe, but the cook temp is off.  325 just isn't enough.  Opt for 350 if you want to eat without a family revoltRory PWashington, DC11/26/2020Have made this every year since the Nov 2013 issue, using the maple, Chile, fennel brine.  Comes out great each time, and the pan gravy from it is awesome!MQuastPhoenix AZ11/26/2020It's a classic for a reason. This is my go-to Thanksgiving turkey. Used the Fennel, Chile, and Maple Dry Brine last year and had zero regrets.  rskartenNew York10/31/2017Explore Bon AppétitTurkeyPoultryMainNut-FreeGluten-FreeKetoRoastThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2013-10-15", "author": ["Condé Nast", "Alison Roman", "Marcus Nilsson"]}