{"id": "e39a9e121b4505df2d5e70813647bd60", "url": "https://www.bonappetit.com/recipe/sesame-oat-apple-crisp", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "Sesame Oat Apple Crisp Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSesame Oat Apple CrispOctober 1, 20204.9(7)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintWhen the weather turns crisp and cool, I crave a house that smells like autumnal, warm spices. This sesame oat apple crisp fits the bill perfectly. The topping is studded with sesame seeds and rolled oats, giving this crisp a delicious nutty aroma and perfectly chewy texture. It's filled with the season’s best apples and tossed with Swerve (my go-to alternative sweeteners when I want to add flavor without the carbs and calories), warm spices, and lemon juice, creating a marriage of salty and sweet, nutty and delicious.IngredientsFilling6Honeycrisp or Gala apples (about 2 1/2 pounds), peeled and sliced into 1/4-inch slices1/4 cup Brown Swerve3Tbsp. Swerve Granular2Tbsp. cornstarch2tsp. ground cinnamon1tsp. ground gingerJuice from 1 small lemon1/4 tsp. kosher saltCrisp11/2 cups old-fashioned rolled oats3Tbsp. toasted white sesame seeds2Tbsp. black sesame seeds1cup all-purpose flour1/3 cup Brown Swerve2Tbsp. Swerve Granular3/4 tsp. kosher salt1/2 cup unsalted butter, melted and cooled1tsp. vanilla extractPreparationPreheat the oven to 350 degrees F.To make the filling:In a large bowl, combine the sliced apples, Brown Swerve, Swerve Granular, corn starch, ground cinnamon, ground ginger, lemon juice, and salt. Toss until thoroughly coated. Transfer the mixture to an 8x8-inch baking dish. Set aside.To make the crisp topping:In the same bowl (no need to clean it out), add the rolled oats, sesame seeds, black sesame seeds, flour, Brown Swerve, Swerve Granular, and kosher salt; mix until combined. Pour in the melted butter and vanilla. Mix until everything is thoroughly combined.Pour the topping atop the filling and smooth it out into an even layer. Transfer to the oven to bake for about 45 minutes, until the topping is golden brown and the filling is bubbling. Serve with Swerved vanilla ice cream.Recipe by Adrianna Adarme of acozykitchenWant more? Check out these other holiday recipes showcasing Swerve:Whiskey Sweet Potato PieSpiced Pear and Bourbon SparklerHow would you rate Sesame Oat Apple Crisp?Leave a ReviewTell us what you thinkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-01", "author": ["Condé Nast"]}