{"id": "e3a8d44362adf5322654ce39d03f40ec", "url": "https://www.bonappetit.com/recipe/chicken-seekh-kebabs", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Chicken Seekh Kebabs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueChicken Seekh KebabsBy Chintan PandyaMay 25, 20214.7(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThese quick-cooking kebabs are very easy, perfect for grilling during the warmer months. I actually grew up in a vegetarian family in Mumbai but would sneak out and eat them at roadside stalls with friends (in India, they’re a popular street food, traditionally cooked in a tandoor). I’ve never been able to get enough of the smell of charcoal smoke and these juicy skewers of piping-hot, char-grilled meat. Serve them with mint chutney and flatbread.If you can’t find ground chicken at your local grocery store, you can absolutely substitute ground turkey. You can also easily make ground chicken yourself even without a meat grinder. Simply cut skinless, boneless chicken thighs into small chunks, freeze for five minutes or until firm, and pulse in batches in a food processor until the meat is finely minced. —Chintan Pandya, Adda, Queens, NYThis recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStainless Steel Skewer$5.89 At AmazonLarge Bowl$18 At AmazonMicroplane Grater$16 At AmazonPlatter$29 At AmazonIngredients6 - 8 ServingsVegetable oil (for grill and hands)2lb. ground chicken, preferably dark meat¾cup (loosely packed) finely grated \tAmul cheese or sharp cheddar¾cup finely chopped cilantro¾cup finely chopped mint10–12garlic cloves, finely grated14\" piece ginger, peeled, finely grated½jalapeño or serrano chile, seeds removed if desired, finely chopped2tsp. ground cardamom2tsp. garam masala2tsp. kala jeera (black caraway seeds; optional)2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt1½tsp. deggi mirch (Kashmiri chile powder) or 1 tsp. cayenne pepper1tsp. ground mace (optional)4Tbsp. unsalted butter, meltedSpecial Equipment16bamboo skewers, soaked 30 minutes, or 8\"–10\" metal skewersPreparationStep 1Prepare a grill for medium-high heat; oil grate. Using your hands, mix chicken, cheese, cilantro, mint, garlic, ginger, jalapeño, cardamom, garam masala, kala jeera (if using), salt, deggi mirch, and mace (if using) in a large bowl to combineStep 2Using oiled hands, divide chicken mixture into 16 portions and shape into rough logs about 4\" long. Skewer logs and shape meat onto skewers, leaving 1\" of skewer exposed at each end for turning. Grill kebabs, turning as needed, until browned all over and cooked through, 10–12 minutes. Transfer to a platter and brush with butter.How would you rate Chicken Seekh Kebabs?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleWas shopping at Costco, where ground chicken was not in stock; however, I decided to try preparing with ground turkey instead and my husband and I were both pleased with the outcome! This recipe is healthful and flavorful. We did encounter the same skewer holding problem as the previous reviewer but found by quickly rotating for the first minute or so the meat \"sealed\" and held. Chef CourtAppleton, WI7/30/2021The meat was very tasty, but could not get it to hold its form on the skewer which spelt disaster on the grill.  I ended up serving cooked crumbled chicken.  I assume my ground chicken was too moist- maybe I should have added bread crumbs to firm is up.Steve KOK7/22/2021Kala Jeera is not carraway seeds. That's cumin. Which one is supposed to be used?RV7/15/2021Wow - this packs a ton of flavor and despite only finding ground chicken breast, stayed super moist and tender!  We did leave out the caraway and mace (not a fan of either, so glad they were optional).  Quite spicy, but just right for our palettes.  Served similar to shawarma/gyro - on warmed pita with veggies and sour cream.  We plan to do a larger batch next time to freeze extras for a quick and easy weeknight dinner!LBinTXTexas7/12/2021These were fantastic. The spices and the herbs were so delicious together. I honestly didn't bother to skewer but shaped them into little rolls and pan fried. Very good. Diana Z.Philadelphia, PA7/5/2021@Anisha Seth - probably sharp cheddar, as it says in the recipe.Jo KennaBoston, MA7/5/2021Generally want to use cold meat and work it a bit so it gets paste like consistently Bill St Paul 7/2/2021We can’t get amul cheese in Canada for some reason. What would you suggest as a sub?Anisha SethEdmonton, AB, CAN6/28/2021@Darcied.... tell us more about the mushroom condiment, that sounds amazing!MikeShanghai6/24/2021Delicious, but had a terrible time with the kabobs falling apart off the skewers when grilling. Any tips?AnonymousBrooklyn ny6/13/2021Wonderful. Seasoning is perfect. I don't even have a grill, and didn't feel like heating the house with a broiler, so simply browned the meat, shaped like kebabs, on the griddle. Didn't brush with butter -perfectly tender and juicy without the butter. Served with homemade spiced mushroom chili-pepper condiment (similar to an oyster sauce but with jalapeno and garam masala etc, added).  This is the new burger. Thank you so much for this recipe.DarcieDDetroit5/31/2021Explore Bon AppétitSkewerIndianSouth AsianAsianGround ChickenChickenPoultryCheddarCheeseCilantroHerbs & SpicesMintCardamomMainGluten-FreeNut-FreeKetoHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Chintan Pandya"]}