{"id": "e3accc5e2ab81f381ea7c99ae6c29afd", "url": "https://www.bonappetit.com/recipe/creamy-white-pizza-with-squash-and-sopressata", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Creamy White Pizza with Squash and Sopressata Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesCreamy White Pizza with Squash and SopressataFacebookPinterestTwitterEmailBuy the dough from your local grocery store or try asking at your favorite pizzeria, often they will sell the dough to you.PrintIngredients1 lb fresh pizza dough1 acorn squash1 medium red onion1 large garlic clove3 tablespoons extra virgin olive oil, plus more for drizzlingKosher salt and freshly ground pepperRed chili flakes8 ounces low-moisture mozzarella cheese1 can (10 1/2-ounce) Campbell's Cream of Chicken Soup2 ounces thinly sliced soppressataRecipe PreparationPreheat the oven to 500. Remove the pizza dough from the refrigerator and set on the counter to bring the dough to room temperature.While the pizza dough comes to room temperature, cut the squash in half lengthwise and use a spoon to scoop out the seeds. Then cut each piece of squash crosswise into ¼-inch half moons. Cut the root ends off of the onion and slice the onion crosswise into ¼-inch thick rings. Remove the outer peel from each ring and discard. Peel and finely grate the garlic on a microplane.On a rimmed baking sheet, toss the cut onions and acorn squash with 2 tablespoons of oil. Season with salt and pepper. Roast until knife tender, about 15 minutes.While the onions and squash roast, heat the remaining tablespoon of oil in a small skillet, until shimmering. Add the grated garlic and a large pinch of red pepper flakes. Stir to incorporate, then immediately pour the oil into a small heatproof bowl. The garlic will keep cooking from the residual heat of the oil.Grate the cheese on the large holes of a box grater.When the onions and squash are cooked, scrape the vegetables onto the cutting board.Drizzle the baking sheet with oil and brush to spread. Using your hands, stretch out the pizza dough to fit the pan. Bake until dry and lightly golden (to prevent the crust from being soggy), about 8 minutes.Remove the pan from the oven and brush the dough all over with the garlic-chili oil. Using an offset spatula, spread the Campbell's® Cream of Chicken Soup over the crust, leaving a ½-inch border. Scatter the squash, onions, and soppressata on top and sprinkle with the remaining cheese.Bake until cheese is bubbly and golden, about 12 to 15 minutes. Slice and sprinkle with chili flakes.Recipe by Campbell'sRelated VideoCreamy White Pizza with Squash and SopressataReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitCampbell'sSponsoredBasicallyMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}