{"id": "e3b1c6a9078b545f0d937c47eac61494", "url": "https://www.bonappetit.com/recipe/herby-pizza-with-carrot-top-pesto", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Herby Pizza with Carrot Top Pesto Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHerby Pizza with Carrot Top PestoBy Daniela MoreiraSeptember 7, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Anna HamptonEmailPinterestPrintEmailPinterestPrintThis garlicky carrot top pesto can be used in dozens of ways (pasta sauce! salad dressing! dipping sauce!) aside from pizza. This recipe from Daniela Moreira of Timber Pizza Co. is part of Healthyish Superpowered, a dinner series honoring female activists and chefs across the country, in partnership with Caviar.Ingredients4 servingsDough2tsp. sugar½tsp. active dry yeast2¼cups bread or all-purpose flour1½Tbsp. extra-virgin olive oil, plus more for drizzling2tsp. kosher saltToppings and Assembly⅓cup coarsely grated Parmesan1small garlic clove, grated1Tbsp. fresh lime juice1cup basil leaves, plus more for serving1cup tender carrot tops, plus more for serving⅓cup extra-virgin olive oil, plus more for drizzling¼cup mint leaves, plus more for servingKosher salt4medium carrots, finely sliced on a mandoline, divided½serrano chile, very thinly sliced, dividedPea shoots and/or blue basil (for serving)PreparationDoughStep 1Mix sugar, yeast, and ¾ cup warm water in the bowl of a stand mixer (or in a large bowl if doing by hand) fitted with the dough hook. Stir in flour and 1½ Tbsp. oil. Mix on low speed, scraping down sides of bowl as needed, until dough comes together in a smooth mass and no longer sticks to the sides of bowl, 5–6 minutes. Cover dough and let rest 30 minutes at room temperature. Add salt and continue to knead until fully incorporated into dough.Step 2Turn out dough onto a work surface. Cut dough in half, then shape each half into a ball. Place each ball in separate medium bowls. Drizzle with just enough oil to coat. Cover bowls with plastic wrap. Chill at least 24 hours and up to 2 days.Step 3Let dough come to room temperature until nearly doubled in size and slowly springs back when poked, 2–2½ hours. Dough is now ready for shaping.Toppings and AssemblyStep 4Place a rack in top third of oven; preheat to 475° (if you have a pizza stone, use it!). Pulse cheese, garlic, lime juice, 1 cup basil, 1 cup carrot tops, ⅓ cup oil, and ¼ cup mint in a food processor until smooth; season with salt. (You can also make the carrot top pesto by chopping everything by hand.)Step 5Stretch dough, 1 ball at a time, on a lightly oiled large rimmed baking sheet until 12–14\" in diameter. Spread with half of the pesto, then top with half of carrots and chiles. Drizzle with more oil; season with salt.Step 6Bake on top rack until crust is golden brown and crisp, 10–12 minutes. Let pizza cool 1 minute, then top with carrot tops, basil, mint, pea shoots and/or blue basil. Serve immediately.How would you rate Herby Pizza with Carrot Top Pesto?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis pesto sauce is out of this world! It's so tangy and delicious. I just used store bought dough instead of making it myself and the pizza was amazing! I also used a cast iron skillet for about 14 minutes in the oven and it turned out great. The sudden heat from the serrano peppers amongst the bed of somewhat soft carrots created a great dish. I would recommend this recipe to anyone.groseoWisconsin4/13/2019Explore Bon AppétitHealthyishWeb RecipeSuperpoweredpizza doughPizzaSugarYeastOther IngredientsFlourParmesanCheeseGarlicVegetableLime JuiceCarrotBasilHerbs & SpicesMintSerrano ChileChilePea ShootLeafy GreensRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-07", "author": ["Condé Nast", "Daniela Moreira"]}