{"id": "e3bc50cdc46a22d132805c1ee8f10994", "url": "https://www.bonappetit.com/story/alex-koones", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "Alex Koones on Creating a Dining Space for New York's Queer Community | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAlex Koones on Creating a Dining Space for New York's Queer CommunityThe founder of Babetown feeds her community with Champagne and fried chicken.By Fariha RóisínJune 17, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn Who Is Wellness For?, writer and activist Fariha Róisín interviews people who are reshaping narratives about wellness for themselves and their communities. Here she speaks with Alex Koones, founder of the Brooklyn-based queer supper club Babetown.I can still vividly remember the first time I went to Babetown.It was last summer, on a hot night in Crown Heights. The air felt sticky as if it might rain, and bodies were out on the street eating, chatting, sometimes flirting. I had been told by Alex Koones (the organizer and chef behind Babetown) that there would be gluten-free fried chicken, alongside a perfectly glutinous fried chicken. I was thrilled! As a celiac, I rarely get to enjoy the culinary delights of a classic chicken fry.There is a rare and welcoming quality to the universe that Koones has cultivated: She’s making space for queer, non-binary, and trans folks to come together and enjoy food, a drink, life.The meal ended up being delicious—green beans were in the mix, some spicy slaw as well. The batter delicately coated the chicken—and I may have stuffed myself with two hefty pieces. I was moved by the food, but even more so by the people who gathered around a house just south of Utica Ave. The possibility of the space was palpable. In the time of the Trump government, and the continuation of violence against marginalized bodies, the community of Babetown is sacred.Why did you decide to make a dining space for New York’s queer community?Babetown is a reflection of a party I’ve always thrown at my apartment.  Once a month, I would make a big meal of whatever was inspiring me and invite everyone I know.  People often invited friends or groups of friends and the party would always turn into a hodgepodge of different people from all over the queer universe. The food was always made with love—very New York dishes with local ingredients, just enough carbs to keep everyone from getting drunk but light enough to keep you from going to sleep.  Strangers would hug me at the end and tell me how much it meant to them to be meeting new queer people in this environment. One day, I thought it would be cool to open it up to the public, and Babetown was born.What do you think it means to create spaces where folks that are generally marginalized can be free?I want to be clear: I don’t believe in safe spaces. If you are marginalized by society, there’s no room on this Earth that can keep you out. Whether it’s the government making laws that work against you or a person with a great deal more privilege making an insensitive comment after drinking too much, that societal marginalization is going to rear its head. But I try, with all of my heart and all of my soul, to set people up for success. I welcome people warmly into a homey, private environment and feed them homemade food that tastes like New York. I put out large bins of alcohol so no one’s waiting in line for a bartender and the music is turned down low enough that you can hear each other. And maybe, with a stomach full of good food and the buzz of some nice wine, the best in all of us, as traumatized and kicked around as we are, is going to come out. And we’re going to really hear each other and see each other and connect with each other and look beyond our own tiny worlds and see into a completely different world/perspective for a minute. I ask my guests, who have been disappointed over and over, to trust me and succumb to this experience. It’s a massive responsibility and I’ve had my failures. But I keep showing up and trying to do better for my people.Do you think food can be radical?I mean Julia Turshen wrote a whole book about her experiences entwining food and social justice. It’s amazing to me some of the ways food can bring people together and unite communities. There was just a great bake sale around here where a lot of really talented bakers donated baked goods and all the proceeds went to RAICES and reunited families that have been torn apart. You can even think about block parties and neighborhood cookouts where everyone is BBQ-ing and meeting their neighbors, and the way all these different people show up for this one thing. People gotta eat, so it can be a very natural, simple thing to come together over food.Do you feel even more of an imperative to create and cultivate this space now, more than ever?I most definitely feel that we need a space like this more than ever, because people are growing further and further away from each other. I don’t think it’s just conservative versus liberal, I think it’s everyone in every community.  People are so impatient with any opinion that’s different than theirs and we don’t really talk about things in person anymore; we argue about it on Facebook or Twitter. I strongly feel that an ideological difference is a chance to stop with the small talk and start talking about things that actually interest you, but if you’re not seeing the humanity in another person’s face or hearing it in their voice, you will never see eye-to-eye on something. So, that’s what I try to do is bring people together IRL because, unlike our president, I don’t relish this country being divided. I don’t want to encourage people to hate or distrust each other. I want people to be a little bit more patient and gentle with each other and that starts within our own communities, coming together against the forces of evil running our government.What inspires you about your community?This one time, I took a new job and there was this woman working there. We kept staring at each other on my first day, not a romantic or sexual stare, we just kept looking over at each other. Later on, we because friends and learned we were both lesbians and laughed about how we were both staring, trying to figure out if the other one was gay. I think about that moment often and this natural hunger we have, particularly queer women, trans and non-binary people, to find each other. That’s what really inspires me—our ongoing, complicated, passionate desire to keep trying to find each other and the joy we feel when we do. This community loves each other more than I think they all know.How do you navigate the broad sphere of wellness?A big part of creating a space where everyone feels welcome is including food that’s going to work with every dietary need, so I work very hard to make sure the menus are vegan-and gluten-free friendly, and there is very little dairy at Babetown. I think it’s about accessibility more than wellness for us and making food that is both accessible and enjoyable for all.Times are hard, what inspires you to keep going on?There’s a podcast called Nancy that came to our pool party and asked people questions. When it aired, I was going through one of the darkest periods of my life and wasn’t sure I’d be able to keep throwing Babetown. I remember sobbing while listening to it. The sounds of my guests were coming from the speaker, talking about what this space meant to them—to be a working class person drinking bubbly and eating crabs in a pool, to be a trans woman in a bikini, to seek a community that accepts you and to find it here. Hearing how much Babetown meant to those guests, the real experience and memories we create for people, meant the world to me and it’s what I think about on the bad days.What would your ideal world (for food and wellness) look like?For my perfect world, I would direct you to the short story “Justice” by Mariame Kaba in “The Feminist Utopia Project.”  But pertaining to food? All food would be local—there would be no more giant supermarkets. Everything would be purchased at local markets and they would be more abundant, affordable, and generally accessible throughout the country.  Everything would be smaller batch, slower, more thoughtful. It would be illegal to serve frozen or canned food in schools, prisons, or homeless shelters. In fact, I’d make it so some of the best food in the world is served in homeless shelters. If everyone had a good meal, made with good food in their stomachs, this world would be a much better place.Explore Bon AppétitHealthyishWho Is Wellness ForBrooklynInterviewsRead MoreLifestyleDarian Hall and Elisa Shankle on Building a New Kind of Wellness Studio in BrooklynBy Fariha RóisínRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-17", "author": ["Condé Nast", "Fariha Róisín"]}