{"id": "e3bdfb060195648187c078a63515abfb", "url": "https://www.bonappetit.com/recipe/pasta-with-sausage-and-arugula", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Pasta with Sausage and Arugula Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssuePasta with Sausage and ArugulaBy Anna StockwellOctober 16, 20184.8(39)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Anna StockwellEmailPinterestPrintEmailPinterestPrintArugula is one of those rare salad greens we can also get down with hot, like when it’s tossed with pasta, piled on top of pizza, or scattered into stew. Be sure to keep a box of it in the fridge all winter long.Ingredients4 servings2small red onions, sliced into ½\"-thick wedges1fennel bulb, sliced into ½\"-thick wedges6Tbsp. extra-virgin olive oil, dividedKosher salt, freshly ground pepper8oz. hot or sweet Italian sausage (about 2 links), casings removed10oz. gemelli, casarecce, or other medium pasta1tsp. finely grated lemon zest2Tbsp. fresh lemon juice6cups baby arugulaFinely grated Parmesan (for serving)PreparationStep 1Preheat oven to 425°. Toss onions, fennel, and 2 Tbsp. oil on a rimmed baking sheet; season with salt and pepper. Spread out into a single layer. Pinch sausage into small pieces and scatter around onions and fennel. Roast until vegetables and sausage are cooked through and well browned, 25–30 minutes.Step 2Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid.Step 3Combine vegetables, sausage, and pasta in a large bowl. Add lemon zest, lemon juice, remaining 4 Tbsp. oil, and ¼ cup reserved pasta cooking liquid and toss to coat, adding more pasta cooking liquid if needed, until sauce comes together and coats pasta. Toss in arugula.Step 4Divide pasta among plates and top with Parmesan. Season with more salt and pepper.How would you rate Pasta with Sausage and Arugula?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangleI made this recipe for a group once, and I have consistently been getting asked where I got the recipe ever since.\nSooo good.. AnonymousVancouver, WA3/23/2022Super flavorful, and I opted for the spicy Italian sausage.  JaimeAustin, Texas2/9/2022Fantastic & easy to make meal.  We went back for seconds which is not the norm for us. Can’t wait to make it againAnonymousRamsey, NJ9/22/2021Sounds great. I love cooking with peppery arugula and the lemon zest. G. HarveyLong Beach, CA9/14/2021@waynecheeky what a great suggestion!!!! DIANA THOMPSONBishop, CA5/11/2021Great recipe and so easy! It was a big hit in my house, everyone went back for seconds. Also delicious for leftovers (I add the arugula after heating up so it stays fresh).MorganneBoston, MA4/14/2021Solid recipe. I recommend deglazing with a bit of sambucca or pernod to really make the fennel pop.WaynecheekyNewark,OH2/22/2021Love how few pots and pans this dish uses, but next time might use an extra pan to cook the sausage on the stove. It gets pretty dry in the oven. Otherwise perfecto!!4everhungryOakland, Ca2/8/2021This was really good! Just make sure to season as you go. \n\nI used veggie (beyond) sausage, and it worked perfectly. I also topped it with a few dollops of fresh ricotta and it was a nice contrast. \n\nI made this for a week of lunches -- it is incredibly filling but doesn't make you sleepy :) AnonymousChampaign, IL 1/4/2021This is delicious as written and so easy. I also use this technique with whatever veggies I have on hand and sausage as a go-to weeknight dinner--squash, brussels sprouts, baby kale, spinach, whatever. It's probably best the way it's intended, but it's always good.AnonymousNY10/21/2020Sooooo good!  My husband said, “I think this is the best pasta dish you’ve ever made!”  I used Jennie-O’s sweet Italian turkey sausage and added a cup of peas.lorilHouston10/2/2020Sooooo gooooood!! Added extra lemon + red chili flakes for a sprinkle of danger.AnonymousChicago5/6/2020Great weeknight dinner.  Not a heavy pasta dish might skip the spicy sausage for artichoke heart and pepper flakes for heat!!  AnonymousCape Cod MA1/14/2020Delicious! Would also recommend to add a bit more lemon juice AnonymousCanada5/7/2019We love this pasta dish. I roast a pint+ of cherry or grape tomatoes with olive oil, salt and pepper for 15 minutes on 400*. I add this with sausage , vegetables and lemon. It all tastes wonderful!!AnonymousCanada4/29/2019Explore Bon AppétitPastaItalianEuropeanSausageMeatArugulaLeafy GreensVegetableRed OnionOnionEasyMainNut-FreeRoastSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Anna Stockwell"]}