{"id": "e3d04c5c41120cdfc9e509aedd61147a", "url": "https://www.bonappetit.com/story/glazed-caramel-fish-sauce-chicken-drumsticks", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "These Glazed Grilled Chicken Drumsticks Are All I’m Grilling This Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Sticky Fish-Sauce Chicken Drumsticks Are a Gift From the Glaze GodsGreat things happen when you combine fish sauce, fire, and a few packs of chicken drumsticks.By Christina ChaeyJune 22, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailIn the competition I just made up in my head of who eats the most in the Test Kitchen on any given day, I come second only to our staff photographer Alex Lau. The day our awesome assistant Gaby Melian yelled “that girl can EAT!” as I beelined for a leftover steak was among the prouder—and more mortifying—moments of my career and life.But while some days in the Test Kitchen you’ll find leftover steak, other days you’ll find yourself seated in front of a platter of senior food editor Chris Morocco’s ridiculously bonkers-good glossy Grilled Chicken Drumsticks with Savory Caramel and wonder how you got so lucky. These drumsticks are—how do I put this—pure chef kisses fingertips: tender meat, plenty of crisp charred spots, a finger-lickin’ sticky glaze spiked with fish sauce that lent the drumsticks an irresistible funk. They remind me of one of the most delicious things I’ve eaten in the last six months: the crisp Vietnamese fried chicken wings at Crawfish and Noodles in Houston, which are tossed in a sweet-salty glaze with, yes, plenty of fish sauce. I vowed to make them as soon as I could convince my (very territorial) dad to let me use his grill.Don’t let the words “savory caramel” in the recipe title hoodwink you. I know it sounds complicated and time-consuming, but this recipe is neither! These drumsticks are one of four glossy gooey genius glazed meat recipes Chris developed for our summer grilling issue (out now!) that were designed to deliver the bold flavor of a marinade, but in a fraction of the time. You simply season a few packs of drumsticks with salt, then grill them covered, over indirect heat, until they’re crisp, browned, and nearly cooked through. Grilling over indirect heat takes a little longer than letting the drumsticks rip over high heat, but it’s crucial for preventing the drumsticks from getting weird and flabby and not properly crisp.And then there’s the glaze. THAT GLAAAAAZE. I’d never made a glazed meat that didn’t involve most of a bottle of KC Masterpiece (mad love from the Chaey fam), but I’m not sure what I’ve been doing. Into a saucepan goes some water, grated garlic and lemongrass, and a small arsenal of pantry staples: rice vinegar, sugar, cumin, black pepper, and a mountain of crushed red pepper flakes. (Fair warning to the heat-averse, these wings are HAWT so feel free to start with 1 tsp. and taste first.) Let all that boil until the mixture is reduced to about a half-cup and thick and glossy (think teriyaki sauce). Once it’s cool, stir in a few spoonfuls of fish sauce, then set some of the glaze aside for dipping the drumsticks in as you eat.When the chicken is almost cooked through, it’s time to move those drummys over to high heat and hit them with sauce. I recommend using a pastry brush to do this if you have one, because it lets you easily dab a generous amount of glaze onto the drumsticks. The sugar and fish sauce in the glaze will caramelize in the high heat, creating plenty of those delicious charred spots, everything will get beautifully lacquered, and you will feel like your best Bob Ross painting happy little trees as you baste with your pastry brush. And, much like Bob and his trees, I’m pretty sure the moments I’ll be happiest this summer are when I’m standing over the grill, painting my happy little drumsticks.Get the recipe:Grilled Chicken Drumsticks with Savory CaramelA savory caramel glaze that you’ll be licking off your fingers all summer.View RecipeExplore Bon AppétitGrillChickenRead MoreSticky-Sweet Grilled Pork ShoulderGrilled Salmon Steaks with Garlicky Yogurt SauceGrilled Pork Chops with Pineapple-Turmeric GlazeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-22", "author": ["Condé Nast", "Christina Chaey"]}