{"id": "e3d5e1b80370e9f22becf5636cc8f87a", "url": "https://www.bonappetit.com/city-guides/montreal/venue/le-vin-papillon", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Le Vin Papillon Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealLe Vin PapillonLittle Burgundy’s natural wine hubFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for Le Vin Papillon’s expert selection of natural wines, mostly focused on small European producers and poured with impressive charm and knowledge by sommelier Vanya Filipovic.ORDER: whatever one of the very friendly servers recommend; you’re likely to be both delighted and surprised. And get the snacks! We love the shaved ham and cheddar with brown butter, squid ink gnocchi fritti (like big savory beignets) with house-smoked local sturgeon cream, and other appetizer-sized plates listed on the restaurant’s chalkboard menu.THE VIBE IS: lively! Located down the block from sister restaurants Joe Beef and Liverpool House, Vin Papillon inherited that same convivial, neighborhoody vibe.PRACTICAL STUFF: Open Tuesday to Saturday 3 p.m. to midnight. Closed Sunday and Monday. No reservations. During the summer go early and park yourself outside at one of the wooden picnic tables on the back terrace.—Claire SaffitzPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVEJoe BeefAn over-the-top meal unlike any other, in Little BurgundyLoïcAll roads (and great pét-nat) lead to this Saint-Henri wine barMon LapinLaid-back vibes and cool natural wines in Little ItalyExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}