{"id": "e3e4ed850e79371e692a051cd5225af0", "url": "https://www.bonappetit.com/recipe/yum-phonlamai", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Yum Phonlamai Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueYum PhonlamaiSeptember 22, 20204.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintThis fruit salad, from chef Parnass Savang of Atlanta’s Talat Market, is an homage to Savang’s maternal grandmother’s pineapple stand in Bangkok’s Mahanak Fruit Market. The interplay between the fish sauce, chiles, and sweet juicy fruits makes this a simple but refreshing dish.Ingredients4 Servings1Tbsp. small dried shrimp (optional)¼cup unsweetened shredded coconut4garlic cloves2red Thai chiles, coarsely chopped4Tbsp. fresh lime juice4tsp. granulated sugar4tsp. fish sauce2apples, preferably Pink Lady, cored, cut into 1\" pieces2Asian pears, cored, cut into 2\" pieces1small shallot, thinly sliced into rings1cup red grapes, halved crosswise¼cup coarsely chopped cilantro¼cup mint leaves, torn if largePreparationStep 1If using, toast dried shrimp in a dry small skillet, tossing occasionally, over medium heat until slightly lighter in appearance and a little crispy, about 4 minutes. Transfer to a cutting board; reserve skillet. Coarsely chop and lightly smash to tenderize; set aside.Step 2Add coconut to reserved skillet and toast over medium heat until light golden and fragrant, about 2 minutes. Transfer to a small bowl; set aside.Step 3Smash garlic to a coarse paste with a mortar and pestle. Add chiles and lightly smash (the finer you pound the chiles, the spicier the dressing will be). Mix in lime juice, sugar, fish sauce, and 2 Tbsp. water. (Or, finely chop garlic and salt, then chiles, on a cutting board and smash with the side of a chef’s knife. Mix in a bowl with remaining ingredients.)Step 4Toss apples, pears, shallot, grapes, cilantro, mint, and reserved dried shrimp (if using) in a large bowl to combine. Add dressing and toss to coat. Top with reserved toasted coconut.How would you rate Yum Phonlamai?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladThaiSoutheast AsianAsianAppleFruitAsian PearEasyQuickSideDairy-FreeGluten-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}