{"id": "e3f775b3ed972b9a95cdfd59c5a42aa4", "url": "https://www.bonappetit.com/story/save-your-braising-liquid", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Save Your Braising Liquid, OR ELSE | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSave Your Braising Liquid, OR ELSEAn angel loses her wings every time you throw out that leftover braising liquid.By Carey PolisApril 18, 2018FacebookTwitterEmailFacebookTwitterEmailI have spent many winter and chilly spring days huddled over my kitchen sink, eating the cold leftovers of braises I made days earlier. I almost never bother to reheat, say, the remains of my Passover brisket, because when I want some shreddy-tender meat, I want shreddy-tender meat now, and a fork just seems unnecessary when winter-fattened fingers will do.But at the end of the day, it's not even the meat I want—it's the almost-solid braising liquid that surrounds those chunks of protein that I crave, the gelatinous combination of wine and fat and salt and carrots and onions and all kinds of other good stuff that's been hanging out in the fridge for however many days. I'd drink it straight from the giant Tupperware, but my husband is usually already giving me side-eye for eating cold leftovers with my hands; instead, I pretend to be a responsible human and pour that elixir into a bowl and reheat it along with whatever solids happen to tag along, and deign to use an actual spoon. It's kind of like...meat soup?Still, way after the last bits of meat meat are gone, more of that precious, semi-congealed liquid remains—but if you think I'm throwing it out, you're out of your mind. My friends, this is not the end. Instead, take out some rice, lentils, or beans and cook them in your braising liquid (henceforth referred to as BL) as a substitute for the water or stock you would normally use. If there's not enough BL left, add water to make up the difference. I have made the most transcendent lentils this way. (And, yes, I am very confident that the phrase \"transcendent lentils\" accurately describes the resulting legumes.)Wherever there's jus, there's potential.\nPhoto by Alex LauSince the flavor of the BL is already so concentrated, even quick-cooking things like rice have plenty of time to soak up all of that aromatic goodness. And this technique works with nearly all braises. Whether you've got something as rich and fatty as short ribs, or somewhat-lighter chicken thighs, or even-lighter veggie-based braises, they all have something to give. The key is to taste your BL and try to imagine where its flavor best belongs. I've learned to use richer, meatier specimens to season split peas, particularly salty or aggressively-flavored ones with lentils, and lighter BLs (or at least somewhat diluted ones) for rice. The possibilities are endless; follow your heart.Another pro-tip: If you aren't sure that you'll be able to use it immediately, you can freeze your BL and break it out whenever a future craving strikes. Just avoid the \"mystery freezer container\" situations and remember to mark the leftovers with masking tape—think of that label as a love letter to your future self. You deserve it.You can't have BL without the B...Braised Short Ribs with a Pretty Great Bacon-Pineapple Situation on TopWe're topping all of our braises with bacon from now on.View RecipeExplore Bon AppétitBraiseRiceLentilBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-18", "author": ["Condé Nast", "Carey Polis"]}