{"id": "e3fa87b8817e3bde93dc736b0323bdde", "url": "https://www.bonappetit.com/story/sacha-sauce", "year": 2020.0, "month": 11.0, "day": 1.0, "content": "Sacha Sauce Goes Out to All My Umami Lovers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSacha Sauce Goes Out to All My Umami LoversI’d recognize that silver can anywhere.By Stacy AkazawaNovember 5, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When I think of barbecue sauce, I don’t think of Kansas City, or Texas, or Carolina. I think of Chinese barbecue sauce, but not the sweet molasses-y char siu sauce you get with pork buns. I’m talking about Chinese satay or sacha sauce, the funky umami bomb found at hot pot restaurants, my favorite of which is Taiwan-made Bullhead Barbecue Sauce (you’ll recognize the silver can with a smiling bull in an apron posing with a fork and a knife). Inside the container you’ll find a glorious paste made of dried seafood, garlic, ginger, shallots, chile, and oil that can be used in a variety of recipes.I was first introduced to sacha sauce by my husband, who often used it in dishes at his family’s Chinese restaurant. I then noticed its frequent appearance at the sauce-making station at many Chinese hot pot restaurants, where it’s usually labeled as BBQ sauce or satay sauce. It quickly became a staple in our pantry, adding a subtle but distinct depth of savoriness whenever a dish is “just missing something.”Although the true origins of shāchá jiàng (沙茶酱) are not entirely known, it’s speculated that the sauce is a Chaozhou adaptation of Malaysian and Indonesian satay sauce that was encountered during maritime explorations. Since its origins in Chaozhou, sacha sauce has continued to evolve as an essential condiment of Fujianese and Taiwanese cuisine. Today it’s commonly used for stir-fries, hot pot dipping sauce, or marinating meats for grilling, lending the perfect touch of savory and spicy flavors to any dish.The taste of sacha sauce is complex and multilayered. When you first open the container, you’ll need to give it a good mix to incorporate the thick brown paste at the bottom with the layer of oil on top. At first it tastes very umami-forward with a slightly briny flavor—reminiscent of Japanese katsuobushi—from the dried shrimp and brill fish. But it has a subtly sweet finish (even though sugar is not an ingredient). It’s this combination of flavors that makes sacha magical and versatile.Bullhead has a few varieties of sacha sauce, including the standard flavor (white lid), hot and spicy with Sichuan peppers (red lid, my personal favorite), and vegetarian (green lid). After the container is opened, you can store it in the fridge, where it will last for months (but you’ll probably go through it before then).I like to add a couple scoops of sacha sauce to nearly any dish that needs that little umami boost—stir-fries, Chinese sticky rice, congee, fried rice, or even salad dressing (think amped up Caesar salad). Even adding it to a simple bowl of plain white rice with soy sauce will do.Here are a few simple places to start incorporating sacha sauce into your cooking:Sacha Stir-Fry ChickenThis is a classic Chinese restaurant stir-fry chicken method. In a small bowl, mix up your sauce by adding sacha sauce, soy sauce, grated garlic, Shaoxing wine (or sake), Lao Gan Ma chili crisp, and a little white sugar. In another bowl, mix some bite-size pieces of skinless, boneless chicken thighs with cornstarch, oil, egg, salt, and pepper. Get a wok very hot, add oil, and then toss in the chicken to cook until almost done. Set aside in a separate bowl. Add a little more oil to the wok and throw in any veggies you have on hand—broccoli, mushrooms, green onions, bell peppers, snow peas, celery, or whatever is sitting in your fridge. Cook until crisp-tender, then add the sauce and the chicken back into the wok and mix it all together until everything is cooked through (if the sauce needs thickening, add some water and cornstarch slurry). Serve with hot rice.Cucumber SaladRoughly chop some Persian cucumbers and toss them in a mason jar. Mix in some sacha sauce, soy sauce, sesame oil, Lao Gan Ma chili crisp, finely chopped garlic, fish sauce, rice wine vinegar, chopped cilantro, and salt. Put on the lid and shake until it’s all mixed together and pop it in the fridge. It’s best after it sits and chills for a few hours.Dipping SauceEveryone has their own recipe for hot pot dipping sauce, but sacha sauce is crucial. My perfect sauce is sacha sauce, soy sauce, garlic, sesame oil, chili oil, green onions, and cilantro. For my husband, it’s sacha sauce, black vinegar, cumin, green onions, cilantro, and a raw egg. Dip in hot pot ingredients, pour it over a salad as a dressing, or simply drizzle over hot rice.Get your own jar:Bullhead Barbecue Sauce$7 at AmazonStacy Akazawa is a family medicine physician who practices primary care and integrative medicine in San Francisco. She loves trying new recipes, collecting cookbooks, and creating epic Google maps of her favorite places to travel.11/9/2020: The headline of this story has been updated.Explore Bon AppétitChineseSauceShoppingRead MorecookingAll You Salty-Sweet Fans, Chinese Sausage is For YouBy Helen QuRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-05", "author": ["Condé Nast", "Stacy Akazawa"]}