{"id": "e40475c381a5e124b4bfbe9ce8993805", "url": "https://www.bonappetit.com/story/sweet-soy-sauce-condiment", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "Sweet Soy Sauce Will Improve Marinades, Stir-Fries, and Your Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Can't Stop Putting Sweet Soy Sauce in Alllll the NoodlesThis sauce will improve your marinades, stir-fries—and dare I say?—your life.By Alyse WhitneyApril 2, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThe condiment collection in the door of my fridge is on the verge of collapse. Tiny jars of harissa, a few types of chile pastes I’ll use once and then decide are too spicy, and no less than six types of salty Asian sauces are nestled in that plastic prison. Fish sauce was once my go-to for a quick, salty punch of flavor, and then I let it take a backseat so kecap manis, an Indonesian sweet soy sauce, could drive home all my weeknight dinners.I was introduced to sweet soy sauce a few years ago when I tried to make pad see ew, my favorite Thai stir-fried rice noodles, at home. I bought a gigantic bottle at an Asian market and used it exactly once. I could never get the noodles as tender as I wanted, and I didn’t have the space to invest in a wok. I moved apartments, threw it away, and bought a Costco-sized jug of regular soy sauce instead.Then I was cooking on a tour bus with Michelle Branch and fell in love with her grandmother’s peanut sauce recipe, which required a good glug of kecap manis. It added a little sweetness and viscosity to the sauce, plus a backbone of saltiness and umami to balance everything out. I took home the bottle from our shoot—ABC brand, available for $9 on Amazon—and started experimenting with the sticky, rich sauce at home. It has a molasses-like, syruppy texture that pours in ribbons. It does have added sugar, so is best used in moderation, but I add a little bit to riff on these stir-fried porky udon noodles or mixed into a dipping sauce for dumplings.Sweet dreams are made of ABC sweet soy sauce.\nNoodles are great, but I needed more ways to get it into my life, stat. I knew that Chef Leah Cohen used sweet soy in the half Hainanese duck and pad see ew at her NYC restaurant Pig & Khao, but it turns out that she uses it frequently in her home kitchen too. Here are three ways she incorporates it into her cooking:MarinadesAny protein can benefit from a sweet soy marinade, which will help tenderize the meat and caramelize its exterior from the sugar content. “It gives another dimension and depth of flavor that is different than straight soy, just salt, or even another dark soy sauce that doesn’t have sugar,” Cohen explains. She thinks it goes best with beef—perhaps substituting the brown sugar in a bulgogi marinade—whether seared, baked, broiled, or grilled. But pork is a close second, particularly for skewers. When we spoke, she had just eaten pork satay in Singapore made with sweet soy and coconut milk, one of her favorite combinations.Sambal chicken skewers could be improved by a drizzle of sweet soy sauce to offset the spice.\nPhoto by Peden + MunkGlazes and Dipping SaucesSweet soy can also be brushed on like a glaze for skewers, used in a barbecue sauce during the summer, or drizzled over cooked protein to give it extra flavor and a glossy finish. I’m thinking about using it with a little spice instead of hot honey on this crispy chicken thigh recipe. It could be great as a dipping sauce for summer rolls or scallion pancakes, too. But don’t limit yourself only to Asian flavors—anywhere you’d combine sweet and salty, it could work. Kecap manis plus ketchup in a meatloaf glaze? That could definitely work. (My words, not Cohen’s.)Mixing sweet soy sauce into stir-fried udon noodles is my favorite weeknight activity.\nPhoto by Alex LauStir-Fry BasesAnother sauce comes to mind when you think of salty, sweet, and slightly thick: hoisin. But hoisin is thickened with cornstarch, while sweet soy sauce is naturally thick from reducing soy sauce and sugar together. It works well in any sort of stir-fry situation, whether with rice noodles, ramen, udon, meat and vegetables, or even fried rice. The thickness of the sauce will help add texture and color to anything you toss it with. Life is simply better with sweet soy sauce. Put some in the door of your fridge right up front—you’ll be reaching for it constantly after you try it once.Buy It: ABC Sweet Soy Sauce, $9 on AmazonSweet soy sauce + stir fry = dinner tonight:Explore Bon AppétitShoppingAsianSauceRead MorecookingMake Soy Sauce Your Secret WeaponBy Nikita Richardson cookingThis Is Our Favorite Brand of Hoisin, a Superb SauceBy Chris MoroccocookingGarage Noodles Are the Rent Week Stir Fry Recipe That's Here to PartyBy Alex Delanycooking5 Weeknight Stir-Fries to Get You Through This Thing Called LifeBy Alex Beggs and Claire SaffitzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-02", "author": ["Condé Nast", "Alyse Whitney", "Claire Saffitz"]}