{"id": "e40b17c2c7e5c38c19a7738c1a83fead", "url": "https://www.bonappetit.com/story/all-the-ways-daily-harvest-makes-my-life-easier-from-morning-to-night", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "All the Ways Daily Harvest Makes My Life Easier, From Morning to Night | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredAll the Ways Daily Harvest Makes My Life Easier, From Morning to NightI really care about eating well. I also really care about bringing 100% to my job every day getting exercise, staying in touch with my friends and family, and getting a good night's sleep. That’s where Daily Harvest comes in.By Amanda ShapiroMay 20, 2020FacebookTwitterEmailSweet Potato + Wild Rice HashFacebookTwitterEmailRecently I asked a co-worker at Bon Appétit to describe my work style, and she said “ruthlessly efficient.” I’m not sure if it was a compliment or not, but I couldn’t really argue. Ruthless efficiency is how I get through days that rev up with a 7 a.m. alarm and go at warp speed until I crash into bed at 10:30 p.m. It’s also how I take care of myself.See, being efficient means I can leave the office by 5:30 most days, exercise either before or after work, and eat quick, healthyish food most of the time. But I’m no superhero, and that’s why I love Daily Harvest. When I get squeezed on either end—a hectic morning fixing a bug on the site or a night when I’m going from the gym to the shower to a date—I know I can still get a good-quality, delicious, and healthy meal in. Here are some of the ways that Daily Harvest saves my overcommitted butt on the regular.Tart Cherry + Raspberry Smoothie\nBreakfastI love smoothies because they’re a great way to get vegetables into my belly at breakfast. Daily Harvest’s don’t use any added sugars, preservatives, or stabilizers, so they blend and taste like they’re homemade. Tart Cherry + Raspberry, which sneaks in frozen cauliflower, is my current favorite, though I’m partial to the Banana + Greens and Cold Brew + Cacao too.Sweet Potato + Wild Rice Hash\nLunchI’m a dedicated lunch packer: no long lines for $16 salads allowed. I’m very stubborn about this rule, which means that Daily Harvest’s bowls are often what I grab-and-go. The Sweet Potato + Wild Rice Hash is made with all whole, unprocessed vegetables and grains and heats like a dream in the microwave. It powers me through until dinner...and keeps me from prowling around in the Test Kitchen at 3 p.m.Late NightI don’t usually eat dessert when I’m at home—and I definitely don’t bake desserts on the regular—but I do sometimes crave a bite of something sweet at random intervals throughout the day. Daily Harvest’s Bites are like having a container of (healthy!) cookie dough around at all times. I love all the flavors, but the Cacao Nib + Vanilla ones, made with real vanilla beans and dates, will always reign supreme. They’re soft and chewy so I can eat them right out of the freezer, no baking required. And that’s what I call ruthless efficiency.Get $25 off your first Daily Harvest Box with code HEALTHYISH.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-20", "author": ["Condé Nast", "Amanda Shapiro"]}