{"id": "e4111535b6a01b2a3ec10d2954db4a97", "url": "https://www.bonappetit.com/story/5-fish-sushi-lovers-need-to-know", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "5 Fish Sushi Lovers Need to Know | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored5 Fish Sushi Lovers Need to KnowBy Princess CruisesFebruary 22, 2018FacebookTwitterEmailFacebookTwitterEmailJapan is consistently on the must-visit list for adventurous travelers and Tokyo boasts some of the world’s best culinary experiences. You’ll find everything from rich, traditional ramen, udon, and soba noodles to expertly prepared sushi and sashimi from world-renowned chefs. When you board one of Princess Cruises’ ships to sail through Japan’s pristine waters, make sure you add a land tour for an in-depth and delicious adventure.On your next journey there, pay a visit to Tokyo’s sprawling Tsukiji Fish Market. The world’s most extensive variety of fish, bivalves, and crustaceans are on display with species most people have never seen or heard of. Chances are if you can find it in the ocean, it’s probably here. Before you arrive to explore, here are five fish to add to your sushi-lovers’ hit list!Aka Yagara — CornetfishThis is a fish unlike any we’ve seen before! This long, bright pink-hued fish is caught in Southern Japan’s coastal waters of Miyazaki and Kagoshima and feeds on small fish, crustaceans, and other invertebrates. With a unique body shape—which grows up to 6 feet in length—it has delicate white flesh that is great sashimi-style or salt grilled, and can even be served steamed or in soups.Itoyori — Threadfin BreamA distinctive fish with sun-yellow stripes, the Threadfin Bream features mild lean white meat and a distinctive flavored skin. Found in the sand and mud of Nagasaki and Fukuoka, it’s caught year-round but is usually at its best in the spring and summer. This versatile white fleshed fish can be prepared in a variety of ways, so keep an eye out for it on menus served as sashimi, traditional nigiri sushi, boiled in soups and hot pots, or even grilled.Ishi-Dai — Knife JawIf you see this on a sushi menu, be sure to try it—this rare species is not often seen at restaurants. The small black and white striped fish is indigenous to Japanese waters and spends most of its time swimming in shallow waters. Despite its size, it feeds on sea urchin and other shellfish using its strong jaw. It has a clean, sweet flavor and a surprisingly high fat content—perfect for shiromi-style sushi.Kinki — ThornyheadWith shrimp as its primary meal, this wild-caught bright pink fish has a delicious high fat content—akin to the coveted otoro. Its smooth, buttery flesh is perfect for sashimi but this weird looking thornyhead rockfish (also sometimes known as idiot fish!) is also prepared in other ways. You’ll find it deep-fried whole or simmered gently in broth. This deep-sea fish has become a somewhat rare find at Japanese markets, due to restrictions on overfishing.Tachiuo — BeltfishWith stunning silver skin, this slender fish can reach up to seven feet long, but most found in fish markets are around three feet. Found year-round in most parts of Japan’s oceans, it’s considered by many local seafood lovers as more of a summertime treat. The flesh has a mild taste and is served in a variety of preparations—raw or as aburi sushi (where it’s partially seared via blowtorch), boiled with soy sauce and fish broth, or even served with sake as an Izakaya snack.Explore Tokyo with Princess Cruises' NEW Temples & Traditions Tour.Learn More About Culinary Destinations at www.princesscruises.com/bonappetitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-22", "author": ["Condé Nast", "Princess Cruises"]}