{"id": "e4167df512fc114c515e4f93c3d49ad4", "url": "https://www.bonappetit.com/story/how-to-roast-pumpkin-seeds", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "How to Roast Pumpkin Seeds in 6 Steps | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRoasting Pumpkin Seeds Is 100% More Fun Than Dressing Up Like A CatThe reason I'll never stop carving jack o' lanterns. By Aliza AbarbanelOctober 28, 2019FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Mariana Velasquez FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we make with our eyes closed.I’m not big on apple-picking or cider donuts, but I can’t let October pass by without carving at least one pumpkin. And while my jack o’ lanterns are never as spooky as expected, my roasted pumpkin seeds are reliably delicious—and super easy to make at home. I’ve even been known to host pumpkin carving parties to double my yield (so when I invite you over, well, that’s why). Here’s how to do it at home.Step 1: Select your pumpkin. I've found that the bigger the pumpkin, the bigger (and tougher) the seeds. Because I’d prefer not to spend my evening chewing pumpkin seeds, I opt for a medium-sized pumpkin. You do you.Step 2: Carve your pumpkin. Okay, you’ve probably done this before, but here’s a quick refresher: Use a sharp knife to cut around the pumpkin stem, pull off the top, and scoop out the insides (a serving spoon does a good job, as does an ice cream scoop). If you’re intimidated by the sticky-slimy pumpkin guts, channel the bravery of your second grade self who held an eyeball (okay, a peeled grape) at a haunted house and dive in. Use a fork to scrape the sides and dislodge any stubborn strands, then use your fingertips to pinch the seeds off the pulp and put them in a bowl.Step 3: Prep the seeds. I know you want to start working on that jack o’ lantern, but maximize your time and do this first. Fill the bowl with water and swirl around the seeds, using your fingers to remove any stuck-on pieces of pulp. Then use a slotted spoon to skim the seeds off the top, and place on a clean kitchen towel to dry out for about an hour. It's worth the wait: Allowing the seeds to dry first ensures they’ll crisp—not steam—in the oven, allowing for maximum crunch. Carve your pumpkin while you wait!Step 4: Season the seeds. Preheat your oven to 325° F with a rack in the middle. Add your dry pumpkin seeds to a rimmed baking sheet, then toss with a few tablespoons of olive oil, a pinch of kosher salt, and two teaspoons of your preferred spices. I usually opt for a smoky mix of cayenne pepper and paprika, but do what feels right. Smoked paprika, za’atar, and even cinnamon all work great. Use your hands and really get in there to make sure each seed is evenly coated.Step 5: Roast! You want toasty, golden brown pumpkin seeds, which should take around 20 minutes. Give them a shake halfway through to assess the browning and ensure an even bake. If your seeds are large or not fully dry, this will take a little longer, so keep an eye on things and stay patient. For slightly cheesy pumpkin seeds, immediately them toss with a drizzle of olive oil and a few shakes of nutritional yeast once they’re out of the oven.Step 6: MunchI love to use roasted pumpkin seeds to top hearty fall salads and creamy, coconutty squash soups.But if we’re being honest, I usually just eat them by the handful. It’s a seasonally festive, deliciously salty snack—and just the thing to balance out a few (okay, five) Reese's peanut butter cups on Halloween.Still need something sweet?Suspiciously Cheesy Apple Crumb BarsIncorporating Cheez-Its into the dough results in a toasty, buttery flavor that your friends will be able to identify as deliciousness, but not necessarily as cheesiness. (Trust us, we did a blind taste-test!)View RecipeExplore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-28", "author": ["Condé Nast", "Aliza Abarbanel"]}