{"id": "e425e363d9de191316bb369f23c1512e", "url": "https://www.bonappetit.com/story/victory-prima-pils", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Victory Prima Pils Is My Self-Isolation Beer of Choice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureVictory Prima Pils Is My Self-Isolation Beer of ChoiceI can’t visit my favorite craft breweries right now, but I can still get my hands on this.By Alex DelanyApril 3, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailWelcome to Glass Half Full, a monthly column from drinks editor Alex Delany about what he’s drinking (and loving) right now.I would be lying if I told you I wasn’t the kind of person who succumbs to the appeal of limited-edition this and small-batch that. Only twenty cases of a single vineyard Riesling made? Hand it over. Sherry lost in a basement for 20 years? Sign me up. But since I’ve been self-isolating, my priorities have changed. Now I’m looking for the most available thing, instead of the rarest. Which is why I’ve been drinking a lot of Victory Brewing Company’s Prima Pils, one of the greatest and most accessible pilsners ever brewed in America.This beer and I first met when I pulled it from a college dorm room fridge, after all the cans of familiar stuff (read cheap, watered-down lager) had disappeared. I had no idea what I was holding when I cracked it open—what “craft” even meant or what made a Pilsner different from anything else—but it was an instant revelation when I sipped it: Bright and crisp with flavor that was actually, well...there. I credit Prima Pils as the beer that got me into exploring craft beer, and Victory Brewing as the brewery to introduce me (as well as the mass market) to American Belgian-style tripels, sour ales, and double IPAs.Close to a decade since my initial encounter—after drinking tens, hundreds, thousands(?) of them—the flavor still excites me. The European-style hop character, giving spicy, lightly bitter notes of bright lemon rind, flower roots, and fresh cut grass. Pilsner malt that shines through soft and warm, like running your hands through a bucket of grain that’s been sitting in the sun. And most importantly (when it comes to pilsner), a drinking experience that’s crisp and intentional. Sipping it feels like spotting a waterfall on the side of a mountain. It’s a patio beer. It’s a lawnmower beer. It’s a summer beer. It’s a winter beer. It’s a lunch break sipper or an after-work crusher. And yes, it’s a self-isolation beer.And here’s the best part: Chances are you can find it wherever you’re getting your groceries from right now. (And if you can’t, beers like Firestone Walker Pivo Pils or Oskar Blues’ Mamma’s Little Yella Pils are also fantastic and widely distributed.) Knowing I have a few bottles in the fridge means I don’t even miss the small-batch stuff I was drinking when I was still able to run to a craft beer shop, brewery, or bar. Plus, it’s a nice reminder that little, normal things can still make me happy. And that at least some things right now don’t have to change.Buy it: 6 Pack of Victory Prima Pils, from $11 on DrizlyAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitGlass Half FullRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-03", "author": ["Condé Nast", "Alex Delany"]}