{"id": "e42e8c4a221f8475118fa774230a6d98", "url": "https://www.bonappetit.com/recipe/chile-crisp", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Chile Crisp Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChile CrispBy Chris MoroccoJuly 24, 20184.6(116)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis all-purpose chile crisp—which is tangy, spicy, and crunchy—will give your other condiments an inferiority complex. You’ve been warned. Put it to good use on eggs, meat, seafood, and our Celery, Green Bean, and Tofu Salad.IngredientsMakes about 2 cups4small shallots, thinly sliced2heads of garlic, separated into cloves, sliced1½cups vegetable oil23\" cinnamon sticks6star anise pods12\" piece ginger, peeled, very finely chopped¼cup crushed red pepper flakes2Tbsp. soy sauce2tsp. sugarPreparationStep 1Bring shallots, garlic, oil, cinnamon, and star anise to a simmer in a medium saucepan over medium heat. Cook, reducing heat as needed to maintain a gentle simmer and swirling pot occasionally, until garlic and shallots are browned and crisp, 20–25 minutes. (Take your time—you want to drive all the moisture out before they brown.)Step 2Mix ginger, red pepper, soy sauce, and sugar in a medium bowl. Strain shallot mixture through a fine-mesh sieve set over ginger mixture. Let garlic and shallot cool in sieve (this will allow them to crisp further) before stirring back into chile oil.Step 3Do Ahead: Crisp can be made 1 month ahead. Cover and chill.Photo by Alex LauHow would you rate Chile Crisp?Leave a ReviewTell us what you thinkReviews (64)Back to TopTriangleThis is the best recipe!! Completely addicted now (no joke!). Followed recipe for the most part, except added toasted (freshly ground) Sichuan peppercorn. I used Grapeseed oil. I did fry the garlic & shallots separately, kept them in the strainer over night & crisped up nicely, married every thing next day. I kind of panic when i'm down to my last teaspoon. It is a must for me to double this recipe each time. This is so very good!!JTCape Canaveral12/8/2021We double this and make it often, it’s the best recipe out there. It’s a labor of love and worth every minute. Definitely recommend checking out the insta story with Molly if you’re at all confused on the process, it is time consuming and you have to pay attention, but its not actually difficult.  If you’re not sure whether the solids are ready, color is the best indicator, but you can also pull a shallot out with a fork and drop into the sieve — it should immediately crisp up. If it’s at all chewy, keep going, but stay close; the color might feel like it holds forever but when it turns, it goes  fast.\n\nI recently tried frying the onions/shallots in the microwave per the serious eats article (google it) — it’s easy, worked perfectly and was a bit less involved than stovetop, but at least in my microwave, didn’t save that much time. Your mileage may vary.\n\nWe also prefer pouring off about a third to half the oil before blooming the chili mixture. You need enough to cook with, but not all that much for storage/serving. (Using the oil on its own just triggers the craving for moar crisp!)\n\nBoiling off 1:1 water/white vinegar helps a lot if the smell lingers. \n\nLast but not least, drying the solids separately overnight does keep things crispier, but it’s still delicious when jammy and soft, so enjoy the journey.Anonymous10/26/2021This recipe was fantastic, great heat along with great taste all around. Not sure where some are having problems with this one. It’s pretty straight forward and easy to prepare. I had to adjust me heat all the way down to the ‘lo’ setting and it took around 35-40 minutes to get perfectly crispy and golden brown. That’s ok though, the extra 10 minutes are worth it versus blasting it with heat and burning the garlic and making it bitter. This will definitely be on the table from now on, excellent condiment!!!BluekythunderTampa, FL9/9/2021Onions & shallots came out nice & crispy after I left them on sieve after pouring the hot oil into red pepper mixture. I am not sure if I should put the shallots & garlic back into the bottle of chiili oil as these may become soggy.  Also  what do I do with the star anise & cinnamon sticks - do these go back into the chilli oil or discarded, as instruction about these not given.JenniferSingapore5/30/2021Rune: maybe this will explain it better: You have a bowl with ginger and 3 other ingredients. Set it down on the table (or other flat surface). Take a sieve and set it on top of the bowl. (Ideally it sits nicely right in the bowl.) Now (carefully!) pour the shallots, garlic and oil mixture through the sieve into the bowl. Lift the sieve, let those solids cool (someone below suggests overnight) before you put them into the bowl and mix everything together.Dan WConnecticut4/18/2021\"Strain shallot mixture through a fine-mesh sieve set over ginger mixture\" \nset over ginger mixture??\n\nRuneNorway3/26/2021Made exactly as described; turned out perfect.  Perfectly crisped, perfect heat level.Rosy BGrand Lake, CO3/11/2021I just made a low-carb version of this for keto dieters using powdered erythritol in place of the sugar and WOW! SOOOO GOOD! LOVE IT!\n\nAfter reading a number of whiny reviews here, I'd like to add that I don't find the recipe problematic at all, on the contrary. I used a medium-sized (3 qt/2.9 l) sauce pan and my shallots and garlic came out browned and nice and crunchy in about 25 minutes, as in the recipe.TimSpringfield, OH3/10/2021We don't have shallots where I live so I subbed leeks, which didn't get crispy, but the flavors -- hot, fragrant-- are fantastic.\nLeeRio de Janeiro3/4/2021I have made this recipe countless times now and I want to mention a couple things. It’s very important that the frying part is done in a shallow pot. I use a stainless steel pan. If you do it in a smaller pot the frying will take FOR EVER. Then, I highly recommend letting the fried shallots and garlic air dry overnight and then add them to your chile oil. That way they will stay crispy much longer. Every time I’ve put them right away, they become soggy in a matter of days. I also recommend subbing the sugar for honey and adding sesame seeds for the extra crunch. I do a big batch that fits in a 1L masson jar and I finish it in 3 weeks! Huge staple in my house. And also makes a really great gift :)Aleksandra ZMontreal, Quebec2/26/2021As other reviewers have mentioned the timing for “crisping” the garlic and shallots is extremely misleading. I spent 1.5 hours on this recipe, taking it slow (~30 minutes in the oil) only to be left with mush and far from a chili crisp. Save yourself some time and fry the shallot and garlic at a higher temperature quickly otherwise they won’t be crispy.  Also don’t go too fine on the mandolin so there is enough thickness to crisp up. Serious eats recipe for chili crisp has a much better method.Anonymous2/14/2021This is the best- have to keep myself from eating with a spoon immediately. I literally can't make enough.  I use olive oil, works great, but does solidify in the fridge- nothing a spoon can handle.  You can easily riff on this- I made soup last night and just used the trick of simmering onions with the chili, and then adding the garlic, lots of salt, and a little sugar.  MMMMMMM. UrsulaPortland, OR2/13/2021Could you use avocado oil?CoraPhoenix, AZ1/14/2021Shallots are not available where I live. Can I use onion instead?LeeRio de Janeiro1/13/2021LanGaoMa brand “Spicy Chili Crisp” is addictive and FAR superior to Trader Joe’s, which is more fiery but without any other flavor.MsMMSanta Monica1/13/2021Explore Bon AppétitSauceCondimentChineseEast AsianAsianChileVegetableGarlicShallotQuickEasyVegetarianVeganDairy-FreeNut-FreeHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-24", "author": ["Condé Nast", "Chris Morocco"]}