{"id": "e43106ac1c81e0ead46a5dbfc6ed098a", "url": "https://www.bonappetit.com/recipe/swiss-meringue-buttercream", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Swiss Meringue Buttercream Frosting Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueSwiss Meringue ButtercreamBy Natasha PickowiczSeptember 18, 20185.0(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou and Natasha Pickowicz, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintThis silky, stable frosting smooths beautifully over cake and can take any number of flavorings, from vanilla to chocolate to espresso. Use this buttercream recipe to make Black Forest Layer Cake with Cherry Preserves, Tiramisù Layer Cake with Mascarpone Mousse, or Vanilla Layer Cake with Mango Curd.IngredientsMakes about 4 cups1cup plus 2 Tbsp. (225 g) granulated sugar5(135 g) large egg whites½cup (65 g) powdered sugar1cup plus 5 Tbsp. (300 g) unsalted butter, cut into pieces, room temperature1tsp. vanilla extract½tsp. kosher salt1vanilla bean, split lengthwise; 5½ oz. bittersweet chocolate, melted, cooled but still liquid; or 3 Tbsp. espresso, cooledPreparationStep 1Combine granulated sugar and egg whites in the bowl of a stand mixer and set over a medium saucepan filled with 1\" of gently simmering water (do not let bowl touch water). Heat, whisking constantly, until sugar is dissolved and an instant-read thermometer registers 115°, about 5 minutes.Step 2Fit bowl onto stand mixer fitted with whisk attachment and beat on medium-high speed until meringue is stiff, glossy, and dense, about 5 minutes. Turn off mixer, add powdered sugar, and mix on low speed until incorporated. Increase speed to medium-high and beat until the bowl is cool to the touch, about 2 minutes.Step 3With the motor running, add butter a piece at a time, incorporating fully before adding the next piece, 8–10 minutes. If mixture starts to look chunky or liquidy, just keep beating; it will come back together. Scrape down the sides of the bowl and add vanilla extract and salt. Beat until buttercream looks glossy and smooth. Scrape in vanilla seeds (discard pod) or add chocolate or espresso, depending on desired flavor. Beat until smooth.Step 4Do Ahead: Buttercream can be made 3 days ahead. Cover and chill. Bring to room temperature, then beat until smooth before using.How would you rate Swiss Meringue Buttercream?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleI’ve tried hundreds of frosting recipes. Found this one last week. It is by far the easiest, fluffiest, best tasting frosting I’ve ever made. It is now the only one ( 12 cakes now ) I use. Try it for yourself. \nYou will not be disappointed. Brenda Belleville, Michigan10/28/2021I’m not a very experienced baker, but wanted to make a 7 inch, 3-layer cake for my anniversary. For the batter, I made the “no mixer vanilla cake” recipe that is also on this website. I didn’t follow the icing recipe for that and used this one instead. It’s a very forgiving and luxurious icing. Easier to apply than others I have tried in past. It was fluffy and not gooey. It didn’t pick up many crumbs like I was worried about (although I did chill the layers prior to frosting). I probably used too much egg white due to jumbo eggs, but it was still silky and delicious. I mixed a cup of the icing with some strawberry jam for between the layers. The icing held up well, structurally, tasted delicious and looked pretty too. I used some flowers and berries covered in caster sugar as decoration. A perfect frosting. Anonymous10/11/2021What a fantastic frosting! I had tried making an italian meringue buttercream from another site once, and didn't like many things about how it came out... this recipe, however, was ideal for me. I didn't find the butter taste too strong at all (remember, though, to use a butter you actually like! I used european-style and I think that extra creaminess was good). The frosting was so silky—YET held its shape without being too firm/like solidified butter in texture when re-chilled. I've always been a person to scrape off most frostings on cakes out there in the world, but this is one of the only ones I'd eat straight with a spoon. Damn! Never thought I'd see the day tbh. \n\nAdvice notes: It is helpful to lay out all of your ingredients and bowls before beginning—this does save some scrambling and anxiety that can be associated with more complex processes like this one. Like another commenter said, I also reduced mixer speed some while adding the butter and then increased it again to do the flavor incorporation and final smoothing-out. AnonymousNJ9/23/2021So good! When I first tried this recipe, it paired so well with the cake I made. However it did taste like sweet butter like some other commenters mentioned. This time I halved the recipe, feeling confident 3 eggs would balance out the butter better. I chose to do a matcha buttercream with a little lemon zest and it is lovely. It is fluffier than my first attempt but the flavor is so good. This is now my go to frosting recipe, thank you :). Matcha5/1/2021No matter how many recipes I try for American Buttercream, I end up tossing it because no matter how many adjustments I make to it by adding salt, vinegar, lemon juice, etc. it is so cloyingly sweet that I just can't eat it so I always end up making cream cheese frosting instead but sometimes cream cheese frosting doesn't pair well with certain types of cakes so was looking for a vanilla one that wasn't so sweet.  I finally found the recipe I was looking for!  This is silky, smooth and just perfect amount of sweetness to pair with any cake. It is nice because it doesn't taste eggy nor does the butter overpower the taste.  It is just perfect!  I should mention that I like to weigh my ingredients and noticed that my 5 egg whites weighed 154g which was more than what the recipe said for 5 egg whites.  I still kept all the egg whites but did weigh the sugar and all other ingredients as per recipe and it still worked well so it appears you don't need to be too worried about removing some the egg whites if the 5th egg provides more weight than what is noted.   I can't wait to try the coffee and chocolate variations too.  This is a dream to pipe as well.  Nancy ADanville, CA5/1/2021Beautiful consistency, not too sweet, as others have mentioned. Surprisingly easy to make, despite being more time-consuming than other frostings. However, I made some mistakes: first, I used it for cupcakes. In large quantities, the frosting tastes a bit too much like sweetened butter. I might try it again for cupcakes but use about 50g less butter and dial up the sugar a bit as well (yet to see how this will affect consistency). Second, I used vanilla extract rather than vanilla bean; this also made the frosting taste much too plain. Because it isn't very sweet, you really do need a stronger flavour addition. I can see why chocolate or espresso were the other suggestions. Will definitely make again, but will correct the errors above.AnonymousSaskatoon, SK11/16/2019This icing is amazing!\nIt's so much better than using cream cheese.\nI like how you don't need much icing sugar as that usually takes away from the flavour. \nI'm very surprised I managed to follow the recipe, especially the butter bit and get it nice and fluffy. \nCaitlin MountfortWellington, New Zealand9/23/2019I absolutely love this frosting in all flavors. it was easy to work with and it covered a 3 layer cake. I haven't tried the cake but will very soon.  thank you for sharing.AnonymousNC1/27/2019This buttercream recipe is unreal. IT'S CHANGED MY LIFE. It's unbelievably silky smooth, and the perfect balance of buttery and sweet (and not too sweet). I used it on a chocolate Buche de Noel and am loving every bite!AnonymousBrooklyn, NY1/8/2019This buttercream recipe is unreal. IT'S CHANGED MY LIFE. It's unbelievably silky smooth, and the perfect balance of buttery and sweet (and not too sweet). I used it on a chocolate Buche de Noel and am loving every bite!AnonymousBrooklyn, NY1/8/2019This butter cream recipe is awesome!! I will now use this for all my frosting needs!!! I'm making a champagne cake and would like to make this in a champagne flavor. Any suggestions on how to do that???AnonymousGrants Pass, OR12/16/2018THIS IS THE HOLY GRAIL OF FROSTING. Simply put, it blew my mind. I am not a professional but I spend a significant amount of time cooking/baking from scratch and this frosting is unlike anything I've made before. The texture, color, and flavor are absolutely magical and it will be the only recipe I use from now on. Yes, it is more labor intensive but it is so so worth it. AnonymousOhio12/9/2018I just finished making the chocolate variant of this recipe and it's absolutely divine. I added a few notes as I felt the mixer speed directions were somewhat vague, but with buttercreams (after the meringue has stabilized) there's very little change of over-whipping, so winging it worked fine. \n\nMy notes: Beat on medium while incorporating butter, medium-high after adding vanilla and salt, and high at the very end for about 1-3 minutes. \nAt high altitude, the extra steam from the simmering water reduces the meringue \"cook\" time to about 3 minutes, so be present if cooking above 7500 ft. \nI used Guittard chocolate chips (red bag) as they are my favorite. Stored in two piping bags in a freezer bag in the freezer for easy transfer to a mixing bowl to re-whip before use.\n\nIt tasted so good it put my old buttercream recipe to absolute shame. I hope others enjoy this recipe as much as I did!mollandralin10/4/2018Explore Bon AppétitDessertSwissEuropeanVanillaHerbs & SpicesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Natasha Pickowicz"]}