{"id": "e442396e4f7cceb13847187cd5a6cd53", "url": "https://www.bonappetit.com/story/cotija-cheese", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "What is Cotija Cheese, the Salty, Crumbly, Addictive Cheese That We'd Find Any Excuse to Eat? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Salty, Crumbly, Addictive Cheese That We'd Find Any Excuse to EatNot just for elote.By Emma WartzmanAugust 28, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailThe generous dusting of Cotija on elote is nearly as important as the corn itself, bringing the sweetness of the kernels and the tang of the sour cream into harmonious balance.Cotija is a Mexican cow’s milk cheese named after the town of the same name in the state of Michoacán. It’s white in color, firm and dry in texture, and salty and milky in flavor. When it’s younger (as in, aged for a shorter amount of time), its texture is akin to that of feta: moist and crumbly. And when it’s older (aged for longer), it becomes sharper and firmer, more similar to Parmesan. While ricotta salata is sometimes suggested as a substitute, Cotija has a distinct funk that can’t be so easily replicated.You can buy it in a block, which allows you to break or shave it into pieces of any size, or you can get it pre-grated. The grated stuff is similar to the finest pre-grated parm you see at the grocery store (the kind that looks like fluffy snow), and it’s what we call for on the elote. Simultaneously light and bitsy, it sticks to the corn perfectly.While Cotija will soften with heat, it doesn’t melt, making it most suited for crumbling and sprinkling. Of course, it’s most frequently in Mexican cooking—you might see it as a finishing flourish on enchiladas, nachos, tacos, chilaquiles, or posole. (It even makes an appearance on the Venezuelan sticky buns called golfeados.) But if there’s anything to know, it’s that Cotija is a beautifully versatile cheese that can (and should) be employed outside of those classic dishes.I'll fight you for those cheesy bits!\nPhoto by Chelsie Craig, Food Styling by Kate BuckensIn this veggie burger, for instance, it’s worked in with the mushroom and black bean mixture to flavor to the patty. And because it’s such a dry cheese, it doesn’t mess up the consistency of the burger. You could even swap it for the feta in these meatballs.In general, you can use younger, softer Cotija as a stand-in for Greek feta, and—as long as you’re not trying to emulsify it into a pasta sauce—the older, harder version in place of parm. (This corn salad even calls for Cotija, feta, or parm, depending on what you have around!) Try Cotija in Plum Salad with Black Pepper or Napa Cabbage Salad with Pistachios. Want to marinate it for a supremely easy, fancy-looking party app? Sure! Toss in this tomato number? Absolutely. Load it on top of these Smashed Crispy Potaoes! Grate it over a watermelon-lime salad for a hit of salt! Sprinkle it all over your next frittata!.So go ahead, buy some cotija for elote—and then use up the rest. And then buy some more. It’ll be gone before you know it.Get the recipe:No-Grill EloteEverything you love about Mexican elote—the charred kernels, the creamy-spicy-salty sauce, lots of lime—without the grill.View RecipeExplore Bon AppétitCheeseMexicanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-28", "author": ["Condé Nast", "Emma Wartzman"]}