{"id": "e443c33f56c338bc50653946ce88460b", "url": "https://www.bonappetit.com/story/jeff-goldblum-podcast", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "Jeff Goldblum Is the Van Gogh of Fro-Yo | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureJeff Goldblum Is the Van Gogh of Fro-YoThe Jurassic World: Fallen Kingdom star takes a dab of every. single. flavor.By Adam RapoportMay 30, 2018FacebookTwitterEmailSPECIAL PRICE. American actor, Jeff Goldblum.Photo by Phil Knott/Camera Press/ReduxFacebookTwitterEmailJeff Goldblum knows his sushi. “I remember when the very strict Mr. Nozawa of Nozawa was up in Studio City, Los Angeles and I visited there,” Goldblum says. “He was the first one who told me no soy sauce, and don’t ask for a California roll or anything like that, because we’re gonna kick you out of here.” What Mr. Nozawa probably doesn’t know is that Goldblum likes to follow his sushi dinner with frozen yogurt—a high/low situation we can totally get behind.Read on to find out what the actor is eating when he’s not dining out, his very strong feelings about coffee, and how he loves to nap.What did you have for breakfast today?I was feeling a bit peaked this morning. I traveled to Toronto recently, and I was in the Berlin Film Festival premiering this Isle of Dogs movie, so there was a time change. I had to stabilize myself with very austere oatmeal, which I love to make. And I liked it today even more.How do you take your oatmeal?I add a little goat’s milk. My wife, who is French, has found the best butter in Los Angeles, actually through my friend Jonathan Gold. So I like to put a little of that in.Is it in a gold wrapper? Bigger than a hockey puck?Yeah, you know the exact one.”[Editor’s note: It’s Rodolphe le Meunier Beurre de Baratte.]The butter even looks fancy.\nPhoto by Danny KimAlso, I don’t think people typically have goat’s milk in their fridge.I think I’ve tried every kind of milk. But the kids have been drinking goat’s milk these last couple of years, so that’s all we have there. And I like it.What about coffee or tea in the morning?Well, that brings up an interesting issue. For one reason or another, I gave them both up, and I’m so very happy right now. It’s personal. Even my trainer said, “Three cups a day is good before you work out.” But for me right now, I’m just much happier with a good night’s sleep and some nutrition.You strike me as a type of guy that doesn’t need a lot of energy help.I’m actually lying down on my bed right now. I watched a snippet of you making egg salad about ten minutes ago and I thought, I’m just excited to talk to you. And here I am, spouting nincompoopery.I could talk eggs for a while. How do you like your eggs?Do they call it rustic eggs where you crack the eggs in the pan? You kind of drag them around with a wooden spoon and they become a little white and a little yellow—not all whipped up.That’s how my mother makes her eggs, and that’s how I started making my eggs. The very first food article I wrote for GQ Magazine, probably 13 years ago, was about just this.I can get a little squeamish when they’re less done.Another version of egg salad we love.\nYou, as a man in your mid-60s, are often cited as someone who has got a great head of hair, is in good shape, dresses well. How do you stay so fit?Around age 30, I started to work out, changing my physique a little bit, getting some muscles. I’m nothing if not conscientious and disciplined. So when I took that on, I did it regularly. Now it’s evolved into a regular thing with a little bit of cardio and then a routine with weights. Although given half a chance, I would go outside and play every kind of thing. I like to throw a ball and hit a racket.Nap or meditation?I sort of got into how meditation could be not any kind of particular practice, but a way of being aware and mindful at every moment of your life. Naps are a whole different issue, and I love them.What is your favorite sushi spot in Los Angeles?I adore sushi. I just went last week to Sugarfish. But Sugarfish is the populist version—and delicious version—of Nozawa. I enjoy going to eat sushi with my friend Gary, who’s on the paleo diet except for when he eats with me. And then we go have frozen yogurt down the street, too.Fro-yo? You go in for fro-yo dates?Yes, we do.How do you take your frozen yogurt?I get a medium-sized cup and then I go down the line. I get anything that appeals to me, and it’s different every time. About six or seven flavors usually.What are some favorites?I hit the handle for a second and go to the payment area with a bunch of little dabs. It looks like a Van Gogh painting of some kind. I don’t put any of the toppings on. Then I spoon it and I go, “You know, they all taste the same.”This interview is a condensed version of a conversation on the Bon Appétit Foodcast. Listen to the full episode here, or wherever you get your podcasts.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitCelebritiesPop CulturePodcastsRead MorecultureYara Shahidi on the Family Meals Worth Deferring College ForBy Maxwell LosgarLifestyleZoe Lister-Jones on Hiring an All-Women Film Crew and Being a ‘Bone Brothatarian’By Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-30", "author": ["Condé Nast", "Adam Rapoport"]}