{"id": "e44b362e93af504d1c5fa5c90b0ee06d", "url": "https://www.bonappetit.com/story/best-party-snacks", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "12 Quick and Easy Appetizers You Can Always Keep on Hand | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingKeep These Snacks on Hand to Guarantee the Party's Always at YOUR HouseThe best way to get your friends to come to you is to entice them with delicious offerings. By Maggie LangeDecember 18, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiFacebookTwitterEmailI am a cozy person, which means I’m also the quickest to suggest that the hang be at my house. If you also like socializing but not transporting yourself, I have a trick: stockpile an easy, surprising array of snacks. “I have persimmons\" is the most confident closing argument to any question about whose house to meet at.Below are an assortment of snacks that will establish and maintain your house's status as a default location. You’re too reasonable to go overboard with a Bûcheron always on deck, but you can still be competitive and unexpected. Almost everyone’s got hummus and cheese and a half-jar of dusty salsa verde. Here’s what you’ve got:DatesDates strut that line between special treat and special occasion treat. So much gooey promise. They’re like honey packets. And I really admire their boundaries. They’re super melty, but they’re self-contained. I’ve never remembered to put out a dish for pits. I am reminding us both to do that!A very good thing to do with dates? Roast them! \nAlex LauSliced Cucumbers with SaltI like to cut Persian cucumbers into quarter-inch thick slices and sprinkle salt over them. If this cucumber slice were an avant-chic beauty look, it would be the one with no makeup except a full face of glitter. It’s simple, but it’s got an opinion.OlivesI love olives, those meaty little agents of salt, more than anything. I think olives operate a little bit like shots of espresso or mezcal—they shake up the internal fuzzes and distract you when the atmosphere feels a little dull. Also there’s something a little fun and barbaric about dealing with a pit. Reminds you that you’re a human with fallible teeth. If you feel like making them beautiful, grate lemon zest over the top.Or marinate your olives and accept your award for “host of the year.”\nPhoto by Heidi's Bridge, styling by Molly BazKimchi & AvocadoDrape (drape! have you ever even draped before?) some kimchi snaggles over slices of avocado. This isn’t a neat snack, but if you’re with a group that doesn’t mind jabbing forks around a shared plate, it’s potent and distracting. It’s really nice with seltzer or light beer. I like Mother-in-Law’s and my boo likes Farmhouse Culture. They do their jobs! And if you’ve got full-fat Greek yogurt on hand, you can mix it with a bit of the kimchi juice for a sauce. If you’ve got sour cream on hand, wow! I like you very much. That’s going to be an even better.Candied GingerI’m going to make an embarrassing claim, but I can’t help myself: candied ginger is the champagne of chewable things. Candied ginger is a food so special-tasting, I truly thought you had to be a friend of my parents’ having a holiday party in order to purchase them. But they are for sale! For all of us! They keep well for a very long time and linger like mini-celebrations.A SalamiA handsome and hearty stand-by. I like mediocre-plus Trader Joe’s Chianti Red Wine Artisan Salami, but I don’t like its name. You can put the whole cylinder on your smallest cutting board with a good, sharp little knife. The glimmer of danger is a fun ingredient to any party! (Prosciutto is another option, but one I’ll never spell right on the first try.)If you can marinate an olive, you can marinate salami. \nGood ChocolateSomething about sharing a bar of chocolate feels like the sincerest gesture of a child. But now that we’re adults, the bars have sophisticated, almost shocking flavors like lime or bourbon. As a non-sweets person, I can also vouch for Raaka’s Oat Milk unroasted dark chocolate bar.Pesto (+ Random Sturdy Cracker Vehicle)In a rare daring moment, I started making seaweed pesto (I throw some torn nori sheets in with the classic basil pesto set) and found it’s even better as a dip than as a sauce. I keep it as a snack-fortification in the fridge. Zhoug is also great in this type of pinch.Garlic Aioli (+ Random Veggie)I went to Pilot, a new restaurant in downtown L.A., where you can order something called The Grand Aioli: a veritable trough of aioli for the table that they promise goes with everything, like a sleek leather status backpack. Well! I ended up believing them. You can keep garlic aioli (blended garlic + olive oil + lemon juice + store-bought mayo) for over a week and serve it with truly all the rando veggies loitering in the bottom drawer: kale, carrots, endives, celery, beets, whatever have you.See this glorious aioli? It was made with store-bought mayo. \nPhoto by Laura Murray, Food Styling by Pearl JonesBlackberriesSometimes it’s easy to find blackberries, sometimes all of the ones you knew have moved to Santa Monica, where they run an influential Instagram account from a white-speckled bowl on a jute placemat. I mix the berries with globs of goat cheese (found that idea in Niki Segnit’s dizzying Flavor Thesaurus) and tears of basil. It’s a messy snack, so I serve it in a medium bowl with little forks. If seasonally unavailable to you, a similar juicy blob option is…Frozen GrapesThese are truly a perfect drop-them-in-a-bowl snack that looks decadent and breezy. I think I have a grape curse where I only buy them when people don’t end up coming over—grapes take up so much prime freezer real estate. Please let me know if this is universal.ClementinesBy clementines, I mean persimmons or kumquats, but I am trying to be reasonable about season and terrain. Clementines are an exquisite late-morning snack and they keep for so, so long. Their little skins are soft but effective. I think food that comes with its own little packaging is very proud about that. Also thanks for your patience as I refine my bragging about the fruit bounty in California, I always mean to be more subtle than just yelling, “I HAVE PERSIMMONS FROM A MATURE TREE IN MY FRIEND’S BACKYARD.”Maggie Lange writes for magazines mainly about music, salty food, books, curly hair, and other things she loves. She lives in Los Angeles, but she still wakes up on East Coast time.Explore Bon AppétitEntertainingappetizerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-18", "author": ["Condé Nast", "Maggie Lange"]}