{"id": "e461f03af6e58cf75d5ce867984c0ee8", "url": "https://www.bonappetit.com/story/guide-to-your-30s", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "The Healthyish Guide to Your 30s | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Healthyish Guide to Your 30sOur best advice for how to cook, shop, date, and generally survive your best (or maybe worst?) decade yet.By Amanda Shapiro and the Healthyish TeamJune 12, 2019FacebookTwitterEmailIllustrations by Marylou FaureFacebookTwitterEmailEvery time I sat down to write this introduction, I laughed. Me? Introduce the Healthyish Guide to Your 30s? I’m less than a third of the way into this weird, wild decade, and my life feels like barely contained chaos. At least I'm not alone: A lot of my thirtysomething friends feel the same, whether they’re single or coupled or otherwise, with a six-figure salary or $600 in the bank, two kids or two dead houseplants. It’s like we all heaved a sigh of relief at the end of our 20s, only to realize with horror that the next decade wasn’t going to be any easier, and actually, in some ways, it was going to be harder. Sure, we may know ourselves better and all that stuff we tell ourselves, but everything around us is going to keep changing—we’re going to keep changing—and are we always going to feel like we're just catching up?I thought 32 would be the year that everything fell into place, because, well, things were falling into place. Ever since I turned 30, I’d felt a sort of settling happening, which seemed right according to societal expectations and most rom coms. I loved my job, my partner, my best friends, and I loved New York. I ran my first 10K on my birthday, a longtime goal. I finally figured out how to like my hair, not to mention the rest of my body. I discovered Crest White Strips! For the first time in my life, I had enough money to not have to worry every week of every month. The rest of the decade stretched ahead, a road paved with possibility and good hair days, and I thought I saw where it would lead.You know what happens next. Okay, it didn’t all go wrong. And not so much “wrong” as very much not the way I expected. Six months after my 32nd birthday, I’d lost two best friends to jobs in other cities, my relationship fell out from under me, I got a back injury from running, had a bad health scare, and—after an expensive move—found myself back in a financial hole.I did all the things that needed to be done. I hired the movers, bought the furniture, made the doctors’ appointments, found the therapist, paid the credit card bills, did the yoga, got myself to work, and cried, cried, cried like everyone told me I would. And then, after the basic logistics were handled and it was just me and the tears, I decided to have a ridiculously impulsive, borderline irresponsible good time.One could call it a bender, but I prefer to call it grown-up fun. Grown-up fun is fun you don’t think you should be having because no one is telling you it’s okay. When we were kids, adults were constantly telling us to go play. In college, they told us to explore. In our 20s, they loved reminding us not to worry, have fun, we’ll figure it out! But the minute we turned 30, people stopped telling us to have fun. In our 30s, we’re supposed to be done exploring. In our 30s, fun is to be planned and budgeted for (that weekend upstate, that Saturday dinner party) or else it’s something to feel guilty about the next day (that second bottle of wine, that extra hour of Big Little Lies when you should’ve been sleeping).Grown-up fun, on the other hand, is no-regret, impulsive, and unrestricted fun. For me, it's involved a lot of dancing, biking, kissing, lying in parks, feeding people, being fed, late nights into mornings, new friends, fresh flowers, ice cream cones, cannabis, so much music, and other things I don’t need my mom to know. None of it has been a miracle cure; a lot of it has been distraction. But each time I choose grown-up fun, it makes me a little happier, and over time I found that I was happy nearly as often, then equally often, then much more often than I was sad.In the last few months of grown-up fun, I’ve been thinking about “adulting,” that concept that keeps finding new life on the internet. Adulting essentially means “doing adult stuff even though you don’t feel like you’re actually an adult.” In our 20s, we said we were adulting if we paid our rent on time and didn’t sleep with that toxic person too often. These days, adulting could refer to taking out a mortgage, managing people at work, caring for an aging parent, giving birth to an actual human (!), or maybe still not sleeping with that person too many times. We could probably say that we're adulting for the rest of our lives, because adulting is basically doing anything we don’t feel equipped to do.But, as others have pointed out, adulting is a terrible concept, and not just because it’s privileged, sexist, and grammatically incorrect. Adulting sucks because it turns adulthood into a junk drawer and stuffs everything that’s hard or annoying into it. None of the good parts—the too-late nights, the impulse plane ticket, the nap you snuck into your Sunday afternoon—make it into the drawer because we don’t consider those things part of adulthood; we consider them a reprieve from it.Grown-up fun, I'd argue, is the inverse of adulting. It tips over the junk drawer of adulthood and refills it with everything we thought we weren’t supposed to do, everything we’ve always wanted to try but never did. It allows fun to take its rightful place in our lives instead of being something we explain away, apologize for, or regret.So right now you’re thinking, Okay, this person’s advice for my 30s is to become some kind of hedonist? No, this is Healthyish, not Burning Man. We like balance here, and, let me tell you, one can’t exist in a sleep deficit forever. Recently I’ve been trying to integrate grown-up fun into my life the way I would any other so-called responsible habit: cooking, exercise, calling my friends, getting a solid eight (okay, seven...sometimes six) hours. And I’ve been relying on friends and strangers I trust for advice on making it through this head-spinner of a decade.This guide is a collection of that advice from some of those people, like Illinois congressperson Lauren Underwood (who's 32!) on fighting imposter syndrome, two of my favorite writers, Zan Romanoff and Glynnis MacNicol, on the weird world of dating (and not dating) in this decade, Eileen Fisher on how you should be more present with your kids, and Christina Chaey on the kitchen investment pieces that she and other staffers actually think you should buy. And lest you think we’d forget the food: Amiel Stanek and Lauren Schaefer wrote about living their best dinner-party life this decade, with a spring bean stew recipe to get you started.I hope the stories in this guide remind you that this decade—and every decade—is up to you to live how you want. There’s going to be a lot of hard shit. The tree will fall on the house, metaphorically (maybe your 30s is the time to invest in renters or homeowners insurance). The job will be unget-able. The relationship, untenable. We’ll handle these things, not because we’re adulting but because we’re humans, and it’s in our nature to figure them out. And when it comes to fun, that’s in our nature too, but no one is going to give us permission to have it. We have to take it and run. —Amanda Shapiro, Healthyish editorThe Healthyish Guide to Your 30s:30-Something Dinner Parties Are the Best Dinner Parties—Amiel Stanek and Lauren SchaeferThe 9 Kitchen Items BA Staffers Are Buying and Keeping for Life—Christina ChaeySo Your Friends Had a Kid. Here's How to Hang Out With Them Even If They Eat Dinner at 5 p.m.—Julia Kramer and Meryl Rothstein“If I Could Do My 30s All Over Again, I'd...”Lauren Underwood Is Doing Her 30s Better Than Just About Anyone We Know—Hilary Cadigan6 Things I Changed About My Skincare Routine When I Turned 30 —Alex BeggsTwo Writers on the Joys of Being Single, But Also Sometimes Dating, in Your 30s—Zan Romanoff and Glynnis MacNicolExplore Bon AppétitHealthyishGuide to Your 30sRead MoreLifestyleThe Healthyish Guide to Cooking With, Eating, and Truly Enjoying WeedGallery13 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-12", "author": ["Condé Nast", "Amanda Shapiro", "The Healthyish Team"]}