{"id": "e4625bede999e94bae1a9c2bc0da3daa", "url": "https://www.bonappetit.com/story/yaupon-tea", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "The Yaupon Tea I’m Drinking Iced to Hold on to Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Low-Key Caffeinated Iced Tea I’m Drinking to Hold on to SummerIt’s made of yaupon leaves, the only caffeinated plant native to the U.S.By Alex BeggsSeptember 20, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!Yaupon Brothers’ lavender-coconut tea is not my usual...cup of tea. I’m a pretty loyal oolong/green/jasmine drinker. Coconut? How’d you get in here? But when I tried it at the Fancy Food Show this year, I was entranced. It was refreshing and summery, and unlike anything I’d ever had before. The flavor was barely floral, fragrant with coconut and a slightly green undertone.Yaupon is—fun fact—the only known caffeinated plant native to the U.S. (It’s a tree, and the tea is made from the holly-like leaves.) It’s packed with antioxidants and roughly the same amount of caffeine as yerba mate. Yaupon Brothers—based in Florida, where the Timucua tribe once grew, drank, traded, and used yaupon in religious ceremonies—acknowledges Native Americans’ thousand-plus-year history with the plant by sending a portion of sales to NATIFS, a non-profit founded by chef Sean Sherman that re-establishes indigenous foodways to generate wealth and improve health in Native communities.The company also produces a traditional green tea, a spiced chai, and a “fire-roasted” tea in addition to the lavender-coconut. I cold brew a bag in a pint of water overnight, and the next day, it’s lightly infused and ready to go. You could doctor it up with maple syrup and a squeeze of lemon, or oomph up the flavor by cold-steeping two or three tea bags at once. Just imagine how cuuute it could be in a pitcher with a sprig of fresh lavender as garnish. —Alex Beggs, senior staff writerBuy it: Lavender Coconut Yaupon Tea, $8All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItTeaShoppingRead MoreLifestyleThis Water Bottle Keeps EVERYTHING Icy ColdBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-20", "author": ["Condé Nast", "Alex Beggs"]}