{"id": "e46a06a94dc4e4031d1c8b1bfe03b18d", "url": "https://www.bonappetit.com/story/sam-kass-obamas-pantry", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Sam Kass on How to Spring Clean Your Pantry Like the Obamas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow the Obamas' Pantry Got a Healthyish MakeoverWhat worked in the Obama White House can work in your kitchen too.By Sam KassApril 27, 2018FacebookTwitterEmailPhoto by Aubrie PickFacebookTwitterEmailFormer White House chef Sam Kass acted as President Barack Obama's Senior Policy Advisor for Nutrition Policy and the Executive Director for First Lady Michelle Obama's Let's Move! campaign. In his new book, Eat a Little Better, he offers recipes and tips for making healthier choices one small step at a time. These are the three strategies he used to help the Obamas revamp their kitchen and their eating habits.When Michelle Obama asked me to give her pantry a makeover during her husband’s campaign in 2007, I undertook the mission with her daughters, Sasha and Malia. At the time, their shelves looked like those in most American homes. There was good food and then there were the typical convenience foods we all know and love: salty snacks, sweets, and so-called fruit juice packed with sugar. They had been trying to eat well, but with all of those unhealthy options nearby, the task was virtually impossible. We went through it all, inspecting the ingredients. We set aside any package that listed sugar in any of its many forms—high-fructose corn syrup, fruit juice concentrate, cane sugar, and so on—as one of the first few ingredients, or that contained a bunch of stuff they couldn’t pronounce. We were going to pare down and focus on the real food. Real food has nutrition. Fake food doesn’t. I wanted them to know what to eat, not just what to avoid.Sam Kass\nPhoto courtesy of Eat A Little BetterFor the most part, they had fun with the task, reading the ingredients out loud—“Hydrodextromal . . . nope!” (They especially liked when they got to axe some of Mom’s favorite foods.)The foods we kept, we reorganized. We took the fruit out of the bin at the bottom of the fridge and put it in a bowl on the counter. I bought some glass jars, filled them with healthy snacks like almonds, cashews, peanuts, dried cranberries, and dried mango, and put them where the girls could see them. I lined the fridge with clear, easy-to-see containers of carrot sticks, sliced cucumbers, celery, and hummus. We put cookies and brownies—yes, some treats absolutely survived our purge—on the cabinet’s top shelf. They might not have been healthy, but at least they were real food, with ingredients limited to things like butter, flour, and chocolate.To me, these changes were common sense. If you’re hungry and you see a banana, that’s what you’ll grab. If you have to get a stool to reach the brownies, you’ll be less likely to indulge—you’ll eat it when you want it, rather than when you see it. And I saw this in action whenever the girls came home from school and rushed into the kitchen while I was prepping dinner. As they rumbled through—“Hi, Sam!”—they grabbed whatever I’d put in the bowl of fruit. And then—“Bye, Sam!”—they rushed off. They wanted a quick snack. Any snack, not specifically fruit or cookies. They grabbed what they saw.The takeaway is this: Our food environment plays a major role in the decisions we make. If we improve that environment, we improve those decisions. Make the better choice the easiest choice by starting with a (tiny) makeover.Step 1: Purge your pantry and fridgeGrab a big bag, go through the food in your kitchen, and toss in any canned, jarred, or boxed products that list any form of sugar—from cane sugar to fruit concentrate to corn syrup—as the first or second ingredient (especially if it’s in food where you don’t expect to see it, like peanut butter or salad dressing).Bag any product with a long list of ingredients that a sixth grader couldn’t pronounce. It’s not that some sugar or food additives here and there will kill you. It’s that products loaded with them tend to lack nutritional value. The purpose isn’t necessarily figuring out what to avoid so much as making sure your home is filled with nutritious food. In the past, I would have then recommended you throw that bag out, but as I’ve grown to see the huge problems with food waste, I now suggest you put that bag in a corner of your pantry, eat what’s in it, and just replace each thing with a better option . . . or not at all.But wait! Don’t go too crazy. You have to keep a few treats. If you ask me, it’s healthy to have some unhealthy food around. The whole idea behind the pantry purge is to set up a zone in your home where you can eat without worry and guilt. Chips might not be good for you, but neither is stressing out about every bite of food. So make some progress, and indulge once in a while—just make sure it’s actually once in a while. Just choose treats you really, really like so that the splurge is worth it, and make sure they don’t contain lots of junk.Step 2: Reorganize your pantry and fridgeNow that you’ve cleaned house, rearrange what you’ve kept. Remember, you eat what you see. So first, take those treats you saved and put them on the top shelf (and even better, in a paper bag or another container you can’t see through). Put smarter options front and center on shelves at eye level.Now, put a big bowl of fruit on your counter. Fill large, clear containers with roasted nuts (salted or not) and dried fruit, and keep them on the counter, too. These are real foods that you can feel good about eating. Fresh and dried fruit satisfies sweet cravings without added sugar. Nuts taste rich from good fats and have satisfying protein. They satiate you in a way junk foods don’t. And you’ll eat them more often when they’re on display.Now apply the eat-what-you-see principle to your fridge. The bottom bin might be called the crisper, but it’s really more like a cave where fruits and vegetables go to die. I say use it to store condiments, and put those good-for-you foods where you can see them—at eye level if possible. Not only does this improve our eating habits, but it also reduces waste, as anyone who has discovered a forgotten, melting bag of spinach or fuzzy bunch of fruit knows too well.Step 3: Make wholesome foods easier to eatEven better, make these wholesome foods easier to eat. Take the time to wash and cut ready-to-eat vegetables, like carrots, cucumber, celery, bell peppers, and radishes—and fruit that requires prep, like melon and pineapple—and keep them in clear containers in your fridge.  Make the better choice the easier choice.Reprinted from Eat A Little Better. Copyright c 2018 by Sam Kass. Photographs copyright c 2017 by Aubrie Pick. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House, LLC. Buy Eat A Little Better, by Sam Kass $29.Explore Bon AppétitHealthyishHealthyRead MoreLifestyleHow to Make Healthier Desserts That Michelle Obama Would EndorseBy Bill YossesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-27", "author": ["Condé Nast", "Sam Kass"]}