{"id": "e47961a1f8cf5568b8bceb69176ec872", "url": "https://www.bonappetit.com/recipe/bitter-greens-mustard-vinaigrette", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Bitter Greens With Sweet Mustard Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueBitter Greens With Sweet Mustard VinaigretteBy Bryant Terry August 10, 20215.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Oriana Koren, food styling by Lillian Kang, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrintIf you aren’t into bitter vegetables, this salad may just change your mind. To chef-author-activist Bryant Terry, who adapted the recipe from his book Vegetable Kingdom, the acerbic notes of bitter greens such as frisée and radicchio are often underappreciated but ideal for balancing this assertive sweet-tart dressing.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStainless Steel Mixing Bowls$26 At AmazonCitrus Juicer$7 At AmazonWhisk$10 At AmazonSmall Skillet$40 At AmazonIngredients4 - 6 ServingsVinaigrette2Tbsp. apple cider vinegar1Tbsp. fresh lemon juice1Tbsp. light agave nectar1½tsp. whole grain mustard5Tbsp. walnut oilKosher salt, freshly ground pepperSalad½cup walnuts1medium head of frisée, leaves separated and torn1small head of radicchio, leaves separated and torn1medium Granny Smith apple, cored, cut into matchsticks2celery stalks, peeled, thinly sliced on a diagonalKosher salt, freshly ground pepper½large lemonPreparationVinaigretteStep 1Whisk vinegar, lemon juice, agave, and mustard in a medium bowl. Whisking constantly, slowly stream in oil; whisk until emulsified. Season with salt and pepper.SaladStep 2Toast walnuts in a dry small skillet over medium heat, tossing often, until slightly darkened, 5–8 minutes. Let cool.Step 3Toss frisée, radicchio, apple, and celery in a large bowl to combine. Season with salt and pepper; squeeze lemon juice over. Toss with enough vinaigrette to lightly coat. Transfer to a platter and top with walnuts.Reprinted with permission from Vegetable Kingdom: The Abundant World of Vegan Recipes by the Bryant Terry, copyright © 2020. Published by Ten Speed Press, an imprint of Penguin Random House. Photography copyright: Ed Anderson © 2020.\n\nBuy on Amazon or Bookshop.orgHow would you rate Bitter Greens With Sweet Mustard Vinaigrette?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladRadicchioChicoryLeafy GreensVegetableFriséeWalnutNutAppleFruitQuickEasySideDairy-FreeGluten-FreeVeganVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Bryant Terry"]}