{"id": "e47ba0f214627d60e94e2f89ed50803c", "url": "https://www.bonappetit.com/story/how-to-cook-fish-in-the-oven", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "How to Cook Fish in the Oven Perfectly Every Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Cook Fish in the Oven Perfectly Every TimeYou can make almost any slow-roasted fish in under 30 minutes. Just memorize this technique.By Alyse WhitneyFebruary 19, 2018FacebookTwitterEmailPhoto by Michael Graydon and Nikole Herriott, Food Styling by Alison Attenborough, Prop Styling by Kalen KaminskiFacebookTwitterEmailLearning how to cook fish at home can be incredibly intimidating. There are a lot of mistakes you can make, but we think the best way to nail it every time is to let the oven do all the work. That's why slow-roasting is our go-to technique for weeknight fish, and, in spite of its name, it only takes about 30 minutes to cook.We've applied this technique to salmon in parchment paper and halibut with cabbage and citrus, but we've never done it quite like this cod with roasted bell peppers and capers before. There's deep, charred flavor from the peppers, flakey, tender fish, and a bright and crunchy onion-capers-parsley salad on top. Heart-eye-emoji! Fish emoji!Slow-roasted arctic char with crunchy fennel salad is definitely on our to-cook list.\nNicole FranzenPick the Right FishOnce you've tried slow-roasted cod, you will want to experiment with any and all other fish in the sea. But senior food editor Claire Saffitz, who developed the recipe, suggests only going for richer fish with a good fat content like arctic char, striped bass, black cod, sable, or salmon. You'll want about 6 oz. of fish per person, and try to buy center-cut filets so they cook evenly. If your fish has one skinnier tapered end, just fold it underneath the filet to create an even thickness. That way you won't have one part of your fish overcooked.How to Slow Roast FishThe general rule of thumb for slow-roasting fish is to cook at 300° for 20–30 minutes. When cooking at this low temperature, sometimes the fish will remain a bit translucent and trick you into thinking it's undercooked—it's probably not. Press the cooked filet gently, and, if it separates into flakes easily, then you're good to go. You can also use a metal cake tester by sliding it into the fish and pressing it to your lower lip for three seconds. If the metal is warm, the fish is done. If it’s hot, the fish is probably overcooked, and if the metal is still cool, put it back in the oven.Choose Your Flavor CombinationsRoasted peppers might not work for every fish, but citrus, olive oil, and delicate herbs like chives, parsley, and dill are reliable flavor additions. Saffitz also suggests fennel—raw or roasted for more subtlety—or a ginger-scallion-sesame oil-soy sauce combination for an Asian fish. Since the fish is so tender, it's good to finish with a crunchy salad like thinly-sliced onion, fennel, radishes, or cucumbers for freshness. And, when in doubt, use lots of lemon juice.Don't Forget About SidesCrusty bread soaks up the juices from the roasted peppers in our latest recipe, but you can't go wrong with simple roasted potatoes (fingerlings or sweet potatoes), cooked rice or grains, grilled corn in the summer, or a crunchy raw shaved salad on the side. If you have leftover fish, pour some olive oil over it to make a quick conserva, and it'll last you the rest of the week. And if you want more of a snack, Saffitz suggests mashing fish with tartar sauce on crackers like fancy tuna salad.Turns out, slow-roasting fish is one of the easiest, most flexible weeknight meals you can make. So what are you waiting for?Get the recipe:Slow-Roasted Cod with Bell PeppersSlow roasting fish cooks it evenly—and makes it hard to go back to cooking it any other way.View RecipeExplore Bon AppétitFishRoastSeafoodHealthyishRead MorecookingA Slow-Roasted Salmon Recipe for People Who Suffer From Salmon FatigueBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-19", "author": ["Condé Nast", "Alyse Whitney"]}