{"id": "e48b1ef8334fe5d5a8e21b5883fe6cd8", "url": "https://www.bonappetit.com/story/sourdough-bread-faq", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "You Started Making Sourdough Bread... Now What? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSo You’ve Started Making Sourdough...Chances are, you have questions. Our panel of experts (including Claire!) have answers—in language even beginners can understand.By MacKenzie Chung FeganMay 7, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn 2019, everyone I knew was avoiding gluten. In 2020, everyone I know is making sourdough bread. My Instagram feed is cluttered with people showing off their burbling starters, the open crumb of their loaves, and their flamboyantly vertiginous ears.I am no exception. In mid-March, I dropped by Otway in Brooklyn—which makes an excellent miche—to pick up a sourdough starter. I’m now four loaves in, with a fifth currently fermenting away. My bread is good, but I am plagued by the knowledge that it could be better. It’s as if I’ve just learned the quadratic equation, and although I’m getting the correct answer, I have no idea why I’m doing what I’m doing or why the formula works. I have questions. Maybe you do too?So for all you other sourdough starters (heh heh) out there, I assembled a panel of experts—Josey Baker, author of Josey Baker Bread; Amanda Turner, former baker at Odd Duck; Joy Huang, home baker of Instagram renown; and our own Claire Saffitz, who needs no further introduction. I peppered them with questions about making sourdough bread, and here’s what I learned. If you have no sourdough experience, all this might go a little over your head. But if you’ve found a basic recipe you like (here are a couple that are good for beginners) and are one or two loaves in, this article is for you. Let’s get to it.I’m trying to conserve flour. How often do I need to feed my starter?If you’re baking a few times a week, keep it on the counter and feed it every day. If you’re a less regular baker, Claire Saffitz advises that you store it in the fridge, so you only need to feed it weekly. “Keeping the starter cold will slow down the activity, so that it requires fewer rounds of feeding,” she says. Joy Huang adds that you also don’t need to have all that much of it: “If you maintain a smaller starter, you need to feed it less,” she says. “You really just need a tablespoon of starter, but since such a tiny amount is hard to maintain, I keep around 30 grams.”How do I know my starter is ready to bake with, aside from the float test?“The float test is a pretty good indicator,” says Amanda Turner, “but the best thing is to become intimately acquainted with your starter so that you know what it looks like when it’s ready.” Your starter should have grown at least twice in volume—mark your container with tape or a rubber band so you can tell—and should have large bubbles. It will look shiny and viscous. As for the smell, Josey Baker says you’re looking for an aroma of sweet, yogurt-y acidity. “If you let it ferment beyond that, you’ll get more of a vinegar-y acidic smell,” he says. “You want it to be very alive. Better to have your pre-ferment to be over ripe than under ripe.”What do I do with my sourdough starter discard?Use it to make crackers, or add it to quickbreads, muffins, and pancakes for a tangy, sour flavor. In general, a sourdough starter is half flour and half water, so you can use it in place of some of the flour and liquid in an existing recipe. Or, make crepes:Watch Claire make crepes!\nThere are different approaches to the autolyse process, where the flour is hydrated and allowed to rest to encourage gluten development. Some recipes have you mix the flour and water and then rest before adding the starter and the salt, and some have you mix the flour and water and starter and then rest before adding the salt. Is there a difference?This is a matter of preference. Claire prefers to mix only the flour and water initially. “If you add the starter to the mixture and then do autolyse, you're effectively starting bulk fermentation,” she says. “I find I have more control over the bulk fermentation process if I wait to add the starter until after autolyse.” But Josey and Amanda counsel that home bakers can add the starter right away without negative effects—unless you’re using artisan flour. “If your flour has been freshly milled, it can be difficult to get it to hydrate, so I would take the extra time for autolyse” Amanda explains. “Hydrating the flour and the water makes the proteins more available.” There’s no point at which you’re necessarily “done” with autolyse—it’s just a matter of if you want to give your flour a head start on hydrating before adding your starter.The crumb shot.\nPhoto by Alex Lau, prop styling by Rebecca BartosheskyI’ve heard a lot about “high hydration” dough. What does this mean, and why do people talk about it so much?If you’ve gone down a sourdough Instagram rabbit hole, you’ve no doubt seen those super aerated crumb shots that are more hole than actual bread. Those are thanks to a high hydration dough, which usually results in a more custardy loaf than lower hydration doughs, which are typically chewy and dense. While there’s no set-in-stone definition for a high hydration dough, the consensus is that anything over 80% hydration qualifies. But the result is a loose, sticky dough that is hard for a beginner to wrangle. “People go nuts for those open crumb pics on social media,” Joy laments, “but I think it’s hard to eat! It’s full of holes!” Josey recommends ignoring the hype and focusing instead on a dough that is “properly” hydrated—a metric that will vary depending on what type of flour you’re using, but that you’ll learn to recognize with practice.I weighed out all my ingredients and combined them correctly, but my dough looks drier than it’s supposed to. What happened, and what do I do?Claire and Josey would like to reassure you that it’s all going to be okay. “It's normal in the beginning for a dough to seem dry,” Claire says, “especially after the minimal mixing required to start autolyse. The flours hydrate over time and the texture will significantly change when you add the salt, and then again throughout bulk fermentation.” If you're using a higher percentage of whole wheat flour than the recipe calls for and your dough looks dry, Josey advises adding a tablespoon or two more of water. But in the end, “it’s totally okay to have your dough be drier or wetter,” he says. “It’ll be fine.”I want to start incorporating whole wheat flour/spelt flour/einkorn/rye/whatever. Can I just swap some in for normal bread flour in my recipe?The experts say you should be okay substituting up to 20% of the total flour weight, but once you get beyond that, seek out a specific bread recipe using the flour of your choice. Whole wheat flour is thirstier than white flour, so you’ll need to add more water to your dough. Whole grain flours also tend to ferment faster because there are more nutrients for the yeast to chomp on, so you might need to either use less starter or adjust your timing accordingly.Can I add spices/cheese/seeds/other flavorings to my dough? At what point do I do that? Will certain ingredients give me trouble?Salt and fat can impair fermentation and gluten development, so add something like cheese late in the process—maybe one or two stretch-and-folds before you’re ready to shape. “Thirsty” add-ins like seeds or dried fruit need to be pre-soaked in water and then drained before being incorporated, otherwise they will impact the dough’s hydration. Josey urges you to go wild: “I always encourage people to experiment,” he says. “Seeds and nuts will be better if you toast them. Cinnamon can get very weird—it creates a gelatinous goo that seems to hinder some of the fermentation, which I know sounds gross—but it’s very delicious so you should do it.”Some recipes tell you to knead or mix the dough until it passes the windowpane test before starting bulk fermentation. Other recipes omit this, telling you only to do a series of stretch and folds during bulk fermentation. To knead or not to knead?Josey and Amanda don’t knead, relying only on the stretch and folds to build gluten. Claire, however, recommends that home bakers work the dough to ensure that they’re developing strength early on in the process. Do whatever feels right to you, or try both methods and see which one you prefer.How do I know if my dough is done with bulk fermentation? What am I looking for?Josey does at least three or four stretch and folds over a three to four hour window. “Volume is a very effective way of telling when you’re done,” he says. “You want the dough to have increased in volume by one third to one half.” But sometimes, Amanda cautions, it’s not as simple as that. “Sometimes the dough doesn’t rise that much—or maybe it doubles, but it’s not bubbly,” she says. As an insurance policy, she always retards her dough in the refrigerator overnight after shaping. “You’re giving the yeast more time to be active, so you’re buying yourself more wiggle room in case you end bulk fermentation too early.”Brad and Claire making sourdough bread together is…definitely worth watching.\nDo I need to buy bannetons? Can I just use a bowl?Joy swears by bannetons. “I have tried using a bowl a couple of times,” she says, “and my results are never as good as with a banneton.” The breathability of bannetons help wick away moisture from your loaf, preventing it from sticking when you turn it out. But Amanda, Claire, and Josey say that a bowl lined with a linen kitchen towel generously floured with AP and white rice flour (if you have it) is an acceptable substitute. Perhaps even better is a colander or a basket, which allows for air flow.How do I know if I’ve done a good job of shaping my loaf?All the experts agree that a well-shaped loaf takes practice. “Watch videos of pros shaping,” Joy advises. “They do it quickly without touching the dough too much. Find the happy medium where you’re being aggressive but not tearing it.” You’re trying to achieve surface tension. “A poorly shaped loaf looks very flabby, like it doesn’t have any structure,” Amanda says. “A well shaped loaf has a look of tension.”How do I know if my dough is done proofing? And should I retard my dough by proofing in the refrigerator?Josey and Joy don’t find the poke test (where the dough springs back slowly, leaving only a small indentation) particularly helpful. Josey instead recommends monitoring the volume of the dough, keeping an eye out for an increase of 25%. But all the experts recommend proofing the dough in the refrigerator overnight, which, Claire says, “not only allows more control over when you can bake the loaves, but also control over the flavor, too.” The longer the dough ferments in a cold environment, the sourer it will be. Joy also finds that it’s easier to score her intricate designs on dough pulled straight from the refrigerator.Can I freeze my dough after the final proof?No.Why am I taking a razor to my loaf? How deep should my cuts be? What if I don’t have a lame or a razor?If you’ve built up enough gluten and there’s enough yeast activity, your bread will have oven spring—meaning it will puff up and get some height while it bakes. If you don’t score it, it will crack. Cutting into the loaf allows you to control where it will open up. “If you’re only going to do one or two scores, go deep,” Joy recommends—at least a quarter of an inch. “But if you’re doing a lot, you can score at different depths to have different effects” like leaves or patterns. If you don’t have a lame or a razor, you can use the blade of a food processor, an X-Acto knife, a pair of scissors, or a serrated knife.How can I safely transfer my dough from the proofing basket or bowl to this blazing hot Dutch oven?There’s another advantage to proofing your dough overnight in the fridge—cold dough will be easier to maneuver. Flip it out onto a sheet of parchment paper cut in the shape of a watch. The “arms” of the watch will help you lower your loaf into the hot Dutch oven. Joy crumples up her parchment and runs it under the tap for a second to build up extra steam. If you don’t have a Dutch oven—or a cast iron combo cooker, which makes it even easier to transfer your bread into the preheated pan—Josey recommends a baking stone and an overturned metal bowl.How do I know, by looking at my finished loaf, if I overproofed or underproofed my dough, or did something else wrong?Your loaf might be underproofed if the inside is tight and a little tough or if the bubbles are concentrated in one area and smaller or non-existent in others.Your loaf might be overproofed if your loaf has a nice, supple interior but you didn’t get much oven spring—for example, you made a cut but it didn’t open.Your loaf might have been improperly shaped if you have one or two abnormally large holes.You might not have created enough of a steam-saturated environment for the first half of the bake if your crust is pale. Or this could mean that the dough was over fermented, so there weren’t enough sugars left in the crust.My loaf is overbaked on the bottom. Any tricks?Joy’s wet parchment trick helps with this, but you could also raise the position of the rack or lower your baking temperature by 35 to 50 degrees after you remove the lid of your Dutch oven. Or, as Josey suggests, remove your loaf from the Dutch oven after the steaming process and bake it directly on the rack.Do I really have to wait before cutting into it?Unfortunately, yes. The loaf continues to release moisture after being pulled from the oven, and if you slice into it while it’s hot, you’ll end up with a collapsed, gummy crumb. Better to wait at least an hour.Then slice it with this!This Is the Serrated Knife to End All Serrated KnivesIt won a gold medal in the Olympics of bread cutting.View StoryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-07", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}