{"id": "e4b281e61a29e84368717ce1d5c00c77", "url": "https://www.bonappetit.com/story/lindas-seabreeze-cafe", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "When I Need a Break from Family Craziness, I Go to Linda’s Seabreeze Cafe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhen I Need a Break from Family Craziness, I Go to Linda’s Seabreeze CafeThis diner with wall-to-wall carpeting lets me eat my home fries in peace.By Elaheh NozariJune 6, 2018FacebookTwitterEmailPhoto by Kelsey McClellanFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.I’ve made the six-hour flight from New York to California approximately 50 times in the past 28 years, for really no other reason than to aimlessly putter around my grandparents’ house in Santa Cruz. An engineering professor from central Pennsylvania, my grandfather had dreams of growing old in a university town by the beach. My grandmother, on the other hand, did not, but when my grandpa bought a small house on a whim in 1990, she reluctantly followed him and lived there until she died in 2009.People hanging out outside of the diner.\nPHOTO BY KELSEY MCCLELLANThe one place where I’ve consistently eaten during all those visits is an unassuming little place called Linda’s Seabreeze Cafe. It’s your standard breakfast-and-lunch-only spot where the egg specials come with a pile of greasy, crispy home fries; every plate is garnished with an orange slice and parsley; and you pray that whoever sat at the table before you didn’t double dip their spoon into the jam jar. There’s often a wait (a good sign!), but luckily there’s a coffee pot, mugs, and benches set up outside so those 20 minutes don’t feel too dire. Wall-to-wall carpeting absorbs the sounds of the 14 tables filled with locals ordering “the usual” and day-trippers fueling up before heading to the beach.The tuna salad sandwich, complete with orange wedge.\nPHOTO BY KELSEY MCCLELLANDepending on the time of day, I’ll either get two fried eggs with toast or a tuna salad sandwich. I’m well aware that I can make both of those dishes just as well in my grandpa’s kitchen, but that’s exactly why I love it. It’s familiar food that I can eat in peace—the latter being something that’s hard to come by at my grandpa’s home, which functions as a headquarters of sorts for my mom’s quirky, and some might say dysfunctional, side of the family. My mom and her five younger siblings fight over everything from how clean the cutting board is to who last moved my grandma’s ashes (true story—as of 2014 they were placed in the closet of the guest bedroom). Something is always broken and waiting on my uncle to fix—last time I was there it was the hot water and the dishwasher. When the craziness becomes too much to process—like when my uncle dumped a freestanding spiral staircase from the flea market in the driveway—I'll grab whichever immediate family member happens to be nearest and escape for a breath of fresh air. And five minutes away, in the calming wall-to-wall carpeted dining room of Linda’s, with a Diet Coke and a too-large side of potatoes that I will inevitably finish, I know I can always get it.Elaheh Nozari is the commerce editor at Bon Appétit and Epicurious.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Elaheh Nozari"]}