{"id": "e4e82184db3e54d0a2ba598e6c9528a9", "url": "https://www.bonappetit.com/story/hex-your-ex-then-bake-a-cake", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Hex Your Ex Then Bake a Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHex Your Ex Then Bake a CakeValentine's Day recommendations and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroFebruary 14, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou and Natasha Pickowicz, prop styling by Rebecca BartosheskyFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I like amari, the bitter, Italian after-dinner drinks, because they’re basically wellness shots made with a bajillion good-for-you herbs. I was at Fausto recently, a very good restaurant that your parents will also love, and at the end of the meal our server gave us some Averna (that’s a brand of amaro from 1969 that had been unearthed in an old gas station in Tuscany). I swear to you it smelled like gasoline—to the point that one of my dining companions sat with his nose in the glass, in a fugue state, for about five minutes. We debated whether it was possible for an amaro to absorb the, um, terroir of a gas station, but then we stopped caring and just drank it.The 5-Star ReviewWhy not hex your ex this Valentine’s Day? Salty, the feminist sex newsletter run by Claire Fitzsimmons, will send a card to your ex, letting them know they’ve been mildly cursed. Then you can finally move along with your life, bake this chocolate cake (or this one) or this one), and share it with someone you love, even if that someone is you.What I’m CookingPhoto by Gentl and Hyers, food styling by Susie Theodorou, prop styling by Nina LalliBon Appétit’s March issue dropped yesterday, and I haven’t earmarked this many recipes from a single magazine in a long time. I already made Carla Lalli Music’s seared lamb with halloumi because those are two of my desert-island ingredients, and I can report that it was as good as it looks, even when you double the spices by mistake. This weekend I’ll be going in on some red wine and soy–braised short ribs from The Good Fork chef Sohui Kim, and I’m eyeing this sesame-scallion sauce, which seems like a meal-prep dream come true.Now that Healthyish is more than two years old (!), I sometimes rediscover recipes that I totally forgot about. Like the time I asked Chris Morocco for a sheet-pan salmon recipe, and he delivered this perfect little number. The dish is so simple and super flavorful thanks to the miso mojo, made with an acidic triple-threat of orange juice, lime juice, and rice vinegar, plus a couple tablespoons of miso and thinly sliced serranos. I’ve been using the leftovers as salad dressing all week.This Week on HealthyishMacKenzie Fagan heads to La Copine, the desert roadside diner of our dreams, to talk to the co-owners about the intentional community they’ve built there. I ate at La Copine when I was in Joshua Tree last month, and it does indeed feel as utopian as she describes. (And I’m still thinking about those charred green beans with tahini and mint.)Who I’m FollowingSam Youkilis for the warm-weather places. Cora Harrington aka The Lingerie Addict since I heard that Call Your Girlfriend episode. Lukas Volger, who’s not a new follow but he’s back on his #28daysofoatmeal, and I'm watching like it's Russian Doll.Until next week,Amanda ShapiroHealthyish EditorP.S. I still don’t know how to pronounce this natural alternative to retinol that our skincare writer Deanna Pai investigated, but I’ve been saying bah-koo-chee-oil to myself for the last few days, and it’s making me laugh.Explore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleWhen Cooking Is a CompulsionBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-14", "author": ["Condé Nast", "Amanda Shapiro"]}