{"id": "e4ec41d173b9feca4878c29a0997878f", "url": "https://www.bonappetit.com/recipe/crispy-snapper-with-chaat-masala", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Crispy Snapper With Chaat Masala Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueCrispy Snapper With Chaat MasalaBy Andy BaraghaniFebruary 9, 20214.9(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Yudi Ela, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintCrispy pan-seared fish is the perfect canvas for showing off the full range of chaat masala, an Indian spice blend made of coriander, cumin, asafoetida, black salt, black pepper, and amchur—a dried mango powder with an acidic, lip-smacking quality. Here it’s used twice: First by seasoning the fish before cooking, then sprinkled over right after to balance the sweet and herby tamarind sauce and cilantro chutney. That’s what you do with chaat, the category of Indian snacks that rely on this spice mix—it’s the perfect final touch. We love Spicewalla’s Chaat Masala; a single shake gives any dish a distinct salty and tangy flavor.Ingredients4 servingsChutney1bunch cilantro, tough stems trimmed, coarsely chopped (about 2 cups)2green Thai chiles or other green chiles, seeds removed if desired1garlic clove, smashed2Tbsp. fresh lemon juiceKosher saltTamarind sauce2Tbsp. tamarind concentrate1Tbsp. (or more) dark brown sugar½small red onion, very thinly slicedKosher saltFish2garlic cloves, finely grated12\" piece ginger, peeled, finely grated3Tbsp. vegetable oil2tsp. chaat masala, plus more for serving46-oz. skin-on red snapper filletsKosher salt1lemon, halvedPreparationChutneyStep 1Purée cilantro, chiles, garlic, lemon juice, and 3 Tbsp. water in a blender, adding more water by the tablespoonful if needed to get mixture moving, until smooth. Season with salt.Tamarind SauceStep 2Mix tamarind, brown sugar, and ½ cup water in a small bowl to combine. Add onion and season with salt; let sit 5 minutes. Taste and add more brown sugar if needed (every tamarind product is slightly different, so you may need more sugar to cut the acidity).FishStep 3Whisk garlic, ginger, oil, and 2 tsp. chaat masala in a medium bowl.Step 4Pat fillets dry with paper towels; season generously on both sides with salt. Working one at a time, dip flesh side of fillets in spiced oil to coat, then transfer to a cold large skillet, arranging skin side down. Place skillet over medium heat and cook fish, pressing down on fillets to ensure direct contact with pan, until skin is super crisp and flesh is mostly opaque, 9–11 minutes. Turn fillets over and cook until just opaque throughout, about 1 minute more.Step 5Divide fish among plates; sprinkle with more chaat masala. Serve with chutney and tamarind sauce for spooning over.How would you rate Crispy Snapper With Chaat Masala?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleAmazing recipe! Used it for fresh snapper caught in Florida and would highly recommend. Bright, colorful dish that visually impressed and tasted great. I had to make a few substitutions and it worked fine. Used the juice of an orange and a lime instead of tamarind paste. Also, used curry powder instead of chaat. I know those are the two main ingredients, but it’s what was available to me. I had a little bit of a hard time getting the skin crispy.Andy ChallChicago, IL2/12/2022Being bi racial I commend Andy on using such a delicious spice on fish I use it on fruits and stuff like potato chicpeas etcGillianCanada4/20/2021Fried garlic/ginger/chaat masala smells amazing and might honestly be the best thing I’ve ever smelled. The amchur and black salt give it an amazingly fruity quality. I found chaat masala at a local Indian market. MDH is a good brand. I tried this recipe with snapper, and the color of the fish was beautiful, although you have to handle it delicately on the stove. I also tried making with salmon (easier to find) and it was equally good. AnonymousSan Francisco, CA3/13/2021Fried ginger/garlic/chaat masala smells truly amazing and might honestly be the best thing I’ve ever smelled. I bought chaat masala at a local Indian market. MDH is a good brand. I made this with snapper and it was great. The color of snapper is beautiful, although you have to handle it delicately on the stove. I also tried making with salmon (easier to find) and it worked well. AnonymousSan Francisco, CA3/13/2021Explore Bon AppétitIndianSouth AsianAsianSnapperFishSeafoodTamarindCondiments, Sauces & PastesQuickEasyWeeknight MealsMainNut-FreeDairy-FreeGluten-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Andy Baraghani"]}