{"id": "e4f653fce59c0c8cb84b0f29dc4b8f27", "url": "https://www.bonappetit.com/story/my-signature-side", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Garlicky Broccoli Rabe With Ricotta and Breadcrumbs is My Signature Side | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Broccoli Rabe is Incredibly Garlicky But Who Are You Kissing Anyway?It's my signature side but sure, you can borrow it.By Alex DelanyApril 28, 2020FacebookTwitterEmailPhoto and Food Styling by Sarah JampelFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I used to hate broccoli rabe. As a four or five or six-year-old kid, I tried it and decided it was a poor excuse for a vegetable. It’s! Too! Bitter! But let me fill you in on a secret: Six year-old me was a naive, childish fool. More than two decades later, I’m out here writing about how broccoli rabe is a top tier vegetable. (Don’t let anyone ever tell you you can’t change!) And I’m so sure of its greatness, I’ve made garlicky broccoli rabe my signature side. You know, the side dish that sits ever-ready for weekday dinner slumps and Friday celebrations alike.Maybe I love it because I’m Italian. Maybe it’s because I’ve learned to embrace flavors outside of my six-year-old comfort zone. Or maybe it’s because broccoli rabe—like all great ingredients—doesn’t need to be masked or dressed up with a million spices or in-depth cooking procedures to become a showstopper. A simple preparation will do. And an ingredient list of olive oil, salt, crushed red pepper flakes, breadcrumbs, ricotta, and garlic is all you need. Here’s how it’s done:First, you need to blanch 2 small bunches of broccoli rabe. If you’ve ever had broccoli rabe and thought, Damn, that’s bitter, it’s probably because it wasn’t blanched before it was cooked fully. This process both removes some of its bitter bite and makes it more tender (and palatable). Bring a pot of salted water to a boil and trim the very bottoms of the broccoli rabe. Then drop it in for 30 seconds to a minute, or until bright green. For thicker stalks, the white core in the center (where it’s still raw) should be small. Remove it and set it in a colander or on a clean dish cloth.There she is!\nEd AndersonIn a skillet, heat a couple glugs olive oil over medium heat and use a microplane to grate in 2 cloves garlic. Add 1 cup panko to the skillet and cook, stirring frequently, until golden brown. Remove the garlicky breadcrumbs from the skillet into a small bowl and season with kosher salt. Save them for later. Wipe out the skillet.Thinly slice 6 cloves of garlic. Heat a few glugs olive oil in the same skillet over medium-high and add garlic, cooking until golden brown. Add your blanched broccoli rabe to the pan, seasoning with a pinch or two of kosher salt, and a couple pinches of crushed red pepper flakes, and cook until the stems are tender. Remove the broccoli rabe from the pan and plate in an oval or circle, with some blank space in the middle.Scoop some ricotta into the void (a pretty good way to cure any type of sadness, if I do say so myself). Season the ricotta with salt and more red pepper flakes, and drizzle the plate with olive oil. Top the whole thing with a generous portion of those garlicky breadcrumbs.Yes, this seems like a potential garlic overdose, but I promise you that it’s not. The garlicky rabe PLUS the garlicky breadcrumbs make the whole thing exceptional. After all, the dish is called garlicky broccoli rabe. What were you expecting? Embrace it.This simple roster of ingredients stacks up to a seriously delicious side. And that, my friends, makes it the type of dish that can change opinions. When your broccoli rabe-doubting family members, friends, or enemies take a bite, any anti-rabe opinions will surely vanish, especially those formed and carried around since childhood.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-28", "author": ["Condé Nast", "Alex Delany"]}