{"id": "e503ad8bf6e9ff1d100ded224e5351ec", "url": "https://www.bonappetit.com/recipe/chipotle-rubbed-chicken-sheet-pan-dinner", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Chipotle-Rubbed Chicken Sheet-Pan Dinner Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChipotle-Rubbed Chicken Sheet-Pan DinnerBy Claire SaffitzMarch 20, 20184.7(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintThe arguments for stocking your kitchen with a couple of standard half-sheet pans are endless. They’re inexpensive, indestructible, and best of all, you can fit an entire dinner recipe for four—like this sweet-spicy chipotle chicken with zippy tomatillo salsa—all on one.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEARimmed Baking Sheet$20 At Bon Appétit MarketPaper Towels$13.45 At AmazonWhisk$10 At AmazonLarge Bowl$18 At AmazonTongs$13 At AmazonSpoon$24.69 At AmazonMeasuring Cups$18 At Bon Appétit MarketPlatter$29 At AmazonBlender$32 At AmazonIngredients4 servings12oz. tomatillos (about 6 medium)8garlic cloves4scallions1jalapeño6Tbsp. extra-virgin olive oil, dividedKosher salt8skin-on, bone-in chicken thighs (about 3 lb.)2Tbsp. adobo sauce, from 1 can chipotles in adobo1tsp. honey1tsp. ground cumin, divided1medium acorn squash½bunch cilantroLime wedges (for serving)PreparationStep 1Place a rack in upper third of oven; preheat to 425°. Start by assembling all the ingredients for the salsa: Remove husks from 12 oz. tomatillos and rinse. Cut any larger ones in half and arrange on a baking sheet.Step 2Smash 8 garlic cloves with the flat side of your knife and remove skins. Add to baking sheet with tomatillos.Step 3Trim ends of 4 scallions and discard, then cut scallions crosswise into 1\" pieces. Add to baking sheet.Step 4Cut 1 jalapeño in half lengthwise, pull out stem and ribs, and place on baking sheet. Wash hands!Step 5Drizzle 2 Tbsp. oil over vegetables; season with salt. Toss with hands to coat, then push vegetables to one side of baking sheet so they’re taking up about one-third of sheet; set aside.Step 6Pat 8 chicken thighs dry with paper towels. Season all over with salt.Step 7Whisk 2 Tbsp. adobo sauce (from 1 can chipotles in adobo), 1 tsp. honey, ½ tsp. cumin, and 2 Tbsp. oil in a large bowl until smooth.→  Here are 6 ways to use the rest of those chipotles.Step 8Add chicken to bowl and toss with tongs until coated.Step 9Using tongs, arrange chicken, skin sides up, in center of baking sheet, placing close together so there’s still space left for the squash.Step 10Cut 1 acorn squash in half and scoop out seeds with spoon. Cut each half in thirds again to make 6 equal wedges.Step 11Arrange squash on baking sheet next to chicken, then drizzle squash with 2 Tbsp. oil. Season with salt and sprinkle with remaining ½ tsp. cumin.Step 12Roast until chicken thighs are browned on top and meat is cooked through, tomatillos are lightly charred on top, and squash is fork-tender 30–40 minutes.Step 13Let cool slightly. While chicken is cooling, pick about ½ cup cilantro leaves from bunch, reserving stems, and set aside for serving.Step 14Transfer chicken and squash to a platter.Step 15Tip all remaining ingredients, along with about ½ cup of pan juices, into a blender. Add cilantro, stems and all; season with a bit more salt. Blend, thinning with more pan juices if needed, until smooth and pourable.Step 16Pour salsa over platter and top with reserved cilantro leaves. Serve with lime wedges alongside.How would you rate Chipotle-Rubbed Chicken Sheet-Pan Dinner?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleThis was delicious, wouldn’t change a thing. Andrea10/19/2021This was great. I followed the recipe as given and wow was it not only good, it was  great. If you skip this recipe then you are missing out on something that makes you lick you your lips after every bite. The next time I make this I will add more salt to the sauce.  I found the squash added a different texture to the dish along with a subtle sweetness that made going back to the chicken and sauce that more delicious. Rod BarbourNorth Carolina1/28/2021This is one of the most delicious and easiest dishes I have ever made and it is truly a one sheet pan dish. Even the kids liked it. I made the recipe exactly as written except I used extra tomatillos and garlic to make extra sauce as it sounded really good based on other reviewers. We did try the acorn squash but not a big fan of squash so next time I would try a different vegetable. I spanish made rice to go with this dish as an accompaniment. The sauce went great with that too.  Will be adding this recipe and  cooking technique to our weekly rotation and maybe just change the  vegetables and the rub/ marinade for the chicken every now and then. RDNew Jersey12/11/2020This was so good! The sauce is creamy with the perfect amount of acidity, and the chicken is delicious without being too spicy. I might add more chipotle next time, but it was great as is. Might try a different vegetable from squash, its not my favorite.AnonymousColumbia, SC11/12/2019OMG! This chicken is delicious! I hate eat chicken. Is not my favorite thing in world, but this is a delicious way to prepare it. I used some spinach mixed in the salsa verde and chicken tenders instead of chicken thighs. It was perfectly cooked and delicious. Everything was on point, and everyone’s loved it!manducarioMexico City, MX6/11/2019This is easy and delicious! I couldn’t find the adobo sauce that the recipe recommends, so I used a chipotle sauce I found in the Latin section of an Asian supermarket and it tasted great. Everything about this dish is perfect! Great meal to make for a family or large group of people (if you double the recipe). The sauce was the bomb and I could see it going well with many other dishes if there is leftover sauce. 100% recommend and will make again!TessPereiraWashington, DC6/6/2019So easy and delicious - I used sweet potatoes instead of squash and the salsa worked so well with it! Anonymous5/5/2019One of my go to weeknight recipes.  I add 1/2 tspn of coriander and pureed garlic to the chicken marinade, and I often times don't make this with acorn squash (not a vegetable I particularly love), but other than that, I follow this recipe to a T.  \n\nThe salsa is amazing, so tart and creamy like another reviewer stated. It's also extremely versatile. I've sauteed it with some beans and put it over rice for a light lunch.  It would be a good side dish to accompany this dish.AnonymousEvanston, IL12/3/2018I will NEVER understand how this sauce came out so creamy and tart. DELICIOUS. New staple recipe. Next time I'm going to swap out the squash for another vegetable. 8/29/2018This is really good. The only change I will make is in either getting a baking sheet with a rim all around it, or putting it in baking dishes. My baking sheets have a lip only on one side and there was a bit of a mess / smoke as the delicious juices poured off.AnonymousHershey6/10/2018Awesome recipe! The tomatillo sauce is beyond delicious. It would be great on eggs, a sandwich, veggies, protein... basically everything. AnonymousBrooklyn, NY4/16/2018This was absolutely delicious!  Easy to put together and loved by young and old. I’ve never had acorn squash and loved it!Anonymous4/4/2018Good recipe. When I make it again...I will reinforce the seasoning to include ground cumin, black pepper and chipotle peppers directly on the chicken. Loved the acorn squash!TRP_4750San Francisco, Ca4/4/2018This was terrific!  Made it last  night and it’s a keeper.  The chicken thighs I had were larger than normal so it took a little more time in the oven than the recipe but otherwise this was spot on.  The acorn squash was really tasty (even to those who don’t normally like squash of any type) and the tomatillo sauce was dreamy.  The only thing I might do differently next time is double the adobe spice mixture on the chicken—but this was deeee-licious!AnonymousBoston, MA3/29/2018I made this last night and it turned out amazing!  My husband and I loved it - it's a real comebacker.  Loved the salsa, the acorn squash and the chipotle/honey sauce on the chicken. Yummers!  I have leftover salsa and will be putting that to good use soon. Thanks for a great recipe!AnonymousPalm Harbor, FL3/24/2018Explore Bon AppétitChickenPoultryChicken ThighTomatilloVegetableAcorn SquashSquashSheet-Pan DinnersMainDairy-FreeNut-FreeGluten-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Claire Saffitz"]}