{"id": "e510fe5a069cca55ea675746313cd37c", "url": "https://www.bonappetit.com/story/plant-magic", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "Plant Magic Is The Herbalism Book for Food Lovers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Cookbook That Makes Herbal Medicine Totally ApproachableThere’s chicken stock to bolster the immune system, lattes to increase circulation, and calming rose-petal toast spread thick with cultured butter. By MacKenzie Chung FeganApril 15, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!Growing up, the words “herbal medicine” sent shivers down my spine. They brought to mind the intensely bitter herbs my Chinese relatives cajoled me into taking, sick or not, when I wasn’t able to squirm away. I was as grossed out by them as I was convinced of their efficacy; anything that tasted that bad had to be good for you.Christine Buckley’s Plant Magic: Herbalism in Real Life is helping me reset my relationship with good-for-you plants. Her recipe for medicinal tea calls for the reader to add honey, sugar, or milk if desired, because “medicine can be a treat, not a punishment.” Plant Magic is a crash course, a field guide, and a reference primer sure to delight those who are already curious about the healing properties of plants. Thankfully for those of us who don’t know nettle from linden, it’s also a cookbook—and one with street cred.Before devoting herself to herbalism, Buckley cooked at New York favorites Prune and Torrisi, baked at Detroit’s Sister Pie, and worked as a food stylist for a decade. (Catch her clipping dandelion greens with a pair of Joyce Chen scissors on page 7—a staple in every food stylist’s arsenal.) I am lucky to count Buckley as a friend, and while she’s cooked me many healthful meals, it has never come at the expense of deliciousness. Even as she throws around terms like “demulcent” and “anticatarrhal,” you can tell that her herbalism practice is layered on top of a deep attention to food, flavor, and the pleasure that comes from eating things that taste good.Buckley lays the groundwork for an at-home herbalism practice, explaining what it is (a system of healing supported by plants and food), what it is not (a new thing invented by white people with blogs), and how it can coexist with Western medicine (drink your red clover tea and get a flu shot). She provides instructions for making balms, ointments, and facial steams, but the real highlights are the recipes for things you can eat and drink. There’s garlicky chicken stock to bolster the immune system, a cinnamon latte to increase circulation and calm stomach cramps, and a rose petal toast spread so thickly with cultured butter that you leave “toothmarks after a bite.” These recipes, written by someone who speaks the language of food, wouldn’t be out of place in a cookbook that had nothing to do with herbalism. With plants that taste this delicious, you just might forget they’re also good for you.Buy it: Plant Magic, $24 at AmazonAll products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItCookbooksShoppingRead MoreLifestyleThis Cookbook Is Changing the Way I Use VegetablesBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-15", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}