{"id": "e52473fa38b08d893be48a20a376478b", "url": "https://www.bonappetit.com/story/mi-cocina-dallas-tex-mex-chain", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "The Tex-Mex Chain That Fills a Queso-Sized Hole in My Heart | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Tex-Mex Chain That Fills a Queso-Sized Hole in My HeartI’ve eaten at Mi Cocina my entire life, but I didn’t know anything about its past.By Priya KrishnaJune 6, 2018FacebookTwitterEmailPhoto by Jenny CatlowFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.My earliest memory of being utterly delighted by a restaurant happened when I was a seven-year-old kid in Dallas, eating my first meal at Mi Cocina. I saw a waiter rush by with a sizzling platter of chicken fajitas, and I inhaled the smell of smoke and buttery caramelized onions. Fat, sturdy chips and a thick burnt-red salsa (the best salsa you’ll ever have, hands down) decorated each table, along with piles of refried beans and rice tinged orange from cumin and tomatoes. I ordered the cheese enchiladas, asking the waiter to sub out the chili con carne sauce that typically goes on top for plain melted cheese, not realizing that this oozy mess of charred onion and cheddar-stuffed tortillas would become my exact order for the next 19-plus years. I polished off the entire plate, felt uncomfortably full, and regretted nothing.There is no place that defines “neighborhood spot” in my mind more than Mi Cocina. It’s the most beloved Tex-Mex restaurant in Dallas—the place you can visit multiple times a week and never grow tired of the food, which is solid, affordable, and decidedly un-precious. The wait is never long. The service is efficient (but not too efficient). After a few visits, the hosts and servers will have your name and order memorized.You won’t see the restaurant written up in food magazines, and no one I talk to outside of Dallas has ever heard of it. In many ways, Mi Cocina’s success is somewhat confusing. It is a corporate chain that serves decidedly unambitious food. Its leadership has been tumultuous. And while Dallas is a vibrant, growing city, it is intensely divided by social and political lines. Yet the restaurant remains the city’s universal watering hole, its cult following based not on a single dish or drink, but by the sense of comfort and familiarity that comes with dining there. If you’ve lived in Dallas longer than a year, you know that Mi Cocina is the place you will inevitably end up when it’s a weeknight or a birthday or you have a friend in town.The usual suspects: avocado, steak, etc.\nPhoto by Jenny CatlowMi Cocina was founded in 1991, a year before I moved from Nashua, New Hampshire, to Dallas. It was the brainchild of restaurateur Michael “Mico” Rodriguez and three partners. The idea was to create a Tex-Mex restaurant with fun, slightly upscale vibes, exceedingly friendly service, and solid versions of staples like fajitas, enchiladas, and queso. It quickly grew into 22 locations (including an outpost in Tulsa, but we don’t talk about that one) strategically placed across most corners of the city, ensuring that pretty much any Dallasite could make Mi Cocina her local haunt.From elementary school through high school, Mi Cocina was the place where my friends and I spent all of our weekend nights. EVERY meal began with queso—Mi Cocina’s is smooth, a little spicy, and without that artificial plastic taste that befalls so many cheese dips—and we would fight over the single big chip that comes pre-dipped in the cheese. We learned to order our onions well-done and to double the rice and nix the beans (the spiced rice is far superior to the beans, which can sometimes show up gloopy). When we entered high school, we used our fake IDs to order frozen margaritas (Mi Cocina’s are perfect, by the way, not too sweet and gloriously smooth). It was where we recapped scandalous high school parties, and after we went off to college, where we returned to catch up.In big food cities like New York and San Francisco, chain restaurants are looked down on as sanitized and mass-market. But during my childhood in suburban Dallas, chain restaurants outnumbered independent restaurants, and chains were the ones that served the most reliable, consistent food that was designed to appeal to different tastes. Our neighborhood spots were pretty much all chains, and Mi Cocina embodied the best of those chains: The atmosphere is fun but not raucous, cool but not too hip, and barbecue-loving third-generation Texans can find something to eat as easily as my picky vegetarian dad can. Even now, as Dallas makes space for more high-end restaurants and up-and-coming chefs, Mi Cocina is still always packed. I have seen friends and strangers bring plastic containers of Mi Cocina takeout to family members with layovers at DFW airport.Peak strip mall vibes.\nPhoto Courtesy of Mi CocinaI was diving into Mi Cocina’s history while writing this piece, and I found a 2009 D Magazine report on how Mi Cocina cofounder Mico Rodriguez was ousted from his own company in 2008 after a restaurant captain filed a sexual harassment suit against him. According to a statement emailed to me by the company, Rodriguez sold his shares. In that same statement, the company referred to Rodriguez as a “well-respected friend” and indicated that the other partners of Mi Cocina were some of the first investors in Rodriguez’s new restaurant, Mr Mesero (which doesn’t seem to have caught on in the same way as Mi Cocina).The whole point of the #MeToo movement is to make sure that individuals in power are held accountable—not held accountable for a brief moment and then treated as if nothing happened. I am disappointed that Mi Cocina’s ownership has seemingly excused Rodriguez’s behavior, even after doing the right thing by ousting him from the company.It’s easy to talk about boycotting a restaurant when you’ve only visited a few times. It’s harder when it’s a place you’ve been visiting your whole life—and the thing is, I didn’t even know Rodriguez existed until now. And when I think of Mi Cocina, I’ve never thought of Rodriguez. I think of the cheery waiters and hosts at the Preston Forest location, many of whom have been working there since I was a kid—the ones who know I like my onions more on the burnt side and sneak an extra big chip into my queso. More than anyone on the corporate side, they are the reason this restaurant has become so integrated into the fabric of Dallas society. I hope the workplace culture has changed for the better since Rodriguez’s days, though it makes me wonder: When all eyes are on the restaurants or mega-celebrity chefs, is the same scrutiny taking place at regional chains, which hire and serve far more people?As a food writer, I can’t go out to eat without thinking critically about the restaurant, trying to determine if the experience is anything extra special. But when it comes to Mi Cocina, my ties are so deep that I could only ever judge the food as exceptional or the service as extraordinary (and it is: The waiters never write your order down but always get it right). It’s likely that there are other Tex-Mex restaurants in Dallas with fluffier rice and creamier queso. But I don’t care. Because when you’ve been going to a place for so many years that certain shirts permanently smell of smoke and onions, the impact is indelible. Even if it’s a decades-old Tex-Mex joint in an old North Dallas strip mall, there’s nowhere else like it in the world.Priya Krishna is a writer in New York, read her Bon Appétit column Indianish here.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsTex-MexRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Priya Krishna"]}