{"id": "e53406cdbff049d9656a6fb43ef06e8d", "url": "https://www.bonappetit.com/story/weeknight-piri-piri-meatballs", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "I Make These Weeknight Meatballs Just for the Extra Piri Piri Sauce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Make These Weeknight Meatballs Just for the Extra Piri Piri SauceI’ll slather this vibrant, smoky-spicy magic on just about everything.By Jesse SparksApril 5, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailWe’ve been seeing piri piri popping up A LOT recently. It’s there on the menu at Cervos in Manhattan, Fat Rice in Chicago, and Kith and Kin in D.C. It’s showing up on salmon filets, roasted half chickens, calamari, rice, steaks, stews, and gooseberries, adding smoky-hot heat as a seasoning, marinade, and sauce for dipping and drizzling. We’ve gravitated to every corner that this vibrant, versatile flavor with South African and Portuguese roots has shown up, so naturally, we wanted to bring it home.Enter senior food editor Molly Baz’s piri piri meatball—a light-in-texture, rich-in-flavor weeknight-friendly dinner that hinges on a quick blender sauce.While piri piri is also the name of a particular hot chile pepper (imagine a habanero-level kick), you don’t actually need it to make delicious peri peri (also spelled peri peri) sauce. For this version, Molly picked fresh red Fresnos, which are easier to find than the more commonly used piri piri or African bird’s eye chiles. Their milder, slightly fruity heat goes great with the requisite smoked paprika and red bell pepper, which we like roasted and jarred. Mix this with garlic, olive oil, red wine vinegar, and salt, then blitz until smooth.Most of the sauce will be used for drizzling, but Molly wanted to make sure that the meatballs themselves take on elements of that smoky-fruity flavor. So she created a panko-piri-piri paste that combines panko, water, an egg, and the sauce, plus oil, garlic, salt, cumin, and more paprika. All that gets mixed in with the beef, giving that warm, tingling zing a chance to come through on every bite.You’ll have plenty of sauce to drizzle over the meatballs (which are best laid atop a cooling bed of yogurt), but you may even consider doubling the batch. It’s so good, you’ll find yourself spooning it over whatever miscellaneous foods you have lying around—roasted veggies, pasta, sandwiches… I mean, what did you expect?Get the recipe:Piri-Piri MeatballsFresh piri-piri chiles can be difficult to find, so for our take on a vibrant piri-piri sauce, we subbed in a fresh Fresno chile.View RecipeExplore Bon AppétitWeeknightMeatballDinnerSauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-05", "author": ["Condé Nast", "Jesse Sparks"]}