{"id": "e5417a406d02b9a20cc3c7dda5d19522", "url": "https://www.bonappetit.com/recipe/heartbeet-chocolate-cake", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "Beet Chocolate Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueHeartbeet Chocolate CakeBy Anna StockwellFebruary 7, 20194.6(78)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintEarthy-sweet beet purée gives this gluten-free chocolate cake a red velvet hue but also lends so much buttery moistness that you'd never guess the cake is dairy-free as well.Ingredients8–10 servingsCake4medium beets, scrubbed2Tbsp. virgin coconut oil, plus more for pan½cup Dutch-process cocoa powder, plus more for pan1½cups almond flour½tsp. baking soda½tsp. ground cinnamon2oz. bittersweet chocolate, coarsely chopped1tsp. apple cider vinegar or distilled white vinegar1tsp. vanilla extract4large eggs1¼cups (packed) light brown sugar1tsp. kosher saltGlaze4oz. bittersweet chocolate, coarsely chopped1Tbsp. virgin coconut oil¼tsp. vanilla extractPinch of kosher saltGold luster dust (for serving; optional)PreparationCakeStep 1Cook beets in a medium pot of boiling unsalted water until tender, 30–40 minutes, depending on size. Drain and rinse under cold water until cool enough to handle. Cut off stem end, then peel and cut beets into large pieces. Transfer to a blender and add 2 Tbsp. water. Blend, adding water 1 Tbsp. at a time as needed, until a smooth purée forms—it should be the consistency of applesauce. Measure out 1 cup purée (reserve remaining purée for another use, such as blending into a smoothie).Step 2Preheat oven to 350°. Line bottom of an 8\" round cake pan with parchment. Grease with oil, then dust with cocoa powder, tapping out excess.Step 3Whisk almond flour, baking soda, cinnamon, and remaining ½ cup cocoa powder in a medium bowl; set aside.Step 4Heat chocolate and remaining 2 Tbsp. oil in a medium heatproof bowl set over a saucepan of barely simmering water, stirring often, until melted. Remove bowl from heat. Stir in vinegar, vanilla, and reserved 1 cup beet purée until smooth.Step 5Beat eggs, brown sugar, and salt in the large bowl of a stand mixer fitted with the whisk attachment on medium-high speed (or use an electric mixer and large bowl) until more than tripled in volume and mixture holds a ribbon for several seconds when beater is lifted above batter, 5–7 minutes. Thoroughly beating the eggs is key to creating an aerated, light crumb and is a critical step when using gluten-free ingredients.Step 6Pour chocolate-beet mixture into egg mixture and beat on medium-low speed until combined. Turn mixer off and gently tip in reserved dry ingredients. Beat on lowest speed, scraping down bowl as needed, until combined.Step 7Transfer batter to prepared pan. Bake cake until a tester inserted into the center comes out clean and the top springs back when gently pressed, 45–50 minutes. Let cool 10 minutes. Carefully run a knife around edges of pan, then invert cake onto a wire rack and let cool.GlazeStep 8Heat chocolate, oil, vanilla, and salt in a medium heatproof bowl set over a saucepan of barely simmering water, stirring often, until chocolate is melted. Let cool, stirring occasionally, until mixture is thickened and cool enough to touch, 10–15 minutes.Step 9Place rack with cake on a rimmed baking sheet. Pour glaze over center of cake to cover top, tilting baking sheet slightly to encourage a few drips to run over sides of cake. Sprinkle with luster dust (if using). Let sit at room temperature until glaze is set, 2–3 hours.Step 10Do Ahead: Cake (without luster dust) can be glazed 2 days ahead. Cover and store at room temperature.How would you rate Heartbeet Chocolate Cake?Leave a ReviewTell us what you thinkReviews (52)Back to TopTriangleHas anyone tried replacing the brown sugar with coconut sugar for a paleo version? And if so, did it mess with the texture at all? EVE3/1/2022This cake is the most requested recipe from my husband. I make 1 1/2 batches and bake in two 6\" pans. I can freeze one before it's frosted for another day and it comes out perfect. LOVE this recipe! Lacy Saint Petersburg, FL1/30/2022SOOO delicious!! I use 1 cup almond flour and 1/2 c oat flour. so moist and great chocolate flavor. LizWashington DC1/17/2022Recipe should be revised to call for a 9” pan.  Overflowing mess in my oven right now!Anonymous10/16/2021I agree with previous reviews... this cake is fantastic! Moist, super chocolatey, great crumb for gluten free baking, not too sweet (and sneaky hidden veggies...bonus!) I let the eggs/sugar fluff in the kitchen aid a little longer than the 5-7 minutes (just to be sure of creating the light crumb), and a 9 inch round cake pan was perfect. Brandy D.Phoenix, AZ10/5/2021Fantastic!  Needed a gluten free dessert to take to my nephews for a picnic and this looked just the ticket.  Based on the comments, I went with an 8” square pan which is a little more volume than an 8” round but not as much as a 9” round.  Discovered that 1 can of sliced beats, drained, and put in my nutribullet with 2 tsp of water makes exactly 1 cup of purée.  Didn’t have bittersweet chocolate so did the substitute of 1 Tbs cocoa powder, 1 Tbs sugar and 2 tsp melted butter FOR EACH ounce of bittersweet.  I’ve found it’s much easier than melting down solid chocolate.  I didn’t worry about whether the eggs were triple in volume (they didn’t look like it) but at 7 minutes it was definitely creating a ribbon.   After tasting the batter, I decided not to do the ganache, but just to sprinkle powdered sugar on top as a finish.  I think the ganache would have been too much.  The cake alone is very rich!  Winner winner chicken dinner!Melody9/12/20218” pan is just too small! Shame to have such a hard earned batter spilling over in the oven. Size up or split into two pans and don’t overfill. Otherwise, wonderful recipe. Beet puree and melted chocolate make such lovely cake together. What a happy synergy of flavor! Agreeing with other commenters: Having the equivalent weight measurements for the ingredients would be helpful.   Beet loverSeattle8/26/2021incredible incredible incredible CAKE! Beautiful, moist, and delicious. My dutch process chocolate wasn't incorporating as smoothly as I wanted it to when I added it to the eggy mix, so I had added a little extra mix time on that step. I also added some berries on top after the glaze set for about an hour, and it gave it the perfect balance of sweet and tart. My family had multiple slices all at once because it was so good. It is definitely the best gluten-free cake I've ever made! JJLos Angeles, CA 5/10/2021An AMAZING CAKE! I usually don't bake dairy or gluten free for fear of losing richness but wow...this is probably the best chocolate cake I have EVER had. Seriously....make this cake. Drea DChicago, IL5/7/2021This has become my go-to cake.  Apart from being generous with the cocoa and chocolate bits, I follow the recipe, then just shake powdered sugar on top (skip the icing).  We get many beets in our winter farm share and this is a delicious and fun way to use them.  Does this make the cake healthy?  I think yes!AnonymousLewisburg, PA3/17/2021Has anyone ever tried it with apple sauce?EASCanada1/26/2021Absolutely delicious. Couldn't taste the beets at all. It tasted very rich and the cake itself was nice and moist. Love it!NaomiBelgium1/14/2021This is legitimately one of the best chocolate cakes I have ever tasted. I made this yesterday for my dad's birthday, and it was a hit! The earthiness of the beets balances with the chocolate to create a deep richness that isn't sickly sweet or cavity-inducing. I would recommend using a 9 inch pan, but other than that, this recipe is perfect! I will be making this again and again. Monica B.Brooklyn, NY12/22/2020I hated this cake while I was making it... Boil the beet, process the beat, process the almonds (didn't have flour so made meal which still worked), melt chocolate in a bain marie, beet the eggs and sugar for hours, three separate bowls....my kid kept asking if he could help and I just yelled NO! But...  it is legit so delicious and I like it as much (more?) than just about any chocolate cake I can remember. It's a lovely mix between a regular chocolate cake and something denser like a flourless cake. I may have to make it again...AnonymousBrooklyn, NY9/14/2020I was a little wary after reading some of the comments.  But I had some roasted beets and the kid wanted cake.  It was amazing!  No beet taste.  I used a mix of dark cocoa powder from King Arthur Flour and Hershey's Special Dark.  Instead of the glaze, I made a dehydrated raspberry frosting.  Incredibly moist and chocolatey!Seattle8/13/2020Explore Bon AppétitCakeDessertBeetVegetableChocolateOther IngredientsDairy-FreeGluten-FreeHealthyishBakingPassoverRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-07", "author": ["Condé Nast", "Anna Stockwell"]}