{"id": "e546ddadfcd02fddd2c1b227705719cc", "url": "https://www.bonappetit.com/recipe/chicken-brodo-with-spring-vegetables-and-fried-bread", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Chicken Brodo with Vegetables and Fried Bread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueChicken Brodo with Spring Vegetables and Fried BreadBy Aaron Crowder, Katie Jackson, and Nick PerkinsMarch 19, 2019EmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintIf chicken noodle soup is a winter blanket, then this brodo is a light spring sweater. In place of the rich, fatty broth, there’s delicate and lemony soup brimming with asparagus and pea shoots. Where there once were noodles, there’s a slab of irresistible olive oil–fried bread that stays crunchy on the edges even as it gets custardy in the center. If your butcher doesn't have chicken bones, substitute an equal weight of chicken wings.Ingredients4 servingsBrodo4lb. raw chicken bones3spring onions or 4 scallions, chopped4garlic cloves, crushed3oz. thinly sliced prosciutto, chopped¾cup dried porcini mushrooms, rinsedAssembly⅓cup extra-virgin olive oil, plus more for drizzling4½\"-thick slices country-style breadKosher salt10oz. asparagus (about 1 bunch), trimmed, thinly sliced on a diagonal into 1\"–1½\" pieces4oz. button mushrooms, stems trimmed, very thinly sliced2cups pea shoots (tendrils)1Tbsp. fresh lemon juiceFinely grated Parmesan (for serving)Freshly ground black pepperPreparationBrodoStep 1Bring chicken bones and 12 cups cold water to a gentle simmer (you don’t want it to boil) in a large pot. Reduce heat to medium-low and cook at a bare simmer, skimming foam occasionally, until stock is reduced by one-third, 2½–3 hours.Step 2Add spring onions, garlic, prosciutto, and mushrooms to pot and cook another 20 minutes. Strain stock through a fine-mesh sieve into a medium bowl; discard solids (you should have about 9 cups). Pour 3 cups brodo into an airtight container; reserve for another use.Step 3Do Ahead: Brodo can be made 3 days ahead. Cover and chill.AssemblyStep 4Heat ⅓ cup oil in a medium skillet over medium. As soon as the oil begins to look glossy, add bread slices and cook until golden brown, about 3 minutes per side. Transfer to a plate and season lightly with salt.Step 5Pour brodo into a large saucepan and bring to a simmer over medium heat. Taste and season with salt. Add asparagus and cook until tender and bright green, about 3 minutes. Remove from heat; add mushrooms.Step 6Toss pea shoots and lemon juice in a medium bowl; season with salt.Step 7Divide soup among bowls and place a piece of fried bread into each one. Top with dressed pea shoots and Parmesan. Drizzle with lots of oil and season with pepper.How would you rate Chicken Brodo with Spring Vegetables and Fried Bread?Leave a ReviewTell us what you thinkExplore Bon AppétitSoupSoups and StewsAsparagusVegetablePeaPorcini MushroomMushroomSpringStarterMainNut-FreeGluten-FreeHealthyishSimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Aaron Crowder", "Katie Jackson", "Nick Perkins"]}