{"id": "e547f4213ab6bda80ccd86917559fd9c", "url": "https://www.bonappetit.com/story/what-is-thai-basil", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "What is Thai Basil, the Spicy, Anise-y Herb That's a Vital Addition to Southeast Asian Cooking? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThai Basil Simply Has No SubstituteSweet basil just can't do it justice.By Kate KassinFebruary 10, 2022FacebookTwitterEmailPhotography by Isa Zapata.  Food Styling by Kat BoytsovaFacebookTwitterEmailYou’ve had these Thai Basil Sauce Noodles on your “must make” list for weeks now (okay, you = me) and finally, the evening has come. As you compile your grocery list, you scribble down basil, and you go on your merry way. But when you get home from the grocery store, you realize you picked up Italian basil, not Thai. And while the two share the same surname, they’re far from interchangeable. So, uh, what should you do?Before we can solve the dilemma, let's take a minute to answer the question: What is Thai basil in the first place?What is Thai basil?A type of basil native to Southeast Asia and its cuisines, Thai basil is savory, spicy, and anise-like, adding a distinct pungency to dishes. It’s a vibrant, irreplaceable addition in many dishes, providing the herbaceous and savory notes that round out a dish. In Thailand you’ll find it on everything from salads to stir-fries to curries. In Vietnam it takes a prominent place on the plate of garnishes—along with lime, bean sprouts, chili sauce, and a pile of other herbs—that's served with pho. The leaves are sturdy, with a slim pointed shape and, often, serrated edges. The stems and flowers have a distinctive purple hue.Thai basil stars in these saucy mushroom noodles.\nPhoto by Laura Murray, Food Styling by Pearl JonesConversely, sweet green basil (a.k.a. Italian basil) has a milder, peppery-sweet taste. The stems are greener and the leaves are rounded, softer and thinner. It’s the basil that’s classically used for pesto, as well as Mediterranean-inspired dishes like caprese and Margherita pizza. (Genovese basil, if you’re wondering, is a specific cultivar of sweet green basil from Italy.)Sweet basil is softer and rounder.\nPhoto by Chelsea Kyle, Food Styling by Pearl JonesBeyond Thai basil and Italian basil, there are a lot of types of basil out there, many of which are not easily accessible at American supermarkets. I found that practically every country in Southeast Asia seemed to use a different variety (e.g., nine-story pagoda in Taiwan and lemon basil a.k.a. kemangi in Indonesia). But again and again, I discovered that outside of the region, Thai basil is the most readily available of the Southeast Asian basil varieties and is therefore used in their place to evoke similar flavors. For assistant food editor Jessie YuChen, “the scent of Thai basil is a reminder of the pungent and spicy basil you find everywhere in Taiwan.” While the Taiwanese variety is difficult to find in the U.S., the more readily available Thai basil is the best substitute when making dishes like Three Cup Chicken, named after sesame oil, rice wine, and soy sauce.How is Thai basil used?Unlike sweet basil, Thai basil’s sturdy leaves retain structure and flavor even when cooked. That means that it can be added fresh as a garnish, to provide an herbaceous kick, but it can also be added during the cooking process, to infuse the whole dish with its aroma.When used raw, Thai basil can be a vibrant addition to your salads. At New York’s Fish Cheeks, Chef Dustin Everett integrates it into their som tum, or Thai salads, along with mint and cilantro, for an herbaceous kick. The basil plays well with the acid from the citrus, the spice of the Thai chiles, and the freshness of the raw vegetables.You can also integrate Thai basil right into your stir-fries or noodle dishes. Tom Khaengkarn, head chef of Soothr in the East Village, describes how a handful of Thai basil leaves is often added to the pan right before turning off the stove in order to give the leaves a quick cook. One dish where this magic happens? Soothr’s chicken ki-mao noodles, which is what I would choose if I could only eat one dish for the rest of my life.While we’re not going to call it pesto, you can also blend Thai basil into a sauce. In their Thai Basil Sauce Noodles with Jammy Eggs, YuChen purées the leaves with raw garlic and vegetable oil until a smooth paste forms, then cooks it with michiu tou (Taiwanese rice wine), sugar, and salt. The result is a Thai basil sauce that Yuchen describes as savory, aromatic, and licorice-scented. All this basil-y goodness is tossed with wide noodles, garlic chives, and bean sprouts, then topped with jammy eggs and chili crisp.If you’re still craving more Thai basil, perhaps in a boozier form, you can take a nod from Fish Cheeks and incorporate the herb into your cocktails, either in a syrup used to flavor a clear liquor like rum or gin or as a garnish (or both).Is it ever acceptable to substitute sweet basil?If you can’t find Thai basil, you can substitute sweet basil, but it will lack its distinctive grassy and spicy flavor. If you are to substitute, supplement the sweet basil with mint to make up for this loss of flavor. Khaengkarn of Soothr says that if you absolutely must use sweet basil, you might need to cut the amount of sugar (if a recipe calls for it) or up the salt or spice level to balance the sweetness. But our experts agree: If at all possible, seek out fresh Thai basil when a recipe calls for it.But then there’s holy basil…Both Khaengkarn and Everett express that their highest basil preference is holy basil, but because it’s harder to find in the U.S., many chefs use Thai basil for a similar, if not exact, flavor and aroma. Holy basil is native to the Indian subcontinent and grows throughout Southeast Asia. It boasts strong notes of pepper and clove and gives off an herbal, aromatic smell. Holy basil is used widely in Ayurvedic and folk medicine, often in the form of herbal tea, and is considered sacred in Hinduism.Where can I buy Thai basil?You’ll find Thai basil in a well-stocked supermarket or Asian market. Due to its vibrant nature, it’s worth seeking out fresh, rather than dried. Chef Everett at Fish Cheeks mentions that for the best selection, you should try to shop at a market in areas with a strong Thai community, such as Pata Market in New York’s Elmhurst. As a last resort YuChen suggests asking your favorite local Asian restaurant if you can have some of their stash, but remember to tip generously! And if you must, we guess you can substitute sweet basil—but this time only.Noodle timeThai Basil Sauce Noodles with Jammy EggsThese noodles hit every note we look for in a satisfying dinner: Herbaceous, saucy noodles, fresh crunchy toppings, and a jammy egg on top. It's really worth seeking out grassy, spicy Thai basil for the the three-ingredient basil sauce.View RecipeExplore Bon AppétitThai BasilRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-10", "author": ["Condé Nast", "Kate Kassin"]}