{"id": "e54e4fdcdce0669dd1ca1e1cb6ab691f", "url": "https://www.bonappetit.com/story/pickled-jalapenos", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "Pickled Jalapenos Are the Zippy, Zingy, Crunchy Ingredient Your Salads, Sandwiches, And Dips Have Been Missing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingJalapeños Are Good. Pickled Jalapeños Are VERY GoodJalapeños for pickle people.By Ali FrancisDecember 7, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksFacebookTwitterEmailI love every single recipe born of Ali Slagle’s brain—and it’s not just because I’m a fellow Ali. Each dish kicks, screams, and basically begs me to make it. Following that decree to its logical end, I am obviously obsessed with her latest: a wintry wedge salad loaded with plenty of exciting things. There’s the salty-meaty mortadella that looks like Italian terrazzo and makes the end result worthy of wall space at the MoMA; there’s the bright buttermilk dressing that leaves steakhouse blue cheese back in the 1930s (where it belongs); and then there are the jalapeños—an already excellent food taken to zippier, more potent heights when they’re pickled.Listen, I love jalapeños in all their forms—blitzed raw into a salad dressing, charred and scattered over pork chops, and infused into fruity cocktails—but I like them best when they’re pickled. Not only do they, like the Midas of peppers, flavor everything they touch with their characteristic floral, peppery heat, they also inject dishes—especially those that are fatty, cheesy, dairy-heavy, rich, and otherwise delicious—with a much-needed jolt of acidity. When jalapeños hang out in brine for a while, they grow plump with salty vinegar, aromatic with herbs and spices, and a little less spicy (some of the heat leaches into the pickle juice). The eating experience also transforms: They’re less of a crunch and more of a delightful pop-squish, like capers or Castelvetrano olives.Store-bought jars of pickled jalapeños are perfectly delicious. But if you feel like doing more work than unscrewing a cap—or if you bought a glut of peppers at the farmers market—you can make quick-pickled jalapeños (or anything) at home too. First, slice your peppers into rounds. There’s no law against using whole jalapeños, but smaller pieces will soak up the brine faster. Bring 1 cup distilled white vinegar, 2 Tbsp. kosher salt, 2 tsp. sugar, up to 2 Tbsp. spices (e.g., peppercorns, ­coriander seeds, and/or ­mustard seeds), chopped fresh herbs (like cilantro), and 2 cups water to a boil in a saucepan. You’ll want enough liquid to cover the peppers, so feel free to scale this ratio up or down as needed.Transfer sliced peppers to clean glass jars and pour over the brine, leaving ½ inch of headspace between the liquid line and the rim. Screw on the lids and let the jars cool before transferring to the fridge. Your pickled jalapeños will be best after 48 hours and last up to two months refrigerated. Scatter them (the homemade or jarred variety) over chicken nachos, tuck them into a grilled cheese or seared halloumi burger, dice them up and stir a handful into your game night queso, or fold them into your cocktail party gougères. Once you get to the end of the jar, you’ll probably be left with some vinegary brine—a.k.a. liquid gold. Lucky you! Use it to enliven just about any soup, like Ali Slagle’s perfect mushroom number (of course).Get the recipe:Mortadella Wedge SaladIt’s not like a regular wedge; it’s a cool wedge—and by cool we mean stuffed with pickled jalapeños and paper-thin slices of mortadella and drizzled with tangy buttermilk dressing.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-07", "author": ["Condé Nast", "Ali Francis"]}