{"id": "e54fe1b450e2556921e07c5f027c40b8", "url": "https://www.bonappetit.com/recipe/ultimate-sugar-cookies", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "Ultimate Sugar Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2013 IssueUltimate Sugar CookiesBy Alison RomanPhotography by Alex LauDecember 3, 20214.2(370)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintThe best sugar cookie recipe is one that yields a workable dough for the cutouts of your dreams and a delicious yet unobtrusive canvas for decorating with sanding sugar, royal icing, or a colorful glaze (tie-dye, anyone?). This one yields crisp yet tender cookies that keep their shape when baked, taste great, and last a while in the freezer too, so you can make batches in advance and adorn them all later. Rolling out your dough between two sheets of parchment paper guarantees that this easy sugar cookie recipe is as supreme (and executable) as its name suggests, as thinly rolled cookie dough can stick to even the coldest countertops.If you’re planning to include these sugar cookies as part of a holiday cookie tin, we like pairing them with the bolder flavors of these Coffee-Hazelnut Biscotti, Zebra-Striped Shortbread Cookies, Spiced Molasses Cookies, and Ancho-Mole Cookies. For even more cookie ideas, check out these festive choices.Editor’s note: This recipe was originally published November 5, 2013.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronElectric Mixer$40 At AmazonAutumn Carpenter Pastry Rulers, Set of 6$20 At Kitchen JukeboxFrench Rolling Pin$17 At AmazonRound Cookie Cutter Set, 12-Pack$12 At AmazonIngredientsMakes 2–3 dozen, depending on size Servings¾teaspoon kosher salt½teaspoon baking powder3cups (375 g) all-purpose flour, plus more for rolling1¼cups (2½ sticks) chilled unsalted butter, cut into ½-inch pieces1cup (200 g) sugar1large egg1large egg yolk1teaspoon vanilla extractPreparationStep 1Whisk salt, baking powder, and 3 cups flour in a small bowl. Using an electric mixer on high speed, beat butter and sugar until well combined (butter does not need to be fluffy), about 3 minutes. Add egg, egg yolk, and vanilla; beat just to combine. Reduce speed to low and gradually add dry ingredients; mix just to combine. Form dough into two ¾\"-thick disks; wrap in plastic. Chill at least 2 hours.Step 2Place racks in lower and upper thirds of oven; preheat to 325°. Let 1 disk of dough sit at room temperature until softened slightly, about 5 minutes. Roll out on a lightly floured sheet of parchment paper until about ¼\" thick, dusting with flour as needed (if dough gets soft or sticky, chill on parchment until firm). Cut out shapes with floured cookie cutters; transfer to parchment-lined baking sheets.Step 3Bake cookies, rotating baking sheets halfway through, until edges are golden, 12–16 minutes, depending on size. Transfer to wire racks and let cool. Repeat with scraps and remaining dough.Step 4Decorate cooled cookies as desired.Do Ahead: Cookie dough can be made 1 month ahead; freeze instead of chilling. Cookies can be baked (left undecorated) 2 weeks ahead; wrap tightly and freeze.Nutrition Per ServingCalories (kcal) 130 Fat (g) 8 Saturated Fat (g) 5 Cholesterol (mg) 35 Carbohydrates (g) 14 Dietary Fiber (g) 0 Total Sugars (g) 5 Protein (g) 1 Sodium (mg) 60How would you rate Ultimate Sugar Cookies?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThese are delicious cookies!  I added a bit of almond flavoring in addition to the vanilla….mmmmm…. so good!  This is my new go-to sugar cookie recipe!  I also used the royal icing recipe that was suggested…I’ll continue to use this icing recipe.  Thanks!AnonymousCalifornia 12/24/2021To those who say too salty, be sure if you are using salted butter you omit the added salt. \nFor those who like soft cookies (yuck) make the dough thicker .\nBrilliant recipe overall!  \nI happen to love crisp cookies and everyone brings the soft store bought dough-consistency cookies to work. Personal feeling is cake should be soft and cookies crisp, but I'm old.. lolAnonymousCalifornia 12/22/2021I followed this recipe last Christmas and Valentine’s Day, way before I realized that weighing ingredients makes for a better bake (and simplifies the baking process). I used these to make hearts, and various Christmas shapes. Here I am, a more experienced baker, coming back to this recipe because it’s delicious. For those who want a softer cookie, as it does make a crisp cookie, I say test out the times with a test cookie to be sure you get the softness you like. Remember that they continue to cook when you take them out of the oven. For those looking for a good cut out recipe or a simple round sugar cookie, look no farther. Ally VSan Antonio, Texas12/5/2020I’m not sure why there are bad reviews to this cookie recipe! this is truly the best sugar cookie i have made! they are buttery, with a hint of saltiness and they firm up perfectly!\nthe timing obviously depends on your oven and knowing hot spots and what not which i do, so i am very pleased! Syracuse, NY10/25/2020Bon Appetit needs to put their recipes in grams! Staffers are constantly pushing purchasing a scale but do not put write recipes with weights to actually use the scale! Bon Appetit put out an article saying 1 cup of flour = 125 grams but Alison Roman who developed this recipe says 1 cup = 145 grams. So which do we use? I am thinking 145g per cup because I did the 125 grams for each cup in the recipe and my cookies spread quite a bit! V bummed.Chicago5/27/2020I was expecting classic chewy sugar cookies. But instead they were pretty dense and not at all chewy. More like a Walkers Cookie. Very disappointing. The flavor of the dough was amazing so when it turned out to be a harder cookie than I was expecting it was pretty sad. lisaledermannSwitzerland4/17/2020I work in a WeWorks type of space here in the District, and I ran a test batch of these cookies to see how they would go over before making them for \"real\".  I followed the recipe to a T and made them using my Kitchen Aid.  The icing/decoration got a bit messed up on the subway (metro here - but that's what it is) but I put them out in a common area to gauge reactions.  So far I've been asked/overhead, \"Someone made these? (after taking a bite)\", and \"You can tell me, you put something 'special' in these right?\"  More importantly, I'm seeing same folks go back for another cookie after finishing one or two already.  I'll definitely make these again and figure out a better way to protect my decorations on public transport so they look as good as they taste.   lobsterindcDC12/19/2019The cookies turned out great! They held their shape and tasted like a sugar cookie should. This was the second recipe I tried. I wish I tried this one first; I could have saved a pound of butter. Georgia 12/18/2019Millenials killing the recipe industry?  OK Boomer.  Great solid recipe, thanks BA!klemmentineCambridge Springs, PA12/15/2019too salty and not enough sugar.  also didnt really make a solid cookie. id just say over all not great. \nAnonymous12/2/2019I felt these were too salty. I would cut the salt in half. Maybe more. Anonymous1/25/2019When did Recipe creators quit calling the beating of Butter, or Butter and Sugar, Creaming?  Millinials? 12/8/2018Explore Bon AppétitCookieDessertSnackNut-FreeBakingChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2013-11-05", "author": ["Condé Nast", "Alison Roman", "Alex Lau"]}