{"id": "e55468c687619b348f44fb5c8896f250", "url": "https://www.bonappetit.com/story/wine-decanter", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "I Love My Decanter, Even Though I’m Not a “Wine Person” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Love My Decanter, Even Though I’m Not a “Wine Person”It makes that mediocre bottle someone brought to your apartment taste (and look) way better.By Emma WartzmanApril 11, 2019FacebookTwitterEmailPhotograph by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I appreciate a nice bottle of wine, especially since joining Bon Appétit, where my colleagues always pour the good stuff. But I am no means a wine person—a.k.a. I still only give somms vague directions, like “something not too sweet” and “not too expensive,” when I’m looking for a glass, and definitely won’t turn up my nose at whatever bottle a friend decides to pick from their local liquor store. I have, however, learned that a decanter is a great way to help said rando red wine taste a lot better. Our wine editor, Marissa Ross, says decanting is like stretching out your legs after a long flight—the extra space and fresh air takes the edge off the juice and allows it to mellow out a bit. Yes, you could (and should!) also stick it in the fridge—mediocre chilled wine is far superior to mediocre room temp wine—but a decanter helps too. Plus, it has the added touch of looking good on your table. I love the curvy shape of mine, but our editor at large Andrew Knowlton digs his Mark Thomas MT Series Bottle (which he uses for a lot more than bottles of red). Either way, it’ll get the job done. Just remember that if you want your wine to be better, it needs to breathe. We all do.Buy it: Crate & Barrel Oregon Carafe, $30 at crateandbarrel.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-11", "author": ["Condé Nast", "Emma Wartzman"]}