{"id": "e5564126948801333a202d51f8190fa5", "url": "https://www.bonappetit.com/story/how-to-improve-boxed-mac-and-cheese", "year": 2022.0, "month": 3.0, "day": 4.0, "content": "Improve Boxed Mac and Cheese By Giving It the Tuna Casserole Treatment | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere Is a Single Perfect Way to Improve Boxed Mac and CheeseAnd it's inspired by Marcella Hazan.By Ella QuittnerMarch 22, 2022FacebookTwitterEmailPhotograph by Isa Zapata, Food Styling by Judy Kim, Prop Styling by Stephanie De Luca.FacebookTwitterEmailIn Cheap Tricks we’ll help you make the most out of everyday supermarket staples. Today, how to improve boxed mac and cheese.Boxed macaroni and cheese had quite the 18 months. Kraft factories had to dramatically increase shifts to meet tidal waves of demand spurred by nostalgia and remote work. Cheetos released its own neon-hued Flamin’ Hot contribution, which flew from shelves. Even Gal Gadot made a foray into the aisle, with her DTC crafted-from-plants take on the classic.All of which changed, for me, exactly nothing.I still maintain that all boxed macs are created equal, and that there is a single perfect way to prepare each and every one of them. It’s the 15-minute, zero-fuss technique I turn to when I’m craving fancy pasta but can't be bothered to chop an onion or uncase a sausage. It goes like this:1. Take a salty swimThe first step toward better boxed mac? Over-salt your water. Whichever brand you choose, the noodles tend to be tinier, with a quicker cook time. Use those minutes wisely, to season. For a single box of macaroni, I add 1 heaping Tbsp. Diamond Crystal kosher salt to 6 cups water.2. Ignore the box instructionsWhen the water comes to a boil, set a timer for 2 minutes less than the box says to cook the noodles. Because most boxed macaroni shapes are little and flimsy (like elbows or wagon wheels), they can turn to mush quickly. Start checking for doneness once your timer goes off. You’ll want to get the noodles outta there as soon as they’re al dente, which means just cooked all the way through, with a firm bite in the center.Meanwhile, as the noodles cook, prepare your mix-ins.3. Give it the tuna casserole treatmentBox instructions would have you drain and toss the cooked noods with cheese powder, milk, and optional butter. But for a much better mac, you’re going to ignore those directives. The trick to upgrading boxed mac is to work with the flavor packet, which can veer a little chemically. The ingredients in Macella Hazan’s fettuccine col sugo di tonno con aglio e panna (fettuccine with tuna sauce, garlic, and cream) do just that. (nonnas everywhere, I beg for your forgiveness.)The cream and canned tuna introduce velvety, briny elements that actually—and shockingly?—complement the sharp tang of powdered cheese. And the result tastes like a deconstructed tuna casserole: creamy, salty sauce coating chewy pasta, with flaked tuna for texture (hold the canned soup). Parsley and freshly ground black pepper keep it from tasting like the punchline of a joke about the 1950s.So, while your noodles are cooking, add the following to a bowl large enough to fit all of the mac, using a fork or whisk to combine until no large clumps remain:The flavor packet from your box of mac and cheese2-ish Tbsp. chopped parsley (note: chop and reserve a little extra for garnish)Half a clove of raw garlic, finely minced; you can amp this up to a whole clove if you’re a certified Garlic GirlA large handful of freshly Microplaned or grated Parmesan or any hard, salty cheese1 large egg2 Tbsp. softened butter¼ cup heavy cream1 can oil-packed tuna, drainedSalt and freshly ground black pepper to tasteThen when your noodles are al dente, use a spider or slotted spoon to transfer them directly to the bowl. They’ll bring a bit of salty cooking water with them, which will help to emulsify the sauce. Mix until it’s creamy and coats the macaroni evenly. If you need a little extra liquid, another splash of cooking water will do the trick. Taste and adjust seasoning as needed with salt and freshly cracked black pepper—you shouldn’t need much.4. Finish with toasty crumbsFor the true tuna cass experience, top each bowl with panko—bonus points if you’ve given it a brief toast on the stovetop with olive oil and salt. Or crumbled saltines. Or crushed Cheez-Its, oyster crackers, or Ritz crackers. Really, it’s hard to go wrong.Unless, of course, you try to serve this to a nonna. In which case, you didn’t hear about it from me.Explore Bon AppétitCheap TrickscookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-22", "author": ["Condé Nast", "Ella Quittner"]}