{"id": "e584e78d3930c716a886f4951ae0a4d9", "url": "https://www.bonappetit.com/recipe/grilled-leeks-with-brown-butter-and-spiced-hazelnuts", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Grilled Leeks With Brown Butter and Spiced Hazelnuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueGrilled Leeks With Brown Butter and Spiced HazelnutsBy Molly BazOctober 20, 20204.5(16)Read ReviewsTriangleEmailPinterestPrintPhotograph by Kelly Marshall, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThe glory of these leeks is the contrast between their deeply charred exteriors and jammy, sweet interiors. Pay attention to the hot spots on your grill and move leeks around if they are charring more quickly in some places than others.Ingredients8 - 10 Servings1cup crushed blanched hazelnuts¼cup sesame seeds4Tbsp. unsalted butter¼cup plus 3 Tbsp. extra-virgin olive oil1¼tsp. smoked paprika1tsp. light or dark brown sugar3tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, divided1tsp. freshly ground black pepper, plus more3garlic cloves12medium leeks or 8 large leeks, white and pale green parts only, roots trimmed, halved, quartered if large2Tbsp. sherry vinegar or red wine vinegarPreparationStep 1Prepare a grill for medium-low heat. Cook hazelnuts, sesame seeds, butter, and ¼ cup oil in a small saucepan over medium-low heat, stirring and swirling pan often, until nuts are a deep golden brown, 7–10 minutes. Remove from heat and stir in paprika, brown sugar, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and 1 tsp. pepper. Finely grate in garlic; stir to combine. Set aside.Step 2Place leeks in a medium bowl and toss with remaining 3 Tbsp. oil and 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt; season with pepper.Step 3Arrange leeks, cut side down, on grate. Cover and grill, undisturbed, until deeply charred underneath, 10–15 minutes. Using tongs, turn leeks over. Cover and grill until deeply charred on other side and very soft inside (cut through one to test), 10–13 minutes.Step 4Transfer leeks to a platter. Drizzle vinegar over; top with sauce and nuts.How would you rate Grilled Leeks With Brown Butter and Spiced Hazelnuts?Leave a ReviewTell us what you thinkReviews (5)Back to TopTrianglewhat do I do with the sherry/red wine vinegar??? lol. Recipe slapped without it though!!!! highly recommend.trentchicago4/22/2021LOVE the hazelnut topping!\nAnnetteArlington, WA12/18/2020This was our favorite dish at Thanksgiving this year. The only thing is we under-grilled the leeks and they were a tiny bit tough to cut. Make sure they are custard-y before serving!! AnonymousMinneapolis, MN11/27/2020This was a great alternative to the usual super sweet or bacon loaded vegetable dishes for Thanksgiving. By all means, make those side dishes, but this really stuck out on flavor amongst all my sides.AnonymousBrooklyn, NY11/26/2020The world is not ready for this level of audacity yet.M L11/19/2020Explore Bon AppétitLeekVegetableHazelnutNutFallSideHealthyishThanksgivingRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Molly Baz"]}