{"id": "e595887ed50bec58b0e632c962c525a5", "url": "https://www.bonappetit.com/recipe/shortcut-puff-pastry", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Puff Pastry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueShortcut Puff PastryBy Claire SaffitzOctober 16, 20184.6(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintTo get an incredibly flakey, multi-layered puff pastry that's better than the store-bought stuff, but not as labor- or time-intensive as the real deal, try our cheater's version: You don't need to a beurrage (a.k.a. big butter block) or a laminator—just a box grater and some self restraint. (There's no need to smash the butter to smithereens—it’s those large pieces that make for a flaky pastry!) Use it for our Butternut Squash Tarte Tatin and Glazed and Flaky Apple Tart. When it comes out of the oven and you experience how buttery and light it tastes, you'll be amazed that you made it yourself.IngredientsMakes 26 oz.2Tbsp. sugar1½tsp. kosher salt2½cups all-purpose flour, plus more for surface1¼cups (2½ sticks) chilled unsalted butterPreparationStep 1Whisk sugar, salt, and 2½ cups flour in a large bowl to combine. Grate ½ cup butter on the large holes of a box grater directly into bowl (work quickly so the butter doesn’t soften too much in your hands).Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 2Thinly slice remaining ¾ cup butter and add to bowl. Toss to coat butter, then quickly smash slices with your fingers into smaller, flatter pieces.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 3Gradually drizzle in 7 Tbsp. ice water, tossing constantly with a fork to distribute. Using your hands, knead dough a couple of times in bowl to bring together in large clumps. Transfer clumps to a piece of plastic wrap, leaving dry bits behind. Toss dry bits in bowl, drizzling in more ice water by the teaspoonful as needed, until they hold together when squeezed in your hand (it will be very dry, which is normal).Step 4Add to dough on plastic and wrap tightly, forming into a 6\" square. Flatten, pushing dough into corners and pressing out any air pockets. Chill 2 hours.ChevronChevronStep 5Let dough sit at room temperature about 4 minutes to soften. Roll out on a lightly floured surface into a long rectangle about ¼\" thick.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 6Fold into thirds like a letter and rotate 90°. Repeat rolling and folding process, dusting with more flour as needed. Rewrap tightly and chill at least 30 minutes before using.ChevronChevronStep 7Do Ahead: Dough can be made 2 days ahead. Keep chilled.How would you rate Shortcut Puff Pastry?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleGreat recipe! I've made pot pie crust and plum hand pies from these, and both came out wonderfully-- especially with an egg wash before putting it in.Anonymous10/5/2021Made some very delicious (if dry, but I think that was on me!) croissants with this puff pastry recipe. I did them at 350 F for about 25 minutes before ramping the oven up to 400 F for another 5 minutes before I called it quits.AnonymousGeorgia8/20/2019When you go to bake with this, what temperature would you bake it at?AnonymousMaine2/23/2019Explore Bon AppétitPastriesDoughDessertFrenchEuropeanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Claire Saffitz"]}