{"id": "e5ab1e7412d57847920e4e17bc2e6069", "url": "https://www.bonappetit.com/story/real-outdoor-cooks-agree-this-is-the-counter-for-adventurous-cooking", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Real Outdoor Cooks Agree: This Is The Counter for Adventurous Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredReal Outdoor Cooks Agree: This Is the Counter for Adventurous CookingBy CaesarstoneApril 2, 2020FacebookTwitterEmailFacebookTwitterEmailIf you’re the kind of person who finds inner peace while glazing fatty ribs on a smoke-spewing barbecue, an outdoor kitchen isn’t just an indulgence—it’s a necessity. But for most in-the-field chefs with a flair for the dramatic, open-air setups are a far cry from their indoor counterparts in both form and function. The reason? Traditional materials like marble—which stain easily, break often, and are famously temperamental—simply can’t last long outside, exposed to the elements. (And let’s face it, even inside these materials often fall short.) Instead, outdoor cooks who are unafraid of getting dirty prefer luxe quartz surfaces from Caesarstone’s new Outdoor Collection. Durable and sleek, these counters elevate whatever’s on the menu, from casual charbroiled burgers to delicate filets of salmon.Need more convincing? These impressive dishes prove that these surfaces will help you live your best outdoor chef life.Grilled Beets with Citrus and HerbsCooking with richly hued ingredients can be an anxiety-inducing experience with standard counters. Why grill juicy beets over an open fire when a single ruby droplet might ruin your countertops forever? With Caesarstone’s Outdoor Collection surfaces, cooks can breathe a welcome sigh of relief—stains are a non-issue. Earthy beets get a hit of smoke from the grill, zinged up with charred orange and lemon. A flourish of fresh herbs—fresh mint and chopped chives will do nicely—finishes things off. After everything’s cooked and plates are licked clean, just wipe down surfaces with a soft-scrub gel and non-abrasive sponge. Voila! Good as new. With the Outdoor Collection’s non-porous counters, chefs can spend more time dreaming up new flavor combinations and less time worrying about how long it will take to clean up the resulting mess. Beets not your jam? Give caramelized pork chops marinated with turmeric and honey or saffron-spiked rack of lamb on the grill a whirl.Grilled Banana S’moresThere’s no reason you can’t grill in the dead of winter. At least not if your outdoor kitchen is outfitted with Caesarstone’s surfaces, which can easily weather elements from rain to shine to snow. Once temperatures dip, try grilling up ripe bananas and stuffing them inside an oozy graham cracker and marshmallow s’mores sandwich. We recommend enjoying them under a blanket. This magic is possible thanks to a special formula developed by in-house experts, which ensures the quartz can withstand harsh UV rays and extreme conditions like long-term water exposure, ice, and temperatures ranging from -13°F to 122°F (-25°C to 50°C).Yogurt-Marinated Grilled ChickenOn a generously sized cutting board, pound chicken cutlets to a narrow ½-inch thickness for this yogurt-marinated grilled chicken number, which is zinged up with plenty of garlic, lime juice, and a hearty dose of fragrant garam masala. Your counters can withstand harder impacts than materials including ceramic, granite, concrete, and stainless steel. Even better, they’re scratch- and stain-resistant. Translation: You can cook more—and cook harder—so long as you exercise common sense.Cinnamon-Spiked Turkey ChiliNew shades in the Caesarstone Outdoor Collection mean there’s a hue for every kind of cook. Love to simmer cinnamon-spiked turkey chili in gleaming copper pots in the fall? Go for clay-colored “Clearskies 406,” which helps warm up spaces with earthen vibes. Are you famous for springtime cocktail parties where the Sazeracs don’t stop flowing? Opt for “Palm Shade 515,” which boasts a translucent, marble-like white base and subtle veining. Meanwhile, creamy grey “Midday 405” is the right addition to your smartly manicured backyard enveloped in green foliage, a picture-perfect backdrop for an impromptu tea party complete with delicate radish-chive tea sandwiches and fruitcake petit fours.When you cook adventurously, you’ll naturally want a kitchen that can keep up with you. With Caesarstone, there are no limits on your culinary potential. Find out more at  www.caesarstoneus.com/outdoor.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-02", "author": ["Condé Nast"]}