{"id": "e5b0c2badb709c94f358214d77a5fbef", "url": "https://www.bonappetit.com/recipe/brothy-beans-and-farro-with-eggs-and-mushrooms", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Brothy Bean Stew with Mushrooms Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueBrothy Beans and Farro with Eggs and MushroomsBy Andy BaraghaniJanuary 9, 20183.7(29)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintStirring a raw egg yolk into each bowl at the end adds silkiness, heft, and protein. But this dish is satisfying without it, too. The secret to delicious-tasting beans is infusing the cooking liquid with aromatics like onions and garlic, then seasoning it liberally at the end until it's just shy of salty.Ingredients4 servings1small onion, unpeeled, halved1medium carrot, peeled4garlic cloves, 1 smashed, 3 finely chopped1½cups dried gigante, runner, or lima beans, soaked overnight, drained1cup farro or spelt, soaked overnight, drainedKosher salt2red Fresno chiles, seeds removed, finely chopped⅓cup plus 3 tablespoons extra-virgin olive oil2tablespoons finely chopped rosemary8ounces maitake or shiitake mushrooms, torn into bite-size pieces2teaspoons sherry vinegar or red wine vinegarFreshly ground black pepper4large egg yolks, room temperaturePreparationStep 1Bring onion, carrot, smashed garlic, beans, and 14 cups water to a boil in a medium pot, reduce heat, and simmer, stirring occasionally, until beans are creamy but still intact, 70–90 minutes (time will vary depending on size and age of beans). Using a slotted spoon, transfer beans to a medium bowl; discard onion, carrot, and garlic.Step 2Return broth in pot to a boil and add farro. Reduce heat and simmer, stirring occasionally, until grains are tender, 25–30 minutes. Remove from heat and return beans to pot; season generously with salt. Let sit 15 minutes to infuse beans and grains with flavor. (If you have the time, cook the beans and the grains a day ahead so they can really soak up the broth. If not, no worries—just keep going.)Step 3Cook chopped garlic, chiles, and ⅓ cup oil in a medium skillet over medium heat, stirring often, until garlic is golden, about 4 minutes. Remove from heat and mix in rosemary. Transfer chile-garlic oil to a small bowl; season with salt.Step 4Wipe out skillet and heat remaining 3 Tbsp. oil over medium-high. Cook mushrooms, undisturbed, until browned underneath, about 2 minutes. Toss and continue to cook, tossing every so often, until mushrooms are browned and crisp in most spots, another 6–8 minutes. Splash vinegar over mushrooms, season with salt and pepper, and give skillet a few shakes to combine.Step 5Ladle stew into bowls and top each with some crisped mushrooms and an egg yolk (if using); drizzle with chile-garlic oil.Step 6Break egg yolk and stir into soup just before eating to give it a more silky consistency.Step 7Do Ahead: Stew (without mushrooms, egg yolks, and chile-garlic oil) can be made 3 days ahead. Let cool; cover and chill.How would you rate Brothy Beans and Farro with Eggs and Mushrooms?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleWish I had actually read the reviews before making... don't understand how a recipe with so many bad comments has a 4.3 star rating. Then I realised the ratings meter is broken... I tried to rate 1 star but it came up 5!\nAnyway, this is a very bland, dull, labour intensive soup. I didn't understand why it's popular... until I realised, it's THAT Bon Apetit! The one I keep hearing about the terrible racist work culture staffed with hipsters who don't really know much about food, but know a lot about fashion and food photography. This is food for non-foodies.AnonymousSydney, Australia3/27/2021Is 14 cups of water in a medium pot right for the first step? That seems like a LOT of H20.ExpensiveCheeseBrooklyn3/10/2021Not as flavorful as I would have liked. Raw egg didn't work out too well. Wouldn't make it again.AnonymousCalifornia10/18/2020I, too, heard about this from “The Splendid Table” podcast and was impressed with the result. This is a craveable dish that I make repeatedly, (without the eggs, due to allergy)).  I even keep the rosemary garlic chili oil out to put on other dishes.  The layers of flavor and texture pop in my mouth.  Shitakes and maiitakes together work for me.  I first ordered gigante beans for a special occasion meal, but now mostly use limas which I prefer.  I use less water than indicated because I make it in a pressure cooker and I also keep the veggies in the soup. Thank you for this recipe.leamindaSedona6/7/2020Andy waxed poetic about this dish last winter on The Splendid Table, and it really didn't live up to the hype. This is just another example of a BA recipe asking you to devote hours of your life for a very mediocre result.\n\nI'm tired of BA posting pretty pictures without explaining how they get there. If you want a nice clear broth, you've got to cook your beans without even a hint of a simmer. If you're not skilled at cooking beans with such fuss, use a slow cooker for clear broth. But then, when you cook your Farro in the bean liquid, the Farro will release a ton of starch and make your bean liquid cloudy anyway. So, why did they post such a nice photo? To get you to make it. They probably cooked their Farro in a pot of salted water and drained the water so as not to muddy the dish when taking photos. I am tired of food stylists. That being said, this dish is tasty if you like beans, grains, mushrooms, and spicy food, and investing hours of your time into simple food.AnonymousLos Angeles, CA6/5/2020Awesome awesome soup recipe! I used regular white beans in place of lima or other big beans because I couldn't find any, and I used quick cook farro from Trader Joe's. Just adjust the times of cooking accordingly (always stand by and taste every so often!). Definitely make a little more broth than it calls for, I ended up dumping some chicken stock in at the end to make more. Also, add miso! I added a couple tablespoons in the beginning and it made everything better. Yolk is also a must!AnonymousLas Vegas, Nevada5/29/2020This was really great!  I'm in NYC and stuck in the house, so all day cooking projects are quite welcome.  Some changes - I chopped carrots and two onions instead of leaving whole and we kept them in the broth.  I used dried shitakes and used their soaking liquid in the broth.  We replaced the farro with cauliflower rice.   We had some of the jarred crunchy chili garlic so I used that instead of making chili oil.  We had fresh sourdough multiseed bread that I made earlier in the weed to go with it and it was really delicious!  I agree with the previous comment that it's a bit fussy but if you don't mind it, it's worth the end result!Ari SchnabelNYC3/27/2020So so delicious. Mine does not look like the image pictured above, but oh well. Each component, the beans, the farro, the chili garlic oil, and the mushrooms all make this such an amazingly delicious (and meat free!) dish. It is so worth the time and effort and makes for a swooningly good lunch days later even. If you are not vegan, don't skip the yolk, it makes for such a creamy, silky finish. My substitutions/changes/takes: I used large lima beans - seemed to work well. I used about 4 cups of veggie stock and less water than called for. (I wanted flavor over consistency) I substituted jalapenos for the fresnos as I can never find fresnos in my area. I soaked the farro and beans overnight the night before, made them, and then let them sit in the broth for a few hours - I think this made for a really nice flavor. Am planning on making this at least a few times a month!curlyglamourgirlieLawn Guyland, NY1/14/2020kind of disappointed with this one, but still a dish worth making/eating. i'd like to try it with maiitake mushrooms instead of the shiitake i had.wheres_the_veg1/13/2020This is such a comforting warm recipe.  It has a lot of depth for a bean dish.  We definitely used the egg yolk! My only question/concern is I made the beans and farro early in the day and when I went to heat them up to finalize the dish for dinner they had soaked up all of the bean broth.  I added some water to thin as I warmed them.  It turned out out great but is there a way to keep it brother if you made the beans and farro ahead?marniewarnerCrozier,VA1/11/2020This soup recipe is impressive and will impress the lucky mouths you share it with. It’s beautiful and delicate on the outside and packs a deep, rich flavor on the inside. The silky egg yolk provides a luxurious texture you didn’t expect. Don’t skip it unless you want to punish your tastebuds. This recipe takes time and love so consider saving it for a Sunday or making the beans ahead of time. Regardless, it’s one-hundred percent worth it. \n\nholds a deep depth This soups depth of flavor is savory, rich, and perfectly delicious. stephaniedarcy14527Seattle12/3/2019This recipe was wildly successful with my family.  Everyone including my 6 year old, 10 year old and husband loved it.    I agree it feels like lots of steps, but next time I will cook and keep the beans ready ahead of time to save on actual cooking time the day of the meal.   Two changes to the recipe:  I used Rancho Gordo Mayacoba beans and I added a few drops of liquid smoke which I felt elevated this dish above and beyond the norm.  The combination of the smoky flavor and silky egg yolk was amazing. AnonymousNew Delhi, India11/26/2019The first bite of this was shockingly delightful. I spent my afternoon making this soup while getting some other work done and couldn't really imagine what it was going to taste like as I was preparing it. It came together quite easily. I didn't soak my beans overnight nor the farro. Instead, I soaked just an hour or so before I started cooking. I ended up adding a few extra cups of water to the beans as they were cooking as they needed extra time. FYI, in case you're like me and have a hard time planning a day ahead. I'll certainly be making this dish again. It is very silky and cozy, with or without the yolk, and would definitely wow a few guests joining you on a crisp fall evening along with a great bottle of red wine.AnonymousPhiladelphia10/7/2019I've made this soup a few times, and it is freakishly good. I love lima beans, sherry, and maitakes, so the pitch was certainly easy, but the body the farro brings to the table is wonderfully lush and round, and the rosemary is truly indispensable; who knew sherry vinegar needed the help. I don't even make it with the egg and it's one of my favorite soups. If I had to pick one soup recipe to make on a date, which is admittedly somewhat contrived, this'd be it. I'm making it later this week, thank the gods. Andy be PraisédAnonymousLos Angeles, California9/7/2019Clever, clever, clever recipe. Made almost as written. Browned the vegetables in a really hot skillet to add color and flavor to the cooking stock, and also added a porcini mushroom bouillon cube to the stock. Also eliminated a step, cooked the beans about half done and went ahead and added the farro. Definitely a Sunday afternoon endeavor, but completely worth it.AnonymousLawrence Kansas2/17/2019Explore Bon AppétitStewSoups and StewsLima BeanWhite BeanBeanVegetableFarroRice & GrainsMaitake MushroomMushroomShiitake MushroomSpeltGigante BeanMainDairy-FreeNut-FreeVegetarianHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}