{"id": "e5b736dc78e9c3548e6546cf5d824c94", "url": "https://www.bonappetit.com/story/desk-lunch-self-care", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "I Eat Lunch At My Desk and I Like It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Eat Lunch At My Desk and I Like ItA grain bowl in front of my computer is my version of self care. Don’t @ me.By Emily SchultzOctober 7, 2019FacebookTwitterEmailIllustration by Łukasz GolędzinowskiFacebookTwitterEmailWhen my grandma calls to check in, it’s usually a Tuesday around 12:45 p.m., the time people in T.V. shows gather in a “staff lounge” to eat their Tupperware-packed lunches. She picks up on the fact that I’m at my desk, because I’m usually speaking softly, which is precisely when the concerned voice comes in: “Don’t you have a lunch break?!”Yes Nanny, I do have a lunch break. But I spend it at my desk, not because I’m a crazed New York Media person who spends all of her time checking emails and reading between the lines of the latest subtweet. But because I actually enjoy eating my lunch in front of my computer.I know, I know, everyone says that we spend too much time in front of screens, that we should be getting up from our chairs more, that we should be going outside, and what’s that thing about stopping to smell the roses? Well I keep my computer brightness down to a level that makes my eyes happy, and so what if I like the nothingness smell of a cookie-cutter corporate office? I’m still taking a break, just maybe not in the way the latest women’s health magazine tells me to.Here’s the thing: If you catch me chomping on my desk salad or leftover pasta or hard boiled eggs, I’m not actually working. I’m catching up on the latest from The Cut, or scrolling through meme Twitter, or reading the longform article my coworker Alex Beggs dropped into slack that morning. (She always has good intel on the things you should and shouldn’t be reading on the internet.) Looking busy enough that no one bothers me definitely feels like a win—and it’s way better than staring into some abyss for 30 minutes while poking and prodding some bibb lettuce.So the next time you see something about how peak self care, health, wellness, and happiness is taking 30 minutes during your day to be away from your computer, call bullshit, pull out your lunch, and read about Father Divine or WTF glitter is instead.Explore Bon AppétitLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-07", "author": ["Condé Nast", "Emily Schultz"]}