{"id": "e5c789baf0fbc45c74fe5753e1016b66", "url": "https://www.bonappetit.com/recipe/ginger-cardamom-zucchini-bread", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Ginger-Cardamom Zucchini Bread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueGinger-Cardamom Zucchini BreadBy Lena SareiniMay 25, 20214.1(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by D'Mytrek BrownEmailPinterestPrintEmailPinterestPrintZucchini’s high moisture content gives this loaf cake from pastry chef Lena Sareini its soft crumb, while ground ginger, turmeric, and cardamom infuse the crumbly oat streusel with bold flavor. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLoaf Pan$15 At AmazonBox Grater$13 At AmazonKitchen Towels$22 At AmazonWhisk$10 At AmazonIngredientsMakes one 9x5\" loafstreusel⅓cup (42 g) all-purposeflour2Tbsp. plus 1½ tsp. (30 g) dark brown sugar¼cup (24 g) old-fashioned oats½tsp. ground cardamom½tsp. ground ginger½tsp. ground turmeric¼tsp. baking powderPinch of kosher salt2Tbsp. unsalted butter, melted, cooled slightlybreadNonstick vegetable oil spray2½medium zucchini (about 1 lb.), trimmed¾tsp. vanilla extract1½cups (300 g) granulated sugarZest of 1 lemon3large eggs¾cup grapeseed oil1¾cups (219 g) all-purpose flour2¼tsp. ground cardamom2¼tsp. ground ginger2tsp. baking powder1¼tsp. Diamond Crystal or ¾ tsp. Morton kosher saltBlueberry jam and/or crème fraîche (for serving; optional)PreparationstreuselStep 1Whisk flour, brown sugar, oats, cardamom, ginger, turmeric, baking powder, and salt in a small bowl to combine. Drizzle butter over and, using your fingers, work into dry ingredients until butter is absorbed and clumps form. Set streusel asidebreadStep 2Place a rack in middle of oven; preheat to 350°. Coat a 9x5\" loaf pan with nonstick spray and line with parchment paper, leaving a generous overhang on long sides. Using the grater attachment of a food processor or the large holes of a box grater, grate zucchini. (You should have about 3 cups.) Wrap shredded zucchini in a kitchen towel and wring out as much excess moisture as you can. Transfer to a small bowl and mix in vanilla extract (adding the vanilla here means the zucchini will take on more of its flavor).Photo by Emma Fishman, food styling by D'Mytrek BrownStep 3Place granulated sugar and lemon zest in a medium bowl and, using your fingers, work zest into sugar until sugar starts to clump and mixture is very fragrant, about 1 minute. Add eggs and oil to bowl and whisk to combine. Add grated zucchini and whisk again to incorporate.Step 4Using a fine-mesh sieve, sift flour into another small bowl. Add cardamom, ginger, baking powder, and salt and whisk to combine. Add dry ingredients to zucchini mixture and gently fold with a rubber spatula until there are no visible flour streaks remaining and batter is homogeneous. Scrape batter into prepared pan and smooth surface. Scatter reserved streusel evenly on top.ChevronChevronStep 5Bake zucchini bread, rotating pan halfway through, until a tester inserted into the center comes out clean, 1 hour 30 minutes to 1 hour 45 minutes. Transfer pan to a wire rack and let zucchini bread cool completely in pan.Step 6Run a small offset spatula or paring knife around sides of zucchini bread to help loosen, then turn it out onto rack.Step 7To serve, cut zucchini bread into thick slices and divide among plates. Top with jam and crème fraîche if desired.How would you rate Ginger-Cardamom Zucchini Bread?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleThis was interesting at best because cardamom isn't a very common spice in my experience. Not worth making again. As mentioned by others, the streusel didn't stick. Maybe it needs more butter? The bread was moist so I may try it with a different combination of spices. Meg2/26/2022This recipe produced the best zucchini bread that I've ever eaten! I made it pretty much as written with just two exceptions. Thanks to commenters below, I separated the grated zucchini into three batches and dried them separately. Great idea that worked well. When the final mixed batter was rather soupy, I added 1/4 cup (+/-) of flour to the mix. 90 minutes later, I had a perfectly baked loaf with a divine streusel topping. Thanks a bunch, Lena!John M.Colorado9/28/2021This recipe is a winner! Absolutely delicious and moist. \nI grated zucchini, sprinkled with salt then let it drain for 30+ min before squeezing out the leftover moisture. \nI also used EVOO instead of grape seed oil. \nAbsolutely delicious! ZAspen 9/22/2021This recipe is AMAZING, I've made probably four or five loaves the last two months. I took the advice of some reviews and drained the zucchini in two or three separate batches just to make sure I got out all the moisture I could manage. Also, the first time I made it, the streusel on top got a little too crispy in the oven. I recommend putting tin foil on top halfway through the bake just to keep it from burning. Highly recommend trying this recipe-- it has amazing flavor,  texture, and is a great way to use up leftover zucchini from the summer season!Anonymous9/20/2021I made this as directed and it was delicious! It was such a  huge hit with adults and kids, that I wish I'd made two. It was completely gone in one sitting!ColleenMiurphys, CA8/8/2021Wonderful! I added a quarter cup of flour as others suggested. I didn't have ground ginger so I added a mix of cinnamon, turmeric, and allspice. I made them into muffins and cooked them for 25 minutes. They are AMAZING! A great way to use up zucchini this summer. Isabelle Minneapolis, MN7/31/2021Finished product is very delicious, crumb is scrumptious, lemon zest makes flavor pop. Excellent.Kathleen BrownPa.7/31/2021Loved this!  Also a hit with a teen who doesn't eat green things.  I tweaked it a bit because, well, I gotta be me.  First, I ground up all the spices in a dedicated coffee grinder, which made a paste.  I split the paste proportionally between the streusel and batter. I love allspice so I tossed in a single berry.  Due to a brain cramp, I didn't have lemon or vanilla on hand, so I skipped 'em.  I did squeeze out the shredded Z in two towels, but I wasn't confident in the batter after I mixed it all up.  I make carrot cake ALL THE TIME, and this batter was too soupy to my eye.  I tossed in an extra scant 1/4 c brown sugar (because I had it and not white), and a heavy 1/4 c flour.   The batter looked WAY better.  Maybe I could have squeezed more water out, but really, I don't want baking to include a laundry project or an Olympic strength element. I put it into a greased 9x12 baking pan because I don't do parchment paper and I wanted it to bake more quickly.   I used a traditional German streusel (1:1:2 sugar:butter:flour) and tripled it.  Because teenager.   DONE in 30 minutes!  Will do again--and again, and again!  Betty Rubble017307/30/2021I doubled this because I had farmers market zucchini that needed to be used and I'm tired of ratatouille. My batter was a gorgeous yellow. I also ground my spices fresh and tossed my super squeezed calavasas in about 40 grams of flour. We made it as a coffee cake and it's just delicious. Jana T.Denver Colorado7/21/2021I used cheese cloth to wring out the zucchini and had no problems.  I added some 1 tsp of turmeric to the batter.  It was delicious.  Will definitely make againAnonymous7/3/2021Delicious! After reading everyone else's review I was concerned about it turning out stodgy. So, I divided the shredded zucchini in three different batches and spread them in a towel and rung the juice out of each batch. I also added two extra tablespoons of flour to the mix. Then I bake them in two different bread loaf pans so that it would not be too thick. It turned out absolutely beautiful and delicious..Lucy C.Virginia6/30/2021As the other reviewer mentioned, the batter was much soupier than pictured in the recipe. Even with an extra 30 mins bake time, it came out stodgy. I recommend squeezing out the water in 2-3 batches- you can get a lot more moisture out that way. Also, the photos show an almost orange color to the bread, but nothing in the recipe would make it that color. My thought is that maybe turmeric was accidentally excluded from the instructions, since it appears in the crumble but not the batter. \nHowever, I do love the flavor combination. Next time I make zucchini bread, I will likely try to adapt a different recipe to include cardamom and ginger.Jess A6/28/2021Very liquid dough, came out a little stodgy, but still tasted delicious. However I found the topping was too much and it did not really stick to the top. It remained just crumbly and falls off right away when you cut the bread, even that I pressed it into the wet dough before baking.  If it would have been solid crumbs the recipe would deserve 5 stars. Just giving it four (although this page insists I already gave it 5 stars and does not let me change it - just weird.)Cornelia South Orange, NJ6/4/2021Explore Bon AppétitLoaf CakeCakeDessertBreadZucchiniSquashVegetableGingerHerbs & SpicesCardamomTurmericSnackNut-FreeVegetarianBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Lena Sareini"]}