{"id": "e5d3096a99c092833a330ad11020a025", "url": "https://www.bonappetit.com/story/its-its-ice-cream-sandwich", "year": 2018.0, "month": 8.0, "day": 5.0, "content": "It’s-Its Are the Best Ice Cream Sandwich You’ve Never Heard of | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf You've Never Had an It's-Its Ice Cream Sandwich, Please Fix That ImmediatelyIf it's not covered in chocolate shell, I'm not interested.By Aliza AbarbanelAugust 30, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThe ice cream sandwich is a perfect food, so it feels almost sacrilegious to pick a favorite. But I will! It’s an It’s-It.Okay, I realize that It’s-Its are an unlikely contender. They’re largely unknown outside of California, somewhat grammatically traumatizing to type, and are made from the underdog of the cookie world: oatmeal cookies. I know some of you are already groaning: Of course California has an ice cream sandwich made with oatmeal cookies. But these cookies are doused in chocolate shell! The Chipwich could never. Also, there are no raisins involved, because I’m not a monster. Plus I love a good underdog story.It’s-Its were created in San Francisco back in 1928, and they’ve been a regional favorite ever since. I've loved them my whole life, mainly because I was lucky enough to attend summer camp in Northern California, 80 miles north from the original It’s-It factory. Blessedly, the camp somehow decided to adopt the It’s-It as the Official Camp Ice Cream, and each Saturday the counselors would dole them out. It was a feeding frenzy.As a sugar-crazed child getting a weekly ration of ice cream, you can’t do much better than an It’s-It. Especially at a scorching hot summer camp with basically no AC. It’s-Its are surprisingly dense for their size and explosively flavorful—there is no grace in eating one. The ice cream runs down your arm, the chocolate shell melts onto your fingers, and the chewy oatmeal cookies do their very best to hold the whole thing together. Then suddenly you find yourself horking down the whole thing in a blur of cookie bits. It is glorious.The famed It's-It pins.\nPhoto by Chelsie CraigThe It’s-It so defined my camp experience, the camp administration even decided to adopt the treat as the “secret” logo to identify traveling campers. Each summer, the migration to camp is marked by herds of 9-year-olds traipsing through San Francisco Airport with giant yellow It’s-It buttons pinned to their jackets. It’s quite cute, and a bit like going to camp in a Wes Anderson movie.Still, I realize that many people have probably never had an It’s-It before. This must be corrected immediately.  Luckily, you can ship yourself an entire case (25 beauties, all to yourself!), or track them down in Costos, Walmarts, and, yep, artisanal grocery stores. They're currently available in California, Arizona, Washington, Oregon, Texas, Hawaii, Colorado, Delaware, Pennsylvania, Connecticut, New Jersey, and New York.Should you choose to order these perfect ice cream sandwiches online, there are many flavors available to you. But in my eyes, there are only three acceptable ones: vanilla, chocolate, and mint. Of course there are other options—the factory has expanded their flavors to keep up with the times, adding newcomers like pumpkin and green tea to the rotation. I understand the need to compete with activated charcoal soft serve, but give me mint or give me nothing.Buy: It's-Its, $22 for 24.Explore Bon AppétitIce CreamRead MorecookingGet Lost In the Swirls of This Strawberry-Coconut Ice Cream PieBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-30", "author": ["Condé Nast", "Aliza Abarbanel"]}