{"id": "e5d7881cbacb9cea399fb1b5e91aa823", "url": "https://www.bonappetit.com/story/how-to-clean-sheet-pans-trays", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "How to Clean Baking Sheets So They Shine Like the Top of the Chrysler Building | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingHow to Clean Baking Sheets So They Shine Like the Top of the Chrysler BuildingAll the tips and tools you need—including two ingredients you probably already have in your kitchen.By Alyse Whitney and Tiffany HopkinsOctober 8, 2021FacebookTwitterEmailMichael GraydonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Perhaps you’ve accepted that, like a classic white T-shirt, your fave baking sheet will always look dirty—no matter how many times you clean it. All the soap and elbow grease in the world, you lament, won’t make a dent in the burnt-on, tacky patina left over from sheet-pan dinners, roasted vegetables, and oat and pecan brittle cookies. It’s time to recycle it and move on, right?If your half-sheet pan is warped and you’re looking for an excuse to upgrade, we won’t stop you. But you can make that dingy cookie sheet shine again, and the good news is that you don’t need to use harsh chemicals or scour until your arm aches to get the job done. Here are some of the best cleaning tips and tools to make your baking sheets look nearly brand-new.What is the best way to clean baking sheets?The best cleaning hack we’ve tried begins with two products that are probably already in your kitchen: baking soda and white vinegar. Plug up your sink, fill it with hot water, and then add in ½ cup of each. Baking soda and vinegar live on opposite ends of the pH scale, so mixing them causes a chemical reaction that’ll bubble up like a school science project. This is where the magic happens! Submerge your dirty baking sheet and let it soak for 30–60 minutes, then scrub off the grime with a scouring pad, the rough side of a scrubby sponge, or steel wool. The steel wool will likely leave some scratches on your baking sheet, which we’d argue give it character. But if you want the marks to be less noticeable, do your scrubbing in even, circular motions.After buffing the entire surface and loosening all of the residue—this should take a few minutes—wash the baking pan with dish soap and warm water, then dry. Bonus: The combination of baking soda and vinegar will also help clean out your sink drain—because you’re definitely not doing that often enough.Our Test Kitchen's favorite sponges and scrubbers:Photo by Ted \\+ Chelsea CavanaughSkura Style Sponge (Set of 4)$15 at AmazonLaura MurraySteel Wool, 12 Pads$6 at AmazonPhoto by Ted \\+ Chelsea CavanaughKamenoko Tawashi Scrubber$9 at East Fork$7 at AmazonScrub Daddy Sponge$25 at Amazon (4 pack)$4 at Target (single)Even some scrubbing is too much scrubbing. How do I clean my baking sheet with no work at all?The baking soda and vinegar combo is our favorite solution because of its simplicity and lack of harsh chemicals—but there are other tried-and-true cleaning methods. You can also use baking soda with hydrogen peroxide: Sprinkle baking soda in an even layer directly onto your sheet pan, then spray it with hydrogen peroxide until damp. If you let the mixture sit for two hours, you’ll still need to put in some labor—but leave it overnight and scrubbing won’t really be necessary. The chemical reaction between the baking soda and hydrogen peroxide will break up all the gunk, and you’ll merely need to wipe it away with a sponge or scrape it off with a plastic or bamboo scraper before rinsing.Food Grade Hydrogen Peroxide$18 at Amazon$6 at Thrive MarketBambu Pot Scrapers$14 at AmazonI used the last of my vinegar on a giant batch of pickles. Can I clean sheet pans another way?If you don’t have baking soda or vinegar on hand (or were traumatized by middle school science fairs), get yourself a powerful cleaning agent that’ll do the work for you, like Bar Keepers Friend. To use, sprinkle a little over your baking sheet, then add a few drops of water and make a paste. Let it sit for one minute—and not a second longer!—then scrub with a gentle scrubber (skip the steel wool) and rinse the pan. And remember, BKF is INTENSE, so always wear dishwashing gloves when using it.Photo by Ted \\+ Chelsea CavanaughBar Keepers Friend$8 at AmazonPhoto by Ted \\+ Chelsea CavanaughCasabella Waterblock Gloves$8 at AmazonYour baking sheets are clean—now keep ’em that wayOnce you can see your reflection in your cookie sheet, the easiest way to maintain that shine is to line your bakeware with aluminum foil or parchment paper. (Hot tip: Precut parchment paper will make you feel like you have your life together.) Or invest in that silicone baking mat you’ve been sleeping on.Precut Parchment Paper Baking Sheets$15 $14 at AmazonSilicone Baking Mat$25 $22 at AmazonStill want a new sheet pan? Get this one:Nordic Ware Half-Sheet Pan$19.50 at Bon Appétit MarketNow go make meatballs:Crispy Sheet-Pan Meatballs With Salsa VerdeThe quickest, most fuss-free and delicious meatball recipe that ever was or will be.View RecipeExplore Bon AppétitCleaningShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-04-13", "author": ["Condé Nast", "Alyse Whitney", "Tiffany Hopkins"]}