{"id": "e5d75b45421fa35a6b0578197f53d054", "url": "https://www.bonappetit.com/recipe/fancy-and-beautiful-tomato-salad", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "Fancy and Beautiful Tomato Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFancy and Beautiful Tomato SaladBy Sarah JampelJuly 21, 20195.0(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintHere’s the first thing you should make when you want to show off the peak-season tomatoes you’ve been waiting all year for. A colorful gang of cherry tomatoes and dramatic heirlooms are mixed with zhuzhed-up pita chips, salty feta, and lots of herbs. So elegant! So fancy! And, shh, don’t tell the tomatoes, but the real star is the za’atar dressing: Toasty, earthy, and tangy, it’d be welcome on seared zucchini, slow-roasted fish, or corn on the cob. Remember that just because it’s an heirloom doesn’t mean it’ll taste great—your picks should smell incredibly tomato-y and feel heavy for their size—that means they're juicy.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketParing Knife$10 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMicroplane$16 At AmazonLarge Bowl$18 At AmazonSmall Saucepan$155 At AmazonGlass Measuring Cup$19.99 At AmazonMedium Bowl$17 At AmazonSpatula$12.99 At AmazonWhisk$10 At AmazonPlatter$29 At AmazonIngredients6 servings1½lb. heirloom tomatoes (about 3 medium)12oz. mixed cherry tomatoes1¾tsp. kosher salt, divided plus more1lemon½garlic clove6Tbsp. extra-virgin olive oil2Tbsp. za’atar2cups pita chips1½tsp. (or more) honey3½oz. Greek feta½cup basil leaves½cup mint leavesPreparationStep 1Using a paring knife, core 1½ lb. heirloom tomatoes, then cut each into 8–12 wedges, depending on their size, using a very sharp chef knife or serrated knife (if your chef knife is dull, it's going to squish your precious tomatoes). Halve or quarter 12 oz. mixed cherry tomatoes (cutting them through their equators will reveal more seeds and make them even prettier).→  If you care about tomatoes, you need this little knifePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Transfer tomatoes to a large bowl; season with 1¼ tsp. salt. That salt is going to draw out moisture from the tomatoes, which will intensify their flavor. Stir to gently combine (be careful with those delicate tomatoes!); set aside.Step 3Zest ¼ lemon—you want about ½ tsp. zest (it’s easiest to measure if you hold the Microplane upside down so that the zest collects on top and you can scoop it into the measuring spoon). Grate ½ garlic clove. Set aside.Step 4Heat 6 Tbsp. extra-virgin olive oil in a small saucepan or skillet over medium until just starting to shimmer, about 2 minutes. Add 2 Tbsp. za’atar and cook, stirring occasionally, until fragrant and darker in color, 1 to 2 minutes. Stir in reserved lemon zest and garlic. Wait 10 seconds, then remove from heat. (You're looking to cook off the raw flavor of the garlic without losing the brightness of the lemon.) Transfer za’atar oil to a heatproof measuring cup.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Place 2 cups pita chips in a medium bowl. (Yes, you could make pita chips yourself—but why turn on the oven in July? We're opting to spiff up store-bought chips instead.) Pour 2 Tbsp. za’atar oil over; season with salt. Mix well with a rubber spatula, aiming to coat chips without breaking them into too many pieces.Step 6You should have about ¼ cup za’atar oil remaining. Squeeze 2 Tbsp. plus 1 tsp. lemon juice (from about 1/2 lemon) into a small bowl. Add 1½ tsp. honey and ½ tsp. salt. Add za'atar oil, stirring constantly, until emulsified (meaning that you don’t see any beads of separated oil). Taste dressing and add more lemon, honey, or salt if needed.Step 7Slice 3½ oz. feta into thin planks (we like Greek feta because it's easy to crumble, with a pleasant tang), then add to bowl with reserved tomatoes. Tear any large ½ cup basil leaves and ½ cup mint leaves (if you have shears, you can cut them to avoid bruising and browning!) and add to bowl. Drizzle about 3 Tbsp. dressing over and toss to gently combine (your tomatoes are precious, delicate gems).Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 8Add pita chips to bowl (don’t leave leftover oil behind—scrape that in too) and fold gently to combine. Spoon salad onto platter, making sure to leave no juices behind. Drizzle with remaining za’atar oil.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 9Eat fast for crunchy chips or let sit for a crispy-gone-soggy experience.How would you rate Fancy and Beautiful Tomato Salad ?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleLoved it!  Brought it to a neighborhood potluck and it was a bit.AnonymousMinneapolis, MN9/2/2021My household of finicky eaters approves this salad.  AnonymousLouisville, KY8/4/2020I made a large quantity of this salad for a crowd, and it was a hit! For fellow non-Americans who don't have access to Stacy's pita chips, I just cut some pita bread into squares, tossed through some olive oil, and put them in the oven for about 10 minutes at 200C (stirring halfway so the edges didn't burn). No need to season at this stage, as the za'atar dressing and salt added later do the trick. \nI prepared the salad ahead of time, but cut the tomatoes on the day and stirred the ingredients together just before serving. The dressing stored well in a jar and tasted perfect the following day. hannah_nMelbourne Australia2/27/2020so so good! i snuck in a few castleveltrano olives and a kirby. will definitely make this again as long as peak tomatoes last. YUM.marcylaneWoodbury, CT9/2/2019I made this twice: once for a friend who is allergic to sesame so I skipped the step of heating the oil with the zaatar and just made a dressing without the zaatar. It was delicious both times but I honestly couldn't find much of a difference, so if you don't want to turn on anything in your kitchen, I would skip that step. bengelsMontreal8/19/2019This was both fancy and beautiful, and the perfect way to use farmers' market tomatoes. I will absolutely make it again!alizaraeNew York 8/5/2019Excellent salad, bursting with beautiful tomato flavor and offset with the warmth of the za'atar and the crunchiness of the pita chips. STRONG RECOMMEND. Sarah ShiNew York7/27/2019This was a really delicious and easy tomato salad. The only change I made was using a whole garlic clove instead of half. I brought this to a dinner party and everyone enjoyed it and asked for the recipe.AnonymousColumbus, Ohio7/27/2019Explore Bon AppétitSaladMediterraneanCherry TomatoTomatoVegetableZa'atarHerbs & SpicesFetaCheeseHeirloom TomatoSummerQuickEasyWeeknight MealsSideVegetarianLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-21", "author": ["Condé Nast", "Sarah Jampel"]}