{"id": "e5e1a6d346f6981dbd5d93c3c3a78407", "url": "https://www.bonappetit.com/story/new-england-road-trip-redirect", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "This New England Road Trip Itinerary Is Just an Excuse to Snack | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eatThis New England Road Trip Itinerary Is Just an Excuse to SnackOur ideal eating, drinking, and ferrying route from New Haven, CT, to Portland, ME.By Amanda ShapiroAugust 14, 2020FacebookTwitterPinterestPhoto by ANGEL TUCKERFacebookTwitterPinterestWhoever said it’s more about the journey than the destination was almost definitely referring to this lobster-and-pizza-and-milkshake-studded odyssey along New England’s picture-perfect coastline. Here are the places we’re hitting up (with COVID-19 safety in mind) along the way.Photo by Allie Ayers1/8Modern Apizza, New Haven, CTAre there more famous coal-fired Neapolitan pizza places? Sure. Can you grab pies to go that are just as chewy and charred at Modern? See answer above, minus the hours-long wait.Illustration by Kyle Platts2/8Mystic Aquarium, Mystic, CTTreat road rage with penguin therapy at this conservation-focused aquarium, which rehabs sick and injured marine animals from all over the region. Amphibians more your speed? Check out the exhibit simply titled Frogs! (Note: You’ll need to purchase tickets online ahead of time, wear face coverings, and take your temperature on entry.)Photo by ANGEL TUCKER3/8Champlin’s Seafood, Galilee, RIDon’t just pass through this tiny village. Call ahead and order a tray piled with lobsters, steamers, and Portuguese sausage. Then take it out to the deck for prime views of the state’s largest fishing fleet hauling in the day’s catch or, you know, eat it in the car.Illustration by Kyle Platts4/8Ferry to Block Island, Point Judith, RIThe scene: You’ve been in traffic for hours and it feels like you’ll never get to Maine. There’s a drive-on ferry about to leave for tiny, lovely Block Island, about an hour from shore. How spontaneous are you feeling? Not all road trips need to stick to the road.Photo by ALLIE AYERS5/8Aleppo Sweets, Providence, RIThe East Coast is full of fudge, but where else will you find eight-plus varieties of baklava (all available for contactless curbside pickup)? Despite this bakery’s name, these Syrian pastries go easy on the sugar, relying on citrus and spices for maximum flavor. Read more about its founder Youssef Akhtarini right here!Illustration by Kyle Platts6/8Crescent Ridge, Sharon, MAIs it weird to eat ice cream in front of the cows who made the milk? To eat dessert 30 minutes after you just ate dessert? No and no, because this is one of the best dairy bars in the Northeast. Order online and drive through to collect your superthick milkshake or peanut butter sundae.Photo by GEORGE DISARIO7/8Clam Box, Ipswich, MAPump your brakes here for fat crispy-fried clams, a.k.a. the Platonic ideal of a beachside snack. Piled unfussily on to-go paper plates, they’re briny, sweet, and crunchy all at the same time.Photo by Allie Ayers8/8The Shop, Portland, MEEnd your journey with a dozen oysters and a glass or three of local beer on the socially-distanced outdoor patio. You, uh, earned it.Explore Bon AppétitRoad TripNew EnglandRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-14", "author": ["Condé Nast", "Amanda Shapiro"]}