{"id": "e5e706f25702128e9bbb65e26d55ffa8", "url": "https://www.bonappetit.com/story/spaces-that-spark-dinner", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Spaces That Spark Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredSpaces That Spark DinnerMelissa Coleman, founder and creator behind The Faux Martha, shares how personalization of your home can be a muse for culinary creativity.By Café AppliancesDecember 6, 2018FacebookTwitterEmailFacebookTwitterEmailYou can see it on the shelves at Target, on your Instagram feed, in the way you spend your expendable income. Spaces matter. And more and more, we want our spaces, the places we spend our downtime in, the dining room we fill our friends with, and the kitchen we make a mess in, to reflect who we are, to spark inspiration. To this end, we hack and we DIY and we mix metals to create a custom, personal look.Melissa ColemanRestaurants and cafés do this, too. Beautifully. They create these spaces that make us pull out our phones in hopes of memorizing the clean lines against the warm woods and the collected vintage fixtures. They create these spaces that draw us back for another meal. And another. Sure, the food is good. But there’s something about the space that matters, too.Melissa ColemanAs you create a kitchen inspired by your favorite café, you’ll soon find you can customize just about everything, down to the toe kick. It’s the best part about kitchen design. It’s also the worst part. Too many options can feel overwhelming. That is until you get to that one spot in the kitchen that you can’t customize, the appliances, and the needle runs off the record. Can you hear it? Well, put the needle back on and press play, because personalized appliances are now available for the home kitchen. The brand: Café. The line: Matte Collection.And the people rejoiced before saying—What took so long? Who cares! They’re here, and they’re beautiful. Now, decisions, decisions. Matte White or Matte Black? I’d pick white. Brushed Copper knobs, Brushed Bronze, Brushed Stainless Steel, or Brushed Black? I’d pick copper. Prefer a different vibe? We can agree to disagree because, honey, you can have your Matte Black and Brushed Bronze range and cook in it too. This high-performance line extends from the fridge to the range to the wall ovens, dishwashers, and even microwaves, with customization available for each.It’s true; there is something special about spaces. They’re like mirrors. They reflect back inspiration. Inspiration to try a new recipe. To invite friends over. To fill the dinner table. To clean the colossal mess. There goes the needle flying off the record player again at the mention of cleaning. Maybe, just maybe, the pull of that copper bar across the dishwasher at the end of a dinner party will spark some sort of excitement to clean. If not, pour an extra glass of wine and turn up the music. Because come morning, a clean kitchen can be known to spark breakfast inspiration. That you can count on. Bon appétit!Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-06", "author": ["Condé Nast", "Café Appliances"]}