{"id": "e6017bf834ce1ef92ef83f1e8d13e3a4", "url": "https://www.bonappetit.com/story/mashed-potatoes-tips", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Follow This Game Plan for Foolproof Mashed Potatoes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFollow This Game Plan for Foolproof Mashed PotatoesEditor in chief Adam Rapoport shares his techniques for the best, never-lumpy, buttery, simple mashed potatoes for Thanksgiving (or anytime).By Adam RapoportNovember 6, 2018FacebookTwitterEmailMichael Graydon + Nikole HerriottFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.It’s time to master mashed potatoesThree more Mondays till Thanksgiving. And I’ve already got mashed potatoes on my mind.We can banter all we want in the coming weeks about the merits of parsnip confit (check out the new recipe) and BA’s famous shaved kale and Brussels salad, but I’ve always believed that the big meal is about nailing the basics. And there is no dish more essential, more satisfying than a large bowl of buttery, creamy mashed potatoes.So let’s get to it.Want this letter before it hits the website? Sign up for our newsletter!Photo by Alex Lau, Styling by Sue LiFirst up, the potatoes. At Bon Appétit, we love Yukon Golds. They not only lend an attractive golden hue to the finished product, but they deliver a richness that russet potatoes simply do not.Salt. When boiling your Yukons, be sure to add a generous amount of salt to the water. This will infuse your potatoes, all the way through, with flavor. If you don’t adequately salt your water, you’ll be futilely reaching for the shaker at the table.Moisture—boo! After you drain your perfectly tender potatoes, return them to the still-hot pot. Shake them around to allow any excess moisture to steam off. You can even turn the stove on low to aid this process. Ultimately, you want creamy mashed potatoes, not watery ones.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFlavorings. Yeah, no. This magazine and others, over the years, has called for everything from roasted garlic to horseradish. We’ve asked you to infuse your milk or cream with fresh herbs. Which is fine, if you really want to. But perfect mashed potatoes don’t need anything more than butter, salt, and cream. (Emphasis on the butter in our extra-buttery mashed potatoes recipe.) There will be so many flavors and competing dishes on the Thanksgiving table, your mashed potatoes should serve as the bedrock for the entire menu. So keep them basic, in the best possible way.Tools. Do you own a ricer or a food mill? You should. Both are old school and both get the job done. The former is like a giant garlic press, the latter like a hand-cranked food processor. (A food mill is pictured below!) Each produces miraculously fluffy and smooth mashed potatoes. Not a lump to be found.Alex LauMoisture—yay! Chances are, if you’re the organized type, you mashed your potatoes ahead of time. Smart move. But when you gently reheat them just before sitting down at the table, you’re going to need to add some liquid to rehydrate them (they will have tightened up as they sat). So, either stir in some warmed milk and cream, or try adding some reserved potato water from the pot, all nice and salty and starchy. It does the trick.Watch how it’s done. If you’re the type who’s a visual thinker, or you’ve just got five minutes to kill, or you just really like mashed potatoes, watch the always-charming Andy Baraghani make flawless, ultra-creamy mashed potatoes in the BA Test Kitchen. Then get in yours and do it yourself.Now choose a mashed potato recipe:Extra-Buttery Mashed PotatoesMake-Ahead Mashed PotatoesUltra-Creamy Mashed PotatoesMashed Baked Potatoes with ChivesExplore Bon AppétitAdam NewsletterMashed PotatoesThanksgivingPotatoRead MorerecipesOur 73 Best Potato Recipes, Just in Time for Carb SeasonGallery73 SlidesBy Mehreen Karimcooking7 Tips for the Best Mashed Potatoes of Your LifeBy Alex DelanycookingWhat’s the Best Potato For Mashing? Well, That DependsBy Nico AvalleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-06", "author": ["Condé Nast", "Adam Rapoport"]}