{"id": "e60e224eac087da53179ce2a90b90fbb", "url": "https://www.bonappetit.com/story/cant-stop-eating-pesto", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "Pesto So Good, I Can't Stop Eating After Dinner Is Over | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPesto So Good, I Can’t Stop Eating After Dinner Is OverSorry, no leftovers here.By Adam RapoportAugust 6, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Whenever I make pesto for dinner, I end up at the kitchen sink afterwards. In theory, I’m doing the dishes, but inevitably, I nab a green-slicked noodle or two from the serving bowl. And pretty soon, what was supposed to get packed up for leftovers has disappeared.I can’t stop eating the stuff. At least during the month of August, when farmstand basil is abundant and affordable.Pesto genovese is only a handful of ingredients—basil, parm, garlic, pine nuts, and olive oil. But how you combine them (processor, blender, or mortar and pestle), what the proportions are (kinda garlicky or really garlicky), and what the consistency is (flecks of basil or a silky purée) make all the difference.Want this letter before it hits the website? Sign up for our newsletter!As a home cook who isn’t big on formal recipes—shhh...don’t tell the Test Kitchen!—I used to think that I could eyeball my way through the pesto process. But too often I would end up hitting it out of the park one day and scratching my head the next.So Friday night I decided to call up BA’s Best Pesto recipe on my phone. I pulled the required amount of basil from our backyard garden, toasted the pine nuts just enough to release their nutty aroma, and microplaned the garlic, per Andy Baraghani’s instructions.Photo by Adam RapoportI like my pesto to be more of an emulsified sauce than an herby, oily concoction, in the vein of salsa verde or chimichurri. So I plugged in my Vitamix and added the ingredients in the proper order (you can’t just throw them all in there at once, apparently). Then, with the motor running, I drizzled in a steady stream of extra-virgin olive oil. Within a minute I had achieved fragrant, glossy perfection.Honestly, I can’t recall making a better, more balanced, satisfying pesto. And when I mixed a big dollop of it with a splash of pasta water and then tossed in 16 ounces of al dente strozzapreti, well, I was in heaven. And to top it off, I served it with a tomato-watermelon salad, which proved the ideal on-plate complement.And when it finally came time to do the dishes, I just sat there. Why bother to get up when there’s no pesto pasta left in the bowl?Get the recipe:BA’s Best PestoThe key is to add the basil at the very end instead of blending everything all at once.View RecipeExplore Bon AppétitAdam NewsletterPestoRead MorecookingThese Cold, Pesto-y Rice Noodles Are Incredibly ChillBy Alex DelanycookingWhite Pesto Is The Easiest Dinner You Will Make This WeekBy Emma WartzmancookingRed Pesto Pasta Is Here, and It’s Full of Bright, Spicy, Umami FlavorBy Emma WartzmancookingThis Pesto Potato Salad Doesn't Know It's BeautifulBy Carey PolisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-06", "author": ["Condé Nast", "Adam Rapoport"]}