{"id": "e613303c27bb51fe5e964722faa7c5ce", "url": "https://www.bonappetit.com/story/porotos-con-riendas", "year": 2021.0, "month": 1.0, "day": 3.0, "content": "Porotos Con Riendas - Chilean Bean, Squash, and Noodle Stew | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPorotos Con Riendas Is the Stew to End All StewsThis beloved Chilean dish has squash, spaghetti, and beans—what more do you want?By Miska LewisJanuary 21, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Growing up in Chile but not having Chilean parents meant a few things. For starters, I didn’t know a thing about slang when I started school, there were no extended family get-togethers, there wasn’t enough Chilean music and, perhaps most significantly for someone who loves food, there was no typical Chilean food in my house. Now, in my opinion, Chilean food isn’t exactly bold and bright. And, as a vegetarian in a country with abundant meat, I can’t eat many of the most beloved dishes. But the older I get, the more I appreciate the beauty in this cuisine, which is made up almost exclusively of comfort food: big bowls of stew, over 300 varieties of potatoes cooked simply in one of three ways (fried, boiled, or mashed), gooey, cheese-filled empanadas, dulce de leche and crumbled cookies made into balls.Perhaps my favorite of all comfort foods is porotos con riendas, the stew to top all stews. Made with beans, squash, chorizo, and spaghetti, this dish’s name comes from an old campesino (farmer) metaphor. Originally, this meal was made with strips of pig skin (referred to as riendas or reins) rather than spaghetti. Some of my friends’ mothers still make it in this way, but as the dish became a staple of Chilean households outside of the countryside, noodles often replaced this traditional ingredient.It can be hard to find a straight-up recipe for porotos con riendas, as it’s passed around verbally by the people who make it. When written versions exist, they usually call only for generic “beans” and “pumpkin,” with little specificity to be had. I typically use cannellini or butter beans, though pinto or even navy beans are good, too. As far as pumpkin goes, any winter squash, such as acorn or butternut work perfectly.You might be tempted to use canned beans, but you need dried ones for this. Making the beans from scratch ensures that you have the best liquid for the soup. Soak about 2 cups of them overnight, and then bring them to a boil in abundant water with a couple bay leaves and a crushed garlic clove. Cook them on a low, gentle simmer until totally cooked through, which can take anywhere from 45 minutes to several hours, depending on the type of bean and their freshness. In the meantime, chop 1 white or yellow onion, 1 red bell pepper, a couple ribs of celery, and 2–3 carrots into small cubes. Also finely chop 2 cloves of garlic. Peel and chop your squash—aim for 2 cups of large cubes. Heat a good glug of olive oil in a deep pot, add onion and garlic and sauté for 5 minutes at medium heat, until translucent, before adding the rest of the vegetables and, if you’re not a vegetarian like I am, 2–3 chorizo, sliced. Continue cooking, stirring to prevent sticking until vegetables begin to soften, around 7 minutes.A word on spices: While green and hot red chile peppers are used in pebre (a tomato and onion sauce) or to make merken (smoked chile powder), you won’t find too many spices in Chilean cuisine. Though most people who make this dish don’t include anything except salt, pepper, and cumin, I find that adding a tablespoon of fresh thyme and some smoked paprika is perfect. A teaspoon of ground cumin and dried oregano can also be a nice addition. To your pot, add the cooked beans along with any extra cooking water, squash or pumpkin, and enough vegetable stock to finish covering the mix (around 1–2 cups). Cover and cook until the squash or pumpkin is nearly soft, around 10 minutes. Bring to a boil, add a handful of spaghetti, broken in half, and cook until noodles are cooked through, another 10 minutes. Season with salt and pepper to taste and serve in big bowls with slices of crusty bread.Miska Lewis is a Chilean coffee-shop owner turned New York City college student getting a lot of use from her dorm kitchen.Explore Bon AppétitStewSoupWinter SquashComfort FoodIt's That SimpleSouth AmericanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-21", "author": ["Condé Nast", "Miska Lewis"]}