{"id": "e63fd43a8f874241a5a4a113c2f72567", "url": "https://www.bonappetit.com/recipe/blackberry-icebox-cake", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Blackberry Icebox Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueBlackberry Icebox CakeBy Claire SaffitzJune 12, 20184.7(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintThis creamy, dreamy icebox cake—built in a bowl for maximum ease—is the no-bake dessert you'll be making all summer.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEASmall Bowl$13 At AmazonCitrus Juicer$13 At AmazonElectric Mixer$40 At AmazonLarge Bowl$18 At AmazonMedium Bowl$17 At AmazonPlastic Wrap$9.84 At AmazonSpoon$24.69 At AmazonPlatter$29 At AmazonWhisk$10 At AmazonIngredients8 servings2pints blackberries, divided½cup blackberry jam1lemon2cups chilled heavy cream¼cup powdered sugarPinch of kosher salt8oz. vanilla wafers, dividedPreparationStep 1Measure out 2 cups blackberries from 2 pints. Slice berries in half lengthwise and transfer to a medium bowl. (Save remaining berries for decorating later.)Step 2Add ½ cup blackberry jam to bowl with berries. Using a citrus juicer, juice 1 lemon over berry mixture. Let sit 10 minutes.Step 3Using an electric mixer, beat 2 cups heavy cream in a large bowl, starting on low speed and increasing to high, until soft peaks form.→ Everything you ever wanted to know about whipped cream.Step 4Beat in ¼ cup powdered sugar and a pinch of salt just to combine.Step 5Line a medium bowl (6-cup capacity) with plastic wrap, pressing into bottom and up sides and leaving plenty of overhang. Line the bottom of bowl with a layer of vanilla wafers.Step 6Spoon about ¼ cup berry mixture over wafers. Scoop 1½ cups whipped cream into a small bowl; cover and save in fridge for later. Spread ½ cup of the remaining whipped cream evenly over wafer and berry layers. Repeat layers with wafers (breaking to fit as needed—no one will know), blackberry mixture, and whipped cream, using more for each layer as the bowl gets wider, until you run out of all the components.Step 7Bring up plastic overhang to cover and chill at least 24 hours.Step 8Unwrap plastic from top of cake and place a large cake stand or platter firmly over it. Flip over and lift bowl away; peel away plastic wrap. (Ta-da!)Step 9Using a whisk, beat reserved whipped cream back to soft peaks, then use a spoon to dollop cream all over cake and spread around evenly.Step 10Cut reserved berries in half lengthwise and arrange them on top.Step 11Slice cake into 8 pieces to serve.Step 12Do Ahead: Cake can be assembled 2 days ahead and can also be unmolded and covered in cream 1 hour ahead; either way, keep in the fridge until the last minute.How would you rate Blackberry Icebox Cake?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleSo delicious and so easy! It was an absolute hit at a dinner party, everyone was impressed and thought I worked hard to make it. The only thing I changed with the recipe was I made it with both blackberries and blueberries. This will be added to my summer dessert rotation with various seasonal fruit. AnonymousVisalia, CA5/30/2021Good icebox cake! Two thumbs up from my husband, and one-and-a-half thumbs up from me; we both found it refreshing and light, but I thought it a little heavy on the whipped cream. I made the recipe as stated, except I added about half the lemon's worth of zest to the blackberry mixture. \n\nI found the unmolded \"heap\" cake charming, but honestly, if I make this again just for the hubs and I, I'll just use a trifle dish. It'll be easier, less messy, and still attractively layered.AnonymousSeattle, WA5/27/2021Do cookery writers ever get anybody to proof-read their recipes before they publish?  Ambiguous and chaotic from first to last.  Why not separate the ingredients into Day 1 and Day 2 requirements, rather than a single list of ingredients which you then separate and store in the least convenient way i.e. already handled and in a less-than secure way?  Which set of blackberries do I store for decoration and which do I use in the cake on Day 1 (1)?  How big is a medium-sized bowl and why tell me if it doesn't matter how big it needs to be (1)?   Separate the volume of cream needed for decoration on Day 2 before whipping it (6), it will only collapse anyway in the refrigerator (9).\nI hope it tastes nice after all this.AnonymousUK7/10/2020I made this on a hot summer night for my family and it was eaten up in seconds! Super easy to make and so good for such simple ingredients. Probably going to make again and experiment with other fruit! AnonymousLos Angeles4/25/2020This is a 10/10 for me! No one was hungry for dessert after dinner, but after my guests tasted this, they were asking for seconds! This is going to become a staple for me from now on. Easy, inexpensive, delicious!pleombrone2459Boston, MA9/23/2019I haven't eaten the final cake yet, so possibly it will work better all combined, but I found the lemon juice a little overpowering with the blackberries and jam. The lemon flavor is just a bit stronger than I think you want -- maybe half a lemon or a smaller lemon would have worked better, or maybe too much of the lemon oil from the skin got in as I squeezed the lemon by hand? I dunno. It's a neat idea though, and hoping that when I unveil it for dinner the lemon flavor will have mellowed a bit!AnonymousBrooklyn, NY6/4/2019I’m making this for the second time it’s so good. Last year I followed the recipe exactly and it was perfect. I enjoyed the salt and creaminess from the whipped cream, and the contrast with fresh crunchy fruit and sweet jam. This time I’m using a homemade blueberry lavender jam for blackberry + lemon layers , and alternating with a mix of chopped fresh mango + mango citrus jam + lime. My 72 year old father loves this icebox cake so it will be his birthday cake tomorrow!jnjn06161502Orlando1/5/2019By happy accident I substituted Pepperidge Farm Bordeaux cookies for Nilla Wafers, since my grocery store had none of the later. I'm sure the cake was way better than  it would have been with Nilla Wafers. Super yummy.AnonymousSan Francisco9/17/2018Absolutely wonderful!!  Perfect for hot days when you don't want to use the oven.  Loved the shape, the look and the old fashioned name.  It needs the full 24 hour chilling and probably longer is better.  Not usually a whip cream fan but this was great.  Guests raved about it.  True confessions:  I used 'old fashioned whip cream' vs regular tho' I don't know the difference.  Could not find blackberry jam so made 'jam-like' mixture of blackberries and blueberries with a cinnamon stick while cooking - it added a nice hint to the flavour.  It was so pretty without the whip cream icing - that next time, I'd be tempted to serve the extra cream on the side depending on how moist the top of the cake is (first layer of wafers).  Definitely will make again!AnonymousCalgary7/22/2018In response to the question, ice box cakes are chilled in the refrigerator.Anonymous7/6/2018Question from a subscriber in Canada, where there isn't a tradition of this dessert. The name Icebox Cake suggests freezer, yet the instructions are not specific and only say 'chill' - do we chill this in the refrigerator? In the freezer? Please advise.AnonymousToronto7/2/2018Explore Bon AppétitCakeDessertFrozen DessertAmericanBlackberryBerryFruitSummerEasyNut-FreeFourth Of JulyBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-12", "author": ["Condé Nast", "Claire Saffitz"]}