{"id": "e64f7c5482587b6da5fe2c874e02a157", "url": "https://www.bonappetit.com/recipe/mujadara", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "Mujadara Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesLemony Lentils and Rice With Caramelized OnionsBy Sarah JampelDecember 1, 20194.7(87)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis recipe is inspired by mujadara, a simple combination of lentils, rice, and onions that exists in various forms across the Middle East. It's comforting but not too rich, and it's fresh and vegetarian without relying on many perishable ingredients. In other words, it's the perfect meal for winter nights. The lemon-soaked raisins bring pops of brightness but are optional—use sour cherries in their place, or finish the dish with a drizzle of pomegranate molasses. And while green or brown lentils are the traditional choice in mujadara, we like French lentils (a.k.a. Le Puy) because they hold their shape. Lastly, we endorse store-bought fried shallots as a weeknight shortcut, but if you want to fry your own, be our guest. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketLarge Pot$55 At AmazonSmall Bowl$13 At AmazonSpoon$24.69 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Skillet$84 At AmazonTongs$13 At AmazonSpatula$12.99 At AmazonSieve$18 At AmazonMedium Bowl$17 At AmazonForkWooden Spoon$6 At AmazonPlatter$29 At AmazonIngredients4 servings (with leftovers)Kosher salt½cup raisins1lemon4medium onions¼cup plus 3 Tbsp. extra-virgin olive oil, divided½tsp. sugar1cup French green lentils1cup basmati rice¼tsp. ground cinnamon2¼tsp. ground coriander, divided2¼tsp. ground cumin, divided½cup fried shallots, divided½cup parsley leaves with tender stems½cup plain Greek yogurtFreshly ground black pepperPreparationStep 1Bring a large pot of generously salted water to a boil. Meanwhile, place ½ cup raisins in a small bowl. Squeeze in juice from one half of lemon and pour 1 Tbsp. very hot water over. This will plump them up. Stir to combine; set aside until ready to use.Step 2Halve and peel 4 medium onions. Go ahead and suit up with some protective eyewear, if that’s necessary for you. Thinly slice onions into half-moons (you should have about 7 cups). This is a fair amount of slicing, but it’s almost the only knifework.Step 3Caramelize the onions: Heat ¼ cup extra-virgin olive oil in a large skillet over medium. Add onions and stir to coat in oil. Season with salt, then reduce heat to low and cover skillet (use a baking sheet if you don’t have a lid). Cook, stirring occasionally, until onions are softened and translucent, about 15 minutes. In this step, the onions steam in the liquid they release, which ensures that they'll caramelize more evenly, with less chance of burning.Step 4Uncover skillet and sprinkle onions with ½ tsp. sugar, which increases caramelization. Increase heat to medium-high and continue to cook onions, stirring frequently and reducing heat as needed, and adding 1 Tbsp. water to deglaze pan (that is, scrape up all those brown bits) if it’s getting too dry, until chocolatey-brown and reduced in size by about two-thirds, 35–40 minutes.Step 5Meanwhile, add 1 cup French green lentils to boiling salted water. Stir so there are no sinkers or stickers, then cook, stirring occasionally, until cooked through but still al dente, 20–25 minutes. Drain and set aside. Wipe pot dry.Step 6As lentils cook, rinse the rice. The easiest way to do this is to place 1 cup basmati rice in a medium bowl, cover with cold water, swish rice with your hand, then dump out the water in a swift, fluid motion (the rice will stay at the bottom of the bowl!). Repeat twice. Set rice aside to drain in a fine-mesh sieve.Step 7Heat 2 Tbsp. extra-virgin olive oil in same pot over medium-high until hot. Add ¼ tsp. ground cinnamon, 2 tsp. ground coriander, and 2 tsp. ground cumin and cook, stirring, until fragrant and a shade darker, about 30 seconds.Step 8Add rice and 2 tsp. Diamond Crystal or 1¼ tsp. Morton salt and stir to coat the rice in the spices, about 30 seconds. Pour in 1½ cups water and bring to a boil (it might happen almost immediately!). Reduce heat to lowest setting, cover with lentils in an even layer, and cover pot. Cook, undisturbed, until water is absorbed, about 15 minutes. Fluff with a fork and cover pot again.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 9Your onions should be caramelized by now! Add raisins (and any liquid in bowl) and stir to combine. Transfer onion mixture to pot with rice. Add half of fried shallots and juice from remaining lemon half. Stir to combine, season with salt, and keep covered until ready to use.Step 10Now the finishing touches. Coarsely chop ½ cup parsley leaves with tender stems. Mix ½ cup plain Greek yogurt and remaining 1 Tbsp. extra-virgin olive oil, ¼ tsp. coriander, and ¼ tsp. cumin in a small bowl. Season with salt and pepper.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 11Transfer mujadara to a platter. Top with parsley and remaining fried shallots. Serve with yogurt sauce alongside.How would you rate Lemony Lentils and Rice With Caramelized Onions?Leave a ReviewTell us what you thinkReviews (41)Back to TopTriangleIt really is so, so good. Time consuming but easy and well worth it. ELas Vegas2/9/2022This is delicious! I especially love the sweet/sour pop of the lemon soaked raisins. I didn't turn the lentils down enough, so they got a little overdone, but that was my mistake. My gas range is very efficient and when I have made lentils in the past, I tipped the rinsed lentils into boiling salted water for six minutes and I think that may be my sweet spot. Also, I used jasmine rice - coulda sworn I had basmati on hand, but alas, it would be better for this dish. The spices were just right. I added a quarter teaspoon of turmeric, and the coriander seed is some that I harvested from my cilantro that bolts  usually before I can use the fresh herb. I ate the bit that wouldn't fit into my peppers for today's lunch.\nI cut the top off of six peppers, removing the seeds and pith, then rubbed the insides with olive oil and roasted them at 400 for 25 minutes. I transferred them to a deep casserole and filled them. That's lunch for next week!Betty QSun Prairie, WI12/12/2021I loved the inclusion of cooking techniques - this, to me, is what makes a \"real\" recipe, not so much (the typically unnecessary) detailed instructions for simple, recycled dishes that you find on most blogs. I've seen variations of this dish on some of the aforementioned vegan/vegetarian recipe blogs and they don't compare. The time it took to make didn't bother me but I'm used to daily scratch cooking. I followed the recipe for the most part, except I added some roasted ras el hanout seasoned cauliflower, which perfectly complemented the somewhat understated base flavors. I also used toasted cumin seed instead of ground cumin in the rice and I think it was better that way. I plan to make this again in the future since everyone loved it!LavanderPNW12/12/2021I am going to make this tomorrow and use it to make a different version of stuffed bell peppers. I grew up with the hamburger/rice/stewed tomato version of stuffed peppers and have also made a similar version to that using bulger instead of beef, but I wanted something new. I think this will really work nicely. I have orange and green bells - I kind of wanted to do red and green for the season, but the red ones on offer were rather long and this, so they would not stand up neatly, so I went with orange and green. This will be my lunch for the coming week.Betty QSun Prairie, WI12/11/2021This was delicious. I have tried to make this dish before and was disappointed in the result. The detailed instructions were the key for me. \nThank you, Bon Appetit for being so specific about different brands of salt. \nFor the person who got mush- French Lentils maintain their structure much better. mary ann Nashville TN. 6/5/2021My family and I loved this! Agree that it takes some time but I’ve had a request to double it so we can freeze some. Added extra onion but otherwise stuck to the recipe. Served with halloumi and roasted cauliflower and it was awesome. DeniseToronto 3/12/2021This is much better, though more labor intensive recipe for which a faster but less successful version can also be found on this site. I think this one is worth the effort !Anonymous2/1/2021One of my favorite Vegetarian recipes from any publication or book. Love the spices and love the use of french lentils which I feel never get enough play in the vegan world.  And the pièce de résistance is ofcourse the carmelized onions. Thanks to this recipe I am now a daily bonapetit.com visitor for exemplary vegetarian recipes. Our family thanks you.🌿RadiantAlchemyWellnessMontclair, NJ1/13/2021just have to add to the person who said the lentils became \"mush\"....what were you using?  Red lentils?  And the onions, by the way, caramelized beautifully.  Sandy LevyCary, NC10/26/2020Just fantastic!  I grind my own spices .  That always help.  So fragrant while cooking .  A meditation in and of itself.Sandy LevyCary, NC10/26/2020LOVED this. Definitely a new vegetarian favorite. I think I'll make it in the future for meat-eating friends because it's such a hearty dish you'd think there's meat in it, but there isn't!AnonymousNashville, TN8/29/2020This recipe was so good! I definitely would recommend trying it if Middle Eastern cuisine appeals to you. It’s time consuming to make because caramelizing onions takes a while, but is so worth it! The raisins add a nice juicy sweetness to the dish, and the lemon juice totally rounds it out. I tasted it without the lemon juice added and it definitely tasted better at the end when it all came together.AnonymousBoston, MA7/6/2020I want to make this but I have pre-cooked leftover basmati rice.  I'm thinking in steps 7 and 8 I could heat the oil and spices, add cooked rice and lentils and just let the hot lentils and hot oil warm up the rice?  Any thoughts?  AnonymousNJ7/1/2020We LOVE this dish. I'm normally not a lentils or beans person, but this was delicious. I didn't have coriander so I used some turmeric. Only had brown basmati rice, so I soaked that for an hour before cooking, I will use brown basmati again. The lemon juice brightened the dished without sourness. It took 2 of us about 90 minutes to make this dish but it was worth it. I microwave fried the shallots, which was the perfect flavorful topping. The yogurt, parsley and friend shallots are critical and elevate the dish. Thank you for a repeat recipe.Anonymouscoronado, ca6/18/2020Didn't have raisins...or yogurt...or lemons...or parsley...or shallots...or cumin...or enough onions...and it was still AWESOME! Definitely a new go-to recipe, especially when I make too much lentils. I promise if you don't have everything it will still be great. I can't wait to try it when I DO have all of the ingredients! California6/15/2020Explore Bon AppétitMiddle EasternOnionVegetableRaisinDried FruitFruitFrench LentilLentilRiceRice & GrainsMainSideGluten-FreeNut-FreeVegetarianDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-01", "author": ["Condé Nast", "Sarah Jampel"]}