{"id": "e6529910bbb4f623fd0a74df58924ba8", "url": "https://www.bonappetit.com/recipe/spinach-and-feta-tarte-soleil", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Spinach and Feta Tarte Soleil Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpinach and Feta Tarte SoleilBy Sarah JampelNovember 3, 20194.7(54)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintWhen you need an impressive appetizer that you can “casually whip up\" for friends (or bring to your friend's cousin's parents' house on Thanksgiving), buy a box of frozen puff pastry. Roll the sheets into rounds, create a pocket of spanakopita-inspired filling, then put your arts and crafts skillz to work. Don't worry if your tarte looks a little wonky going into the oven: Once it emerges, we guarantee that everyone will want to take a picture, even if it means waiting a few more minutes to start tearing off those cheesy, buttery twists. And that mini circle that's leftover in the middle? Consider that a chef's treat.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketParchment Paper$3 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketChef's Knife$34.53 At AmazonPlate$55 At Bon Appétit MarketSieve$18 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonMicroplane$16 At AmazonDish Towel$6.15 At AmazonSpatula$12.99 At AmazonRolling Pin$13 At AmazonSmall Bowl$13 At AmazonPastry Brush$9 At AmazonBasically Shot Glass$7.34 At AmazonIngredients6–8 servings117.3-oz. package frozen puff pastry (2 sheets)210-oz. packages frozen spinach2scallions2Tbsp. dill2½oz. Greek feta in brine (about ⅔ cup crumbled)2garlic cloves1lemon1tsp. kosher salt, plus more¼tsp. freshly ground black pepper, plus moreAll-purpose flour (for rolling)1large eggPreparationStep 1Ideally, you’ve defrosted your 1 17.3-oz. package frozen puff pastry for at least 8 hours in the fridge. But if you haven’t, take the 2 rolled-up sheets out of the box and place on a parchment-lined baking sheet. Don’t unfold yet or they’ll crack. Set a timer for 10 minutes, flipping rolled-up sheets halfway through. If, after 10 minutes, they’re pliable enough, unfold, separate with a sheet of parchment, and chill. If not, wait another 5 minutes. Puff pastry goes from stiff to flabby and sticky in a matter of minutes, so you want to be careful.Step 2Cut one slit in 2 10-oz. packages frozen spinach. Place both packages on a large, microwave-safe plate, then microwave until thawed, 8–10 minutes. (If you remembered to thaw your spinach in the fridge, you can skip the microwaving step.) Open packages carefully and drain in a fine-mesh sieve. Set aside until cool enough to handle.Step 3While spinach cools, finely chop 2 scallions and transfer to a medium bowl. Finely chop 2 Tbsp. dill and add to bowl. Crumble 2½ oz. Greek feta in brine into small pieces (no bigger than dried chickpeas) and add to bowl. Grate in 2 garlic cloves and zest of 1 lemon. Season with 1 tsp. kosher salt and ¼ tsp. black pepper.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Transfer spinach to a dish towel and squeeze over the sink—you want to get rid of excess moisture that'll make your pastry soggy. You’ll be surprised by how little spinach is left, but that’s okay. Chop and add to bowl with scallion mixture.Step 5Stir to combine, making sure to break up any spinach clumps. (You should have 2½ cups spinach mixture, in case you’re measuring.)Step 6Time to assemble! Find a round object that’s 10–12\" in diameter (the larger, the better). We used the lid of a large Dutch oven, which is 11\". Place one of the pastry sheets, still on parchment, on a work surface or large cutting board. Dust lightly with flour, both over and under. Roll it out, rotating parchment 90° (so you’re rolling in all directions) and dusting with flour if pastry sticks, until it’s at least 1–2\" larger than your round object.Step 7Place round object over pastry, press to indent, then use a sharp knife to trace the circle. Set aside the excess pastry (save it for now; if your pastry tears, you can use a scrap to patch it up!). Transfer pastry round, still on parchment, to a baking sheet. Chill while you repeat with the second sheet of pastry.Step 8Crack 1 large egg into a small bowl and beat to combine with a fork. Brush egg wash all along circumference of one pastry round (this will seal the two pieces of pastry together); reserve remaining egg wash for later. Spread spinach mixture over, leaving a ½\" border. Place second round of pastry on top (if you’re having trouble moving it, fold it into quarters, then unfold on top of the spinach) and press gently to seal. Using a small cup or shot glass (2\" in diameter), make an indent in the very center. Your pastry might be slightly warm by now. If so, chill 10–20 minutes.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 9Once pastry is cool, transfer the whole set-up, parchment and all, to a work surface. With a chef’s knife, cut pastry into 4 quadrants, stopping when you reach the center circle. Cut each quadrant in half, then in half again, so that you have 16 spokes. Transfer tarte with parchment back to sheet tray. (We’re doing this so that you can make sharp cuts and avoid transferring a delicate item.)Step 10Working with one spoke at a time, pull gently away from the center (to extend the length of each piece), then twist to expose the spinach insides. Aim for three or four twists. Nudge them around to distribute evenly. Freeze until cold, 10–15 minutes.Step 11Meanwhile, place a rack in middle of oven; preheat to 400°. Brush tarte all over with reserved egg wash; season with salt and pepper. Bake tarte until risen and well browned all over, 30–35 minutes.How would you rate Spinach and Feta Tarte Soleil?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleWould you freeze it baked or unbaked? AnonymousBaltimore MD12/18/2021This is a wonderful recipe - easy to do, tasty, and looks awesome.  I read the reviews before making and hence only used half the lemon zest.  It all turned out wonderfully and my guests loved it.Nellottawa, Canada9/12/2021Can this recipe be fully baked and frozen for a few days to serve at a later date?SueRKelowna BC9/4/2021Can I prep a day ahead?? Keep in freezer or fridge/ then cook next day???? Thought??? Kayla BelangerCanada4/5/2021Yes, can definitely be frozen - Picard frozen food (in France and other Eu countries) does a version with sun dried tomato pesto and poppy seeds which is lovely.LisaCambridge UK3/28/2021Beautiful and delicious!! I chopped some bacon strips and cooked them a little ,then added to the spinach filling so my kids would not complain about “the green stuff” and it was a hit! Would definitely do it again!SilviaMadrid, Spain3/28/2021I was raised on spinach and feta 'pies' with puff pastry, Phylo, and regular pie crust. It depended on what Mom had available. \nI'm doing a lot of puff pastry appetizers as my contribution to the family meal this year. I think I'm going to spread ganache and chopped raspberries in the middle of this design, or possibly goat cheese and raspberries. I think it will look beautifu with red color of the fruit. \nPuff pastry is very forgiving and a real crowd pleaser! \nThank you for the great ideas!MarySunshine State12/24/2020I would definitely make this again but I would use less lemon next time. I used a small one but the lemon zest was still over-powering to the dish. It turned out to be pretty simple overall. I was afraid that despite my familiarity with puff-pastry, it would still come off as a PinterestFail but it did not. I also should note I used about a bag and a half of fresh baby spinach instead of the frozen kind, doing a quick saute/steam to cook/wilt the leaves before wringing them out. Also note, the directions seem to call for moving the pastry back and forth more than I thought necessary. I rolled the first disk out on parchment and moved to my sheet pan. The second one I rolled out and placed on top. I made my cuts and twists right in place on the sheet pan and then put it in the freezer. I'm not sure why they complicated things unless you would be fearful of making any cuts on top of the parchment on your sheet pan. kimberlystewardNew Hampshire5/13/2020During these trying times (Covid-19) I wanted to make something fun to have along with a Greek salad and this certainly fit the bill. I was a bit restricted on having all of the ingredients needed, but managed. I had no lemon, so some dried lime peel, rehydrated in a teaspoon of bottled lemon juice had to do. As well there were no scallions in the pantry so some very finely chopped onion would have to do. Lastly i added some toasted pine nuts because it just felt right. Next go around I may incorporate some basil. Kinda Greek meets Italian. Can’t help it I’m Swiss/Italian! The entire thing went better than planned and I want to tell everyone don’t be scared if it looks less than perfect during preparation. Mine actually looks better that the pictures here. It’s a great recipe to add some fun and peace to a trying time. Take care ya’ll ......My mother4/8/2020This was a hit at adult birthday party.  It was a sunny tarte on a winter night..\nIt’s a work of art, so take your time and watch the temperature.  I sprinkled sesame seeds on top.  Used a round pizza pan for ease in transport to party.  Definitely do again.\nAnonymousRockville Maryland1/20/2020Delicious and very nice for a dinner party setting.AnonymousColumbia, SC1/11/2020This was unbelievably delicious and so much easier than I anticipated. Like others, I'm now dreaming about other fillings that would work well with this method...so many possibilities!Philadelphia12/24/2019Thanks for giving me a new go-to to bring to gatherings! Easy AND impressive-looking? THE BEST!\nI will say, though, the first time I made this, with puff pastry by Dufour...the package definitely only had one sheet of puff pastry in it. I made it work, made a smaller round, and used the leftover pastry for a little...side...rectangle. STILL GREAT.\nTrader Joe's has puff pastry right now and it was a full $8 cheaper than the Dufour one I got at my little local grocery. Taste-wise, the exact same, and size-wise...well, there were two sheets. :D\nThis looks great, tastes great, and makes people think you did a whole bunch of work. \nThanks again, Bon Appetit!BeanieMSUDetroit, MI12/10/2019This was fkn awesome. I made the filling a few days prior. Was a bit more lemony than I expected it to be, and quite a rich(?) taste from the spinach. I'm curious about other greens/fillings for this twist method. It's so beautiful.\nI think this would be best eaten straight out of the oven, but it was still good at room temp and even straight from the fridge. Also reheated on hot baking sheet for a few min and in the microwave successfully.\nSheet pastry truly is a gamechanger! seymourkittyPortland12/4/2019awesome crowd-pleaser! also really simple, saved the center circle for the chef :)AnonymousBoston12/4/2019Explore Bon AppétitPastriesFetaCheesePuff PastryOther IngredientsSpinachLeafy GreensVegetableStarterNut-FreeVegetarianThanksgivingSuper BowlDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-03", "author": ["Condé Nast", "Sarah Jampel"]}