{"id": "e66394358137b671726a8977b88ba202", "url": "https://www.bonappetit.com/recipe/roasted-beets-with-dukkah-and-sage", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Roasted Beets With Dukkah and Sage Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueRoasted Beets With Dukkah and SageBy Marcus SamuelssonDecember 1, 20204.3(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Joshua Kissi, food styling by Roscoe Betsill, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThere’s no better party side than one that can be made ahead. You can roast the beets and make the dukkah, a coarse Egyptian and Middle Eastern nut and spice blend, for this dish days in advance, then you’ll just need a few minutes to assemble before dinner. The dukkah holds well up to a week; make extra and use to brighten other roasted veg or meat.This recipe was adapted from ‘The Rise: Black Cooks and the Soul of American Food,’ by Marcus Samuelsson with Yewande Komolafe and Tamie Cook.Ingredients8 ServingsRoasted Beets2lb. small or medium red beets (about 12 small or 8 medium)2Tbsp. extra-virgin olive oil2Tbsp. sherry vinegar or red wine vinegarKosher saltDukkah and Assembly1Tbsp. coriander seeds1Tbsp. fennel seeds2tsp. cumin seeds¼cup raw cashews¼cup raw pistachios1Tbsp. benne seeds or sesame seeds½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more½small red onion, thinly sliced¼cup extra-virgin olive oil¼cup fresh lime juice¼cup thinly sliced sage or mix of basil and mint, dividedPreparationRoasted BeetsStep 1Preheat oven to 425°. Combine beets, oil, vinegar, several pinches of salt, and ¼ cup water in a baking dish. Cover tightly with foil and bake until beets are tender, 50–60 minutes. Uncover and let sit until cool enough to handle. Peel and cut each beet into 4 wedges, or 6 wedges if they are larger.Do ahead: Beets can be roasted 2 days ahead. Let cool; cover and chill.Dukkah and AssemblyStep 2Toast coriander seeds, fennel seeds, and cumin seeds in a dry small skillet over medium heat, tossing occasionally, until slightly darkened and fragrant, about 3 minutes. Transfer to a spice mill, mortar and pestle, or small food processor; let cool. Pulse until coarsely chopped. Add cashews, pistachios, benne seeds, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt; pulse again until coarsely chopped.Step 3Toss roasted beets, red onion, oil, lime juice, half of sage, and ¼ cup dukkah in a medium bowl to combine; taste and season with salt. Arrange on a platter and top with more dukkah and remaining sage.Do Ahead: Dukkah can be made 1 week ahead. Store airtight at room temperature.How would you rate Roasted Beets With Dukkah and Sage?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladBeetVegetableSideDairy-FreeGluten-FreeVeganVegetarianHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson"]}