{"id": "e666fe13ccc892de7bfb03e3e6c467cc", "url": "https://www.bonappetit.com/story/never-fail-tinned-fish-avocado-dip", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Tinned Fish + Avocado = A Creamy, Dreamy Dip That Has Never Let Me Down | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTinned Fish + Avocado = A Creamy, Dreamy Dip That Has Never Let Me DownMovie night. The Super Bowl. The end of days. This creamy trout-avocado dip is an all-occasion stunner.By Hilary CadiganJanuary 25, 2019FacebookTwitterEmailFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Not to brag, I was into tinned fish long before it was cool. In fact, for an entire year in 1993, I ate tuna sandwiches exclusively. And not just any tuna fish sandwich: two slices of squishy brown bread, a generous slathering of mayo, and tuna fish straight from the can. No “green chunks” allowed. I was six. I was a purist.These days, I’m way more excited about green chunks, but my passion for fish in a can remains unchanged. Tuna, yes, my once and future king, but also oil-packed mackerel, sardines, smoked trout, anchovies—the full monty. There’s something simultaneously glamorous and utilitarian about iridescent ribbons of salty flesh swimming inside their aluminum bathtub. Like, if Donatella Versace was a Doomsday Prepper, tinned fish is probably what would be stacked on the solid gold shelves of her underground fallout shelter. And that would be smart of her, because as long as you have tinned fish, you are never doomed. Even if the world is ending.Got some bread? Spread some butter on it, throw a coupla’ sardines on it and BOOM, it’s a fancy app. Boring pasta? Spice it up by dissolving a few anchovies into the sauce. Need to use that ripened avocado that’s going to turn brown in eight seconds? This Smoked Trout Avocado Dip can be made in 10 minutes flat with just about any tinned fish you throw at it.This dip has become a personal standby of mine because it taps into one of nature’s greatest texture/flavor combos: the muted earthy creaminess of avocado and the salty, oily meatiness of preserved fish (smoked trout is particularly great here because it brings an added hit of campfire-y flavor). Plus, it impresses party guests (even if the only guest at the party is me), packs a hearty nutritional punch (all the omega-3s!), and is supremely easy to make.Ain't no party like a tinned fish party.\nPhoto by Alex LauI like to serve it with crackers on movie nights, where it pairs just as well with shitty light beer as it does with a crisp white wine (keep that in mind for your upcoming Super Bowl spread). Or I’ll slather it onto toast. Or plop it atop a salad with some croutons for crunch. Or eat it straight from the bowl, like that time I went keto for 45 minutes. There are no rules. In fact, the fish doesn’t even need to be tinned—you can also use those fancy fillets that come shrink-wrapped in plastic in the refrigerated section of Whole Foods and all will be well.Making this dip is so easy it feels silly to even rehash here. You put the fish in a bowl, breaking up bigger chunks with a fork. You add sliced scallions, half a lemon’s worth of zest and juice, mayo, salt, and diced avocado. That’s literally it.So the next time you find yourself passing by the tinned fish aisle of your local grocery store or gearing up for another boring, old, unadorned avocado toast, think of Donatella and me in our golden doom basement, getting our full daily serving of fatty acids and licking our sparkly manicured fingers. Join us.Get the recipe:Smoked Trout-Avocado DipIf you're not the kind of person who keeps canned fish in your pantry at all times, this is the recipe that will convert you.View RecipeExplore Bon AppétitNever FailSmoked TroutappetizerBasicallyAvocadoDipRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-25", "author": ["Condé Nast", "Hilary Cadigan"]}