{"id": "e66c94d1c245756799ae426b392ae82c", "url": "https://www.bonappetit.com/recipe/mandarin-gandt", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Mandarin G&T Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredMandarin G&TSondre Kasin shows us a seasonal twist on a classic G&T with fresh mandarin juice for acidity, sherry for nutty character, and bay leaves for aroma and flavor.By BOMBAY SAPPHIRE® GINDecember 16, 20205.0(4)Read ReviewsTriangleEmailPinterestPrintTed + Chelsea CavanaughEmailPinterestPrintEmailPinterestPrintIngredients1½oz. Bombay Sapphire4oz. premium tonic water2fresh bay leaves, for garnish1mandarin wedge½oz. fresh mandarin juice½oz. sherryIcePreparationStep 1Pour the mandarin juice, sherry, and Bombay Sapphire into the glass.Step 2Fill the glass with ice. Give it a quick stir, and top off with tonic water.Step 3Garnish with mandarin wedge. Twist the bay leaves to release aromas, then place as a garnish in the drink next to the mandarin.Click to Shop Bombay Sapphire NowBE BRILLIANT AND INSPIRED. DRINK RESPONSIBLY!©2020. BOMBAY SAPPHIRE AND ITS TRADE DRESS ARE TRADEMARKS.IMPORTED BY THE BOMBAY SPIRITS COMPANY U.S.A., CORAL GABLES, FL. GIN - 47% ALC. BY VOL.How would you rate Mandarin G&T?Leave a ReviewTell us what you thinkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-16", "author": ["Condé Nast", "Bombay Sapphire"]}