{"id": "e67a499e36cf72da538348ed4ffc9599", "url": "https://www.bonappetit.com/recipe/cucumbers-with-ajo-blanco-sauce", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Cucumbers with Ajo Blanco Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueCucumbers with Ajo Blanco SauceBy Andy BaraghaniSeptember 18, 20185.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintA punchy raw garlic sauce is the resourceful cook’s secret weapon. When you’re after a low-input, high-impact, wake-up-whatever-leftovers condiment, nothing delivers like a proper fluffy aioli or fiery Lebanese toum. And right now this ajo blanco sauce has our hearts aflutter: rich from almonds, tart with sherry vinegar, and plenty garlic-pungent, it’s what we’re putting on, in, and underneath every simply prepared vegetable and protein we’re making this season.Ingredients4 servings5mini seedless or Persian cucumbers (about 12 oz.)Kosher salt3tsp. sherry vinegar or red wine vinegar, divided¾cup blanched almonds, divided1garlic clove, finely grated½cup extra-virgin olive oilFlaky sea saltPreparationStep 1Preheat oven to 350°. Cut cucumbers about 1\" thick on a steep diagonal and place in a medium bowl. Add a large pinch of kosher salt and 2 tsp. vinegar and toss to combine; let marinate 10 minutes. Pour off any liquid that is released.Step 2Toast ¼ cup almonds on a rimmed baking sheet, tossing once, until golden, about 5 minutes. Let cool, then coarsely chop. Set aside.Step 3Blend garlic, oil, remaining 1 tsp. vinegar, remaining ½ cup almonds, and ½ cup ice water in a blender until smooth and creamy, about 2 minutes; season generously with salt.Step 4Divide sauce among plates and top with cucumber salad and chopped almonds. Sprinkle with flaky sea salt.Step 5Do Ahead: Sauce can be made 1 day ahead. Cover and chill.How would you rate Cucumbers with Ajo Blanco Sauce?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI knew I'd like this when I saw it in the mag and I made it yesterday and was not disappointed!   It was easy to make and oh so delish!  Julie in clearwaterClearwater Florida 10/28/2018Explore Bon AppétitSaladSpanishEuropeanAmericanCucumberVegetableAlmondNutGarlicStarterSideDairy-FreeGluten-FreeVeganVegetarianRawDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Andy Baraghani"]}