{"id": "e688ba1b5e5e3b1819292be1ce7812e4", "url": "https://www.bonappetit.com/story/knife-skills-oscar-documentary", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Watch \"Knife Skills,\" the Oscar-Nominated Documentary that Follows Students from Prisons to Fine Dining | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture\"Knife Skills\" Is the Oscar-Nominated Documentary that Follows Students from Prisons to Fine DiningThe inspiring story of a classic French restaurant and the formerly incarcerated people who've made it succeed.By Sarah JampelFebruary 12, 2018FacebookTwitterEmailFacebookTwitterEmailImagine having a few weeks to go from never having cooked professionally—or never having cooked at all—to working as a poissonier at a classic French restaurant. Now imagine having to absorb that onslaught of brand new information (much of which is in another language) and adjust to the notoriously fast pace of a kitchen when you’ve just recently come out of prison.This is the premise of director Thomas Lennon’s Oscar-nominated documentary Knife Skills, which focuses on EDWINS in Cleveland, Ohio. Founded in 2013, EDWINS is a by-the-books French restaurant (think frog legs and foie gras) that gives formerly incarcerated adults a foundation in the restaurant business with the goal of easing their transition home. The film follows the first group of students as they go from learning the fundamentals of the cuisine to opening a restaurant in the six weeks it takes most people to accomplish a menial kitchen task. At the end of their training, the students know the name of a parchment paper lid (cartouche), the difference between the pilaf and the risotto method, the size of a brunoise cut, the five mother sauces and their derivatives, and whether to start boiling potatoes in hot or cold water (the answer, here).When I asked Brandon Chrostowski, the founder, president, and CEO of EDWINS Leadership & Restaurant Institute (and a 2017 Cleveland mayoral candidate), how many of the students enter the program with professional cooking experience, he estimated five percent, but stressed that it is excitement about the future, rather than a knowledge of food, that best predicts students’ success. Yes, it can be challenging to teach an unseasoned cook the gentle hand required to properly emulsify a beurre rouge, but it’s more difficult to build esteem from the ground up: “If you don’t feel good,” Chrostowski told me, “you won’t be able to exhibit that skill.”While a restaurant might be a frighteningly new workplace, the industry is also well-suited to accept and encourage people who have recently been released from prison. “We don’t cast judgment as long as you work your ass off,” Chrostowski explained. “Everything is inside of you. You just need someone to pull it out.”The film packs a lot into a short 40 minutes. You'll find Brandon’s mission inspiring, you'll root for the students to succeed, and, who knows, you might even be tempted to try your hand at steak au poivre or artichauts à la barigoule.Explore Bon AppétitMoviesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Sarah Jampel"]}