{"id": "e6920545e79da6ee97b7c7934bad5f9b", "url": "https://www.bonappetit.com/story/creamy-one-pot-pasta-is-like-a-great-dinner-party", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "This One-Pot Pasta Is Like a Great Dinner Party in a Bowl | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Creamy One-Pot Pasta Is Like a Great Dinner Party in a BowlIt might not seem like all the elements are going to get along, but then they do, and it’s magical.By Jesse SparksJune 5, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailThe best recipes and the best dinner parties have one key thing in common: It’s all about the mix. Whether you’re talking about ingredients or guests, the way different elements interact with one another is what makes the whole thing special. Which is why I was admittedly skeptical when I started looking at this Creamy One-Pot Pasta with Peas and Mint recipe. I had a hard time imagining how everything was going to work together. How would the frozen peas (!!) get along with the mint? Would some boiling and a bit of chopping and mashing really bring it all together to create a harmonious whole? Would it end up feeling like a bad throwback to mushy mixed vegetables in the school cafeteria? Spoiler alert: It worked out so much better than I could have possibly imagined.And it couldn’t have been easier, either. I got a pot a water going on the stove, tossed in a palmful of salt and, once boiling, dropped in the frozen peas. It didn’t take long at all before peas stopped swirling along the bottom of the pot and floated on the surface. After fishing out the peas, I returned the water to a boil and dropped in my shells. With a time limit set for that perfect al dente, I went to work on chopping my mint and grating the garlic and Parmesan. (I may or may not have stolen a few slivers of cheese to hold me over.)Smelling the garlic and mint together was the first clue that this combination was a winner—pungent spice tempered by a cooling freshness. Zesting the lemon made the lively aromas even brighter. I’d lost track of time taking huge whiffs of it all when I saw my timer happily ticking away. While I had plenty of time to get everything done, I felt a bit like a Chopped contestant racing against the clock. The main difference being that I wasn’t trying to use the ice cream machine with 8-10 minutes left (rookie mistake).Frozen peas: a highly underrated food.\nPhoto by Laura MurrayWith all of my sauce ingredients ready to go, I went to town smooshing it all up with a potato masher, which filled me with the joy of a five-year-old helping out on Thanksgiving day. With a good amount of peas still intact, I returned to my pasta and spooned out a half cup of starchy pasta water goodness into a separate bowl. I dumped the rest of the water and transferred the cooked shells to the bowl with the sauce mixture and gave it a toss with a bit of salt. Suddenly, everything made sense.The peas smelled sweet, fresh, and crisp. The cream and Parm that formed the base of the sauce thickened as it tangoed with the hot pasta. That vibrant lemon-mint combo kept the garlic in check, while the pasta water I’d drizzled over the mixture while tossing made everything look slippery and saucy. (I ended up adding a lot more cheese than the recipe called for. I like luxury. Sue me.)After garnishing with even more Parm, a lemon wedge for squeezing, and a bit of extra mint, I was done. It was incredibly delicious, a fully integrated and exciting plate of pasta. The mix of mashed and whole peas kept everything texturally interesting—some bites were soft and yielding while others were punctuated by a crisp pop. The squeeze of lemon reinvigorated the dish right when I was ready for a little bit more brightness. It all worked. And just like great dinner party full of flavors and people you worried might not get along, everything felt, thankfully, perfect and effortless.Get the recipe:Creamy One-Pot Pasta with Peas and MintPantry pasta at its best.View RecipeExplore Bon AppétitBasicallyPeaMintPastaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-05", "author": ["Condé Nast", "Jesse Sparks"]}