{"id": "e6a50f3f70f3e9b573b71808338e712f", "url": "https://www.bonappetit.com/story/beauty-products", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "Can These Beauty Products Really Help You Sleep? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCan These Beauty Products Really Help You Sleep?New beauty and wellness products are now factoring sleep into their skin-enhancing equation. I put them to the test.By Deanna PaiFebruary 27, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailBeing a light sleeper has made me old. My driver’s license says I’m 29, but there I am, leaving angry notes for the owners of the barking dog across the hall, calling the city’s noise-complaint hotline at the sound of early-morning construction, and occasionally banging a broomstick on my ceiling. My boyfriend, who snores at the sight of dairy (or so he tells me over pizza), has only complicated matters.Not only am I acting like a grandma, but my skin is, too. Research links poor sleep quality to increased signs of skin aging and compromised barrier function (which leads to moisture loss in the skin). Sleep is when skin gets a break from the barrage of pollution and sun exposure, so cells take this opportunity to repair and restore themselves. Without rest, it’s bound to suffer some consequences. The upside: From overnight supplements to creams and oils, new beauty and wellness products are now factoring sleep into their skin-enhancing equation. I decided to put them to the test to see whether or not they could keep me asleep—and help my skin along the way.Evolution 18 Overnight VanillaThe Tahitian vanilla seemed almost sickly-sweet when I first mixed this white powder with water. (I changed my tune once I tried a non-flavored supplement.) But it has collagen peptides, biotin, hyaluronic acid, and coconut oil to boost skin’s hydration and elasticity, as well as calming magnesium to promote sleep, so it was a worthy tradeoff. I slept straight through until around 5:30 AM, a.k.a. the time of day I tend to bolt awake, worried that I’d slept through my alarm. When I eventually rolled out of bed, my skin’s texture looked a little smoother and felt softer—and my usual undereye bags had deflated.Buy it: Evolution 18 Overnight Vanilla, $48.Votary Antidote Night OilI love the idea of scenting myself to sleep. There’s something that seems luxurious about body oil too, since it implies you have either the means to hire someone to remove oil residue from your white couch or the ability to live with the stain in peace. I have neither, which is why I was stoked to find that this night oil, infused with lavender and chamomile, sinks in within seconds. I applied it to my entire upper-body, including my neck, right before putting on my pajamas, and didn’t notice any transferring or greasy texture. An hour later, I could smell the herbal blend as I settled in under the covers. Reader, I slept like a baby—and woke to the soft skin of one, too.Buy it: Votary Antidote Night Oil, $118.Moon Juice Night BeautyI’ve never actually used a Moon Juice supplement before, so I had high hopes for this one—which were dashed when I opened up the canister and took a whiff of it. This stuff smells rank, like I dug it out from under a rock in the woods behind my parents’ house. And it does not taste any better, though it helped to mix it with hot water and call it tea. It’s more sleep-focused than the Evolution 18 supplement, supposedly helping you drift off with a blend of stress-reducing ashwagandha and jujube seed. For skin, there’s amla berry (to support collagen) and schisandra berry (to minimize inflammation). I passed out as soon as my head hit the pillow. In the morning, I felt refreshed enough not to hit snooze, and a stubborn breakout on my forehead that I’ve been battling for months looked calmer and less inflamed. Sure, it could be the not-so-natural antibiotics my derm prescribed (hey, this site is called Healthyish, not Tom Brady’s Personal Blog) but I was delighted either way.Buy it: Moon Juice Night Beauty, $65Dermalogica Sound Sleep Cocoon Gel-CreamThe name of this night cream sold me even before I learned that the motion-activated formula releases lavender to keep you from tossing and turning. The texture is lightweight and ideal for oily skin types, and the scent is herbaceous without being overpowering. Unfortunately, this was the night the powers-that-be decided to do night work on the FDR Drive outside my apartment. I woke up, checked the time (12:51 a.m.), dug out a set of earplugs, glared at my deep-sleeping boyfriend—and fell right back asleep. This is a big deal, because usually, when awakened during a REM cycle, I lie awake for hours, fuming and plotting revenge. I’ve been using this stuff ever since. And even if it didn’t lull me back to sleep, I’d still use it for the weightless hydration.Buy it: Dermalogica Sound Sleep Cocoon Gel-Cream, $80.This Works Sleep Plus Pillow SprayThis brand is based on the premise that good sleep equals good skin, which is why their runaway bestseller is an aromatherapeutic pillow spray. The blend of lavender, vetivert, and chamomile is motion-activated to help you stay asleep (versus getting you to fall asleep in the first place). I sprayed so much of this on my pillow that it was damp, but I fell asleep fast in spite of it and only woke up a few minutes before my alarm. And the seven-and-a-half hours of uninterrupted sleep showed: There was less redness and swelling around my breakout, and my under-eye bags were nowhere to be found.After a few nights of good sleep, I started shifting my bedtime to an earlier time (so I’m still an old, but now in a different way). I was impressed by the efficacy of these formulas and the fact that they actually impacted my skin. While my grape-flavored melatonin gummies help me fall asleep (and—key—taste like dessert) they don’t really give me a glow. Post-testing, I’ve still been using the Dermalogica gel-cream as my night cream, mixing up Moon Juice Night Beauty (and drinking it like a shot), and smoothing on Votary Antidote Night Oil. My skin’s better for it.Buy it: This Works Sleep Plus Pillow Spray, $46.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishNatural BeautyShoppingTrendsRead MoreLifestyleWhy We're All About Bakuchiol, Natural Skincare’s Answer to RetinolBy Deanna PaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-27", "author": ["Condé Nast", "Deanna Pai"]}