{"id": "e6b2b1fae0d644c1c802a83569d46849", "url": "https://www.bonappetit.com/story/i-think-we-have-a-gay-bar", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "The Story of Big Chicks, the Iconic Chicago Gay Bar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoprestaurants“I Think We Have a Gay Bar”Big Chicks was an old-man bar on the far north side of Chicago, across the street from an SRO. Then Michelle Fire made it the place everyone went to drink, to dance, to hook up in a dark corner, to feed cake to strangers on the dance floor.By David TamarkinJune 6, 2018FacebookTwitterEmailPhoto by Wes FrazerFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.It took a few years for Big Chicks to become Big Chicks. First, Michelle Fire had to tend to the old men.They were World War II vets, transplants from Appalachia, retirees who lived in the SRO next door. Fire inherited them when she bought the bar in 1986; they’d been drinking there, tucked away in this dark watering hole in the Uptown neighborhood of Chicago’s Far North Side, since 1944.“There was a cane on every bar stool,” Fire tells me now.She couldn’t kick them out. Or rather, she wouldn’t. She served them drinks and slowly made renovations around them. Technically, these old guys were sitting in a gay bar now, but they didn’t know or didn’t care. They arrived at 7 a.m., drank all day, put their chihuahuas on the bar and let them lap from whiskey glasses, just like they always did. Fire, who previously bartended at a late-night gay bar called the Loading Dock, had never seen anything like it.On Sundays she cooked. She’d grill chicken or make pasta—“good food, not junk food,” she says to me—and hand out plates. No charge. She wanted to thank the old guys—hell, the gay guys weren’t exactly knocking down the door—and, besides, they looked like they could use a meal. A lot of them lived alone, didn’t cook. “These guys were not well-heeled,” she says.Michelle Fire, leader of the Big Chicks flock.\nPhoto by Matt HaasIt went on like this for years. Two and a half years of renovations to make the place presentable. Four years, five years, until the sexy gay boys finally showed up.Was it a coincidence that things started to change the minute she put a piece of art on the walls? Eventually Fire would turn Big Chicks into a gallery, covering every inch of the place with paintings and photographs, all of them depicting women, and many of them by artists who had perhaps never been hung in a smoky old-man’s bar: Lee Friedlander, Diane Arbus, Lisette Model. She started with a giant mural of three women—“the muses,” in Fire-speak—and hung it above a table near the front door. As soon as it appeared, there was a shift. A lot of the SRO guys weren’t around anymore. Some of them had been banned for bad behavior; a lot of them had died. For a moment Big Chicks looked like it had lost the only client base it had. But one snowy night, one of Fire’s bartenders, Don, looked out the window. A bunch of queens were exiting a taxi, looking around, wondering why the hell they were in Uptown. They skittled into Big Chicks. Another cab followed; same thing.Don called Fire over. “I think we have a gay bar,” he said.The three muses, Fire’s first piece of art for Big Chicks.\nPhoto by Matt Haas“I’ve been that boy leaning against the wall.”Well, they did and they didn’t. Big Chicks never fit neatly into the gay bar mold. Maybe a bar run by a woman who self-identifies as being of “indeterminate sexual proclivities”—a bar named Big Chicks, for Christ’s sake—never had a chance of being a typical gay bar.Not that typical was the goal. Fire had a tagline for the place from the beginning: men and men, women and women, and women and men. In other words, she welcomed everybody. And that’s what she got. The leather daddies, the truck-driving lesbians, the genderqueers, the femmes; black, latino, Polish, Japanese. They all showed up.Dance the night away.\nPhoto by Wes Frazer“Did you ever know the girth-and-mirth people?” Fire asks me.I’d never heard of them.“Chubby chasers,” she says. They were at Big Chicks too. They, like everyone, were there for Fire.“I’m more like a mother than I am a peer. A kind of sister-mother figure. I’m very nonjudgmental. That’s how I expected my clientele to be; that’s how I expect my staff to be. That’s what I demand of everybody. And once you set that tone…”She trails off, but I spent ten years of the aughts going to Big Chicks—I can fill in the rest. I’ve been that boy leaning against the wall, lightheaded, cheap gin in my glass. Cruising the trans boys, the black girls, the grizzly raising eyebrows at me from the bar. And bears. Sometimes it seemed like it was only bears in the place—muscle bears, cubby bears, ginger bears, otters. But at Big Chicks—and only at Big Chicks—a bear could not intimidate me. I sucked on a cigarette (this was back when people still smoked inside); I exhaled on the Diane Arbus photograph above me. I philosophized, drunkenly, that nobody gets to live with art like this; nobody gets to flirt and make out and spill beer in a museum. I went back to cruising. I tried to look tough, like I owned the place, like the floor was mine.The floor wasn’t mine. The floor was Fire’s. Now I’m telling her how I used to feel those nights at Big Chicks, how I wanted to become part of the place, to be bolted to the wall like the photographs. Did she know what I meant? I felt calmer there, and maybe a little hopeful—like Chicago, a city that could be so backward, could be as good as I thought it was. When I was here, I felt like a citizen, of the city and of the bar. Did that make sense? I’m having a hard time articulating myself, I can’t find the words. Fire cuts me off. “It’s called safety,” she says.The nighttime scene.\nPhoto by Wes Frazer“A hulking, living art project”Everybody’s history looks logical in retrospect. In Fire’s case, you can draw a straight line from her West Side childhood to her Far North Side queer bar. She was born tough to left-wing radical parents (a “red diaper baby,” she says). Her father was Jewish, her mother was gentile, “and that was enough reason for everybody in the world to hate us.”Their neighbors threw trash at them. Her father got jumped in the alley. At school, kids would try to beat up Fire and her sister, but the girls fought back. It was a childhood that prepared her for bar life. “It allowed me to be very street savvy and undeterred by people coming at me,” Fire says. Without those experiences, she would have never survived Uptown in the ’80s.Fire peeking through the windows.\nPhoto by Matt HaasNothing could be beat out of Fire; she’d just fight through. She studied art at UIC and made a place for herself in Chicago’s art scene. For ten years, she hustled, making drawings and prints, tending bar, working catering gigs, manning the temporary tattoo stand at street fairs. In 1984 she landed that job at the Loading Dock—an “all-consuming, very exhausting 5 a.m. bar.” That’s when she decided to, as she says, start participating in capitalism.She started saving, though she didn’t know what for. She knew she never wanted to borrow money, and she knew she wanted to be prepared. She’d eyed the art deco terra-cotta buildings on the North Side forever—it’s what she used to draw. When the bar that became Big Chicks came up for rent, she had just enough money to grab it.In the early years she worked 80-hour weeks. She’d open her bar in the morning, when the old guys would come in, and work a shift at the Loading Dock at night. In 2003, long after Big Chicks stopped keeping morning hours, Fire opened an all-day restaurant next door, Tweet. And like that, she was working 80-hour weeks again.Those hours forced her to stop making art, “but that’s fine,” she says, and it sounds like she means it. Big Chicks and Tweet are hulking, living art projects—experiments in business and community.Diners at Tweet, Fire’s restaurant next to Big Chicks.\nPhoto by Wes Frazer“The uncommon energy of community”“When you travel around the country, you realize how homogenized everything has become,” Fire says to me. She’s not talking about gay bars specifically, but that’s where my mind goes. I think about the gay bars I know where skinny boys and fat genderqueers grind on the same dance floor. And I think about the more common gay bars, the ones full of white guys on their phones. There are some nights—especially ever since the Far North Side became wealthier, as all those SROs became condos—when Big Chicks looks homogenized too.The red velvet cake.\nPhoto by Matt HaasBut even then, there’s the art. And there’s the red velvet cake from Tweet, which you can order at the bar. (I used to eat foot-tall slices off a porcelain plate while I danced.) And even when it’s dead at Big Chicks, there’s the uncommon energy of community, a mostly silent acknowledgement that everybody is there for the same thing: to drink, to dance, to hook up in a dark corner. To feed cake to each other on the dance floor. To eat on Sunday, when Michelle stills feeds us for free. To flirt with other queers in line for the bathroom.Queer was a slur when Big Chicks opened; Fire would never have uttered it to describe her clientele. But we’ve been here from the beginning. The SRO guys who stuck around for so many years used a different term when they finally pulled Fire aside and whispered in her ear, but still, they spoke up. “Michelle,” they confessed. “We’re gay too.”David Tamarkin is the digital director of Epicurious.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsChicagoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "David Tamarkin"]}