{"id": "e6b308e57a26acf369fa0ca5e82d1adc", "url": "https://www.bonappetit.com/story/jessica-b-harris-black-culinary-traditions", "year": 2021.0, "month": 1.0, "day": 3.0, "content": "Jessica B. Harris's Guide to Black Culinary History | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureJessica B. Harris’s Guide to Black Culinary HistoryThe food historian on the dishes, books, and ingredients she considers iconic.By Jessica B. Harris and Dawn DavisJanuary 19, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by Pearl JonesFacebookTwitterEmailBahia, Brooklyn, New Orleans, Martha’s Vineyard, and Paris are the places she’s called home. Erudite, wickedly funny, and droll describe her personality. Who are we talking about?None other than the culinary historian Jessica B. Harris, Ph.D.—founding member of the Southern Foodways Alliance, a member of Les Dames d’Escoffier, a professional society championing women in culinary fields, an award-winning journalist, podcaster, and author of over a dozen deeply researched books and too many articles to count. (If you’re looking for something that goes down like butter, check out her memoir, My Soul Looks Back, filled with tales about her adventures in New York’s Greenwich Village with friends James Baldwin and Maya Angelou.)As the foremost expert on the foodways of the African diaspora, there’s no better (or wittier) guide to Black culinary traditions. Here, she shares with us a few of the dishes, books, and ingredients she finds essential to unpacking this long, rich, and ever-evolving history. —Dawn Davis, editor in chiefPhoto by Suzi PrattTry the Homestyle FavoritesChef Edouardo Jordan’s JuneBaby restaurant in Seattle is an edible praise song to the genius of African American cooks. The menu offers classic dishes like fried chicken and greens along with specials—like chitlins and Momma Jordan’s oxtails—not usually tasted outside of home kitchens.Tour the ArchivesToni Tipton-Martin’s The Jemima Code reclaims and celebrates the heritage of Black America’s controversial “aunt” by documenting 200 years of African American cookbooks from her personal collection. Familiar figures such as Edna Lewis show up alongside unexpected personalities such as activist Bobby Seale and singer Mahalia Jackson in this must-own compendium.Photo by Emma FishmanEat Like an IconThe late New Orleans chef Leah Chase served Gumbo z’Herbes once a year on Holy Thursday. The dense green meaty gumbo is essential to the rich culinary history of the area’s Creoles de couleur. It’s still served annually at Dooky Chase’s, her iconic family restaurant.Photo Courtesy Cuisine Noir/Ilaria SpondaRequired ReadingTwo invaluable resources for those who want to deepen their knowledge: Black Culinary History and Cuisine Noir. Both websites preserve and promote the past and present contributions of chefs of color throughout the African diaspora.For The Bucket ListThe food of São Salvador da Bahia de Todos os Santos in northeastern Brazil is a linchpin between the food of western Africa and that of the Western Hemisphere. To taste a fish stew called a moqueca or nibble on an acarajé, a street food bean fritter, is to understand the connections.Photo by Mike LorrigMore Okra, PleaseOkra, which originated on the African continent, is a love/hate vegetable. Its detractors hate the “slime” and the lovers delight in the way it thickens a soup or stew and its crunch when blanched. Get recipes, history, and gardening tips, in The Whole Okra by Chris Smith.Photo from Vintage Postcards From the African World: In the Dignity of Their Work and the Joy of Their Play by Jessica B Harris,, University Press of MississippiShare KnowledgeYou can find incredible images of African Americans and food on vintage postcards in my latest book, Vintage Postcards from the African World. They not only present the faces of ancestors but also tell amazing, often harrowing, stories of survival and triumph over adversity.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-19", "author": ["Condé Nast", "Jessica B. Harris", "Dawn Davis"]}