{"id": "e6ba299f561356c47306d39cf483ea73", "url": "https://www.bonappetit.com/recipe/roast-salmon-with-citrus-and-coconut-chile-crunch", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Roast Salmon With Citrus and Coconut-Chile Crunch Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueRoast Salmon With Citrus and Coconut-Chile CrunchBy Chris MoroccoJanuary 4, 20224.7(25)Read ReviewsTriangleEmailPinterestPrintPhotograph by Paola + Murray, food styling by Pearl Jones, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrintIn this bright and blessedly refreshing winter-appropriate main, roasted salmon is paired with juicy citrus and topped with coconut flakes and peanuts that have been sizzled with chiles and ginger. Use a mix of sweet and sour citrus to make it look (and taste) extra fun.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonParing Knife$10 At AmazonSmall Saucepan$155 At AmazonIngredients4 servings1½lb. boneless salmon fillet, preferably skinlessKosher salt6Tbsp. extra-virgin olive oil, divided2Fresno chiles, red jalapeños, or red serrano chiles (green is okay if that is what you can find), thinly sliced11\" piece ginger, peeled, finely chopped1cup unsweetened coconut flakes½cup unsalted roasted peanuts2¼lb. citrus (such as grapefruit, oranges, and/or tangerines)3Tbsp. white balsamic vinegar or seasoned rice vinegarFlaky sea saltPreparationStep 1Preheat oven to 350°. Pat salmon dry, then season with kosher salt. Heat 1 Tbsp. oil in a large ovenproof nonstick skillet over medium. Cook salmon (skin side down if it has skin) until well browned underneath, 6–8 minutes, then transfer to oven. Roast until flesh is opaque and flakes easily with a fork, 8–12 minutes.Step 2Meanwhile, cook chiles, ginger, coconut flakes, peanuts, and remaining 5 Tbsp. oil in a small saucepan over medium heat, stirring often, until coconut and peanuts are golden, 8–10 minutes. Transfer coconut-chile crunch to a heatproof bowl and let cool slightly.Step 3Using a small sharp knife, cut peel and white pith from citrus, leaving as much flesh behind as possible. Cut flesh from cores in a variety of shapes and sizes and arrange on plates. Break salmon into big pieces and divide among plates, arranging on top of citrus.Step 4Stir vinegar into coconut-chile crunch and season with salt (it will probably need a few pinches). Spoon over salad and sprinkle with sea salt.How would you rate Roast Salmon With Citrus and Coconut-Chile Crunch?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleAmazing! This recipe is so simple but packs a flavor punch. Variety is the spice of life citrus wise here - I used blood oranges, mandarins, pommelo grapefruit and a few kumquats for a tangy / bitter kick. The chile coconut crisp could definitely be doubled to top a side of veg. I did the citrusy stir-fry asparagus from 2019. Holy moly. What a pair! If you dig citrus. LmSanta Fe2/17/2022The crisp was delicious - I used two Fresno chilies and it was reasonably spicy, as well as rice vinegar. Great over pan fried chicken thighs the next day.\n\nThe dish was plenty good with grapefruit, cara cara & blood oranges. Served with white rice as it was already on hand, but next time will try pilaf or cous cous.\n\nNext time I'll do more grapefruit and skip the cara cara. I might try the white balsamic, or a vinegar with more of a kick than rice vinegar. I might make a small amount of a soy-shaoxing wine-black vinegar marinade to cook the salmon in, or reduce it and pour as a bit of sauce over the salmon before adding the topping... the dish was missing some umami and sour notes to balance out the sweeter citrus (and salmon, which is a bit sweet but not too umami on its own). It would benefit from some light greens underneath along with the citrus, maybe some pea shoots or other baby green (not anything too herby like cilantro).\n\n3.5/5 stars as presented but this dish has 5/5 potential with tweaks.sarinaboston ma1/30/2022All the elements of this were individually good, but the citrus totally overpowered the salmon. The crisp didn’t get crispy, maybe too much oil, but was delicious with either salmon or citrus. Used satsuma, cara cara orange, and grapefruit. Would make citrus crunch as salad with salmon on the side. KatOak Park IL1/30/2022Made with mahi mahi b/c that's what I had. Jalepeños weren't hot after cooking. Delish!\nI get the magazine but like to print the recipe from here.MimiBend, Oregon1/27/2022Made with macadamia nuts instead of peanuts because we were feeling fancy and can’t recommend highly enoughDanika1/26/2022Great recipe and a lovely mix of flavors. I had a hard time getting the coconut peanut mix to “crisp” up, but It still tasted delicious.  Used a mix of pink grapefruit, minneola, and blood orange. Could see mango, avocado or thinly sliced red onion being nice additions too! Will definitely make again! Spatulacity Los Angeles1/26/20221/22. Really elegant, easy and delicious. Halved recipe for 2 of us. Otherwise made as written. Worthy of a special company meal. The flavors all compliment each other. Served with roasted asparagus.Lynn1/23/2022The flavors of this recipe are phenomenal!  I was able to find large coconut flakes (chips) and they added a fabulous crunch.  Used unsalted walnuts as I was unable to find unsalted peanuts. I also included an avocado with the citrus.  Blended perfectly with the salmon.  Highly recommend this recipe.Kim Seattle, WA1/16/2022Explore Bon AppétitDinnerWeeknightEasySalmonFishSeafoodCitrusFruitCoconutWinterGrapefruitOrangeTangerineFresno ChileChileVegetableJalapeñoSerrano ChileMainGluten-FreeDairy-FreeRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Chris Morocco"]}