{"id": "e6c3b0980c2423ccd457a1dfba5b130a", "url": "https://www.bonappetit.com/story/how-to-clean-a-water-bottle", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "How to Clean a Water Bottle—Because Yes, Yours Is Filthy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingYour Water Bottle Is Filthy. Here’s How to Clean It.Drinking water is good for you! Drinking mildew and mold is probably not.By Nico AvalleJanuary 12, 2022FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.My water bottle is easily my favorite accessory. It’s a one-quart Nalgene I got during college orientation, now covered in stickers for bands, board games, political rallies, and coffee shops collected over the years. We go everywhere together. I bring it to work, keep it on my bedside table while I sleep, take it on long bike rides, embarrassingly knock it over during yoga class—it’s like a security blanket for my dehydrated little body.While I love my water bottle, I must admit that I didn’t always treat it as well as I should have. Unlike wine glasses, coffee mugs, and most other things I drink from—which I clean after every use—I would usually just rinse out my water bottle in the morning and call it a day. That is (and sorry for the gross imagery), until I noticed black mold growing on the threads of the twist-off cap, dripping spores into the water I’d been drinking.It was sickening. My water bottle was supposed to be my ticket to clearer skin and fewer headaches, not a breeding ground for toxic fungi. I thought about throwing the Nalgene out, but replacing it with a new bottle felt wasteful, and I couldn’t help but think about how I’d be throwing away all of my good karma from keeping single-use plastic water bottles out of the trash. So, instead of giving up and drinking more mold, I devised a routine for keeping the naturally moist environment of my canteen spotless and sanitary. So, if you’ve ever wondered how to clean a water bottle, let me share what’s been working for me.For a weekly clean, you need a bottle brushThe hardest thing about deep cleaning a water bottle is getting past the spout, particularly if you don’t have one with a wide mouth like a Hydro Flask or Yeti Rambler. Unless you have extra small hands and wrists, getting in there with a normal sponge is simply impossible. Luckily, when I discovered the gunk that started me on this journey, I already had a bottle brush, which makes reaching the bottom of the bottle a breeze.Photograph by Isa ZapataOXO Bottle Brush$7 at Amazon$7 at Bed Bath & BeyondA bottle brush looks a lot like a toilet brush, though we don’t recommend using the same tool for both tasks. They come in many shapes and sizes: Some are made of silicon for maximum durability, others with spongy heads that get extra sudsy. My favorite kind is a classic bristle brush like this one from Oxo, which I also use to clean my Chemex coffee maker and the gear I use to brew cider and beer—a task where sanitation is of the utmost importance.The bristles are abrasive, knocking loose any physical buildup while delivering dish soap into the hardest-to-reach nooks of my Nalgene. With the bottle itself clean, I simply scrub the cap with a soapy sponge, rinse thoroughly with hot water, and let it all air dry. (If your lid has a built-in straw, it’s probably a good idea to pick up a straw brush as well.) When I'm done, I simply toss the cleaning brush in the dishwasher so it’s nice and sterile for my next water bottle cleaning session.Drinking Straw Cleaning Brushes$3 at AmazonFor an monthly refresher, fizzy tabletsBrushing with soapy water is the cleaning method that works for me, but there are additional steps you can take to keep your bottle sparkling. To combat mineral build-up and off smells, I picked up a box of these fizzy cleaning tablets. To use them, simply fill your bottle with water, plop in a tablet, let it sit for at least 30 minutes or up to overnight, rinse it out, and you’re good to go.Photograph by Isa ZapataBottle Bright Bottle Cleaning Tablets$24 at Amazon (36 Tablets)While there’s no replacement for a tough scrub to take out tougher grime and debris, these tablets do a great job of getting rid of unpleasant lingering smells—especially if you give them a couple hours to work their magic. They’re an especially good choice for CamelBak backpacks, whose long, winding straws, mouthpiece, and tight crevices are notoriously difficult to clean. They’re also great for Hydro Flasks since it’s harder to spot mildew in a stainless steel water bottle than through transparent plastic.The biggest thing these tablets have going for them is ease of use. Not only do they leave things tasting fresh, but a cursory glance at the ingredients list will reveal plenty of heavy hitting neutral cleaning products like baking soda and hydrogen peroxide (a combo that we recommend to clean your crustiest baking sheets too). They’re also chlorine-free, which means no lingering swimming pool taste. Pick up a box and use once per month for clean water bottles without the elbow grease.Is there a DIY option?While those tablets are convenient, you can also combine the baking soda you have in your pantry with food-grade hydrogen peroxide if you’d rather DIY it. This duo is so good at cleaning that I use it for everything from pots and pans to my teeth, with shiny, sparkling results all around. For a 1-liter water bottle, add a tablespoon of each, fill with water, leave overnight, and rinse.Food Grade Hydrogen Peroxide$18 at Amazon$6 at Thrive MarketFor a less intense but still effective way to give your reusable bottle a thorough cleaning, fill it with equal parts white vinegar and warm water and leave it to soak overnight. The next day, rinse the bottle out, give it a soapy scrub with your brush to ensure there’s no lingering vinegar taste, and be on your way.Can I put my water bottle in the dishwasher?That depends on a few factors. While most Nalgenes and Hydro Flasks are dishwasher-safe, you should still check the product details for your specific water bottle before throwing it in with last night’s dishes—especially if it’s made of plastic, which can melt and may contain BPAs. If the manufacturer gives you the go ahead, you should still place it on the top rack, where temperatures are lower and there’s less risk of the cap or other small parts going missing.Still, even if your water bottle is dishwasher safe, you may still want to clean it by hand. I for one have an obnoxious number of stickers on my Nalgene (picture the bumper of your crunchy aunt’s Prius), and a few of them have faded or torn when I’ve put my bottle through the machine. Also, if you use a bottle with a sealing ring on the cap, bacteria and fungus might be able to hide underneath the rubber (which could also be compromised in the dishwasher). Taking the ring off and getting in there with dishwashing liquid and a sponge or a brush will be your best bet for truly eradicating the nasty stuff.Drinking water is supposed to be good for you. Sure, maybe you don’t always need the full 8 glasses, but there are plenty of good reasons to sip water throughout the day, and beyond the health benefits, drinking from a reusable water bottle keeps single-use plastic from landfills and can keep your drinks colder (or hotter) for longer. And, now that you know how to clean a water bottle, you have everything you need to turn your Hydroflask, S’well, or Nalgene into a lifelong companion. Keep it close by, keep it sanitary, and remember: Hydrate or Die-drate.Keep it Clean and Buy For Life1 / 5ChevronChevronPhoto by Chelsie CraigS'well Stainless Steel Water Bottle$35S'wellShop NowExplore Bon AppétitShoppingtechniqueCleaningToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-12", "author": ["Condé Nast", "Nico Avalle"]}