{"id": "e70da0e81cdd9cbcdcb0a66f56eb92b0", "url": "https://www.bonappetit.com/recipe/goes-on-everything-barbecue-seasoning", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Goes-on-Everything Barbecue Seasoning Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueGoes-on-Everything Barbecue SeasoningBy Kurt EvansJune 2, 2020EmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintMake a double batch and keep this spicy-sweet blend on hand for all grilled meats and vegetables.IngredientsMakes about ½ cup¼cup smoked paprika2Tbsp. light brown sugar2tsp. chili powder2tsp. garlic powder1½tsp. cayenne pepperPreparationStep 1Whisk paprika, brown sugar, chili powder, garlic powder, and cayenne in a small bowl to combine.Step 2Do ahead: Seasoning can be made 1 month ahead. Store airtight at room temperature.How would you rate Goes-on-Everything Barbecue Seasoning?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis is the best recipe ever ❤ love it Judy SheaTexas8/20/2021Explore Bon AppétitAmericanPaprikaHerbs & SpicesEasyQuickNut-FreeDairy-FreeGluten-FreeVeganVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Kurt Evans"]}