{"id": "e70ea99efe32241671069b56cbc0443f", "url": "https://www.bonappetit.com/story/christina-tosi-loves-ina-garten-pasta-salad", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "This Ina Garten Recipe Changed the Way Christina Tosi Thinks About Pasta Salad | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Ina Garten Recipe Changed the Way Christina Tosi Thinks About Pasta SaladThe founder of Milk Bar started an Ina Club to celebrate her favorite Barefoot Contessa recipes. This is one of her go-to salads.By Christina TosiNovember 2, 2018FacebookTwitterEmailFacebookTwitterEmailIn honor of Ina Garten's guest editing week, we asked chefs and celebrity fans to share their favorite Barefoot Contessa recipes as part of our series “How Easy Is That?” Below, Christina Tosi, founder and CEO of Milk Bar and author of new cookbook All About Cake, explains how her Ina-themed dinner party club started, and why pasta, pesto, and peas salad will always be on the menu. \n About five years ago, some pals and I were at a dinner party and we couldn’t get over the roast chicken. The hostess was like, “Oh my god, this is my girl Ina’s roast chicken! We’ve never met before, but I just love her. It feels like our chicken now.” I realized that whenever I host a dinner party, my tableau is basically all Ina recipes. So we decided to start a tradition where once a year, my friends and I come together for an Ina party.The Ina Club rules are simple: The entire table must be filled with recipes by Ina and Ina only. We all go to the market, channeling our inner Inas and shop based on what looks good, smells good, and inspires us. None of us necessarily knows what recipe we’ll make, but we do know seasonally which ones are our tried-and-true favorites. Then we bring the goods home, scour the internet and open all the Ina cookbooks, and make a meal. Everyone usually makes a few dishes, and we eat potluck-style.The most requested recipes for the Ina Club are almost laughably simple, like the summer pasta salad with tomato, Parmesan, and basil, and Parmesan-roasted broccoli. In the wintertime, I did a customized grilled cheese bar to go with her perfect tomato soup. I cleaned out my fridge of all the cheeses, jellies, and jams, let people mix and match, and then cut into little squares to be “croutons.” What a genius idea—grilled cheese croutons!But one of my personal favorites to make is the pasta, pesto, and peas salad from Barefoot Contessa Parties! In this recipe, she finds a beautiful balance of things that are familiar and unexpected, like taking peas, blanching and blending them, and then putting them into a cold pasta salad with pesto. On some level, it was earth shattering when she did that—it just seemed so perfectly outside of the box, yet also perfectly acceptable and classy. It was like edgy without being edgy; it was like all the effort, but in an effortless way. She really taught me that great food can be accessible and comfortable, but that you can take it just one step further by throwing yourself out of your comfort zone.With both Ina as a person and with her recipes, there's an ease, but there's also empowerment. She's not selling the persona of perfection—she's selling humanity. She’s just being her, and that’s what makes her so perfectly, untouchably lovable on every level.In my five years of hosting the Ina Club, I’ve never once invited her. I don’t want her to get bombarded with crazy, overly enthusiastic (yet very lovely) women, and I know she probably gets a lot of invitations. But maybe next year will be the year I surprise everyone when she joins us. So, consider the invitation open for 2019, Ina!—As told to Alyse Whitney Ina Garten’s Pasta, Pesto, and PeasFrom Barefoot Contessa Parties!Serves 12This famous Barefoot Contessa recipe originally came from my wonderful friend Brent Newson. In order to keep the pesto from turning brown, he adds spinach and lemon juice. To make a delicious and easy one-dish summer lunch, use your imagination and add grilled chicken or fresh salmon.¾ pound fusilli pasta¾ pound bow-tie pasta¼ cup good olive oil1 ½ cups homemade pesto\n1 10-ounce package frozen chopped spinach, defrosted and squeezed dry3 tablespoons freshly squeezed lemon juice1¼ cups good mayonnaise½ cup grated Parmesan cheese1½ cups frozen peas, defrosted⅓ cup pignolis, toasted in a dry sauté pan over medium heat for about 4 minutes until evenly browned, tossing frequently (optional)¾ teaspoon kosher salt¾ teaspoon freshly ground black pepperCook the fusilli and bow ties separately in a large pot of boiling salted water for 10 to 12 minutes, until each pasta is al dente. Drain and toss into a bowl with the olive oil. Cool to room temperature.In the bowl of a food processor fitted with a steel blade, purée the pesto, spinach, and lemon juice. Add the mayonnaise and continue to purée.Add the pesto mixture to the cooled pasta, then add the Parmesan cheese, peas, pignolis, salt, and pepper. Mix well, season to taste, and serve at room temperature.Reprinted from Barefoot Contessa Parties!: Ideas and Recipes for Easy Parties That Are Really Fun. Copyright © 2001 by Ina Garten. Photographs copyright © 2001 by James Merrell. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House, LLC.Explore Bon AppétitChristina TosiIna GartenPastaPestoSaladPeaMomofuku Milk BarHow Easy Is That?CelebritiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-02", "author": ["Condé Nast", "Christina Tosi"]}