{"id": "e714ee496dfeae3a6a63595eaa659c55", "url": "https://www.bonappetit.com/recipe/martini-stanley-tucci", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Stanley Tucci’s Martini Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueStanley Tucci’s MartiniBy Stanley TucciOctober 19, 20214.2(110)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food styling by Pearl Jones, prop styling by Martha BernabeEmailPinterestPrintEmailPinterestPrint“Too many people say too many things, and I wish they’d stop,” says actor Stanley Tucci about the origins of the martini. “The only thing that matters is that the martini exists.” Here Tucci shares his recipe for his ideal martini, the way he’s been drinking it for ages: gin or vodka (each has its time and place) with just a whiff of vermouth, stirred not shaken. It’s “the quintessence of elegance that we all aspire to and believe we acquire when we drink one.”All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCocktail Mixing Glass$40 $18 At AmazonCocktail Jigger$6 At AmazonBar Spoon$10 At AmazonHawthorne Strainer$7 At AmazonVegetable Peeler$10 At AmazonIngredientsMakes 1½oz. dry vermouth2–3oz. high-quality gin or vodkaLemon twist or olives (for serving)PreparationFill a glass beaker or cocktail shaker with ice and pour in vermouth. Stir 15 seconds, then let sit 30 seconds. Stir again, then strain out and discard vermouth. Pour gin into beaker and stir 30 seconds. Let sit 30 seconds, then stir again 30 seconds. Let sit another 30 seconds, then stir again quickly. Strain cocktail into a chilled glass. Garnish with a lemon twist or olives. Drink it. Become a new person.How would you rate Stanley Tucci’s Martini?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangleI love the humor and in his book as well. And, I love martinis. Bombay Safire gin or, better yet, Kirkland gin (which is very good in it’s balance of botanicals). But the vermouth is key: Dolin Blanco vermouth (1/4 to 1/2 oz.) and 3 oz. gin. 100 stirs and let stand 15 seconds. Into a chilled martini glass with 2 Castelvetrano olives. Ahhhh.Tom BVermont2/28/2022Here's the thing, you can technically publish a recipe for spaghetti marinara that calls for, say, microwaving the noodles until mushy before adding ketchup, and you can totally accuse people of being snobs when they insist that this is not a good spaghetti marinara recipe. Individuals are entitled to individual opinions. But large food and drink publishers, I hope, would be held to a higher standard. This recipe is to a martini what mushy microwaved ketchup is to spaghetti marinara. Literally nothing about this makes sense and it's objectively a terrible recipe. It is, though, a very good argument for Stanley Tucci staying in his lane. BrettPortland, OR2/24/2022Works for me! The key is \"high-quality gin r vodka\"!verdeoMilwaukee, WI2/1/2022Classic! Perfect.  Orange bitters added to gin versionJLS from Ghent Ghent ny1/16/2022lol you people are dorks it's just a drink you don't have to genuflectBryan1/9/2022A Martini without vermouth is just straight gin. A ratio of 4 gin to 1 dry vermouth, stir 60 seconds- no more, no less. This is what they teach in the best bartender schools. Modify to your personal preference, but don’t call it a Martini.Chuck ScottNew Orleans, LA1/8/20227:1 for the perfect martini. Everything cold, including the ice!!Dave ParkerElk Grove CA1/1/2022Way too dry. I much prefer the old fashioned type of martini that has a 3:1 gin:vermouth proportions. CGinNoCOLoveland, CO1/1/2022I agree with those who swirl very cold dry vermouth of good quality in a very cold glass and discard the rest of the vermouth, then add 3 ounces of very cold gin from my freezer. I love Japanese Roku gin! Very elegant and very tasty. Lemon twist, no olives. Ahhhh!Mary GColumbus, OH12/1/2021Simon from Yorkshire:  No need to be doctrinaire.  York Gin London Dry and Noilly Prat are your preferences, not necessarily \"the best\" or \"a must.\"  York is a recent invention, and Noilly has changed its formula over the years, not always for the better.  If that's what you prefer, fine. Others are free to disagree.\nAnonymousUSA12/1/2021Forget the ice, it just waters the drink down. Keep the vodka/ gin always in the freezer and you don't even need to chill the vermouth. If you like it really dry swirl the vermouth round the glass and the pour it out before adding the spirit. For this recipe I prefer a twist. For baristas' more ice-watery versions an olive is better.Andrew PageBuenos Aires11/23/2021As for how small an amount of Vermouth for the Martini, the playwright Noel Coward once wrote, \"A glass should be filled with cold gin, and then waved in the general direction of Italy.\"Dennis Donohue Orangeburg,  NY11/12/2021Everything used to make the martinis are put into the fridge or freezer prior to making the drinks. We lightly spritz the vermouth onto the inside of the chilled martini glass before adding the rest of the contents of the cocktail shaker. Perfection.\nLipstick LibrarianVancouver, BC Canada11/11/2021I don’t know how anyone could drink a Vodka Martini but on the vermouth, I agree with the approach.  Zero vermouth is not the answer but it can easily dominate the cocktail if one over does it.  My approach is to swirl a bit of vermouth in the chilled glass and then toss the excess.  No matter the choice, the Martini is a serious cocktail and should be treated with the utmost reverence.J. WayneAlexandria, VA11/10/2021“Too many people say too many things, and I wish they’d stop”…indeed. \nMartini was perfectionAnonymousMassachusetts 11/10/2021Explore Bon AppétitGinAlcohol & Other DrinksVodkaCocktailDrinks AllMartiniVermouthRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Stanley Tucci"]}