{"id": "e71f904d2b125746d918fbd571afb8ee", "url": "https://www.bonappetit.com/story/plain-buttered-toast", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "How Is Buttered Toast So Good Every Time? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Is Buttered Toast So Good Every Time?This is literally 600 words on the perfection of buttered toast. Read while toasting.By Bettina MakalintalDecember 15, 2021FacebookTwitterEmailIllustration By: Tamara ShopsinFacebookTwitterEmailIn “Underrated,” we review the ordinary rituals we build around food. Next up: buttering toast. Every time I imagine buttered toast, it’s perfect. The bread is golden, never charred. It’s toasted enough to crunch when I bite into it, crispy-gone-soggy as the butter sinks in, but not so toasted that it crumbles. The butter is salted and soft enough to spackle the bread yellow from edge to edge without the knife scratching harshly. Sometimes, it’s finished with crystals of flaky salt or a snowfall of sugar.When we think about food, we also think about anticipation—and expectation. The more glowing a restaurant’s reviews are, the higher our standards become. The more laborious the cooking process is, the more delicious a dish must be. The more we hype something up, the greater the chance that we’ll be let down, and as the meme goes, expectation and reality aren’t always the same. Buttered toast, by comparison, has low stakes, unless perhaps you’re churning your own butter or baking your own bread. I didn’t get into either of those as a pandemic hobby, so to me, it’s just butter and bread.But it is butter and bread. Together, butter and bread subvert everything, becoming both what I expect and better than what I can think up. In my head, I can’t taste the tiny—but crucial—variations between the bites with butter fully absorbed and the bites with butter still unmelted and creamy. In the full real-life 4D experience, I face a conundrum with each bite: Let the salt and slight sweetness linger, or go in for another piece and restart the cycle? This certainly isn’t a question keeping me up at night; I can always toast another slice and make a new, better set of decisions.You might be into the basic toasting-then-buttering. Or you might flip the switch and try buttering-then-toasting (and maybe even buttering again). You might even fry the bread in butter in a pan, though I’d argue that’s fried bread and not buttered toast. As long as butter is on bread, I’m happy, though I tend to lean Team Toast-Then-Butter—why mess with the classic? Similarly, the combination is perfect no matter the ingredients. Value butter on squishy 99-cent loaves satisfies me as much as grass-fed butter on fancy sourdough.In fact, I feel the most affection for a version that might not even really have butter: In my earliest memories, the toast featured something more like margarine, layered on whatever white bread was available in the Philippines in the late ’90s and dusted with a spoonful of white sugar. I like this the most when the sugar doesn’t quite dissolve and embeds itself, still a little grainy, into the swipes of butter; it tastes like the creamed butter and sugar you stick your finger in while making cookies. Back then, toast with butter and sugar was a frequent snack—I couldn’t prepare much else as a barely-five-year-old after all. I now reserve it for rare occasions because I like it best with squishy white bread, which usually gets overridden in my limited storage space by the hefty loaves I prefer for my breakfast-slash-lunch tartines. But every time I make it, I bridge the person I am now with the pudgy bowl-cut kid I used to be. (And no, despite the recommendations, I’ll never use cinnamon sugar—I feel no nostalgia for that.)Buttered toast is safe and predictable, like my frequent choice to rewatch Sex and the City episodes rather than chance a few hours on a buzzy new Netflix series. It’s a backup when I just don’t have it in me to be disappointed, when so much else in life feels up in the air. Predictable, here, means something that’s consistently, unfailingly delicious every time. In an age of endless hype and expectation, buttered toast is a balm against disillusionment and a break, however brief, from the idea that anything could ever let you down.Explore Bon AppétitLifestyleCultureUnderratedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-15", "author": ["Condé Nast", "Bettina Makalintal"]}