{"id": "e71f6c3ec0e79d5f1c3b01a6e6eef3ef", "url": "https://www.bonappetit.com/story/bulgogi-meatloaf-sandwich", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "This Bulgogi Meatloaf Sandwich Is Next-Level Meatloaf | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSay It With Us Now: Bulgogi. Meatloaf. Sandwich.You might even have all the ingredients in your pantry right now.By Chris MoroccoMay 11, 2020FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Pearl JonesFacebookTwitterEmailMeatloaf has never quite risen above its name. It offers comfort and predictability, but rarely fireworks. I mean, think about it: All you do is slap together some eggs and breadcrumbs, pantry stalwarts like ketchup and Worcestershire sauce, some ground meat (meatloaf doesn’t care which kind), and bake it until it falls somewhere between not-raw and not-burnt. No matter what, chances are, it will be pretty good.But isn’t it time for something better? Couldn’t meatloaf be GREAT?Cooking at home has made my pantry work harder than ever, and I’m constantly turning to ingredients that I know will add maximum taste-bud payoff with minimal fuss. Gochugaru, soy sauce, sesame oil, scallions, garlic, and ginger are all in constant rotation right now for exactly that reason. Which then made me ask myself: Aren’t these make up the mouth-wateringly delicious flavors of Bulgogi, the Korean dish of sliced and marinated meat, grilled over fire or seared in a pan? Couldn’t applying those same flavors save meatloaf from its middling reputation?So that’s just what we did: We combined all the ingredients pulled straight from a simple marinade, plus the usual ground meat, eggs, and panko, and made a Bulgogi meatloaf. And it was... good. Like, really good. Like eat-it-cold-from-the-fridge really good.But what made it next-level was taking the thought one step further, and searing a gloriously thick slice of that already-awesome meatloaf and sliding it between two squares of pullman bread slathered with a few swipes of gochujang and a pile of kimchi. It’s spicy and sweet, crispy and juicy, crunchy and tender, faithful and fresh—all at the same time.There you have it: A meatloaf that shakes off its humble roots. And we think it’s pretty great.Get the recipe:Bulgogi Meatloaf SandwichA flavor-packed spicy, sweet, and sour sandwich that takes the idea of meatloaf all the way to the edge.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-11", "author": ["Condé Nast", "Chris Morocco"]}