{"id": "e72486a453be3cadf25955c89f718c7d", "url": "https://www.bonappetit.com/story/cold-soup-recipe", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "This Cold Soup Recipe Is a Summer Game Changer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Cold Ramen Recipe Is a Summer Game ChangerGazpacho, you've got competition.By Amiel StanekMay 10, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole HerriotFacebookTwitterEmailWe held these soup truths to be self-evident: Summertime is no time for a bowl of hot, steaming ramen, and cold soups (lumpy gazpacho, thick, beige vichyssoise) are about as fun as Labor Day weekend traffic.But that all changed earlier this summer when we met chef Shingetoshi “Jack” Nakamura, who schooled us on the brilliant beauty that is—wait for it—cold ramen.Nakamura, the Japanese wunderkind who opened his first ramen spot in Tokyo 17 years ago at the tender age of 22, recently set up shop in NYC's Lower East Side. There, the warmer months are all about chilled miso ramen, a miraculously refreshing (and vegan!) bowl of springy noodles and lightly dressed farmers’ market veg bathed in a frosty, funky-salty-sweet broth. The experience of slurping down a bowl of the stuff is at once entirely different and bizarrely similar to that of tucking into the chef’s signature hot, chicken broth-based torigara ramen. And, as it turns out, that's the point.“The beauty of ramen, what people love about it, is the texture, both of the broth and the noodles,” Nakamura explained. Like any obsessive ramen chef worth his shoyu, he often uses a tool called a refractometer, used for measuring the relative dissolved solids in a liquid, to make sure that all of his broths have just the right consistency. High-quality soy milk provides the ideal platform for a flavorful, richly-textured cold soup. (Nakamura uses a boutique-y Japanese brand that costs upwards of $20 per quart, but we’ve had great results in our test kitchen with nationally-available Silk Unsweetened.)To that, he adds a homemade miso tare—an elaborate combination of funky fermented soy, scallions, ginger, garlic, apple, sake, vinegar, and chile—which transforms the delicate milk into an eyebrow-raisingly complex umami powerhouse. The big-tasting broth gets poured over ramen noodles that have been cooked to an al dente springiness and then shocked in ice water, then the bowl gets crowned with a riot of seasonal veggies dressed lightly in a tingly Sichuan chile paste that change over the course of the summer. “You have to adjust your ingredients with each season,” Nakamura notes. “Right now, I focus on summer ingredients like basil, tomato, and cucumber,” but okra, corn, radishes, and raw tender greens are all fair game.The result, which the chef calls “perfect lunch ramen,” is unlike anything we had ever tasted. And while the recipe is fairly intricate, all of the constituent parts—the miso tare, that addictive Sichuan chile paste—are very stable, meaning they can be doubled or tripled, parked in the fridge, and deployed whenever the mercury spikes and a cold ramen craving hits. And, trust us: It will hit.Get the recipe:Chilled Ramen with Soy Milk and Chili OilBecause nothing will stop us from eating ramen all year long.View RecipeExplore Bon AppétitHealthyishRamenSummerRead MorecookingThese Misos Have Nothing to Do With SoybeansBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-06-27", "author": ["Condé Nast", "Amiel Stanek"]}