{"id": "e726d20882675682a4830d4f95031a9f", "url": "https://www.bonappetit.com/story/epis-seasoning", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "What Is Epis, the Haitian Seasoning Base That Gives the Cuisine Its Serious Flavor? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEpis Is the Seasoning Base That Gives Haitian Food Its OomphHaitians don’t skimp on flavor—or on epis.By Lesley EnstonJanuary 12, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksFacebookTwitterEmailThe art of seasoning is taken seriously in the Caribbean—and Haiti is no exception. Much of the cuisine’s distinctive flavor profile is rooted in one place: epis.Like green seasoning in the English-speaking Caribbean and sofrito in Puerto Rico and the Dominican Republic, epis (“spices” in Haitian Kreyòl) is a flavoring base made of herbs and aromatics that can be found at the root of innumerable dishes, such as poul ak nwa and diri kole ak pwa. These bases, which are common throughout the Caribbean, are thought to have origins both with the indigenous peoples of the islands and enslaved West Africans.In the U.S., it’s common practice to make a large batch of epis to store in the fridge or freezer, especially because blenders and food processors are widely available in the diaspora. But “in Haiti, epis is [made] on an about-to-cook basis,” says chef Nadege Fleurimond of Fleurimond Catering. “It’s a ritual in many households to call the kids to come pile epis (pound the epis) as the adults clean and prep the meats and other cooking essentials.” Today, whipping up a big batch couldn’t be easier as long as you know the basics— what it is and how to use it. (Spoiler: Use it everywhere!)What is epis?There is much debate about what should and should not be included in epis, but there are a few fundamentals: Chopped garlic, parsley, scallions, and thyme are, hands down, a must, and bell peppers, both green and red, are found in most recipes. From there, things get murky. Some cooks consider cloves or Scotch bonnet peppers key, while others, like Chef Fleurimond, consider them optional, preferring epis to be a clean foundation to which other, more distinct flavors can be added later. Some people use cilantro, while others refuse to even acknowledge that as a possibility.In addition to the aromatics and herbs, you’ll need acid, in part for the taste, but also as a preservative. Some cooks use white or apple cider vinegar, while others use lime juice or, like me, a combination of the two. People who are lucky enough to live somewhere with access to them might add sour oranges, which have a unique, slightly bitter taste. A glug of olive oil and you’re good to go.And while batches made at scale for commercial use may require a set recipe, in home kitchens, it’s a different story. Chef Cybille St. Aude-Tate of Honeysuckle Projects has a standard recipe for catering, pop-ups, and selling at the store. But her home bottle knows no rules. “In my opinion, there are two philosophies surrounding epis: the one that says you buy ingredients specifically to make that standard batch and the other that says you use what you have in your fridge to clear out excess or control waste. My home batch is a hybrid of both! If there’s a certain ingredient that isn’t in the standard recipe or something that I have an abundance of, I’ll use it!” This “making do” mentality is the foundation of Caribbean cooking.How do I make epis?Once you’ve gathered all your ingredients, you simply blend them together. Traditionally, this would be made in a pilon (mortar and pestle) but today most of the chefs agree that convenience wins. Add your ingredients into a blender or food processor all at once and whiz away until it’s smooth and relatively loose.How do I use epis?When it comes to how to use epis, there’s much more consensus around the answer: Put it in everything! It’s a traditional marinade for fish, chicken, or beef, but the possibilities don’t stop there. “I add it to soups for depth, sometimes at the start when sweating aromatics and sometimes at the end for a final flavor boost. I purée it with soaked cashews for a Haitian-style green goddess. I also love adding it to stewed or confited vegetables to add an extra level of savoriness,” says chef Gregory Gourdet, whose recipe for diri kole ak pwa is also founded in the seasoning base. Nadege adds hers to hummus and other dips, and Cybille has used it as the base for compound butters to add to steamed clams or grilled oysters, as well as in salad dressings, broths, and condiments like mustard and aioli. At Grandchamps in Bed-Stuy, executive Chef Shawn Brockman uses epis in beer-battered fish, brunch potato hash,  and even egg dishes. Personally, I’ll add epis when I’m feeling too lazy to mince a bunch of seasonings or unsure what flavor direction I’m going. A spoonful mixed into sautéed greens or incorporated into a frittata is a game changer.Once you’ve been indoctrinated into the epis cult, go ahead and make a big old batch. It keeps at least a couple of weeks in the fridge, but I’m not ashamed to say I once found a half-empty jar lurking in the back of my fridge that was easily two months old and it was still good. If you’re being responsible, separate it into portion sizes (ice cube trays are great for this) and stick it in the freezer. You can pop it into your soups and stews just like that, or let it defrost a bit before sautéing it as a base.One key to making epis is to understand there’s no right way. Every household makes it differently. As Haiti has the largest population in the Caribbean, with a hugely diverse geographic landscape, it’s no wonder that there are as many ways to prepare any given dish as there are Haitians.Get the recipes!Poul Ak Nwa (Chicken With Cashews)This traditional Haitian chicken stew is packed with flavor thanks to the mainstay spice blend known as epis.View RecipeDiri Kole ak PwaEpis, the punchy, peppery Haitian seasoning, gives this iconic dish its complex flavor profile.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-12", "author": ["Condé Nast", "Lesley Enston"]}