{"id": "e72c9f70f9e8904c7bdbff78b47de493", "url": "https://www.bonappetit.com/story/make-ahead-oatmeal", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "I Never Loved Healthy Oatmeal Recipes Until I Started Making It Like This | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Never Loved Oatmeal Until I Started Making It Like ThisA make-ahead method for a week’s worth of breakfasts.By Christina ChaeySeptember 26, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the newsletter, you’ll get the scoop before everyone else.Dear Healthyish friends,In college I had a roommate who ate oatmeal with raisins for breakfast every morning without fail. “Don’t you ever get bored?!” I would ask her quizzically, not able to compute how someone could voluntarily choose to eat the same thing every day when there were fancy toasts and yogurt bowls and a whole world of eggs to choose from. She never did get bored—she really, genuinely loved her morning oats.I didn’t know about “good oatmeal” (i.e., not the kind in the small paper packet) until years later when I was in my late 20s working as a line cook and had to make huge quantities of it for breakfast-themed staff meals. It turns out the secret to rich, creamy, totally decadent oatmeal isn’t complicated: Anything tastes good if you cook it with obscene amounts of whole milk and brown sugar.But for a cozy, fall-appropriate work-from-home breakfast that’s not going to make me want to take a dairy nap at 8:30 a.m., I rely on an oat-cooking method that yields similarly velvety results using water and fiber-rich steel-cut oats, which are made by processing whole oat groats (which look a bit like grains of farro or spelt) into small pellets.I keep ’em neutral so they can go sweet—like this banana-tahini number—or savory. Options!I like to cook enough oats to yield a few days’ worth of breakfasts. I keep a tub of cooked oatmeal in the fridge, then warm up small batches in the mornings with my sweet or savory toppings of choice (more on that below). The night before, soak 1 cup of steel-cut oats in a bowl of water; this cuts down on their cook time, similar to when making dried beans. The next morning, drain the oats then add them to a medium saucepan with four to five cups of fresh water and a pinch of kosher salt and bring the mixture to a boil over medium-high heat. Reduce heat to a bare simmer so you can only see a handful of bubbles gently burbling here and there. Cook the oatmeal, stirring occasionally, until it gets quite thick and it starts sticking to the bottom of the pot, about 20 to 30 minutes. At this point, the oatmeal will look like oatmeal, and you will thus be tempted to stop cooking it because it’s been 30 minutes already and you’ve got things to do. Taste a few—are they transcendently creamy, almost porridge-like, with just a hint of bite? If not, keep cooking over low, and keep stirring. If they seem too thick and dry, add water by the quarter-cupful as you go, just enough to keep them from sticking to the bottom of the pot too much.Once the oats are sufficiently tender, you can eat them immediately or let them cool and then transfer to an airtight container and refrigerate. Because I never know whether I’ll wake up craving something salty or sweet, I like to keep my oatmeal neutral, then layer on flavors. Here are two riffs that have been in my recent rotation:Savory Oats With Butter, Soy, and a Poached EggStir a pat of butter and a bit of soy sauce into the cooked oats to taste, then top with a poached egg, crumbled roasted seaweed, toasted sesame seeds, sliced scallions, and a drizzle of chile crisp.Maple-Pear Oats With Lots of SeedsChop up a pear or apple and add it to a small saucepan with a couple of tablespoons of water, a teaspoon of pure maple syrup, and a sprinkling of warm spices (I love cinnamon, cardamom, and a grating of nutmeg). Bring the mixture to a boil, then reduce the heat to low and cook the fruit, covered, until it’s soft and sweet and the water has evaporated; this should only take a few minutes. Add cooked steel-cut oats and a splash of your favorite milk (I use homemade almond) and gently heat up the mixture until warmed through. Top with toasted walnuts, all the seeds (e.g., hemp, flax, chia), and more maple syrup if desired.Stay cozy,Christina ChaeyAssociate editorExplore Bon AppétitHealthyishBreakfastOatmealWhat's Chaey Cooking?essayRead MoreLifestyleMake Yourself an Elaborate SandwichBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-26", "author": ["Condé Nast", "Christina Chaey"]}