{"id": "e7347b53644cbae552ba583c616a6b30", "url": "https://www.bonappetit.com/recipe/cheesy-rice-porridge-with-greens", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Cheesy Rice Porridge With Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueCheesy Rice Porridge With GreensBy Abra BerensSeptember 14, 20214.2(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Frances BoswellEmailPinterestPrintEmailPinterestPrintPure cold-weather comfort in a bowl, this easy, cheesy rice porridge from chef Abra Berens’s new grain-and-bean-focused cookbook, Grist, has just five ingredients. For a thicker, creamier porridge, feel free to cook the rice for a few extra minutes until it is beginning to fall apart. ​​To make it vegetarian, use vegetable broth or water in place of chicken broth.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Saucepan$39 At AmazonBox Grater$13 At AmazonLadle$27 At AmazonMesh Sieve$13 At AmazonIngredients4 Servings6cups low-sodium chicken broth or vegetable brothKosher salt½cup jasmine rice, rinsed until water runs almost clear2oz. sharp cheddar2bunches kale, Swiss chard, spinach, or escarole, ribs and stems removed if needed, leaves cut into thick stripsChili oil (for serving)PreparationStep 1Bring broth and a few pinches of salt to a boil in a medium saucepan. Add rice and cook until tender, 15–20 minutes. Remove from heat.Step 2Grate cheese on the large holes of a box grater directly into porridge and stir until cheese is melted (porridge will thicken a little). Add kale and stir until slightly wilted.Step 3Ladle porridge into bowls and drizzle with chili oil.Reprinted from Grist: A Practical Guide to Cooking Grains, Beans, Seeds, and Legumes by Abra Berens with permission by Chronicle Books, 2021.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Cheesy Rice Porridge With Greens?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleI  think someone should check the rice:broth ratio. I used 2 cups of broth to 1/2 cup rice and it was still soupy. Best to leave the cheese for the cheese board because the chili oil was overpowering and I didn’t get any of the cheesy taste ( I admit I may have added too much.) KenBoquete Panamá 1/20/2022I made it with vegetable broth because that is what I had in the pantry and recipe was fabulous. I’ve passed it on to several friends and family members\n\nIt was easy, economical and delicious. I will make it againAnonymousOhio10/26/2021This looks absolutely delicious!!! SondraPennsylvania 10/12/2021I tweaked a few things, but it was delicious. I used 12 cups of mushroom stock, 1 cup of same rice as the recipe, 1 bunch of kale, two big handfuls of spinach, 8oz total of baby bell, shitaki and oyster mushrooms, same amount of extra sharp cheddar, and the chili oil. Came out great!Kangaroo Albany NY10/12/2021I really liked this. I reduced broth to 4 cups and added some minced garlic to it. I used one bunch of chard. Came out close to risotto without all the work.AnonymousClearwater Florida 10/1/2021Good base recipe. I sautéed the chard (one bunch) in a little oil with about 20 cloves of garlic, and a splash of white wine before throwing it in the broth. Vicious California 10/1/2021Needed some mods but it’s a very cozy, quick, simple dish that we enjoyed for a weeknight dinner. First, the greens ratio is WAY off. We did about 3/4 bunch of kale and called it because there were so many greens in there relative to rice and broth. Topped with Momofuku chili crunch which brought a much needed kick. Will make again, easy weeknight healthy dish.Andrea9/30/2021this dish was terrible. the portions seem way off and was basically wet salad. i am a loyal BA reader/subscriber, but this was not it!Renatta Gorski9/29/2021This dish is nice and easy comfort food. I added chinese five spice and shrimp to amp it up a bit or else it felt a little underwhelming, and also used szechuan chilly pepper oil to tie everything together. Super quick, good week day recipe. Marie Montreal9/21/2021Explore Bon AppétitMainDinnerVegetarianGluten-FreeHealthyishNut-Free5 Ingredients or FewerEasyOne-Pot MealsQuickWeeknight MealsPorridgeRiceRice & GrainsCheeseCheddarKaleLeafy GreensVegetableSimmerSwiss ChardSpinachEscaroleChicoryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Abra Berens"]}