{"id": "e7412014217cc083d029c7c8c73e5b54", "url": "https://www.bonappetit.com/story/how-to-make-brigadeiros", "year": 2020.0, "month": 12.0, "day": 2.0, "content": "Chocolate Brigadeiros Are Rich, Fudgy Candies Made From Condensed Milk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBrigadeiros Are My Rich, Fudgy Holiday Gift of ChoiceThey look like truffles, but they're smoother, chewier, and more voluptuous.By Leticia Moreinos SchwartzDecember 9, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Micah MortonFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.When I give a box of brigadeiros as a holiday gift, my friends inevitably ask me if they’re truffles. But while brigadeiros may look like truffles, they’re softer, silkier, chewier, and more voluptuous. I always joke that they have a very Brazilian personality.Brigadeiros go back decades in Brazil. The name comes from Eduardo Gomes, an early 20th-century Brazilian political and air force brigadier. Sweetened condensed milk became popular in Brazil in the 1940s when, according to Atlas Obscura, the war made ingredients previously used in desserts, like fruits and nuts, harder to come by—these candies were created by combining this new sweet milk with chocolate powder. Like many iconic foods, the brigadeiro has a disputed origin story, but one prominent tale is that women sold these candies at Gomes’ rallies for president in 1945 and called them “brigadeiros” in his honor. (Women were critical to Gomes’s campaign efforts because he ran in the first national election in which at least some women were allowed to vote.) While Gomes was defeated, the confection named in his honor is now a standard in cafés, snack bars, and restaurants throughout the country, with fancified flavors—like churro and caipirinha—gaining popularity.Photo by Laura Murray, Food Styling by Micah MortonThe traditional recipe is quick and easy. The only tricky part is knowing how far to cook it: Undercook it and it won’t be stiff enough to roll; overcook it and it will be too chewy, like a caramel.Here’s how to do it: Pour 2 cans sweetened condensed milk in a medium stainless steel saucepan. Add 4 Tbsp. unsalted butter and 4 Tbsp. heavy cream. Bring to a boil over medium heat.Once boiling, add 3 ounces (90 grams) bittersweet chocolate (72% or 85%) and 2 tsp. unsweetened cocoa powder. Using a whisk, mix well to make sure the chocolate is melted and the cocoa powder is dissolved. Reduce the heat to the lowest setting and cook, whisking constantly, until it reaches the consistency of a dense fudge batter, about 8 to 10 minutes. If you swirl the pan around, it should hold together, almost like a pâte à choux, where the dough balls together. It’s very important to use low heat and stir constantly; otherwise, the bottom of the pan will burn before the consistency of the fudge is correct.Slide the mixture into a flat baking dish, without scraping any of the sticky film on the bottom of the pan. Cool to room temperature, wrap well, and chill completely in the fridge for at least 3 hours, preferably overnight. You can make the fudge up to 5 days ahead of rolling.Then, when you’re ready to shape, the fun begins: Call any children in the house and scrunch up your sleeves. Place 1 cup chocolate sprinkles (I like Guittard, India Tree, and Callebaut; look for sprinkles made with real chocolate and stay away from brands that contain vegetable fat) in a tray or baking dish. Scoop the mixture by the teaspoon and use your hands to roll each into a little ball, about ¾\" in diameter. Drop them into the sprinkles and roll to cover the entire ball. Store in an airtight plastic container in the fridge; once you roll them into little balls, the brigadeiro will start crystallizing within 2–3 days. Whenever I have to make brigadeiros for a party, I make the batch a week ahead but shape them the day before. Let them come to room temperature before serving.Over the years, I've rolled hundreds of thousands of brigadeiros in classes, parties, events, and for holidays gifts. But my favorite people to roll brigadeiros with are my children. We make an assembly line: One person forms the balls, one person rolls them in sprinkles, and one person places them on a little paper candy cup. Together we work like a machine. Perhaps Gomes himself would be proud.Leticia Moreinos Schwartz is a chef and cookbook author based in Connecticut.Explore Bon AppétitChocolateDessertIt's That SimpleRead MorecookingPlátanos Maduros Horneados Are Caramelized Plantains Without the FryingBy Melissa PaniaguaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-09", "author": ["Condé Nast", "Leticia Moreinos Schwartz"]}