{"id": "e742ca8c239c716518049452e3954b9f", "url": "https://www.bonappetit.com/story/haw-flakes", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Haw Flakes Are the Childhood Snack I Still Crave | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHaw Flakes Are the Childhood Snack I Still CraveThey’re like a cross between a Fruit Roll-Up and a Necco wafer in the best way.By MacKenzie Chung FeganApril 2, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.At my elementary school, the Chinese-American kids  all had their lunchbox treats of choice—White Rabbits, ginger chews, those shot-glass-size plastic cups of lychee jelly. Haw Flakes were mine. They’re thin, small, pink discs made from hawthorn fruit, which is sometimes used as a digestive aid in Chinese medicine. Think of them like a cross between a Fruit Roll-Up and a Necco wafer. They taste sort of like membrillo, the Spanish quince paste often served with cheese, and each thin disc packs a wallop of extremely craveable jammy-fruity-chewy-crumbliness.The process of eating a roll of Haw Flakes is half the fun. They come in stacks of 15 or so, like petite rolls of quarters. (One legend has it that Bad Kids successfully used them as a substitute for quarters at the arcade.) Some of my peers opted to eat their Haw Flakes in multiples, popping several stuck-together discs into their mouths at one time. But I chose to peel each disc off from the stack one by one, watching my tower slowly dwindle.My tastes have matured since my school lunch days. There is no longer room for processed cheese in my life, and look, Mom, I eat fruit by choice! But as I write this, I am eating a roll of Haw Flakes, spiraling the wrapper down the stack like a slow, sugary strip tease. They are the perfect mid-afternoon snack—the right amount of sweet, the right amount of chewy, fun to eat, and the ideal size to slip in your pocket for a walk to the park and back. I stand by them. If you like fruit leather, I think you’ll like them as much as I do—but if you don’t, you can always use them to feed the parking meter.Buy it: Haw Flakes, $2 for 10 rolls on AmazonAll products featured on bonappetit.com are independently selected by our editors. If you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRead MorecultureAll Hail BjornQorn, the (Still) Reigning King of BA’s Office Snack TableBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-02", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}