{"id": "e744cb456891a5adfea133bd8b4ab415", "url": "https://www.bonappetit.com/story/what-are-preserved-lemons", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "What Are Preserved Lemons And Why Are They in Soo Many BA Recipes? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Are Preserved Lemons and Why Are They in So Many BA Recipes?ICYMI, we sort of have a thing for preserved lemons.By Antara SinhaFebruary 25, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah MortonFacebookTwitterEmailIf you’re the kind of person who’s always reaching for more lemon juice and more salt to properly season your food, you probably love preserved lemons (and as someone with a five-lemon minimum on each grocery run, I commiserate). Preserved lemons win top marks in the categories of acidity, salinity, and tang, and fresh lemons (no offense, still love you!) just don’t compare.“It’s like a lemon on steroids,” associate food editor Zaynab Issa says. Savory, bright, and citrusy, preserved lemons have an extra oomph and complexity that can’t be replicated by fresh fruit. Here’s how to cook with them, how to buy them, and why you should make them a pantry staple—if they aren’t already.What are preserved lemons?Preserved lemons are lemons (usually whole, split, or quartered) that have been packed in salt and brined in water or additional lemon juice—essentially, they’re pickled lemons. Especially common in Middle Eastern, North African, and South Asian cooking, they add a savory tang to everything from stews to braises, dressings, and sauces. Texture-wise, the lemons break down in the brining process—the rind and pith soften, becoming squeaky, edible, and ready to fall apart with just a little heat or pressure.Preserved LemonsIf you can find Meyer lemons, use them. Their thinner skin has very little bitterness.View Recipe“They have a depth of flavor that is salty and savory and complex; think of the difference between a cucumber and a pickle,” writes Sahadi’s co-owner Christine Sahadi Whelan in Flavors of the Sun. “Unlike sumac or lemon juice, even finely minced preserved lemon retains its own character,” which Sahadi Whelan identifies as funky earthiness. “Rather than blending in, [it announces] itself with a burst of sharp flavor.”How do you use preserved lemons?While raw lemon peel and pith can be bitter, preserved lemons have a much more mellow flavor—yes, the peel is edible and there’s no tedious extra step of peeling or removing it. That means you can drop half a preserved lemon into a braise and let it perfume the whole dish.The flesh of lemons that are cut before they’re preserved will absorb more salt than those that are packed whole. In order to control for salinity, many recipes will call for discarding the super-salty flesh and using only the rind, or for rinsing the preserved lemon before cooking with it. Both measures can help you to better control the seasoning of your dish.If a recipe calls for paste, it’s as simple as taking whole preserved lemons, removing the seeds, and blitzing them in a food processor or blender until you achieve uniform consistency.Where should you use preserved lemons?Add finely chopped preserved lemons to a hearty dish that needs a hit of brightness, like Issa’s Red Lentil Soup With Preserved Lemon and Crispy Garlic. Blitz them into a tangy-tart salad dressing to pour over greens and chicories. Mix the paste with harissa and use it to marinate a leg of lamb that’s served with fennel and herbs. Purée it with creamy dairy, like labneh, feta, or ricotta. Mash it with peas, incorporate it into pasta sauce, or toss it with roasted vegetables. “You can add it to anything and get a more dramatic lemon flavor,” says Issa. Sahadi Whelan calls them a “one-and-done way to season and brighten just about anything bland” (coming for you, beans and grains).If you’re looking for some recipe inspiration, Sahadi Whelan recommends pairing preserved lemons with fish—\"blend them into a compound butter and slip a pat onto a piece of broiled or grilled fish.” She advises that preserved lemons also go well with green olives, “as both are cured and salty, and the citrus flavor mitigates the oiliness of the olives.\" Whatever you choose to cook, tread lightly: “It’s pretty potent in flavor,” says Issa, who recommends starting off by adding half of a preserved lemon to soup or a braise to begin, and then adjusting for taste afterward by adding more preserved lemon as needed.You can even take the more unconventional route and make dessert: Add puréed preserved lemons to Preserved Lemon-Tea Cake for a subtle hint of brininess that adds an interesting depth to a classic loaf.Or don’t cook or bake with them at all. “Just pull the lemons out of your fridge, and use them as a condiment,” says Issa, who recommends serving thinly sliced preserved lemons on a cheeseboard, tucked in sandwiches, or splayed atop toast or pasta.Where can you buy preserved lemons?You can make your own preserved lemons (budget two weeks!), or you can look for them at Middle Eastern or South Asian grocery stores, usually in glass jars, by the pickles and preserved foods. Your supermarket may also carry them in the international aisle, or you can order them online from brands such as NY Shuk or Mina.“Be choosy about the quality of the prepared ones you buy,” writes Sahani Whelan, who prefers Moroccan-sourced preserved lemons. “Look for firm, well-shaped lemons that are not mushy or mashed too tightly into their jars.”Jars of preserved lemons can keep for months in the refrigerator and may develop a deeper pickled flavor and softer texture over time. “Shake the jar now and then to keep the lemons moist; otherwise the salt may rise to the top and form a crust,” says Sahadi Whelan. If you do find that the salt is crusting over, just scrape it off and you can continue to use it.While you can buy paste, whole lemons are more versatile, as they can be minced, chopped puréed, or left whole as needed. Issa recommends Meyer lemon preserved lemons, which she says are sweeter and more floral.Next time you find yourself stocking up on way too many lemons—yes, this is a self-roast—reach for preserved lemons for that extra citrusy boost.Pucker upPreserved-Lemon Tea CakePreserved lemons rein in the sweetness in this plush olive-oil-based loaf.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-25", "author": ["Condé Nast", "Antara Sinha"]}