{"id": "e745dc87c0405edd6da748f3a28bea02", "url": "https://www.bonappetit.com/story/nduja-spreadable-sausage", "year": 2018.0, "month": 8.0, "day": 5.0, "content": "Why We Love La Quercia's Nduja, a Spicy Spreadable Sausage | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNduja Is the Spicy Sausage You Can and Should Be Spreading Like ButterPractically every chef we know is obsessed with nduja—and you should be, too.By Chris MoroccoAugust 30, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I recently went to L.A. to spend a few days cooking with chef David Nayfield of Che Fico, our #7 Best New Restaurant of 2018. For his Spaghetti with Lobster Pomodoro, Nayfield makes his own nduja (that's en-DOO-yah), a spicy and funky spreadable salumi we've been spotting at restaurants all over the country. He emulsifies the spicy sausage right into the pasta sauce to create a delicious union between lobster and tomato sauce.You know what makes spicy sausage even better? Carbs and lobster.\nPhoto by Alex LauBefore Nayfield started making nduja in-house he used La Quercia's version, so when I got back to New York I tried the brand's nduja several times before calling up founder Herb Eckhouse to find out just what makes it so delicious. One big clue was right on the packaging, which says \"Spicy Prosciutto Spread.\" In the course of La Quercia’s prosciutto and speck production, there are some tasty meat and fat trimmings that never make it into the final packaging (presumably whoever is running the machine can’t eat all of it, though I am personally willing to test this theory).Eckhouse realized that by combining these trimmings with chiles he could create a product that takes advantage of all of the flavor accumulated in the prosciutto and speck over the course of a year of gentle aging. This results in an nduja that is buttery smooth with bottomless depth and an insistent prickle of heat from a blend of three types of dried ground New Mexican chiles. It's certainly not the way nduja is traditionally made in Calabria and elsewhere (where it is more likely to start with raw meat, salt, chiles, and a lactic culture, giving it a tangy funk from undergoing fermentation) but La Quercia’s stands out because of the quality of everything that goes into it.Tuck some nduja into a spicy Italian breakfast calzone with cheese and a runny egg.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiOnce you get your hands on some nduja, chances are you will find all kinds of ways to use it. Cured pork and seafood belong together, as in this squid ink pasta with shrimp. I like to spread it on toast or on cooked flatbreads like this one. Blend a small amount right into a vinaigrette for dressing vegetables. Or simply fry a bit in olive oil with onions and garlic as a base for nearly anything. The brilliance of nduja is that while you can certainly eat a lot of it very quickly (and nobody would blame you) it is so packed with flavor that even a small amount can go a long way.Photo by Chelsea Kyle La Quercia 'Nduja (Pack of 4)$28 at AmazonExplore Bon AppétitMeatSausageRead Morebest-new-restaurantsChe Fico in San Francisco Is the No. 7 Best New Restaurant in America 2018By Julia KramercookingAn Antipasto Salad Recipe for People Craving Salami SaladBy Aliza AbarbanelcookingKnow the Difference Between Prosciutto, Speck, and All the HamsBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-30", "author": ["Condé Nast", "Chris Morocco"]}