{"id": "e751f0b08767ef458de4cc7e386218d5", "url": "https://www.bonappetit.com/story/super-bowl-party-rules", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "There Are Rules to a Great Super Bowl Party. Rules, People! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere Are Rules to a Great Super Bowl Party. Rules, People!It’s all about cheesy dips and meaty sandwiches.By Adam RapoportJanuary 29, 2019FacebookTwitterEmailLaura MurrayFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he’s been cooking, restaurants he’s been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.For those of us in food media, it’s hard to say whether the Super Bowl is our Thanksgiving or if Thanksgiving is our Super Bowl. Either way, I know that at 6:30 p.m. EST this Sunday, I will be sitting down to far more food and drink than any self-respecting dad with a day job and early-morning school run should be indulging in.I also know, after many years, that like any questionably officiated NFL game, there are rules to a Super Bowl party, some of which should even be enforced. Here are mine:Photo by Alex LauDrinksBeer and wine. Period. I am too old to pound cocktails on a Sunday night. (Remember the part about the day job and the school run?) However, I know my guests will expect something other than the cans of Budweiser I rely on, so I will heed the advice of Alex Delany and stock up on the increasingly easy-to-drink craft beer varietals that come in those cool, smartly designed tall boys. And speaking of easy to drink, I’ll also jam my cooler full with some Marissa Ross–approved pét-nats, complete with pop-off crown tops.Speaking of coolers. You should absolutely lug your Yeti or Coleman in from the garage, place a beach towel beneath it, load it up with ice and put it to good use.Also, who am I kidding? I do have younger friends, and friends without day jobs. So, about that cocktail. This year, as I yammer on about on Wednesday’s upcoming Super Bowl-themed Bon Appétit Foodcast, I’m thinking of a DIY paloma bar: a pitcher of freshly squeezed grapefruit juice (it’s citrus season, remember?), a bottle of quality silver tequila, a bucket of ice, crisp seltzer, and lime wedges. Okay, I’ll have one.Want this letter before it hits the website? Sign up for our newsletter!Alex LauAppetizersThere will be dips. Lots of dips. We have a bazillion recipes, but I particularly dig our Slow-Roasted Onion Dip, our Creamy Kimchi Dip, and because it’s not the Super Bowl without copious amounts of molten cheese, the world-famous Bob Armstrong Chile con Queso. I’ll slice up a bunch of fennel, some radishes, and whatever else looks good and set those out with some good tortilla chips and potato chips. (While I’m generally an Utz loyalist, I will admit that you need a sturdy chip when dip is in the equation, so I will defer to Cape Cod kettle chips in this instance.)Photo by Alex LauMain courseA) Halftime is dinner time. B) Once the last note of the Star Spangled Banner is sung, I’m done cooking. So, in the interest of getting things done ahead of time...I am all about the Italian hero bar, which I wrote about a few weeks ago. Set out the thinly shaved cold cuts, shredded iceberg (a.k.a. shrettuce), pickled red onions, Calabrian chili spread, oil and vin, dried oregano, mayonnaise (deal with it, all you mayo-haters), and cottony soft hero rolls. And let people have at it. You can get the actual recipe here.On a similar note, I’m also considering getting started a day ahead and making Basically’s Sriracha-Braised Brisket Sandwiches. And then rewarming it and shredding it and setting it out with potato rolls and homemade coleslaw for DIY sandwiches. Hard to argue with.Or, speaking of the podcast, maybe I’ll run back last year’s Hail Mary of an idea, the Bo Ssam-Style Pulled Pork Sandwiches, perhaps the greatest sandwich ever conceived in the halls of BA.Man, quite the playbook we’ve got coming together.Photo by Chelsie Craig, food styling by Anna BillingskogDessertDessert? Seriously? We’re all adults here. Do we really need dessert? And if you’re on the east coast, shouldn’t your kids be home and in bed by the second half?The Important StuffThe over-under, as of today, is set at 56.5 points. I’m betting the under. I think Aaron Donald and Ndamukong Suh are going to get to Brady. And I think Belichick will figure out a way to stymie Goff. So, yeah, bet the under. You’re welcome!Get the recipes:PalomaSlow-Roasted Onion DipCreamy Kimchi DipBob Armstrong Chile con QuesoParty-Ready Italian HerosSriracha-Braised Brisket SandwichesClassic ColeslawBo Ssam-Style Pulled Pork SandwichesExplore Bon AppétitSuper BowlAdam NewsletterRead MorecookingThese Chile-Chicken Nachos Take Every Component SeriouslyBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-29", "author": ["Condé Nast", "Adam Rapoport"]}