{"id": "e75111269d4377efa434fd4a9882cbfb", "url": "https://www.bonappetit.com/story/olivieri-1882-colombe-easter-cake", "year": 2021.0, "month": 3.0, "day": 5.0, "content": "Olivieri 1882’s Colombe Easter Cakes Are Feather Light and Not Too Sweet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Only Easter Treat I Have Eyes for Is This Italian CakeColombe are feather light and not too sweet.By MacKenzie Chung FeganMarch 29, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Easter treats don’t do it for me. Marshmallow Peeps are too sweet. Ditto Cadbury creme eggs, which, to make matters worse, are impossible to eat without getting a sticky coating of “creme” on everything within reach. Hold the hot cross buns, please. I’ll save my stomach space for quiche and lamb.But this year I had my first colomba, an Italian yeasted cake that makes an appearance around Easter, and now there will be dessert on my Easter table forevermore. A cross between a bread and a cake, a classic colomba gives off a heady scent of floral orange the moment you unwrap it and sometimes features sticky morsels of candied orange throughout. The bright yellow, yolk-rich loaf pulls apart almost like cotton candy, and it dissolves on your tongue almost as quickly.If this is sounding a lot like panettone, that’s because colombe are made using the same painstaking technique. The feather-light dough will be familiar to panettone fans, but there are some differences. Colombe are traditionally topped with pearl sugar and roasted almonds, as opposed to a panettone’s unadorned dome. Panettoni are usually studded with candied orange and raisins, but raisin-haters rejoice—classic colombe are raisin-free. A loaf of panettone resembles a supersized muffin, whereas “colomba” means dove in Italian, and if you squint the loaf kind of resembles the shape of a bird in flight. But both are airy, not too sweet, and perfect accompanied by a morning coffee or an evening Averna.You can find colombe at your local Italian bakery or high-end department stores, but Olivieri 1882 makes a version that I’ll be thinking about from now until next Easter. This sixth-generation bakery, located between Vincenza and Verona, has been producing all manner of cakes and breads since—you guessed it—1882. You can see flecks of vanilla bean throughout the dough of their classic colomba, which is flavored with orange paste and acacia honey. For non-traditionalists, Olivieri 1882 also offers colombe featuring apricot and salted caramel, chocolate chunks, and a show-stopping loaf with white chocolate and candied berries. It’s certainly more expensive than a colomba you’d get at a neighborhood bakery, but at over a pound and a half, it’s a generously sized special occasion treat.I recommend saving a chunk of your colomba to make the absolute best French toast or bread pudding. But if you’re sharing the loaf with your family, my guess is it’ll be gone by Easter Monday—something no one has ever said about Peeps.Photo by Emma FishmanClassic Colomba Cake$70 at Olivieri 1882Explore Bon AppétitShoppingHighly RecommendEasterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-29", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}