{"id": "e7524a64e486c0fe3941e8f18abda331", "url": "https://www.bonappetit.com/story/shrimp-memes-207poundsofshrimp-instagram", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Happiness Is This Niche Shrimp Meme Account | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHappiness Is This Niche Shrimp Meme Account207poundsofshrimp, a meme account dedicated to shrimp, is one of the best things on the Internet right now. Here are 10 of the best shrimp memes yet.By Rachel Karten and Emily SchultzJuly 12, 2018FacebookTwitterEmailFacebookTwitterEmailWelcome to Food on the Internet! A column from Rachel Karten and Emily Schultz, BA’s social media team, dedicated to all the weird things we see while scrolling, double-tapping, and retweeting.“Shrimp memes 24/7,” the Instagram bio reads. 214 posts. 2,333 followers. 83 following. Frequent use of #iodinepoisoningchallenge and #shrimp. This is @207poundsofshrimp.We found this meme account the way most people find meme accounts these days: in our DMs. A few months ago, Basically editor Amiel Stanek sent a @207poundsofshrimp post to Memey McMemerstien, a group DM with a few of our meme-loving co-workers. We laughed at the post and then clicked over to the account to investigate. What we saw stunned us. A singular meme about shrimp? Okay, sure. An entire meme account dedicated to the swimming crustacean? This  🍤 must 🍤be 🍤 for 🍤 true 🍤 scampi 🍤 fans 🍤 only.But unlike how, say, the account @throwbackmachine is niche in that it appeals to people who miss Beanie Babies or how @barstoolsports appeals to men who wear Sperry Top-Siders, @207poundsofshrimp isn’t necessarily for people who order shrimp all the time. It represents something bigger. (Stick with us.) @207poundsofshrimp is the perfect parody of meme culture on Instagram. It turns the idea of a single-topic meme account on its head and applies all of the most popular tropes to the EXTREMELY focused topic of...shrimp. That meme you just “liked” on @thefatjewish's page? There's probably a shrimp-ified version on @207poundsofshrimp. Which is why we immediately hit “follow.”Here, friends and shrimp lovers, are 10 of our favorite posts:Instagram contentThis content can also be viewed on the site it originates from.Emily Schultz: I really like the watermark placement. Also the Meghan Markle memes will never get old to me because no, my mans is not the Prince of England.Rachel Karten: The fact that #iodinepoisoningchallenge is used right next to #royalwedding is a very important part of this meme. This is also a good time to address the name of this account. 207 pounds of shrimp is approximately the amount that will give you iodine poisoning. Dark!*Editor’s note: Rachel and Emily have both never been to Red Lobster.Instagram contentThis content can also be viewed on the site it originates from.ES: Aside from Room Raiders or NEXT!, Pimp My Ride was my favorite MTV show from the early 2000s. I have a soft spot in my heart for Xhibit. And memes. And shrimp.RK: Someone once asked for a chocolate fountain in their trunk on Pimp My Ride, so I actually feel like this one is plausible. Would drive.Instagram contentThis content can also be viewed on the site it originates from.ES: This is my favorite post. This is my favorite meme format. It never gets old. Every meme in this style is the dad dissing the son about where he was conceived. Kinda rules. I’m chuckling to myself silently as I write this.RK: I had to ask Emily to explain this one to me. Which is probably an HR violation of some sort.Instagram contentThis content can also be viewed on the site it originates from.ES: The car salesman meme is everywhere in the black hole that we call the Internet right now. It’s a car salesman trying to sell you a crappy car saying, “This car can fit so much [whatever you may seemingly like] in here,” and obviously you will fill it with shrimp. But 207 takes the car out of the equation, which brings this meme to an entire different solar system.RK: Unlike everything else in life, the crappier a meme looks, the better. “Ofcolon” is essentially one word here and reads like it’s a new character on The Handmaid’s Tale.Instagram contentThis content can also be viewed on the site it originates from.RK: Guys! This is the cover art for a very real song that was written in 1924. The chorus begins with, “Do shrimps make good mothers, yes they do. Have they lots of lovers fond and true.” Was this song the ORIGINAL shrimp meme?ES: I’m sorry, WHAT?Instagram contentThis content can also be viewed on the site it originates from.RK: Emily Slacked me “is this dwayne the rock johnson” along with this link. Yeah, it is. He’s the best. Also shout out to @myinstagrow for commenting on this post: “What’s your favorite book on business?” Well, since you asked nicely, it’s this.ES: UNPOPULAR OPINION, I DO NOT LIKE DWAYNE “THE ROCK” JOHNSON. So when I saw this I knew I had to include it to stir up some controversy. That’s all. Bye.Instagram contentThis content can also be viewed on the site it originates from.RK: What is “A small child’s shrimp” though?ES: Are there certain McDonalds that sell shrimp?Instagram contentThis content can also be viewed on the site it originates from.RK: The Office and @207poundsofshrimp is the best collab since Eminem and Dido. Don’t @ me.ES: I really want 207 to do something with the still of Michael Scott in the convertible saying “It’s Britney, Bitch”. Or where Kevin drops the chili, but with shrimp.Instagram contentThis content can also be viewed on the site it originates from.RK: In the comments, @brycemotch tags friend @missjessica_612 and writes “better be following this MF SHRIMP MEME PAGE.” Hell yeah, only-posts-photos-of-cars-Bryce.ES: This one combines two good memes, AKA the bus driver kiss one (shrimp from strangers > kisses from strangers) and the Hotline Bling one. Two shrimp memes for the price of one. Hell yeah.Instagram contentThis content can also be viewed on the site it originates from.RK: This meme got me thinking: Is there a legal cutoff? Well, six years ago an important question was asked on Reddit: “How much shrimp would I have to eat at Red Lobster’s ‘Endless Shrimp for $15.99’ promotion to make it a net financial loss for the restaurant?” One person replied, “My friend who works there says the record he witnessed was 782 shrimp. The guys also there for 5.5 hours.” Wait, was that customer...207POUNDSOFSHRIMP, THE EARLY WORK?!ES: The Internet is so good. Thank you, Amiel, for finding this account.UhhhhExplore Bon AppétitInstagramShrimpTrends + NewsFood on the InternetRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-12", "author": ["Condé Nast", "Rachel Karten", "Emily Schultz"]}