{"id": "e7571af9e4dd5af28134a4d9aad0c58a", "url": "https://www.bonappetit.com/story/turnips-better-than-carrots-prove-me-wrong", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "Turnips > Carrots: Prove Me Wrong | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTurnips > Carrots: Prove Me WrongSoggy, lifeless cooked carrots can stay in the dumpster fire that was 2018—it's the turnip's time to shine.By Molly BazDecember 18, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailYou know you work at a food magazine when the extremely hot topic of conversation at 4 p.m. on a Tuesday involves the relative merits of...the turnip. Sound dull? Trust me: It was not. But let me back it up a step and explain how this all began. Tasked with developing a recipe for a weeknight rotisserie chicken pot pie, I had to dig deep, look into my heart, and ask myself, “What makes a pot pie a pot pie? What elements of the pot pie are non-negotiable, and which are begging to be improved upon?” (Yes, these are the kinds of questions that keep me up at night.)I’ll tell you what was the first thing to go: sad, soggy, lifeless cooked carrots. Forgive me if you disagree, but I’d be happy if I never saw a cooked carrot again in my life. What they lack in texture, they rarely make up for in flavor. They’re sweet-ish, I guess? I don’t know, I’ll leave the sweetness to a vegetable that’s more worth my while: the turnip. They’re supremely crunchy with a slight radish-y kick of heat when raw, yet pleasantly sweet with a very appealing juicy-yet-firm texture when cooked. Both things that carrots do not have. (Ok, I’m done raggin’ on ‘rrots.)Fast forward a couple of days. I’ve completed my journey of pot pie introspection and it’s time to get cooking. As you might guess, I made the decision (albeit controversial) to nix the carrots in favor of turnips. Developing recipes for Basically can be tricky at times because we have a self-imposed limit on the number of ingredients in any given recipe. (The number is 10.) Given that constraint, every ingredient included really and truly has to carry its weight. There’s no room for throwing something in there just because it looks pretty, or just because we've got it on hand. Which meant out with carrots and in with the turnips. (For all the pot pie purists in the house, fear not, I left in the frozen peas.)Miss me with those lil bits of cooked carrot.\nALEX LAUI proudly paraded my golden brown puff pastry pot pie around the office as soon as it was finished, carrying with me plates and forks for all who wanted a piece o’ dat pie. I could not have anticipated what ensued: an hour long heated debate about whether or not the turnips belonged. People tasted the pie with the utmost skepticism upon noticing there were no overcooked orange bits swimming amongst all that creamy, chicken-y goodness. One editor loathed the loss of the carrot—only to find herself fishing around for more turnips after the first bite. Another made it clear that he will stand by cooked carrots always and forever. An unpopular opinion in my book. Even senior food editor Chris Morocco was anti, saying he doesn’t love turnips and his favorite kind of turnip is a daikon...radish. (Yeah, I was confused, too.) But then as more people got their skin in the game, Team Turnip began to turn out. The tides shifted and suddenly the Bon Appétit staff was ALL about those ‘nips.It became clear to me that a vote was in order. So we voted. And guess who lost? That’s right, the CARROTS. Despite everyone’s skepticism, the turnips slayed with a vote of 9 to 2. So take it from even the harshest of critics, turnips are the bomb and they’re here to stay. They’re an oft overlooked root vegetable and deserve a real moment in the spotlight. Next time you’re in the produce aisle and find yourself reaching for a bunch of the basics, remember this tale, and pivot to the turnip department instead. As senior staff writer Alex Beggs declared: “FREE THE TURNIP!!!”Go make yourself some pot pie already!One-Skillet Rotisserie Chicken Pot PieRotisserie chicken, store-bought puff pastry, and just one skillet keep this hearty dinner recipe from feeling too fussy—or taking all day to make.View RecipeExplore Bon AppétitBasicallyTurnipCarrotPot PieRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-18", "author": ["Condé Nast", "Molly Baz"]}