{"id": "e77640a5780ebe33cc43abbb15c19b8c", "url": "https://www.bonappetit.com/story/peter-steckler-restaurant-diary-1", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "I’ve Been Working as a Line Cook During COVID, and I Honestly Love My Job | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’ve Been Working as a Line Cook During COVID, and I Honestly Love My JobIn his first Restaurant Diary entry, Peter Steckler shares how he found his calling in the middle of the pandemic.By Peter Steckler, as told to Allyson ReedyFebruary 10, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week, you’ll hear from one of them, from a farmer in Winters, California, to a wine educator in Chicago. This week’s diarist is Peter Steckler who is finding his footing as a line cook at American Elm in Denver as he experiences the ups and downs of restaurant closures and restrictions.I’m fairly new to the industry. I got my current job as a line cook at American Elm, a neighborhood restaurant in Denver, back in April. I’d say that more than a third of my restaurant experience has come working through the pandemic, and I’ve only been at American Elm during COVID, so I don’t even know what a normal Saturday night looks like here.I know what it’s like when it’s closed for indoor dining, though, and when it’s open at 25 percent and 50 percent. Like everywhere, we’ve experienced a roller coaster of restrictions and closures. We just came out of the last closure, which started in November, and we’re now allowed to have 25 percent capacity. Around the same time, we brought in six heated greenhouses, and we got heaters for every one of our five outdoor tables—we’re blowing through propane—so pretty much overnight we went from having barely anyone at the restaurant to a decent volume between indoor and outdoor. We had 2,894 covers in January 2020. This year we had 2,415. So we’re only down about 16 percent. The neighborhood really supports this restaurant and fills the tables when they’re available.We’re also in the process of applying for the state’s 5 Star certification program. [Editor’s note: The 5 Star State Certification is a program in some Colorado counties that allows businesses like restaurants and gyms to increase their indoor capacity by showing they’re going above and beyond public health orders. In Denver it allows businesses to gradually reopen and increase their capacity after meeting certain guidelines and thresholds.] It’s a brand-new program, so we’re still trying to navigate what we need to do, but we think we may need to space the tables further, focus on customer contact tracing, and improve air ventilation.Since we reopened for indoor dining we’re actively seeking line cooks. We have three to five people in the kitchen during the week and six to seven on the weekends. It’s actually a great time to hire because the market is packed with talent and people need work. But there’s still the uncertainty. It’s winter in Colorado, and while it’s been mild so far, the snowiest and coldest months might be coming. I’m also wondering, “Are we gonna get shut down again?” Every time a new restriction on restaurants comes down, it’s sad and demoralizing in the kitchen, especially considering who the shutdowns affect most. Lower-level line cooks and dishwashers get their hours slashed. I got a promotion over the summer; I’m a higher-level line cook, so I’m not hourly anymore. I feel safe, but I definitely feel some guilt that I have work while others don’t.While I know it’ll be rough for a bit, it’s comforting knowing the owners and management here are committed to keeping the restaurant open and finding new sources of revenue. To do that they’ve tried so many things. The at-home meal kits have been huge—at one point we were doing 500 of these fully cooked packaged meals a week. Back then it was the only way people could “eat out” when they couldn’t actually eat out. Lately, we’ve been doing around 300. And then there’s the takeout and delivery, which I think was a small component for the restaurant in the before times, but now it’s much bigger. And we have another meal kit service that’s more about prepping the ingredients to be cooked at home, and there’s also a smoothie side hustle and a food truck. Each is just another layer for survival, and all these things together can make this job overwhelming.I’m 24 and pretty new to the restaurant business, but working during COVID has made me certain that this is where I want to be. I found something I’m good at. There’s something about executing a good service, communicating with my coworkers, cultivating great experiences for customers—I love it. And this uncertain period is helping me grow. It’s opening my eyes to ways restaurants can be creative and find new revenue streams. A lot of responsibility was thrust upon me because of the circumstances—I’ve been stepping up to help with execution, organization, and fulfillment of the meal kits—but I’ve learned so much.I can’t say if other young people feel the same way. I don’t know the effect this will have on the next generation, and whether or not they’ll be reluctant to join the industry because of how hard-hit restaurants have been. But other industries are getting hit hard, too, not just restaurants. Right now, with the restaurant back open and the outdoor spots filling up and the support we’ve gotten for all of the to-go programs, my coworkers are happy to be here and they’re working so hard. People still want to work in restaurants, and I’m one of them.Explore Bon AppétitRestaurantsRestaurant DiariesFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-10", "author": ["Condé Nast", "Peter Steckler", "As Told To Allyson Reedy"]}