{"id": "e77df2a62caa0b62e176599754a40dd2", "url": "https://www.bonappetit.com/story/bucatini-best-long-pasta", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "Bucatini Is the Best Long Pasta There Ever Was or Will Be | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBucatini Is the Best Long Pasta There Ever Was or Will BeThese noodles fill with sauce. Enough said.By Alex DelanyFebruary 5, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThere’s always an exception to the rule. You know, that one thing that makes you question the truths and ideals that you hold dear. For me, that exception is bucatini, the greatest long pasta there ever was or will be.I am a short pasta person. I believe that short noodles are significantly better than long noodles. Orecchiette. Campanelle. Rigatoni. Gemelli. I like my pasta stab-able and welcoming to chunks of meat and vegetables, and those shapes feel like family. Which is why bucatini presents a serious problem: because even though it’s a long pasta, I hold it in the same regard as I do these short shapes. It makes me question the very ground I walk on.How did this happen? How did bucatini get here, in such fine company? Well, let’s start with bucatini’s shape. To the untrained eye, it might get mistaken for spaghetti, but upon further inspection, you’ll notice it’s a bit thicker. And upon even further inspection, you’ll notice that, what!? There’s a little baby hole that runs all the way through the noodle?! Wow. That’s adorable.And that hollow center is what makes bucatini so fantastic. Where spaghetti or linguine get coated with sauce, bucatini gets coated and filled with sauce. It’s the ultimate delivery vehicle for velvety pasta sauces like cacio e pepe or carbonara. That hollow center gives you more sauce with each bite, and around here, we subscribe to the “More Sauce, More Life” lifestyle.Carbonara was made for bucatini...probably.\nTed CavanaughBut here’s the real secret to this pasta’s success: Bucatini is fun to eat. That’s what it comes down to. You can talk about the architectural benefits of different pasta shapes all you want, but if pasta doesn’t make you think, “LOL PASTA JEEZ, I LOVE YOU, AND I LOVE MY LIFE WHEN I’M EATING YOU, REMEMBER WHEN WE WERE KIDS, AND I ALSO LOVED YOU THEN?” what’s the point? Bucatini provides that joy tenfold. Spaghetti is one-dimensional, but its hollow counterpoint is a delight, providing a mix of sauce, dense carbohydrates, and air pockets that make funny noises when you slurp them.Bucatini is a lesson in the foolishness of dogma, a case against absolute commitment to an ideal. I am a short pasta person. But I’m willing to make exceptions. Bucatini has taught me about flexibility and acceptance. Thanks, bucatini. Love you.Let bucatini into your life...or...bowl:Bucatini with Butter-Roasted Tomato SauceBecause you need more butter-roasted things in your life.View RecipeExplore Bon AppétitBasicallyPastaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-05", "author": ["Condé Nast", "Alex Delany"]}