{"id": "e77e2ce616b424fbf648bc2274deef07", "url": "https://www.bonappetit.com/story/restaurant-parents", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "Being a Parent in the Restaurant Industry Shouldn’t Be This Hard | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsBeing a Parent in the Restaurant Industry Shouldn’t Be This HardMany people are trying to alleviate impossible working conditions. But policy experts are clear that the problems facing restaurant parents are beyond the power of individuals to solve.By Lydia KieslingSeptember 17, 2021FacebookTwitterEmailPhoto by Lucy HewettFacebookTwitterEmailIt’s Tuesday afternoon and Paloma Gonzales, a single mom, has spent the day taking care of her four-year-old daughter.They had breakfast, they played, they took their dog to the park, they ate lunch, they wiggled through the early afternoon. Now the little girl is watching a movie while Paloma panics. Her shift starts in two hours and her babysitter just flaked.Paloma works at a family-friendly Mexican restaurant in Portland, Oregon, that her parents have owned for nearly two decades. She’s held every position over the past seven years—from cook to hostess to server, depending on what needs to get done. At the moment she’s the bartender on a pandemic-reduced four-hour shift four nights a week. The restaurant is operating with a skeleton staff, and if she doesn’t come in, it won’t be able to open. The business is struggling with the pandemic; meanwhile, Paloma is struggling with a broken childcare system, and today she needs to improvise a solution—fast.Like “parents,” “restaurant workers” is a huge category that includes the people who wash the dishes, write the menus, and cut the checks. People who work in dive bars, food carts, massive chains, and Michelin-starred restaurants. People who make sub–minimum wage plus tips and (far fewer) people who pull in six figures a year. Regardless of role or status, this is an industry where the concept of work from home is laughable, the shifts are long and the schedules variable, with prime moneymaking hours falling well after the sun goes down.Photo by Emma FishmanA veil of romance surrounds the industry in the popular imagination; it’s work that can invite condescension from civilians but also garner their voyeuristic interest. Some of the mystique is predicated on visions of suffering—the hot, rowdy back of the house, the bellows of hell from which beautiful plates emerge. But there’s a danger in romanticizing any place that immolates the idea of work-life balance.And in America—where the social safety net is famously flimsy, where fundamentals like health insurance and childcare are considered luxuries instead of rights, and where work and school schedules are built around an idealized, largely mythical two-parent, one-income home—it’s hard for restaurant workers to stay afloat. This affects our food culture: who gets hired and who moves up the ladder; who can dictate their own schedule and who will drop out.For many businesses and employees, COVID-19 was the last straw. But as we collectively imagine a post-pandemic future, the combination of a shellshocked industry, a lot of individual effort, and an unprecedented federal investment could, finally, bring some much-needed change.Bad MathWhile Paloma goes through her mental catalog of past babysitters, she tries to ignore the upsetting numbers at the root of her problem: If she can track down a sitter, she’ll pay at least $18 an hour for their time, even though she makes just shy of $14 an hour.Paloma is hardly alone. The average American household with children under the age of five spends nearly 10 percent of its monthly income on childcare; those at the poverty line spend 35 percent, soaring five times past the 7 percent considered affordable by the U.S. Department of Health and Human Services. Perversely, parents of any income don’t come close to paying the true cost of childcare: Caregiving staff are underpaid and overworked, and facilities are crumbling as providers, many of which are nonprofits, struggle to cover rent and payroll.Though day care is a frequent solution for working parents, for people like Paloma, the issue is right there in the name: Most day cares, whether home- or center-based, close at 5 p.m. In 2015, only 8 percent of American childcare centers were open in the evening—a number that has certainly decreased in the pandemic’s wake.I was told, ‘Long hours, little pay. It’s all about the passion.’ But when you strip that away, it’s kind of inequitable, determining who has more passion than others.Halfway across the country, Chicago chef Beverly Kim felt like she’d won the lottery when she finally found an evening care facility for her firstborn. In 2014, just prior to launching their first restaurant, Parachute, Kim and her husband, fellow chef Johnny Clark, collectively made less than $31,000 a year. They lucked out with the night care center and also landed a subsidized preschool spot for their son through the federal Head Start program. Once Parachute was up and running, their second son was born; their third arrived in 2019, one month before the opening of their follow-up restaurant, Wherewithall. Kim wore the baby in a sling while prepping for service.Childcare has always been a struggle for Kim and Clark. During her first pregnancy Kim was a restaurant line cook on a punishing noon-to-midnight schedule. She switched to Whole Foods and worked as a hot-bar line cook for a more manageable 6 a.m. to 2 p.m. shift. Once their firstborn arrived, Kim took six weeks off unpaid. When she returned, Clark also began working at Whole Foods on opposite hours; to avoid childcare costs the couple would meet in the market’s lobby between shifts to hand off the baby. Kim eventually left to become chef de cuisine at the famed Fairmont Chicago restaurant Aria, and Clark stayed home full-time. Kim worked 11 a.m. to 11 p.m., sometimes going 12 hours without pumping breast milk, resulting in bouts of agonizing mastitis.The couple has earned James Beard Awards and much critical acclaim. But over the phone Kim speaks bitterly about the hours and the costs, both literal and emotional, of pursuing a dream in restaurants. “I was told, ‘Long hours, little pay. It’s all about the passion.’ But when you strip that away, it’s kind of inequitable, determining who has more passion than others.” Kim, a previous Top Chef contestant, points to the glorification of celebrity chefs as a way of glamorizing the dysfunction of restaurant culture. “The reality is, it’s a very, very difficult lifestyle,” she says. “There’s so much sacrifice on the back end.”These sacrifices radiate through all aspects of life. Financially, Kim estimates 40 to 50 percent of her and Clark’s current income is spread across morning and evening babysitters. There’s the personal cost too: the diminished family time spent together. And then there are the professional losses. In Kim’s experience, women are far more likely to leave the field. “Women make up 54 percent of culinary schools,” she recites from memory. “But that number becomes 6 or 7 percent in executive chef positions.” The lack of female leadership has palpably impacted the tenor of kitchen culture, which in turn fuels a vicious cycle. For fear of retribution, her peers have avoided reporting sexual harassment. And in Kim’s case, back in her hot-bar line cook days, she hid her pregnancy until it was no longer possible. Myriad statistics show that restaurant work is built on powerful fault lines of gender and race. A 2015 study by the Restaurant Opportunities Centers United, an advocacy group for restaurant workers’ rights, found that restaurant workers occupied 7 out of 10 of the lowest-paid occupations, with women and workers of color funneled toward the industry’s lower-earning positions. Restaurant workers of color generally experienced poverty at nearly twice the rate of their white peers, with women of color earning the lowest wages. Many must supplement their income with second jobs to make ends meet. Hermilo Diaz, a barback I spoke with in San Francisco, described years of a schedule that had him working one 7 a.m. to 2 p.m. shift, coming home for a nap, and then heading to another job for a second shift just to afford rent. When these workers have families, they must cobble together childcare through a patchwork that can involve relatives, neighbors, a parade of babysitters, or the rare night care center Kim and Clark were so fortunate to find. When a kid gets sick, parents often have to choose between staying home and keeping a job.When Work Is HomeFor Paloma, the family restaurant is an integral part of her life, but the bar, where she’s most needed, is not a place she can take a four-year-old. In restaurants across America, though, family businesses sometimes function as a de facto work-around for childcare. If you visited Manuel Rojas’s El Tepeyac Cafe in the ’60s, for example, you might have seen a little girl doing homework or playfully taking orders. Elena Rojas grew up to work for her father, eventually taking over the iconic Boyle Heights, California, Mexican restaurant after his death. Rojas often brought her own children to the restaurant while she worked. “My dad couldn’t stand it,” she said. But having her kids close by mattered more than his grumbling. These days she’s semiretired and regularly babysits two of her 12 grandchildren while their adult parents run El Tepeyac Cafe. Photo by Kyle JohnsonRojas acknowledges that the dynastic model isn’t for everyone. There are a lot of restaurants she knows “where the kids grow up and don’t want to be there.” And what works for the boss isn’t necessarily an option for anyone else; staff members cannot bring their children to El Tepeyac during shifts for insurance reasons. A family business is still a business. In chef Peter Cho’s case, embracing the porous boundaries of home and work was a way to reimagine restaurant culture’s all-consuming status quo. Cho and his wife, Sun Young Park, had their first son in 2015. Two years prior, when Cho helmed The Breslin in New York, the couple knew a traditional, grinding schedule wouldn’t fit with the family life they hoped to create. So when they moved to Portland, Oregon, Park found a unique rental—an auto body shop refurbished into a four-bedroom loft with an interior courtyard—and the couple built a restaurant in their own home.For nearly five years they lived and worked in their acclaimed Korean American restaurant, Han Oak. Their baby boy learned to walk there and was soon followed by another son. Evening service found diners in a cozy space that moved seamlessly from dining room to courtyard. A toddler might weave between tables to say hello. If he wandered into the kitchen, staff would call out, “Baby on the line!”—working conditions that Cho and Park readily concede required a specific kind of personality. This homey atmosphere charmed guests, but the dynamic became far from ideal as the family expanded and the pace of service picked up. “At first we were open only two nights a week. It was just me, another cook, and our friends who pitched in with service. Sometimes I would hold Elliott in a baby carrier, and we would bounce around as I expedited.” When the second baby arrived, Cho and Park found themselves yoked to a nightmarish evening schedule, juggling a toddler, a newborn, a babysitter, and the work of hosting and feeding guests. “It was bonkers,” Park recalls. “I don’t even know how we did that.” In March 2020 the couple moved to a house with a larger living space, finally ready to separate their home from Han Oak. But the lockdown threw them back together. The low-key family time they initially enjoyed was quickly subsumed by full-time caregiving responsibilities as they also hustled to open a new restaurant, Toki. Ultimately, they are grateful for the closeness. In New York, Cho wasn’t sure whether it was even possible to have a chef career and a family. Now he knows you can, with limits. “You can’t be that kind of chef, and you can’t have that kind of restaurant.”A Deep Well of National NeedJust a few miles away from Han Oak, Paloma is still stuck with her intractable problem. She belongs to a Facebook group called Finding Child Care in PDX. Of the more than 2,000 members, parents—primarily moms—post in a low thrum of panic as they search for babysitters or day cares with openings. Unlike many of the women in the Facebook group, Paloma works “nontraditional” hours, so she usually strikes out. If nine-to-fivers have it rough on the childcare front, restaurant workers occupy a special hell. It makes sense, then, that some solutions to the persistent problems of the industry originate within the industry too. Baltimore-based private chef and culinary instructor Catina Smith now works mostly for herself, but when she was making her bones at venues like Guy Fieri’s Kitchen + Bar, she found herself on the line missing many moments with her two older kids (now 12 and 13). One grueling shift, she showed a family photo to her executive chef, saying she hoped to see her little people again soon. “Maybe you shouldn’t be a chef,” he told her. Smith left her job shortly after that exchange, opting for catering gigs that allowed her a more flexible schedule and work environment. “My kids have been to all my events,” she tells me over the phone. “Either they’re helping me or sitting in the back somewhere quietly, but they’re always there.” Smith and her partner added a pandemic baby to the family a few months ago. Smith’s experiences in the kitchen illuminated the intersecting struggles of Black women in the industry, where only 9.5 percent of chefs are African American. In 2018 Smith created a group called Just Call Me Chef to elevate Black women through mentorship and networking, and in three years the organization has expanded to more than 10 chapters. Sixty chefs belong to the Baltimore and greater D.C.-area branches; they are particularly tight-knit, with members frequently stepping up to babysit for one another when there’s a need, collectively building an informal solution to gaps in the social safety net. During the pandemic Smith and another chef, Kiah Gibian, bought an 8,000-square-foot building to create Our Time kitchen—a mixed-use retail and office space that will include an incubator commissary, where women chefs can explore restaurant concepts via hourly rentals. Memberships will include on-site childcare through local providers, from whom Smith is securing reduced rates in exchange for a guaranteed number of hours they’ll work at the incubator. Back in Chicago, Beverly Kim is likewise eager to ease the path of women in the industry, particularly women of color and single moms. Last October, as the pandemic surged, she and Clark established the Abundance Setting, a nonprofit organization that provides professional mentorship and meal relief to mothers in the restaurant industry. One reason moms are forced out of jobs, Kim notes, “is because the quality of family time is so little and horrible.” Setting up parents with meals for the family is a small but meaningful way to get “a little more quality time with their kids.” While these efforts are making a difference, policy experts are clear that the problems facing restaurant workers— and American parents broadly—are beyond the power of individuals to solve. The United States is behind just about every wealthy country in what it offers parents; out of 37 industrialized nations, America ranks 35th in governmental spending on things like subsidized childcare or preschool. There’s no way to solve this issue without really significant subsidization of the childcare market.Julia Henly, a professor at the Crown Family School of Social Work, Policy, and Practice at the University of Chicago, emphasized in a phone call that the American childcare system is uniquely difficult for service workers. Parents must pay out of pocket for all childcare unless they qualify for government subsidies, which are small and support only a fraction of families who need them. Moreover, subsidies don’t cover a major component of childcare that evening workers like Paloma need: individual babysitters. “There might be someone taking care of kids in your neighborhood and doing an excellent job at serving the needs of restaurant workers, but they don’t meet the quality standards that the city or the state might apply,” Henly explains, meaning they usually cannot be paid with subsidy dollars. Gina Adams, a senior fellow at the Urban Institute (a think tank focused on economic and social policy research), points out that addressing this lack of evening options will require an intentional focus. “There’s a presumption that organized childcare settings are what we should be helping families to access,” says Adams. But it’s not clear that this is what all families want. Kim, for example, spoke wistfully of a group setting option, such as evening childcare for parents working in what she calls a “counterculture industry.” Others might prefer to use a trusted sitter from down the street. As Paloma’s situation reveals, those caretakers can be difficult to find, perhaps precisely because they are left out of the formal infrastructure of childcare. Henly emphasized that the current problem is one of funding and availability but also of labor law. The majority of service workers, particularly lower-paid employees in restaurants, don’t know their schedules more than a week ahead, a situation Henly says must be resolved with fair workweek legislation. Additionally, Henly cautioned agains romanticizing “the village” that parents end up relying on: Its members may also be living with precarious conditions. “There’s no way to solve this issue without really significant subsidization of the childcare market,” Henly adds. She suggests that states make use of spaces like community centers, contracting with childcare providers to use the facilities at night, guaranteeing a certain number of spots—a much larger, institutionally backed version of the mechanism Catina Smith envisions for the Our Time incubator. Direct payments to parents, like the ones that have recently begun under the American Rescue Plan, are appealing, says Henly, but will need to be coupled with a considerable buttressing of childcare options. With the pandemic hollowing out an already fragile industry, demand can’t spontaneously generate supply. The pandemic may have occasioned a once-in-a-lifetime opportunity for major change. Adams ended our conversation on a hopeful note, pointing out that the American Rescue Plan included an unprecedented $24 billion to states specifically for childcare stabilization. “We have never had those kinds of resources in this field.” It’s a unique moment to examine how the government can best serve the many parents who go to work after 5 p.m. Adams emphasizes what an expansive childcare overhaul would do for the problems laid bare by the pandemic—the societal racism and income disparity that made line cooks so profoundly vulnerable in a COVID-19-ravaged industry. Prioritizing childcare would begin to “address some of those inequities by taking care of an entire population of parents.” Kim has a wish list of what that federal money might one day fund: “parental leave, childcare support, night care resources, free preschool.” Without these things, the industry has to get creative because the consequences of inaction are profound. “Without our community creating support systems,” she says, “having children is really not an option for a lot of people.” In the meantime, Paloma Gonzales will keep finding herself in that Tuesday afternoon panic. Today she’ll find a last-minute babysitter through a family friend. She’ll spend her shift providing flawless service to her guests, hoping her daughter is sleeping soundly. She doesn’t know whether she’ll have a babysitter tomorrow, or if the day after that she’ll be back in the same scramble. She does know one thing: It shouldn’t be this hard.Explore Bon AppétitRestaurantsFuture of RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-17", "author": ["Condé Nast", "Lydia Kiesling"]}