{"id": "e7859fa9024c99c1ef5b41b58d157232", "url": "https://www.bonappetit.com/recipe/citrusy-chicken-thighs", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Citrusy Chicken Thighs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCitrusy Chicken ThighsBy Brigid WashingtonAugust 2, 20204.1(23)Read ReviewsTriangleEmailPinterestPrintPhoto and food styling by Sarah JampelEmailPinterestPrintEmailPinterestPrintIn this recipe from Brigid Washington, the zest and juice of lime and lemon deliver a simple but powerful flavor-packed punch to an everyday staple. As the boneless chicken thighs cook, the citrus zest caramelizes, offering a deep, rich flavor that you'll be shocked came from so few ingredients. Brigid serves the chicken thighs with her Trini Stewed Eggplant, peppery arugula, and brown rice for a simple summery dinner.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCutting Board$10 At IKEAMeasuring Spoons$10 At Bon Appétit MarketMicroplane$16 At AmazonSmall Bowl$13 At AmazonLarge Skillet$84 At AmazonTongs$13 At AmazonWooden Spoon$6 At AmazonIngredients4 servings4skinless, boneless chicken thighs1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt2tsp. freshly ground black pepper1lemon2limes1Tbsp. plus 1½ tsp. vegetable oilTrini Stewed Eggplant (for serving)PreparationStep 1Place 4 skinless, boneless chicken thighs on a cutting board and pat dry with paper towels. Sprinkle all over with 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt and 2 tsp. freshly ground black pepper, pressing gently to adhere. Using a Microplane, finely grate zest from 1 lemon and 2 limes over both sides of chicken, pressing again to adhere.Step 2Cut lemon and limes in half and squeeze juice through your hand or a sieve to catch the seeds into a small bowl; set aside. You should have about ½ cup juice total.Step 3Heat 1 Tbsp. plus 1½ tsp. vegetable oil in a large skillet set over medium-high. Arrange chicken in pan and cook until golden brown and cooked through, about 4–5 minutes per side. Transfer chicken to a plate.Step 4Add citrus juice to same skillet and cook, scraping up any brown bits stuck to bottom of pan with a wooden spoon, until slightly reduced, about 30 seconds. Pour over chicken. Serve with Trini Stewed Eggplant.How would you rate Citrusy Chicken Thighs?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleEasy to make and delicious recipe.  The hardest part was microplaning the citrus but aside from that, a sure winner.  Made this with the Trini Eggplant, which helped to make the meal.  Will be making this one again.Mary EllenPortland, OR4/26/2021Just made these with the eggplant stew.  Really good.  Seems like this recipe could also be the foundation to a more complicated recipe.  Next time I might add a tiny bit of butter at the end when making the sauce, but you don't need to!BenLos Angeles, CA1/28/2021These are delicious and super easy. If you feel the sauce is too tart or citrusy may I suggest adding a pinch or two of sugar to help mellow the flavor. I resisted the urge to mount the sauce with butter and am glad I did. It ends up being supremely bright and tart and dresses whichever vegetables you serve it with perfectly. This is a great recipe to have in your back pocket. MikeNew York 1/13/2021This recipe had way too much citrus. I had my doubts going into this, and they were confirmed. Like others have commented, there is no balance here. I think they might need to go back to the drawing board with this one.Chris Y.San Jose, CA11/18/2020I loved this recipe! I understand the concerns about the citrus, but I paired it with steamed rice and the Trini stewed eggplant and the 3 of them balanced it all out perfectly! I also added a healthy handful of fresh chopped basil to the rice and the bitter rounded out the profile. Probably one of the best things I've made since Quarantine!AnonymousPortland, OR8/18/2020Holy citrus, Batman! This pan sauce is completely unbalanced — definitely needs a few more ingredients to mellow out the citrus juice. AnonymousWashington, DC8/18/2020Incredible, so tasty and refreshing, loved the amount of citrusAnonymousChicago, US8/17/2020Way too much acid and zing even after following other reviewer's suggestion to add chicken stock. I would eat this with quinoa and a cucumber salad on a hot day, but I don't think I would ever crave this chicken.Sweet ElizabethWashington, US8/14/2020This was a tough one chicken was tasty, but the citrus was overwhelming. The sauce was unbalanced. Needed chicken stock or butter. Maybe both. AnonymousNevada8/12/2020This was a really easy recipe, but we found it to be unbalanced in its citrus flavor. I think I'd make it again, but I'd cut maybe 1/3-1/2 of the lemon and lime juice with some chicken stock so that it isn't so sharp. AnonymousPhiladelphia, PA 8/11/2020it's great!Anonymouscanda8/3/2020love it!Anonymous8/3/2020Explore Bon AppétitTrinidadianCaribbeanChickenPoultryChicken ThighLemonCitrusFruitLimeQuickEasyWeeknight MealsMainGluten-FreeDairy-FreeKetoDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-02", "author": ["Condé Nast", "Brigid Washington"]}