{"id": "e787a9f0f1450284f3a174192b7602b5", "url": "https://www.bonappetit.com/story/stock-your-freezer-with-homemade-dumplings", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Make Homemade Dumplings For Stocking Your Freezer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingThere's No Better Time to… Stock Your Freezer With Homemade DumplingsThat cooking skill you’ve been meaning to master? Now's your chance.By Christina ChaeyMarch 26, 2020FacebookTwitterEmailPhoto by Christina ChaeyFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. Today: FaceTime a friend and have a virtual cooking lesson.For months, my friend Sue and I have been talking about getting together with Claire (yes, that Claire) to have a homemade dumpling night. We’d say, “We should make dumplings together sometime!” which, in normal times, translates to “We’re never doing this.”  But normal times there are not.One night last week, with no plans and itching for a cooking project, I texted Sue and told her I was thinking about making some wontons with the package of wonton wrappers I panic-bought at the store, and would she mind coaching me through how to make them? A few minutes later, we were FaceTiming, I was opening a bottle of wine, and Sue was rummaging around her desk for a Post-It to demonstrate proper wonton-folding technique. She drew a circle on the Post-It to indicate where I was supposed to add the filling. It was the kind of thing we would have never gotten around to in our normal lives, when so many other obligations and plans keep us away from these small shared kitchen moments.Homemade dumplings in dashi with spinach, shichimi togarashi, and tofu.\nPhoto by Christina ChaeyI ended the evening pleasantly tipsy, with a trayful of wontons filled with goods from the pantry like rehydrated dried shiitake mushrooms, diced water chestnuts, and lots of ginger. I froze them in a single layer on a sheet tray and then stashed them in a bag, ready to boil at a moment’s notice to eat with a drizzle of nutty sesame sauce or chile crisp. Recently, in need of an extra dose of comfort, I’ve been adding a handful of them to piping-hot savory brothy soups with lots of wilted greens (you could skip the soba in this Soba Soup With Shrimp and Greens and cook a few wontons directly in the dashi broth instead and it would be so good!)I want to tackle different kinds of fillings and folding techniques next—and when I have a chance to get more wonton provisions, I know who I’ll be FaceTiming.Explore Bon AppétitThere's No Better Time CoronavirusBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-26", "author": ["Condé Nast", "Christina Chaey"]}