{"id": "e792ba68b499cb7d48c6bd6652f91b6c", "url": "https://www.bonappetit.com/recipe/minty-limeade", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "Limeade Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMinty LimeadeBy Andy BaraghaniAugust 1, 20194.3(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Maggie RuggieroEmailPinterestPrintEmailPinterestPrintThis limeade is addictive and will make your mouth pucker. We love the sour, fresh flavor from the citrus and mint, as well as the fizz from the soda water. The base is super-concentrated because it gets chilled, then diluted by lots of ice. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.Ingredients4 servingsFresh juice of 4 limes (about ½ cup), plus 1 lime cut into wedgesFresh juice of 3 lemons (about ¾ cup), plus 1 lemon cut into wedges½cup sugarPinch of kosher salt2large handfuls of mint leaves (about 3 cups), plus mint sprigs for garnish112-oz. can soda water, chilledPreparationStep 1Mix lime juice, lemon juice, sugar, and salt in a large pitcher. Add mint leaves, lime wedges, and lemon wedges. Using a wooden spoon, smash down to bruise citrus and mint leaves (this will take a few minutes), then stir until sugar dissolves. Chill limeade until cold.Step 2Divide limeade among chilled ice-filled glasses. Top with soda water and garnish with mint sprigs.How would you rate Minty Limeade?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleTake this to the next level by adding 1 large cucumber, peeled and sliced, to the mixture and muddle it all together. Strain out the cucumber solids. The cucumber mint lime combo is incredibly refreshing. AnonymousNJ6/4/2020I’ve made this three week in a row as a mid-day treat. Perfectly tart and minty!Anonymous5/2/2020I didn't think I liked fresh mint, but after drinking this I'm converted! With a hefty dose of mint leaves, the puckering acidity of the citrus, and just enough sweetness, this drink was just what I needed on a hot summer day. I used 2 liters of seltzer, which was perfect for our group.AnonymousNew Jersey 8/26/2019I've been craving lemonade all summer, but this stuff is next level. Be warned, all this juicing requires strong hands, but it's worth it. I didn't mix in any alcohol but it would be great with tequila...next time for sure.Nate GLos Angeles, CA8/14/2019Explore Bon AppétitPitcher DrinkDrinks AllLimeCitrusFruitLemonMintHerbs & SpicesSummerDrinksDairy-FreeGluten-FreeNut-FreeVeganVegetarianNonalcoholicHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-01", "author": ["Condé Nast", "Andy Baraghani"]}