{"id": "e7a0097326512dcd6bcca4f9e1bfbceb", "url": "https://www.bonappetit.com/story/rotisserie-chicken-taco-recipe-never-fail", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "The Chicken Taco Recipe I Make When I Need Meat NOW | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe (Rotisserie!) Chicken Taco Recipe I Make When I Need Meat NOWWhen my vegetarian partner is away for the afternoon, I make these chipotle chicken tacos on the sly.By Erika OwenFebruary 16, 2018FacebookTwitterEmailPhoto by: Photofusion/UIG via Getty ImagesFacebookTwitterEmailWelcome to Never Fail, a semi-regular column where we wax poetic about the recipes that never, ever let us down. This week: the chicken taco recipe that associate audience development director Erika Owen just couldn't live without.If there are two things you need to know about me, dear stranger, it’s that I love tacos more than most things (and people) and I live with a vegetarian (who I happen to love even more than tacos). Sure: There are some great meat-free tacos out there. But my favorites are full of meat—more specifically juicy spiced chicken. Needless to say, I’m not slinging chicken tacos for dinner very often, but on the rare opportunity that I get an entire afternoon to myself, there’s one chicken taco recipe that I turn to again and again—with some modifications, of course.The recipe itself without any modifications is relatively simple, as long as you’ve roasted a chicken before. Best Part No. 1: Everything goes into the same pan, which means less dishes for you! Best Part No. 2: the leftovers are oh-so delicious. And while it doesn't take that long, my favorite version comes together lightening-quick courtesy of—wait for it—rotisserie chicken! Given that I only have a few hours by myself and I’m a total vegetarian sympathizer—what non-carnivore wants to come home to an apartment that smells like meat?—I cut down on time and meat-y aromas by buying a rotisserie chicken from the grocery store. When I get it home, I rub the bird down with some of the recipe-recommended spices (fresh oregano and rosemary, crushed coriander seeds), put it in a skillet along with a good splash of broth, and toss it all in a low-temperature oven to warm while I prepare the toppings (more on that later).Shred up that chicken, fold it up in a soft corn tortilla, and you're in taco heaven.\nPhoto courtesy of Masienda, by Molly DeCoudreauxSince I don't want to overcook the chicken, I take the other components of the recipe that would usually roast alongside the bird and cook them on the stovetop. Sliced onions, chipotle chiles, garlic cloves, and chicken broth (less than the recipe calls for, maybe ¾ cup) go into a pan and brought up to a simmer. It all hangs out while the broth cooks down to create some seriously tasty taco toppings.And before I know it, it's taco time. I shred the chicken, slice up some avocado, and put out some tortillas along with whatever hot sauce makes me happiest at that moment. No matter which path you take to get there, whether you're cooking for yourself or those friends who decided to drop in “because they were in the neighborhood,” this might just be the ultimate throw-it-together-in-no-time meal. And the vegetarians never have to know.Get the recipe:Chipotle Roast Chicken TacosView RecipeExplore Bon AppétitBasicallyNever FailChickenTacoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-16", "author": ["Condé Nast", "Erika Owen"]}