{"id": "e7a5b0a6084b7029346f48055644f1e4", "url": "https://www.bonappetit.com/recipe/tahini-smothered-charred-cabbage", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Tahini-Smothered Charred Cabbage Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueTahini-Smothered Charred CabbageBy Andy BaraghaniMay 25, 20214.5(55)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintI love cabbage year-round, but summer might just be my favorite cabbage season—a hot grill has the ability to transform it in a way the oven or stovetop never will. The outside gets blistered and charred while the inside steams to crisp-tenderness, every bite perfumed with smoke. I think it’s irresistible with little more than a sprinkling of salt, but this creamy, very lemony tahini sauce takes an already-craveable vegetable into extra-delicious territory. Grab a knife and fork and don’t be surprised when you finish the whole thing by yourself. —Andy BaraghaniThis recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonSoom Tahini$9 At BA MarketMicroplane Grater$16 At AmazonCutting Board$10 At IKEAWhisk$10 At AmazonIngredients4 Servings1medium head of green cabbage (about 2 lb.)3Tbsp. plus ¼ cup extra-virgin olive oil; plus more for drizzling (optional)Kosher salt1garlic clove, finely grated⅓cup tahini (such as Soom)1tsp. honey½tsp. ground cumin1lemon½cup very coarsely chopped dill1Tbsp. toasted black or white sesame seedsPreparationStep 1Prepare grill for medium-high heat (or heat a large cast-iron skillet over medium-high). Cut cabbage in half through core; cut each half into 3 wedges, keeping core intact. Drizzle with 3 Tbsp. oil and rub to coat; season all over with salt.Step 2Grill cabbage until deeply charred on cut sides and a paring knife slides easily through center, 6–8 minutes per side. Transfer to a cutting board and let cool 5 minutes (this will allow the cabbage to soften further). Cut some wedges in half crosswise; leave the rest whole.Step 3Combine garlic, tahini, honey, cumin, and ¼ cup oil in a medium bowl. Finely grate zest from lemon into bowl, then cut lemon in half and squeeze juice into bowl. Add a big pinch of salt and whisk until smooth. Whisking constantly, add 3–4 Tbsp. cold water; tahini sauce should be creamy but pourable.Step 4Arrange cabbage wedges on a platter and spoon tahini sauce over. Scatter dill over cabbage, then sprinkle with sesame seeds. Drizzle a little oil over everything to finish.How would you rate Tahini-Smothered Charred Cabbage?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleThis was so complex and delicious for such a simple dish. My head of cabbage was huge and very dense so after charring it in a cast iron skillet, I covered it and stuck it in a 350 degree oven for 30 minutes and it was perfectly tender with just a pleasant bit of bite left. I will do this again!AnonymousCT3/8/2022The sauce and dill combination is really where it's at. I don't have a grill so the first time I made this, I used the broiler. The sauce and dill work really well on not only roasted cabbage at 450 degrees, but also roasted fennel, and I want to try this on carrots, too.AngelaPalo Alto, CA1/29/2022Did anyone else need to cook the cabbage much (much) longer than the 6-8 minutes a side? I used my trusty cast-iron skillet and got a nice char. But then had to let the cabbage steam in the skillet to soften it to a chewy (not feisty), consistency.  Flavors are great!\nKeekWoodland Park, NJ9/12/2021Delicious.  I ended up putting it in the oven and braising it until more done.  I like the suggestion below of microwaving it before putting it on the grill.  Maybe I need to be more aggressive with the heat on the grill.DawnLawrence KS9/8/2021The trick to \"un-seizing\" the tahini is to use all of the water called for in the recipe and make sure it is ice-cold.AnnToronto8/21/2021If your tahini sauce seems ok before adding the water, do yourself a huge favor and DO NOT ADD WATER. I added only 1 tbsp, following instructions to whisk, and it immediately thickened and now looks like oatmeal in a bath of oil. Currently have it in the food processor and its a little better but still messed up and doesn't look very appetizing… CelinaDenver 7/19/2021I like fully cooked (not mushy) cabbage. It should still stand up but not be fighting back when chewed. Hot and chewy is not the same as cold, crisp, and chewy cabbage. I will partially cook the cabbage in a microwave prior to putting it on the grill next time I do this. Microwave cooks from inside out so this step will aid in plating a fully cooked cabbage, not just the first half-inch exposed to the fire.\n\nTahini is not the most attractive color. It looks dead on the cabbage, it doesn't have the warmer tones of peanut butter. If I make this again I will be looking for a way to add color to the presentation. I'm thinking wild Maine blueberries scattered about with a zigzag drizzle of pomegranate molasses over or under the cabbage wedge.Peat MossCincinnati, OH7/12/2021This is fabulous!\nThe recipe looked interesting and it turned out to be utterly delicious.  Who knew cabbage could be so good.\nI used a grill pan and it was perfect. I'll definitely make it again.BarbaraSan Diego, CA7/2/2021Incredibly delicious. Seriously, best cabbage I’ve ever made!RachelAustin 6/21/2021Very good & super easy!Shelly GBasalt, Co6/20/2021Seriously amazing!! We paired it with grilled peppers and sausage and it was to die for. Best cabbage I've ever had.AnonymousMinneapolis, MN6/8/2021I just made this and wow, is it good!  I thick shredded the cabbage and roasted it in my oven 425 for 30’ish minutes, until there was good charr here and there… did I mention this was really good?  Oh I used maple syrup cuz I didn’t have honey…. This will be made again! 👍🏻Diane BeeSeattle6/8/2021Andy Baraghani is a genius in the kitchen, but I think we all know it. Thank you for the vegetable recipes. This was easy to make and delicious and my kitchen remained clean. It was so delicious every was asking for the recipeFarah TavakoliTampa, Florida6/7/2021This was delicious and easy; I had no idea that roasted cabbage tasted like carmelized brussels! We did it in the cast iron skillet and could have cooked a little longer, or maybe used smaller wedges. Not pregnant Eating GoodPhiladelphia, PA6/5/2021Explore Bon AppétitCabbageLeafy GreensVegetableGreen CabbageTahiniCondiments, Sauces & PastesDillHerbs & SpicesSummerQuickEasyWeeknight MealsSideDairy-FreeGluten-FreeVegetarianKetoVeganHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Andy Baraghani"]}