{"id": "e7aa1fe6a63129ca881522e464176373", "url": "https://www.bonappetit.com/story/ways-to-use-nilla-wafers", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "17 Ways to Use Nilla Wafers in Almost Every Summer Dessert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking17 Ways to Use Nilla Wafers in Almost Every Summer DessertWe love these weird little cookies and we don't care who knows it.By Alyse WhitneyJune 12, 2018FacebookTwitterEmailFacebookTwitterEmailThere are a lot of cookies that we could write love sonnets about, like these brown butter and toffee chocolate chip cookies, or these sophisticated tahini guys. But there are times when homemade isn’t best, and store-bought Nilla Wafers are the only thing that will do. Although we aren’t about to suggest putting a plate of them out at your holiday cookie swap later this year, they are the only option for classic desserts like banana pudding.In the BA Test Kitchen, we tried using generic vanilla cookies for our new Blackberry Icebox Cake. It did not go well. Nilla Wafers are the Heinz Ketchup of the cookie aisle—the brand is synonymous with the product. The texture is both crispy and aerated, and as they nestle into a bed of whipped cream or pudding, Nilla Wafers hydrate to create dissolve-in-your-mouth crumbs, not wet mush like other brands. It’s our platonic ideal of a vanilla wafer cookie.But sometimes you don’t use a whole box at once, or you just want to find new ways to get more Nilla Wafers in your life. So in an afternoon sugar-dreaming haze, senior associate food editor Molly Baz and I brainstormed a list of 17 ways to use Nilla Wafers in almost every dessert this summer. Here we go:1. Make a press-in crust for coconut cream pie or banana pudding pie with Nilla Wafers instead of graham crackers.2. Crumble it over an ice cream sundae, like this brown butter cornbread and blackberry situation.Brown butter + 'Nilla Wafers would be a good crumble too...\nPhoto by Alex Lau, styling by Judy Mancini3. Substitute cookies for sponge cake in a trifle. It’ll be kind of like banana pudding but with berries in an epic layered situation. Bonus: There’s wine and custard involved.4. Roll ice pops or ice cream bars in crushed wafers.5. Crumble onto soft serve. You’re not making that at home, so sneak in a little baggie and BYONW.6. Make an Eton Mess with wafers instead of meringue. They’re both crumbly!7. Sprinkle some crumbs into ice cream cakes instead of chocolate. Or use both.8. This would also improve other icebox cakes, like this blueberry lemon one!9. And ice cream pies!‘Nilla Wafers would be great in an ice cream pie.\nVictor Prado10. Make teeny tiny ice cream sandwiches for kids (or for portion control at a party), using a melon baller as the ice cream scoop.11. Crumble some over top of simple berries and whipped cream—it elevates it juuust enough.12. Make baby s’mores!13. Dip them in caramel and chocolate for something like a Twix bar.14. Sandwich marshmallow fluff in between cookies and dip in chocolate for a Mallomar-esque treat.15. For a nostalgic, faux-fancy plated dessert, swoosh softened ice cream across a plate and top with a little pile of Nilla Wafer crumbs.16. Blitz some wafers into ice cream with milk for a milkshake, or sans milk up for a homemade Dairy Queen Blizzard.17. Dip them into peanut butter, chocolate, or frosting, and eat them standing up in your kitchen. Happy summer sugar rush!About that icebox cake...Blackberry Icebox CakeThe no-bake dessert you'll be making all summer.View RecipeExplore Bon AppétitCookieDessertSummer DessertsIce CreamBasicallyRead MoreBlueberry-Lemon Icebox CakeStone Fruit Icebox Cakerecipes95 Summer Dessert Recipes For Cooling Down and Sweetening UpGallery95 SlidesBy Bon AppétitrecipesThe Fruitiest, Juiciest Recipes for Ice Pops, Paletas, and Homemade PopsiclesGallery21 SlidesBy Melissa FinkelsteinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-12", "author": ["Condé Nast", "Alyse Whitney"]}