{"id": "e7b44eae529762504707c1f02f3f7368", "url": "https://www.bonappetit.com/recipe/silky-peanut-butter-dressing", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Silky Peanut Butter Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueSilky Peanut Butter DressingBy Carla Lalli MusicSeptember 18, 20185.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue LiEmailPinterestPrintEmailPinterestPrintAdding silken tofu to the base of this kid-approved dressing recipe both enriches it with a little added protein and lends it a satiny texture. You can adjust the amount of water added to create something thicker and dippable for crudités or thinner and drizzly for tossing into salads.IngredientsMakes about 3 cups1cup creamy natural peanut butter¼cup fresh lime, orange, or lemon juice4oz. silken or soft tofu1Tbsp. soy sauce2Tbsp. honey or maple syrup, plus more for drizzling12\" piece ginger, peeled, finely gratedKosher salt¼cup unsalted roasted pumpkin seeds (pepitas), chopped unsalted dry-roasted peanuts, hemp seeds, or chia seeds (for serving; optional)PreparationStep 1Combine peanut butter, lime juice, tofu, soy sauce, and 2 Tbsp. honey in a blender. Place ginger in a fine-mesh sieve and hold over blender. Press down on solids to extract as many juices as you can; discard solids. Blend on medium-high speed to combine. With motor running, add ¼ cup hot water and blend until dressing is homogeneous, lightened, and smooth. If desired, add more water by the tablespoonful until the dressing reaches your preferred consistency. Taste and season with salt if needed.Step 2Arrange fruits and vegetables on a large plate. Transfer about ½ cup dressing to a small bowl, drizzle with honey and sprinkle desired nuts and/or seeds over (can be any/all/none). Transfer remaining dressing to a resealable container and chill for another use.Step 3Do Ahead: Dressing can be made 5 days ahead. Keep chilled.How would you rate Silky Peanut Butter Dressing?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI'm sure this will be delicious when I make it, but first, please make a correction:\n...as many juices as you can?\nGrammar, please!\nAs much juice as you can!Lisa KristelOyster Bay, NY3/19/2021This would be good in so many ways....with raw veggies, on pasta, drizzled on chicken, YUMMDreamerCT3/19/2021I added garlic and red pepper flakes as previous reviewer did.  I add to add almost 3/4 c of hot water, probably because the pnut butter was pretty solid.  I also wanted it as a dressing, not a dip, to serve on a lettuce, carrot, celery, and green onion salad with marinated tofu and chopped peanut garnish.  It tasted great!!!CaseyRockbridge Baths VA2/20/2021Just finished making this and nearly sliced my fingers trying to lick the blender clean. SO GOOD! I didn't bother juicing the ginger, just chucked the 2\" nub right in along with a tsp of red chili flakes and a big clove of garlic. Needed a bit more than 1/4 C hot water to get the mixture going, but it whipped up silky and creamy. I'm going to serve it with tons of veggies and I'm sure my friends will end up drinking it!AnonymousCalgary, Alberta7/17/2020Explore Bon AppétitSalad DressingSaladCruditéThaiSoutheast AsianAsianIndonesianTofuOther IngredientsLimeCitrusFruitGingerHerbs & SpicesSideRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Carla Lalli Music"]}