{"id": "e7b9f75e5c95796a240ae7c51d7f8899", "url": "https://www.bonappetit.com/story/emotional-expression-baking", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Emotional Expression Through Baking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Didn't Know How to Tell My Guy Friends I Cared, So I Learned to BakeIt’s not always easy to talk about your feelings, but making boxed brownies isn't hard at all.By Henry DawsonOctober 4, 2019FacebookTwitterEmailIllustration by Franz LangFacebookTwitterEmailI love bread. I love it unabashedly, passionately, obsessively. And I love to bake it, I’ve gone through forty pounds of bread flour in a week, I’ve eaten an entire loaf of brioche in one sitting. My new college dorm won’t feel like home till I’ve pulled something out of its oven.Baking bread is never the same twice––it changes with the weather, the tension in my hands, the seasons and their moods. Each loaf is the product of whichever instance of me made it. A thoughtful, long winter’s day might mean molasses, rye, pine nuts and seeds. If I am capricious and bold, it can be filled with olives and cracked pepper. If I bake for someone dear it will hold milk chocolate and softened butter.Sometimes I am convinced my friends tolerate me only for ready access to freshly baked goods. That’s fine. I’m happy to bake for them, and grateful that I have a way to show I care.The idea of baking as affection is not novel. Nor are those two concepts, baking and affection, entirely alien to men and male communities. But I’ve found both, conjoined or not, rare in such. This absence isn’t a flaw; it’s an opportunity. Maybe there’s space on the table for something new here.Life is not easy.It’s hard to say, “I care about you.”But it is not hard at all to make boxed brownies.I started baking the spring of my senior year at boarding school. At the time I was perpetually tired, usually hungry, and often sad. Tired, because of the academic and social pressure cooker of high school. Hungry, because I ate little in pursuit of a caloric deficit and the prospect of waking up closer to what I wanted to look like. And sad, because who is tired, hungry, and actually happy?The three years prior I lived in dorms with my closest friends. It was three years of sun and shenanigans, pick-up basketball, late-night Call of Duty Zombies marathons. Our friendships were fast and vulgar and full of banter.Then, in the spring of my senior year, I started to feel a distance. My friends were split into different dorms, caught up in home troubles, relationships, work; the coming sunset of a relatively idyllic high-school period. As we grew into our separate selves and our futures I began to feel isolated.My bad eating habits tanked my energy (a banana is not in fact an acceptable pre-workout meal if it’s all you eat before 3 p.m., Henry). Social interactions took a toll that they never had before. I thought I could just mope through this phase and eventually be back to my happy, normal self, but I couldn’t. I felt friends withdrawing. Fairly. I wasn’t always pleasant to be around.At home I had a wonderful family life, and at school I had great friends, even with the distance. But despite this, I still felt those odd growing pains; a morass I didn’t know how to cross.I was functioning poorly in the outside world, getting snappy with friends, skipping meals, shirking leadership roles I’d worked hard to earn. Tired, sore teens have an elemental affinity for darkness, so I sealed my window with two blankets and a Godzilla poster. Begone, light. Hello, dear gloom; I embraced hermitage and blue-light nights.One spot of vital brightness in this long stretch came from online cooking videos. I could sink into a couch and subsist off the dopamine hit from bright colors, friendly hosts, and happy discussions of yummy food.At the time I lived in a dorm with forty-something boys, most younger than me. While I sat in my dark room the younger boys hurtled through the halls outside, screeching and bouncing off walls like possessed rubber bullets. They would crash into my room, flooding me with light from the hall and their laughter. Then they’d be gone again, a whirlwind of energy that left me ruffled but inevitably happier.These boys became precious to me––the sophomore quarterback, the star soccer player with a huge smile who called me “Captain”; the kid who would wander into my room near midnight to flex in the mirror… I can’t explain what they were up to half the time, and it doesn’t matter. I could always rely on them to make me smile.I was grateful, and as time went on, I wanted to find a way to give back.One day I visited a female dorm to see a teacher. Dozens of lemon bars waited on the table, golden yellow and dusted with powdered sugar. Other days, they had treats like Oreo brownies, chocolate chip cookies, macaroons, and even an extra-ordinary smoked brisket courtesy of a fire savvy football coach. In the boys’ dorm we might have popcorn, potato chips, or on a daring day, charred burgers and hotdogs.At home, while I was growing up, my mom made desserts: crumbles, crisps, cakes and cookies. Even if I said no to the sweet night-cap after dinner I’d receive a plate with a small portion. My mom didn’t make desserts for herself; it was for us, her family. Saying no to that blueberry crumble would be like saying no to her love—the effort she put into everything was heartfelt, and it made a difference.I realize now this is what affection is—making real the warm thoughts you have for others.So, I set out to make brownies. Ghirardelli Triple Chocolate, prepared according to the extra fudgy introductions, and garnished with milk chocolate chips. Decadence: just add eggs. I scurried around campus in search of the necessary mixing bowls, cooking oil, and salt. As I did I spread the word in the dorm: Brownies would arrive at 10 p.m.I baked in the kitchen of a faculty apartment conjoined to our dorm, my tinny phone speakers spitting out guitar riffs from classic rock hits. The view from the window above the sink showed the ocean where twinkling oil rigs sat on a horizon above dark waters and beneath countless stars.Finally I had MacGyvered the batter and slid it into the oven, leaving myself and the kitchen spattered with stickily sweet sludge.Boxed brownies are supposedly simple. But waiting outside that dinky off-white oven, having promised food to dozens of hungry boys, I encountered that question every baker presumably comes to live with: Are they gonna like it?At 10 o’clock, the boys arrived, a stampede beating down my door. Panicky, I portioned the dessert onto paper plates where it crumbled into a pile of molten, cakey chocolate. The boys ate it with fingers and straight from the plate. I watched them talk and laugh around my brownies, feeling a cocktail of pride and relief and amazement that with this arcane process with bowls and oil and fire, poof! Brownies could exist where none had before.As a senior in the dorm I was supposed to take care of the younger kids and let them know I was there if they needed. But verbal check-ins felt forced, awkward.Baking could say everything I wanted to say.I realize now this is what affection is—making real the warm thoughts you have for others. Stumbling upon it in that small, quiet kitchen, afforded me a powerful emotional tool, and helped me get to a happier place.As a young man words like “I care about you” are awkward to say and awkward to hear. They got deflected in humor, brushed off, rarely internalized. No guy wants to be the first to open up; odds are you’ll be roasted.But as I discovered, a tray of brownies baked with the same sentiment as “I care” will inevitably be devoured, and the care and sweetness within them can’t be misinterpreted.Baking fit my needs. After that first triumph, I kept chasing the high, experimenting with biscuits, cookies, primitive chocolate-peanut butter brittle. I failed at boxed cake, which ended up dry and plain. I surreptitiously gave it to two sophomores to dole out, only to discover them later, huddled over the cake, hands and mouths stained with chocolate. Kaiser and Huy, I promise I was anything but mad.After weeks of feeling like I had been floating through life, I’d done something good. I’d reached no new culinary heights, sacrificed neither blood nor tears. But I made something sweet and gave it to people who mattered to me. It made them happy, even if only for the space of a bite.These small truths brought me joy when few things did.Then, one day, near the end of the year, a faculty member, Erik, taught me to bake sourdough bread. Erik had two children. I still remember him carefully scraping each bit of dough off his hands and collecting it in the bowl: “Each scrap is another bite for them,” he said.We made a simple white sourdough with a little rye sprinkled with rosemary and sea salt. It came out gorgeous. Rich and soft and chewy. It lit a fire in me.After graduation, finding free time on my hands, I dove in. My community was no longer a bunch of rowdy teenage boys. It was my family, caring and tight-knit. My health-conscious parents would not wolf down a tray of brownies, but wholesome sourdough bread? Gone in a day. I loved the feeling of feeding my family. I could reciprocate the countless gifts they’d given to me.Looking back it’s clear that learning to bake for my boys was right. They fed my soul, I fed them brownies. It was almost selfishly fortifying.That spring I found a way to take care of myself. A mode of expression that brings me joy. I’m a slightly better baker now. I’m happier, brighter. I think you can see that in the bread, the same way people say you can tell what kind of water went into the batter.There’s always something new. Rosemary chocolate challah; pepperjack sourdough buns; tiny, crisp baguettes, steaming, crackling, piping hot.And if I am tired, quiet, and thinking only of shuttered windows and sleep, I can always return to simple flour, water, salt, and time. Sweet and slightly sour and fairytale light.Explore Bon AppétitHealthyishBreadessayRead MoreLifestyleHow Cooking Made Me See My ADHD as a Talent Instead of a ShameBy Isabelle O'CarrollRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-04", "author": ["Condé Nast", "Henry Dawson"]}