{"id": "e7bebbd309141e93feae0c3cb63404f8", "url": "https://www.bonappetit.com/story/cooking-therapy", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "I Hired a Cooking Therapist to Deal With My Anxiety | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Hired a Cooking Therapist to Deal With My AnxietyI went in as a skeptic and emerged with a new perspective on food (and myself).By Zan RomanoffJune 16, 2021FacebookTwitterEmailIllustration by Sarah CliffFacebookTwitterEmailCooking therapy has me stressed before it even begins. After a calendar year of completely uneventful curbside pickups from my local grocery store, I get home on a spring Monday morning to discover that Vons packed only half of my order—which means that 30 minutes before I’m supposed to be in a virtual session with Debra Borden, LCSW, I have to make a last-minute grocery run. Even in normal times this would set me off—I hate being late so much that I am, instead, usually embarrassingly early—but of course I’m also worried that this trip inside my local Whole Foods will be The One That Gives Me COVID.Luckily, the recipe that Debra and I selected for our session is designed to address my tendency towards anxiety. It’s something she calls From Worry to Whistling: Zip-A-Dee-Doo-Dah Zoodles.I don’t think Debra knows that the song in the recipe name has racist origins. But she does know that it’s wildly corny. “You can roll your eyes,” she tells me during our intake session. “Everyone does. It's fun, though, too—that's what I like about it. My personality is definitely not Somber Therapist. Injecting a lot of humor is very important.”More than the puns, though, I’m wary of the zoodles, a food I traditionally do not eat, since I can and do enjoy real noodles in all their gluten-y glory. I could have avoided them—Debra customizes recipes based on clients’ likes and dislikes, as well as what they have in their pantries—but I decided that as long as I was trying cooking therapy, I might as well add a new ingredient to my repertoire.Cooking therapy felt like a good fit for me: I regularly unwind from long days of laptop-sitting by immersing myself in some good old-fashioned chopping and stirring. After navigating the trackless wilderness of composing a new draft as a freelance writer, the guidance of a recipe is a welcome relief, and the tactility of making (and sampling) tunes me into my body after hours spent mostly ignoring it. If all goes well, I have something delicious to eat at the end of my trials, and if not, I feel grimly virtuous for literally swallowing my mistakes, and grateful that I can try again tomorrow.In my session with Debra, we begin by draining my pre-packaged zoodles, which defrosted a little soggily. Debra encourages me to consider whether “something's been weighing you down, and this is the beginning of draining it out. What would you like to drain away?” As it happens, I’m two weeks out from my first vaccine shot, so we talk about trying to let go of residual Covid anxiety (hello, unnecessarily fraught grocery store trip), and trying to figure out how to allow myself to be calm after so many months of deeply ingrained worry.It goes on like this—I peel a cucumber and we discuss bitter outsides and sweet insides, as well as the seeds hidden within; we talk about the tartness of olives and the hard pits we find inside of ourselves, and how sometimes, you need to let something sit for a while before it’s really at its best, the same way this dish wants to marinate in its dressing for a few hours before I have it for lunch later in the day.Debra has specific names for the opportunities and assets that cooking therapy offers: primarily, they are metaphor, mindfulness, and mastery. The metaphors are sometimes obvious—there’s nothing subtle about kneading my frustrations into bread dough after a trying work call—but Debra specializes in encouraging patients to see each act and ingredient as symbolic of something deeper, a kind of concentration that encourages that second M, mindfulness. And if you can pay attention to the metaphors and learn something new about yourself—or even just make a tasty lunch—you get that sense of mastery: a little thrill of accomplishment that reinforces your belief in your own competence and skill.Debra came to cooking therapy somewhat by accident—as a licensed clinical social worker seeing clients in their homes, she found that people who wouldn’t open up to her in traditional therapy sessions were more willing and able to talk when they were absorbed in another task—walking, playing games, and, eventually, cooking. Today, she works with clients like me in one-on-one sessions, conducts group lessons, gives talks (“People think of it as legitimate clinical infotainment,” she says of the corporate retreats or book clubs that bring her in as a speaker), and sells an online course called Cook Yourself Happy.She isn’t the only cooking therapy practitioner, but she is one of the field’s best-known names. That’s in part because cooking therapy is a relatively recent development; the first educational course on the subject was developed by Michael Kocet, Ph.D. for The Chicago School of Professional Psychology in 2014. But the concept fits under the broader umbrella of experiential therapies, stuff like art or equine therapy. And experiential therapy is backed by experts who suggest it can augment the results of the traditional therapeutic model.Even if you find cooking frustrating, Debra says, you can get something out of cooking therapy, which may be a relief for the less culinarily inclined—or even just those of us who are sick of the inside of our kitchens after a year of enforced dining in. “I can't draw—it looks like a six year old’s work when I try,” she says. “However, I can draw pain, and frustration, and joy, and that's the thing with cooking therapy—it's really not so much about the love of cooking. Everyone has to make a bowl of cereal or a sandwich. We just mine it for what it can give us.”Throughout the session, I toggle between enjoying myself—untangling zoodles turns out to be a surprisingly meditative activity—and finding the whole thing a little bit much. Therapy is by its very nature an earnest enterprise, and it’s hard to get earnest with someone I don’t know very well, especially in my apartment’s kitchen, which isn’t particularly private. At one point my roommate wanders in to get himself a glass of water, which is fine since this is technically a work call, but at that moment I realize that cooking therapy really isn’t ideal for those of us who share kitchens with people we met on Craigslist.Like many people raised in a culture that praises thin bodies and stigmatizes fat ones, I haven’t always had a model relationship to food and nutrition. So it isn’t until I sit down to eat my zoodles, later that afternoon, that I manage to identify a real revelation.Like many people raised in a culture that praises thin bodies and stigmatizes fat ones, I haven’t always had a model relationship to food and nutrition. My experiences with disordered eating were brief and mild, the kind of thing I was able to overcome without dedicated therapy or medical intervention, and at this point I don’t think about them all that often. But they left me with certain behavioral tics, and one of them is that I don’t really eat salads, because they often leave me hungry, and always leave me sad. They remind me of a time when food was something I avoided and felt guilty about.And so, despite all of the work Debra and I did to prepare this meal together, when I sit down to a bowl of zoodles, instead of thinking about change and growth, what I’m letting go of and what I’m cultivating, I feel a mild panic rise in my chest. I find myself thinking: you only end up eating this if you’re afraid of the pasta you really want. If you eat this, it means you’re eating to be thin instead of to take care of yourself.To be honest, it’s scary. I have done a lot of work to be a person who isn’t afraid of a bowl of pasta. I don’t like messing with anything that might threaten that progress even slightly.Debra says she doesn’t recommend cooking therapy as a primary treatment for eating disorders; she advises it for folks with eating disorders “only after a client is in recovery and stable, and only if their primary therapist thought it was a good idea.”“Cooking therapy is less about nutrition and diet (although it can be customized), and more an experiential vehicle to self-reflection and clarity,” she says. But ultimately, there’s no getting around the fact that warped values and beliefs around, say, what constitutes nutrition can be present in a cooking therapy session. My issues with zoodles aren’t the point of Debra’s session, but there they are, right on my plate.But I am a Capricorn and a type-A person and an A+ student, and so I ate the zoodles. Not only that, I enjoyed them. I mean, mostly I enjoyed the feta and tomatoes and olives they were studded with, but the zoodles weren’t bad, and what’s more, eating them didn’t catapult me back to a moment when I would have deluded myself into thinking that they’d be a satisfying lunch. Instead, I went out and got a nice loaf of sourdough bread and ate a slice of that, buttered, plus some scrambled eggs. It was sort of a funny lunch, but one I enjoyed, and it kept me full until it was time to figure out what was going to be for dinner.That was the real moment of mindfulness, for me: after years of thoughtless repulsion from anything I categorized as “diet food,” I was finally able to ask myself questions about that instinct. I could consider it, and name it, and start to do some work to let it go. When I was 18 and 22, getting myself to the point where I could eat so-called unhealthy foods without guilt was The Work, but now, more than a decade later, maybe it’s time for me to stop assigning value to foods altogether, and to recognize that everything I eat is doing the important work of keeping me alive, whether it’s a grain bowl or a bowl of lasagne. I might not make zoodles a regular part of my routine going forward, but maybe I’ll feel less helplessly sad whenever I consider eating a salad for lunch.I’ve tried plenty of therapy modalities over the years, and what I’ve learned is that, generally speaking, they only work as well as you work them. Cooking therapy certainly isn’t for everyone—it has many of the same barriers to entry as traditional therapy in terms of the cost of a private session, which begins at $250 for an individual (not to mention the cost and time spent acquiring ingredients for a particular recipe). But if you’re open to it, it can give you a new perspective on an activity you likely do multiple times a day, every day, and ask you to re-encounter yourself without the numbness of habit.“You’ll find yourself doing it on your own, eating cereal and thinking, ‘this is just like me, soaking up everyone’s stuff,’” Debra tells me at the end of our session, and it’s true: often when I go to cook something now, I find myself wondering what it might mean to me, thinking about how dried beans bloom and soften after a long, slow soak, and how putting a little fat in the pot with them makes the end product taste so much better. By which I mean, don’t be afraid of zoodles, but don’t be afraid of the luxury of fat, either! Or, as Debra might ask: What small indulgences can improve your day more than you’d expect?Explore Bon AppétitHealthyishessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-16", "author": ["Condé Nast", "Zan Romanoff"]}