{"id": "e7c3d4effde4bf8335741836c4e03f32", "url": "https://www.bonappetit.com/story/how-to-sleep-better", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "How to Sleep Better: My Crazy Expensive Quest | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Went on a Crazy Expensive Quest for the Best Sleep of My LifeDid you know we're living in the golden era of sleep technology?By Rachel Sugar January 9, 2018FacebookTwitterEmailIllustrations by Camilo HuincaFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.I don’t want to brag, but I have always considered sleeping one of my greatest strengths. I like to think that I’m good at other things, too—charades, mostly—but my advanced sleep abilities have always been a particular point of pride. I can sleep anywhere, at any time. One summer, I lived in a house that was struck by actual lightning, which I know only because someone told me. (I was sleeping.) It is perhaps my greatest virtue, next to being tall.And so I have generally been pleased to see that sleep is now considered VERY IMPORTANT, according to many scientists and also Arianna Huffington. Adequate, high-quality sleep will make us: nicer, smarter, more productive, more emotionally stable, less sick, and potentially less cancerous.If you want to sleep better, there is standard advice, which is good and free. Go to bed at the same time, and wake up at the same time. No caffeine after 2 p.m. Work out, but not in the evening. Cut back on alcohol; use blackout curtains; reserve your bed for sleep and sex but never Netflix; keep your room cool. I know. But I am an advanced sleeper; I wanted advanced sleep.Luckily, we are living in a golden era of sleep technology, where you can get “smart pajamas” with “bioceramic gel” and head-chilling pillows and lamps that simulate sunlight and goggles to lull you into “the theta brainwave state.” With great enthusiasm and minimal commitment to the scientific method, I vigorously tested five of them.The $125 Sleep MaskLet us first address the elephant in the room: The Monkey Mind Band is a sleep mask that costs $125. Onward. According to the copy on the company’s website, this mask is “coated with a dense layer of pure silver ions,” which creates a “conductive shield that reflects and neutralizes the damaging effects of artificial light and electro-pollution” and can also reduce inflammation and kill “face bacteria,” which are what give you pimples. I think. I have no idea how much of that is actual science, but I do know that the MMB, as we’re calling it now, is a magical cocoon for your face. While most sleep masks are essentially eye-bras, the MMB cradles your entire head, smooth and unstructured. Every evening, you retreat into it, and every morning, you emerge a well-rested butterfly. Buy Monkey Mind Band, $125.The Sheets That Keep You From Waking Up In A SweatI have long maintained that temperature is very important for sleep, so it is nice to see that science agrees with me. Did you know the best temperature for sleeping might be as low as 60.8 degrees? Unfortunately, my landlord does not know this—I live in a year-round tropical paradise—so I was very excited by the idea of SHEEX. Unlike their cousins, “sheets,” SHEEX are 87% microfiber polyester and 13% spandex and are designed to “transfer body heat 2X more effectively than traditional cotton” and “breathe nearly 50 percent better,” thus reducing “sleep-disrupting temperature fluctuations at night.” I hate sleep-disrupting fluctuations and also love the texture of gym clothes, so I’m very into this, on a theoretical level. On a practical level, I slept…fine? I didn’t sweat, but I also didn’t feel unusually temperate, just, like, regular temperate. Still, they were very good at covering my bed. Buy Sheex Original Performance Set, from $159.The Anti-Snoring Pillow That’s Also a SpeakerThis is a cushy and enormous pillow—the Great Dane of pillows—so thick it can be stuffed with eight built-in speakers (to stream music/sleep tracks), a three-axis gyroscope (to monitor movement), two adjustable vibration motors (to react to snoring), and a decibel-tuned microphone (to pick up said snoring) and still feel very soft. It will play you soothing sounds, or tunes, or podcasts from your phone while you fall asleep at night. It will wake you up in the morning with a gentle deep-head vibration at what is supposed to be “an optimal time in your sleep cycle,” which it knows, supposedly, because it has been tracking your sleep all night. You set all this up—the alarm, the music—in the ZEEQ iOS or Android app, which connects to the pillow via Bluetooth. Then in the morning, the app presents you with an analysis of your sleep and a numerical “score.” It’s a lot for a pillow! I kept accidentally disconnecting ZEEQ from Bluetooth by futzing with my phone after I’d set it for the night, but I see that mostly as a personal weakness. My bigger concern is ZEEQ’s sleep scoring, which gave me extremely high marks, even on the night I know—know!—I slept approximately not at all. Then again, I found the vibrating wake-up call rather pleasant, and it is by far the best way I know to stream music directly into the back of my head. Buy ZEEQ Smart Pillow, $199.99.The Personal Temperature Control SystemI had high hopes for the BedJet because, as we have established, I am passionate about temperature management, and the BedJet is like a private HVAC system just for your bed. It not a subtle apparatus—there’s a box that clamps to your bed, and then a hose that jets air into an “AirComforter,” which is actually a special top sheet designed to go under your regular comforter. (You can also use your own boring top sheet, if you are less passionately devoted to temperature management.) Once I got past the instruction manual, which outlines all the ways PERSONAL INJURY COULD OCCUR, I basked in the absurd luxury of absolute climate control. Last night, for example, I was cold, so I turned on the “heat” setting for a toasty blast of hot air, but then this morning, I was hot, so I turned on “cool” for some intimate ocean breezes. There’s a remote control, but I used the app, which, coincidentally, is also styled like a remote control. Does it use a lot of energy? Yes, yes it does (between 700 and 1000, according to my energy meter; don’t ask). But it shuts off automatically, which is important, because you’re supposed to sleep cold, remember? Also, trees, or something. The BedJet is the closest I will ever come to being royal. Buy BedJet V2 Climate Comfort System, $299 and AirComforter Sheet Accessory, $159.00.The Stealth Sleep MonitorThe SleepScore Max is an unobtrusive little box that looks like a speaker and uses “bio-motion sensors” to “measure respiration and body movement to accurately quantify your sleep.” Without even touching you, like a ghost! It works with your smart phone to monitor your sleep—and your sleep environment—and then to analyze your sleep, and then to score your sleep, and then to give you recommendations about how you could sleep better. (Obviously, it also has a smart alarm.) When I set it up, the app (iOS or Android) asked for a whole lot of info about my height and age and mattress and general sleep habits and sleep goals and chronic medical conditions, and while I love quizzes about myself, the more important result is that I got a nightly “sleep score” that seemed generally to correspond with how I’d actually slept. “Cool down to improve your REM,” it told me one morning when I awoke to a truly embarrassing score of 75. The insights get better as you go, supposedly—the really deep stuff comes after 30 days of consecutive use, which is longer than I’ve had it—but you start getting fun graphs of your sleep habits immediately, which, in addition to constant validation, is mostly what I want. Buy Sleepscore Max, $149.99.Explore Bon AppétitHealthyishFeel Good Food PlanTrendsRead MoreLifestyleHow to Be a Night Owl in a Morning Person's WorldBy Amy SowderRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Rachel Sugar"]}