{"id": "e7c3295a310f2501e3da855b29b2e4ef", "url": "https://www.bonappetit.com/story/zwilling-fresh-and-save", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "The Zwilling Fresh & Save Means My Leftover Avocado Halves Will Never Go Brown Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Leftover Avocado Halves Will Never Go Brown AgainEverything sucks with the Zwilling Fresh & Save Vacuum Sealer.By Alex BeggsMay 13, 2021FacebookTwitterEmailPhoto Courtesy ZwillingFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I’m standing in the kitchen, sucking all the oxygen out of a bottle of wine I didn’t finish.I’m vacuum sealing an apple fritter into a smushed brick for someone special’s lucky day dessert.I’m watching nearly expired leeks get preserved in plastic, squeezed and compressed like a sorority sister in a bandage dress.I LOVE MY VACUUM SEALER.While researching new kitchen appliances because it’s my job and my passion, I came across Zwilling’s Fresh & Save vacuum food storage system. I don’t sous vide, so I’d never had much use for vacuum sealing—but what a world I was missing! A world without oxygen.The Zwilling Fresh & Save vacuum pump is a handheld, cordless, rechargeable mini-vac about the size of a pepper grinder. By vacuum sealing your leftovers, from lasagna to parsley to spelt flour, you can extend their shelf life by days to weeks to months. (You could also use them to store dry pantry goods, like in the photo above.) Zwilling says food lasts, on average, five times longer when it’s vac sealed, and because ~30 percent of the food we bring home from the store ends up being wasted (oof), it’s nice to think that we might waste slightly less by using this thing. If you’re only cooking for one, the vacuum sealer is a godsend for leftover ingredients that might otherwise go bad, like avocado halves. (They don’t brown!)Photo Courtesy Zwilling How it worksFirst, you need the reusable plastic bags and/or containers—which come in plastic or glass—that Zwilling makes to go along with the vacuum pump. (That part is annoying, because I hate having mismatched containers. But this is a whole system, so Zwilling envisions this being your one and only, I guess.) The containers are dishwasher-safe, but you’re better off hand-washing the bags so you can get into the corners.With the vacuum sealable bags, you can sous vide if you’re into that, or use them to compactly store cookie dough and whatnot in your freezer, as I did, so you have more room for your quart containers of meal-prep martinis.Both the containers and bags have these round plastic belly buttons that you align with the vacuum pump’s circular rubber nozzle. Press a button on the pump and a little motor whirs while it sucks the oxygen out of the container. When there’s no more oxygen left to suck, the vacuum turns off automatically and you press down on the container’s red belly button to seal it tight.The process itself is almost more enticing than the reward of surprisingly fresh parsley. Watching anything get vacuum sealed in a plastic bag, becoming a futuristic play food version of itself, is hypnotizing. The sense of satisfaction that washes over me as my frozen blueberries get squeezed into their plastic Spanx is what incentivizes me to vacuum seal more, more, MORE!Removing the air from the storage containers isn’t as exhilarating, but with the containers you’re able to vacuum seal almost anything, from leftover fish that you know would’ve been neglected and ultimately thrown out to an entire cake. (I sealed a lemon pound cake into its oxygen-less coffin and it stayed moist for over a week.) Zwilling makes a little bento box, too, so you can keep your lunch as fresh as it was when you threw it together in the dark.You can—and should—also get the wine bottle toppers so you can save half-empty bottles of Cab Franc for later in the week. (Do not attempt this on sparkling wine, lest you vacuum up all the bubbles.) When you release the wine topper, it lets out the most thrilling psssssssfffffft, like a frosty bottle of Pepsi. It even sounds fresh!A list of the things I’ve vacuum sealed latelyA wedge of ParmesanSpelt flour I bought too much of to store in the freezer (*be careful—you need to manually stop the sealer before any tiny flour particles start to get sucked into the mechanisms)So much wineA nice rice saladA few jalapeñosFrozen buttermilk biscuit doughFrozen blueberriesFrozen HEB tortillas (thanks, Dad!)An entire pistachio loaf cakeApple slices (boring)A single sprig of mintA ham hockBaconMy feelingsBut here are the things you can’t vacuum seal—consider yourself warned!Don’t seal anything with liquid, which will clog up the machine. NO marinated meats. NO soup. Soft foods, like blueberries, may need to be frozen before sealing so they don’t turn to jam. When I seal softies like doughnuts (have done this multiple times to rave reviews), I manually stop the sealer before it squishes the apple fritter too much, and hours later my preserved doughnut will be able to bounce back, resurrected and ready for dessert.And finally, if you hold the vacuum up to the frown line in between your eyebrows—worth a shot, at least once—know that it won’t suck the wrinkle there out of its deepening crevice. You can’t vacuum seal the inevitable.ZWILLING J.A. Henckels,LLCZwilling Fresh & Save$80 at Amazon – 6 Piece Set$125 $100 at Zwilling – 7 Piece SetExplore Bon AppétitShoppingHighly RecommendToolsStoringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-13", "author": ["Condé Nast", "Alex Beggs"]}