{"id": "e7d10e8bb39fc89eed94362ffc64847f", "url": "https://www.bonappetit.com/story/full-english-breakfast-at-home", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "The Best Full English Breakfast Is the One You'll Make at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Full English Breakfast Is the One You'll Make at HomeIt seems like a lot to cook, and that's because it is. Embrace it.By Alex DelanyOctober 5, 2018FacebookTwitterEmailPhoto by Alex DelanyFacebookTwitterEmailOn a recent Sunday I did something for the first time: I made a full English breakfast at home. This morning fry-up is not only one of the great dishes of the United Kingdom, it’s also one of the great dishes of Breakfast. Period. Most of the time though, this formidable plate only shows up in restaurants, pubs, and diners. It rarely happen at your buddy's house, because let’s face it, there’s a lot going on. There’s a lot to cook.But, if you have a lazy Sunday that would otherwise be spent rolling around in bed, telling yourself that the fifth alarm you set will surely be the last, you should go ahead and make the full English. You don't even need every single aspect of the traditional full English. Mine wasn't made to full capacity. I didn't have bacon or black pudding. But even if you can only go for about 75 percent, you should still do it. Because I promise you, if you commit yourself, your homemade English breakfast will be the best of your life. Here’s the version that I co-sign:How to Cook Sausages So They're Not Weirdly Raw Inside (or Burnt)This method is perfection.View StoryThe MeatsThere are usually two meats in a full English fry-up. One is fine, but we’re here to go all-in. For me, sausage is a must, especially links packed with sage and high-quality pork. I like to par-boil mine and then sear them on high heat to get a crispy casing. For the secondary meat, bacon is fine, but a slab of hard-seared ham is where it’s at. Breakfast ham needs more love. Don’t forget about breakfast ham.The BeansYou might be thinking, This dude is not going to tell us to open a can of baked beans, heat it up, and call it a day; Bon Appétit is better than that. And you’re right. I’m going to tell you to open a can of baked beans, add a couple things, heat it up, and call it a day. I have nothing against canned baked beans, but they get exponentially better when you add a spoonful of mustard and a splash of vinegar. I prefer dijon and red wine vinegar, but do what feels right for you. Just no yellow mustard, please.Crispy Smashed Potatoes With Walnut DressingAnd on top? A condiment made up of walnuts, anchovies, garlic, and red pepper flakes that’s the ultimate umami bomb.View RecipeThe PotatoesBreakfast potatoes have a long history of awfulness. I wish I didn’t have to say that, but home fries, undercooked hash browns, and potato wedges give me no other choice. Here’s the good news: You’re in your own home. You have control over the fate of your breakfast potatoes. Which is why you will be making the best potatoes in existence: crispy smashed potatoes. You don’t have to follow the entire recipe above, just the boil-then-roast technique. You’ll get crispy little starch nuggets that put whatever your local diner serves to shame.BA's Best Soft Scrambled EggsView RecipeThe EggsI am not going to declare one type of egg as the best for a Full English. If you care about tradition or the photogenic nature of your dish, go for some olive-oil-fried eggs. Your Aunt Sharon will double-tap for the big yellow yolks. Or you could go my way and do a scramble, the collaborator's choice: easy to portion off, and readily accessible to everything else on the plate. You can also poach or soft-boil or whatever. As long as there are warm, properly salted eggs on the plate, I really don’t care.Seared Mushrooms with Garlic and ThymeOur idea of magic mushrooms is crisp, golden (legal) substances with the power to lend a bass note of flavor to grain salads, turn a piece of ricotta toast into a meal, or stand alone as a savory side. View RecipeThe ’ShroomsThe mushrooms are easily the most frequently messed up portion of the full English breakfast. Don’t put some rubbery, squeaky, pizza-parlor-type mushrooms on my plate. What I want are golden, crispy, brown-butter-drenched, herb-packed ’shrooms. And I don’t want just one kind. An eclectic mix of oyster mushrooms, shiitakes, and maitakes make your plate look like an enchanted forest—that also tastes damn good.Photo by Jake StangelThe BreadToast is what links all the elements. It joins ’shrooms and beans, sausage and eggs, tomatoes and potatoes with a gentle scoop. You should never neglect your toast, whether it happens to be rye, a crusty sourdough, or good old-fashioned white slice. It's there to help you.Photo by J ShepherdThe Black Pudding?Okay, here’s the thing about black pudding: I don’t want to eat it, unless it’s high-quality stuff. I’m not going to a run-of-the-mill grocery store to buy black pudding. No thanks, Chief. So this is my official statement: If you only have access to questionable black pudding, skip it. If you have the good stuff, fry it up and invite me over right now.Buttered Tomatoes with GingerThis versatile peak-of-summer condiment can be served on top of white rice, pasta, toast, steamed fish, steak, or roast chicken.View RecipeThe TomatoesThe unsung hero of this breakfast experience is the tomato. If you don’t agree, it’s probably because you’ve never had an English breakfast with good tomatoes. When they’re warm and buttery and caramelized, you can swirl them into your eggs, spread them across toast, or soak little bits of sausage in the juices. It’s the bright hit of acid that this formidable plate needs. I like to cut some heirloom tomatoes into wedges and toss them in a bunch of melted butter and herbs, before throwing them in the oven at 450, but you could also do a skillet setup like the recipe above.The BeverageIf you’re a narc, you’ll drink a glass of milk. If you employ a deep commitment to the breakfast game, a cup of black coffee and a pint of stout. That’s the move. Trust me.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-05", "author": ["Condé Nast", "Alex Delany"]}