{"id": "e7d372f43477b63e3ab0dd3a156d03b3", "url": "https://www.bonappetit.com/recipe/chopped-dinner-salad-with-crispy-chickpeas", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Chopped Dinner Salad with Crispy Chickpeas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChopped Dinner Salad with Crispy ChickpeasBy Claire SaffitzApril 17, 20184.7(12)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThis salad is a real winner, but the combo of crunchy veg + lettuce + creamy cheese + pulled protein + crispy topping is universally delicious—make it your own by swapping in whatever odds and ends you have lying around. And that all-purpose vinaigrette is delicious on pretty much any salad, be it the main event or a simple side dish.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketColander$11 At AmazonPaper Towels$13.45 At AmazonMedium Skillet$60 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonMicroplane$16 At AmazonLarge Bowl$18 At AmazonWhisk$10 At AmazonIngredients6 servings115-oz. can chickpeas2Tbsp. plus ⅓ cup extra-virgin olive oilKosher salt, freshly ground pepper1small rotisserie chicken1pint cherry tomatoes2Persian cucumbers16-oz. block feta cheese in brine½cup jarred peperoncini1small garlic clove3Tbsp. red wine vinegar1tsp. dried oregano½tsp. sugar2romaine heartsPreparationStep 1Pour 15 oz. chickpeas into a colander, rinse, and shake off excess water. Pat chickpeas dry on paper towels. Heat 2 Tbsp. oil in a medium skillet over medium-low.Step 2Add chickpeas; season with salt and pepper. Cook, shaking skillet often and reducing heat if chickpeas are browning too quickly or popping all over the place, until golden and crispy all over, 10–15 minutes. Let cool.Step 3While chickpeas are sizzling away, move on to your salad prep. Using clean hands, remove skin from 1 rotisserie chicken; discard. Pull meat from bones and shred into bite-sized pieces. Keep going until you have about 4 cups; save any leftover chicken for another use.Step 4This is going to require a lot of chopping, so start your engines! First, slice 1 pint tomatoes in half lengthwise.Step 5Slice 2 cucumbers in half lengthwise, then place on flat sides on cutting board and slice crosswise into thin half moons.Step 6Cut 6 oz. block of feta into small cubes.Step 7Thinly slice ½ cup peperoncini.Step 8Peel and finely grate 1 garlic clove into a large bowl. Add 3 Tbsp. vinegar, 1 tsp. oregano, and ½ tsp. sugar and whisk to combine. Season generously with salt and pepper.Step 9Slowly drizzle in remaining ⅓ cup oil, whisking all the while, until a thick dressing forms.Step 10Add chicken, tomatoes, cucumbers, feta, and peperoncini to bowl and toss to combine.Step 11Slice 2 romaine hearts crosswise into 1\" pieces and add to bowl. Season with more salt and pepper and toss again to combine (clean hands make the best salad tossers!).Step 12Scatter crispy chickpeas over top of salad and serve.How would you rate Chopped Dinner Salad with Crispy Chickpeas?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleGreat salad! I found there to be plenty of dressing, and it was a delicious dressing.AnonymousColumbia, SC1/11/2020I love this salad and have made it over and over. Makes a huge amount, which is good because its hard to stop eating this!AnonymousIndiana, USA11/19/2019Easy and giant salad. Based on everyone's comments I 1.5x'ed the dressing and added olive oil, salt, pepper, and some of the peperoncini liquid for some extra punch. This easily made 2 dinner servings and 3 leftover lunch servings. mhdsileskyAustin, TX6/24/2019Easy and versatile salad recipe, and easy to make vegetarian! Have already made multiple times.AnonymousNashville, TN5/31/2019I made this as a part recipe so I can't comment on the quantity of dressing. I poached the chicken, didn't have any peperoncini, and used sherry vinegar all of which seems to be a relatively minor deviation. We enjoyed it and will make again. It was a bit bland but it's chicken. I'd be tempted to use roasted thighs with the skins crisped, chopped, and sprinkled over.\nrigf1Chatham, ON7/16/2018Made this last night in the middle of a heat wave here and it was a refreshing and hearty salad.  As suggested by another user, I made 1.5X the dressing and that seemed to be just enough.  We sliced some avocado for the top. Next time I'll add kalamata olives too - and maybe some sliced hearts of palm? It could use a little more flavor, but we liked it a lot.  AnonymousSanta Barbara7/7/2018This was okay, not great. It was a bit bland, even after I added red onion, kalamata olives and chopped parsley. Definitely suggest you make 50% more dressing than recommended. The dressing was really good - I'd make that again.AnonymousSan Francisco7/1/2018Outstanding flavors are created with these ingredients being combined. Our teenagers, and the adults, couldn't stop having additional helpings. I will definitely be making this delicious recipe again. Thanks for sharing it.dorothygraBaltimore4/23/2018Explore Bon AppétitSaladChickpeaBeanVegetableChickenPoultryEasyMainNut-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Claire Saffitz"]}