{"id": "e7ddf48bc588c1cae3399e34a2cfa8cf", "url": "https://www.bonappetit.com/story/fancy-tomato-salad", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "Why Be a Tomato When You Can Be a Fancy Tomato? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy Be a Tomato When You Can Be a Fancy Tomato?Make this when no ordinary tomato salad will do.By Carla Lalli MusicAugust 1, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I’m the first person who will tell you that when tomatoes are good, you really don’t have to do much to them. Some salt, a little olive oil—that’s a tomato salad. You’re done. Got a basil sprig and some mozz? Cool: now you’ve got a caprese. But when peak tomato week hits, it’s time to go glam. For runway-ready tomatoes, make this juicy, herby, tangy, crunchy, spiced-up situation right here.This salad is like a fattoush, but without the cucumbers. It’s like panzanella, without the giant croutons. It’s Greek salad without the grape leaves. It’s got all sizes of beautiful tomatoes cut into attractive halves and wedges. It’s got planks (not crumbles, and not cubes—planks) of crumbly feta. It’s got a fragrant dressing built on za’atar, the Middle Eastern dry spice made with sesame seeds and thyme and sumac and other things depending on who made it or where you got it. It’s got a little lemon to dial up the natural acidity of the tomatoes, honey to amplify their sweetness, and garlic to coax out their savory flavors. It has it all.Want this letter before it hits the website? Sign up for our newsletter!It’s also got pita chips. Stacy’s “Simply Naked” pita chips are the unofficial official pita chip of the Bon Appétit Test Kitchen since forever. I don’t know much about Stacy or where she learned her craft, but that woman knows her way around a pita chip, and I appreciate the use of the word “naked” in a product name. Her chips are very important to this salad. Not only are they the ideal firm-but-shattery texture, but they are also exquisitely salted. They absorb the tomato juices and dressing in a unique way, so that the pita rafts become semi-saturated but manage to stay crisp. It’s a phenomenon the Bon Appétit editors like to refer to as “crispy-gone-soggy,” but you will finish this salad before any sog happens. It’s more of a “crispy-gone-soaked” effect, like when you dip a just-fried tortilla chip into fresh pico de gallo.The recipe calls for a mix of heirlooms and cherry tomatoes, but you know what? Buy the best-looking, ripest, most fragrant tomatoes wherever you happen to be shopping, be it the farmers market or grocery store. Or pick them from your own garden, if that’s your situation! I have found that sometimes field-grown beefsteaks are the best and most beautiful, and other times I suck it up and indulge myself in heirlooms, despite the $5 per pound price tag. Good tomatoes should smell like something when you press the skin against your nose and inhale, and they should feel heavy for their size, which means they are filled with juice and are not mealy.You will expend very little effort making this salad, and yet, it will be very beautiful. Doing all of the things we tell you to do may indeed make you feel that the recipe is a little fancy. One hundred percent of people who have made the salad would make it again; be encouraged. The tomatoes are worth it. You’re worth it.Get the recipe:Fancy and Beautiful Tomato SaladHere’s the first thing you should make when you want to show off the peak-season tomatoes you’ve been waiting all year for.View RecipeExplore Bon AppétitCarla NewsletterTomatoSaladRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-01", "author": ["Condé Nast", "Carla Lalli Music"]}