{"id": "e7de01f2dcba12e3ee9e9024ed9e1e76", "url": "https://www.bonappetit.com/story/by-tae-handroll-lunch-counter", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "손맛 By Tae in Seattle Is My Lunchtime Happy Place | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis 8-Seat Hand Roll Counter in Seattle Is My Lunchtime Happy PlaceWhere else can you get a mini tasting menu of soft tofu, pristine nigiri, miso soup, and perfect handrolls?By Julia KramerJuly 9, 2019FacebookTwitterEmailPhoto by Kyle JohnsonFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.What do you call a place that serves a prix-fixe meal of nigiri and hand rolls, and yet is the polar opposite of a hushed, reverential, pit-in-the-bottom-of-your-stomach-when-you-see-the-check expensive omakase? 손맛 By Tae.About the name: Most people just call this eight-seat counter in Seattle’s Chophouse Row “By Tae,” and chef-owner Sun Hong is fine with that. But technically, the first word of the name is the Korean idiom that transliterates as sohn-mat. Per Hong, “Sohn means hand and mat means taste, and the translation is ‘handmade taste’ or ‘taste of the hands.’ 손맛 is when you see an old Korean lady macerating cabbage to make kimchi; her hands are putting that flavor in there.”Hong at the counter\nPhoto by Kyle JohnsonEvery bite you’ll eat at By Tae bears the imprimatur of Hong’s hands, and I mean that in the most appetizing way possible. It works like this: You show up to the counter at 11:30 a.m. and scribble your name on the sign-up sheet for one of three seatings. (손맛 By Tae serves only lunch, only on weekdays.) When the counter originally opened, the idea was to serve a hand-roll set: three generous rolls for $25. But on my visit, the meal started with soft tofu heaped with fresh pea shoots, two perfect bites of nigiri, and a paper cup of miso soup—before the succession of nori-wrapped handrolls bursting with scallops and pop-y salmon roe began. Hong seemed to know most of the other folks seated at the counter, bantering with some bros from the upstairs co-working space while seemingly simultaneously handling the rice, slicing the day’s fish, and ringing up to-go bento-box orders.In this era of the status omakase, the whole experience was so refreshingly...chill. Not to mention way more delicious and finessed than I expected from a lunch that cost barely more than my typical high-concept grain bowl (she says with shame).Go there: 손맛 By TaeExplore Bon AppétitHighly RecommendSeattleRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Julia Kramer"]}