{"id": "e7e647ac8730f7bdad64c799a46096a9", "url": "https://www.bonappetit.com/story/flat-pastry-brush", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "Why You Need to Buy a Better Pastry Brush | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s Time You Retired That Ratty Pastry Brush From 20 Years AgoIf you remotely care about baking, do yourself a favor and get a better brush.By Sarah JampelMarch 12, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.My parents’ kitchen is a baker’s heaven: Compared to my closet-kitchen in NYC, it’s a palatial wonderland, with clean, cold countertops perfect for rolling out doughs of all kinds. But there’s one major problem: Their “pastry brush” is a crime against all bakers, neat-freaks, and snobby/spoiled children everywhere.Dried, matted, and strangely sharp, it looks like the mane of a Barbie doll gone through the washing machine. It scratches rather than caresses, threatening to tear soft doughs and leave behind a good hunk of its bristles. And—what’s that? A little piece of meat stuck in its hairs? Some barbecue sauce that’s glued the threads together?If you love to bake, you need a soft, flexible, fine-haired pastry brush, if only for applying the egg and cream washes that give pie crusts, biscuits, puff pastry, brioche, even stromboli, that shiny golden finish. A spoon, butter knife, paper towel, or (new) toothbrush is not a sufficient substitute (trust me, I’ve tried them all).But that’s far from the end of their utility: Reach for a pastry brush when you want to gently flick excess flour off rolled-out dough, glaze a tart or cake, moisten the cake layers with a soak or syrup as you assemble, wipe crystallized sugar off the side of a pot while making caramel, or thoroughly grease a pan. A brush will help you make sure melted butter reaches all of its nooks and crannies (looking at you, Bundts). I prefer a brush with natural or Nylon bristles for such delicate tasks—it’s like a fine-tooth comb compared to a Silicone brush, which is the bulky hair brush of the pastry world. (Buy a Silicone brush for meatier tasks—and never let it touch a pastry.)Some kitchen tools are invaluable but take up a big share of real estate (food processor, stand mixer). But a pastry brush? You won’t even know it’s there—that is, until you remember and drop to your knees in gratitude. When legendary cookbook author, pastry chef, and chocolatier Alice Medrich was 22 and living in a shoebox-sized apartment in Paris with only one drawer in the so-called kitchen, she still had a pastry brush.Use a soft pastry brush to apply sweet syrup to layer cakes before you stack them.\nIf you’re only going to buy one, make it all-purpose: flat and between 1 and 1½ inches wide, with natural or Nylon bristles. Broad enough to brush a layer of vanilla-bean infused butter on cinnamon roll dough but tapered enough to coat every strand of your elaborately-woven pie, it’s the perfect starter brush.Most bakers I know prefer brushes with natural bristles for their especially gentle touch. The biggest problem is that they don’t last forever. Even if you care for it properly—rub warm, soapy water through the bristles, rinse thoroughly, then blot dry and lay flat to air-out—it will start to shed its hairs eventually. Don’t hesitate to cycle out the old faithful when it’s starting to bald or smell. (Luckily, the price is not too steep!)There are so many shapes and sizes, you could even start a niche collection. (My friend and baking guardian angel Erin McDowell uses small, rabbit-soft paint brushes to ensure that egg wash evenly coats every crimp and lattice of her beautiful fruit pies.)I’m not saying you have to go this far (though I am saying it might bring you immense pleasure!), but I am saying: You need at least one good-quality pastry brush in your kitchen—even if you only have one drawer! (And if you’re reading this, Mom or Dad, please know that the next time I’m home, I’m taking your ratty one from 1975 and throwing it away.)Photo by Chelsie Craig Carlisle Sparta Pastry Basting Brush$11 at AmazonExplore Bon AppétitShoppingToolsBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-12", "author": ["Condé Nast", "Sarah Jampel"]}