{"id": "e7edc7ac4a71b394c9218bb32f2feb79", "url": "https://www.bonappetit.com/recipe/air-fryer-crispy-brussels-sprouts-with-honey-butter", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "Air Fryer Crispy Brussels Sprouts With Honey Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAir Fryer Crispy Brussels Sprouts With Honey ButterBy Rachel GurjarOctober 7, 20214.4(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintBrussels sprouts are perhaps the ideal vegetable for air-frying because their thin leaves turn supremely crunchy. We then take things a step further by tossing them in a warm and buttery turmeric honey glaze with lemon and ginger that screams holiday. Remember to shake halfway through cooking for maximum crispiness!All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCOSORI Air Fryer Max$120 At AmazonSmall Saucepan$155 At AmazonWhisk$10 At AmazonIngredients2 Servings1lb. brussels sprouts, trimmed, halved2Tbsp. plus 2 tsp. extra-virgin olive oil1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more1Tbsp. plus 1½ tsp. finely chopped peeled ginger1½tsp. ground turmeric⅓cup honey4Tbsp. cold unsalted butter, cut into cubes½tsp. (or more) crushed red pepper flakesJuice of 1 lemonSpecial equipmentAn air fryerPreparationStep 1Heat air fryer to 400°. Toss brussels sprouts with 2 Tbsp. oil in a large bowl to coat. Season with salt.Step 2Transfer brussels sprouts to air fryer and cook, shaking halfway through, until crispy and golden brown, 7–9 minutes.Step 3Meanwhile, heat remaining 2 tsp. oil in a small saucepan over medium. Add ginger and turmeric and cook, stirring, until fragrant and ginger is slightly softened, about 1 minute. Add honey, butter, red pepper flakes (add more for extra heat), and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt and whisk until emulsified, about 1 minute. Increase heat to medium-high, whisk in lemon juice (mixture will bubble up quite a bit, then settle). Cook, whisking constantly, until thickened enough to coat the back of a spoon, about 2 minutes. Remove sauce from heat.Step 4Transfer brussels sprouts to a platter and drizzle sauce over.Do ahead: Sauce can be made 2 days ahead. Let cool. Transfer to an airtight container; cover and chill. Reheat with 2 Tbsp. water in a medium skillet over medium, whisking until emulsified.How would you rate Air Fryer Crispy Brussels Sprouts With Honey Butter?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleReally great recipe! I tried it out to see if I wanted to add it to my Thanksgiving meal, and the answer was a resounding yes!SunginaOrange County, CA11/16/2021I just made for Dinner tonight. \nThat sauce is OK . but Sprouts are pretty much hard for senior person or people doesn't like hard stuff..\nI recommended before you rare air fryer, I think need to be Boiled or Microwave for Vegetables.\n \n YuriCA11/2/2021I wonder if this would work without an airfryer? maybe as a roasted dish?Toni ReitterAlaska10/27/2021The first bite of these was great, but it quickly became overpowering and sort of vinegary (no idea how, but that's what I was tasting). A lot of work to toss all the leftovers. I wouldn't make them again, but maybe I'm just a sprout purist (butter and salt)alohalifeAustin, tx10/27/2021PLEASE allow a print without the picture, I don't want 2 pageskathrynnew bern nc10/26/2021Explore Bon Appétitbrussels sproutGingerHerbs & SpicesTurmerichoneyLemon JuiceSideDinnerVegetarianWeeknightQuickEasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-07", "author": ["Condé Nast", "Rachel Gurjar"]}