{"id": "e7ee1749e3b5efc969d01bcfd85877de", "url": "https://www.bonappetit.com/story/junglepussy-trader-joes", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Why Indie Rapper Junglepussy Wrote a Song About Trader Joe's | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy Indie Rapper Junglepussy Wrote a Song About Trader Joe'sThe NYC native is all about her self-care, from bath bombs to multigrain crackers.By Martine ThompsonJune 20, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAs Junglepussy, aka Shayna McHayle, and I chat by phone, I can hear the faint sounds of the NYC-based rapper munching on healthy snacks. She’s fresh off the release of her third studio album, JP3, and the just-in-time-for-summer rendering doesn’t disappoint: There are shoutouts to nourishing your heart and body—from the food you eat to the company you keep—laced with her signature vivacity, sex-positivity, and heaps of Caribbean vibes thanks to her Trinidadian-Jamaican roots. The 26-year-old recently wrapped her first film, Support the Girls, and now she’s learning, unlearning, and basking in the rollercoaster journey of becoming her best self. The rapper caught up with us about the perks of keeping her diet mostly nutritious, how complex feelings spurred by trips to Trader Joe’s inspired the album’s first single, and the new addition to her skincare routine that has her feeling like Angela Bassett.What you eat has been a consistent theme in your music over the years. Why is that important to you?It’s important for me to put things in my body that I know will give it life, not bring it any closer to death. I really like how I feel when I eat well. I feel a significant difference in my productivity, in how I’m treating people, in my patience, my tolerance, all of that is heightened when I’m eating well.What are some things you like to make?I love to make salads with boiled eggs and tangerines on it and some chia seeds. I like to make stuff that you don’t even really have to put fire to. Just stuff you can eat raw and it’s still delicious and filling. I love to make smoothies with a lot of spinach in it. My smoothies are always like liquid salads. I’m obsessed with sardines. I love eating them with Trader Joe’s multigrain crackers or the multigrain & flaxseed water crackers, and they’re very good in omega-3s and iron.What about preparing Trinidadian and Jamaican food?I haven’t finessed dishes from my culture yet, unfortunately. I know I need to. I need to be that auntie with the fire macaroni pie, with the fire curry chicken. My friends and I always say we need to get on top of this because we can’t just be out here not carrying on the legacy.Right, first-generation struggles! On the theme of growth in your life that’s been reflected in your diet, how does that apply to your forthcoming album JP3?On this new album, I feel like I am complaining less and celebrating more. Celebrating my growth and just me. My last projects I addressed things that bothered me in relationships and now I don’t want to dedicate my music to that anymore. I’ve always wanted to use my music as a reminder that us Black women are loveable. We don’t have to be seen as being angry, even though that’s fine. We can be angry if we want to, but there’s much more to us so I’m exploring that.What was the inspiration behind the album’s first single, Trader Joe?Trader Joe is a song about me liking someone but loving myself more and choosing to continue to put myself first even if this person is fun. I just wanted to flip it...and I’m always at Trader Joe's.I hope they play your song at the store. That would be so fun to shop to.Now I’m scared to even go back. Before all the locations got busy, I used to go to the one on Long Island which was clutch because it was super empty. It’s super chill. Even though they would hate to see me and my mother there. Literally somebody in line was like, “Ugh, they have the outsiders here today.” I’m like, \"If this where y’all shopping, Imma shop here too. I need the good stuff too.\"Grocery shopping at Trader Joe’s in New York can be so stressful! It’s so chaotic, you feel so rushed, the lines…I try to go during the week because I feel the same way. Part of the song was inspired by me having to take these trips and making the decision: Do you just want to go deal with everything on your own or do you want to go with a big Black man to just handle it? (Laughs) Of course, I’ve done that once. But I prefer to just go alone and carry my own groceries if he’s not gonna just do it for me with no strings attached.It’s nice to go with a friend and have a buddy. Or is the point of having a guy so he can drive you?Right, but I can just take an Uber. That’s the whole thing: dependent vs independent. Do I need a man? No, I don’t need a man! What can he do for me? He’s not even eating vegetables. Why am I stressing over guys that are still eating from the chicken spot? Like, no.You’ve been vocal about the adversity and exhaustion often faced by Black women due to racism and misogyny. When you’re in a particularly tough spot, how do you step away and recharge?That’s a daily recharge. That’s some shit I gotta charge like my iPhone. The way the world is set up, we have to make sure we do not beat up on ourselves. I need to make sure that I’m treating myself like I would treat someone I want to love. I don’t want people to think it’s about spending money. Going and getting my nails done has always been something I love. But then I realized it needs to be from me. So now I like to take my time and do my own manicures and pedicures.Is there anything else you like to do when you need to unwind and just feel good?I just got a bathtub pillow: Oooh it's a life changer. Sometimes I’m like, “Shayna get out, you can’t sleep in here,” because it’s so comfortable. I like to do that with a bath bomb, my grapefruit candle, and ambient sounds on Spotify. Also everyone needs to get a jade roller. I only use it in the morning. It’s been a week and I feel like I got botox or a face lift. I’ve been looking at my face all week and I’m like, \"Who is this woman?\" I feel like it’s turning me into Angela Bassett. Everybody needs one!Explore Bon AppétitHealthyishSelf CareprofileRead MorecultureEmilia Ortiz Cleanses Her Aura and Chats with Her Ancestors Before BedBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-20", "author": ["Condé Nast", "Martine Thompson"]}