{"id": "e80d4a3fccbf446065926bd0f9dab8d1", "url": "https://www.bonappetit.com/story/green-olive-pistachio-sauce", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "This 5-Minute Olive Sauce Belongs on Whatever You're Making for Dinner Tonight | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis 5-Minute Olive Sauce Belongs on Whatever You're Making for Dinner TonightIt's awesome on fish—but we've thrown it on chicken, rice, crackers, straight from the spoon...By Alex DelanyJanuary 10, 2018FacebookTwitterEmailFacebookTwitterEmailYou know that cliff-side villa you own on Italy’s Amalfi Coast? The one with the lemon trees and the small, grassy side yard, which doubles as an olive orchard? Oh. That wasn’t you? Yeah, me neither. I do have a shortcut to that lifestyle though, which doesn’t involve a chance inheritance of a vast fortune. It’s olive sauce.Seriously, olive sauce. This is not a finely chopped tapenade, but a casual, foolproof combination of Castelvetrano olives, pistachios, garlic, lemon, and tarragon.It tastes like the ocean breeze smells, or how a glowing tan, without a single bit of sunburn, feels—briny, bright, and warm. The pistachios make it slightly crunchy and destined to be consumed with swordfish steaks in a faded stucco courtyard.Well, that’s a lie. It’s not only for seafood. You can hit any type of poultry with this olive sauce. It’s amazing on simple grilled chicken or a monster turkey and mozzarella sandwich, or even as a spread with crackers. And if you want a true testament to how good this stuff is, you can mix it into plain white rice to spectacular results. It could easily double as a pasta sauce for some gnocchi too. And it’s all thanks to Castelvetrano olives.The Castelvetrano olive, in all it's glory.\nTed CavanaughTime for a bold declaration, and a very revealing insight into why I like this sauce so much. In my eyes, Castelvetrano olives are the only olives that matter. Period. Full stop. Every other olive is a disappointment. The firmness in a green Castelvetrano is unparalleled, and makes it both an olive eater's and an olive skeptic's olive (if you can’t find them at your grocery store, they’re around $7/jar online). The buttery creaminess, rich flavor, and pleasant saltiness—without overwhelming, like Kalamatas—makes them a contender in every weight class, and an absolute knockout for simply-prepared proteins. That was a boxing metaphor.The mixture itself takes about five minutes to make, even though the ingredient list seems long. The most time-consuming part is pitting and crushing the olives, which to be honest, isn’t a chore at all, because you get to eat them while you work (so...buy extra). Here’s how to do it, so you don’t have to slice and pit every olive.Grilled fish collars would love this sauce.\nMichael Graydon + Nikole HerriottLay all your olives out on a paper towel. Cover them with another paper towel. Take the bottom of a mug and smash the hell out them. Well, with some restraint; you don’t want to break your lovely mug. When you lift the paper towel, the pits will be exposed and the olives ripped into smaller pieces. Throw the pits away and dump the olive flesh into a bowl.Now, we build. Add chopped (unsalted, toasted) pistachios, chopped tarragon, and olive oil into the same bowl. Use a microplane to grate some garlic and lemon zest into the mix and finish it with the lemon juice, salt, and pepper. Mix it all up. Give it a whiff. (You don’t need to smell it, but why the hell not?) The proportions here are flexible. Want a little more acid? Up the lemon juice. More bite? Up the garlic. Want more tarragon? Up the…tarragon. Duh. For the official recipe and measurements, head right over here.Humility might be a human being's greatest virtue, but for a sauce, it’s versatility. Versatility and taste. And maybe the inclusion of Castelvetrano olives. Those are the top three. And guess what. This sauce hits all the nails, checks all the boxes, and delivers all the checks, which is more than I can say about my imaginary Italian villa.Get the Recipe: Swordfish Steaks with Olive-Pistachio SauceThis sauce wouldn't be bad with some roasted potatoes either:Explore Bon AppétitOliveItalySwordfishRead MorerecipesA Feast of the Seven Fishes Menu That Won't Take a Week to CookGallery6 SlidesBy Andy BaraghaniLifestyle7 Things to Splurge On When You're Trying to Eat HealthierGallery7 SlidesBy Chris Moroccotest-kitchenHow to Buy the Best Olive Oil for Whatever You're CookingBy Claire Saffitz and Belle CushingcookingA Ramen Recipe That's All About That Ginger Scallion SauceBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-10", "author": ["Condé Nast", "Alex Delany"]}