{"id": "e81d9335388dc5d9db38bc475205cbea", "url": "https://www.bonappetit.com/recipe/crispy-salmon-with-bulgur", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Crispy Salmon With Bulgur Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueCrispy Salmon With BulgurBy Abra BerensSeptember 14, 20214.3(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Frances BoswellEmailPinterestPrintEmailPinterestPrintBulgur is the canned margarita of grains—she’s ready to party, fast. “It’s one of the original convenience foods,” says Abra Berens, author of the wonderful new grain-and-bean-focused cookbook Grist. This isn’t brown rice you have to cook for 45 agonizing minutes. To cook bulgur, the name for parboiled and dried wheat berries, just rehydrate the grain (fine or medium grind) by covering it in boiling water and letting it sit for about 10 minutes. In this recipe, the grains get dressed up with a few herbs and served with fish and fennel for a simple dinner. Plan ahead and make a double batch of the mustard dressing to use as a sauce to serve with proteins or brighten up sturdy greens.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBenriner Mandoline Slicer$80 At AmazonLarge Nonstick Skillet$50 At AmazonFish Spatula$14 At AmazonSmall Saucepan$155 At AmazonIngredients4 Servings1cup medium-grind bulgur¼cup chopped dill3Tbsp. plus ¼ cup extra-virgin olive oil, dividedKosher salt, freshly ground pepper1small shallot, finely chopped¼cup apple cider vinegar¼cup sour cream¼cup whole grain or Dijon mustard46-oz. skin-on salmon fillets1large fennel bulb, shaved ona mandoline or thinly sliced8radishes, trimmed, shaved on a mandoline or thinly slicedPreparationStep 1Bring 1 cup water to a boil in a small saucepan. Remove from heat and immediately add bulgur. Cover pan and let sit until bulgur is tender, about 10 minutes. Drain off excess water, then mix in dill and 2 Tbsp. oil. Season with salt and pepper.Step 2Meanwhile, whisk shallot, vinegar, sour cream, mustard, and ¼ cup oil in a small bowl until smooth; season dressing with salt. Set aside.Step 3Heat remaining 1 Tbsp. oil in a large nonstick skillet over medium-high. Season salmon with salt and arrange skin side down in skillet. Reduce heat to medium and cook, pressing down gently on fish, until skin is golden brown and crisp, 6–8 minutes. Turn fillets over and cook until just cooked through, about 3 minutes. Transfer to a large plate, arranging skin side up.Step 4Combine fennel and radishes in a large bowl. Drizzle reserved dressing over to suit your taste (you won’t need all of it) and toss to coat. Season with more salt if needed.Step 5To serve, spoon bulgur among plates, dividing evenly, and top each with a salmon fillet and fennel and radish salad.Do ahead: Dressing can be made 3 days ahead. Cover and chill.Reprinted from Grist: A Practical Guide to Cooking Grains, Beans, Seeds, and Legumes by Abra Berens with permission by Chronicle Books, 2021.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Crispy Salmon With Bulgur?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleIt was a great dinner. I subbed the sour cream to yogurt, added a bit of honey and definitely didn't use that much mustard lol turned out great. AnonymousNy2/3/2022I love the crispy salmon and the fennel-radish salad.  I could take or leave the bulgur, but do appreciate how quick it is.  It's a bit bland on its own, but if you get a bite of everything together, it works out.  This makes a lot more dressing than you need - would definitely halve the dressing recipe if you won't use up the excess in other salads.LizChicago, IL12/20/2021I made it exactly as recipe called for (except I used ghee to cook the salmon…ran out of EVOO) and we all loved it. My young adult children and ‘mother more seasoned adults. Yum! Glad I made extra fennel and radish dressing. Heading out to get more salmon!  Saw comment re: adding honey to dressing; that sounds good. And def taste the bulgur to make sure it’s seasoned to your liking.AnonymousLong Island, NY11/28/2021Surprisingly bland dish! I would cut the mustard (haha) next time because it's basically all I could taste -- maybe I needed something higher quality.. But my husband hates mustard anyway, so I think next time I'd try a sriracha variation with different crispy veg. Not an out and out winner for me, but still a lovely plate of food, and I like the crispy salmon skin, gotta do that again.  AnonymousCalifornia10/4/2021Adding this to the weeknight rotation! I especially loved the crunchy salad on top.AnonymousSavannah, GA9/29/2021 The fennel and radish salad is amazing and definitely makes the dish! Would recommend to season well, I also added some honey to the dressing for an added sweetness. AnonymousSydney, Australia 9/21/2021Explore Bon AppétitMainDinnerNut-FreeHealthyishWeeknight MealsEasyQuickFrySalmonFishSeafoodBulgurRice & GrainsFennelVegetableRadishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Abra Berens"]}