{"id": "e8204089dc6b8d9e66257c6248f1ebb9", "url": "https://www.bonappetit.com/story/haribo-lemon-cola-gummies", "year": 2019.0, "month": 9.0, "day": 5.0, "content": "These Lemon Cola Gummies Keep Me Sane on Marathon Work Days | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Lemon Cola Gummies Keep Me Sane on Marathon Work DaysWhen I’m shooting eight hours straight, I’m not eating a real lunch, but I am eating these gummies.By Michele OutlandSeptember 30, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The irony of shooting the Hot 10 is that I’m not actually sitting down and eating fancy meals at every place. Despite what my friends think, I’m actually working on a pretty tight schedule, traveling from restaurant to restaurant and shooting for eight hours straight to get all that nice natural light before the sun sets. That means my meals usually consist of nibbling on food we just shot or eating garbage food from wherever can get it fastest. Cue world’s tiniest violin!That said, these trips have led to some pretty amazing discoveries: like the time last year when I found the candy that changed it all for me. We had just wrapped at Che Fico in San Francisco, No. 7 on 2018’s Hot 10 list, and I did my usual thing before the next shoot: I stopped into a nearby corner store to buy a Diet Coke and a snack. And there they were: Haribo Happy Cola Lemon Fresh Gummies.I love gummy candies. They’re my favorite naughty, sugary snacks, which is helpful when you’re working long days. I also love a Diet Coke. But cola gummies? I’ve usually felt pretty ambivalent about them. They’re often too sweet, and just a one-note flavor. But lemon in a cola gummy? I thought I’d give it a try.Thank goodness I did! These are the best cola gummies I’ve ever had. They taste exactly like a Diet Coke with a little lemon wedge in it. That citrusy flavor makes it feel refreshing and just delightful. Our staff photographer Alex Lau and I couldn’t get enough of them. As we continued to travel for the Hot 10 shoots, we kept looking for these lemon colas but couldn’t find them anywhere. That is, until Alex bought some on Amazon and sent me them as a surprise. Now I have three bags of the gummies, which I have to hide inside my desk so I don’t finish them before my next work trip. On the road, they’re exactly the right thing when you need a dose of sugar—oh, and joy.Buy it: Haribo Happy Cola Lemon Fresh Gummy, $6 on amazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingCandyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-30", "author": ["Condé Nast", "Michele Outland"]}