{"id": "e84f47b477796161c5416298e9f39c51", "url": "https://www.bonappetit.com/story/strawberry-coconut-ice-cream-pie", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Get Lost In the Swirls of This Strawberry-Coconut Ice Cream Pie | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingGet Lost In the Swirls of This Strawberry-Coconut Ice Cream Pie4 pints of ice cream, 1 coconutty crust, and the most stunning dessert you’ll make this summer.By Alex BeggsAugust 9, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Alison Attenborough, Prop Styling by Heather GreeneFacebookTwitterEmailIce cream pie can be as simple as plopping some softened ice cream into a graham cracker shell, refreezing it, and calling it a hot summer’s day. But—you thought I was going to follow that up with a but? Well I’m not. This ice cream pie is a cinch.It’s a new recipe from our simple issue (the theme of the August issue), by contributing assistant food editor Kat Boytsova. The filling combines four pints of ice cream—two strawberry, two coconut—that swirl together in a beautiful marble pattern. It reminds me of Princess Frostine’s (that’s right, from Candy Land) pink-and-white gettup, if we’re diving into one specific person’s nostalgia brainwaves. Sweet strawberry and creamy coconut make a dynamic duo, a combination we really don’t exploit enough here at Bon Appétit.When we tested this recipe in the early spring (paired with Kat’s rosé sangria no less), it caused giddy, childlike joy around the prep table. (My Candy Land theory holds up.)Photo by Alex Lau, Food Styling by Alison Attenborough, Prop Styling by Heather GreeneWhy is this so good?! I asked food director Carla Lalli Music, as we cast tasting spoons aside and took whole slices up to our desks. “I think I just ate an entire pint of ice cream,” groaned Carla as she kept eating the pie. The strawberry, the coconut, the coconutty crust. It was all working. “Do you have any notes?” asked Kat. “Uhhhh nope.” We answered. It was ready.If you have to stand in front of the class and fess up on what you did this summer vacation, let it be this recipe.Because the crust is salty-amazingGraham cracker crusts are bound with fat—here we’ve got coconut oil to keep everything together, and why not throw some toasted coconut flakes in there while you’re at it for texture?  A generous pinch of salt supercharges the coco-nuttiness and you’ll find yourself eating the crust like a cookie later.We learned how to cut ice cream from Claire Saffitz’s epic ice cream sandwich recipe.\nPhoto by Alex Lau, Styling by Sue LiThe swirl looks more complicated than it isSo you soften the ice cream. And uh, make sure to put a sticky note on it so no one puts it back in the freezer or worse, EATS IT ALL, WHY WOULD YOU DO THAT, BILL, I WAS MAKING A PIE. Kat recommends cutting the ice cream into chunks (you can cut ice cream, yes) and putting it in two bowls (one for strawb, one for coconut). When the ice creams are soft enough to stir with a spatula, stir them until they feel like the consistency of thick cake batter, at which point put the bowls in the freezer for a quick 10 minute break. You’re about to swirl them together, so the more slightly-solid they are, the better for that marble effect. Scrape the strawberry into the coconut and stir it like you would batter, and then STOP. A few folds will do it. Chill another 10, and then pour that into the graham cracker crust to set up for the final freeze.Photo by Alex Lau, Food Styling by Alison Attenborough, Prop Styling by Heather Greene6 hours laterThe pie will be frozen enough to make sharp, servable slices. Especially if you run your knife under hot water and clean it in between slices.Photo by Alex Lau, Food Styling by Alison Attenborough, Prop Styling by Heather GreeneDecorate the sh*t out of itToss some strawberries in lemon juice and sugar and then spoon them into little divots on top of the pie. This is called extra credit, which you know is NOT optional for those with drive and ambition in life.Get the recipe:Coconut-Strawberry Ice Cream PieA swirled beauty of coconut and strawberry ice creams with a salted press-in graham cracker crust.View RecipeExplore Bon AppétitIce CreamPieSummer DessertsStrawberryCoconutRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-09", "author": ["Condé Nast", "Alex Beggs"]}