{"id": "e8535b3acaacf3660b47cd6e2892939a", "url": "https://www.bonappetit.com/story/hold-on-to-summer-with-these-five-cocktails", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "Hold on to Summer With These Five Cocktails | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHold On to Summer with These Five CocktailsBy CÎROC VSSeptember 28, 2018FacebookTwitterEmailFacebookTwitterEmailIt’s not that we don’t like fall. We love fall for a lot of reasons: chunky sweaters, gorgeous foliage, and autumnal-flavored lattes. But that doesn’t mean we can’t make one last-ditch effort to extend summer, what with its warm city strolls and lazy afternoons on the beach, on blankets in the park, and across balmy rooftops everywhere. While we can’t do anything about the impending change of the season, we can cue up your taste buds with a few CÎROC VS French Brandy cocktails to embrace the end of summer. They may not turn back time, but they can make every moment worth savoring last a little longer.FRENCH SHADEPerfect For: A Picnic in the ParkSwing by the farmer’s market and then set up shop in the park with a mini shaker and some ice. (Or make a big batch ahead of time and bring it with you!) This ultra-fine brandy complemented with refreshing cucumber and mint just may keep you there all day.PASSION NO. 9Perfect For: A Pool PartyYour end-of-summer motto? Dive in. Embrace your final moments in the sun with this electrifying potion packed with a tropical fresh-fruit fusion and citrus flavors, the perfect assist for poolside lounging.SIDECARPerfect For: A Rooftop PartyFew things beat a good view paired with a classic cocktail. Whether it’s a breezy afternoon affair or dramatic nighttime fete, your rooftop event takes a decadent turn when you elevate this classic Parisian cocktail with CÎROC VS French Brandy.VS COBBLERPerfect For: A Beach DayWhat’s better than an ice-cold drink on a hot day? Nothing! There’s no better way to pay homage to summer than by blending color, fresh fruit flavors, and crushed ice with a day at the beach. This pre-prohibition–inspired elixir does it all.VS FRENCH 75Perfect For: Saturday BrunchEveryone knows that brunch is for ordering all of the beverages. Few things pair better with eggs Benny than a fresh, hot coffee and a chilled French 75 crafted with the refined richness of CÎROC VS French Brandy. Take it outside for brunch al fresco, sit back, relax, and sip to your heart’s desire.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-28", "author": ["Condé Nast", "Cîroc Vs"]}