{"id": "e8556d32a277a3f7dbb6890c26b3c08a", "url": "https://www.bonappetit.com/story/hughs-hot-bowls", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "Rapper Hugh Augustine’s Vegan Food Is a Love Letter to His L.A. Community | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleRapper Hugh Augustine’s Vegan Food Is a Love Letter to His L.A. CommunityHugh’s Hot Bowls, his COVID-19-era pivot, has sold over 3,000 bowls of vegan comfort food so far.By Martine ThompsonNovember 21, 2020FacebookTwitterEmailNico MarksFacebookTwitterEmailIn Here We Are, artist Martine Thompson explores what it means to care for oneself in a world that doesn’t make it so easy. Up next, a conversation with Hugh Augustine, rapper and founder of the vegan comfort food pop-up Hugh’s Hot Bowls. Before you read, queue up Martine’s Scorpio Season playlist, featuring music by Augustine.Hugh Augustine understands the importance of community and adaptability. When COVID-19 halted an upcoming music tour, the South Central rapper and vegan chef found himself in the same depressing tizzy of canceled jobs and lost income faced by many fellow artists and cultural workers.But after some lounging, some wallowing, and a family pep talk reminding him of the hustler’s spirit embodied by his beloved late grandmother Jackie, Augustine decided to pivot and tap into the culinary skills he’d honed cooking alongside his mother, who ran a catering company specializing in gourmet food for 25 years. In May, with $200 and an idea, he launched Hugh’s Hot Bowls, a cottage-style business offering vegan comfort food at $10 a bowl.“The key lesson I learned from my mom is that food is art and presentation is paramount,” says Augustine. “Each step is integral to the final product and you can’t take shortcuts. I use this in my approach for Hugh’s Hot Bowls because I want people to feel the love and energy I put into my food.”Los Angeles is filled with fond and dour memories for the fourth-generation Leimert Park native, who now resides in Baldwin Hills. The emcee came of age in the ’90s and early 2000s, where high school summer nights were spent dancing it out at teen clubs like Access, and where food rituals included trips to Roscoe’s with family after Sunday service or with friends after the weekend turn up. Then there are the more sobering experiences, like navigating grief from the familiar cycle of losing friends and family to death and lengthy jail sentences. To be of service to the community, many of whom are bonded by these same lived experiences, and help combat the overwhelming number of fast-food chains with accessible, health-conscious alternatives has been deeply rewarding for Augustine.“You shouldn’t have to drive 30 minutes to find a Trader Joe’s or a Sprouts Market or places that sell locally grown, organic produce,” says Augustine of the dearth of healthy options in Baldwin Hills and neighboring Black communities. “Even Ralphs, the main chain that’s walking distance from my home, doesn’t always have the freshest produce. Sometimes you’re still seeing the same fruits and vegetables that were on the shelf from last week.”But the chain’s offerings depend on the neighborhood in which it sits, a common disparity among grocery stores since the days of segregation. “I’ve gone to a Ralphs on the other side of town, like on Bundy and Wilshire, and the quality of food over there is way higher than what’s over here on La Brea and Coliseum,” he continues. “It makes you ask the question: Why is the food quality lower in my community that’s majority Black people and people of color? And is there a bigger plan there? Because somebody had to make the decision of where those resources are going. We were petitioning Trader Joe’s to come into the community and put a store on what’s now Crenshaw and Obama back in 2012, and they didn’t want to come into the community. Why? Do they not want us to have access to this food? What’s really going on? I’ve taken it on myself to be somebody who can provide that to my community because I know that these bigger companies aren’t going to do it.”The toll on one’s body, mental health, and spirit from participating in a society with unapologetic anti-Blackness, capitalism, and systemic gender discrimination at its foundation has never been an easy or humane weight to bear. For Augustine, turning to plant medicine, particularly smoking weed, to cope with this daily reality has been a vital part of caring for himself. “That’s a part of my meditation, health care, and self-care” he says of the herb’s ability to serve as an emotional and physical balm. “It’s something that allows me to get in tune with my mind and my body—something that allows me to keep going. Because it is like a tireless job, you know?”Creating music has been another core part of Augustine’s self-care. The craft provides the rapper with a therapeutic space to excavate personal experiences, explore vulnerabilities, and flip playful or woeful storytelling into digestible art to vibe out to. It clicked after going to his first rap concert, around age nine or 10, that he was “the same as these people” and had something to say too. In search of an outlet for his thoughts, he started writing poetry and eventually began rapping. The catharsis of free-flowing in the studio, especially with friends, good vibes, and a satisfying meal in the mix, has become its own form of euphoria.The meals usually come from local vegan gems like the Grain Café on Pico and Crenshaw, an organic, soy-free café whose traditions and flavors are greatly rooted in Oaxaca, Mexico. Other days, sliding over to Azla Vegan in Leimert Park to satisfy Ethiopian food cravings with some misir (red lentils stewed in a spicy berbere sauce), yatakilt (curry potatoes, carrots, and cabbage), and gomen (garlicky kale and collard greens) is the move. “I love eating with my hands with the injera bread,” he says. “It just takes me back to a very natural state.”After talking with Augustine, my mind floats back to an age-old question: What does it mean to genuinely and healthily love—a person, a community, a place? A huge part of loving is caring, and an essential part of caring is a commitment to learning. Learning what nourishes and what harms. Learning how to divest from participating in that harm and following through with action and intention, day after day. Hugh’s Hot Bowls feels like a manifestation of that intention, a way of pouring love into people and a community Augustine wants to see flourish. Providing sustenance to Black people, with our health and well-being in mind, has always been part of Black liberation work, from the Black Panthers’ free lunch program in 1969 to the rising number of community fridges and restaurant initiatives serving the people today.Hugh’s Hot Bowls, which includes event catering and meal prep, has sold over 3,000 bowls in its six-month run. Curated weekly menus are shared on Augustine’s Instagram on Wednesdays, and community members can pick up the dish of the week, like spicy fusilli pasta with zucchini and garlic bread or fan favorite the Soul Bowl—red beans and rice, greens, yams, mac ’n’ cheese, and a freshly baked cornbread muffin—during a designated two-hour block on Thursdays and Fridays.Augustine, who has been vegan for almost two years, is using Hugh’s Hot Bowls to spark more community dialogue about the connection between climate change and the meat industry. He’s also practicing communal care during quarantine by teaming up with peers. You can catch him vending at select events by WalkGoodLA, a Los Angeles–based health and wellness organization founded by actor and filmmaker Etienne Maurice, which focuses on activism through activation with events like socially distanced town halls, outdoor movie nights, and free guided yoga on Sunday mornings at LA High Memorial Park. Hugh’s Hot Bowls has also partnered with Echo Park Fund, an initiative started by writer and retired WNBA player Talia Caldwell, which provides free homework help, laptops, and hot meals to kids in the community as well as resources to Echo Park’s tent community.“When I think about L.A., I think about my grandmother, the diverse range of ideologies and people that find a way to work together every day to make this city what it is, and this being a foundation for where I am now,” says Augustine. “I really think this is one of the best places in the world. I’ve been to so many cities where I’ve been like, I could live here, I could stay, I don’t think I want to go home. But there’s something that always brings me back to L.A., and a big part of it is the people.” He pauses, “The city, to me, is family. This is where my heart is, this is where my love is.”Hugh’s Hot Bowls will be passing out free food for a Community Friendsgiving in Tha Alley on Degnan in Leimert Park this Saturday, November 21. If you’d like to donate to support, send to $hugh91 on Cashapp or @hughaugustine on Venmo.Explore Bon AppétitHealthyishHere We AreLos AngelesVeganprofileRead MoreLifestyleOn My Block’s Jason Genao on Searching for Adobo and Loving Julia ChildBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-21", "author": ["Condé Nast", "Martine Thompson"]}