{"id": "e868ebab99a013cb0d1de131baadcf9c", "url": "https://www.bonappetit.com/recipe/blackened-carrots-with-daikon-and-pomegranates", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "Blackened Carrots With Daikon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueBlackened Carrots With Daikon and PomegranatesBy Carla Perez-Gallardo and Hannah BlackJanuary 7, 20202.5(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintOnce roasted, the carrots will keep for several days. Hang on to the roasted carrot oil—it can be used again for braising, searing, or making dressing. This recipe is from Lil’ Deb’s Oasis in Hudson, New York.Ingredients4 servings5large carrots (about 1½ lb.), peeled2garlic cloves, thinly sliced1sprig thyme1½cups extra-virgin olive oilKosher salt4oil-packed anchovy fillets, finely chopped½cup pomegranate seeds2Tbsp. pomegranate juice2Tbsp. red wine vinegar14\" piece daikon (Japanese radish), peeled, sliced ⅛\" thickCelery leaves or parsley leaves (for serving)PreparationStep 1Preheat oven to 300°. Combine carrots, garlic, thyme, oil, and a large pinch of salt in a baking dish just large enough to hold carrots and oil snugly. Cover tightly with foil; bake until carrots are tender, 50–70 minutes. Remove foil and let carrots cool until just warm. If using right away, remove carrots from oil (otherwise keep submerged in oil while storing). Strain carrot oil through a fine-mesh sieve into an airtight container; discard solids.Step 2Whisk anchovies, pomegranate seeds, pomegranate juice, vinegar, and 2 Tbsp. reserved carrot oil in a small bowl to combine; season dressing with salt.Step 3Heat 1 Tbsp. reserved carrot oil in a large skillet, preferably cast iron, over medium-high (remaining oil can be stored airtight at room temperature). Cut carrots in half lengthwise. Cook carrots in skillet, turning occasionally, until warmed through and blackened in spots, about 5 minutes. Transfer to a cutting board and cut into 2\"–3\" lengths.Step 4Arrange carrots on a platter. Top with daikon and drizzle with dressing. Scatter celery leaves over.Step 5Do Ahead: Carrots can be baked 3 days ahead. Let cool; cover and chill.How would you rate Blackened Carrots With Daikon and Pomegranates?Leave a ReviewTell us what you thinkReviews (5)Back to TopTrianglePlease provide a link to the recipe for vegan anchovies.MikeNew York1/9/2022Im confused, how is this vegan if it has literal anchovies in it? That doesn't make a whole lot of sense to me. Probably shouldn't be labeled as vegan. Anonymous3/3/2021Can't believe this was listed under Vegan Recipes! \n\nNo need to kill anyone to please your appetite.Perrygirl2/20/2021this recipes valid i love slow cooked carrots that get charred after. but like what’s up with this weird flavor profile of daikon and pomegranate? the vinaigrette of anchovy and pom juice isn’t bad it just doesn’t harmonize with the classic confit you’re doing with the carrots here. i’d alter it a bit to kind of land on some sort of path —> za’atar instead of thyme during the braise, and maybe sumac and some pomegranate molasses instead of whole seeds in the vinaegrette? think about this a bit jane duhnew yowkkk2/12/2021I changed the method quite a lot for these, because it screams of restaurant instead of home kitchen (I mean, a cup and a half of carrot oil? Are you serious?). The flavor was five stars for sure.\n\nI peeled and cut my carrots on the bias, tossed them with olive oil, S&P, thyme and garlic powder (minced garlic would burn). Covered a sheet pan in foil (I don't normally use aluminum but do you want blackened or don't you?) and roasted them in a single layer for 40 minutes at 400°. Meanwhile slice the radish and make the dressing and once the carrots are out of the oven you're good to go.SarahFowlerWolfeSacramento, CA4/23/2020Explore Bon AppétitDaikonVegetableCarrotPomegranateFruitWinterSideGluten-FreeDairy-FreeNut-FreeHealthyishRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-07", "author": ["Condé Nast", "Carla Perez-Gallardo", "Hannah Black"]}