{"id": "e879b8d2227b832fbee90bb546a43bde", "url": "https://www.bonappetit.com/story/nicole-rucker-loves-pumpkin-spice-latte", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "Nicole Rucker Loves a Starbucks Pumpkin Spice Latte | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Was a Competitive Barista, But I Love a PSLAfter years of self-imposed coffee austerity, Nicole Rucker embraces the very extra beverage.By Nicole RuckerOctober 22, 2019FacebookTwitterEmailPhoto by Laura Murray, food styling by Kat BoytsovaFacebookTwitterEmailIt’s 6 p.m. on a Tuesday night. I’ve just missed my connecting flight out of Charlotte and I’m stuck in the airport for another four hours until the next plane leaves. But who even knows if I’ll get on that one—I’m on stand-by. I am hungry. I am in need of joy. I have grown bored of overpriced airport food. So I scan the terminal map for the only thing acceptable in my time of need: A Starbucks Pumpkin Spice Latte.Ever since August, when the tour for my first cookbook Dappled began, I’ve been playing a game with myself: How many ridiculous drinks I can order without feeling the shame of false purism? As a pastry chef (until recently at Fiona in L.A., previously with Gjusta) and a former competitive barista (with Intelligentsia), I spent years ordering under self-imposed austerity. At coffee shops, it’s just a cappuccino or a small coffee. In restaurants, I try not to ask for too much. I order the food from the menu as the chef suggests always, showing my respect for the hard-working cooks. I never ask for special treatment. I never take up too much space. I seek to avoid being perceived as needy or fussy, and least of all, unsophisticated. It’s what you learn to do as someone who works in the ‘farm-to-table,’ ‘natural,’ ‘organic’ food space. Maybe it’s something I do as a woman, a fat woman, to make myself feel smaller and more deserving.To request an over-the-top specialty drink with a long list of directives scribbled on the side of the cup, right there next to my name—my real name!—feels out of character. And honestly, it’s fucking liberating. I gleefully rattle off my order to the kind-faced woman in the hunter green apron, who doesn’t even flinch at my needy list of wants and needs: an iced cold brew, tall, unsweetened, extra ice, extra pumpkin cream cold foam, splash of milk. Also, a protein plate because I am, in fact, hungry. In the Reagan Airport a few days later, I order a half sweetened, tall, blonde pumpkin spice latte for dessert. It’s really good, and yes, it’s so extra that it feels like a real treat, exactly what I need.The Starbucks in the airport is my chance to order an inexplicably fussy beverage with multiple modifiers. It’s my chance to taste something that years of working in elite eateries taught me was forbidden. It’s my chance to transgress. Here, I can be relaxed and demanding. I can be the woman who actually does enjoy the seasonal flavors of cinnamon, nutmeg, and ginger mixed into holiday orange pumpkin goop, pumped from a jug, blended with espresso, milk, and adorned with whipped cream and a dash of pumpkin pie spice.I love a PSL, and I am no longer ashamed to admit that. Culinary police, arrest me: I’m basic.Explore Bon AppétitFallCoffeeFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-22", "author": ["Condé Nast", "Nicole Rucker"]}