{"id": "e87b9e4eba5add76766df884d1d32359", "url": "https://www.bonappetit.com/story/gigantic-candy-bars", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "I Never Thought I’d Love a Low-Sugar Candy Bar But Here We Are | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Never Thought I’d Love a Low-Sugar Candy Bar But Here We AreGigantic’s got those after school treat vibes…without all the junk.By Ali FrancisFebruary 12, 2021FacebookTwitterEmailCourtesy of GiganticFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!My love affair with these perfectly chewy, chocolate-covered vegan candy bars started in the usual way: an Instagram doomscroll stopped in its tracks, followed by an impulsive shipment of all four flavors, and the fluttery suspense before meeting in person.Unlike internet dating, Gigantic did not disappoint in real life: the Salted Peanut—filled with coconut milk caramel(!), studded with toasty nuts, and dipped in fair-trade dark chocolate—tastes much like a Snickers. The Banana Pecan is ripe and rich like fresh banana bread, the Almond Horchata is unimaginably cinnamony, and the Hazelnut Cafe, as one reviewer put it, is “a healthy alternative to eating a jar full of Nutella.”Now, in the rubble of life lessons hard-won is this one: What at first seems good for me is quite often the opposite. In life and confectionary, crushes can be fickle. So, it was with a good amount of skepticism that I put my first batch of Gigantic bars to the test—I asked myself, Is this relationship sustainable in the long run?—before offering them a permanent place in my fridge.The answer was, shockingly, yes. With only 7 grams per serving, Gigantic’s “sorta sweet” bars are incredibly low in sugar—without relying on gross-tasting artificial sweeteners. For comparison, a Mars bar clocks in at 60 g. And because the sweetness—which primarily comes from small amounts of brown and cane sugars—isn’t as heady, the other flavors are more pronounced. More peanut. More hazelnut. More banana. No games, just the real deal.I’d be lying if I said that Gigantic’s attractive retro packaging wasn’t part of the appeal. It’s reminiscent of old-school candy, rather than something you’d find in the health food aisle, which founder Stu Davidoff says was by design. So your life partner happens to be super cute? Bonus!By now Gigantic and I are way past that fling thing. This Valentine’s Day, you’ll find my boyfriend and me enjoying a ‘chocluterie’ platter of all four flavors. We’ll slice a variety pack into cubes, then laze about on the couch popping them into each others’ mouths like we’re two gods in a Botticelli painting. It actually sounds sorta sweet, right?Variety Pack of Candy Bars$28 at Gigantic!Explore Bon AppétitShoppingCandyHealthyish Loves ItChocolateHealthyishRead MorecultureThe Best Chocolates to Buy Online Right NowBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-12", "author": ["Condé Nast", "Ali Francis"]}