{"id": "e882f55d0ca5c3bce040114fb83d0320", "url": "https://www.bonappetit.com/story/bress-n-nyam", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "Matthew Raiford’s New Cookbook Celebrates Black Resistance by Existence | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMatthew Raiford’s New Cookbook Celebrates Black Resistance by ExistenceBress ’n’ Nyam—a Gullah Geechee phrase meaning “bless and eat”—takes a kaleidoscopic view of African American cuisine while staying rooted in the author’s ancestral farm.By Michael W. TwittyMay 13, 2021FacebookTwitterEmailPhoto by Siobhán Egan, styling by Bevin Valentine JalbertFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.There is no lack of voices in the world of African American food, just a lack of vision on what a Black cookbook can be, who may tell our story, and how many of us at a time may tell it. One of my pet peeves as an African American culinarian is the speed with which someone on social media will invoke the names of past luminaries in the face of new figures and their work in a “but see here” way. It’s as if the quality and originality of the new work are already in question: “That’s nice, but what do they really have to say?” It’s a nauseating but common take, never explicit, always subcutaneous, and it hurts us all. It limits the prospects for the future and inhibits conversation by putting new ideas in the shadows of the known.And yet, I didn’t come to this space to focus on those who would keep us in a bubble, but to talk about the self-styled “CheFarmer” (chef and farmer) who bursts it. When I first met Matthew Raiford in 2013, he welcomed me to Gilliard Farms in coastal Georgia to introduce me to his soul and life’s work. The ancient trees with their Spanish moss seemed to mirror the beauty of his locks. Every inch of the land made me ache for the peace and creativity he was working to achieve on ancestral land, from the crushed oyster shells that made war on nematodes to spared huckleberry bushes destined for doobie cobbler to his experiments with Carolina Gold rice, splendid Georgia variety collards, Georgia Rattlesnake watermelons (from which he made an excellent molasses used in barbecue sauce), and the like.To be sure, there are other books by Black authors of Gullah Geechee heritage, and each one of them has something to teach us about the dynamism and variety that African heritage Lowcountry folk have to offer. Each voice is colloquial and discretionary, engaging in some of the same subjects and variables, but the access and vantage points are key. Black foodways are not a monolith, and Matthew’s voice and vision come marching to a new beat in his new book Bress ’n’ Nyam, written with Amy Paige Condon.Photo by Siobhán Egan, cover courtesy of The Countryman Press, a Division of W.W. Norton & CompanyThere aren’t that many farm-to-table cookbooks written by Black people, especially Black people that currently own significant and inherited—and those two words are important—pieces of land that they actively cultivate. “We took all those pictures for the cookbook at the farm,” Raiford tells me. “The farm is our laboratory. I wanted the person cooking from it to see the world from underneath the oaks trees, to see the fields. I wanted them to see what oysters on hot tin really look like and how to roast a hog.” The pictures tell a story of resistance by existence—of a family and community determined to remain and create and be resilient.The title mimics scripture: “Eat and be satisfied,” says the Psalmist, and “bless and eat!”—the translation of the Gullah phrase Bress ’n’ Nyam—says Raiford. (“The publisher literally took the first name I proposed,” he tells me. “They didn’t ask me to change it. I knew I was in the right place.”) The book, published by Countryman Press, is grounded in Raiford’s family history, stories about the food creators in his lineage, and the land that his great-great-great-grandfather Jupiter Gilliard (born in 1812) began farming with his wife, Riner, as freed people. Six generations later, Matthew built the place back up with his former partner Jovan and a small army of family and friends. “A sense of place is important,” he says. “I had not seen one person like me write a cookbook and put it out on a national scale. I wanted to talk about where I am and being on this family land since after the Civil War. My South being coastal Georgia should be drastically different from someone else’s South two hours inland.”I’ve seen in person the brown, gently tattered family letters found in the pictures of the first few pages of Bress ’n’ Nyam. They are genealogical gold. In one letter from Georgia to a relative who left during the Great Migration, we get descriptions of the crops coming in: melons, corn, and sugarcane. Raiford treats them like sacred ancient artifacts, his own Rosetta stone. “We wrote to each other, we documented our lives, we had great penmanship,” he says. “My great-grandmother would write to my nana about what they were taking to market, what they were planting. I wanted to put our stories and our lived history in there. I wanted people to see our Blackness as our humanity.”At the heart of Raiford’s work is Brunswick, Georgia, but the story of his bloodline is the story of the South, and beyond. The family’s geography is rooted in the coastal swamps of South Carolina, Georgia, and Florida, but also Bridgeport, Connecticut; Miami, Florida; and other journeys.“It is a tradition among the Gullah Geechee that when we need answers, we turn to the wisdom of the ancestors, our source,” Raiford writes in his introduction. “I have organized the recipes in this book according to their elemental beginnings: earth, water, fire, wind, nectar and spirits.”The recipes in the cookbook act as mnemonic devices for the culinary creativity Raiford grew up with, and his own journey as a chef. His father spent some time as a professional baker, blessing mornings with apple turnovers and French pastries, and the best oatmeal cookies come snack time. And yet, “My dad didn’t want me to be a cook,” Raiford recalls. “He’d say, ‘There are many things I want you to be, but a cook ain’t one of them!’” Black people never got called chefs, only cooks.Chef Matthew Raiford organized his recipes by the elements: earth, water, wind, nectar, spirits and fire.\nPhoto by Siobhán EganRaiford’s mother Effie’s legendary home cooking led to innovations like her Brown Sugar Molasses Pound Cake, the recipe for which he includes in Bress ’n’ Nyam. “My mom claims she was messing around,” he says. “Everybody at the ‘chewch’ ate every bit until there weren’t even crumbs! Dude, that was like 40 years ago, and everybody living still remembers. That same recipe is still holding tight.”In the De Wata/Water section of the book, you’ll find the recipe for great-grandfather Horace’s fish and grits with stewed tomatoes and okra. “And it was crunchy okra,” Raiford adds, debunking any misgivings. “I didn’t even know okra could be slimy. Fried okra, roasted okra, stewed okra—I had never had it slimy.”The chef boldly declares that Southern food’s longevity and popularity is rooted in its dynamism; it is never static, never boring: “Does anybody understand that Southern cuisine is the only cuisine that has grown and matured?” he asks. “Everybody wants to be part of the story, and to be known for having the best Southern cuisine. There’s no one way to do any of these dishes. It’s the totality of the experience, not just one experience.”One of my favorite ways to use a cookbook is to mentally construct the pantry of the chef writing it. Bress ’n’ Nyam is rooted in Southern constructs—a very particular South and sense of place. It is Gullah Geechee, but it’s not about replicating any specific canon of dishes. Raiford’s travels and experiences from California to Italy (where he once represented the United States at Slow Food International’s Global Gathering) have made an impact on how he interprets the food of home. His vision allows him to see the global in his childhood particulars. He brings his nana’s love of produce and fresh vegetables to his quiche and giardiniera. He marries Ethiopian berbere spice, jerk seasoning, feta, bottarga, mole, gelato, and compote with things he can attain in a short walk to the chicken coop, the orchard, the brackish waters surrounding Gilliard, or his garden, a modern rival to Jefferson’s experimental field at Monticello.As a chef, Raiford offers all the things you might suspect from Lowcountry Georgia, prepared through the lens of Matthew’s constant search for twists: muscadines turned into jelly and compote; peanuts boiled in potlikker or served over chicken and purple ribbon cane syrup; oysters roasted under burlap soaked in salt water or tucked beside fried turkey; a fresh barbecued Ossabaw Island hog; the tang of wild sumac, huckleberries, pomegranates; mustard greens served over his signature CheFarmer grits. The classics are there, too, with excellent angles: sweet potato pie glazed with evaporated milk, fried mullet, fried chicken, shrimp perloo, and red rice. Even better is an homage to the drinking culture of the Deep South juke joint, drawing on moonshine and local gins with fruity, salty, and pungent elements like butterscotch, ginger, and hibiscus.The book is all the more surprising because Raiford did his best to remove himself from that bubble that others consider “Southern” or “soul food.” For many Black chefs in the 1980s, the stereotypical assumption that they would rely on diner favorites was stultifying. “In culinary school, I tried to distance myself from Southern food,” Raiford says. “Nobody allowed me to do what I wanted to do because they had a narrow vision: fried chicken, macaroni and cheese, collard greens, everything has to be fried or with bacon.” But in addition to the need for variety and cooking beyond expectations is the concern for promoting balance and healthier practices. “I’ve been using a little steak seasoning to make my greens because there were so many people who like their greens without meat. You’re looking for that umami, that smokiness—not necessarily the meat.”In his work, Chef Raiford expands the notion of health. To him, health means the maintenance of healing practices that trace back centuries: the harvest and the use of plants like mullein, sumac, thistle and wild thyme. “Good health is eating in balance and knowing the vitamins and nutrients and knowing that certain wildcrafted herbs and spices we grow and buy have health benefits,” he tells me. “It’s also knowing the quality of the food you eat, and the soil. Good stuff in the ground and good stuff out—you have to know what kinds of nutrients are in the soil so you know what’s going in your body.Bress ’n’ Nyam tackles so many issues in what could have been just a collection of recipes meant to amuse and celebrate. It is a microcosm of one Black chef’s hard work toward a holistic vision for his resurrected family farm. Old luminaries are honored in new ways. Here we have an opportunity to really see the big picture—that concern for preserving family and local traditions, supporting Black businesses like farms and distilleries, eating well and in health and with joy, and keeping people of color on ancestral land are a braid of power. This is the conversation we need to celebrate and expand, not just long for. This cookbook is here to tell us that time for that conversation is now.Photo by Siobhán Egan, cover courtesy of The Countryman Press, a Division of W.W. Norton & CompanyBress 'n' Nyam$30 $18 at Amazon$28 at Bookshop.org$30 at Barnes and NobleExplore Bon AppétitCookbooksBooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-13", "author": ["Condé Nast", "Michael W. Twitty"]}