{"id": "e883c421b609ff6c95398f7d6206c074", "url": "https://www.bonappetit.com/recipe/tahini-billionaire-bars", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Tahini Billionaire Bars Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTahini Billionaire BarsBy Sarah JampelMarch 22, 20204.6(83)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Susan Spungen EmailPinterestPrintEmailPinterestPrintFor the seventh recipe in the Basically Guide to Better Baking, we took the millionaire bar—shortbread plus caramel plus chocolate (think of it like an oversized Twix)—and gave it an upgrade with sesame seeds and tahini. The shortbread is tender, the filling is gooey, and the chocolate ties it all together. Be sure to give the tahini a good stir with a butter knife or mini offset spatula before you whisk it into the butterscotch—it has a tendency to separate. (It helps if you buy the good stuff. We love Soom brand!) Slice the finished bars into pieces using a serrated knife so that you can saw through the layers rather than smoosh them. If you're still having trouble, just stick them in the freezer until the butterscotch is firm enough to easily slice. More questions? Head to our forum where we're eager to help. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronScale$25 At Amazon8\" Baking Pan$25 At AmazonParchment Paper$3 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonWooden Spoon$6 At AmazonForkMedium Saucepan$39 At AmazonWhisk$10 At AmazonSpoon$24.69 At AmazonSmall Offset Spatula$6 At AmazonCutting Board$10 At IKEAIngredientsMakes 25-36Nonstick cooking oil spray or vegetable oil (for pan)1cup (125 g) all-purpose flour¾cup (83 g) powdered sugar⅓cup toasted sesame seeds, plus more for serving2¾tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, divided1cup (2 sticks) chilled unsalted butter, divided2large eggs1¼cups (packed; 250 g) light brown sugar¾cup heavy cream½cup tahini (such as Soom)1tsp. vanilla extract6oz. bittersweet chocolate (65%–75% cacao)PreparationStep 1Place a rack in middle of oven; preheat to 350°. Lightly coat a 9x9” or 8x8” baking pan, preferably metal, with nonstick cooking oil spray or vegetable oil. Line with parchment paper, leaving overhang on all sides. (If you have a precut sheet of parchment, simply slice it in half crosswise, then overlap the two halves to line the pan.)Step 2Whisk 1 cup (125 g) all-purpose flour, ¾ cup (83 g) powdered sugar, ⅓ cup toasted sesame seeds, and ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a medium bowl. Cut ½ cup (1 stick) chilled unsalted butter into ½” pieces and add to dry ingredients; toss to coat. Using your fingers, work in butter until pieces are about pea-size.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Separate 2 large eggs—the easiest way to do this is to crack open eggs one at a time and gently pour into a (clean) hand, letting whites fall through your fingers either into the sink or a small bowl while trapping the yolk. Add yolks to bowl with flour mixture and mix in with a rubber spatula or wooden spoon. Dough should hold together when squeezed in your hand.Step 4Scrape dough into prepared pan and gently press into an even layer (lightly flour your hands if needed). Prick dough with a fork in several spots (this will help it stay flat as it bakes). Lightly flour the fork if it's sticking to the dough.Step 5Bake shortbread until golden brown, 24–28 minutes (or up to 35 minutes if using a glass dish). Let cool slightly.Step 6While the shortbread is cooling, make the tahini butterscotch. Cut remaining ½ cup (1 stick) chilled unsalted butter into 8 pieces. Heat butter and 1¼ cups (packed; 250 g) light brown sugar, whisking constantly, in a medium heavy saucepan over medium until butter is melted and sugar is dissolved, about 3 minutes. Whisk in ¾ cup heavy cream and 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt. Bring to a boil and cook, whisking constantly, until bubbling becomes less frequent and butterscotch is thick enough to coat a spoon, about 5 minutes. (When in doubt, err on the side of giving the mixture another 30 seconds—it's better if it's a little too firm than too runny.)Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 7Remove from heat, add ½ cup tahini and 1 tsp. vanilla extract and whisk until incorporated and smooth. Pour butterscotch over shortbread and tilt pan to distribute evenly if necessary. Chill until set, 30–40 minutes.Step 8Coarsely chop 6 oz. bittersweet chocolate (65%–75% cacao) and place in a microwave-safe bowl. Melt in a microwave in 40-second increments, stirring between bursts. (Alternatively, place chocolate in a heatproof bowl set over a saucepan of gently simmering water a.k.a. a double boiler; do not let bowl touch water. Heat, stirring often, until melted and smooth.) Pour over butterscotch and spread evenly to edges of pan with a small offset spatula or rubber spatula; sprinkle with toasted sesame seeds. Chill until chocolate is firm, 1–2 hours.Step 9Using parchment paper overhang, pull bars out of pan and set on a cutting board; remove parchment. Using a serrated knife (a chef's knife will smoosh these), slice into 25–36 pieces (5–6 cuts in each direction) with a sawing motion. If you're having trouble slicing, feel free to freeze the bars for 20–30 minutes, which will harden the caramel and ease the process.Step 10Do ahead: Bars can be made 4 days ahead. Store airtight at in the fridge.How would you rate Tahini Billionaire Bars?Leave a ReviewTell us what you thinkReviews (57)Back to TopTriangleI made these a year ago. Every few months my husband brings them up and asks me to make them again. Deliciously rich!Kristin MHChicago, IL10/9/2021These were delicious! Billionaire bars are meant to be decadent, but next time I would cut the butterscotch in half and do a chocolate drizzle instead of a whole layer. The sesame flavor is a perfect balance for these.JazmineLos Angeles5/1/2021I've been dreaming about making these for the last 11 months and, after a curbside order got fulfilled with TWO POUNDS of bulk sesame seeds (instead of the 0.2 pounds I ordered, woops), I made tahini from scratch and got to work. I agree with other reviews that if you are after more sesame flavor and not something super sweet, the balance would probably be better if you halve the butterscotch volume - as it is, the (yummy but quite sweet) flavor overwhelms the also VERY good shortbread base. You can't really tell since the images are all taken from above, but in an 8x8 pan the butterscotch is half or more of the height of the whole bar. Definitely use the serrated knife as instructed. BreeHouston, TX2/14/2021I happened to have these ingredients on hand and gave them a shot. They're so good! I used the 8x8 pan, but I felt like the shortbread and butterscotch layers were a little too thick. I'd maybe try these in a 9x9 pan and probably still use less butterscotch. I'd also cook the butterscotch a smidge longer (I did about 5 1/2 - 6 mins). The steps were well explained and I didn't have any problems with my butterscotch (making caramel will be the death of me). Overall, easy and tastes great!RachelProvo, UT1/11/2021I am not a heavy dessert-maker, but I love these! I've made them a few times for gatherings when I'm left with dessert duty & they are an impressive crowd pleaser too. love the sesame shortbread layer!erikaTaos, NM12/15/2020What's especially great about these bars is you can just search B I L L I O N A I R E and this recipe comes up instantly. Points for being memorable. They are also quite delicious, especially for people who like salty/nutty/chocolatey desserts. My second time making them, I substituted 1/4 cup of ground corn meal for the while flour in the shortbread layer and am quite pleased. Only faintly corny and a bit softer. I also used dark brown sugar bc that's what I had on had, and half the chocolate was 85%. Still excellent. Maybe even excellenter. Hallie DavisonMEXICO CITY8/13/2020After reading reviews, I was worried about the sheer amount of butterscotch relative to the other layers. I made the full amount but only used about 1/2 of it–which gave me more cookie base and approximately even amounts of chocolate and butterscotch. I'm pleased with this ratio, but if I were to do it again I would consider using a sweeter chocolate (I used 72%) and experimenting a little with the shortbread. For me the sesame shortbread is the star here, but I would have preferred a more buttery, less crumbly version.AnonymousCalifornia8/2/2020remembering how delicious these came out the first time, tonight we wanted to make something for a movie night - Popped a ton of popcorn and laid it out, then made this tahini caramel and drizzled it all over, then drizzled chocolate and topped with sesame seeds and salt and HOLY CANNOLI my friends - it's incredible! BILLIONAIRE POPCORN!kmarxmarxchicago, il8/1/2020FANTASTIC. My first time making shortbread AND butterscotch, but I managed not to f*** either up! I doubled the shortbread because I was using a bigger pan, which led to a better savory/sweet ratio (I think). _livWashington, DC7/24/2020These turned out really well even though I accidentally added double the amount of salt! I thought making the shortbread and butterscotch would be testy but ended up going exactly as the recipe said :) AnonymousCalifornia6/10/2020So good!! A little salt on the top would be a nice tweak which I will try next time, and there will be a next time. AdamsmumMaple Grove Minnesota6/7/2020Great flavor with the toasted sesame seeds in it and tahini.  Easy to make too.  I love when weights are given as it's so much easier (and much more accurate) to measure out flour, sugar and brown sugar on a scale than in cups.  I made in a 9x9 pan and used 9 oz of chocolate instead of 6 oz to get enough coverage on the larger pan.  Forgot to toast extra sesame seeds for the top so I sprinkled Malden salt on top instead - which is always perfect on chocolate.  Make sure your sesame seeds are fresh as they go rancid quickly.  I now keep mine in the freezer to make them last longer.majabloshop4206Lakeville, MA6/1/2020Just made these for the second time and they’re just as delicious as I remember.  I used an 8x8 square metal pan and the ratio of shortbread/caramel/chocolate was just right for my tastes.  The filling is really well balanced with the savory tahini and richness from the butter, I definitely didn’t find them to be too sweet like some reviewers.  ChelseaTempleLos Angeles5/30/2020These are delicious! The tahini adds a lovely melty texture to the butterscotch while the sesame seeds add texture and nuttiness. The shortbread came out great too. \n\nI have a pretty big sweet tooth and they ARE very sweet. I made it in a 9in diameter round pan and ended up cutting the 10 pieces I originally portioned into 20. I took the advice of some reviews below and used 4 oz of chocolate that I mixed a small bit of EVOO to avoid cracking. Next time I will add a tad bit more salt to the shortbread (or maybe half salted butter?) and sprinkle some on top with the seeds. racheloyoungDallas, TX5/26/2020These are AMAZING! I think the ratio of butterscotch to shortbread is a little high, which contributed to the too-sweet feeling that some of the commenters mentioned. I do think the tahini provides an amazing savory flavor to slightly counter this though! Next time, I'm going to make only 75% of the butterscotch. hrajanaSan Francisco5/24/2020Explore Bon AppétitCookieDessertBar CookieTahiniCondiments, Sauces & PastesChocolateOther IngredientsBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-22", "author": ["Condé Nast", "Sarah Jampel"]}