{"id": "e894bd97cae767023d9241ea1f59df19", "url": "https://www.bonappetit.com/story/l-and-b-spumoni-gardens-chefs-table", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "The Best Chef’s Table Is the L&B Spumoni Gardens Chef’s Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Best Chef’s Table Is the L&B Spumoni Gardens Chef’s TablePrepare for a red-sauce baptism.By Elyse InamineApril 16, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.What was the last tasting menu you had? Did it start with “Dueling Shrimp,” a wreath of alternating deep-fried and boiled shellfish, with a pool of rubber-duck yellow and chunky cocktail sauces pooled in the center? Were the pastas served on giant platters the size of a toddler, and the salads piled six inches high? What about plastic tablecloths and water glasses? Was the floor kind of slippery, like it was polished with olive oil? Did you bring home 12 boxes of leftovers?I didn’t think so.New York City is spoiled with spectacular tasting menus; throw a rock and you’ll hit more chef’s counters than Chipotles. But nothing compares to the chef’s table experience at L&B Spumoni Gardens in Gravesend, Brooklyn. It’s less a hushed affair for ooh-ing and ahh-ing at tweezer-assembled bites of hyper-seasonal, hyper-local, hyper-pricey ingredients (ah, yes, sea beans!) than it is an excuse to order everything on the menu in Costco-size bulk. Doesn’t that sound wonderful?Eighty years in, those family feels are alive and well.\nPhoto by Emma FishmanA bunch of us at Bon Appétit thought so—and so did a lot of other people one Friday night about a month ago. Local families, regulars celebrating birthdays, big groups of hipsters, and very hungry couples were packed like cannelloni inside the kitschy Greco-Roman-ish dining room and its adjacent atrium, complete with “marble” statues of cupid in various poses, a mirrored ceiling, and hand-written black light signs. “Is anyone observing Lent?” our waiter asked as we settled in. “No, but can you help us with a bottle opener?” senior editor Amiel Stanek asked as he pulled out six bottles of natural wine, bless him. And so began our L&B Spumoni Gardens red sauce baptism.The four-course chef’s table can be prepared to serve anywhere from two to 200 people, at $50 to $70 a pop—depending on your selection. (Also unlike other chef’s tables, you actually get some level of choice.) Our “Opening Act” began with fried mozzarella wedges, baked clams casino style, the aforementioned shrimp two-ways, and a mountain of romaine, tomatoes, radishes, red onions, and parm, stacked high like a savory shave ice. For the second course, “Pasta-bilities,” enormous platters of penne with broccoli rabe and peppery sausage and linguine studded with clams and lots of garlic hit the table. Next came textbook slabs of chicken parm; tender, thin pork chops with peppers; and “catch of the day” branzino with an orange sauce that might have been squash. We shrieked with delight at every dish. We Instagrammed everything. We unabashedly stuffed our faces, and then bashfully asked them to bag the things we couldn’t finish.So. Much. Food.\nPhoto by Emma FishmanThat’s when the real closer landed like some great maximalist artwork: an architectural array of ice cream cones, Crayon-colored green and yellow ice cream in emoji-like scoops, great puffs of whipped cream topped with maraschino cherries, and a secret puddle of chocolate sprinkles we only found once we’d made a mess of it all. After we picked at the cherries and finished the last drop of wine, we paid the bill and started divvying up the leftovers. On our way out, we looked back on the happy scene and spotted a sign. It glowed with a very L&B kind of encouragement to return very soon: “He may have sacrificed his life for you, but he rose for our chef’s table. Happy Easter.”Elyse Inamine is the digital restaurant editor at Bon Appétit.Explore Bon AppétitRed SauceItalian AmericanBrooklynRestaurantsRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Elyse Inamine"]}