{"id": "e89b5510dff053f0bc44712ea6b73eae", "url": "https://www.bonappetit.com/story/kielbasa-and-cabbage-bigos-stew", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "This Bigos Recipe Is the Comfort Food You Need This Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Kielbasa and Cabbage Stew Is the Comfort Food You Need This SeasonYou and 14 of your closest friends.By Alex BeggsOctober 23, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailMain ingredients: “Various meats.”That’s the snippet you get from Google when you’re searching for a bigos recipe—and that’s how you know you’re in business. What’s for dinner? Various meats, friends. Various. Meats.In a stew! A “hunter’s stew” to keep you warm in the woods, as bigos is typically translated from Polish. There’s usually kielbasa, maybe some bacon, or pork shoulder, whatever hunks of stew meat you happen to have leftover. Cabbage, sauerkraut, potatoes, carrots, and onions make an appearance. It’s a hearty and humble stick-to-your-ribs dish that varies from home to home. Above all, there are meats. Various.In our new recipe, Kat Boytsova starts with bacon, then cooks kielbasa in the bacon fat. Sounds like a good idea, no? Then you remove the kielbasa, which can turn crumbly when cooked too long in soup, but you’ll add it back later. Next, the supporting players drop in: Garlic, tomato paste, spices, onion, cabbage, carrots, potatoes, sauerkraut, and beef stock. A bit of white wine cuts through the pork fat, while other recipes can call for up to two bottle of beer for a particularly...celebratory hunt, I guess. Your call.While researching variations on bigos, we learned that sauerkraut functions in place of lemons, which were hard to find in 18th century Poland. We loved the tang and funk it adds to the rich stew, especially if you use homemade (thanks, Brad) or something fresh from the farmers’ market. Kat’s recipe sneaks in a shredded apple to counteract the sauerkraut’s acidity.What it would look like if you were to fill a swimming pool with bigos.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensIn around two hours of stovetop bubblin’, everything melds together, the cabbage becomes silky, the carrots get smooth but not mushy, and the apple disappears into the broth. You’ll know the bigos is done when you can slice through a potato with a spoon. Then serve it straight from the Dutch oven with rye or pumpernickel bread, a slather of butter, some fresh dill, maybe a dollop of sour cream, whatever makes you happy.When Kat was developing this recipe, she told us about her grandmother’s Uzbekistan bigos, which was completely vegetarian, with mushroom and eggplant—whatever was overflowing from their farm’s harvest. Then she layered the vegetables with rice, cabbage, and potatoes. If you’re not a kielbasa (or various meats) person, Kat recommends sturdy, earthy vegetables in their place. Anything delicate won’t hold up to the long cook time of the potatoes.And we all could use some holding up. Let this meaty stew keep you warm this winter—I mean, a nice sweater and a scarf could also help—and even better if you get to share it with 6-14 of your closest friends. It really makes a lot.Get the recipe:Bigos (Hunter’s Stew)This Polish hunter’s stew features kielbasa, smoky bacon, melty cabbage, and lots of delicious broth that can be sopped up with bread.View RecipeThen make sauerkraut with Brad:Explore Bon AppétitPorkStewPolishComfort FoodBaconCabbageWinterBraiseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-23", "author": ["Condé Nast", "Alex Beggs"]}