{"id": "e89fe1c21fa569996a857b5730066600", "url": "https://www.bonappetit.com/recipe/grilled-flatfish-with-spoon-sauce", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Grilled Flatfish With Spoon Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueGrilled Flatfish With Spoon SauceBy Brad LeoneJune 2, 20205.0(2)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“To be honest, fish can be fickle on the grill,” says Brad Leone. “I’m pretty good at it and still I screw it up sometimes.” To improve the odds, cut the fish into four easy-to-handle pieces—flipping each piece individually is a lot less stressful than dealing with the whole big fish. But leave the skin and bones intact: The skin insulates its tender meat during grilling, and the bones help keep the pieces together.Ingredients2–4 servingsSauce¼cup raw pistachios10prunes, pits removed, coarsely chopped1garlic clove, finely grated2cups finely chopped parsley1cup finely chopped mint¼cup finely chopped tarragon¼cup kimchi or sauerkraut brine2Tbsp. Champagne vinegar or white wine vinegarKosher salt¾cup extra-virgin olive oilFish and Assembly12–4-lb. flatfish (such as sole, flounder, or turbot)Extra-virgin olive oilKosher saltAleppo-style pepperPreparationSauceStep 1Toast pistachios in a dry small skillet over medium-low heat, tossing occasionally, until browned in spots, about 5 minutes. Let cool, then finely chop.Step 2Gently mix pistachios, prunes, garlic, parsley, mint, tarragon, kimchi brine, and vinegar in a medium bowl to combine; season with salt. Whisk in oil, then taste and season spoon sauce with more salt\nif needed.Fish and AssemblyStep 3Prepare a grill for medium heat. Using a chef’s knife, cleaver, or serrated knife, cut fish crosswise into 2\"–4\"-wide planks (the larger the fish, the wider the planks); halve planks if fish is large. Pat fish dry, rub all over with oil, and season with salt and Aleppo-style pepper. Grill fish, undisturbed, until about 70 percent cooked through (use a knife to slide into flesh to check), about 5 minutes. The skin should release easily from the grate when the fish is ready to turn. If it’s sticking, keep cooking.Step 4Using a large fish spatula, turn fish over and grill until cooked through (fish is done when a paring knife easily pierces the flesh along the side), about 2 minutes.Step 5Transfer fish to a platter and spoon sauce over.How would you rate Grilled Flatfish With Spoon Sauce?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleSo easy to make and full of flavor. I used the left over sauce on grilled shrimp the next night and it was delicious. This is a keeper!!!BetsyVero Beach,, Florida1/17/2021Explore Bon AppétitFishSeafoodSoleFlounderPruneDried FruitFruitPistachioNutParsleyHerbs & SpicesMintSummerMainDairy-FreeGluten-FreeHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Brad Leone"]}