{"id": "e8a1c258bece7bcf1673a05b5bb60697", "url": "https://www.bonappetit.com/story/feel-better-cooking-at-home", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "3 Things to Make You Feel Better About Cooking at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscooking3 Things to Make You Feel Better About Cooking at HomeFinding relief, and release, in front of the stove.By Carla Lalli MusicMarch 16, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Michelle GattonFacebookTwitterEmailEvery week, Bon Appétit food editor at large Carla Lalli Music is taking over our newsletter with some helpful cooking advice and shopping tips for the moment we’re in. If you have any questions about recipes, shopping, or meal prep while you’re working from home or practicing social distancing, we want to hear about it! Please email us at askcarlaanything@gmail.com, and Carla will do her best to answer them. Sign up for our newsletter, and you’ll get this letter before everyone else.It’s been a week since my last newsletter, but as I sit down to write this, I feel like I’m dropping back in from another dimension. Seven days ago, my kids were in school, my husband went to work in an office every day, and I was still going to the gym. Well, schools in NYC are now closed, my husband and I are both working remotely, and my workouts have moved outside. The only thing that remains the same is that we’re all still trying to figure out what foods we should buy, cook, and eat.Last week, Bon Appétit asked for your quarantine-related cooking questions on Twitter, and I answered many of them on Instagram. Whether you tuned in to the Story or not (and it’s not too late to watch!), I wanted to share a few of the most helpful takeaways for the current moment—which is changing faster than we can even anticipate—right here.Want this letter before it hits the website? Sign up for our newsletter!Trust me: She’s tastier than she looks.\nAlex LauPick a Protein, and Go LargeA lot of you asked for advice on the proteins you should be buying and making, and I am here to tell you that there’s a big wide world beyond canned tuna and hard-boiled eggs. If you’re a meat eater, I recommend braising a brisket, which will put some of the pantry items you probably already picked up (canned tomatoes, carrots, onions, and garlic) to good use, and will give you a reasonably priced stockpile of saucy, shreddy, tender meat that vastly outweighs the effort you put in. This will yield enough for several meals: Try making brisket tacos (I would put sauerkraut or kimchi on them), brisket hash, chopped up brisket as sauce for egg noodles, or, you know, eating cold brisket while standing up at your kitchen counter, because it’s your house and you can do what you want. You can also set aside a big portion for freezing (or drop some off with a neighbor who doesn’t cook or could use some extra support, but only if you’re comfortable with that). Yes, this is me telling you to make one thing and eat it over and over until it’s gone, and that’s on purpose. There’s a constant stream of new information coming down the pike. Thinking about what new and different thing to make every night can be too much to worry about—having dinner in the bank is a gift.Just try not to devour this all.\nPhoto by Emma Fishman, Food Styling by Yekaterina BoytsovaPower Up on ProduceOver the weekend, some shoppers—especially those who hit big-box stores—encountered empty canned goods aisles, cleared-out frozen food sections, and cereal in short supply. Panic-buying can do that to a place (it reminds me of the way people respond when there’s a blizzard in the forecast). If this happens to you, remember two things: The inventory will be restocked. Everything I’ve read to date supports this. Our supply chain is intact and there’s plenty of food to be distributed (including everything that’s being diverted from now-shuttered college cafeterias, cruise ships, Vegas buffets, and elementary schools). Check back in a day or two; some stores are changing hours to give staff more time to unload deliveries and keep the store clean, but the shelves will refill. Or try a smaller, local purveyor before giving up (while the Trader Joe’s in my Brooklyn neighborhood is a zoo, every bodega I’ve gone into has been a dream). Don’t forget the produce aisle. Rice and beans are great and everything, but have you ever had a batch of braised greens, a skillet of caramelized cabbage, a pan of cheesy broccoli, or a platter of sweet and salty Chinese broccoli? Fresh veggies are abundant, nutritious, inexpensive, quick to prepare, and extremely good for you. Knock yourself out. Most cooked veg will last a few days in the fridge—if you can manage not to eat it in one sitting.No banana should ever go to waste.\nPhoto by Chelsie Craig, styling by Claire SaffitzPut Things in the Freezer Besides PizzaThe coldest storage is for so much more than frozen spinach and DiGiorno pizza. Here are three things you should have on ice:Good bread, pre-sliced, wrapped airtight. Buy the most beautiful loaf you can find; keep it frozen and you won’t waste a crumb.Denuded bananas—the ones that got really ripe on your counter but you’re not making banana bread any time soon. Peel them, freeze them, then drop them into smoothies (or, defrost when you’re in the mood to bake!).Grain-cooking liquid. What’s that now? Every time you make a batch of grains by simmering them in salted, olive oil–gilded water, save the cooking liquid. It can be used for the next batch of grains or beans, in lieu of stock for a soup, or as part of the braising liquid for any meat.I know there’s a lot to be unsure of right now, but for those of us who love to cook, there’s a lot to feel positive about, too. You can continue to feed yourself, your family—and others, if that feels safe—and I hope that in doing so, you find relief, and a release.Explore Bon AppétitCarla NewsletterCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Carla Lalli Music"]}