{"id": "e8a38058794a747c6831e19af95abe1a", "url": "https://www.bonappetit.com/story/beans-greens-sardines", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "Memorize These 3 Words and Eat Well Forever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMemorize These 3 Words and Eat Well ForeverBeans, greens, and sardines—a healthy rhyme you can actually eat.By Carla Lalli MusicJanuary 9, 2020FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, prop styling by Kalen KaminskiFacebookTwitterEmailEvery other Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.This one time, at the farmer’s market, I asked my wise friend Stefan Parisi what was for dinner. His reply: “Beans, greens, and sardines.” I have never forgotten Stef’s rhyming culinary philosophy, and I have been thinking about it a lot lately. I don’t know if he knew it then, but the message behind his meal plan is gospel these days. If you want to feel good and feel like you’re doing good for the planet, a legume-forward, plant-based, and sustainably seafood-centric diet is a great way to go about it.I’m not here to set resolutions for you or anyone else, self included—I just ate a chocolate biscotti while writing this. But I did come back from the holidays thinking a lot about Stef and his BG&S diet. It’s tough to lean into a produce-focused diet right when winter is really hitting its stride, which is why I keep coming back to beans. This video details the method I use to make a batch every weekend—and with that, you get it all! Protein, fiber, deliciousness, plus a broth that helps you use up your random herb scraps, lone onions, and floppy carrots. Legumes are good for you, their flavor profile can be customized to any preference, and they’re not red meat. Plus, canned beans are one of the world’s great shelf-stable items: keep garbanzos and black beans stocked, and you’re a third of the way to dinner.These three recipes are some of my favorite bean preparations:Basically’s 15-minute refried beansFancied-up canned beans with celeryBrothy beans with farro and mushroomsWant this letter before it hits the website? Sign up for our newsletter!Beans AND greens!\nPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiGreens! We should all be eating more greens. Leafy ones, tender ones, sprouty ones, herby ones. Cold weather is cruciferous season: your cabbages, kales, and turnip-y things are very tasty right now. I’m always down for a simple garlic and olive oil sautéed situation, but to put the beans with the greens, try one of these:Literally greens and beans on crusty breadSpicy stewy beans and wilted greensLentil salad that lasts for days in the fridgeFinally: those sardines. Although top of the list of very healthy fishes—they’re high in omegas and low on the food chain, qualities that recommend them both for your body and for the earth’s resources—you could substitute any sustainable fish you like to eat. (Ask a fishmonger if you want some advice.) And if you don’t like cooking fish at home, you don’t have to! I recently came across this line of Spanish canned seafood that I liked a lot called El Caprichio. Their products are fished and processed sustainably and they also taste incredible. Picking up a can is a great way to be sure of what you’re getting, and buying fish that you don’t have to cook immediately is always a bonus. My great-grandfather liked to eat sardines and anchovies on buttered crackers, which is a pretty no-brainer way to incorporate some little fishes into a meal, but if you want to make more of a to-do, try one of these tin-friendly dishes:Spicy pickled veggies and sardinesAnchovies and sardines with chile butter on toastPasta of the seaAnchovies + chile butter = perfection.\nIt’s a confusing time to love food. Should we eat less meat, no meat, more fish, none of the fish, some of the fish? Can we cut out animal protein and still get complete nutrition? Do the things we do on a small scale really matter? There’s a lot to read and thousands of opinions, and instead of shutting down, find one thing that works for you. If we all ate more like our great-grandparents did, we would eat less meat, less processed foods, and more frugally, too. Stef’s combo just feels right, and some nights, it definitely makes me feel better.Explore Bon AppétitCarla NewsletterRead MorecookingIf Loving Beans Is a Crime, I’m Officially ScrewedBy Carla Lalli MusiccookingThese White Beans Are More Reliable Than My WiFiBy Alex BeggscookingWhat's The Deal With The Goop In Canned Beans?By Emma WartzmancookingHow To Make Refried Beans in 15 MinutesBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-09", "author": ["Condé Nast", "Carla Lalli Music"]}