{"id": "e8a9d594a00067ab13169c47db3952e1", "url": "https://www.bonappetit.com/story/sister-pie-peanut-butter-paprika-cookies", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "The Peanut Butter Cookies Recipe from Sister Pie is Way Better than Normie Ones | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy Sister Pie’s Peanut Butter Cookies Are Better Than the Normie OnesPlus, the Detroit bakery‘s new cookbook means we can all make them. All of the time.By Alex BeggsOctober 30, 2018FacebookTwitterEmailPhoto by E. E. BergerFacebookTwitterEmailIt sounded like a construction site inside Sister Pie one recent cold Detroit morning. All of the bakers were pounding out chilled pie dough in unsynchronized cacophony. BANG. Hi are you Lisa? BANG. Yes! Let’s go...outside. BANG! Good idea.Lisa Ludwinski opened Sister Pie in 2015, quickly earned a loyal local following, and this month, the Sister Pie cookbook finally hit bookshelves and flour-dusted kitchen counters. Those who can’t make it to Michigan can make the bakery’s famous salted maple pie in their own ovens, or the dramatic toasted marshmallow butterscotch pie, or the apple sage gouda stunner. There’s also a chapter on salads?! But one of the sections I was most excited about was the “Cookies, Etc” one, not just because they’re easier (so what? They are!), but specifically because of the peanut butter paprika cookie. It’s soft and pliable, with a topping of glittery sugar and paprika that makes it stand out against all other traditional hashtag-marked PBs. (If you’re like, “paprika? Huh?” It adds a burnished rust color, very autumn leafy, but it’s hard to detect otherwise. You might catch a hint of smoke in some bites, but I didn’t.)The cookie setup at Sister Pie is even bigger since this photo was taken.\nJesse David GreenLudwinski was telling me all about it as regulars waved to her on their way inside for their morning coffee and pastry. “My father was hell-bent on me developing a peanut butter cookie,” she told me while I slowly tore into one to examine the gooey interior. “He texted me, ‘How about peanut butter and pear?...or peanut butter and paprika?’ I was like, peanut butter and pear sounds pretty bad. But paprika? I’ll give it a shot.”Her recipe uses smoked paprika from Michigan purveyor Red Goose Spice Company in the dough as well as the sugar coating on top, which adds sparkle as much as it adds a pop rocky-texture mixed with the bakery’s “Sugar-Sugar” topping—equal parts turbinado sugar and regular white granulated sugar. (They use it to top pies, sweeten cream cheese in muffins, and to smear on scones too. The turbinado sugar is a bigger crystal, so you get two types of crunchy going on. It’s sugar nuance. The kind of thing Ludwinski thinks about a lot.)Let’s talk about the PEANUT BUTTER. It’s Once Again’s natural peanut butter, which doesn’t separate like other natural peanut butters and drive cooks insane. (It’s the closest natural thing to Jif, Ludwinski told me.) She buys it in huge 9-pound “barrel” from Amazon. (Add that to your cart along with our other favorite bucket.)When the cookie dough is all mixed, she lets it chill in the fridge for a few hours. “We chill cookie doughs that need the flavor to develop a little more,” she told me, “but it’s fine not to. You end up with a different looking cookie. Chilling makes it flat. Baking right after mixing will turn out dome-y, taller, cake-ier cookies. You can do either.”We went back inside the bakery—BANG!—where Ludwinski and her team were finalizing the Thanksgiving pie lineup. They expect to bake 1,000 pies for the holiday, including an apple butter chess-like pie with cinnamon-sugar crust—“an apple cider donut meets... pie!”—that sounds crazy good.But this pie rookie is going to stick to the cookies, and after I master these PB ones, I’m making the golden oaties studded with sweet golden raisins, and then the salted rosemary shortbread, which go as well with tea as much as tomato soup. Or maybe the lightly glazed buttered rum shortbread for Butterbeer vibes? Or get funky with buckwheat flour and try the chocolate chip cookies? I have cookie indecision and I can’t wait to see how it shakes out.Get the recipe:Peanut Butter–Paprika CookiesThis cookie’s soft, salty-sweet, chewy center is spiked with smoked paprika. It’s familiar yet new, comforting with a side of adventure.View RecipeBuy it: Sister Pie: The Recipes and Stories of a Big-Hearted Bakery in Detroit for $17 on AmazonExplore Bon AppétitCookieDetroitCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-30", "author": ["Condé Nast", "Alex Beggs"]}