{"id": "e8afbec7bf25559db0bd36c313b2f36a", "url": "https://www.bonappetit.com/story/san-quentin-state-prison-cooking-show", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "How a Prison Cooking Show Connects Residents to Life Outside | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow a Prison Cooking Show Connects Residents to Life OutsideA journalism project at San Quentin State Prison has morphed into a form of therapy and connection.By Emma SchwartzJuly 2, 2019FacebookTwitterEmailPhoto by Damien MaloneyFacebookTwitterEmailWalk into any cell block in San Quentin State Prison, and you might smell chicken frying, mackerel croquettes sizzling, adobo chile powder, a hint of fish sauce. One whiff and it would seem the corrections and rehabilitation facility just north of San Francisco is full of amateur chefs.Determined to eat something other than the bland food they’re served daily, incarcerated residents in prisons everywhere have found ways to cook for themselves using some makeshift cooking equipment and ingredients from the mess halls and commissary. The residents at San Quentin are no different, making apple pie crusts out of cake, tamales using crushed tortilla chips, and pasta with tomato-less marinara, all with little more than a plastic spoon and a hotpot (essentially a hot-water kettle, and the only piece of cooking equipment allowed in San Quentin).Since spring of 2018, a group of these cooks have been showcasing their inventive techniques and telling the stories behind their favorite dishes on the San Quentin Cooking Show. The project, organized by the first prison chapter of the Society of Professional Journalists, is part of a video journalism program with a rotating class of roughly 20 students. The show, which started as a simple way to teach the basics of video storytelling, has evolved over the years into a therapeutic space for incarcerated residents to open up about their backgrounds and reconnect with their own cultures while incarcerated.The show isn’t yet available to watch outside the prison (though the ultimate goal is a YouTube channel), but four of the students I teach were willing to share an inside look at their dishes and the stories behind them. Here, they tell us about the recipes that remind them of life outside the prison walls.Juan Meza\nPhoto by Damien MaloneyJuan MezaBeing locked up, I miss a lot of celebrations con mi familia. The one I miss the most is making tamales on Christmas, a tradition shared by a lot of Chicanos like me. For many of us, it’s the same scene. Familia gathers at a tia’s house. The aroma of spicy shredded beef and pork wafts through the air. The sound of women’s laughter and squealing children fills the kitchen as masa is spread across corn husks, a dollop of meat in the center, the little package rolled, sealed, and steamed. No men are allowed inside the house while the tamales are made. They’re outside or in the garage keeping watch over two pots the size of small children filled with boiling water to steam the tamales. They play darts or horse shoe, cook, taste test, and drink cerveza.I didn’t want to lose that tradition, so I found a way to make tamales for special occasions here in the joint. There’s no local taqueria to buy masa de maiz, but I improvise using what I can get: tortilla chips, a hot pot, and a few plastic trash bags.Sharing the tamales gives us a sense of self, of community. It’s a way we hold onto our roots, our family values, and humanity. It’s a time to come together and enjoy what people enjoy most—a meal made con amor.Meza’s Christmas Tamale.\nPhoto by Damien MaloneyAll the ingredients that go into it.\nPhoto by Damien MaloneyHow Juan Makes His Christmas TamalesFill a hotpot with water and bring to a boil. Double two sets of small plastic trash bags, putting one inside the other, and then tie the bottom of each pair in a knot. Empty 2 pouches of Comal Carne De Cerdo Seasoned Pork into one set of the plastic bags, and season with 1½ tbsp of crushed Milpas Dried Arbol Chili Pods, ¼ cup of Hsin Tung Yang Fried Shallot Slices, ½ cup of Hsin Tung Yang Fried Garlic, 1 tbsp of Garlic powder, and El Pato Salsa Picante Chili Jalapeño and salt and pepper to taste. Empty 2 pouches of Rip ‘N’ Ready Shredded Beef with broth into the other set of plastic bags and season to taste with Tuong Fresh Hot Chili Garlic Sauce and Salsa Huichol Hot Sauce. Expel air from bags, tie a knot one quarter of the way from the top, and place one bag into hotpot and cook for 30 minutes. Repeat with the other bag.Tie the bottom of a large plastic bag into a tight knot. Crush 2 bags of Cactus Annie’s Nacho Tortilla Chips until contents are small crumbs, and add to plastic bag. Add some hot water from the hotpot in small amounts, kneading the water into the crumbs until it forms a masa the texture of soft cookie dough. Open the bag, and using your hands, spread the masa into an 8” x 16” rectangle ¼ -inch thick. Empty both bags of cooked meat into the center of masa. Roll masa around meat and form into one long cylinder. Let sit for 10 minutes until masa has settled.Rahsaan Thomas\nPhoto by Damien MaloneyRahsaan ThomasI’m half Black and half Puerto Rican, but there’s nothing I love more than Italian food—especially marinara. Something about it thrills my tongue, and I adore the red sauce poured over chicken cutlets, meatballs, or any type of pasta. But at San Quentin, where I’m serving a life sentence, the sauce I love is forbidden.In 2004, the year after I arrived, officials identified tomato-based products as a possible ingredient in Pruno—a cell-made alcoholic drink. Due to incidents between drunk men and guards with anger management issues, the administration deemed ketchup and marinara sauce menaces and banned them both. The chow hall still serves spaghetti every so often, but it tastes and looks like punishment: Sticky pasta with dried sauce spots that are more like reddish tint than anything that was ever liquid. It’s nothing like the dish I miss with all my heart.Determined not to go without, I scoured the catalogs of vendors that sell approved products to incarcerated people and figured out how to recreate Skillet Spaghetti, one of my favorite Italian meals to make before I arrived at San Quentin. In place of marinara I used a can of chile with no beans, and instead of a skillet I used a hotpot. (Forget about the jumbo shrimp I also used to add.)The result, while not quite the same as the original, is the next best thing. It costs me $19.70 to feed three people—the equivalent of a month’s salary in prison—so I can’t make it often. But it’s worth it at least once every 90 days to treat myself to a dish that reminds me of home and everyone I love.Thomas’ Hotpot Spaghetti.\nPhoto by Damien MaloneyHow Rahsaan Makes His Hotpot SpaghettiFill a hotpot to the 4-cup line and bring to a boil. Fill strainer with 1 package of Anatina Ziti Pasta, some Gold-n-Sweet whipped margerine spread (which I get from friends on a Kosher diet), and 3 pinches of Lawry’s Garlic Salt with Parsley, and place in hotpot. Meanwhile, add 2 packages of sliced Midamar Halal Beef Summer Sausages and 2 pouches of Brushy Creek Chili No Beans into a small, clean plastic bag. Add (guestimate) 1 tablespoon each of Spice Classics’ Italian Seasoning, Sevilla Sazón con Culantro y Achiote, and McCormick Minced Garlic seasoning. If available, also add diced onions, bell peppers, and red peppers from the chow (i.e. mess hall). Once the pasta is tender, remove it from the hotpot and add to a large bowl. Squeeze in some Velveeta Sharp Cheddar Squeezable Cheese. Place the plastic bag with your chili sauce and sausage into the hotpot and cook for roughly 25 minutes. Remove from hotpot, pour over cooked pasta, and serve.Timothy Hicks\nPhoto by Damien MaloneyTimothy HicksBack when I was six or seven years old, I would watch my mother and grandmother cook. I learned a lot seeing them throw down in the kitchen together, and loved their cooking—especially the sweet apple pies my mother would make every Christmas. The aroma of freshly cooked apples with the slightest hint of cinnamon and butter would permeate the entire house. I hated sharing them, they were so good. After my mother and grandmother passed away, I stopped having those pies. I’ve had relationships with people who knew how to cook, but not like momma did. They would try to make her apple pies, but they would never compare.When I came to San Quentin in August 2015, I remember walking by a cell and catching an aroma that smelled exactly like my favorite dessert. I stopped dead in my tracks and peered through the bars of another guy’s cell to find lunch boxes holding a square shape with a brown crust. When I found out he was making prison-style apple pies, I was blown away with excitement. I bought one—it was delicious. Then I bought another to figure out how he made it.To recreate it, I got all the apples I could find along with clean trash bags, because that is what we use to cook our food in; some substitute sugar from the mess hall, because even though officials don’t allow us to have real sugar anymore, we’re smart enough to improvise; and whatever cake I could get from guys who didn’t eat it for dinner. The seasonings and spices, I bought from the canteen. I had to get creative with my tools, and softened the apples by cooking them in a trash bag in the hotpot with some butter, cinnamon, and sugar. To toast my crust, I took a piece of square plastic, buttered it, laid some cake I’d smashed into a thin layer on top of that, and then cooked on top of the water in the hotpot.It doesn’t taste quite like the one momma used to make, but my Cake Crust Prison-Style Apple Pies still give hers a run for their money.Hicks’ Cake Crust Prison-Style Apple Pies\nPhoto by Damien MaloneyHow Timothy Makes His Cake Crust Prison-Style Apple PiesHeat a hotpot full of water. Cut 4 apples into 1/4-inch squares. Add them to a plastic trash bag with about 4 tablespoons of cinnamon, 4 tablespoons of substitute sugars, and half a stick of butter. Knot the bag and add it to the hotpot; let cook for about 30 minutes. Meanwhile, smash the cake down into one layer. Butter a square piece of plastic and lay the cake crust down on top. Once apples are softened, remove them from the hotpot and set them aside. Place the buttered plastic with the cake crust on top of the water in the hotpot and let it cook until the crust hardens. Remove from hotpot and top with cooked apples. Add a second layer of smashed cake on top, and serve. Alternatively, you can also use cookies as a crust, and add peanut butter or jelly as a topping.John “Yahya” Johnson\nPhoto by Damien MaloneyJohn “Yahya” JohnsonOver the past 24 years that I’ve been incarcerated, I have missed holidays and birthdays, monumental achievements like my son’s many graduations and the birth of my granddaughter, as well as smaller, everyday special pleasures—namely, my mom’s cooking. Two decades later, I still find myself thinking about the rich smell of her Jiffy Blueberry muffins, fried chicken, and macaroni and cheese—all the delectable things she made in her hot kitchen. I remember how much I adored her, knowing what a labor of love it was for her to feed her only child. Recreating my mother’s dishes from inside my prison cell brings all my memories of her and her cooking to life.One of my favorite dishes to make is a version of her pepper steak and rice. I’ve had to improvise, resulting in a creation all my own, but it’s still deeply rooted in my mom’s legacy. Instead of sirloin steak strips, a cut that’s foreign to San Quentin State Prison, I use halal beef summer sausage sliced into quarter size pieces. And though I can buy brown gravy through the quarterly package program, I rarely do because I have fallen in love with curry. The rest is chopped onions, red or green bell peppers (whichever is available), yellow chile or sliced jalapeño peppers, shiitake mushrooms (my own addition), adobo seasoning, garlic powder, and chile powder. My version never turns out as delicious as hers, but it manages to help keep me connected to her, my family, my home.All the ingredients in Johnson’s recipe.\nPHOTO BY DAMIEN MALONEYCurry Pepper Steak\nPhoto by Damien MaloneyHow John Makes His Curry Pepper SteakSlice one Halal Beef Summer Sausage into quarter inch slices and add into a pre-heated hotpot. Place a lid on top and cook for fifteen minutes, stirring periodically. After the sausage has browned, place one sliced red or green bell pepper, half of a sliced onion, six diced yellow chile peppers, and three dehydrated shiitake mushrooms broken into small pieces into the hotpot and cook for thirty minutes until vegetables are tender. Meanwhile, make gravy by mixing 1 tablespoon curry powder, 1/2 teaspoon adobo seasoning, 1/2 teaspoon garlic, ½ teaspoon chili powder, 1 tablespoon sriracha chile sauce, 1 packet of artificial sweetener, and 2 ounces of water in a bowl, stirring until contents are fully integrated. Add to pan with sausage and peppers, stir to mix, then allow to simmer for five minutes. Spoon over cooked rice, and serve.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-02", "author": ["Condé Nast", "Emma Schwartz"]}