{"id": "e8afe76428a2cfe7575b4b92e5c4e2d6", "url": "https://www.bonappetit.com/story/zebra-striped-shortbread-cookies", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "These Striped Shortbread Cookies Have Taken Over Our Instagram Feed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Holiday Cookies Have Totally Taken Over Our Instagram FeedsIt’s all zebra to us.By Emily SchultzDecember 17, 2018FacebookTwitterEmailFacebookTwitterEmailEvery December, the BA Test Kitchen churns out a handful of festive cookie recipes that go all out on the holiday vibes (glitter, kooky shapes, bizarro toppings). And every December, one cookie steals the stage as the most ogled, most baked confection of the year. For 2018, that winner—and by a landslide—is Chris Morocco’s zebra shortbread, a twist on the OG (literally), with layers of chocolate shortbread rolled right in. And if the black-and-white stripes weren’t enough, the cookies coated in green and red sanding sugar—just in case you forgot that Christmas is RIGHT AROUND THE CORNER!!! So yeah, we can tell you all about how everyone is making the zebra cookies, but wouldn’t you much rather see everyone’s two-toned creations? We thought so.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Instagram contentThis content can also be viewed on the site it originates from.Sooo, you're going to make them now right?Zebra-Striped Shortbread CookiesHere's a fancy-looking chocolate-vanilla swirl that novices can succeed at too.View RecipeExplore Bon AppétitCookieholiday2018Holiday CookiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-17", "author": ["Condé Nast", "Emily Schultz"]}