{"id": "e8b302e618b6c5682a5ad003a5df5648", "url": "https://www.bonappetit.com/recipe/asian-pear-salad-with-peanut-lime-dressing", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Asian Pear Salad With Peanut-Lime Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueAsian Pear Salad With Peanut-Lime DressingBy Peter SomOctober 19, 20214.3(12)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jenny Huang, Food styling by Susie Theodorou, prop styling by Martha BernabeEmailPinterestPrintEmailPinterestPrintThis salad from recipe developer and fashion designer Peter Som is all about bringing the crunch factor to the Thanksgiving table. Shaved into thin slices, raw cauliflower provides excellent texture and structure, while crisp Asian pears bring a sweet-tart flavor with lovely floral notes. A bright citrusy dressing clings to every nook and cranny thanks to creamy peanut butter for just-enough thickness. When Som was growing up, Asian pears were a treat usually found in Chinatown (and instantly recognizable by their little foam-mesh protective sweaters) but now are more widely available. If you can’t find them, Bosc pears are a good substitute.For the rest of Som’s Thanksgiving menu, see his recipes for Roasted Brussels Sprouts With Gochujang Brown Butter, Sweet Potato Tian, Dutch Oven No Mai Fan, Char Siu Wellington, and Milk Tea Bread Pudding With Crème Anglaise.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBenriner Mandoline Slicer$80 At AmazonMedium Skillet$60 At AmazonCitrus Juicer$7 At AmazonWhisk$10 At AmazonIngredients8 ServingsPeanuts1Tbsp. unsalted butter2Tbsp. fresh orange juice1tsp. five-spice powder½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt½tsp. sugar½cup unsalted dry-roasted peanutsDressing and Assembly½cup creamy peanut butter½cup grapeseed oil or vegetable oil⅓cup fresh lime juice (about 3 limes)2Tbsp. honey1Tbsp. plus 1 tsp. soy sauce1Tbsp. unseasoned rice vinegarKosher salt1large head of cauliflower (about 2½ lb.)1large Asian pear, thinly sliced2cups arugula1cup (packed) cilantro leaves with tender stemsPreparationPeanutsStep 1Melt butter with orange juice, five-spice powder, salt, and sugar in a medium skillet over medium heat. Add peanuts and cook, stirring, until peanuts darken and orange juice mixture reduces to a glaze, 5–7 minutes. Scrape peanuts onto a plate; let cool.Do Ahead: Peanuts can be prepared 3 days ahead. Let cool; store airtight at room temperature.Dressing and AssemblyStep 2Whisk peanut butter, oil, lime juice, honey, soy sauce, and vinegar in a large bowl until smooth. Season dressing with salt.Step 3Cut cauliflower into quarters through stem; trim core. Thinly slice on a mandoline or with a sharp knife; coarsely chop any stray florets. Add cauliflower, Asian pear, arugula, cilantro, and half of peanuts to dressing and toss to coat.Step 4Divide salad among plates or arrange on a platter and top with remaining peanuts.How would you rate Asian Pear Salad With Peanut-Lime Dressing?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleLove the dressing and made the dressing again.  \n\nI am not that crazy over candied peanuts.  I will try chopping peanuts and sprinkle them over salad.Lady arieOlympia, WA12/28/2021Crunchy indeed, but I needed to add a lot more acid and cilantro to brighten the salad up. Asian pears and raw cauliflower aren’t super flavorful in their own, and the peanut dressing was velvety, but I would have preferred something more punchy.  I tried making the peanut topping three times but am not sure it came out like it should have. The peanuts were soft but I was expecting crunchy. SpatulaCity123Los Angeles11/11/2021Explore Bon AppétitSaladAsian PearFruitPeanutNutVegetarianSideFallDinnerThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Peter Som"]}