{"id": "e8c38d9f2ac5844f6931fb11d04eac66", "url": "https://www.bonappetit.com/story/lamb-keema-tacos-meaty-saucy-perfection", "year": 2021.0, "month": 9.0, "day": 5.0, "content": "These Lamb Keema Tacos Are Meaty, Saucy Perfection | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Lamb Keema Tacos Are Meaty, Saucy PerfectionYou’ll definitely want leftovers.By Rachel GurjarSeptember 30, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by Rebecca JurkevichFacebookTwitterEmailThe first time I ate keema, I was a teenager travelling to Mumbai for a school basketball tournament. Our team didn't win but I didn’t mind—all I remember from that trip was the keema our coach took us out to eat for multiple meals.Keema means “minced” in Hindi, and while it usually refers to meat, there are vegetarian keema dishes available made with soy, paneer, and tofu all around the country. The mince is stewed or fried in aromatic spices, and is traditionally served solo or used to stuff samosas and naan.The keema from my basketball days was made with goat meat, which is one of the most common types of keema found around India. Served in a wide steel plate with the perfect ratio of minced meat and sauciness. My young mind didn't quite understand why it tasted so good, but I know now that it was flavored exquisitely, with each layer of spice playing a vital role. The warmth of cloves that makes you sweat ever so slightly, the subtle garam masala adding deep heady notes, the mint, cilantro, and lime adding a zing of freshness. This particular version was served with pav—a savory soft bun to soak it all up. I licked my plate clean, literally.In my lamb keema tacos, I use ground lamb for its robust and grassy profile, combined with cumin, coriander, cloves, ginger and good quality garam masala to make this a weeknight friendly meal that is full of flavor.The key to success here is cooking down the initial aromatics until they are fully browned and the masala starts to break, meaning that the fat starts to separate from the solids, which signals that the spices have toasted and the flavors have fully developed. You could serve it with rice, flatbread, or even toast, but tortillas are a fun vehicle for this saucy mixture.The leftovers are just as good if not better, and are really versatile. You can use any extra keema to top grain bowls, pizzas, or even sandwiches. A dollop of yogurt and chopped sweet onions will take the edge off if it’s your first time trying such a spice-forward dish, and don’t forget a squeeze of lime to cut through the fattiness of the meat and add just enough tang to each bite.While I can't replicate that exact plate from Mumbai, I wanted to make something that was pretty close and would satisfy my nostalgia before I have the chance to visit. There are many variations of this dish, some with peas, some with potatoes, and all kinds of meat and with good reason. It’s an iconic dish that is eaten and deeply loved by many.Lamb Keema TacosWith its keema-inspired ground-lamb filling and plenty of fixings, this recipe takes taco night in an exciting new direction.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-30", "author": ["Condé Nast", "Rachel Gurjar"]}