{"id": "e8fd704aadb58ef8ebdd26b3f08cdd3b", "url": "https://www.bonappetit.com/story/work-lunches", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "Breakfast Pastries, Work Lunches, and the Perfect Lasagna | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBreakfast Pastries, Work Lunches, and the Perfect LasagnaReflections on a Portland trip and more from Healthyish editor Amanda Shapiro.By Amanda ShapiroOctober 10, 2019FacebookTwitterEmailPhoto by Chelsie Craig, FOOD STYLING BY KAT BOYTSOVAFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,On the heels of a few days in Portland, OR and I’m still feeling the afterglow of old friends, new friends, good food, and, uh, jet lag. It was a very healthy and -ish weekend:  I ran along the Willamette every morning—and accidentally ran the Portland Marathon for a minute. I followed up every run with a latte and a pastry. (Favorite drink: Never Coffee's Midnight Oil. Favorite pastry: the maple Danish at Barista.)At Maurice, Aliza and I shared a nutty, vinegar-laced farro and cucumber salad...then meatballs and dumplings and a deliciously spoonable lemon pudding cake. Some friends, recently transplanted from New York, outdid themselves with Marcella Hazan’s utterly perfect lasagna, homemade pasta and all, which we paired with a bottle of R-18 I snagged from Ardor Wines.  I hiked up the hill to the rose garden on an unusually sunny afternoon.Amid all that, I met some amazing people at Roux, women doing all kinds of cool work in food, beverage, and wellness. You’ll see a lot of their faces and their products on the site in the coming months.Back on the East Coast, it's raining, and people are talking about lunch. The Bon Appétit Guide to Actually Enjoying Your Lunch at Work is the most fun: Read Hilary Cadigan’s plea to step away from the microwave and Emily Schultz’s defense of eating in front of your computer screen, ogle all the random snacks we stash in our desk drawers, and make Andy Baraghani’s marinated lentils with feta stat. I did ‘em last night (subbed cauliflower for broccolini) and can confirm that this is the most packable, room-temp-enjoyable, vegetarian-friendly, healthyish-approved lunch on the planet. How’s that for a hard sell?Meanwhile on Healthyish, Mandy Lee, the lady behind Lady and Pups and the author of The Art of Escapism Cooking, writes about the protests in Hong Kong and the privilege and guilt of being an escapist cook. Henry Dawson didn’t know how to show affection for his guy friends, so he learned to bake. And we talked to YA writer and poet Elizabeth Acevedo about fighting writer’s block in the kitchen, a much kinder way to describe procrastination cooking—a strategy I know all too well.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishessayHealthyish NewsletterPortlandRead MoreLifestyleI've Got an (Office) Crush...By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-10", "author": ["Condé Nast", "Amanda Shapiro"]}