{"id": "e8fd14dcc7814fcdfcf9781919729409", "url": "https://www.bonappetit.com/story/saraga-international-grocery-store-dreams", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Saraga Is the International Grocery Store of My Dreams | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsSaraga Is the International Grocery Store of My DreamsIn a former Toys “R” Us, you can buy Nepali dumplings, get your eyebrows threaded, and pick up merguez sausages.By Zahir JanmohamedJune 6, 2018FacebookTwitterEmailPhoto by Tom HoyingFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.It’s fitting that Saraga International Grocery, a massive supermarket on the outskirts of Columbus, Ohio, is located in a former Toys “R” Us. Each time I visit, I tell myself it’s only for the now-famous Nepali dumplings sold out of a tiny food stall tucked inside. But Saraga, like any great ethnic grocery or toy store, encourages long, joyous detours. Somehow I always end up shivering in the frozen food aisle, trying to figure out, say, which country makes the best merguez sausage. (Recently I’ve been going for a Moroccan brand called Soujouk with ingredients written in both French and Arabic, in case you’re wondering.)The outside of Saraga.\nPhoto by Tom HoyingA bit of history: The founders of Saraga are two press-shy Korean brothers from Seoul named John and Bong Sung who moved to Indiana in the 1980s and began selling vegetables out of their truck in 1992. They opened their first store in Bloomington in 1994 and named it Saraga, which means “living” in Korean, the idea being that good living is about food from where you’re from, an employee at Saraga told me. While living in Indiana, the Sung brothers realized that, in so many smaller Midwestern cities, immigrant communities often live clustered together but end up going to separate smaller grocery stores that cater to their needs. So they decided to shake up this model by creating one giant megastore tailored to immigrant shoppers of all stripes, with food stalls along the perimeter to draw in customers. The result, a 62,000-square-foot store in Indianapolis, opened its doors in 2005 and was an immediate hit.Rice noodles galore.\nPhoto by Tom HoyingSo they expanded. In 2012 they opened their Columbus, Ohio location, their third store in the country and the one I find myself at often. It’s located in a dilapidated strip mall flanked by a pawn shop on one side and a store selling captive-born reptiles on the other. Four years after it opened, Saraga welcomed a food stand that would put it, and Columbus, on the national culinary map: Momo Ghar. Helmed by Phuntso Lama, a 49-year-old Tibetan woman who was born and raised in Nepal, Momo Ghar—which translates as “dumpling house”—has been a sensation ever since it opened. (It was the top-rated restaurant on Yelp in the whole city for years, and was featured on TV shows like Diners, Drive-Ins, and Dives.) Lama estimates that she sells thousands of hand-made dumplings each day, from mouth watering jhol momo—a chicken-filled dumpling drenched in a spicy tomato sauce called “jhol” that is made with heaps of garlic, dried red chile, and soybean seeds—to Tibetan-style dumplings stuffed with pork and chives. They are transcendent, and every bit worth the hype.But, to me, the real appeal of Momo Ghar is its location. Its two tables lend an unobstructed view of the United Nations of shopping experiences that is Saraga. Anytime I am feeling down about the direction of our country—which is quite often these days—I go to Saraga to jolt myself back to an optimistic state.Momo Ghar sits inside the giant market.\nPhoto by Tom HoyingI was born in 1976 in Sacramento to Indian immigrants from Tanzania. Back then we had very few Indian grocery stores in California, and my mother looked to Chinese and Mexican stores to find the ingredients she needed. In the process, she developed a deep fondness for these communities that she passed onto me. Today there are so many Indian grocery stores in Sacramento that these cross-cultural collisions rarely happen. They still do at Saraga, though, and stores like it challenge our tendency to view our experiences in this country as singular and fully distinct from those of others. On a recent trip there to purchase the Indian flaky bread known as paratha, I realized that parathas can be also found in the Malaysian and Caribbean aisles at Saraga, a reminder that the foods I grew up eating are often celebrated and consumed far outside my own culture.Dumplings being filled with pork and chives.\nPhoto by Tom HoyingFor immigrants, grocery stores like Saraga are not so much shopping destinations as they are spaces to help new residents build community. Around 11 percent of the Columbus population is foreign-born, and the city has 20,000 Bhutanese-Nepali refugees, the largest population of its kind in the U.S. According to the Refugee Processing Center, Ohio resettled 2,085 refugees in 2017, the third most welcoming state behind Texas and California. Saraga fills a need by offering everything from a cellphone shop to a place to get your eyebrows threaded, all in languages that folks who have just arrived can understand. Confused why no one understands you at other stores when you ask for a monkey cap? At Saraga, beanies are still sold as “monkey caps,” as the hat is referred to in many parts of South Asia. And there is no shortage of cheeky humor; the granulated white sugar, for example, is sold in an aisle labeled “American food.”The jhol momo dumplings.\nPhoto by Tom HoyingAfter all, it can be a jarring thing: to pick up and start anew in a foreign country. Places like Saraga help soften the transition for new immigrants in Ohio, just as Chinese stores in Sacramento helped my parents ease their entry into California in the 1970s. Eventually there will be newer and more niche international grocery stores in Columbus, but Saraga’s appeal, at least for me, is that it feels like a stable, familiar home, belonging to everyone and no one at once.Each time I visit I end up spending much more time there than I anticipated—Saraga is designed this way, or so it seems. The checkout counter sits far back from the exit, with plenty of space near the entrance for customers to hang around, whether it be to purchase a Mexican pastry and to watch soccer or to post a message in any language on the massive bulletin board that advertises everything from Vietnamese church services to home-delivered Somali food. The space is so diverse and expansive that many immigrant communities think of Saraga as a place built by one of their own, for their very own. And while the former may not always be the case, the latter most definitely is.Zahir Janmohamed is the senior news editor of Hyphen and the co-host of the Racist Sandwich podcast.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Zahir Janmohamed"]}