{"id": "e906f0ed066c8695482546677f390cbc", "url": "https://www.bonappetit.com/story/foolproof-seafood-steep", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "The Secret to Foolproof Seafood? Steep It, Don’t Cook It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Secret to Foolproof Seafood? Steep It, Don’t Cook ItTender, juicy shrimp, squid, and fish, no splatter in sight.By Ned BaldwinJune 18, 2021FacebookTwitterEmailPhoto By Emma Fishman, Food Stying by Susie TheodorouFacebookTwitterEmailI’m a dad and a chef, which means I’m busy and, truthfully, a little absentminded. So whether I’m cooking at home for my family or at work in my restaurant kitchen, I gravitate toward simple techniques that are forgiving and hard to screw up. Steeping fish is at the top of that list.Many fish recipes call for hot and fast cooking, like pan-roasting or broiling, where the risk of smoke and splatter is high and the juicy and tender “doneness window” is brief. If it passes you by, you’re left with a dry, tough, fishy-tasting result and a smelly, messy kitchen. Steeping, on the other hand, is slow and gentle, meaning that it doesn’t require constant vigilance. The doneness window is wide, which gives you a high probability of serving your fish at its best, plus the technique is odorless and requires no additional fat.So what is steeping? Simply put, it’s the practice of pouring hot water over something or adding something to hot water—think tea leaves—and letting it sit until it’s ready to consume. That something might be squid, shrimp, or many of the finned fishes like cod, salmon, or sea bass. Timing-wise, squid cooks faster than shrimp, and cod takes a bit longer than both. When I cook squid or shrimp, I pour hot water over the seafood or add it to a pot of just-boiled liquid and leave the pot to rest off the stove until the ingredient is cooked (it takes just a few minutes), no additional heat needed. (Cod, depending on the thickness of the piece, may need a little more time on the lowest heat to cook all the way through. I lift the cod out of the water with a spatula and check to see if the flakes separate cleanly. When they do, the fish is ready to eat.)There’s no reason you can’t steep in plain water, but I like to season it up. If I’m cooking at the beach, I often walk right down to the water’s edge and collect some seawater in which to steep my catch. If I’m at home, I improvise “seawater” by salting the water and adding a piece of kombu. Seawater is fantastic for tender-fleshed fish like cod and salmon. For shrimp and squid, which have inherently stronger flavors, I prefer to use a more robust liquid. Often that’s a simple court-bouillon (a quickly cooked broth), which I make by adding a little vinegar, sugar, salt, and some aromatics like onion, garlic, and bay leaves to the water.Both at home and at work, I rely on a short list of reliable methods that I know will work every time. Steeping is high on the list because it yields a perfectly cooked ingredient that I can integrate into a more elaborate dish, like spicy shrimp salad with sambal and peanuts or cod with six-minute eggs, lemon, Dijon-caper sauce, and a soft herb salad. The hardest part—the fish cooking—is simple, which leaves me room to focus on the fanciful part: playing with flavor, texture, and color.The best part about steeping fish, however, is that it doesn’t matter whether you get distracted by a colleague, a child, or a shiny object—whatever you’ve got going will likely still work out all right.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-18", "author": ["Condé Nast", "Ned Baldwin"]}