{"id": "e90f2fbe3ce4fb28b74a2646fb54b645", "url": "https://www.bonappetit.com/recipe/best-banana-pudding", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "The Best (and Easiest) Homemade Banana Pudding Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesClassic Banana PuddingBy Jessie SheehanAugust 1, 20214.1(79)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Kat Boystova, prop styling by Allie WistEmailPinterestPrintEmailPinterestPrintWith homemade vanilla pudding, sweetened condensed milk (the secret ingredient no one talks about), and mascarpone, this truly is the best (and easiest) banana pudding recipe. Many recipes call for using instant pudding mix, but making it from scratch adds about five minutes and a creaminess and complexity you won’t get from the boxed stuff.You might think sweetened condensed milk would make for a cloyingly sweet banana pudding, but fear not! The pudding is barely sweetened and the mascarpone adds a subtle tang and slight acidity. I like the velvety richness mascarpone imparts, but if you are team cream cheese (another banana pudding secret ingredient), go for it. And skipping the mascarpone or cream cheese all together works too.Nilla Wafers are traditional—and fantastic—but there’s another world-famous(ish) recipe out there that calls for Pepperidge Farm Chessmen Butter Cookies, so substituting with those is an option if you’re looking to shake things up.Finally, be sure to plan ahead, as the vanilla pudding needs to be chilled for an hour before you assemble the whole shebang and the finished dish needs to chill for about 6 hours before serving. (Make-ahead-dessert lovers, this one’s for you!) Pro tip: If you’re making ahead for a group, consider doubling the recipe. Leftovers keep just fine in the refrigerator for up to three days. The bananas will brown a bit and the pudding may loosen, but the flavors and textures hardly suffer, and with a dessert this good, you won’t even notice. —Jessie SheehanAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronKitchenAid 5-Speed Ultra Power Hand Mixer$60 $40 At Amazon8x8\" Baking Dish$15.99 At AmazonMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketWhisk$10 At AmazonMedium Saucepan$39 At AmazonGet It Right Spatula$13 At BA MarketCutting Board$10 At IKEAChef's Knife$34.53 At AmazonSmall Bowl$13 At AmazonRolling Pin$13 At AmazonIngredients8–10 servings2Tbsp. sugar1Tbsp. cornstarch¼tsp. kosher salt1large egg¾cup whole milk1Tbsp. unsalted butter¾tsp. vanilla extract5large or 6 medium bananas (about 1¾ lb.), divided¾cup sweetened condensed milk½cup mascarpone or room-temperature cream cheese (optional)1½cups heavy cream111-oz. box Nilla WafersPreparationStep 1Whisk 2 Tbsp. sugar, 1 Tbsp. cornstarch, and ¼ tsp. kosher salt in a medium saucepan to combine, then whisk in 1 large egg and ¾ cup whole milk. Set pan over medium-high heat and bring mixture to a boil, whisking constantly, about 5 minutes. Reduce heat to medium and continue to cook, whisking, 1 minute more. Remove from heat and whisk in 1 Tbsp. unsalted butter and ¾ tsp. vanilla extract. Scrape pudding into a large bowl with a rubber spatula and chill while you prep the banana and condensed milk mixture (no need to cover).Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Peel 1 banana and chop into ½\" pieces. Whisk ¾ cup sweetened condensed milk and ½ cup mascarpone or room-temperature cream cheese (if using) in a small bowl until combined and smooth.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Fold banana and sweetened condensed milk mixture into warm pudding with rubber spatula (adding the banana to the warm pudding helps flavor it). Return pudding to the refrigerator and chill 1 hour (no need to cover). It’s okay if the pudding is still quite loose at this stage. (If you aren’t using the mascarpone, add the banana and sweetened condensed milk when you transfer the warm pudding from the saucepan to the large bowl.)Step 4Using an electric mixer, beat 1½ cups heavy cream in another small bowl until stiff-peaks form, about 4 minutes. (Err on the side of too stiff rather than too loose.) Whisk chilled pudding if lumpy and gently fold two thirds of whipped cream into pudding; set remaining whipped cream aside for serving.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Slice remaining 4 large or 5 medium bananas into ½\"-thick rounds. Set aside a large handful of cookies from one 11-oz. box Nilla Wafers and set the rest next to a 2-qt. or 8x8\" baking dish or pan.Step 6Evenly spread about one third of pudding across bottom of dish in an even layer. Top with a layer of cookies, spacing evenly apart and not covering the pudding completely. Top with half of the bananas. Repeat layers once more, using half of the remaining pudding. Then top with a final layer of pudding and reserved whipped cream. (You will not use the entire box of cookies—the extras are the chef’s treat!)Step 7Place reserved cookies in a resealable plastic bag, close, and finely crush with a rolling pin. (A mortar and pestle also works well.) Sprinkle crushed cookies over pudding. Cover with plastic wrap or a silicone lid and chill at least 6 hours before serving.Do ahead: Pudding can be assembled 3 days ahead. Keep chilled.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronHow would you rate Classic Banana Pudding?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleThis is a fantastic recipe and so easy with pantry items most already have at home. I was concerned that with no sweetening in the whipped heavy cream this would not be flavorful enough, however with the sweetened condensed milk and marscapone, and the flavoring from the bananas themselves, this was truly perfection. I replaced, with what I had on hand, almond butter cookies for the vanilla wafers- frankly any vanilla, butter cookie will do! Sara MeslerDallas, TX2/27/2022“ You might think sweetened condensed milk would make for a cloyingly sweet banana pudding, but fear not!”\n\nOn what planet is this not repulsively sweet? This recipe is revoltingly, cloyingly sweet. Like made me sick to my stomach after a quarter cup. I made it for guests who aren’t from the US and I’m embarrassed to serve it to them. I rarely eat added sugar, so if you’re the same, find another recipe — honestly one that’s just sweetened with bananas and maybe a couple of tablespoons of sugar would be plenty. \n\nAlso, I followed the instructions precisely and the pudding is quite runny. It doesn’t make a lot of sense that a tablespoon of starch and one egg would set that much liquid, but i suppose I’ll wait and see. I did stabilize my whipped cream so maybe the gelatin will help. \n\nAt least I have time to make something else that’s less gross before tomorrow…AnonymousLas Vegas12/31/2021This is great! Every time I make it o get rave reviews about it. Linda W: shut up, this is a classic to everyone else. Stop ruining a good thing. You can’t even make what you’re talking about. Linda w is a dummyAustin 11/28/2021This is not classic banana pudding.  Classic banana pudding's vanilla custard is made with flour not corn starch and the layers of pudding, sliced bananas and vanilla wafers are topped with meringue and then baked to brown the meringue.  I watched my granny make it for years and have never been able to make it as good as she did.\nLinda W.Virginia10/2/2021Bobby Flay Home Cookbook had this recipe years ago.  Total copyAnonymousNew York NY9/10/2021This is the richest, most decadent pudding I've ever had.  My husband loved it.  It was fantastic, but a little bit goes a very long way.  Next time I'll try to lighten it up a bit.  The write-up suggested that \"mascarpone adds a subtle tang and slight acidity.\"  I used mascarpone, but didn't taste any tang at all, just an almost cloying sweetness.  Perhaps the mascarpone I used wasn't the best.  Next time I'll try with cream cheese and maybe try cool whip (gasp!) instead of heavy cream.  (Don't judge me, I use it in another recipe and it makes things lighter.)AnonymousFlorida8/25/2021One of the better banana pudding recipes around. Made my own mascarpone and followed the directions for the pudding closely. Pudding came out fine. After two days in the fridge it did get a little runny but not obnoxiously so. Everyone who ate it raved about the taste and the pudding barely made it the second day. \nTo reduce  the water content in the milk, will use half and half on my second pudding instead of whole milk and an egg yoke instead of the whole egg. Believe this will reduce the runniness in the fridge. Although the mascarpone may be adding to the runniness as it will only stay good for 3-4 days in the fridge. TonyPeachtree City, GA8/20/2021This Banana Pudding is just awful!  I been making it old fashioned way for years, I will stick to my own recipe I have.   Its not a taste that country folks like myself will like.   The cheese ruins it too.  Who puts cheese in banana pudding????????  I was willing to see how it tasted tho but NO will never make this again, its the worst ever!MarlaTallahassee, Fl8/18/2021The pudding did not set for me either.   I made a second batch and no change, runny pudding despite triple checking quantities and cooking the milk and cornstrached a little longer.  I'm not sure if quantities are off or what.  I did use mascarpone both batches as well.  I would consider myself fairly skilled in the dessert department including custards and this just wasn't working for me.  Next time i'll do the Magnolia Bakery copycat instead.  The mixture tasted good, I would've put it in a ice cream machine if I had one. LTChicago8/16/2021This is the worst banana pudding recipe. I've made banana pudding for 50 years on and off so I wanted to try this new recipe. I carefully followed directions, but it was incredibly runny after 6 hrs in the frig. I recommend removing it from your recipe library.Sharon G XavierAustin, TX8/13/2021I have never made nor really eaten banana pudding as it's not something I would think of but it's my friends moms favorite and her birthday is coming and this recipe was in my inbox so I took it as a sign I better make it. Great recipe, very detailed and hand holding so the pudding came our perfect and received raved reviews. I am gluten free and used Schars shortbread cookies which replaced the nilla wafers nicely ( none of my taste testers are gluten free).  This is probably the least sweet banana pudding you will find but i still found it a bit sweet. So I topped mine with lightly toasted chopped walnuts for a  bit of saory crunch and added a touch of sour cream to the whipped cream to balance out the overall sweetness. This pudding is so addictive. I had to give it away to tasters so I wouldn't eat it all. JDeatsOakland, CA8/10/2021I followed the directions and ingredients precisely, including making sure the whipped cream was very stiff, but the pudding mixture was runny. The rest was fine, but the runny pudding is not good.Patricia HodgsonPerth Australia8/4/2021Absolutely love this recipe... Made it and oh my every little bit was gone... My family and friends have asked for the recipe... yummy yummy yummy 😋😋😋OnyaAdelaide South Australia8/3/2021I’m so excited! I have a banana pudding lover and her’s coming to dinner tonight! This will make his day (and mine). Can’t wait to make it. Vicki GeeLong Beach, California8/3/2021I  haven't made it many years as my husband doesn't like it and I don't eat sweets. But since I make sweet stuff for our Lodge bake sales, I'll be making this one for the next one. I plan to substitute Gingersnaps instead of vanilla wafers or other cookies as suggested. Because, well.... GINGER!!!DignaFlamingo Heights, CA8/3/2021Explore Bon AppétitPuddingDessertAmericanBananaFruitMascarponeCheeseEasyNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-01", "author": ["Condé Nast", "Jessie Sheehan"]}