{"id": "e919061b68ac6b155c0c4f940a1df928", "url": "https://www.bonappetit.com/story/home-workouts", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "The Home Workout Routines the Bon Appétit Staff Is Doing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow the Bon Appétit Staff Is Working Out at HomeWe’re hoarding endorphins and sweating out the stress. By Aliza Abarbanel and The Healthyish TeamMarch 25, 2020FacebookTwitterEmailIllustration by Igor BastidasFacebookTwitterEmailWhen nothing feels certain, we turn to exercise to find distraction, structure, and mood-boosting endorphins. Social distancing and self isolation may have put our usual gym routines and exercise classes on an indefinite hold, but we’re still breaking a sweat thanks to the rise of livestreams, apps, and classic analog methods. (Solo jogging will never go out of style.) Whether we’re tuning into virtual versions of our favorite classes or giving new apps a try, this is how Bon Appetit staffers are working out from home right now.I've sung the praises of Dance Church® on every platform and to every person in my life. While classes in New York, Seattle, Portland, Indianapolis, Salt Lake City, and Los Angeles are shuttered, instructors are livestreaming twice a week, bringing 50 minutes of pure, unbridled, physical joy to thousands of people around the world, including me. With very little choreography and an emphasis on ~feeling yourself~, Dance Church® is one of the few physical and mental escapes I've found in recent weeks, which makes it worth waaaay more than the $15 suggested donation.  –Amanda Shapiro, Healthyish editorInstagram contentThis content can also be viewed on the site it originates from.I've been working out EVERY DAY using the Aaptiv app, which is a collection of audio workouts. Today, I did yoga and a 23-minute run-walk interval workout (since I haven't jogged in years, I’m easing into it). Tomorrow I'll blast out like 45 minutes of strength training, hopefully somewhere outside where people can laugh at me frantically punching the air. I've pledged, to myself and Christina Chaey, that I'm coming out of this Q with a 6-pack. I'll settle for two, tbh.  –Alex Beggs, senior staff writerMy wife Ava and I have turned our living room into a \"stretching zone.\" We have two yoga mats set up, and every morning we post up for some casual but deep recovery. (I don't know about you, but our kitchen chairs are NOT built for working from home all day.) The pilates \"roll like a ball\" exercise has been great for my achy back and the 90/90 hip stretch helps release a lot of the tension I'm holding (and not just in my muscles and joints). We also do 50 squats together in the evening. It's a bizarre time to do it, but it's a nice way to squeeze out any pent up energy before climbing into bed. —Sasha Levine, bonappetit.com editorThis is the time of year when I usually start to plan longer bike rides all around the city and the Tri-State area. But longer rides aren't nearly as fun without friends, so I've been trying to come up with novel solutions that will motivate me to get on two wheels. I normally ride my bike to the office in Tribeca, so I'm thinking about trying out a morning \"commute\" to work where I bike across the Brooklyn Bridge, ride up lower Manhattan, cross the Williamsburg Bridge back into Brooklyn, then ride back home to my new \"office\" in Crown Heights. I'm desperately seeking ways to bring the normalcy of my regular routine back into my life, and this is one way to do that. –Christina Chaey, associate editorInstagram contentThis content can also be viewed on the site it originates from.As often as I can, I step away from Slack, push away my coffee table, and spend my lunch hour tuning into Sky Ting’s daily yoga livestream. Led by founders Krissy Jones and Chloe Kernaghan, along with a rotating cast of studio instructors, the hour-long class is a welcome respite from my usual afternoon routine of hunching over my laptop on the couch. I often find myself pushing off workouts when random tasks pop up throughout the day, so having a set hour helps me stick to my “routine.” And while this might say more about me than these workouts, I’m actually sore the next morning. –Aliza Abarbanel, Healthyish assistant editorRecently, I dug out the rebounder trampoline that was folded up in the back of the closet and put it on my patio. I've always preferred long walks to working out regularly, but since I'm trying really hard to limit my outside time due to crowded sidewalks, this is a great way to get in a little fun, joint-friendly cardio. It also helps give my 2 roommates and I a little space from one another...although I wouldn't recommend it to someone who lives above another apartment. –Christa Guerra, art directorI used to spend every Tuesday evening in an extremely muggy dance studio in the West Village with about 150 other people partaking in something called 5Rhythms. The best way I can describe it is dance meditation, except you sweat a LOT and at one point people might be crawling around on the floor howling. It's very legit. Anyway, since the lockdown I've been hosting 5Rhythms dance workshops in my teeny kitchen for my husband and cats. You dance the same series of rhythms each time—flowing, staccato, chaos, lyrical, stillness—starting off slow, building to extremely fast, then mellowing out again. It releases tension better than anything else I've tried. The last session ended with my cat biting me and scratching my wrist vertically but I think he too was enjoying it up until that point. Here's a playlist if you want to try it out; no choreography, just dance! –Hilary Cadigan,associate editorI downloaded an app called Shred, which is more approachable than it sounds. It does a great job at configuring a workout for you by taking consideration into how much time you have and what equipment you have. I have no equipment at the moment, so I’ve been doing some mobility work and with body weight exercises, along with running almost everyday. –Andy Baraghani, senior food editorInstagram contentThis content can also be viewed on the site it originates from.Now that my gym is closed and I'm at my parents' house, the Nike Training Club app has helped me keep up my routine. I first heard about it from senior food editor Molly Baz, who loves it because the workouts are tailored to the amount of time and equipment you have on hand, no matter where you are. Here's how it works: You choose a workout by time, equipment, or muscle group, press the start button, and the app guides you through the entire workout, with someone on the screen doing it along with you and cheering you on. The video is so helpful for me in terms of getting the right form; I'm terrible at written instructions. Even with no equipment, there are plenty of workouts to choose from. My friends all use the app now, and we'll trade tips on which workouts we liked the best (I like Lunges and Length, Upper Body Express, and Cut to the Core). The app has recently made all the premium workouts free, so I have more options than ever.  –Priya Krishna, contributing writerI’m dancing like no one is watching...because literally no one is watching. I often go to a dance class in Tribeca called MOVES and the teachers, Marisa Competello and Lauren Gerrie, are keeping the spirit alive with some live stream videos on their Instagram account. Dancing helps me feel revitalized and empowered—plus it makes me move the funny muscles I forget to engage while leading a life of lounging! –Miriam Ross, associate art directorI've been streaming a different workout each morning—yoga at Y7, pilates with Kelly Berry, circuit training at Punch Pedal House. Now is a great time to discover new fitness routines. I've even added salsa dancing to my list. I don't think I would have ever signed up for an in-studio class, but with the extra time at home, I'm excited to give it a try with cheesy instructional Youtube videos like this one. –Michelle Heimerman, senior visuals editorMy husband turned me onto the Fitness Blender workout videos — we are resolutely not gym people. The programs are all pretty affordable, about $15 each, and much more goal-oriented than if you just wanted to bop around the free offerings—you can sync the videos to your calendar, so you know exactly which days are arm days, which are legs, etc. I recently got into the low impact program, mainly because our third floor New York apartment is too much of a sardine can for the very active high-intensity interval training modules, which require a lot of jumping around. (Of course, I'd be lying if I didn't mention that the chance to avoid burpees topped my must-haves list.) –Joseph Hernandez, research directorExplore Bon AppétitHealthyishSelf CareCoronavirusRead MoreCoronavirus17 Ways to Feel Good at Home Right NowBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-25", "author": ["Condé Nast", "Aliza Abarbanel", "The Healthyish Team"]}