{"id": "e91ee3931c069e6afc7aa553b9e4dad2", "url": "https://www.bonappetit.com/story/pani-puri", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Pani Puri is the Ultimate Choose-Your-Own-Adventure Meal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPani Puri is the Ultimate Choose-Your-Own-Adventure MealEndlessly customizable, always delicious.By Arsh RaziuddinFebruary 11, 2022FacebookTwitterEmailCourtesy of Getty ImagesFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we’ll talk you through the dishes and drinks we make with our eyes closed. Today, pani puri.Pani puri, gol gappa, gupchup, pani ke patake—whatever you choose to call this beloved South Asian snack, every bite is perfection incarnate. Crisp puffs filled with an assortment of savory, tangy, sweet, crispy toppings and a spicy “water,” pani puri is a crowd-pleaser.While pani puri, which is in the category of South Asian food known as chaat, is most commonly enjoyed as a tea-time snack, in my household it’s eaten for breakfast. Growing up, I would wake up to a spread of fixings and toppings prepared by my mom and dad, meant for us to linger, eat, and chat around.With pani puri, each person is in total control of the flavor. It’s especially easy to whip up for a crowd because you can rely on a lot of pre-made shortcuts to complement the homemade elements, which means it looks impressive with very little effort on your part.Here’s how to pull it all together for your very own pani puri snack (or breakfast, or lunch, or dinner.)First, stock your pantry.So much of a great pani puri experience depends on a successful run to your favorite South Asian grocery store where you’ll find all of the condiments, spice mixes, and snacks for the ultimate spread. I’m usually able to grab most if not all of these from my favorite market in NYC, Kalyustan’s. You’ll need:A package of puri shells, which are (big) bite-size fried cracker-ish puffs made from semolina and rice flour. They’re often sold in egg carton-esque plastic containers or by the bag.Sev, those crispy-crunchy bits made from fried chickpea flour and often sold in large bags in the snack aisle.An assortment of your favorite chutneys such as tamarind chutney, cilantro chutney, and/or mint chutney—I’d recommend at least two: one that’s a little sweet and one that’s herby and spicy.A box of pani puri spice mix such as Shan Pani Puri Masala (this is essential) for making that spicy “pani,” or water, that gives pani puri its name.Get your chole (chickpeas) ready.This will make up the bulk of the filling for your puri shells. Every household has its own favorite recipe—and there a lot of regional variations across South Asia—but I grew up with a mixture of cooked chickpeas and boiled potatoes (peeled and cut into small cubes), mixed in a bowl with a light sprinkling of red chile powder, toasted ground cumin, ground coriander, and salt to taste.Prep your fresh toppings.While standard toppings for pani puri include plain whole-milk yogurt (sometimes whisked with a water to thin it to pourable, saucy consistency), finely chopped tomatoes, finely chopped red onion, and fresh cilantro, this is where you can get creative. Consider pomegranate arils and finely chopped green (unripe) mango for sour-sweet tang, sprouted mung beans for texture, or finely chopped fresh Thai chile if you’re with a crowd that can handle the heat.Assemble!Prepare your pani according to the package instructions (which is usually as easy as whisking a few spoonfuls of the powder into water) and set the chickpea mixture, all of your toppings, and the chutneys out in small bowls and plates so that everyone around the table has easy access. Each puri is assembled one at a time and designed to be eaten in one (very large) bite. Place a puri on your plate, and poke a thumb-size hole at the top, either with your finger or the back of a spoon. Gently stuff the chole-potato mix into the puri, add the toppings of your choice, and pour enough pani mix into the shell to fill it up to the brim. Eat, enjoy, and repeat the whole process until you run out of puri—or you can’t eat anymore.Explore Bon AppétitIndianIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-11", "author": ["Condé Nast", "Arsh Raziuddin"]}