{"id": "e91fb6fb1a80f1a351e0d30456c089e9", "url": "https://www.bonappetit.com/story/juiced-lemon-puree", "year": 2020.0, "month": 12.0, "day": 2.0, "content": "What To Do With Juiced Lemons - Turn Juiced Lemons into a Sweet or Savory Lemony Purée | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTurn Juiced Lemons Into a Purée of Pure Lemony GoodnessDon't throw those empty shells away!By Ozoz SokohDecember 10, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailIn the first weeks and months of the lockdown, my desire to preserve became even stronger than usual. I’d buy lemons by the dozen and my daughter, J, would juice them for her vinaigrettes. Every time she finished, I’d say, “Leave the shells—don’t throw them away.” She’d pile them into a bag and put it in the crisper drawer.But it wasn’t until I decided to make a whole clementine yogurt cake that I knew what to do with them. To make the cake, I boiled clementines, then puréed them to form the base flavor. In that instant I understood the lemon shells’ destiny.I refrigerate or freeze the juiced halves (I know they can be frozen because my friend Norma stores her halves in the freezer and microplanes what she needs for salad dressings and the like) until I have “enough.” Sometimes that’s six shells, other times a dozen or two. Then I turn them into a purée that delivers pure lemony goodness for both sweet and savory dishes without punch-in-the-face bitterness. (I can’t say the same about the versions that I’ve tried with limes.) Oranges work well, as expected, though the flavor is different from fresh. But lemons? They shine.You'll need to juice those lemons first, of course.\nPhoto by Laura MurrayThis purée is a breeze to make: I like to start off with organic, unwaxed lemons because all of that skin is incorporated into the final paste. In a large pot, I add the lemon halves, typically a dozen, from six lemons, and fill with water to cover. I like to cook them cut-side up, so that the halves fill with water and stay submerged. Then to make doubly sure, I make a cartouche from parchment (that’s a fancy way of saying that the parchment is round with a hole cut in the center so that steam can escape—think of it like a weird-shaped donut). The cartouche works as a “lid” so the lemon shells stay constantly under water. I set my pot on medium to low heat to cook for 30 minutes, or until the lemons are completely soft. Once cool enough to handle, I scoop out and discard the inside membrane, leaving a soft clean shell.For my sweet purée, I combine the cooked lemon shells with sugar (1 to 1½ cups of sugar for 12 halves) and vanilla extract in a blender or processor and whiz into a smooth, creamy purée. I’ve incorporated it into batters from pancakes to skillet cakes (I increase my flour by ½ cup to account for the additional moisture), swirled it into yogurt, and stirred into lemon curd, where its texture and depth of flavor make for a more ‘marmalade-y’ take.My savory lemon purée is also a breeze: cooked lemon shells, green chiles (jalapeños are my favorite), garlic, salt, neutral oil, chile flakes, and fresh herbs (like mint and cilantro) are blended till combined. I store this in the topmost level of my fridge where it stays perfect for weeks. I love it as the base of salad dressings and marinades, stirred into soups and broths (chicken and mushroom are some of my favorites), incorporated into bread dough, spread on pizza dough, or stirred into compound butter and slathered on thick toast, pasta salad, lemony rice, and more.Whatever way you choose, you’ll have a multitude of options to celebrate the whole lemon. Save the seeds for pectin and no part will have been wasted.Ozoz Sokoh, The Kitchen Butterfly, is a Nigerian-born exploration geologist turned food-obsessive who uses foodways to explore personal narratives of history and heritage, culture, identity, and belonging. These days, you’ll find her in her kitchen in Mississauga, Canada, thinking up ways to make the most of produce scraps.Explore Bon AppétitBasically on a BudgetLemonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-10", "author": ["Condé Nast", "Ozoz Sokoh"]}