{"id": "e92c359666ace89212a46fe6d7e33e06", "url": "https://www.bonappetit.com/city-guides/montreal/venue/drogheria-fine", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Drogheria Fine  Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealDrogheria FineRun, don’t walk to this Mile End window shop doling out perfectly tender gnocchiFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for Drogheria Fine's street gnocchi. Trust us—it’s a thing.ORDER THE: only thing on the menu: pillowy gnocchi out of a Chinese take-out container. You can get it tossed in a classic tangy-sweet tomato sauce (our go-to, with a shake of red pepper flakes) or a spicier version—and with a hefty pile of grated Pecorino Romano for an extra dollar. If you love that sauce as much as we do, you can buy a jar at the stand too.THE VIBE IS: inconspicuous. Sandwiched between two popular spots (Fairmount Bagel and ice cream shop Kem CoBa), the tiny window is easy to walk past. Make the most of that prime location and grab a seat at the rainbow-colored bench outside, double-fisting gnocchi and durian ice cream. Don’t worry: The fragrant smell of red sauce overpowers the stinky fruit.PRACTICAL STUFF: Open every day 8 a.m. to 9 p.m. or until sold out.—Alyse WhitneyPhoto by Dominique LafondWE ALSO LOVEDieu du CielChoose your own microbrew adventure in Mile EndSt-Viateur Bagel ShopSettle the great bagel debate by getting a dozen at the famed Mile End mini chainLarrysA natural wine bar that also serves the best breakfast in Mile EndExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Alyse Whitney"]}