{"id": "e9300f54a661569619a82021ffb7e762", "url": "https://www.bonappetit.com/story/oil-your-measuring-cups", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "How to Measure Sticky Ingredients By Oiling Your Measuring Cups | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Measure Sticky Ingredients Without Losing Your Gosh Darn MindI spent 30 years measuring sticky ingredients like a fool.By Ella QuittnerMarch 14, 2022FacebookTwitterEmailPhotograph by Isa Zapata. Food Styling by Kat Boytsova.FacebookTwitterEmailThere used to be exactly one thing I didn’t like about baking. I called it the Peanut Butter Problem and it happened every time I made my favorite three-ingredient cookies. The Peanut Butter Problem was, as you may have guessed, my best attempt to get a precise amount of peanut butter from a measuring cup into a mixing bowl, and it involved multiple butter knives, my pointer finger, and swearing. I’m told I looked like a very drunk person trying to pick a lock while blindfolded.And then came TikTok.I’m not proud that it took me 30 years and eleven months to learn a very basic kitchen skill through aimless scrolling. But I have to live with my truth: It wasn’t until I saw the solution demonstrated by user @stoveandgarden that I realized I could, once and for all, put the Peanut Butter Problem to bed.The trick? Simply oil your measuring spoons and cups before measuring sticky ingredients.TikTok contentThis content can also be viewed on the site it originates from.There are two ways to do it: The first is to dip a finger in oil (hereby referred to as your “oily fingie”) and swoop it around the inside of a measuring spoon or cup, using your oily fingie pad to grease the bottom like you’re coloring it in. (Or, if you have an oil spritzer, just give the inside of the cup a good 360° spray-down.) Be sure to use a flavorless oil, like sunflower or grapeseed if oil isn’t included in the recipe otherwise.The second method applies to recipes that already call for oil. In these cases you can simply measure in a strategic order for automatic cup-greasing. If you’re making an Olive Oil Cake with maple buttercream to top it, for example, use your measuring cup to dole out the oil first when you’re prepping cake batter. Then, use the same cup—unwashed—to measure the maple syrup for the frosting. If you’re making Dan Dan Noodles, measure the vegetable oil before the sesame paste. If you’re making a vinaigrette, measure the olive oil before the honey. (It should be noted that while this method doesn’t strictly involve an oily fingie, legally, no one can stop you from saying “oily fingie” as much as you like, even if you’re alone.)Whichever way I do it, I’ve found that the benefits of oiling my cups are plentiful. I don’t need to dirty extra silverware for the dreaded side-scrape. I no longer need to wait for every last drop of agave to drip from a measuring cup before getting on with my day because it simply falls out with ease. And I end up with a much more accurate amount of the sticky ingredients in recipes. Best of all, I can finally retire the moniker “Peanut Butter Problem” for something more uplifting, like a puppy, or an autobiography.Explore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-14", "author": ["Condé Nast", "Ella Quittner"]}