{"id": "e949a43a86ec452475e960b0d7a0ec47", "url": "https://www.bonappetit.com/recipe/khai-jiao", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Khai Jiao Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueKhai JiaoSeptember 22, 20204.6(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintForgot you had friends coming over in 30 minutes? This is the dish that will save you, from chef Parnass Savang of Atlanta’s Talat Market. The Thai omelet will start to puff as soon as it hits the hot oil, turning impossibly light with crispy golden brown edges.Ingredients2 Servings1red or green Thai chile, thinly sliced1tsp. distilled white vinegar1tsp. granulated sugar3Tbsp. fish sauce, divided4large eggs4scallions, thinly slicedFreshly ground white pepper¼cup vegetable oilCooked jasmine rice and Sriracha (preferably Shark Brand; for serving)PreparationStep 1Mix chile, vinegar, sugar, 2 Tbsp. fish sauce, and 1 Tbsp. water in a small bowl until sugar is dissolved. Set sauce aside.Step 2Whisk eggs and remaining 1 Tbsp. fish sauce in a small bowl until smooth and frothy. Stir in half of the scallions; season with white pepper. Heat oil in a medium cast-iron or nonstick skillet over medium-high. You want the oil really hot, almost smoking; be careful! Pour egg mixture evenly across skillet. Let cook, undisturbed, until golden brown underneath, about 30 seconds. Carefully turn over with tongs, gently lowering it away from you. Cook until golden brown on other side, about 1 minute. Transfer to paper towels to drain.Step 3Serve khai jiao over rice, topped with remaining scallions, with Sriracha and reserved sauce alongside.How would you rate Khai Jiao?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleSo delicious and easy. I have made this a few times now because everyone in my house loves it. Manzie Los Angeles3/7/2022It wasn’t clear what to do with the sauce?  Set it aside and do what with it? Dip? Not impressed.AnonymousBoston2/18/2022Awesome, just like my mom used to make. And the fish-sauce sauce (“prik nam pla”) — so simple yet so elusive. This version is It. Now I know why mine never tasted right—just tossing chopped chilies into fish sauce ain’t it! Jen NYC, NY8/16/2021Came home from a long day of birding and remembered seeing this recipe on Instagram. Had all the ingredients and easily put everything together for a satisfying dinner. I love the dressing and use it now on salads, rice, veggies, etc.AngieAIndiana4/11/2021I LOVED this dish.  It hits all the right spots: salty, mildly sweet, spicy!  Light and easy.  Yummy.  Great cold too IMHO.  Will be making this often.  I used what I had on hand - red pepper flakes instead of thai peppers and rice vinegar instead of distilled white.  AnonymousLos Angeles10/5/2020My chinese mom has been making this for years (minus vinegar), very standard asian style omelette, great comfort food, quick, cheap, and good way to add protein to your diet.Anonymous9/26/2020Explore Bon AppétitThaiSoutheast AsianAsianEggEasyQuickWeeknight MealsMainNut-FreeDairy-FreeGluten-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}