{"id": "e94fd435ec6762c41dbff88449ba48b5", "url": "https://www.bonappetit.com/recipe/sweet-and-savory-miso-party-mix", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "Miso Party Mix Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalty-Sweet Party MixBy Sohla El-WayllyDecember 5, 20194.0(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintWhether you prefer the buttery richness of classic party mix or you’re on the sugarcoated puppy chow team, this recipe has you covered. Sweet from honey, savory from miso and nutritional yeast, and a touch spicy from chili powder—it’s the perfect crowd-pleasing snack. When choosing crackers, nuts, and cereal for the mix, be sure to keep texture in mind. Look for ingredients with lots of nooks and crannies, which will give the seasoning plenty of places to cling to. The rough texture of pecans, walnuts, broken rice cakes, sesame sticks, and Chex cereal were some of our favorites.IngredientsMakes about 2 quarts4cups assorted crackers, broken into bite-size pieces if large (such as sesame sticks, rice cakes, and/or rice crackers)2cups assorted crispy cereal (such as Rice Chex and/or Multi-Bran Chex)2cups assorted raw nuts (such as pecans and/or walnuts)½cup ghee or unsalted butter2garlic cloves, finely grated½cup honey¼cup white miso2Tbsp. raw sesame seeds½cup nutritional yeast1Tbsp. Diamond Crystal or 1½ tsp. Morton kosher salt2tsp. Kashmiri chili powder, gochugaru, or mild crushed red pepper flakes, such as Aleppo-styleSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Place a rack in center of oven; preheat to 300°. Toss crackers, cereal, and nuts in a large bowl to combine.Step 2Melt ghee in a small saucepan over medium heat. Whisk in garlic, honey, and miso and cook, whisking occasionally, until just beginning to bubble around the edges, about 1 minute. Pour dressing over cereal mixture and toss with a flexible rubber spatula to coat. Sprinkle sesame seeds over and toss again to combine.Step 3Transfer party mix to a large parchment-lined rimmed baking sheet and bake, tossing twice, until toasty and golden in color, 40–45 minutes. (The mix will feel soft out of the oven but will get crispier as it cools.)Step 4Meanwhile, grind nutritional yeast, salt, and chili powder in spice mill or with mortar and pestle to a fine powder.Step 5While still hot, transfer party mix to a large bowl. While tossing, sprinkle spice mix over and continue to toss until evenly coated. (If you try to season the mix on the baking sheet, you’ll lose most of the spices to the sticky bottom.) Remove liner from baking sheet. Return party mix to unlined baking sheet and let cool completely.Step 6Do Ahead: Party mix can be made 1 month ahead. Store in an airtight container at room temperature.How would you rate Salty-Sweet Party Mix?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleThis recipe really caught my eye and I was dying to make it.  Plus I love Sohala!  She always gets it right …..so today I got all the ingredients together, read the recipe and then read the comments.  I was surprised how many negative comments there were so I read them all and realized it was the cooking time that I decided to look at.  I put it I the oven for 10 minutes, stirred, another 10 minutes and stirred again.  This time the mix looked like it was browning nicely.  I turned the temp. Down to 250 and I timed 5 minutes, stirred, 5 more minutes, but looked at them after 3 and they looked great so I took them out and finished them off.   They are fantastic!  So my thought on this is just watch it very carefully.  Do not walk away and think they will be done in 40-45 minutes.  They will burn!  The honey does that.  Please try it again…..it is so good!\nSheilaLondon, UK10/6/2021Just not good. Batch was toasted well, used good ingredients. It's just awful. Bon Appetit is my *only* trusted recipe source, up until today have only had success. But this went straight to the trash, and I never ever throw away food. AaronOregon7/22/2021The negative reviews and/or comments where individuals have had difficulty with this are seriously confusing! I’ve made this mix multiple times with no issues, and it’s something I’ll continue to make for a LONG time. In fact, I’m eating my New Year’s batch of mix right now. (This doesn’t last long in our house.)\n\nLiving in Tokyo, it’s not possible to find things like Chex, so I’ve always used a mix of crunchy snack items that are easy to find at your average convenience store or grocery store here — small Ritz-type crackers (about the size of a ¥500 coin), Kaki no Tane, black sesame senbei and plain senbei, agemochi, Tongari Corn (basically the same as Bugles in the US) and a latticed potato snack cakes Ami Jaga. If you can find agemochi, it is a FANTASTIC addition to this mix! I usually skip the nuts because they’re pricey here, and Kaki no Tane has peanuts. I almost always double the recipe. \n\nAs with any recipe, timing is a huge variable — so keep an eye on your mix instead of accepting the 40 min bake time as gospel. I only have a tiny countertop convection oven, so I cook the mix in smaller batches. At 145 degrees Celsius, it takes roughly 20-25 mins per small batch, mixed once during the bake. If it looks medium/golden brown, take it out! If it gets dark brown, you’ve overcooked it!\n\nI’ve also experimented using Szechuan numbing spice in the nutritional yeast mixture. It tastes great. AnonymousTokyo1/3/2021Burned beyond recognition after 20 minutes (of the 40-45 minutes recommended baking time). My oven is calibrated correctly, and I set it to 275 (instead of 300) based on the comments about burning. Wasted a lot of ingredients for a singed mess.AnonymousDenver, CO12/24/2020CAUTION: Highly addictive! I baked it for about 35 minutes. Used rye crakcers, multigrain crackers, sesame sticks, honey roasted peanuts and some pecans.. YUM! Now to let it cool before inhaling..AnonymousChicago, IL4/27/2020Sorry for everyone who ends up burning this mix, I'd check your oven temperature with a proper thermometer and not depend on the oven itself. I *slightly* burned my first batch of this but I was cooking in a friends oven that was far more jank than mine. \n\nWhatever the case, once you get this mix working, it is divine. The nutritional yeast/pepper mix also works amazing as a popcorn sprinkle. AnonymousChicago, IL3/28/2020I want to give this one another change and try it again since it really burned and I only had it in for the minimum time suggested in the recipe. The flavors were tasty but it really burned quickly. AnonymousLawn Guyland, NY1/8/2020Typically wouldn’t right a review but this was insanely delicious and perfect.  I used Simple Mills Farmhouse Cheddar crackers as one of my crunchy items, rice Chex, gf pretzels and a simple sea salt plain round cracker so nothing crazy..  I will make it again, probably exactly the same!  Used cashews, pecans and walnuts .  Ran it by several family members and they loved it.  Thank you! Anonymous12/23/2019I never leave reviews but this was a total recipe fail. Even though I baked it for the minimum amount of time it was completely burnt. I couldn’t have reduced the baking time either or it would have been a soupy mess. I’m so disappointed because it sounded delicious. AnonymousOntario12/22/2019Second time making this recipe. It *is* addictive. I've only used nutritional yeast a few times and was a little weary about using it here but I tried it with a halved snack mix recipe, wasn't sure I liked it, came back 5 min later, still wasn't sure, then finally I came around. The mix without it is decent on its own but nutritional yeast takes it to another level. Also, I used Shenbei snowy rice crackers and wheat chex, both highly recommend for good, balance of different types of crunch, flavor as well as great vehicles for the wet and dry ingredients.AnonymousSan Jose, CA12/21/2019This stuff is addictive! Highly recommend including cheez-its in the mix, as well as rye crackers. I've done it using white miso and brown rice miso, both good options. AnonymousSeattle12/20/2019Sounded like it would be good but it was actually dreadful. Even the smell was unbearable. Into the dumpster. AnonymousVancouver12/20/2019Do not use Whole Foods 365 brand black sesame crackers! The recipe was delicious but something about the baking process made these rice crackers take on an acrid, chemically taste (even though there aren't any weird ingredients). The rest of the mix is delicious! \n\nMake sure you toss the mix with the nutritional yeast mixture immediately after removing from the oven. I waited a few minutes, and the amount it cooled in that time made it less sticky for the powder dusting. Also don't skimp on the milling process for the nutritional yeast. It doesn't coat well if it's not fine enough.Anonymoustoronto, ON12/17/2019I made this for a holiday get together and it was well received. I uses all the crackers, etc.  that the recipe recommended. I loved the rice cakes. They seemed to really absorb the butter mixture nicely. I only baked mine for about 23 minutes because my oven is STUPID but, boy oh boy was it odoriferous! Delicious.nataliematz88Omaha, Ne12/14/2019kind of can't believe that I have become the type of person that makes party mix but here we are! this was delicious, my husband loved it too. next time ill take it out of the oven 10 minutes sooner, I think mine runs hot--  some pieces got a little too brown but that's no fault of the recipe. AnonymousOklahoma via New York 12/10/2019Explore Bon AppétitAmericanMisoCondiments, Sauces & PastesNutritional YeastOther IngredientsPecanNutWalnutEasySnackVegetarianHealthyishChristmasSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-05", "author": ["Condé Nast", "Sohla El-Waylly"]}