{"id": "e9513d91969341783bbb5b2a8dd8a3fb", "url": "https://www.bonappetit.com/story/usb-lighter", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "This Rechargeable Lighter Helped Me Actually Ditch Butane  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Ditched Butane for This Eco-Friendly Rechargeable LighterMeet the new and improved light of my life.By Taylor FeezorNovember 26, 2021FacebookTwitterEmailPhotography by Isa Zapata.  Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now. A rechargeable lighter, in this case.After a road trip gone right last summer, I’ve spent most of the year far from my Silicon Valley home, reveling in the wilds of Montana. Big Sky Country is transformationally beautiful. Its sweeping fields, cathedral-like mountain ranges, and babbling cricks are clean, clear, and threatened only by an influx of out-of-staters moving here, like me. Fueled by natural awe (and an admitted tinge of tourist guilt), I’ve been eager to live here as sustainably as possible. When I learned that 350 million disposable butane lighters—like the ones I was using to ignite my fireplace on frosty mornings—are thrown away in the United States every year, I was keen to do something about it. Enter scene: this ultra-sustainable and tech-savvy USB Rechargeable Lighter from the USB Lighter Company.Photography by Isa Zapata.  Prop Styling by Paige HicksUSB Rechargeable Lighter$32 at Food52$30 at The GrommetThe svelte lighter arrived in zero-waste packaging that’s been approved by the nonprofit Forest Stewardship Council (“Forests for All Forever,” baby). It’s now become a Why hadn’t I thought of this? home addition. I use it to fire the char-grill to crackle up home-raised rib eyes and to light my Boy Smells Cowboy Kush candle for journaling and meditation sessions. And unlike the case with matches, I can execute the Operation-like precision tasks required to light a dead pilot light or tea candles without ending up with torched fingertips, sooty smoke streaks, or a visit from the fire department.The sustainable part is right in its name—the USB Rechargeable Lighter plugs into a computer or any other electrical outlet. It’s also butane-free and gas appliance-safe. It holds a whopping 300 uses per charge, leveraging tesla coil technology (a sweet reminder of the motherland), and mine has been going strong since its last charge three months ago. Plus, it comes in cherry reds, sunny yellows, metallics, and gem tones. I’ll need my rose-gold one to spark joy as the winter cold hits.And it’s so, so easy to use. Although I do not have a firm grasp on the physics of combustion, I can tell you that the lighter’s two prongs conduct a neon arc of electricity that bursts into fire. After lighting what I need to (ideally, this camping-friendly Snow Peak GigaPower Torch for home-made wagyu nigiri), I can glide the prongs safely back into the lighter’s neck for storage, which automatically disables the ignition button. Smart.Using this sustainable lighter is a very small ritual, but it feels like an appropriate way to thank the breathtaking state of Montana—the place that has ignited so elegantly my love for the great outdoors. See what I did there?Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-26", "author": ["Condé Nast", "Taylor Feezor"]}