{"id": "e952f84e61acb87d27c2218e795264ef", "url": "https://www.bonappetit.com/story/jennifer-jolorte-doro", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "Nouri Mama Is Making Postpartum Nutrition More Delicious and Diverse | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Chef Is Making Postpartum Nutrition More Delicious and DiverseJennifer Jolorte Doro is all about kimchi, chamomile tea, and honoring motherhood.By Megan ZhangMay 5, 2021FacebookTwitterEmailPhotography by Diana VidalFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Jennifer Jolorte Doro, clinical nutritionist, postpartum chef, and cofounder and culinary director at Nouri Mama, a meal delivery company geared toward each stage of motherhood.When Jennifer Jolorte Doro was expecting her son, she invoked the wisdom of Asian postpartum food traditions to guide her pregnancy diet and recuperation. Now, as a clinical nutritionist and postpartum private chef, she's helping other expectant mothers do the same through Nouri Mama—a company she cofounded to support expectant families in New York and New Jersey with meals specifically designed to nourish both mom and baby.In many Asian cultures it is common practice to look after mothers, before and after birth by preparing certain foods to support their physical and mental well-being, as well as the baby's development and long-term eating habits. Doro grew up in the States, but experienced the practice in her Filipino extended family. She soon realized that many new mothers in America lack access to nutritional guidance, community support, and culturally inclusive resources.With Nouri Mama, Doro hopes to play a part in changing that, by preparing nourishing meals—such as miso minestrone soup, ginger shiitake bone broth, and adzuki quinoa oatmeal—based in what Nouri Mama describes as Eastern food therapy. Meals are made using seasonal, science-backed ingredients to fulfill the unique needs of pregnant and postpartum mothers. Nouri Mama creates a new menu of prepared every week, and clients can select meals in advance and request customizations to accommodate dietary needs. The meals get delivered to clients’ homes and only require a quick reheat before enjoying.Here Doro chats about life as a working mom, the impact food can have on a pregnancy journey, and the Eastern traditions that helped her own postpartum recuperation.Postpartum care is a huge part… of Asian culture. It’s about honoring the mother, honoring the process, making sure that they're eating the right things and that they're taken care of. It's very common sense stuff, but it's ingrained. Food has always been a huge part of my culture and my upbringing; I was constantly surrounded by my aunts in the kitchen, preparing our meals or cooking for parties. We had our go-to recipes if someone was sick or someone had a baby—there was something for every stage of life.When I was postpartum, I ate… a lot of Menudo. My Filipino version is made with pork and has a lot of peppers and onions and potatoes. When I was growing up, it was something that always made me feel warm and cared for. When I was pregnant I made it in a big batch, so I knew that if I was busy feeding or sleeping after giving birth, we could just reheat it really easily.I chose not to shower for a week or two after birth… because being in warm water and then stepping out can cause a chill. Not showering helped me stay warm and feel comforted after having the baby, which is so important, according to traditional Chinese medicine. Once you have a baby, your hormones are obviously fluctuating, but you do feel a sense of emptiness and coldness, which is why it’s crucial to keep the warmth in. I also drank a lot of ginger tea for the ingredient’s warming effects. Chamomile and lavender tea not only kept me warm but also helped with anxiety in those early hours when you’re just up and awake all the time. I also ate a lot of hot breakfasts when I was postpartum; millet was really helpful in the mornings to keep me warm, and I would add turmeric to help with any inflammation.Our menus feature many traditionally Eastern ingredients… that are well known for their high nutrient content. In Asia, many of these foods are commonly prepared for pregnant or postpartum women in order to boost their health. Jackfruit, for example, is rich in Vitamin C, which can really benefit tissue repair after having a baby. Digestive enzymes in shiitake mushrooms support gut health and the immune system. And goji berries help fight inflammation. We utilize a lot of traditional ingredients from different Asian cuisines; you might see a Japanese breakfast dish like inari sushi, a Korean soup like tofu kimchi jjigae, and a Filipino dinner like kare kare all in the same week.What you eat during pregnancy can affect your baby's palate… and their ability to enjoy a different variety of foods. When I was pregnant, I ate a ton of different probiotic foods, like kimchi and yogurt. I think it benefited my overall gut health, but it also influenced the way my son eats now. He's very much an adventurous eater. Eating diverse foods during pregnancy can help ensure the baby will be excited to try different and new things and prevents getting into that picky-eater stage.Our culture’s definition of wellness is so narrow… and that’s something I’m focused on broadening through food. There’s no such thing as good foods or bad foods. I think that there's so much attention paid to the idea that you can only eat certain things to be healthy. I want to really listen to people, and incorporate cultural practices and food traditions into their nutrition plans, and take into consideration health equity to meet people where they are. If you can't afford all organic food, for example, it's not the be all or end all.Maternity leave isn't something that's top of mind in America… and three or four months just isn’t enough. That's very much the time when the baby is developing a personality, laughing, smiling, cooing, and being interactive with you. We can do our best to help with nutrition, but new parents and families need more support from their employers. There should definitely be more compassion and understanding of what it’s like to be a new parent. I think a lot of that can start with the workplace, with the HR department providing access to resources—social workers, counselors, doula groups, and midwifery practices—that help build a community of support.A lot of parenting is about being more gracious with yourself… and being able to ride the ebbs and flows. Right now I have a toddler and am trying to run multiple businesses. It's not easy. We don't have a nanny, we don't have a babysitter. Luckily, we do have family that are close by, so we are able to navigate between meetings and childcare. But being a mother has given me so much new perspective, consideration, and understanding.Explore Bon AppétitPerson of InterestSelf CareHealthyishInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-05", "author": ["Condé Nast", "Megan Zhang"]}