{"id": "e9689e6feda6428e14b93c3a5417d0cc", "url": "https://www.bonappetit.com/story/what-is-turmeric", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "What Is Turmeric, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Turmeric, Anyway?It's orange. It's everywhere. But what's the deal with turmeric, and what are you supposed to do with it?By Amiel StanekJanuary 31, 2018FacebookTwitterEmailTed CavanaughFacebookTwitterEmailIf you happen to follow Healthyish, our sister brand, theres a good chance you've seen the word \"turmeric\" thrown around more than a few times, probably attached to some sort of sunny, fluorescent-orange beverage or another. But what is turmeric, WTF is the fuss all about, and how are you supposed to cook with it? Let's break it down.Turmeric, like it's cousin ginger, is a rhizome—which is, more or less, a root. It's native to Southeast Asia and the Indian subcontinent, and is most often found in the cuisines of those regions, but it can grow anywhere warm with plenty of rainfall. Flavor-wise, it is overwhelmingly earthy and bitter, almost musky, with a bit of peppery spice. That deep, kind of implacable flavor in most curry powders? Yep: That's turmeric.And while the flavor turmeric offers is huge, its color is just as remarkable. A spoonful or two is enough to tinge an entire soup, pot of rice, or spice rub a vibrant shade of yellow-orange. In fact, it's often added to things like prepared mustard as a natural food dye. (Yeah, that's what makes French's Classic Yellow Mustard so...yellow.) Which is also to say: This stuff stains like crazy. Turmeric will leave just about all Tupperware with a lingering golden glow, and will do the same to your fingers if you're getting handsy with it. Are you standing in the kitchen right now, wearing a white shirt and getting ready to make some curry? A costume change may be in order.Turmeric-Ginger Chicken SoupChicken noodle soup never gets old. If you don’t have udon for this recipe, use rice noodles or regular old spaghetti. View RecipeTurmeric is most commonly sold in a dried and powdered form, usually in the section of the grocery store with the rest of the spices. Dried and powdered, its easy to mix into marinades or spice rubs, or sizzled with aromatics like onions and garlic as the base of a soup or stew. Because it's so bitter, it usually wants to be balanced out by other big flavors and textures—think sharp, spicy curries enriched with plenty of ghee, butter, coconut oil, coconut milk, or other fat.You can also sometimes find fresh turmeric, which looks a lot like mini knobs of ginger. (That photo up top is of pieces of fresh turmeric that have been split in half to expose their fiery orange interiors.) Fresh turmeric is still quite bitter, but has a brighter...fresher flavor than its dried counterpart, and is almost a little bit citrusy. You can treat it almost the same way you would treat fresh ginger: Peel it, then slice, mince, or grate it to your hearts content. Fresh turmeric is less potent than the dried stuff, so if you're using fresh in a recipe that calls for dried, you'll have to use about four times as much. (And, yeah, it will turn your hands the craziest color; latex gloves FTW.)Gluten-Free Coconut Turmeric PieThis recipe is inspired by the flavors found in the traditional Ayurvedic Indian drink haldi doodh, made with milk, turmeric, and honey. It's also gluten- and dairy-free.View RecipeSo, yeah, that's what turmeric is. But why does it feel like it's everywhere all of a sudden, from lattes to tonics to baked goods? Well, in addition to being used as a flavoring and coloring, it's also prized in Chinese and Ayurvedic medicine for its anti-inflammatory properties, among other things. Which is all kind of out of the Basically purview, tbh. So we'll leave it at that.Make these yogurt-marinated lamb chops and see what all the fuss is about:Spiced Marinated Lamb Chops with Garlicky YogurtThese quick-cooking lamb chops make dinner feel instantly fancy.View RecipeExplore Bon AppétitBasicallySpiceTurmericRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-31", "author": ["Condé Nast", "Amiel Stanek"]}