{"id": "e96fc44594224c387878ee689235aba9", "url": "https://www.bonappetit.com/story/buy-wine-online", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Where to Buy Great Wine Online | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureWhere to Buy Great Wine Online A list of producers and shops that will ship responsibly made wines to your door. By Alex DelanyMarch 19, 2020FacebookTwitterEmailFacebookTwitterEmailAs food and drinks businesses across the country shut their doors amid coronavirus fears, the wine industry is just one group that’s feeling financial pressure right now. But it’s also one that you can support from your couch. A large number of domestic wine producers and wine shops sell and ship bottles of responsibly made wines, so you can stock up on skin contact Riesling and Pinot Noir pét nat for the foreseeable future. Here’s a list of our favorite American winemakers and bottle shops that sell and ship their wine online:California Wine Producers:Ambythe Estate - Paso Robles, CAAmplify Wines - Santa Barbara, CABroc Cellars - Berkeley, CAClos Saron - Oregon House, CADirty & Rowdy Wines - Napa, CADonkey & Goat - Berkeley, CaJ Brix Wines - Escondido, CAKeep Wines - Napa, CALo-Fi Wines - Los Alamos, CAMadson Wines - Santa Cruz, CAMaître de Chai - Oakville, CAMartha Stoumen Wines - Sebastopol, CAMatthiasson Wines - Napa, CaMethod Sauvage - Etna, CAPax Mahle Wine - Sebastopol, CAPowicana Farm - Redwood Valley, CARaj Parr Wine - Santa Rita Hills, CARuth Lewandowski - Healdsburg, CAThe Scholium Project - Fairfield, CAStirm Wine Co. - Aromas, CASubject to Change Wines - Forestville, CAVinca Minor - Berkeley, CAOregon Wine Producers:Bow & Arrow Wines - Portland, ORBrooks Wine - Amity, ORCooper Mountain Vineyards - Willamette Valley, ORFranchere Wine Company - Willamette Valley, ORHiyu Wine Farm - Hood River, ORJohan Vineyards - Rickreall, ORTroon Vineyards - Applegate Valley, ORNew York Wine Producers:Channing Daughters Winery - Bridgehampton, NYHeart and Hands Wine Co. - Union Springs, NYLiten Buffel - Middleport, NYRavines Wine Cellar - Geneva, NYRed Tail Ridge Winery - Penn Yan, NYWine Producers Elsewhere:Iapetus Wine - Shelburne, VTLa Garagista - Bethel, VTOld Westminster Winery - Westminster, MDOyster River Winegrowers - Warren, MESouthold Farm + Cellar - Fredricksburg, TXWilliam Chris Vineyards - Hye, TXPhoto by Ted CAVANAUGHOnline Wine RetailersIf you’re looking for a variety or price point that can’t be found in the list of American producers above, support a shop that sells responsibly made wines from wineries around the world. Here are some of our favorite, but keep in mind that alcohol shipping laws vary from state to state. Make sure they ship to your state of residence.Astor WinesChambers Street WinesDomaine LADomestiqueHelen’sHenry’s Wine and SpiritKingston Wine Co.Leon and SonMysa Natural WineOlivino WinesOrange GlouPerman Wine SelectionsPrimal WineThirst MerchantsUva WinesAnd if you need a reason to buy some rosé:Just So You Know, Rosé Season Is Actually Right NowThere’s no place for Chianti in my winter blues.View StoryExplore Bon AppétitCoronavirusShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-19", "author": ["Condé Nast", "Alex Delany"]}