{"id": "e97f4d7b48bdfb1698e9067cfe8a7eed", "url": "https://www.bonappetit.com/recipe/simple-marinated-chicken-thighs", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Simple Marinated Chicken Thighs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueSimple Marinated Chicken ThighsBy Chris MoroccoJuly 9, 20195.0(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis Vietnamese-inspired marinade, packed with fish sauce, brown sugar, and chiles, hits all the notes, and because it’s more paste than liquid, it clings to meat or seafood for major impact in a short amount of time.Ingredients4 servingsVegetable oil (for grill)2lemongrass stalks, trimmed, tough outer layers removed1serrano chile3garlic cloves11\" piece ginger, peeled1Tbsp. dark brown sugar1Tbsp. extra-virgin olive oil1Tbsp. fish sauce1Tbsp. soy sauce1¼lb. skinless, boneless chicken thighsKosher salt2scallions, thinly sliced½cup cilantro leaves with tender stemsSesame seeds and lime wedges (for serving)PreparationStep 1Prepare a grill for high indirect heat (for a gas grill, leave one or two burners off; for a charcoal grill, bank coals on one side); oil grate. Using a Microplane, finely grate lemongrass, chile (seeds and all!), garlic, and ginger into a medium bowl. (Alternatively, you can chop very finely, then mash to a paste using the side of your knife.) Add brown sugar, oil, fish sauce, and soy sauce and mix well.Step 2Season chicken with salt and add to bowl. Turn as needed to coat completely. Let sit at least 10 minutes and up to 2 hours. (If marinating longer, wait to fire up the grill.)Step 3Grill chicken over hottest part of grill, moving to cooler zone as needed if browning too fast, until well browned, about 5 minutes per side. Transfer to a cutting board and let rest 10 minutes before slicing.Step 4Transfer chicken to a platter and top with scallions and cilantro and sprinkle with sesame seeds. Serve with lime wedges for squeezing over.How would you rate Simple Marinated Chicken Thighs?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleYummy! Spicy!JaniceOmaha, NE 9/28/2021Absolutely delicious and will be added to permanent repertoire.  I didn't have lemongrass or serrano so just added extra garlic and some red chili flakes.   Already thinking of how to make this maybe as a cold salad with rice noodles, cukes, chopped peanuts, snow peas....endless possibilities.   Also could be good as a sandwich maybe with homemade raita?   We'll see.....yogamomGreat Falls, VA6/29/2021The marinade is excellent and can be adjusted for spicing - judiciously - upward.  The instructions for grilling or baking, however, are vague. One has to guess how hot the grill or oven should be and whether the thighs should be seared and then finished at a lower temperature.  \nAlso - attention to weights and measures - I write from Toronto Canada, where we use metric and Celsius.  Please do not fixate on American provinicialisms of ounces, pounds and Fahrenheit!Michael LanphierToronto ON, CA6/18/2021I am obsessed. Granted, I modified this a bit. Didn’t have lemongrass or serrano, so I subbed sambal and upped the garlic a bit. I also seared the thighs in a cast iron and finished them in the oven. I added the rendered fat to a pan with the leftover marinade and added some additional soy sauce and some water. Let that come to a boil and reduced to a glaze. I ate these with sushi rice and a loooot of scallions. Amazing. Madison ReidSouth Bend, Indiana2/11/2021So good!  These were easy to make and delicious.  I marinated the chicken for a little over an hour, grilled it until crispy around the edges and served it with cilantro lime rice and sugar snap peas tossed in sesame oil and sesame seeds.  This will become a staple in our household!  Thank you!KaySan Francisco, CA1/7/2021Delicious! Simple to throw together and full of flavor. The marinade doesn't seem like enough, but it really sticks and coats the chicken in a way that infuses a lot of flavor even when it's on the grill.  Will definitely add this to my list of regular summer recipes. AnonymousChicago6/29/2020Delicious!! Really authentic flavours and taste can't wait to make this againAustralia6/24/2020This marinade is nek level amazing! I made with a Bill Granger inspired rice noodle salad, but my god this is a regular staple in my house and I cannot wait to smell it off the bbq all summer long. An amazing find and great recipe! I love Chris!AnonymousLondon6/17/2020Amazing flavor!  It starts out a little sweet and leaves a little burn.  I marinated it for 1 1/2 hrs and grilled.  My 16 yr old wants to take the leftovers to school tomorrow.  Big hit for our family and will definitely make again!  Julie BrownAustin, Texas11/20/2019I wasn't able to get my grill to work and this recipe was STILL incredible.  This marinade was so amazing that I took the excess and boiled it with soy sauce, honey, and white wine to make a sauce.  I served it with some cilantro-lime rice and my mother called it the best thing I've made to date.AnonymousRaleigh, NC9/13/2019This recipe was a winner. Super quick to throw together, had a good kick of spice, and it was very flavourful.  AnonymousOntario, Canada7/18/2019Explore Bon AppétitVietnameseSoutheast AsianAsianChicken ThighChickenPoultryLemongrassHerbs & SpicesQuickEasyWeeknight MealsMainDairy-FreeKetoGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Chris Morocco"]}