{"id": "e98f943287b38384748e523a8a1e045f", "url": "https://www.bonappetit.com/story/dont-waste-a-thing", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "How To Cook With What You Have | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow To Cook With What You Have“Don’t Waste a Thing” is my new quarantine mantra.By Carla Lalli MusicApril 2, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Carla Lalli MusicFacebookTwitterEmailEvery Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I have always enjoyed using things up in the kitchen and get a very wholesome thrill from finishing a jar of dried spices or eating all the grapes before they wither on the vine. After all, every ingredient represents money I spent, and trashing it is doubly insulting—a waste of food uneaten and dollars squandered. This urge to consume every ounce of food in my kitchen is at a high point right now, as I ration trips to the store but still need to turn out three meals a day for my family of four.At the beginning of all of this (it’s only been three weeks, but it feels like an eternity ago), I still allowed myself trips to the neighborhood store to get this or that, indulging in cravings for foods I was in the mood to cook, and an excuse to get out of the house. But now I’m looking for ways to stay put. Over the past week, I found ways to get as much as I could out of things I had already stocked up on at home and hope that some of my strategies can apply to your inventory, too.What makes a four-cheese mac even better? Breadcrumbs.\nAlex LauYesterday’s Bread (and the Day Before That…)Stale bread! A couple of weeks back I advocated for buying good sturdy crusty loaves and keeping them on deck in the freezer, but there’s always those last couple of slices from the heel that are too tough for a sandwich. Instead of letting them languish on the counter before tossing them in the compost, there’s a couple things you can do. Sprinkle dried out slices with a bit of water before toasting them, or saturate bigger hunks before reheating in the oven, which will bring them back to life. Or, make well-done crunchy toast, then sink those in the bottom of a bowl of soup, as though they were oversized crouton submarines. If the bread hasn’t gone rock-solid, tear into pieces and pulse it in your food processor, then keep your fresh breadcrumbs in the freezer for topping a pan of mac and cheese or breading a chicken cutlet.Want this letter before it hits the website? Sign up for our newsletter!Love the Vegetable You HaveI’ve been making pasta e fagioli pretty much every Sunday, and it keeps morphing based on what I can scrounge up. Preparing it over and over has been a reminder about being flexible, making smart substitutions, and accepting altered outcomes. The soffritto always has carrot, onion, and garlic, but I’ve added fennel tops, limp celery stalks, and Swiss chard stems to it as well. Do that with your favorite soup and no one will be the wiser. My original recipe calls for cannellini beans but it turns out it works with lentils, baby limas, and even chickpeas (if you are one of the lucky garbanzo owners, hats off!). I like simmering my fagioli with lots and lots of kale leaves, and I’d certainly settle for escarole or Napa cabbage, but when what I had were slightly bruised green beans, I cut them into short lengths and chucked them in the pot. I wasn’t passionate about the green bean version and wondered if I’d actually made minestrone by accident. On the other hand, I really liked that we finished up the green beans, because looking at them in the fridge was stressing me out (and we ate the soup regardless).Throw it all in!\nPeden + MunkSave It For StockLet no scrap go unused. There may be things you are discarding that you can pay forward: mushroom stems, sad parsley, wrinkled cherry tomatoes, sprouting garlic cloves, ham hock bones that have already been picked clean, Parmesan rinds, bendy carrots, salami nubs, shrimp shells, the last few fennel seeds in the jar (don’t save anything that’s not safe to eat, of course). Combine all of these types of things in an airtight container and pop it in the freezer for making stock, which you can then use to cook your grains or beans, make soup, braise meats, or cook a risotto.Accept SubstitutionsYou know what’s really hard to get right now? A whole chicken. Depends on where you are, of course, but for the life of me I can’t get a whole chicken. Know what I got instead? A whole duck. It was a compromise, an imperfect poultry-for-poultry swap, but I ended up with a piece of protein I could still work with, and an unexpected upside. Instead of roasting it whole—not a great method for duck because there’s so much fat, and the breast and the legs don’t cook at the same rate—I cut it into pieces so I could pan-roast the breasts and slow-cook the legs. Then I took all the fat off the carcass and rendered it, so I now have about 3 cups of duck fat (which I’ll use to confit the legs—or roast potatoes or sauté my next batch of greens!). Then I turned the carcass into stock (using some of my vegetable scraps, of course). In the end, that one duck yielded two dinners and stock for several more meals—so far I’ve used the stock in two soups and still have about 1½ quarts on deck in the freezer. The whole chicken, by comparison, would have given me one dinner and bones for stock. Sometimes, being forced to compromise can be a reminder about resourcefulness, and might force you to experiment.Speaking of being resourceful, thank you to everyone who participated in our fundraising effort for No Kid Hungry last week on Cameo. Thanks to all of the requests we got, the test kitchen was able to exceed our $25,000 goal in a matter of hours, and I am very grateful for the outpouring of generosity and support.Explore Bon AppétitCarla NewsletterRead MorecookingThere's No Better Time to… Follow a Recipe Without Making ShortcutsBy Hilary CadigancultureWatching Celebrities Cook Is the Only Thing Calming Me Down Right NowBy Marian BullcookingWe're Glad to Keep You CompanyBy Adam RapoportLifestyleSecret Single Cooking: The Meals We Make When No One Is AroundBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-02", "author": ["Condé Nast", "Carla Lalli Music"]}