{"id": "e991b3679411cc9366d65fc671b07cbe", "url": "https://www.bonappetit.com/story/holiday-party-tips", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "The Formula for a Memorable Holiday Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Formula for a Memorable Holiday PartyAdam Rapoport shares his go-to party-hosting rules and recipes for the holiday season.By Adam RapoportDecember 11, 2018FacebookTwitterEmailFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Your holiday party checklistShould we dim the lights a smidge more? And what about ice—do we have enough ice? No, of course not, we can never have too much ice. And wait, who chose this playlist?When it comes to throwing a party, my wife, Simone, and I can be a bit…particular. Especially during the holidays, when expectations climb and everyone’s calendar jams up with competing engagements.Want this letter before it hits the website? Sign up for our newsletter!But there is nothing I enjoy more than a good holiday party: the glistening ham (yes, there must be a ham), the punch bowl (the primary cause of your next-morning hangover), the twinkling tree (says the nice Jewish boy), and Nat King Cole or Frank Sinatra on the speakers (you really can’t go wrong with either).It all starts with the guest list. Which, invariably, leads to the discussion between Simone and me of how big of a get-together we want to host. I’ve always been of the school to invite everyone we know because half of them won’t be able to make it, and it’s always better to have too many guests than too few. This, Simone likes to point out, has led to our essentially throwing college-level keggers, wherein by night’s end we realize we might have had fun, but we never found a single moment to hold a proper conversation with a friend.So, what is the formula for a memorable holiday party? Well, to start, how about a slightly smaller affair? More soiree than rager. And yes, ham. Bone-in, scored, and glazed. One of the easiest and most impressive things you will ever make. Set it on a grand cutting board with a basket of those squishy square-cut dinner rolls, some Dijon and mayo, and a crock of cornichons. Your friends will talk about this spread until December 2019.Punch. Looks nice, particularly with a big molded block of ice bobbing in the middle of the bowl. But you know what? I could do without it. It goes quick, it’s too sweet, and if you have a kid waking you up at 6:45 the next morning, you’ll be glad you didn’t indulge.Bobbi LinDimmers. Votives. Christmas lights. You know the drill. Good lighting is everything. Remember how your mom always told you to dress up for special occasions? Well, she was right. Put a look together—your party deserves it.Finally, don’t forget to have fun. It sounds obvious, but throwing a party is a lot of work. Inevitably, an hour before your guests arrive, you or your partner will be nearing full meltdown mode. One of you will have to run to the store for the 46th time that day. That outfit you thought was going to work is totally not going to work. And at the exact same second, you will both realize you have yet to jump in the shower.But if all does go as planned, there will be that moment at the end of the night when the votives are flickering and you and your close friends are splayed out on the sofa and the living room floor. Someone will be trying to carve the last bit of meat from the ham bone. Someone else will open a totally unnecessary final bottle of wine. And you will realize why you threw this party in the first place.Get the recipes:Pineapple-Glazed HamSpicy-Tamarind-and-Honey-Glazed Spiral HamSpiced Rum Punch with Citrus and LuxardoEarl Grey–Bourbon PunchYou know what would make a pretty great holiday gift? Our magazine! And a cool tote bag, plus some great baking tools for holiday cookies. More details here.Explore Bon Appétitholiday2018Adam NewsletterRead MorecultureThis Gift Box Will Transform You Into the Holiday Hero Your Friends DeserveBy Jesse SparkscultureAll Our 2018 Holiday Gift GuidesGallery15 SlidesBy Bon Appétitrecipes30 Christmas & Holiday Roast Recipes You NeedGallery30 SlidesBy Bon Appétitrecipes79 Festive Christmas Cocktails to Get You Through the Holidays Gallery79 SlidesBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-11", "author": ["Condé Nast", "Adam Rapoport"]}