{"id": "e993e9b89a03aed05686d7cf9dbe2631", "url": "https://www.bonappetit.com/story/tommy-bahama-marlin-bar", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "I Went Looking for Paradise—And Ended up at Tommy Bahama’s Marlin Bar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Went Looking for Paradise—and Ended Up at Tommy Bahama’s Marlin BarThere, I found something even better.By Elizabeth HallFebruary 2, 2022FacebookTwitterEmailIllustration by María MedemFacebookTwitterEmailH. wasn’t the first girlfriend I asked to take me to dinner at Tommy Bahama, but she was the first who said yes. From the street the restaurant looked like any storefront in downtown Palm Springs. Skinny fan palms framed a wide, curved patio. Droopy pink flowers baked in concrete pots. When H. asked where I wanted to sit, I pointed to the Marlin Bar. The high metal stool scraped the floor when I pushed it back. I plopped down with a satisfied sigh. The man next to me in a hibiscus shirt said, “Easy sitting, easy living.” I looked at H. and she looked at me, and we smiled at him. “I like easy,” I said. At least I thought I did.Above the crack of cocktail shakers, Bing Crosby sang, “Where the palm trees sway.” I asked H., “Where?” She said, “Right here.” I looked around: the palm trees outside were, in fact, swaying. The flower in my piña colada shuddered every time the overhead vent blasted. I took a sip. The rum made the hairs on my arms stand up. I looked out past the palms to the packed patio where a banner read, “Paradise Is Open for Takeout.” I understood the patio’s pull. With 160 stores and 14 restaurants across the globe, Tommy owes his popularity to more than breathable fabrics and tender shrimp. Tommy promises easy pleasure and the thrill of escape without travel. Here paradise is a sand-colored screen where you can project whatever idea you have of the good life and see it reflected back at you. As Tommy knows, the richest of all pleasures are often the ones that exist, one-sided, in our minds.On the stool I slurped down my drink, shoving the straw deep in the ice, searching for one last pocket of boozy cream. The room, with its smell of coconut, flooded me with memories of W. When we met she worked at a Tommy Bahama in the mall. A former Burner, she used her employee discount to swap her feathers and flares for a new look: hibiscus blouses and polarized shades. Whenever I saw a silk floral shirt I thought of her. Tommy’s Marlin Bar was full of silk shirts.When H. asked if I wanted tacos or a bowl, I snapped out of my reverie. We had been dating long-distance for over a year, when, in the early months of the pandemic, I moved into her tiny home in Morongo, keeping my apartment in L.A. while we experimented with cohabitation. H. split her time between the desert and the city, remotely producing live streams of music performances for pop stars and dirt biking in her free time. On the weekends we often drove the 20 miles to Palm Springs for dates. I pushed the menu away. “Tacos,” I said. Though I knew it didn’t matter what I ate. My interest in Tommy Bahama was metaphysical. More than a place, Tommy Bahama was a portal to my own imagined paradise.Buzzed from the rum, we wandered into the attached store behind the bar, weaving between racks of linen dresses and jute toes in earth tones. H. held a polo shirt to her chest and turned toward me. “Very cute,” I said. She smiled. “This old thing?” She leaned over to kiss me. After over a year together, her touch still gave me goosebumps. I strolled past more products: The Easy Breezer Long Sleeve Shirt. The Easy In Easy Out Chair. The Easy Zip Cardigan, which came only in black or white, eliminating the burden of choosing a color.I slipped on a pair of polarized wraps, the same shades W. always wore. I grinned at myself in the mirror. Then I glanced at the white ticket dangling from the bridge: $329. I put them back on the rack and walked out into the blazing desert sun. I couldn’t afford them, but I still wanted them. I was bad at leaving things behind.Like most of my friends from Georgia, I lost touch with W. when I moved to Southern California for grad school. Although I had dreamed and raved about the move for months, I soon found myself researching how to drop out. I wanted to tell W., who I thought might encourage me to move back, but she kept asking about beaches and dispensaries instead.In the months before I left, W. and I grew close as friends. I admired her insouciance. Her days spent folding shirts in coconut-scented air and teaching the occasional English composition class looked idyllic. At the time I worked as a nanny and spent most nights reading and scheming up ways to leave. When W. asked why I wanted to move to L.A., I said, “The beach.” I said this to anyone who would listen. Still, I envied W.’s rootedness. She was satisfied with her life. I was trying to flee mine.We wrote to each other often during those first weeks in L.A. For her I constructed a fantasy of my new life: tall boys sipped in the shade of a Mexican fan palm. “Nothing but sun.” “Love waking up with sand in my hair.” I hadn’t yet set foot on a single beach, couldn’t even afford the gas to drive there. “Send me pictures of your lair,” she said. Instead, I sent a closeup of the jacaranda tree outside my bedroom window. The purple flowers pushed against the mesh screen, obscuring the sky above and the clogged street below. Exactly as I preferred.As September burned into October, we rarely texted. Whenever W.’s name flashed in my notifications, I set my phone on the bed screen-side down. I wanted her memory of me to be fixed: palm trees and saltwater. How could I show her my bare studio, empty of furniture, save a bed and a bookshelf? I didn’t trust myself to answer W.’s casual “how are you” text authentically. I refused to admit to her, much less anyone else, that my new life was no better than the one I left. The fantasy was easier to maintain than confronting the reality of my unhappiness.W. also liked to perform. Her stage: my porch. Back then she’d come over after work. A six-pack of beer in her purse. On the railing citronella candles sweated in tin pots. She camped out on the top step, next to the big yellow ashtray I’d made in Ceramics 101. She tapped her joint against its chipped lip to punctuate her stories. I watched the ash fall in neat sleeves. W. said, “My date last night wore red cowboy boots to the bar.” W. tapped her joint. “I asked her to go home.” Tap. “She fried me eggs in the morning.” Tap, tap, tap. Her stories spotlighted her seductions. I listened with keen interest, wanting to know every detail about her dates, mainly if they were funnier or smarter than me.I was nursing a crush on her but didn’t know it yet. If she obsessed over one girl for too long, my jealousy flared, and I would ask her a question about her past.We time-traveled together as she talked. She told stories with enough details to make me feel like I was beside her, experiencing it all. We drank beer with her brother in a truck before W.’s prom. We ate soggy sandwiches with her father in deep woods. In these stories he was invariably aiming a bow at a turkey or a deer. “So big you could mount it,” she said, tapping the joint then relighting it. I never asked to see pictures of the taxidermied mammals in her living room. Back then it didn’t matter to me if the tales she told were true. If we both believed her story, we were bonded.The last text I ever sent W. was from the parking lot of a Tommy Bahama in Newport Beach. It had been over a year since we last spoke and a few months since H. and I started dating. When I saw the restaurant on the map, I asked H. if she wanted seafood. “Sure,” she said. We were in the area to explore a hidden sea cave in Laguna. From the highway the restaurant was impossible to spot. Nestled on the edge of a massive shopping center, it looked identical to the beige buildings that flanked it.H. circled the lot. Out the window I spied the signature gold logo. I opened the camera on my phone and zoomed in. The picture was grainy, but I sent it to W. anyway. “Wanna get wild?” I asked her, then waited for her name to light up the screen. When I looked up, the car was in park. My phone buzzed. “Adjuncting is hell. Maybe I should go back to the Bahama,” she said. I typed, “Tell me about it,” then deleted it. I typed, “Where are you teaching this year,” then deleted it.“Where’s the spot?” H. asked. I hesitated, then squinted in the distance, pretending I couldn’t see the gold cursive lettering. “Isn’t there somewhere better we can go,” I imagined H. asking me, as every other lover had done. They all had good reasons for avoiding Tommy Bahama. The food was overpriced and likely bland. I didn’t know how to explain that I didn’t want better. I wanted familiar.Our memories don’t care about aesthetics. Our memories choose the important details for us. In this way, nostalgia can be bewildering. The objects and experiences that inspire the feeling are often unpredictable. Somewhere along the way my longing for W. and the life I left behind in Georgia became synonymous with Tommy Bahama.I didn’t ask H. to go to Tommy Bahama that day; I didn’t want to blur the line. Instead, I pointed to the grocery store across the parking lot. “Picnic?” I asked. Later, at a beach in Laguna, we unwrapped cheese and avocado sandwiches in the shade of a bluff. We drank Sauvignon Blanc from tiny paper cups. As the sun sunk behind a cloud, I blew smoke rings and traced H.’s name in the sand with my finger. A halo of hand-drawn hearts and stars framed our tattered towels. It was easy to forget why I had wanted to go to Tommy Bahama in the first place. As easy as forgetting to text W. back. My attention was out to sea. I waded through the hollowed rocks. Foam dappled my legs. I framed snapshots of H. silhouetted against a dirty peach sky.On our third and most recent visit to the Marlin Bar, we sit on the patio. It’s late afternoon and every table in view has two or more cocktails sweating on tiny white napkins. In between bites of crispy coconut shrimp and soft jerk chicken tacos, I look around at the other tables—scanning for reminders; for one last jolt of nostalgia—then refocus on H., who is telling me about the Whitney Houston biography she’s reading. I keep my gaze on her face. I no longer want a portal to the past. And yet, while there are countless bars on the strip where we can drink iced mai tais under limp palm fronds, I keep taking her to the Marlin Bar because the space is a psychic reminder that the thrill of tuning into the present always trumps the dull comfort of nostalgia. Paradise is not a far-off destination in my mind, a familiar story I tell to console myself. Not anymore.To enjoy Tommy Bahama I’ve learned that one must commit to the bit. If everyone in the bar entertains it, the illusion becomes reality. Yet it’s easier for some to buy in than others. Despite Tommy’s protestations, we can’t fully evade the outside world or the taint of our personal histories, even in our fantasies. Especially in our fantasies. As I discover, there is nothing truly easy about enjoying myself here. But what if I no longer need easy?When we pay the check, we walk to a gay bar down the street. Inside, the surfaces are sterile: all metal and glass. Blue light emanates from the bar in the center of the bright room. We sit on imitation crocodile booths the color of Tang. It’s over 107 degrees and the misters create a thin veil around us. When I come out of the bathroom, H. is talking to a man in dolphin shorts about a Real Housewife indicted for fraud. Today I’m not on vacation, or an escape mission. I lean in closer to H. I don’t know what she’ll say next, but I want to find out.Explore Bon AppétitRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-02", "author": ["Condé Nast", "Elizabeth Hall"]}