{"id": "e9972a876595c5e226ae4fbe6f1235c3", "url": "https://www.bonappetit.com/story/digiorno-crispy-pan-pizza", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "The Frozen Pizza That Won Over This Pizza Snob | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Frozen Pizza That Won Over This Pizza SnobJust look at that golden brown crust!By Adam RapoportOctober 2, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Pearl JonesFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.A couple months back, my wife and 11 year old walked into the kitchen, straight from the supermarket. Marlon, holding a box of DiGiorno Crispy Pan Pizza, had a big grin on his face. My look was a bit more “Um...seriously?”It’s not that I’m a pizza snob, but on the occasions that I do buy a frozen pizza, I reach for those pricey ones from hipster mecca Roberta’s in Bushwick. I’m also well versed in the naturally leavened, doughy ways of Neapolitan pies. And I’m up on all those joints that mill their own grains. So, yeah, maybe a little snobby.Which is to say I’ve never been a DiGiorno guy (it wasn’t around during my teenage Stouffer’s French Bread Pizza days). But this Crispy Pan Pizza—let me explain. It bakes in its own pan, made from I’m not exactly sure what. When you lift the pie from its home, the bottom is all buttery and golden and, yes, crispy, not unlike the Detroit-style pies that everyone is so gaga for these days. The sauce leans a little bit sweet, in a good way. The cheese, if you leave the pie in the oven for a bit longer than prescribed, gets all bubbly and well browned. The dough itself can best be described as pillowy.Short story short: we now have DiGiorno Night at home, with mom and dad going to town as much as Marlon. Because now we’re not just pizza snobs—we’re DiGiorno Crispy Pan snobs.Buy it: DiGiorno Crispy Pan Pizza $10 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendPizzaRead MorecultureChicago’s Real Signature Pizza Is Crispy, Crunchy, and Nothing Like Deep DishBy Jason DiamondRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-02", "author": ["Condé Nast", "Adam Rapoport"]}