{"id": "e99bcc47c6ca8ef2345f90a84c5ea89c", "url": "https://www.bonappetit.com/recipe/sheet-pan-chicken-meatballs-and-charred-broccoli", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Sheet-Pan Chicken Meatballs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueSheet-Pan Chicken Meatballs and Charred BroccoliBy Deb PerelmanFebruary 12, 20194.1(79)Read ReviewsTriangleEmailPinterestPrintThe sauce on these meatballs is a winner brushed on pork chops or chicken wings too.Photo by Alex Lau. Food styling by Susie Theodorou.EmailPinterestPrintEmailPinterestPrintThis approachable weeknight dinner takes its cue from Japanese grilled chicken meatballs (tsukune), and the glossy, sweet-and-sour sauce that comes with it.Ingredients4 servingsSauce⅔cup ketchup¼cup Worcestershire sauce2Tbsp. rice cooking wine or water2Tbsp. honey4tsp. soy sauce1½\" piece ginger, peeled, finely grated½tsp. freshly ground black pepperMeatballs and Assembly2heads of broccoli (about 1½ lb.)2Tbsp. vegetable oil, divided2½tsp. kosher salt, dividedCrushed red pepper flakes (optional)1lb. ground chicken1large egg, beaten to blend4scallions, thinly sliced2garlic cloves, finely grated12\" piece ginger, peeled, finely grated⅓cup panko (Japanese breadcrumbs)1Tbsp. toasted sesame oil¼tsp. freshly ground black pepperCooked rice and sesame seeds (for serving)PreparationSauceStep 1Mix ketchup, Worcestershire sauce, wine (if using), honey, soy sauce, ginger, and pepper in a small saucepan. Measure out ¼ cup mixture into a small bowl; set aside for glazing meatballs later. Bring remaining mixture to a simmer over medium-high heat, stirring occasionally and reducing heat if needed, until sauce thickens, about 5 minutes. Transfer sauce to a small bowl.Meatballs and AssemblyStep 2Place a rack in upper third of oven; preheat to 450°. Line a rimmed baking sheet with foil. Trim broccoli stems and remove from crown. Peel off tough outer skin; slice crosswise into ½\" pieces. Cut florets into 2\" pieces. Toss on prepared baking sheet with 1 Tbsp. vegetable oil, 1 tsp. salt, and a few pinches of red pepper flakes (if using). Push to the edges of baking sheet to create a space for meatballs. Brush space with remaining 1 Tbsp. vegetable oil.Step 3Mix chicken, egg, scallions, garlic, ginger, panko, sesame oil, pepper, remaining 1½ tsp. salt, and ¼ cup water in a medium bowl. Using wet hands, form into twelve 1½\"-diameter meatballs. Arrange on baking sheet; brush with some of the reserved glazing mixture. Bake until meatballs are cooked through, 14–18 minutes. Remove from oven; heat broiler. Brush meatballs with remaining glazing mixture; broil until broccoli is charred and meatballs are browned in spots, about 5 minutes.Step 4Spoon meatballs and broccoli over rice in bowl. Drizzle with sauce and sprinkle with sesame seeds.How would you rate Sheet-Pan Chicken Meatballs and Charred Broccoli?Leave a ReviewTell us what you thinkReviews (44)Back to TopTriangleI should’ve read the reviews before making this. The sauce was so odd. I can’t even put my finger on it. This is a real stretch for the BA staff. The recipe should be taken down. AnonymousRaleigh, NC2/7/2022My husband and I love this recipe! I find that it is consistently delicious. I have not had ginger in the past so I just throw in some ground ginger. The meatballs hold up beautifully, the sauce is sweet and sour and the broccoli is perfectly cooked every time. We serve it with white rice though you could play with the grain. AmberBoston, MA1/25/2022This was really good. We left the water out of the meatballs and it was the right move. The sauce was definitely not too ginger-y - if anything, it tasted a little too ketchup-y on its own, but once mixed with everything else it was delicious. The sauce complements everything else perfectly. Will make again!KiraBrooklyn, NY 10/26/2021Really wish I read the reviews before making - as everyone else says, there is way too much ginger in the sauce. Next time I will probably leave the ginger in the chicken and remove from the sauce.HenryNew York City9/27/2021A lot of reviews say the sauce was not balanced or overwhelming. I knew the amount of ginger the recipe called for would be too much so the trick is to put in just a dollop for the glaze and meatball mixture. That seemed to do the trick since ginger is very pungent in taste. I thought the meatballs were great. I always have so much glaze afterwards so I would half the ingredients so I don’t have so much leftover. Great meal. My hubby loved it! Rachel MLos Angeles 6/17/2021This recipe lacked complexity and had too much Worcestershire sauce. To adjust the sauce, I halved the Worcestershire sauce, added 1 Tablespoon of Sriracha sauce, 1 teaspoon of chili paste 2 cloves of minced garlic, 1 teaspoon of molasses, and 1 whole star anise. \nIt made a world of difference in the flavor. Yes, it was spicy, but a more balanced, complex flavor - absolutely delicious! Liz D.San Francisco5/13/2021Late night talks be hitting different in theseSeanChicago, IL4/17/2021AWFUL.   This is wrong on so many levels!  All I can say, is my garbage disposal liked it.Donna BNarragansett RI2/14/2021My family loves this recipe and has made a couple changes over time. We use ground chicken when we can find it on sale, otherwise we use ground beef. We also cheat a bit and use grated ginger from a tube which can be found near the packaged herbs in the refrigerated produce section at the grocery store. Crispy roasted broccoli will change your life if you haven't tried it!Brandy B.Binghamton, NY2/8/2021Did not like this sauce at all.  Not a balanced flavor.  Far too much Worcestershire sauce.  And, far too much sauce for one pound of ground chicken meatballs.  About to toss out the remainder.  \nAlso, at 450 degrees, the broccoli is ready before the meatballs, so, it must be removed when you take the meatballs out at the 14/15 min. to glaze again.\nThe flavor of the actual meatball was fine but the sauce does not compliment the flavor.\nCan't reccomend.  \n\n\nEsdeeToronto, Canada2/2/2021We did not like this.  The flavor was off, too gingery and the consistency was not good.  Crumbly and soft and somehow lacking in taste despite a huge amount of time spent prepping sauce and chicken mixture.  Together with the sauce, the ginger was overwhelming.,  \n\nI usually like the recipes I find here so this was a surprise, unfortunately.AnonymousNaples, FL1/27/2021Great, healthy meal with plenty of flavor. As some of the other reviewers have mentioned the sauce is very powerful. Just need a small amount. We serve this with basmati rice. Kevin B.Monroe, NY1/25/2021Really delicious, I chilled the meatballs for a couple of hours before I put them in the oven and they held together really well.  I loved the look too.brushjlsolon, oh1/13/2021The meatballs were delicious. The sauce was so overpowering that I although I made it, I dumped it down the drain. A simple soy/sesame glaze was far more appropriate and did not overpower the meatballs. I would definitely make the meatballs again but wouldn't  bother with a sauce that tasted more like a bbq sauce than an asian glaze AnonymousToronto, Ontario12/1/2020These were soooo good! I was a little wary after reading some of the reviews but I just loved the flavor of all components. The ginger is subtle but flavorful and the meatballs were moist and juicy. I used only half of the water and thankfully so as they were quite wet. I used a cookie scoop to make the meatballs and then gently shape them in my hands and that worked nicely. Will make again for sure!JamedawgLos Angeles, CA11/13/2020Explore Bon AppétitMeatballChickenPoultryBroccoliVegetableSheet-Pan DinnersWeeknight MealsMainDairy-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Deb Perelman"]}