{"id": "e99fc7ae9b210900a23fb4efd1a74a84", "url": "https://www.bonappetit.com/story/tahini-granola", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "Grain Free Granola With Tahini Coconut-Nut Clusters | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Tahini Granola Is Nutty, Cluster-y, and Totally Grain-FreeOats? You won't miss 'em.By Andy BaraghaniApril 11, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Andy Baraghani, Prop Styling by Emily EisenFacebookTwitterEmailThis grain-free granola is salty-sweet, with an addictive tahini syrup and big coconut and nut clusters. I originally just made a batch for my 30 Seconds With Andy Instagram segment, but once our editor-in-chief Adam Rapoport tried it, he decided it deserved a proper recipe. It’s really that good. Instead of oats, this grain-free granola recipe uses a mix of unsweetened coconut flakes and raw nuts. Go ahead and use up any nuts in your pantry—pistachios, pecans, walnuts, and almonds all work great.Next, it's time to make the tahini syrup by mixing together  pure maple syrup, extra-virgin olive oil, kosher salt, ground cardamom, and, of course, tahini. I like a lot of tahini brands—Seed and Mill and Beirut are both great—but you really just want to it to be smooth. If the tahini is split, with oil floating on top and a hard paste at the bottom, don’t try to mix it with a spoon or whisk. Just pulse it in a food processor or blender to recombine, then measure it out. Once the tahini is properly emulsified, it can be added to that syrup mixture, which will caramelize over the nuts.This granola cooks low and slow, about half an hour in a 300° oven. You want to shake and rotate the baking sheet about every 15 minutes to promote even browning. Once everything is golden and crispy, let it cool on the baking sheet for about twenty minutes so it can really harden.The end result doesn’t really look like granola—I’ll tell you that right now—because you don’t see any oats. However, you do get these really wonderful coconut-nut clusters. You can keep them in big chunks, but I like to whack the clusters with a metal spoon to create irregular bits and pieces.I’d recommend doubling (or tripling!) the recipe to make a big batch, which you can store in an airtight container for up to two weeks. For a really exceptional breakfast, sprinkle the granola over Greek yogurt with flaky salt and bee pollen on top. Break it into small pieces and treat it like cereal with a splash of milk on top, or serve it over macerated fruit with yogurt or barely sweetened whipped cream.If you find yourself missing oats, just swap out 1 cup of the nuts for ¾ cup rolled oats (Bob’s Red Mill makes a variety of gluten-free oats that are perfect for this recipe). Still, I recommend trying the original oat-free version first, because those coconut-nut clusters are just so good—they're the perfect way to upgrade any dish with a salty-sweet crunch.Get the recipe:Grain-Free Tahini GranolaIf you’re missing the oats in this gluten-free, make-ahead granola, simply swap out 1 cup of the nuts for ¾ cup rolled oats.View RecipeExplore Bon AppétitHealthyishGranolaGluten FreeCoconutNutBreakfastRead MorecookingThis Is the Nut-Free Granola We Want to Wake Up ToBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-09", "author": ["Condé Nast", "Andy Baraghani"]}