{"id": "e9b413f3350d92a78c3b730989e070c0", "url": "https://www.bonappetit.com/recipe/braised-beans-and-sardines-with-fennel", "year": 2021.0, "month": 1.0, "day": 1.0, "content": "Braised Beans and Sardines With Fennel Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueBraised Beans and Sardines With FennelBy Devonn FrancisJanuary 1, 20213.8(50)Read ReviewsTriangleEmailPinterestPrintPhotography by Emma Fishman, Food Styling by Adriana Paschen, Prop Styling by Elizabeth JamieEmailPinterestPrintEmailPinterestPrintIn this brothy beans recipe, caramelizing fennel, shallots, and lemon builds a base layer that is sweet, tangy, and bright. Tinned sardines add briney flavor (and protein!)—leave them whole or break them up and fold them into the soup.  And chopped celery or mushrooms work just as well as fennel if you want to swap. This recipe is part of the 2021 Feel Good Food Plan, our eight-day dinner plan for starting the year off right.Ingredients4 servings1fennel bulb with fronds, stalks and fronds removed1lemon, halved¼cup extra-virgin olive oil2medium shallots, thinly sliced6garlic cloves, thinly slicedSmall handful of mixed hardy herb sprigs (such as bay leaves, thyme, and/or rosemary)½tsp. crushed red pepper flakes¼cup dry white wine6cups low-sodium chicken broth215-oz. cans cannellini (white kidney) or cranberry beans, rinsed14.4-oz. tin oil-packed sardines, drained1(loosely packed) cup very coarsely chopped parsleyKosher saltToasted seeded bread (for serving)PreparationStep 1Slice fennel bulb in half lengthwise and cut each half lengthwise into 3 wedges. Thinly slice 1 lemon half into rounds and wriggle out and discard any seeds; leave remaining half intact and set aside.Step 2Heat oil in a medium pot over medium-high. Add fennel, shallots, garlic, hardy herbs, lemon rounds, and red pepper flakes and cook, stirring occasionally, until fennel and lemon are softened slightly and golden brown in spots, 5–7 minutes.Step 3Using tongs, transfer lemon rounds to a small bowl; set aside. Add wine to pot and cook until reduced by half, about  2 minutes. Pour in broth and bring to a boil. Reduce heat to medium-low and simmer, stirring occasionally, until fennel is tender, about 5 minutes. Add beans and simmer until beans soak up some of the broth and are warmed through, 8–10 minutes.Step 4Meanwhile, working one at a time, slice open each sardine with the tip of a paring knife and remove any visible bones; discard. Separate fillets from one another and place in a small bowl. Squeeze juice from remaining reserved lemon half over fillets.Step 5Fish out and discard any hardy herbs and stems you can from braise. Stir in parsley; taste and season broth with more salt if needed.Step 6Divide braise among bowls; top with reserved lemon slices and sardines. Serve with bread alongside.How would you rate Braised Beans and Sardines With Fennel?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleBTW I just realized that sardines are not listed in the ingredients.  Hello?!Janet- from previousCA5/1/2021I’ve made this 3 times now and it’s wonderful.  I’ve been halving the recipe to make it for 2, but end up still using a whole lemon (Meyer) and the entire tin of sardines as garnish. Also I cut down on the chicken stock by about 20%, adding water.   Quick delicious dinner.JanetCA5/1/2021I found this to be poorly written and a sloppy effort. The fennel absolutely doesn’t get soft snd looking like the picture in the time specified, it needs double or tripple but not all with the beans or they will get too mushy. But overall, the soup was kinda boring / it’s just chicken broth with beans snd fennel and lacking depth of flavor or complexity. Maybe dried shitakes would help. Also less lemon on the sardines which made it too acidic. Peter DBaltimore, MD2/19/2021I combined these instructions and the suggestions from the feedback to make this recipe. Absolutely fabulous!!! Cook the rinsed great northern  beans in broth, garlic, herbs and lemon rind on high for 30 mins in my Instant Pot, then combined with sardines, fennel, red onion, in a Dutch oven, sprinkle with parm cheese and broil for 5 mins. Top with parsley and serve with bread ... dreamy! AnonymousJacksonville, FL2/6/2021Using shallots in a recipe with such bold flavors is just a waste of good shallots. More of a vote to prissy home cooks that like to think a shallot is upmarket. As written, this recipe is essentially just bean soup with fennel and a sardine garnish. Overall, it's is a sloppy effort at what could be a hearty, rich braise, but it's just a soupy mess. It reminds me of common braises in Liguria or Tuscany, but without the flavor development of good Italian cuisine.\nBefore doing anything, zest the whole lemon, and add zest to the broth that you'll use later.\nUse a half of a large red onion, cut into three wedges (or a whole small one, cut in quarters). Place the onions, fennel wedges, half the garlic cloves (still in their paper)and both lemon halves, cut-sides-down, in a cast iron skillet or on a silpat in a rimmed baking sheet, and dry roast then at high temp, to caramelize them. When they are fully cooked, cut each fennel wedge in half, reserving the root-half (the side with the core that holds it together) to the side\nWhile the veggies roast, cook 1½ cups ofsoaked, DRIED beans, together with the remaining (peeled) garlic cloves, the herbs (NOT incl the parsley), in the 6 cups of broth (Instant Pot works great here), and when the beans are tender, and the liquid is reduced to the consistency of tinned baked beans (or a hearty chili com carne), gently combine them with the parsley, the paste from the roasted garlic cloves, the roasted onions and the stalk-end of each fennel quarter, and the juice of one lemon half.  If necessary,add additional broth (or water) to achieve the proper consistency.\nDivide the mixture between individual cassolets or gratin dishes (any individual-sized oven-safe dishes will do). Top the dishes with the remaining root-ends if the fennel wedges and the sardine fillets, and then squeeze the remaining lemon half over the top of each gratin.\nRoast in a hot oven until bubbly, and lightly charred on top. Optionally, you could top each dish with grated cheese of your choice, or even breadcrumbs.\nServe with additional lemon wedges for each guest.\nTHAT'S how you augment the boldness of the flavors, and keep the fennel & sardines from being lost in \"bean soup.\"\nH Neil MOrlando, FL2/2/2021While we enjoyed this and would make again, we would make some changes. I would recommend cooking the fennel for much longer and cutting it into smaller pieces - I think next time, we might actually roast the fennel first. I also think we would either add more beans or only use four cups of broth just to make it less “soupy”. Otherwise, it was an easy dinner and a good mix up from our usual!LeahBellingham, WA1/27/2021I really like this and will make again. But... I used dried beans and had enough cooking liquid to only need 2 cups of chicken broth or it would have been broth with a few beans in it. I cut the fennel wedges into 1\" pieces after the sautee to make it easier to eat and added a tablespoon of lemon zest. I don't get the point of the sardines. I tried breaking them up and mixing in but they just vanished. Dr KixNorthern Michigan1/27/2021I was admittedly taken in by the beautiful photograph that accompanies this recipe. But the completed dish was just okay, and no one in my household found the flavors to be all that exciting. We have white beans and sardines in heavy rotation at our house, and there are just so many better recipes out there with these ingredients. I cooked the soup longer than the recipe recommended to try and build more flavor, and even used home-made chicken stock.  If I were to make this again I'd cut the fennel down smaller, sautee everything longer, throw in some additional spices, and leave in the lemons for the duration of the cook time like other reviewers recommended.LaurenAtlanta, GA1/23/2021I thought this was excellent—really unique flavors that are very bold, but balanced. I used half a pound of dried beans and cooked them directly in the broth—just increased the liquids by about 25%. Like another reviewer, I just left the lemon slices in there, and after about 2 hours of cooking they were nearly cooked down and left a nice floral note without any bitterness. I will be making this again!SarahWashington DC1/23/2021I absolutely loved this soup! The flavors were so bright and delicious, I've never had anything like it. It was both soupier and spicier than I expected but I ain't mad at it. I've never cooked with fennel like this before and I vastly preferred it to celery. I've never cooked lemon in this way either and it was an eye opener. I actually left mine in for the whole cook time because they basically melted into the soup from the beginning. I didn't have white wine so I subbed a mix of ACV and white wine vinegar instead. I used smoked sardines which added another layer of amazing flavor. This recipe is def going into permanent rotation in my kitchen.StevieWoodbridge, VA1/21/2021Didn’t have fennel, so used celery and mushrooms instead.  I also substituted canned sprats for sardines and some homemade veggie stock.  My husband was skeptical at first but ended up loving it.  Great balance of flavors.Maria KSan Antonio, TX1/16/2021This is a light, bright, well-balanced soup. I suspect some other reviewers were thrown off by the amount of broth because the word \"soup\" isn't in the title of this recipe, but it's clearly in the description. My fennel bulb was on the smallish side (I think this is standard for many non-specialty grocery stores) and didn't have much impact in the finished dish, so I would definitely recommend using multiple bulbs (or at least one large bulb) if you're hoping for a more fennel-centric recipe. I swapped in veg stock and vermouth and it was lovely. A few capers as a garnish would be a nice addition.Johanna KCA1/15/2021This was really great! A total hit. I did cut the fennel into more wedges and added a celery stalk for fun--but seems like any negative remarks on this recipe was doing something wrong :)Allie J.Chicago, IL1/12/2021I loved this recipe & dish! the flavors are outstanding and it was relatively easy to make at home (which is key for me as a parent of a toddler). It added comfort and zest to our family’s Monday night. Way better than Alison Roman, in my opinion.AnonymousPortland, Maine1/12/2021I actually really liked this recipe and will likely make it again! I didn't have wine so I used cooking sake. Turned out great, I think the acidity from the lemon was more than enough to make up for the sweetness of the sake. However I also used large, meaty sardines which I did not like very much, the flavors didn't really \"marry\" but I will try with the smaller kind and see if it works better.HangryGurlNew York, NY1/11/2021Explore Bon AppétitSoupSoups and StewsCannellini BeanWhite BeanBeanVegetableSardineFishSeafoodFennelEasyWeeknight MealsOne-Pot MealsMainNut-FreeGluten-FreeDairy-FreeHealthyishBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-01", "author": ["Condé Nast", "Devonn Francis"]}