{"id": "e9b6858db270d012532e4d00618ba541", "url": "https://www.bonappetit.com/story/abbi-jacobson", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "Abbi Jacobson Learned This From Her Most Embarrassing Moment on Set | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Abbi Jacobson Learned From Her Most Embarrassing Moment on SetIn her new book, I Might Regret This: Essays, Drawings, Vulnerabilities, and Other Stuff, the Broad City co-creator recounts the last time she lost all confidence in herself.By Abbi JacobsonOctober 30, 2018FacebookTwitterEmailPhoto by Emmanuel OlunkwaFacebookTwitterEmailOne of my first big projects as an actor for hire was an independent film called 6 Balloons. It is mostly dramatic and deals primarily with heroin. I know, sounds right up my alley! But it was, in fact, right up my alley. This script, about an upper-middle-class heroin addict and his enabling sister trying desperately to save him, felt like something I wanted to be a part of telling.The film takes place over the course of one evening, so for nineteen days, we shot primarily overnight. Filming overnights for this long can make you feel like you’re living in an alternate reality. You start work at 5 p.m. and get home at 5 or 6 a.m. The farther along into production, the more normalized this becomes: eating, “dinner” at 1 a.m., and waking up at 1 p.m. every day. It’s bizarre. I’m not a fan, but it is one of the things I like about this industry—it makes you realize how many different kinds of lives you can live, not just through the stories told, but in the manner in which you can use the hours in a day. You can shift your life in many ways.So, on this night, we were shooting a scene in which my character, Katie, borrows the keys  to  a  pharmacy  bathroom to help her brother, Seth, who is going through heroin withdrawal. It is clear that she needs the bathroom keys so Seth can shoot up in there with the needle she just bought. The pharmacist isn’t happy, and they get into an argument, but she gives Katie the keys anyway, making a flippant remark about how she hopes Katie can remember to return them. Cut to later, they’re back in the car and Seth hands her the bathroom keys they borrowed. Shit. After that whole thing with the pharmacist, Katie’s gotta return those keys. She runs back to the pharmacy, but it’s closed, and the doors are locked. She spots the pharmacist, but she won’t even open the door so Katie can return the keys. What an asshole, right? So, Katie walks back to the car, then stops. Fuck this bullshit, and she throws the keys back at the pharmacy, smashing the glass front door. AHHHHHH— She runs back to the car and they peel out of the parking lot.Annnnnnnnd scene. What a thrilling, intense, funny, and exciting part of the film!Now let’s get into the throwing of the keys: It wasn’t an entire door I was trying to hit, but rather a top panel of breakaway glass (approximately eighteen by twenty-four inches) that had been put in the door to smash. Breakaway glass, for those that aren’t usually around fake smashes and crashes, is an industry prop, used to create a more reliable outcome and a safer environment on set.Because it was a scene where we were going to break something, it was shot last, around four in the morning. I had prepared beforehand, like I do, and could hit the mark—what could go wrong? Then we began what would be an hour or more where my body completely betrayed me. I COULD  NOT  FOR  THE  LIFE OF ME HIT THE GLASS. I threw the keys to the right of the door, to the left, hit the sidewalk in front of me, the lamp above the pharmacy sign. I chucked them at the curb, the window, the metal rim around the roof. It was absolute insanity. Forty crew members watched me throw those keys every which way except where I was supposed to. They watched me fall apart. It was like my body was the only one honest with me—it screamed, “You’re a terrible actor and we’re not gonna help you! Meryl would be able to hit that door with her eyes closed. Go home you stupid comedy writer!”At least ten different people in the crew came over to tell me how I should throw the keys—mostly men. THANK YOU! I know how to throw stuff—I used to play softball and I think I’m pretty athletic—but this was absolute mayhem. I must have thrown the keys at least thirty-five times. We were running out of time—the sun was coming up! I could have died. A part of me thinks maybe I did die in that moment, on that night, in the middle of one of those throws.In the end, I threw the keys and hit the glass, but I was standing SO embarrassingly close to the door, it’s unbelievable I came back to work the next day.That overtaking of my body and my inability to use it for what I needed carried such a weight. I can feel it again, can bring back that humiliation, that complete lack of control. But it was just throwing keys at a door. No one died, no one was even mad, we got the shot! It wasn’t a big deal to anyone but me. So why do I even care, almost two years later? Why does it make me cringe to even think about? Memories fascinate me, how they gain or lose weight over time, always fluctuating, just like our bodies, becoming lighter or heavier the more they need attention.That night and my inability to throw those stupid fucking keys reminded me just how shaken I’ve been the past six months, how no matter how hard I tried, I couldn’t get over this heartbreak, couldn’t stop feeling insignificant in general or shitty about ways in which I could have reacted differently. Physically I was fine, but my mind and heart, emotionally, were not, and no new environment or vast amount of space in the sky was going to fix me. It was just going to take time. I thought driving as far away from my life as I could would release the things I was struggling with, but it seems I’d come all this way only to drive more directly into them.Excerpted from the book I Might Regret This: Essays, Drawings, Vulnerabilities, and Other Stuff by Abbi Jacobson. Copyright © 2018 by Abbi Jacobson. Reprinted with permission of Grand Central Publishing, New York, NY. All rights reserved.Explore Bon AppétitHealthyishCelebritiesessayRead Moreculture'Battle of the Sexes' Star Natalie Morales Is Queer, Vegetarian, Cuban, and ProudBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-30", "author": ["Condé Nast", "Abbi Jacobson"]}