{"id": "e9c328c3532c7ebe2e05d196aef23342", "url": "https://www.bonappetit.com/story/the-most-important-cookie-tip", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Why Resting Cookie Dough Makes For Better Cookies  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor the Love of Cookies, Please Don't Skip This Step of the RecipeIt's there for your own good!By Sarah JampelFebruary 9, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.You’re plowing through a cookie recipe, so close to the end that you can practically taste the chocolate and then…HALT, you come across the dreaded words: “Let the dough rest.” Suddenly, you have to wait an additional 30 minutes (maybe more!). When the glass of milk is already poured, that amount of time feels like an eternity. Woe is you!But while it’s extremely tempting to pretend you never read that direction and go along your merry way, this pesky step is a critical investment in the texture and flavor of your finished product. There’s a good reason it’s a part of so many of the best cookie recipes.The primary reason for a brief resting period to redistribute the liquid in the dough. While the dough sits, turning from loose and soft to drier and more scoopable, the flour is hydrating, yielding cookies that will bake and brown more evenly. The sugar also absorbs moisture from the eggs and butter: With less “free moisture” hanging around, the dough has a higher concentration of sugar, and the higher this percentage, the more likely it is that you’ll get cookies with chewy centers and crispy edges. (When I halved the sugar in one of my favorite recipes, I found that the low-sugar cookies were cakey and doughy, whereas the full-sugar cookies had tender, buttery middles surrounded by a firm, lacy circumference.)These Salty Buckwheat Chocolate Chunk Cookies are a prime example of a recipe where resting matters.\nPhoto by Laura Murray, Food Styling by Susan Spungen But it’s not all about the texture: A drier, more concentrated dough also has more pronounced flavor. Let it sit for long enough—the famous Jacques Torres chocolate chip cookie, published in the New York Times, mandates a rest of at least 24 hours and up to 72—and the starches and proteins in the flour begin to break down, leading to more browning and caramelization. All of this means that well-rested cookies will taste richer and more complex.And one more thing! If you’re resting the dough in the fridge as some recipes instruct, you’re multitasking by hydrating the dry ingredients and solidifying the fat. Because cold butter takes longer to melt than room temperature butter, chilled cookies will hold their shape in the oven. When it’s important to stymie the spread—say, for shortbread circles or intricate linzers that you’ve so carefully formed—chilling the dough is mandatory.So while resting the dough means you’re another 30 or 60 minutes (or, if you’re really committed, 72 hours) away from cookies, it also means those cookies will be chewier, gooier, and more delicious. Didn’t Santa say that good things come to those who wait?Get the recipe:Obscenely Chocolatey Chocolate CookiesHere's the cookie to bake when you want to impress your friends at the cookie swap but you're not about to spend hours cutting out reindeers and piping royal icing. View RecipeExplore Bon AppétitCookieRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-10", "author": ["Condé Nast", "Sarah Jampel"]}