{"id": "e9c4208b7b3f3d2a139334144bce0b92", "url": "https://www.bonappetit.com/story/one-time-cooked-on-thanksgiving", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "The One Time I Actually Cooked a Thanksgiving Meal On Thanksgiving | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe One Time I Actually Cooked a Thanksgiving Meal On ThanksgivingChris Morocco has cooked dozens of Thanksgiving recipes—all of them in the Test Kitchen, in the middle of the summer. What could go wrong trying them out on the big day in November?By Chris MoroccoNovember 10, 2018FacebookTwitterEmailIllustration by Jan BuchczikFacebookTwitterEmailI cook 364 days of the year. The one day I don’t? Thanksgiving. For the last 20 years or so, “Thanksgiving” has served as a convenient word to describe our family tradition of having food, wine, and incredibly high decibel levels converge at my uncle Stephen and aunt Denise’s house. Every year, these two pros defy the chaos to follow a menu playbook that might as well be chiseled in stone. They have gotten so good at it that the rest of the family does everything they can to just stay out of their way.But that doesn’t mean I spend Thanksgiving just sitting around; my primary job is to keep my kids (now three and six years old) from destroying the house. A few lifetime’s worth of trinkets and travel ephemera made easy targets for small hands, and the novelty of stairs was a skull-cracking revelation to my apartment-dwelling kids. You don’t realize just how brilliant child gates are until you spend a holiday stationed at the top of a steep set of wooden steps.And though I’d never cooked on Thanksgiving, I have cooked more Thanksgiving meals than most people twice my age. In July and August, when everyone I know is at the beach, I am cooking through turkey, potato, and pie recipes for Bon Appétit’s November issue. By Thanksgiving, I am usually sick of turkey (although never too sick of pie), and frankly tired of entertaining my kids in a non-childproofed house, all in the service of a meal they won’t eat.But, last year, our Thanksgiving traditions were upended.My sister and her family couldn’t face another year of travel from Denver, and Connecticut was no longer a convenient meeting spot since my cousins had scattered across America. My wife and I had just sold our weekend house that was 20 minutes up the road from Stephen and Denise’s. We were holiday orphans. So I became a Thanksgiving host for the first time and invited our best friends to a rented cabin in the woods outside of Hudson, NY.It nearly broke me.When I cook Thanksgiving in the Bon Appétit Test Kitchen, every tool I need is within arm’s reach, groceries are delivered, and colleagues know better than to talk to me when I have that look on my face. If I need to concentrate during a busy day I can always put on my headphones to drown out the sound of Brad shouting at Vinny. Now I was a 30-minute drive from an uninspiring supermarket, had six kids (okay just three kids really, but on Thanksgiving each one counts as two) underfoot, and had decided that this meal would be the culmination of every delicious twist on every Thanksgiving dish I had ever cooked. I desperately wanted to recreate the magic of glossy Thanksgiving features that I had spent years helping to publish. Instead, I felt the squeeze of cooking in someone else’s kitchen—flimsy pans and all—for a crowd that was variously gluten free, dairy averse, vegetarian, and under five.As I felt my nerves boiling in time with the potatoes, I realized I needed to chill out. I got less ambitious with the menu and focused on embracing the chaos. I played outside with the kids and stopped trying to impress everyone. I delegated. Standing in the kitchen, five hours later, with twice-roasted squash,  roasted chickens (no turkey!), burnished potato nuggets (a.k.a. English-style roasted potatoes), and gravy all laid out on the table, I felt something as a host that I had never felt as a Thanksgiving guest: Truly grateful.It really meant something to have pulled off a feast on the day it was actually meant to take place. Maybe it wasn’t right out of the pages of Bon Appétit, but being with friends, and getting everyone to sit at the table for longer than 10 minutes, was something we could never take for granted. I only fully appreciated how hard my family worked to be together once that tradition was gone.As good as last year was, a big family gathering is overdue. So we are off to Denver this Thanksgiving. I probably won’t get much sleep and will spend far too much time chasing my kids around, keeping them from breaking things. I probably won’t do much, if any, of the cooking. Some traditions are worth holding onto.Explore Bon AppétitThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-10", "author": ["Condé Nast", "Chris Morocco"]}