{"id": "e9d30fb834ced697dad17672e6496789", "url": "https://www.bonappetit.com/recipe/sticky-toffee-date-cake", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Sticky Toffee Date Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSticky Toffee Date CakeBy Molly BazMarch 6, 20194.6(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintWhy shouldn’t sticky toffee pudding be baked in a classic Bundt shape and bathed in a salted toffee sauce? Yep, we couldn’t think of a reason either. It may look like a lot of sauce, but trust us, you’ll want to drown your cake in it and save some for snacking later—it’s that addictive.Ingredients8 servingsCakeNonstick vegetable oil spray2cups all-purpose flour, plus more for pan1½cups (packed) dark brown sugar1½tsp. baking powder1tsp. ground cinnamon1tsp. kosher salt½tsp. baking soda1cup (2 sticks) unsalted butter, cut into pieces, room temperature1cup sour cream1tsp. vanilla extract3large eggs6oz. Medjool dates, pitted, coarsely choppedSalted Toffee Sauce and Assembly¾cup (packed) dark brown sugar½cup (1 stick) unsalted butter1tsp. vanilla extract¾cup sour cream, plus more for serving1½tsp. flaky sea salt, plus more2oz. Medjool dates, pitted, tornSpecial EquipmentA 10-cup Bundt panPreparationCakeStep 1Place a rack in middle of oven; preheat to 350°. Coat Bundt pan with nonstick spray, then lightly dust with flour, tapping out excess.Step 2Beat brown sugar, baking powder, cinnamon, salt, baking soda, and 2 cups flour in the large bowl of a stand mixer fitted with the paddle attachment on low speed until combined (or use a hand mixer and large bowl). Add butter (make sure it’s at room temperature) and beat on medium-low speed until mixture resembles coarse sand. Add sour cream and vanilla and continue to beat, increasing speed from medium-low to medium as the ingredients begin to incorporate, until batter is thick and smooth, about 1 minute. Scrape down sides of bowl. Reduce mixer speed to medium-low, add 1 egg, then increase speed to medium and beat 30 seconds. Repeat with remaining 2 eggs, reducing speed to medium-low after each addition, then increasing speed to medium-high and beating for 30 seconds (if you beat on medium-high speed from the get-go, you risk losing some of the batter; this ensures nothing flies out of the bowl). Scrape down sides of bowl again. Reduce speed to low, add dates, and beat until incorporated, about 30 seconds longer.Step 3Scrape batter into prepared pan; smooth surface. Bake cake until a tester inserted into the center comes out clean and cake springs back slightly when pressed, 40–50 minutes. Let cool at least 20 minutes in pan, then turn out cake onto a platter and let cool completely.Step 4Do Ahead: Cake can be made 1 day ahead. Let cool, then cover with plastic wrap. Store at room temperature.Salted Toffee Sauce and AssemblyStep 5Melt brown sugar and butter in a small saucepan over medium-low heat, whisking constantly, until mixture is thick and smooth and brown sugar is dissolved, 4–6 minutes. Remove pot from heat and whisk in vanilla, ¾ cup sour cream, and 1½ tsp. sea salt until smooth.Step 6Arrange torn dates in a ring on top of cake. Drizzle ½ cup sauce over cake and dates. Sprinkle with more sea salt. Serve cake with sour cream and remaining toffee sauce alongside. If the sauce has cooled and tightened up, gently reheat in saucepan over medium-low just until warm.Photo by Chelsie Craig, Food Styling by Pearl JonesHow would you rate Sticky Toffee Date Cake?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleVery tasty-- just not quite the same as the original. I found the sour cream in the sauce overkill, so the next time I made this recipe, I replaced it with cream instead for a more traditional caramel sauce. Overall very happy with the finished result!AnonymousTallinn, Estonia1/22/2022AMAZING! Honestly one of the best cakes I've ever made. It's dense, with a tight crumb. and I love that the only sugar in it is brown sugar and the natural sweetness of the dates. I didn't have any sour cream, so i substituted it with yogurt for the cake and cream for the caramel. still came out great. Its definitely on my best cakes list!AlissaGuatemala12/13/2021I fudged up.\nWe don’t have “sticks” of butter in Australia. So when I googled what one stick was equivalent to, that’s what I cut and put in the cake mix - not two. Raaaahhhhhh, oops. \nIt still turned out fine. I’m going to drizzle a little bit of liqueur on it just in case it’s a little dry. It smells divine!AnonymousAustralia12/29/2019Oops, to follow up on the previous reviewer: I used Greek yogurt thinned with a little oat milk and KAF GF 1:1 AP with great success.\n\nI second that this cake was surprisingly light and fluffy! Great texture to make it a true cake as opposed to the traditional pudding. AnonymousCambridge, MA12/20/2019Super delicious! The sauce is, as with any sticky toffee pudding, what makes it (it’s basically liquid crack—salty, sweet, rich...you just can’t stop), Next time I might use a more diverse blend of spices in the cake itself to enhance the flavor. Served it to a few dinner guests, one of whom promptly said it was his favorite treat ever. High praise.AnonymousCambridge, MA12/20/2019This cake was the showstopper at brunch today. So easy to make. The batter was incredibly fIuffy and baked into a surprisingly delicate cake. I made it gluten free using 1-1/2 cup Bob’s Red Mill 1-to-1 All Purpose Flour (naming the brand since each brand’s gf flour behaves a little different) and superfine almond flour and dairy-free using Tofutti sour cream (again each brand is different, so naming my brand). Made no difference in taste for my glutenful and dairyful friends. \nMolly, you keep hitting it out of the park!digimikeyHouston, TX4/29/2019before i read the recipe i assumed that was pieces of bacon on top...an alternative topping that would be good.Anonymousbarcelona3/6/2019Explore Bon AppétitCakeDessertDateDried FruitFruitNut-FreeBakingChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-06", "author": ["Condé Nast", "Molly Baz"]}