{"id": "ea0c0c860ff6755499a61e90890a9732", "url": "https://www.bonappetit.com/recipe/crispy-tofu-in-shiitake-broth", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Crispy Tofu in Shiitake Broth Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueCrispy Tofu in Shiitake BrothBy Andy BaraghaniJanuary 9, 20184.3(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Emily EisenEmailPinterestPrintEmailPinterestPrintMake a double or triple batch of the dashi and freeze in airtight containers to keep for making savory soups on the fly.Ingredients4 servings¼cup plus 2 tablespoons reduced-sodium soy sauce1tablespoon light brown sugar112-ounce package firm tofu, drained3scallions12shiitake mushrooms, rinsed, patted dry24x3-inch pieces dried kombu13-inch piece ginger, peeled, thinly sliced4garlic cloves2tablespoons vegetable oilKosher salt4baby bok choy (about 12 ounces total), halved lengthwise2medium carrots, peeled, thinly sliced into rounds1small radish, trimmed, thinly sliced into roundsToasted sesame oil (for serving)PreparationStep 1Stir ¼ cup soy sauce and brown sugar in a medium bowl. Cut tofu into ½\"-thick slabs and then into squares. Pat dry with paper towels. Add tofu and toss to coat. Let sit, tossing occasionally, 20 minutes.Step 2Meanwhile, remove green tops from scallions and very thinly slice; set aside. Coarsely chop white parts and place in a medium pot. Add mushrooms, kombu, ginger, garlic, and 8 cups water and bring to a simmer over medium-high. Reduce heat to low and cook 10 minutes. Remove from heat; discard kombu. Let dashi sit 20 minutes (this will coax more flavor from aromatics), then fish out and discard scallions, mushrooms, ginger, and garlic.Step 3Heat vegetable oil in a large skillet, preferably nonstick, over medium-high. Cook tofu, working in batches if needed, until golden brown and crisp around edges, about 3 minutes per side. Transfer to paper towels to drain; season with salt.Step 4While tofu is cooking, bring dashi to a boil. Add bok choy and carrots and cook until tender, about 3 minutes. Add remaining 2 Tbsp. soy sauce; taste and season with more salt if needed.Step 5Ladle soup into bowls and add tofu, radishes, and reserved scallion tops; drizzle with sesame oil.Step 6Do Ahead: Dashi can be made 3 days ahead. Let cool; cover and chill, or freeze up to 3 months.How would you rate Crispy Tofu in Shiitake Broth?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleOutstanding! Dania10/15/2020FISH IT´S NOT INCLUIDED ON THE INGREDIENTS LIST. HOW MANY ?\ngemaSPAIN8/10/2020I just made this and added a tablespoon of coconut cream to the broth for some extra flavor and a thicker texture, and I threw in some noodles at the end to make it into ramen. My favorite part was the tofu! I think I'll try making it spicy next time. :)AnonymousNew York7/29/2020On the cover of the Feb 18 edition of Bon Appetit is this delectable soup soup. The recipe is easy to follow. I just want to know what  are the round things with a red center. They are definitively not radishes.cascaderoverYakima3/11/2018Made this broth in the middle of a snowstorm to warm up. I added extra ginger and garlic for health benefits-ginger is known to help with inflammation, digestion, cold/flu relief (because its a diaphoretic). Garlic too helps with the cold/flu healing, in addition, to containing strong antioxidants. I also added crushed peanuts and bean sprouts for a little texture. I was so happy with the way the recipe turned out! It was simple, and nourishing.  VirginiaLeeMontreal 1/17/2018Bok choy it’s not included in the ingredient list. How much of it should be used? One head?Spain1/14/2018Explore Bon AppétitSoupSoups and StewsJapaneseEast AsianAsianTofuOther IngredientsShiitake MushroomMushroomVegetableKombuSeaweedBok ChoyLeafy GreensCarrotRadishQuickEasyWeeknight MealsMainDairy-FreeVeganVegetarianHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}