{"id": "ea1edc52be298686b759198b8f0acbd4", "url": "https://www.bonappetit.com/story/indianish-toast", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "The Most Popular Dish In My Indian Household Is a Slice of Toast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Most Popular Dish In My Indian Household Is a Slice of ToastOne day in the mid ’90s, my mom toasted two pieces of bread, pulled out an avocado and sliced it on top. I’m quite certain that my mom invented avocado toast.By Priya KrishnaJuly 19, 2018FacebookTwitterEmailIllustration by Annalee SoskinFacebookTwitterEmailPriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.The most widely eaten item in my house—and in that of most other Indian households that I know of—is not any kind of traditional Indian dish. It’s toast.My earliest memories of India, where we’d visit my mom’s cousins in New Delhi, involve eating toast. In the mornings, I would stumble out of the absurdly air-conditioned guest bedroom and into the hot, humid dining room, which was filled with the familiar smell of slightly burnt bread.  I’d sit down at the breakfast table and swipe Amul butter (the dairy brand of choice in India) on an almost fake-looking golden-brown white toast, and top it with bhujia, jam, leftover sabzi, or whatever else was scattered across the sticky plastic tablecloth.Back home in Dallas, we adopted the same routine. The default breakfast? Toast with butter, salt, and pepper (“namak kalimirch,” as we called it, which literally translates to “salt and pepper” in Hindi). The default lunch? Toast with whatever savory spread (lima bean dip, hummus, sun-dried tomato pesto) that my mom had left over from hosting a party. And for dinner, aloo gobhi panini-pressed between two pieces of toast. It’s funny, in Indian cuisine, even sandwiches are called toasts. One of the most popular street snacks/leftover meals in northern India is Bombay Toast, which, depending on who you ask, is either a panini filled with leftover sabzi, or an egg-and-spice-dipped bread cooked like French toast and topped with sabzi.All-day cafés have only figured out in the past year or so what Indians have always known to be true: toast is the best. It’s versatile, easy-to-put-together, and wholesome. You can have savory toast, or sweet toast (one of my mom’s favorite desserts is pieces of white toast soaked in heavy cream, cardamom, and sugar, called Shahi Toast); toast can be as light or as heavy as you want it to be; and it can take as little as 30 seconds to put together. Toast is everything.It’s important to mention that the reason that toast is so popular in India has a lot to do with one of the darkest times in the country’s history—British colonialism. But, like how teatime translated into chai in India, Indians took the Brits’ love for toast and ran with it, and the results are wildly creative and varied. Another case in point: bread pakora, or white bread coated in a spiced batter and deep-fried into snackable morsels (perfect for dipping into chai).Toast lovers, you have to try this tuna-topped number.\nPhoto by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenToast is so important in my family that we all know each other’s toast preferences to the T. My mom: lightly toasted, with a drizzle of olive oil; my dad: double-toasted, almost soaked in olive oil, lots of pepper and dried oregano; my Uncle Hemant: basically burnt, with a schmear of butter and a sunny side up egg; my Uncle Sharad: heavily toasted, topped with a half tomato that’s been seared on its edges until jammy. And mine: lightly toasted, showered with diced tomatoes, melted cheese, and chaat masala, or as I like to think of it, three layers of umami.One day in the mid ’90s, my mom was trying to fix my sister and me a quick lunch before she left for a business trip. She toasted two pieces of bread, pulled out an avocado and sliced it on top. I’m quite certain that my mom invented avocado toast.For further proof of our toast obsession, considering the following: we buy our rotis from Central Market, and our papadums from the frozen aisle at Patel Brothers. But for toast, we make our own bread, always. In fact, my dad spent the better part of a decade perfecting the recipe for his “nine-jewel bread” (my dad loves coming up with names for his creations), which is his signature, hearty-but-still-fluffy loaf laced with quinoa, chia seeds, flax seed, and more—it takes almost a full day to make a loaf—just so that our family could enjoy superior toast. Now, when my mom and dad go to a party, they don’t bring a bottle of wine, or a bouquet of flowers, they bring a loaf of my dad’s bread…with an attached index card containing instructions…on how to make great toast.Nothing brings out my family’s culinary creativity quite like an empty fridge containing nothing but bread and a boatload of condiments.Here’s a roundup of all the different variations on toast that we’ve dreamt up over the years.Sliced tomatoes + cheddar + chaat masala (then toasted a second time to melt cheese)Pan-seared tomato half + salt + pepperButter + salt + pepperHummus or pestoLeftover potato-based sabzi (like aloo gobhi)Heavy cream + cardamom + sugar (soaked overnight)Almond butter + chaat masalaOlive oil + red pepper flakes + dried oregano + grated Parm + salt + pepperButter + sunny-side-up egg + salt + pepperGhee + brown sugarEven more toast:Explore Bon AppétitIndianishToastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-19", "author": ["Condé Nast", "Priya Krishna"]}