{"id": "ea3350e2eab93a3ff3b58ada7d5aef2f", "url": "https://www.bonappetit.com/recipe/hot-penicillin", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Hot Penicillin Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHot PenicillinBy Molly BazNovember 16, 20184.1(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Dana BonaguraEmailPinterestPrintEmailPinterestPrintMove over Hot Toddy, there’s a new, even cozier cold weather cocktail in town.Ingredients4 servings⅔cup honey14-oz. piece ginger, scrubbed, thinly sliced crosswise8oz. blended Scotch6oz. fresh lemon juice1oz. single malt Scotch (optional)4pieces candied gingerPreparationStep 1Bring honey, sliced ginger, and 5 cups water to a simmer in a medium saucepan over medium heat. Reduce heat and cook at a bare simmer, stirring occasionally, until honey is dissolved, 20–25 minutes. Strain through a fine-mesh sieve into a large measuring glass or a medium bowl (you should have about 4½ cups); discard solids. Pour honey syrup back into saucepan. Add blended Scotch, lemon juice, and single malt Scotch, if using. Heat over medium-low until hot but not boiling.Step 2Divide cocktail among mugs. Run a toothpick or skewer through each piece of candied ginger and set over the mug’s rim to garnish.How would you rate Hot Penicillin?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI'm glad I saved this recipe for a sickly day -- it totally hits the spot. The ratios of ingredients are perfect. The only thing I couldn't bring myself to do was cook the honey that long. I filtered out the ginger and stirred the honey into the hot ginger-infused water and it worked marvelously.AnonymousDetroit1/5/2019It sounds delicious but one thing to keep in mind is that when you boil honey you lose all the benefits of honey. So maybe that could be part of the second step as usually honey will combine easy with hot water. In India they won’t even add honey to hot tea as they believe honey’s healing properties are compromised even in hot water. Costa Rica11/30/2018Explore Bon AppétitHot DrinkDrinks AllCocktailGingerHerbs & SpicesLemonCitrusFruitWhiskeyAlcohol & Other DrinksScotchFallWinterDrinksNonalcoholicSimmerThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-16", "author": ["Condé Nast", "Molly Baz"]}