{"id": "ea384de019a1dd3e73f82719ae4f9fc4", "url": "https://www.bonappetit.com/story/january-cookbook-club-cook90", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "Cook90 is our Cookbook Club Pick for January | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCOOK90 is our Cookbook Club Pick for JanuaryEpicurious site director David Tamarkin’s recipes are all about home-cook realness.By Julia KramerJanuary 2, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI still remember the day a few years back when David Tamarkin, the site director of Epicurious, announced to me that he had chosen a word to summarize the brand’s new approach: realness. Having worked alongside David for (not even kidding) more than ten years, I know that when he says realness, he means it. It’s not just an ethos that he applies to everything on the Epicurious site; realness is David’s way of life. Which is why it didn’t surprise me that one January, he challenged himself to make three meals a day, with very few repeats, for the entire month, a project he dubbed “COOK90.” That project is now a book (buy it!), which is, I’m happy to say, our January selection for the Bon Appétit Cookbook Club.In a world of aspiration and lifestyle and glitter bagels and CBD water, COOK90 is the ultimate distillation of “home-cook realness,” to use David’s terminology. It’s not about the latest iteration of Keto or how amazing your life will be if you eat cold oats that have been sitting in your fridge overnight. The COOK90 book is unflinching in its dedication to recipes, tools, and strategies that make weeknight cooking not just possible but enjoyable—like a gift to yourself rather than an end-of-day chore. And the concept is totally, refreshingly un-prescriptive: Cook the recipes in the book, or simply cook whatever you want. Either way, you’re still doing COOK90.Before David walks over here and says that I am telling people they don’t need to buy the book and can just cook whatever recipes they want, let me just add one final note: Even as someone who is pretty much resigned to being what I’ll call a “Cook9” (and that’s in a good month, and yes I’m including breakfast in that figure), David’s perspective on cooking is so smart and practical, and his voice is so candid and—yes—real, that he makes the prospect of cooking 90 meals in 30 days feel not just accomplishable but truly rewarding.Later this month, we’ll be sharing some of our favorite recipes from the book. And in lieu of a blowout Cookbook Club dinner, we’re all going to bring “nextovers” (the COOK90 term for non-depressing leftovers) to work one day and trade lunches with each other. That, my friends, is realness.Pick up a copy of COOK90 wherever you buy cookbooks. And if you want to learn more about the BA Cookbook Club and how to start your own club, you’ll find all that right here.Explore Bon Appétitcookbook clubRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-02", "author": ["Condé Nast", "Julia Kramer"]}