{"id": "ea3b184abf9098cf816ef428d9e30d59", "url": "https://www.bonappetit.com/recipe/quick-kimchi-pancakes", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "Quick Kimchi Pancakes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesQuick Kimchi PancakesBy Lauren SchaeferApril 12, 20184.6(104)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintChewy. Crunchy. Salty. Spicy. These veggie-packed fritters have it all! The spice level will definitely vary based on the brand of kimchi you use, so make sure to pick one you're familiar with if you're cooking for people who can't handle too much heat.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketMedium Bowl$17 At AmazonWhisk$10 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAWooden Spoon$6 At AmazonLarge Nonstick Skillet$50 At AmazonSpatula$12.99 At AmazonWire Rack$23 At BA MarketSmall Bowl$13 At AmazonPlatter$29 At AmazonIngredientsMakes 8 small pancakes1large egg1Tbsp. kimchi brine from jar¼cup soy sauce, divided¾cup plus 1 Tbsp. all-purpose flour1½cups kimchi4scallions4Tbsp. grapeseed or other neutral oil, divided3Tbsp. unseasoned rice or distilled white vinegarPreparationStep 1Crack 1 egg into a medium bowl. Add 1 Tbsp. kimchi brine, 1 Tbsp. soy sauce, and ¼ cup water and whisk to combine.Step 2Whisk in ¾ cup plus 1 Tbsp. flour.Step 3Coarsely chop 1½ cups kimchi, add to bowl, and stir to combine.Step 4Thinly slice 4 scallions on a diagonal. Add half to batter; reserve remaining scallions for serving.Step 5Heat 1 Tbsp. oil in a medium nonstick skillet over medium-high. Drop ¼-cupfulls of batter onto opposite sides of skillet (pancakes should be about 4\" in diameter, so you’ll probably only be able to cook 2 at a time).Step 6Cook pancakes until golden brown on first side, 2–3 minutes, then flip and cook until browned on second side, 2–3 minutes longer. Transfer to a wire rack and let cool. Repeat process in batches with remaining batter and oil; you should have 8 pancakes.Step 7Combine 3 Tbsp. vinegar and remaining 3 Tbsp. soy sauce in a small bowl.Step 8Transfer pancakes to a platter. Top with reserved scallions and serve with dipping sauce alongside.How would you rate Quick Kimchi Pancakes?Leave a ReviewTell us what you thinkReviews (33)Back to TopTriangle*****Loved these! I like them crisp and thin as well, so, to the New York 5/21 grumpy naysayer (\"Look elsewhere...\"), have you never made breakfast pancakes in your entire life? You see, there's a viscosity issue that even the smallest urchin at the stove can figure out on his or her own, namely, how to thicken or thin the batter. Let's see, more liquid: gonna test to see if that thickens the batter? Oy! It's not rocket science. THANK YOU BA for this fun recipe. For my dipping sauce, I add a small dollop of sesame oil--just my preference. Shared these with my neighbor--rave reviews (I took all the credit ;-})Gibby MacMasterPrinceton, NJ1/10/2022My family and I loved this for lunch with some roasted spicy bok choy.CecileCarpenteria, CA8/27/2021I initially thought that the batter was too thick after step 2, in step 3, I added the kimchi and the brine that came with it after chopping. After that, the batter became less thick.AnonymousPhilippines8/18/2021Question - Could this be served chilled - Thinking backyard BBQ....a platter of Kimchi Pancakes as a vegetarian dish. Thoughts?AnonymousSeattle, WA7/29/2021My first kimchi pancake! The batter is just perfect. I thought it will be thick as what the other comments said but I followed the ingredients first to see if it's really thick and it was just perfect. I like them crispy so I fry them thinly. Not so much with the dipping sauce as the pancake itself is already tasty. My family loves it. I will surely make this again. Thank you!AnonymousMississauga, ON, Canada7/4/2021The proportions in this recipe are just off. Had to add more water and the batter was still too thick. Annoyed that BA recipes are not tested properly before publication yet it’s the first hit when googling kimchi pancake recipe. Look elsewhere…AnonymousNew York, NY5/21/2021Love because it's simple and delicious!! Would suggest to make for a fun but quick (and not messy) lunch!AnonymousHouston, TX3/27/2021I love these! I've made them twice in the past month. The dipping sauce(well, not really a sauce) is great and I usually eat the pancakes with a fried egg. I think these would taste really good with yakisoba sauce. vanessaUtah3/11/2021Wtf is with the grape seed and olive oil in white-adapted asian cooking. If youre trying to be healthy use avocado oil, but if youre feeling authentic eating asian food, use vegetable or canola oil, always top it off with sesame oil. No asian food ever really requires grape seed oil... Anonymous2/28/2021They were  absolutely lovely! It was the first time making them and will definitely make again. Some reviewers here are saying that they found the batter a bit too thick? As it was my first time making them I don't really know what they're supposed to be like but I thought they were delicious just as they were!AnonymousLincoln, UK 2/16/2021perfect for a hangover, I made way to many for one person and saved then (you can drop them in a toaster the next day) EmSitumhamilton1/12/2021Fast, easy, comforting, crispy, full of hidden veg and ingredients I always have around. Perfect pandemic/depression food, now that I think of it! I make this at least every couple weeks - like them extra thin for crispies, up the spice and skip the sauce -- I prefer a runny egg and put the whole thing on some jasmine rice. It's so good dude, just make this recipe. LaurenMinneapolis, MN12/18/2020Flavor was good but the batter is way too thick with this recipe.  They should be much thinner than what this recipe makes.  I didn’t even try other recipes based on the rating but pass on this.SamDC11/29/2020So good! Made this for breakfast and couldn’t get enough it, I would definitely make this again. Anonymous8/1/2020Love this recipe. I used 1Tbs of vinegar and 1 Tbs of soy sauce for the dipping sauce and that was more than adequate. Had this for dinner with rice and this was a good amount for 2 people.rookieAustralia7/30/2020Explore Bon AppétitPancakeKoreanEast AsianAsianQuickEasySideSnackDairy-FreeNut-FreeFryLunar New YearBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-12", "author": ["Condé Nast", "Lauren Schaefer"]}