{"id": "ea49b0e7af9908494a5ec2b860901a8f", "url": "https://www.bonappetit.com/story/what-are-curry-leaves", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "What are Curry Leaves, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCurry Leaves Are a South Indian Herb With Major Star PowerThere's simply no substitute for fresh curry leaves, and they're absolutely worth seeking out.By Simi GeorgeSeptember 22, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.As a South Indian I’m lost without my kariveppilai—Tamil for curry leaves. My family is from Kerala, a verdant state on India’s southwestern coast. Nothing we cook is complete without curry leaves, dessert being the only exception. We use them in fiery red fish curries and summery yogurt drinks, in brawny beef fry and slurpable rasam, in chutneys and in pickles. In this part of the world, food looks naked without curry leaves in it.  Below, everything you need to know in order to understand their significance and use them in your cooking at home.What are curry leaves? Native to India (and totally unrelated to curry powder) curry leaves are glossy, pointy, almond-shaped pinnate leaves with a complex citrus flavor often described as reminiscent of lemongrass, anise, and asafetida—but none of these comparisons do it justice. You have to taste and smell a curry leaf to grasp its essence. Known to have medicinal properties, they are used in other parts of Asia as well, including Sri Lanka and Malaysia. How do you use them? Curry leaves are generally used at the beginning of the cooking process or as a final flourish. Typically, they are combined with mustard seeds and coconut oil to form a bouquet of flavors. Pop a teaspoonful of mustard seeds in hot, shimmering coconut oil. Turn off the heat, add a handful of curry leaves and, if you like, a few dried red chilies and a touch of turmeric powder. This exquisitely aromatic oil serves as a flavor base to which other ingredients are added. In some dishes like dal, this tadka (or chhonk as it’s called in Hindi) is poured over the dish as a finishing touch. The flavor is the star, but the leaves are commonly picked out and pushed to the side of the plate rather than eaten. Curry leaves release the full depth of their aroma when fried and infused into oil, and are rarely called for as a raw garnish as they'd be bitter and chewy served that way. If you’re new to curry leaves, experiment boldly. Sauté them with potatoes. Elevate dal with the crunch and colors of a curry leaf tadka. Swirl it into dips. Bring popcorn alive with the verve of crushed, fried curry leaves. Add complexity to fried chicken. Give dahi toast a try. Where can I find curry leaves?A few things worth noting as you venture to explore the versatility of curry leaves: Curry leaf has a flavor all its own that’s near impossible to substitute. If you can’t get your hands on them, I’d advise to leave them out entirely. You’ll find them in South Asian grocery stores, and online from Amazon and Kalustyan's. Avoid parched, darkening, or wet-looking leaves and keep them away from heat and moisture whenever possible. I refrigerate them in resealable plastic bags, sandwiched between paper towels to maintain the ideal freshness and texture. They’ll stay good for about a week. In a pinch, you could use dried or frozen leaves, but neither is a real-deal fill-in for the the fresh variety.  Rani Fresh Curry Leaves 3oz$13 at AmazonAnd it is worth noting that while curry leaves are a huge part of South Indian cooking, they are not seen nearly as often in North Indian cuisine—the world of paneer, tandoori chicken, and naan that represents much of the food you'll find at Indian restaurants in the United States. That’s partly why they haven’t entered America’s culinary vocabulary in a meaningful way unlike, say, ghee or turmeric. Madhur Jaffrey, the grand dame of Indian cooking once said, “I keep hoping [curry leaves] will be the next lemongrass of America.” That was about twenty years ago. It's about time.All-Purpose Coconut CurryHere's a simple and versatile rich coconut curry to add to your meal prep rotation. This recipe makes enough sauce for three different dishes (Yellow Curry Chicken with Vegetables, Fish Curry, and Butternut Squash and Green Bean Stew).View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-22", "author": ["Condé Nast", "Simi George"]}