{"id": "ea54d129f6db21f4b7b7421ea72acb38", "url": "https://www.bonappetit.com/story/lin-manuel-miranda-favorite-latin-food", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "Lin-Manuel Miranda Thinks This Latin Drink Is the “Most Delicious Shit Ever” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLin-Manuel Miranda Thinks This Latin Drink Is the “Most Delicious Shit Ever”Growing up in Washington Heights, the ‘Hamilton’ star spent many days drinking this sweet, creamy beverage.By Alyse WhitneyNovember 23, 2018FacebookTwitterEmailPhotograph by Taylor HillFacebookTwitterEmailIn our series Hometown Hero, we ask stars to share their favorite nostalgic childhood dish—and the memories behind it.You already know Lin-Manuel Miranda as an award-winning composer, lyricist, playwright, rapper, and actor in Broadway’s In the Heights and Hamilton, but there’s one thing about the multihyphenate talent that his resume won’t tell you: his deep love for a morir soñando. When I chatted with Miranda about his favorite things to eat in Washington Heights, the upper Manhattan neighborhood he grew up in, the frothy, creamy Latin beverage made of fresh orange juice, evaporated milk, and sugar made up some of his strongest memories. “Morir soñando is my favorite Latin drink—it literally means ‘to die dreaming.’ It’s like a really rich, creamy Orange Julius and it’s the most delicious shit ever,” he said.“I can’t have it as much as I used to because I don’t have my twenty-something metabolism anymore,” he added with a laugh. “It’s fattening, but it’s a delicious indulgence.” But when he allows himself, he’ll get it from a Caridad—a Latin café, like El Nuevo Caridad) in the Heights—alongside a strong coffee and a crispy “ham and cheese sandwich that they cook with that toaster that looks like a flatiron.” He isn’t picky about which Caridad he goes to, he just wants to continue supporting immigrant-owned restaurants, especially on Small Business Saturday, this year on November 24.Here’s a recipe for morir soñando.\nPhoto by Chelsea Kyle, Food Styling by Katherine SacksAnother of his family’s neighborhood favorite’s is the classic Dominican breakfast staple mangú, a mix of green plantains mashed with olive oil, and salt. “It’s so thick, you could caulk a house with it, but it’s so delicious. You eat that for breakfast with onions and a fried egg on top, and then you don’t have to eat another meal for the rest of the day.” Caridad has a good verison, he says, but his family also went to 809 for a heaping plate, knowing full-well that their appetites would be sated after that.Miranda can’t recall the first time he tried any of these Latin specialties, but they’ve remained a constant in his life. “I don’t remember being introduced to it. It was just always around,” he said. “For most of performing Hamilton, I was all the way uptown in Inwood. I was very close to my ham and cheese sandwiches, coffee, and morir soñando. They never went far.”Explore Bon AppétitCelebritiesLatin AmericanOrangeRead MorecultureRob Corddry Ate This Italian Sandwich Every Week for DecadesBy Alyse WhitneycultureTig Notaro Loves These Po'Boys So Much She Served Them at Her WeddingBy Alyse WhitneycultureCecily Strong on the Childhood Dish That Changed EverythingBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-23", "author": ["Condé Nast", "Alyse Whitney"]}