{"id": "ea542714bf0385d68a32f59552a87962", "url": "https://www.bonappetit.com/story/how-to-drink-yerba-mate", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "How to Drink Yerba Mate Like a Pro | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Make and Drink the Perfect Cup of Yerba MateWe asked the owners of Porteñas, New York's first yerba mate bar, how to do mate like a pro.By Aliza AbarbanelFebruary 15, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailOn a snowy stretch of Williamsburg dominated by brick-walled coffee shops, Porteñas is a shock of gold and green. Leaf-patterned cushions cover cafe chairs, houseplants perch on shelves, and even the stout slabs of poppy seed cake nestled inside the pastry case are suspiciously moss-colored. It's not just aesthetics—it's a proper salute to yerba mate.The caffeinated tea is South America’s lifeblood. First cultivated by the indigenous Guaraní people in pre-Columbian Paraguay, the yerba mate leaf, along with its traditional brewing practices and drinking rituals, is a fixture of social gatherings across the continent. But uninitiated Americans are more likely to grab a Venti latte to-go than sit and sip the bracing, bitter wash of tannins. Porteñas owners Carmen Ferreyra, Gretel Pellegrini, and Fernanda Tabares are aiming to change that.The bar at Porteñas serves up empanadas, juices, and, yes, plenty of mate.\nPhoto by Emma Fishman“When you drink coffee for the first time, you don’t drink it black because, if you do, you don’t drink it ever again,” Ferreyra says, laughing. That's why Tabares, the chef at Porteñas, is using yerba mate in less traditional ways, like herbal mate blends, “matteccinos,” and mate-spiked juices. Tabaraes even uses an imported mate concentrate on her glitter-dusted empanadas and in her crème brûlée, and, yes, to punch up that poppy-seed cake.New-school ways to consume mate abound, but Porteñas hopes people will discover the pleasure of drinking mate the traditional way too. That means sipping from a wooden gourd using a straw called a bombilla. This can requires a bit of finesse because the loose-leaf tea can clog the filter if you don't hold the bombilla right. So the cafe stocks glass gourds with filters that separate the tea from the straw, to ease the learning curve. Those are available for purchase, along with the traditional wooden variety, online and in the cafe—but if you're looking to master the traditional technique, practice makes perfect. Here, Ferreyra walks us through it.Fact: Chocolate bombónes are the perfect mate chaser.\nPhoto by Emma FishmanFirst, you need to put dry yerba mate inside the gourd and shake to dislodge any dust. Then you add hot water—take the kettle off before it boils to avoid burning the tea—and insert the bombilla at a 45° angle. Water should be poured slowly—if it’s poured too fast, the tea will separate and steep unevenly. Pros looking to elongate the experience will steep the tea a little bit at a time (instead of flooding the whole gourd at once) so you can sit and sip as long as possible. After all, drinking yerba mate is a social activity. You sit and gossip and pass the gourd to your right until an entire liter of hot water has been used up. Every group has a “leader” who is in charge of adding more water, and you can gracefully bow out of the next round with simple gracias.This rotation is part of yerba mate’s ritual, and it also distributes the caffeine. (It would not be advised to consume a liter of mate on your own.) The first sip is the most bitter, and the flavor mellows over time as the tea is diluted. It’s a wonderful way to pass an hour. If you're in a rush, you can still pick up a creamy mate latte or espresso-spiked mate on your way to the train, but, at a time when most coffee shops specialize in attracting anti-social, laptop-wielding freelancers or churning out to-go orders, the owners of Porteñas are hoping people will linger.“Mate is a tradition that you share with friends and family, and that’s what we wanted to create,” says Ferreyra. On the opening weekend, she says, five groups of friends squeezed into the space. They caught up and laughed, then did something Ferreyra found surprising: They passed the gourd. \"It was a total surprise for us because we thought nobody would share and they ended up doing just that,\" she laughs. Cleary, Brooklyn's mate culture is brewing.Explore Bon AppétitArgentineTrendsHealthyishBrooklynRestaurantsNew YorkRead MoreLifestylePulled Tea Is the Party-Trick Drink You Can Totally Make at HomeBy Natalie PattilloRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-15", "author": ["Condé Nast", "Aliza Abarbanel"]}