{"id": "ea63c2d2d256793805de068678184190", "url": "https://www.bonappetit.com/story/no-brainer-corn-salad", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "The No-Brainer Corn Salad We’re Eating All Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe No-Brainer Corn Salad We’re Eating All SummerYou don’t need a recipe, just plenty of fresh corn and a few great mix-ins.By Aliza AbarbanelJune 21, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailDespite what those calendar alerts and zodiac apps would have you believe, the summer solstice is not the first “official” day of summer. That glorious occasion is marked by the first corn salad of the season, at least in our book.Our reasoning is simple: Corn salads are a summer classic. The jumble of sweet corn, crisp herbs, and lime-y dressing always feels sunny and bright. But that doesn’t mean we’re making the exact same recipe on repeat through Labor Day. That would get old. Instead, senior food editor Andy Baraghani developed a flexible, patent-pending formula: 6 ears charred corn + ½ cup toasted nuts + 1 cup fresh herbs + 3 oz. crumbly cheese + ⅓ cup fresh citrus juice or vinegar.Start by grilling your corn over medium-high heat until a good amount of char develops, but keep the husks on to keep the kernels protected and moist. Wait a few minutes before shucking so you don’t burn your fingers, then cut the kernels into a big bowl along with your chosen mix-ins. The idea is to riff with whatever you have on hand, whether you’re cooking in a vacation house with a limited pantry or working with a major farmers’ market haul. Just make sure you hit all of these categories:The NutsWe like pistachios, peanuts, and hazelnuts best, but any nut will do. We like them deeply toasted for maximum nutty flavor.The HeatCorn salad needs a bit of heat to play off the sweet and salty. Pack a punch with a thinly sliced serrano chile, or keep it mild with crushed red pepper flakes or black pepper.The CheeseSlightly salty, crumbly cheese like Cotija, Parmesan, or feta holds together without dissolving or getting weird.The HerbsAdd freshness with torn tender-stemmed cilantro, basil, or mint.The AcidLime is a classic choice, but lemons, sour oranges, or even rice vinegar will do the job. Use whatever’s in your fridge, but don’t skip this step. Like a catchy summer bop, a bit of acidity brings sweet summer corn to life.Get the recipe:No-Brainer Corn SaladSweet summer corn begs to be mixed with a splash of acid, a touch of heat, salty cheese, and toasty nuts for texture.View RecipeExplore Bon AppétitHealthyishCornSaladSummer SidesRead MoreLifestyleThis Sweet and Spicy Grilled Squash Goes Out to All the Vegetarians at the BarbecueBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-21", "author": ["Condé Nast", "Aliza Abarbanel"]}