{"id": "ea6e807a43c325fccf631ddc5d583ef4", "url": "https://www.bonappetit.com/story/georgian-pkhali", "year": 2021.0, "month": 2.0, "day": 1.0, "content": "Make Georgian Pkhali From Any Vegetable That's Past Its Prime | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTurn Your Confounding Produce Into Gorgeous Georgian PkhaliSome people think of them as vegetable pâtés or dips; I think of them as smearable salads.By Benjamin KemperFebruary 2, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Micah MortonFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.When Georgians feast, they go all out. Slabs of meat sizzle over grapevine embers, cheese breads ooze by the dozen, and soup dumplings arrive by the hot, slurpy vatful. But when I’m lucky enough to be at a Georgian supra (traditional feast), it’s never the mtsvadi, khachapuri, or khinkali that I lurch for first but rather the sleeper-hit vegetable spreads hiding at the end of the table: Pass the pkhali, please. What is pkhali?Pkhali (ფხალი) is what Georgians call any cooked vegetable pounded with walnuts, garlic, and spices. Some people translate pkhali as “vegetable pâté,” but I think of it as a spreadable salad. It’s pungent and colorful—fuchsia when made with beets, bright green when starring spinach. Eggplant, carrots, squash, beans, and sorrel are also common protagonists, but you can use whatever produce you have on hand, even if it’s past its prime—no one will be the wiser since it’s getting banged up anyway. You can dress pkhali up—in the Before Times I’d nudge it into dainty marquises, bopping each with pomegranate seeds for an eye-popping starter or vegan charcuterie board item—or just spoon it onto warm bread and eat it hunched over the sink.Everything I know about pkhali I owe to chef Meriko Gubeladze. You could call her Georgia’s pkhali queen: At her candlelit restaurant, Shavi Lomi, in Tbilisi, the nation’s capital, diners huddle around big wooden bowls brimming with pkhali. They take turns scooping the vibrant spreads onto griddled corn cakes called mchadi, pkhali’s traditional sidekick, between bites of squeaky guda cheese and pickled bladderwort buds (jonjoli). I’ve spent months in Georgia eating my way from the Black Sea coast to the Azerbaijani border, and few dishes have blown my mind like Shavi Lomi’s pkhali plate.That’s because Gubeladze’s family has been making the dish for generations. “Pkhali reminds me of my grandma,” she said. Growing up, her grandmother would sit in the sun kneading mountains of herbs and boiled greens for pkhali until they were fragrant and tender. “It was always poor-people food, what you ate during Lent or when you couldn’t afford meat,” Gubeladze said. “People would collect whatever edible weeds they could find and make a meal out of them by adding a paste of walnuts or hazelnuts.” Beets and carrots, other popular pkhali ingredients, likely found their way into the dish in the Soviet era as they were plentiful and cheap due to industrialized farming.And how do you make it?To make pkhali, Gubeladze starts with 2 cups cooked vegetables, cooled and squeezed of excess moisture. These should be grated, chopped coarse, or mushed up with your hands, depending on the type of vegetable and how you like it cooked. Most Georgians boil their pkhali veggies till just soft (5 minutes for spinach, longer for hardy greens like beet tops and chard), but Gubeladze favors the oven for beets (400º for 50–60 minutes, wrapped in foil), leeks (325º for 20 minutes), eggplant (20–30 minutes under the broiler, then scooped from the skin), and carrots and squash (400º for 25 minutes for either).This is a good opportunity to use your blanched and squeezed greens.\nPhoto by Laura Murray, food styling by Susie TheodorouTo make the dressing, grind ½ cup (50 grams) walnuts (be sure they’re fresh and of good quality) to the consistency of coarse sand using a meat grinder (what Georgians use), mortar and pestle, or food processor, and transfer the nuts to a medium bowl. Stir in 1 tsp. salt, 1½ Tbsp. red wine vinegar or pomegranate juice, 2 tsp. ground coriander, 1 minced garlic clove, crushed red pepper flakes (to taste), ¼ cup chopped cilantro, and 2 Tbsp. finely chopped scallion or white onion. Incorporate 1–2 Tbsp. water to form a thick, sludgy sauce (the “WAP” lyric “make it cream, make me scream” springs to mind).Add the vegetables to the dressing and mix everything well with your hands, adding water as needed to form a thick, moldable paste. Taste for seasoning: The pkhali should be zippy with plenty of vinegar, salt, and garlic. Roll the mixture into single-serving balls or patties, or mound it onto a large serving plate. Feeling lavish? Trace a crosshatch pattern across the top with a fork and sprinkle all over with pomegranate seeds and walnut oil. Pkhali should be served at a cool room temperature and tastes best the day it’s made.In the rare case I am stuck with leftovers, I’m blasphemously un-Georgian with them. I like to spoon pkhali over polenta, swirl it onto sandwiches, and toss it with cold pasta for bracingly fresh salads. Until I’m back in Georgia, back at that bountiful supra table, these small thrills will have to suffice.Benjamin Kemper is a freelance food and travel writer based in Madrid, Spain.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-02", "author": ["Condé Nast", "Benjamin Kemper"]}