{"id": "ea71b930dbaa25727cc68c84bba4d5f6", "url": "https://www.bonappetit.com/story/cashew-cream-meal-prep", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "This Vegan Cashew Cream Is My Idea of Meal Prep | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Vegan Cashew Cream Is My Idea of Meal PrepIt’s rich, creamy, and the jumping-off point for all kinds of weeknight dishes.By Hetty McKinnonSeptember 5, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanFacebookTwitterEmailMeal prepping means different things to different people. For some, it’s all about batch cooking, preparing a variety of meals in one go which are then pragmatically portioned into containers for the fridge or freezer. Others are make-ahead cooks, opting for supersized meals that can be kept in the fridge and enjoyed for days on end—think lasagna, curries, braises, ragùs and soups.And then there are people like me, for whom meal prepping doesn’t come naturally. I’m the kind of eater who never wants to eat the same meal twice. But I’ve found that, with a family of five like-minded eaters to feed, there is always some degree of prepping and planning needed to get us through the week. The most effective form of meal prep for me is more piecemeal, cobbling together fun elements that will make future meals easier, quicker, and, most important, more delicious.This is why I am so enamored with this cashew cream recipe—it is a sub-recipe of sorts that can be used over and over again in many different ways to create vastly different meals. It’s so much more than a mere dairy-replacement for vegans; I would argue that it contributes more to a dish than, say, sour cream or yogurt, bringing a silky texture, nutty overtones, and depth of flavor that is unrivaled. Think of it as your mother sauce, which can be manipulated according to your needs and applied as a salad dressing, a creamy boost in soups, or as a silky sauce for noodles or pasta. The idea for this cashew cream–powered meal prep is simple: Whip up a large batch of cashew cream at the start of the week, and you’ve got meal options for days.Broccoli and Cashew Cream SoupUnintentionally vegan but very easy to love—this simple and tasty broccoli soup belongs in your weeknight dinner rotation.View RecipeOne great option is this creamy broccoli soup, a midweek favorite in our house. It starts off with a simple base of broccoli, leeks, and fennel seeds—an appealing enough combo on its own, but not yet spectacular. That’s where the cashew cream comes in. It totally transforms the dish, adding body, a hint of sweetness, and, more important, richness. The resulting soup is supple and velvety and offers a complexity that belies the fact it took just about 20 minutes to pull together. Cashew cream can easily be used to amp up other puréed vegetable soups too—try it with cauliflower, mushrooms, sweet potatoes, or butternut squash.Roasted Carrots and Chickpeas With Herby Cashew CreamCarrots and chickpeas rise to stardom with the help of a bright, herb-spiked cashew cream and added crunch from toasty almonds.View RecipeOn the fresher side of the spectrum, cashew cream can be utilized as the base for a salad dressing-slash-sauce. Adding a few handfuls of herbs to the blender along with the cashews delivers a sunny, botanical edge, not to mention a vibrant hue. I’ve used dill and parsley in my green cashew cream, but you could use other herbs too—cilantro, mint, chives, and basil could all be used either independently or together. Any version of this herbal cashew cream will go great with this roasted carrot salad, but you can also use it to top grain bowls, as a sandwich spread, or as a dip for crudités. I’m a big fan of dip-for-dinner: Set out some cashew cream, raw or roasted veggies, boiled eggs, some pickles, a few nuts, and some fresh sourdough and you’re good to go.Creamy Cashew Udon With Crispy MushroomsCashew cream works even better than its dairy alternative in this ultra-rich and umami-packed udon noodle dish.View RecipeBut my favorite application for cashew cream has got to be these creamy udon noodles. Here, the cashew cream becomes a uniquely satiny sauce for chubby noodles—unequivocally rich, but also somehow weightless, almost cloudlike. Golden mushrooms add savoriness and lots of textural moments, reminiscent of an udon dish I first experienced in Tokyo. The soy and black vinegar topping adds swagger, a confident assertiveness which delivers punch with every mouthful.And while the savory applications for this cashew cream are endless, it can also be used for sweet moments as well. (Just remember to omit the garlic and salt when preparing!) It’s great at breakfast time with fresh fruit glazed with honey or maple syrup, combined with cocoa and dark chocolate for a rich chocolaty pudding, or dolloped onto pancakes or waffles.I know that a big batch of cashew cream may not be everyone’s answer to meal prepping, but for palates like mine that are always demanding something new, it offers an outstanding weeknight shortcut that will make future meals more effortless and delicious.Get the recipe:Cashew CreamVegan or not, this smooth and savory cream is the condiment, sauce, and dressing we want on everything.View RecipeExplore Bon AppétitcookingMeal PrepRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-05", "author": ["Condé Nast", "Hetty Mckinnon"]}