{"id": "ea74efdc41d845da09465b3b9480d08d", "url": "https://www.bonappetit.com/story/what-is-half-and-half", "year": 2018.0, "month": 8.0, "day": 5.0, "content": "What Is Half-and-Half, Anyway? And What to Do When You Don’t Have Any | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Half-and-Half, Anyway? And What to Do When You Don’t Have AnyYou've probably been putting it in your coffee for years without knowing the full story.By Alyse WhitneyAugust 29, 2018FacebookTwitterEmailFacebookTwitterEmailUp until a few days ago, the following question had never crossed my mind: \"What is half-and-half, anyway?\" Even though I've used a splash or two of the stuff in my morning cold brew for at least a decade, I never really gave it a second thought. But then I ran out of it, and Trader Joe’s didn’t have it in stock when I went shopping, and I had to DIY half-and-half by combining equal parts milk and cream. Because, well, that’s exactly what it is.Yep. It’s that simple. Half whole milk, half heavy cream. Boom: half-and-half! (When you type the word \"half\" enough, it looks like it's not a real word. It is. Your eyes are deceiving you.) The texture is thicker and more luscious than milk, but less decadent and rich than cream. It’s the perfect middle ground, probably what Goldilocks prefers in her coffee.Your first interaction with half-and-half was probably those tiny cups that get tossed on the table at diners, fast food joints, and other less-than-fancy places. One or two of them does the trick to make even the cheapest, most burnt coffee taste better—or, at the very least, creamier. Because half-and-half is usually homogenized (which is to say, blended together before you buy it), it won't usually separate and go weird when you pour it into coffee. However, if you're cooking with it, you have to use a little finesse. You can't just grab the carton straight from the fridge and pour it into something simmering on the stove—a temperature change like that will cause it to break and curdle, and there's no saving it after that.To get this creamy vodka sauce, make sure to temper your half-and-half in the tomato sauce!\nSo, when you're introducing half-and-half into a hot sauce—like you do when you're making our easy vodka sauce—you have to make sure to temper it. That means pouring some of the hot, boiling liquid into a bowl, adding the half-and-half to that bowl, then slowly whisking your now-warm half-and-half mixture into the rest of that sauce. It should all blend together seamlessly into a creamy, luxurious sauce. You can also use it to make the custard for quiche or desserts like panna cotta, luscious mashed potatoes, or in creamy drinks like French sodas (like liquid creamsicles!), if you’re into that. The cool thing about half-and-half is how versatile it is: You can use it to add richness to recipes that otherwise call for plain ol' whole milk, and use it to lighten recipes that call for heavy cream ever so slightly. Again: Goldilocks.If you don’t have half-and-half, do as I did and just pour equal parts milk and cream into a jar, shake it a bit—unlike cream, it will never turn into whipped cream or butter, no matter how hard you shake it!—and put it in the fridge. It may separate a little bit in your coffee because it hasn't been homogenized by a machine, but it wasn't noticeable when I did a side-by-side taste test before writing this article.The only thing to watch out for when buying half-and-half is to never be tempted by the fat-free version. In spite of its name, fat-free half-and-half is just milk that's been thickened with additives like corn syrup. It looks the same on the shelf, but tastes completely different: artificial, not creamy like melted ice cream, but creamy in a melted shaving cream way. Avoid at all costs! You’re better off using skim milk (coffee’s greatest enemy, IMHO) or an alt-nut milk rather than fake half-and-half. Non-dairy flavored creamers are in the same boat, usually: no real cream. And definitely don't use hazelnut creamer in your vodka sauce. You’d have to be nuts to do that. (SORRY!)Go buy and/or make some half-and-half, because it's banana pudding time:Caramelized Banana PuddingThe classic we all know and love—but better.View RecipeExplore Bon AppétitCreamMilkDairyBasicallyRead MoreRigatoni with Easy Vodka SaucecookingThis Ricotta Panna Cotta Is As Smooth and Airy As a Summer CloudBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-29", "author": ["Condé Nast", "Alyse Whitney"]}