{"id": "ea741d68ba2289629468fe2d9c3ce29a", "url": "https://www.bonappetit.com/story/doctor-up-canned-tomatoes", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "How 6 Chefs Doctor Up Canned Tomatoes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow 6 Chefs Doctor Up Canned TomatoesUse the pantry staple to make everything from an easy salsa fresca to a creamy—yet vegan!—tomato soup.By Alyse WhitneyMarch 14, 2018FacebookTwitterEmailFacebookTwitterEmailIt’s not always easy to get beautiful, ripe tomatoes that taste as if they were picked on a warm August morning. Which is why, for at least 75 percent of the year, we rely on canned tomatoes—which can often be better tasting than the fresh ones. But when you know an ingredient so well, sometimes you get stuck in a rut of making the same thing all the time. Crushing them for sauce (without getting your shirt dirty!) or a basic tomato soup are reliable options, but we know you can do better.We took inspiration from six chefs on how they’d doctor up a can of whole peeled tomatoes, and they got creative. Make sure to buy high-quality tomatoes for best results—we like the San Marzano brand ($10 on Amazon) or La Bella San Marzano ($29 for 6 cans on Amazon). Read on to find out how to make roasted tomato jam for easy party bruschetta, 7-ingredient shortcut Tikka Masala sauce, and more ideas equally well-suited for a weeknight as a dinner party.Roasted Tomato Jam“Need a quick appetizer for a party? Make roasted tomato jam. Chop 2 cloves of garlic and 1 shallot as fine as possible, and then combine with 1 Tbsp. sugar and 2 Tbsp. sherry vinegar, and 1 can whole peeled tomatoes in a shallow roasting tray. Cook in a 300° oven for about 30 minutes, or until it caramelized on top. Tomatoes are ready when all liquid appears to be reduced. Throw in a ½ cup parsley and 1 Tbsp. fresh oregano leaves after it cooks, and serve with canned sardines, white anchovies, jamón, or prosciutto and toast.” —Rachael Polhill, executive chef at Dante in NYCPumpkin Salsa Fresca“Drain a can of whole, peeled tomatoes, chop them up, and mix with 1 cup chopped cilantro (no stems), ½ cup diced red onion, 2 roasted and finely chopped serrano peppers, and 2 Tbsp. lemon juice. Salt and pepper to taste, and then mix in some toasted and ground pepitas for a delicious pumpkin salsa fresca. Serve with tortilla chips.” —Chef Vicente Sosa, executive chef at Que Bueno Suerte in DenverCreamy Vegan Tomato Soup“You can make super simple tomato soup with four ingredients. Sweat out 2 cloves of garlic and half a chopped small onion with a good amount of chile flakes—as gutsy as you can be—in olive oil. Add a can of whole peeled tomatoes and cook 10 minutes max. Blend it with another ½ cup of oil and you’ll get a really intense, creamy amazing soup without any added dairy—it’s vegan! You’ll see the color change from dark red to bright orange, and that’s when you’ll know you’ve really emulsified the fat into it.” —Colin Lynch, executive chef and co-owner of Bar Mezzana in BostonQuick Tikka Masala Sauce“My quick Tikka Masala sauce only uses seven ingredients. To make it, melt a stick of butter and add 2 Tbsp. Tandoori Masala seasoning mix (I like Shan brand, $2 on Amazon) and 2 Tbsp. dried Fenugreek leaves. Sauté until aromatic, add 1 can puréed whole peeled tomatoes, and bring to a simmer. Then add ½ cup heavy cream, 2 Tbsp. honey, and salt to taste, and simmer for 5 minutes. Serve with protein of your choice (like chicken), rice, and naan.” —Maneet Chauhan, chef and owner of Chauhan Ale and Masala House in NashvilleSuper Garlicky Tomato Sauce“One of the easiest ways to doctor up a can of tomatoes is to make ‘TBG’ (Tomato Basil Garlic) sauce. Drain the liquid from the whole tomatoes, tear them in half and remove the seeds, then coarsely chop. Take a lot of peeled garlic cloves—I like to use a full head, so at least 12 cloves—and slice as thin as you can; “Goodfellas thin.” (A Japanese mandoline makes this incredibly easy.)  Add 1 cup of extra virgin olive oil and the “Goodfellas garlic” to a large (3–4 qt) heavy-bottomed pot over medium-low heat. Once the garlic is extremely aromatic and begins to soften, add the chopped tomatoes and about 1 cup of the reserved tomato liquid. Simmer over medium-low heat for about 20 minutes then add a whole stalk of basil. Remove the pot from the heat, and adjust the texture of the sauce to your liking by adding a little more tomato juice to thin. Pull the basil out after about 5 minutes so it doesn’t turn brown and the sauce retains a fresh herb flavor. Serve with pasta.” —Chef Ryan Prentiss, executive chef at Prime + Proper in DetroitAsian-Inspired Baked Eggs“I make my family’s favorite breakfast with a can of tomatoes: Asian-inspired baked eggs. While you’re gathering your ingredients, roast 1 shallot in the oven, skin on, for 12 minutes at 350° and then let cool before peeling. Meanwhile, sauté 2 Tbsp. chopped cilantro stems and 2 cloves thinly-sliced garlic until aromatic with a few tablespoons of neutral oil. Add 1 can whole peeled tomatoes, 2 Tbsp. chipotle peppers in adobo, and the crushed roasted shallot, and then cook for 20 minutes. Add 4 Tbsp. soy sauce and cook for 10 more minutes. It should be slightly reduced and rich. Spoon 1–2 cups in a mini cast-iron skillet and crack an egg on top—or do a few eggs in a larger skillet—and bake at 350° for 4–6 minutes, or until egg is just set. Use toast for dipping!” —Chef Louis Tikaram, executive chef at E.P. & L.P. in Los AngelesThis butter-roasted tomato sauce also goes well with pasta:Explore Bon AppétitChefsTomatoRead MorecultureHow 5 Chefs Doctor Up Their Scrambled EggsBy Alex Delanyculture5 Pastry Chefs on How to Doctor Up Boxed Brownie MixBy Alex Beggsculture5 Chefs on How They'd Doctor Up Frozen PizzaBy Alex BeggscookingCanned Tomatoes Are Better Than Fresh Ones (Yeah, We Said It)By Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-14", "author": ["Condé Nast", "Alyse Whitney"]}