{"id": "eaa69e32ac9365bf4e5d6bd9c1f1e63c", "url": "https://www.bonappetit.com/story/this-is-my-non-alcoholic-drink-of-the-summer", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "This Drinking Vinegar Is My Non-Alcoholic Drink of the Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Is My Non-Alcoholic Drink of the SummerThis turmeric shrub is like eating spears of sunny-sweet pineapple on a balmy beach. Just don't call it a mocktail.By Christina ChaeyJune 3, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!Although I'm hardly what anyone would call “sober-curious,” I have little desire to imbibe after a long weekend of drinking. So when I get home from work during the week, I like to fix myself a tonic with Element Pineapple-Turmeric Shrub, which gives me all the satisfaction of a cocktail, minus the booze.Shrub is vinegar that’s been infused with ripe fruit and sugar, resulting in a tart-sweet syrup that adds tangy complexity to a cocktail, or in the case of my weeknight routine, good plain seltzer. This heady, golden-hued one by Element is like eating spears of sunny-sweet pineapple on a balmy beach. The addition of turmeric lends a subtle grounding flavor that, along with the acidic vinegar, makes for a perfectly balanced drink. It’s potent stuff—all you need is a tablespoon or two mixed into a glass of seltzer on ice for a gulpable fruit drink.I’ve recently turned my roommate onto the stuff, too. Recently, we’ve gotten into the habit of making it nice for ourselves by breaking out proper rocks glasses and the fancy two-inch square ice cubes we keep in the freezer. One thing we definitely don’t do? Call it a “mocktail.”— Christina Chaey, associate editorBuy it: Element Pineapple Turmeric Shrub, $15 for 8 oz.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItNonalcoholicShoppingRead MoreLifestyleThis Jarred Sauce Changed Our Grain Bowls For GoodBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-03", "author": ["Condé Nast", "Christina Chaey"]}