{"id": "eab65e25d689feca4879f0cb2bf0c900", "url": "https://www.bonappetit.com/recipe/pretzel-and-potato-chip-moon-pies", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Pretzel and Potato Chip Moon Pies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssuePretzel and Potato Chip Moon PiesBy Sohla El-WayllyDecember 1, 20204.6(76)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Sue LiEmailPinterestPrintEmailPinterestPrint“Little Debbie’s chocolate marshmallow pies were my favorite packaged treat as a kid,” says Sohla El-Waylly. “I’d carefully separate the layers with a butter knife, toast the marshmallow on a fork over the gas burner, then sandwich it all back together. Even as a kid I knew that desserts are better with a bit of extra-toasty flavor. That’s why I’m obsessed with these all-grown-up moon pies. The shortbread cookies are loaded with blitzed-up pretzels (for that extra toastiness) and salty potato chips—the perfect contrast to the sticky-sweet marshmallows and half-dip of bitter dark chocolate.” The dough will look dry at first, but it will come together with a bit of kneading. Don’t worry about overworking it—with all that butter and the fat from the potato chips, there isn’t much opportunity for gluten to develop.Ingredients1cup (2 sticks) chilled unsalted butter, cut into ½\" pieces1cup lightly crushed small pretzels1cup lightly crushed potato chips½cup (100 g) sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt1¾cups (219 g) all-purpose flour, plus more for dusting18large marshmallows4oz. semisweet or bittersweet chocolate chips, bars, or wafers (disks, pistoles, fèves), coarsely chopped2Tbsp. refined coconut oilPretzel salt or flaky sea saltSpecial equipmentA 2\"-diameter cookie cutterPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Pulse butter, pretzels, potato chips, sugar, salt, and 1¾ cups (219 g) flour in a food processor until clumps form. Turn dough out onto a surface and knead gently to bring together.Step 2Roll out dough on a lightly floured sheet of parchment to just under ¼\" thick. (If it feels very soft, cover and chill 20 minutes before proceeding.) Punch out rounds with lightly floured cutter. Transfer rounds to a parchment-lined baking sheet, spacing 1\" apart. Gather dough scraps and repeat rolling and cutting process until no dough remains (you should get 36 rounds). Divide remaining cookies between 2 more parchment-lined baking sheets.Step 3Working in batches, bake cookies, rotating baking sheets top to bottom and front to back halfway through, until golden brown, 10–12 minutes. Let cool 5 minutes on baking sheet, then transfer half of the cookies to a wire rack. Let cool completely.Step 4Meanwhile, turn over cookies remaining on baking sheets and top each with a marshmallow, flat side down (make sure marshmallows stand up evenly or sandwiches will be crooked). If your oven has a convection fan, turn it off and bake cookies until marshmallows are softened and beginning to puff but not brown, about 4 minutes. Remove from oven and top with cooled cookies, letting weight of cookies gently push marshmallows to the edges. Let cool at least 1 hour.Step 5Melt chocolate and oil in a small heatproof bowl set over a small saucepan of barely simmering water (do not let bowl touch water), stirring occasionally, or melt in a small microwave-safe bowl in a microwave in 20-second bursts, stirring between bursts. Dip half of each sandwich cookie in chocolate, then sprinkle top of chocolate sides with pretzel salt. Chill cookies 15 minutes to harden chocolate before serving.Do ahead: Cookies can be made 2 weeks ahead. Store airtight at room temperature.How would you rate Pretzel and Potato Chip Moon Pies?Leave a ReviewTell us what you thinkReviews (25)Back to TopTriangleGreat recipe total hit at a full moon party with everyone asking about the shortbread! I made these vegan with earth balance butter. I left my shortbreads in for 15 minutes and the first batch got a bit burnt. I learned my lesson though for the second one and kept a closer eye on the bottoms. I used vegan marshmallows and I wish I let them melt longer (I did 4 minutes, and didn't want my shortbread to burn more so I took them out). These marshmallows didn't really melt or bubble on the outside, it behaved like a stale marshmallow so I applied pressure on the biscuit that went on top. ... I used vegan chocolate chips and 1 tbsp of coco oil which worked well. I used seas salt, but the sea salt kind of sunk in/melted. JonToronto, ON7/24/2021These were a MAJOR hit!! A few tips based on reviews and my experience making two batches of these:\n\n1. Crumble your chips and pretzels first, then measure 1 cup of each.  I crushed everything down to 1/2 inch pieces, if not smaller, in a large ziplock bag.\n\n2. Continue to pulse the ingredients until it really starts to come together. As noted, since there isn't a lot of flour, you don't need to worry about overworking these.  Once you turn it onto the counter, use the heat of your hands to press the mixture into a round disk.  Don't be afraid to just get in there!  \n\n3. I put the dough on parchment, lightly floured the top and rolled it out. Once I cut the disks and put them on a parchment-lined sheet, I did chill the dough for about 10 minutes before baking.\n\n4. I baked mine much closer to 15-18 minutes until I could see the edges were lightly browned. I allowed them to cool completely and found no issues removing them from the parchment.\n\n5. Both batches I made yielded 20 moon pies (40 individual cookies)\n\n6. I made homemade marshmallow and therefore didn't deal with the re-heating steps.\n\n7. I found the chocolate mixture to be too oily; next time I will do 4 oz chocolate and 1 Tbsp coconut oil. Also, I used unrefined coconut oil because I like the slightly coconut taste and, frankly, it's better than refined. \n\n8. One final tip: After you sandwich the cookies, put them in the freezer to cool. Once you dip them in the chocolate, it sets up a bit quicker and produces a cleaner-looking moon pie. I worked in batches of 4... dip 4 moon pies, sprinkle 4 with salt, repeat. Oh, and I used Morton's coarse sea salt and it worked perfectly. Maldon salt flakes would also be perfect! Enjoy!Starz7369Dallas, TX3/22/2021These were delicious!!!Lfairbanks56412/26/2020These are PHENOMENAL! What a decadent treat! To reiterate what others have said, the dough is very crumbly, but stick with it and knead until it comes together. Regarding the chocolate, I chilled mine in the fridge while still on the cooling rack, and they released from that just fine! I didn’t have coconut oil to my surprise, so I substituted ghee instead (about 1.5 Tbsp rather than 2) and it worked great.AlyssaShirley, IL12/25/2020So I just made these and they are in fact delicious and I would make them again. The dough IS crimbly so forget \"knead gently\", just get in there. It DOES look pale after 10 min, so I gave it some extra time and also half of them go back in to melt the marshmallows (and four min is perfect). HOWEVER. The chocolate part is disappoiting. After dipping, I chilled them but (there's no instructions about how - on parchment? ) and then they stuck to the pan. I let them warm up a bit before trying to move them ...and it went right to melted chocolate that comes off on your fingers. Does not work for a cookie. Some of them both broke off (the bottompart with chocolate) AND melted. Some guidance about this would be good.  They were perfet before this. I would suggest only dipping the tops, not the sides. I also ended up with one unfinished one (no top) which I ate; I'd cut them smaller than 2 in next time. R HartNYC12/24/2020My daughter and I decided to do some cookie baking for the holidays even though it will just be us.  She insisted we make these cookies even though I hate marshmallow. They looked too fussy to make and I just thought the combinations were weird.  So, so glad I listened to her.  We found these really easy to make.  It took time, but what good product doesn't.  When I measured the chips and pretzels, I crushed them first as per the recipe and then measured, although I would  love weights instead of measurements.  We got 19 cookies and several others that I didn't sandwich since I really do hate marshmallows.  These cookies are delicious even without dipping in the chocolate. I would even make these thicker and just dip in chocolate with the marshmallows, but my daughter says no. Highly recommend and we had absolutely no problem with the dough being crumbly.  We will make these again for sure.  Great job Sohla. Miss you.Cathy CardamoneCape Cod12/22/2020Made these over the weekend and they were delicious! Followed the recipe mostly exact (notes below). Be sure to refrigerate them thoroughly before packaging them - although the chocolate set nicely, we still found the marshmallow sticky. Neatly packaging them stacked in a baggie or a box work well. I didn't have refined coconut oil, so I used a bit of vegetable oil when melting the chocolate. I wasn't hugely picky on this step, but it worked well and set nicely. Half-dipping the cookie provided the perfect amount of chocolate and flaky salt. Presents beautifully and definitely not too sweet. Will be making these every year!EvaSan Francisco, CA12/21/2020For me it was a crumble disaster. I don't think I kneaded the dough enough because it was so dry and the cookies wouldn't hold together once cooked. I'm going to try it again and reduce the flour and see if it works. They also turned out pale and didn't seem cooked so I went over the cooking time but I don't know if that made it more dry. Please help us with posting recipes that are tested and more specific. I keep botching BA recipes :(JessBrooklyn, NY12/20/2020Love! Better as they age in fridge! I did have to use 3 sticks of butter in order for dough to come together, which amounted to longer cooking time, but delicious! Do not move too quickly from pan - let them sit on pan after removing from oven, or they will break. \nI tried 2 large marshmallows on some, it was almost too much, the marshmallow spread past the cookie, but if you love marshmallows, why not?!\nI put heath bar on some, and sea salt on some - both delicious - mix it up! \nI have never been a Moon Pie Fan until now!!!\n5 stars! Making again tonight!! lolrobin brooksOklahoma City, OK12/20/2020These are still in the oven but from the taste of the dough alone, I know these are going to be amazing!\n\nJust a tip for those who struggle with a crumbly dough like this that I learned from an old Dorie Greenspan recipe: once the dough is combined, simply roll it into two round logs, 2” in diameter. Wrap in plastic wrap and pop in the freezer (for 30-60 min - longer is fine too but you may need to thaw a bit later). The dough gets nice and firm and then you can simply slice down the logs, 1/4” thick to make your cookies. If the round crumbles apart, just push it back together. Worked like a charm!danielleChicago12/18/2020These are delicious, I have made them twice, the first time following and the second time not having enough chips so opted for more pretzels. The first time I added the extra salt at the bottom of the pretzel bag (highly recommend or add extra salt-I like it salty) the second time the dough was more crumbly, so I'd recommend sticking with the recipe, but they still stayed together. I skipped the marshmallow and dipped some in chocolate and sandwiched some with jam - so tasty!MelissaOntario, Canada12/18/2020These were delicious. I’ve made two batches now. A few things: measure your chips and pretzels AFTER crushing them a bit, because the volume changes once they’re condensed. I found them slightly too salty with the salt from the chips and pretzels, so I omitted it the second time (totally a matter of personal preference). To make the dough come together, I used a large piece of parchment paper and kept flipping it over on itself+pressing in the drier edges using the paper until it started to incorporate all the bits into the butter. It eliminated my issues with hand kneading. Let your food processor do most of the work for you, the second time I made them I pulsed a few times after the dough seemed homogenous just to make it clump a bit more. Also, I am somewhat of an amateur with chocolate specifically and don’t know how to temper it—I followed the recipe as instructed initially and the chocolate did not set. I’m not too finicky about chocolate quality and the second time around opted to use the little wafers that are meant to harden after dipping. I know the chocolate flavor isn’t quite as good but I’m not too picky. Lauren P. North Carolina12/15/2020These are even better than we thought they would be.  The dough was perfect and easy to roll, and the marshmallows puffed exactly as described.  they were super easy and so good we hated to give most of them away.  I like Abby's idea of making a marshmallow filling for our cookie boxes next year.  These are definitely on permanent rotation.\nWe used a smaller cutter, about 1-1/2\", and got 23 sandwiches.  The large marshmallows still worked well and we had just enough glaze.LizAlbany, CA12/15/2020SO YUMMY. Recommend using homemade marshmallows for extra deliciousness.  Sam Northampton, MA12/14/2020Of the 17 (yes, seventeen!) cookie recipes we made this year for holiday cookie boxes for friends and neighbors, this was my family’s absolute favorite! The salty, crunchy, toasty cookie and the gooey marshmallow and dark chocolate are just pure magic all together. This is definitely a keeper!Katie GAshburn VA12/13/2020Explore Bon AppétitCookieDessertSnackBakingSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Sohla El-Waylly"]}