{"id": "eabda5a38a8a1fd92f93ee60f176d3e5", "url": "https://www.bonappetit.com/story/leon-and-sons-wine-club", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "Leon and Sons’ Wine Club Is the Only Kind of Club I’ll Join | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLeon and Sons’ Wine Club Is the Only Kind of Club I’ll JoinAn after-school club for people who never liked after-school clubs.By Emily SchultzJuly 18, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I wasn’t really into extracurriculars in high school. I did drama club, but I was always begrudgingly cast as a member of the chorus or a nameless townsperson. And I was in the environmental club, but we met...like three times a year. Now I’m a little different. I have a club I’m very invested in. It’s called Leon Circle and it’s a wine club from Leon and Sons, a small, natural wine–focused shop in Brooklyn.When people ask me how to “get into wine,” I tell them to just open a bottle of wine and drink it. “But where do I start? How do I know which grapes taste like what or which regions matter?\" With Leon Circle’s wine club, you don’t have to worry about that. Owner Chris Leon chooses three bottles of wine per month for $75 and ships nationally. (Or you can pick them up from his Clinton Hill shop, if you live in Brooklyn like me.) The selections range from producers all over the world, even countries like Hungary or Georgia, which have been making wine, like those skin-contact ones you can’t get enough of, for thousands of years. Helpful tasting notes about the grapes, soil types, regional climates—the real nerdy stuff that’s actually going to teach you about what you like and don’t like—come conveniently stowed in your cute little wine briefcase. And if you’re afraid of commitment, you can drop in or out of the club as you please (much like I did with drama club after my junior year of high school), so it makes a good one-time gift for that friend or loved one who follows the entire BA staff on Instagram and can’t get enough of our shots of natty bottles.So like I said before, the best way to get into wine is to try wine, and Leon Circle makes it easy. It’s the only club I’ll enthusiastically stick around for.Buy it: Leon Circle Wine ClubExplore Bon AppétitHighly RecommendWineBrooklynRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-18", "author": ["Condé Nast", "Emily Schultz"]}