{"id": "eadbf385d72f3c88e49e7d33fda950ec", "url": "https://www.bonappetit.com/story/caesar-beans", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Caesar Beans Are Exactly As Delicious As They Sound | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCaesar Beans Are Exactly As Delicious As They SoundTwo of my MVP leftovers have joined forces as one.By Emily SchultzMay 5, 2020FacebookTwitterEmailFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Some recipes are complicated and take three Dutch ovens and two baking sheets and four days of your time. But what I’m about to share isn’t one of those. It’s uncomplicated, meant for those times when you haven’t got a lot, physically or mentally, and it comes together from the bits and bobs of the fridge. Welcome to Caesar beans.First, the origin story: In normal times, I’m cooking for me, myself, and I, and so a pot of beans lasts, well, a looong time. Okay, we’re talking a week. But a week is a long time for me. As someone who’s never been a huge leftovers fan, I’m burdened with coming up with a new way to eat beans every day, and it feels...stressful? (I overthink things as you can see.) I’ll toss them in pasta or mash them on toast, but that last remaining portion always escapes me.That is, it did—until I saw the old-yogurt container of beans sitting right next to a tiny jar filled with another perennial leftover: Caesar salad dressing. BA’s Best Caesar Salad is a no-fail recipe that produces a perfect dressing, but never have I once finished the entire volume of dressing it instructs you to make. Usually, I’ll use the leftover dressing for new salads or more likely, dunking pizza crust. But when I realized that the two leftovers could join forces—the dressing giving those boring beans a chance at life anew—that was when I fully appreciated the power of a good Caesar. .Here’s what you do:Make a big pot of beans (I like cranberry, chickpeas, or any kind of white bean like cannellini) and the dressing from BA’s Best Caesar Salad. Toss the two together in any amount you like—I don’t know the extent of your leftover beans or dressing so I can’t give you exact measurements, but you want the beans to be nicely coated but not drowning.Next, slice up some raw veggies like the random carrot you found at the back of your crisper, the radish you only bought because it was pretty, and maybe the last remaining head of endive. Toss those through to coat them in dressing, too!Then heat up a glug of olive oil and toast some panko breadcrumbs. Pour the toasty bread crumbs over your beans, then microplane the last nug of parm on top, too. Add any kind of pepper you’d like—aleppo-style, urfa biber, crushed red pepper flakes, black pepper—it’ll all taste good and you need a little somethin’ to cut all of the richness of the beans and parm.That’s it! Toasting the bread crumbs makes it feel like you’re not just eating cold leftovers, and all of the olive oil in the Caesar dressing reminds you this is still a pretty stellar meal.See? Things can be easy sometimes.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-05", "author": ["Condé Nast", "Emily Schultz"]}