{"id": "eade4ba0877150ee1fb8197f08a1f6c7", "url": "https://www.bonappetit.com/story/how-to-roast-red-peppers-at-home", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "How to Roast Red Peppers at Home Like a Minor Character on 'The Sopranos' | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Roast Red Peppers at Home Like a Minor Character on 'The Sopranos'Ditch the expensive ones from the antipasti bar—you're roasting peppers at home now.By Alex DelanyJune 27, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailRoasted red peppers are about as versatile an ingredient as you'll find. They grace antipasto spreads effortlessly, add depth to sandwiches, pair perfectly with grilled sausages or chicken, and make romaine-heavy deli salads infinitely tastier—maximum impact, minimal struggle. It's not really fair. Other ingredients spend their whole lives working toward this level of effectiveness. Roasted red peppers are seemingly born with it. And while it’s easy to head to the grocery store and buy a jar, once you learn how to roast red pepper sat home, well, the game will be changed forever.You don’t need much to make roasted red peppers. Peppers (duh). Olive Oil. And some kosher salt. That’s it. You have most of that stuff at home already, so grab some peppers and let's do this.There are two ways to roast peppers (and a third if you want breadcrumbs involved). Both involve some form of aggressive heat followed by a more mellow, lower-heat method as needed. Whether you’re an oven person or a stovetop person, your cutlet sandwich will be stacked with red peppers in no time. Here’s how we do it:The Oven MethodTurn on your broiler. Yes, the broiler. That fire thing you might be scared of. It’s cool. Broilers are our friends. We promise. Cut red bell peppers in half and remove the core and seeds. Toss the pepper halves in a tiny bit of olive oil and spread them on a sheet pan, with the cut sides down and skin sides up. Our goal here is to get the skin charred enough to be able to easily remove it. Put the peppers under the broiler for 12-14 minutes, until the skins are black. Remove the peppers and turn your oven to 250°.The peppers won’t be cooked all the way through from that time under the broiler. But the skins should peel right off. Let them cool a bit until you feel comfortable handling them, then use your hands or the back of a knife to peel the charred skins off of the peppers and then place the skinless peppers back on the sheet pan. Throw them back in your oven for about half an hour, until the peppers are tender and cooked through. Take them out, let them cool, and slice them into strips. Look at you! You roasted red peppers! Amazing!You can get some yellow peppers in the mix. We don't discriminate.\nThe Stovetop MethodYou can also recreate the broiler effect by laying peppers directly over an open flame. We would not suggest using that BIC lighter in your junk drawer. The flame on your (gas) stove will work much better. (Sorry to those of you with electric burners—hopefully you have a broiler?) Turn the flame on medium, place the peppers on the burner so they're in direct contact with the heat, and use tongs to rotate as needed so the skin gets dark and charred all over. Repeat this with as many burners as you need for as many peppers as you have. Maybe it’s two. Maybe it’s 736. We don’t know how much you like roasted red peppers. When each one is finished charring, sling it into a bowl and cover with plastic wrap—you want to let those bad boys steam a bit once they come off the burner.Once you've charred all the peppers and let them all hang out in that steamy covered bowl, take them out, pull out the stem and seedy parts, open the peppers kind of a like a book and place them (charred) skin side up on your cutting board. Using your hands or the back of a knife, scrape off the charred skin. (It's okay if some won't come off; it won't kill you.) At this point the peppers should be mostly cooked-through, but if you want them a little softer you can go ahead and cook them over low heat in a Dutch oven with a glug of olive oil, stirring every once in a while, until they've softened to your liking.Those jars could be full of sweet, sweet roasted peps!\nChelsie CraigStorage ManeuversWhether you went the stove or oven route, you should be looking at some tender, skinless roasted red peppers. Nice job. You can eat them immediately if you’d like, but the secondary goal is to store them so they’re ready to use at a moment’s notice. Sprinkle the peppers with a bit of kosher salt and transfer them into a glass jar or plastic Tupperware. Pack them in tightly, then add olive oil until the peppers are fully submerged.Keeping the peppers submerged in the liquid will make sure they don’t spoil in the fridge—they should keep for at least a week this way. And since these peppers can hang around in the fridge for a minute, we'd suggest roasting more than two. Maybe not 736, like we suggested earlier...but definitely more than two.Roasted red peppers also work like this:Roasted Peppers with Parm BreadcrumbsBasically just an excuse to eat breadcrumbs by the handful, TBH.View RecipeExplore Bon AppétitBasicallyRed PepperRoasted VegetablesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-27", "author": ["Condé Nast", "Alex Delany"]}