{"id": "eadf606394e2ae7d34e0fe1eb2228951", "url": "https://www.bonappetit.com/recipe/maple-zaatar-kettle-corn", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Maple-Za’atar Kettle Corn Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueMaple-Za’atar Kettle CornBy Zaynab IssaNovember 23, 20214.2(7)Read ReviewsTriangleEmailPinterestPrintPhotographs by Emma FishmanEmailPinterestPrintEmailPinterestPrintKettle corn is undeniably delicious, so there’s no reason to mess with it—unless the alternative is utterly showstopping. Enter this maple-za’atar kettle corn, which is sweet and salty, yes, but also, thanks to the za’atar, earthy, toasty, herby, and punched up in all the best ways.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Saucepan with Lid$39 At AmazonWooden Spoon$6 At AmazonLarge Bowl$18 At AmazonIngredients4 Servings4tsp. ghee or clarified butter½cup popcorn kernels3Tbsp. pure maple syrup2tsp. za’atar1tsp. Aleppo-style pepper1tsp. Diamond Crystal or ½ tsp. Morton kosher saltPreparationStep 1Melt ghee in a large light pot with a lid over medium-high heat (make sure entire bottom of pan is coated with fat).Step 2Add a few popcorn kernels. As soon as they begin to pop, add remaining kernels, cover, and cook, vigorously shaking pot to keep kernels moving so they don’t burn, until just-added kernels begin to pop. Remove lid and drizzle in maple syrup. Cover pot and continue to cook popcorn, shaking pot, until most of kernels have popped and the rate of popping has significantly slowed (you should only hear an occasional pop), about 4 minutes. Don’t worry if all the kernels don’t pop.Step 3Carefully transfer popcorn to a large bowl, sprinkle za’atar, Aleppo-style pepper, and salt over. Toss popcorn with a wooden spoon to coat.Do ahead: Kettle corn can be made 5 days ahead. Store airtight at room temperature.How would you rate Maple-Za’atar Kettle Corn?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleHow about maple syrup and Tabasco?  WoW KayTuscany, Italy 12/11/2021Explore Bon AppétitSnack5 Ingredients or FewerEasyQuickGluten-FreeVegetarianZa'atarHerbs & SpicesAleppo-Style PepperRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Zaynab Issa"]}