{"id": "eae524085009ab3d2eeaa659713cf714", "url": "https://www.bonappetit.com/recipe/mini-knafeh-with-rose-and-pistachio", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Mini Knafeh With Rose and Pistachio Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueMini Knafeh With Rose and PistachioBy Zaynab IssaFebruary 8, 20223.7(3)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintTexture seekers and corner-piece hoarders, this recipe is for you. While the beloved Middle Eastern dessert knafeh is usually made in a large round tray, here it’s baked in a muffin tin so that every serving contains more crispy-crunchy, ghee-soaked pastry. Never fear: There’s still plenty of cheese in the middle of each one. Usually, that’s a mix of Arabic cheeses, but in this version, it’s a mix of creamy ricotta and stretchy mozzarella. Food coloring provides the iconic bright orange appearance, but if you skip it, you’ll still get a subtle golden hue. Pro tip: Freeze the shaped knafeh (disposable pans work great for this) and bake them from frozen, adding 3–5 minutes to the cook time.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMuffin Pan$10 $9 At AmazonBox Grater$13 At AmazonOrange Food Coloring Powder$14 At AmazonSmall Saucepan$155 At AmazonChef's Knife$34.53 At AmazonIngredientsMakes 2412oz. whole-milk mozzarella, grated on the large holes of a box grater6oz. whole-milk fresh ricotta1cup ghee or clarified butter, melted½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltOrange food coloring or red and yellow food coloring, preferably oil-based or powder (optional)1lb. fresh or frozen, thawed kataifi (shredded phyllo pastry)1cup (200 g) sugar1tsp. fresh lemon juice1tsp. rose water or orange-flower water (optional)¼cup raw pistachios, finely chopped or crushed¼cup dried rose petals (optional)Special equipmentDisposable food-grade gloves (optional)PreparationStep 1Place a rack in middle of oven; preheat to 375°. Mix mozzarella and ricotta in a medium bowl to combine; set aside.Step 2Place ghee and salt in a small bowl. Add food coloring, if using, to achieve your desired hue (medium orange is a good aim; the color will intensify when the knafeh are baked) and mix vigorously to combine (water-based food coloring won’t completely dissolve into the ghee and that’s okay).Step 3Using a sharp knife, cut kataifi into 1\" pieces and place in a large bowl. Tear strands apart with your hands to separate. Using gloves if desired (the food coloring can stain your hands), pour ghee mixture over kataifi and toss and rub strands until completely coated in ghee. (If using water-based food coloring, it may take some extra time to fully disperse it.)Step 4Working one at a time, scoop about ¼ cup kataifi mixture into each cup of 2 standard 12-cup muffin pans. Using your hands, pack into cups and create a well for cheese mixture (it should look similar to a bird’s nest). Place a heaping 1 Tbsp. cheese mixture into each well, doing your best to keep cheese centered and away from sides of pan. Divide remaining kataifi mixture among muffin cups (about a packed 1 Tbsp. each) and press down on it with your palm or a spoon to pack. Kataifi mixture should be level or almost level with top of pan and cheese mixture should be barely visible. Bake until crisp, 15–20 minutes.Step 5Meanwhile, bring sugar, lemon juice, rose water (if using), and ¾ cup water to a boil in a small saucepan over medium heat. Cook, stirring occasionally, until sugar is dissolved, about 3 minutes. Remove pan from heat; set syrup aside.Step 6Remove knafeh from oven. Place an inverted baking sheet over a muffin pan and carefully flip over to unmold knafeh. Repeat with second muffin pan and another baking sheet.Step 7To serve, spoon 1–2 Tbsp. reserved syrup over each warm knafeh; top with pistachios and dried rose petals (if using).Do ahead: Knafeh can be formed 3 months ahead. Tightly wrap muffin pans in plastic and freeze.How would you rate Mini Knafeh With Rose and Pistachio?Leave a ReviewTell us what you thinkExplore Bon AppétitDessertBakingMiddle EasternCheeseMozzarellaRicottaPhylloOther IngredientsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Zaynab Issa"]}