{"id": "eaf613050165fe207348212cf444261b", "url": "https://www.bonappetit.com/recipe/tomato-salad-with-pine-nuts-and-pomegranate-molasses", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Tomato Salad with Pine Nuts and Pomegranate Molasses Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueTomato Salad with Pine Nuts and Pomegranate MolassesBy Kamal MouzawakApril 16, 20195.0(8)Read ReviewsTriangleEmailPinterestPrintPHOTO BY ALEX LAU, FOOD STYLING BY ANDY BARAGHANIEmailPinterestPrintEmailPinterestPrintThe secret weapon in this summery salad is the golden raisins: They're soaked in apple cider vinegar, which not only sweetens the vinegar but also transforms them into plump, sweet-tart balloons that stand up against the rich and buttery pine nuts. Check out our other recipes for a truly flavorful Lebanese feast, and read more about Kamal Mouzawak, the restaurateur-hotelier-humanitarian behind the recipe.Ingredients4 servings⅓cup chopped golden raisins¼cup apple cider vinegar⅓cup pine nuts1lb. small tomatoes (such as Sun Gold, cherry, and/or grape), some halved, some left whole½small red onion, very thinly sliced¼cup extra-virgin olive oilKosher salt1cup basil leaves, torn if large2Tbsp. pomegranate molassesIngredient InfoPomegranate molasses, a thick pomegranate syrup, can be found at Middle Eastern markets, some supermarkets, and online.PreparationStep 1Preheat oven to 350°. Combine raisins and vinegar in a large bowl; let sit until raisins soften, 15–20 minutes.Step 2Meanwhile, toast pine nuts on a rimmed baking sheet, tossing halfway through, until golden brown, 5–7 minutes. Let cool.Step 3Add pine nuts, tomatoes, red onion, and oil to bowl with raisins; season with salt and gently toss to combine. Add basil and toss once more.Step 4Transfer salad to a platter and drizzle pomegranate molasses over.How would you rate Tomato Salad with Pine Nuts and Pomegranate Molasses?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI've made this often and love it.  It's also been a great salad to take to pot-luck dinners.  I always get asked for the recipe.  Thanks for this oneBobbiFlorida3/4/2021This is a gorgeous salad! Using what I had on hand, I swapped the red onions for shallots and used toasted pepitas in place of pine nuts, and it was delicious! I served it over some fluffy leftover bulgur to bulk it up for lunch, and added it instantly to my file of \"keepers!\"  AnonymousLisbon, PT5/29/2019Excellent tomato salad. Easy to prepare and packed with flavor. AnonymousIsrael5/19/2019Outstanding. I added quite a bit less onion than the recipe calls for and more pine nuts for garnish.GianineAustin5/3/2019Explore Bon AppétitSaladLebaneseMiddle EasternRaisinDried FruitFruitTomatoVegetablePine NutNutSideMainVegetarianVeganDairy-FreeGluten-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Kamal Mouzawak"]}