{"id": "eaf87fc980638d3377da89038a454a52", "url": "https://www.bonappetit.com/recipe/corn-and-sausage-pasta", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Corn and Sausage Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueCorn and Sausage PastaBy Chris MoroccoMay 25, 20214.7(50)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintCombining pasta with loose sausage and one peak-season vegetable is my go-to when I need a dinner I can throw together without thinking too hard. Corn is great here, but chopped up tomatoes, broccoli, summer squash, and even green beans are fair game. The not-so-secret is a handful of parm and a knob of butter right at the end, which turn a handful of humble ingredients into a rich, saucy, cohesive dish. —Chris MoroccoThis recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonSlotted Spoon$13 $10 At AmazonLarge Pot$55 At AmazonMicroplane Grater$16 At AmazonIngredients4 Servings12oz. rigatoni, spaghetti, or any pasta you have on handKosher salt¼cup extra-virgin olive oil1lb. sweet Italian sausage, casings removed6garlic cloves, thinly sliced2sprigs basil, plus 1 cup leaves for serving½tsp. Aleppo-style pepper or other mild red pepper flakes2cups fresh corn kernels (from about 2 ears)4Tbsp. unsalted butter, cut into pieces2oz. Parmesan, coarsely grated, plus more for servingFreshly ground black pepperPreparationStep 1Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente; drain, reserving 2 cups pasta cooking liquid.Step 2Meanwhile, heat oil in a large Dutch oven or other heavy pot over medium-high. Add sausage and cook, breaking up with a wooden spoon, until browned and cooked through, 6–8 minutes. Using a slotted spoon, transfer sausage to a plate.Step 3Reduce heat to medium and cook garlic in same pot, stirring occasionally, until light golden around edges, about 2 minutes. Add basil sprigs and Aleppo-style pepper; cook, stirring, until basil is wilted, about 1 minute.Step 4Add corn and ½ cup water to pot and cook, stirring often, until corn is mostly tender, about 3 minutes. Stir in pasta and 1 cup pasta cooking liquid. Then add butter and cook, stirring, until butter is melted and sauce is smooth and creamy.Step 5Add 2 oz. Parmesan in several additions, stirring after each addition until sauce is smooth. Return sausage to pot and cook, adding a splash or two more of cooking liquid if needed to loosen sauce, until flavors meld, about 1 minute. Taste and season with salt and pepper.Step 6Divide pasta among shallow bowls; top with basil leaves and more Parmesan.How would you rate Corn and Sausage Pasta?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleThis was surprisingly delicious! Didn’t have very much parm and it was still good. I didn’t use all of the pasta water which kept the sauce creamier. Will definitely make again Kat2/28/2022Yummy weeknight meal!S BurrellMaine11/17/2021Made this recipe without any additions because the picture looked so good.  I was disappointed.  With fewer ingredients, less time, and a lot less cholesterol, you can make cacio e pepe, and it will be twice as good.H. FukudaLaguna Niguel, CA9/26/2021This was excellent!!John Columbus Pittsburgh9/17/2021To thicken the sauce add a little instant potato.CookieSpokane8/23/2021Was good...would add less water at the end, and use more cheese and corn. (Found it to be rather salty as well, but I only had salted butter so maybe the culprit). Also added sliced cherry tomatoes and sauteed zucchini (as we have heaps to eat at the moment!!) to round it out as a one-dish meal. JJGallNY8/3/2021Absolutely delicious! Such a flavor bomb dish. I used hot sausage links for added heat flavor as well as cherry tomatoes for an additional sweet element. I only used one cup of the pasta water and used orecchiette pasta. 1000% this dish will be in my recipe rotation 👩🏻‍🍳MissMeganEastampton, NJ8/2/2021We loved the flavor of this dish and it was super simple to prepare. Only negative was that the sauce was rather “soupy” for our taste. I added only the 1/2 cup of water with the corn and the1cup of pasta water. I don’t want to reduce the overall amount of liquid though. Next time, maybe add a simple cornstarch slurry at the end? Other suggestions welcome!Loves to cook!Hershey, PA7/28/2021Absolutely delicious. I made it with pork sweet Italian sausage. And fresh sweet corn we bought from the back of a pickup truck. We are in Iowa, after all. Two thumbs up!Tim EarpDes Moines, Iowa7/26/2021This was so amazing! Can’t wait to eat my leftovers.AnonymousMilwaukee, WI7/4/2021Made this with Impossible Burger meat. Really delicious. Great leftovers.gruffgordonLos Angeles, CA7/2/2021Does the corn get added uncooked?Anonymous6/24/2021This is one of those recipes where the whole is better than the sum of its parts.  It was delicious.  That being said, I did use spicy sausage due to preference, and added 2 cups of cherry tomatoes along with the corn, but otherwise followed the recipe.  Will make again with those same modifications.Anonymous6/17/2021So good!  So easy and satisfying. Loved. AnonymousWauwatosa,WI6/15/2021Delish! I used diced field roast sausage instead of the real deal and parsley, and it still turned out great! Excited to add this as a hearty regular.DotdotdotTacoma, WA, United States6/10/2021Explore Bon AppétitPastaCornVegetableSausageMeatRigatoniPasta & NoodlesSpaghettiSummerEasyQuickWeeknight MealsMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Chris Morocco"]}