{"id": "eb115c6241613c8617a35e72a8ee9e9c", "url": "https://www.bonappetit.com/story/knife-storage-101", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "The Best Knife Storage Solutions for Keeping Your Blades Sharper, Longer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Knife Storage Solutions for Keeping Your Blades Sharper, LongerKeep your knives on display or tucked away.By Carrie Honaker and Tiffany HopkinsOctober 12, 2021FacebookTwitterEmailTed CavanaughFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When it comes to the question of the best knife storage system, opinions run sharp. But no matter where you stake your allegiance—team knife block, magnetic bar, or drawer setup—experts agree that the most important rule of knife storage isn’t about where you keep your kitchen knives but about how you prep them before putting them away. To keep your knives in tip-top shape, don’t let them hang out in the sink, waiting to be washed after dinner. You should clean, dry, and store them immediately after use. “My family finds this annoying, but it’s my one kitchen rule,” says Kaumudi Marathe, senior books editor at America’s Test Kitchen. This is important for safety reasons, but it also helps prevent rust, staining, and corrosion—yes, even on stainless knives. The second rule? Keep your knives out of the dishwasher, as it can damage the blades as well as the handles.Once your knives are hand-washed and dry, you can store them in a variety of different ways to keep your blades sharper, longer. The best way to store knives depends on how much countertop and drawer space you have, how many knives you actually own, and your preferred kitchen aesthetic. Below we’ve rounded up some of our favorite knife storage solutions, whether you want to keep them on display or tucked away.Mounted Magnetic Knife StripsAdvantages: Wall-mounted magnetic racks allow you to preserve countertop and drawer space, which makes them the most space-efficient option. They also provide a handsome display that can be conveniently located near your prep area, so your knives are always within arm’s reach.Disadvantages: If you’re not gentle, the impact of blade on bar can scratch your knives (not a functional problem, but an eyesore) or even chip or snap a delicate Japanese-style knife. You should also consider safety hazards, especially if you have children or small pets that can jump on the counter. And sometimes, when the magnet in the bar is very strong, it can magnetize the knives themselves, according to Mari Sugai at Korin Knives.Recommendation: There are lots of choices when it comes to magnetic strips—stainless steel, wood, a combination of the two. We like the Zwilling 18\" Acacia Magnetic Knife Bar because it's wood-coated, which reduces the chance of scratches. It can store up to eight large knives and makes an attractive display for your cutlery.Zwilling 18\" Acacia Magnetic Knife Bar$50 at Sur La Table$55 at TargetIf you’re looking for a more artisan choice, the Peg and Awl Shou Sugi Ban Knife Grabber is beautifully crafted from reclaimed wood, making it a great environmentally-conscious option. It’s made using shou sugi ban, a Japanese technique in which wood is burned to give it a gorgeous charred finish and to seal it from the elements. This rack comes in two lengths—choose between 15 inches (which can hold six knives) or 18 inches (which can hold eight).Shou Sugi Ban Knife Grabber$130 at Food52Pro Tip: To reduce impact and avoid scratches when using a magnetic rack, attach your knife spine first, then rotate it 90° so that the blade meets the rack gently instead of smacking. Do the reverse to detach it.Knife BlocksAdvantages: Knife blocks provide good protection for the edges of your blades, which makes them great for extending the longevity of your knives. Just refrain from shoving them into slots that don’t fit.Disadvantages: Wooden blocks can take up valuable counter space and they often lock you into a certain number and type of knives, since the slots are usually prefabricated and designed for that knife set you don’t need. Where are you going to put that cleaver? They can also be difficult to sanitize, as moisture and crumbs can get caught in the slots. This is important to note if you’re not diligent about, ahem, cleaning and drying your knives immediately after use.Recommendation: We like the Wüsthof 17 Slot Knife Storage Block because it's made with environmentally-friendly, bacteria-resistant wood that comes in a variety of shades including bamboo, walnut, cherry, and black. It can hold up to 17 knives and has non-skid feet that protect both your block and your countertop.Wüsthof 17 Slot Knife Storage Block$50 at AmazonFor the home cook who doesn’t want to commit to prefabricated slots, try a universal knife block, like this one from kitchenDAO, which can store essentially any knife with a blade shorter than 8.6 inches and comes with a slot for kitchen shears as well.KitchenDAO Universal Knife Block$35 at AmazonPro Tip: If you’re using a knife block, food writer Tara Austen Weaver suggests storing your knives spine side down in the slots, which keeps the blade from resting on its edge or from coming into contact with the block as you slide it in or out. It’s a tip she picked up from her Chinese-Indonesian grandmother. “I love cooking at her house, everything chops like butter because the knives are so sharp,” Weaver says.Magnetic Knife StandsAdvantages: Magnetic knife stands give you the ease of the magnetic strips without the need for wall space, and they have a smaller footprint than knife blocks.Disadvantages: Magnetic knife holders share some of the pros of both magnetic strips and knife blocks, but they also share some of the cons—most notably, the need for counter space. And since your knife blades are left uncovered, they can pose some safety hazards if you have small, curious hands in your kitchen.Recommendations: Food writer Amanda Castleman loves the Böker Magnetic Knife Block because it has all the ease and hygiene of a strip, but it’s better-looking. “It's even more lovely IRL and elicits quite a bit of attention. Also, [unlike a knife strip] you can relocate it without messing up your kitchen’s infrastructure.” Find it in three different colors.Boker 30400 Wood Magnetic Knife Block$100 at AmazonIf you’re looking for a super–sleek option that won’t take up much counter space, this compact knife stand from Material is for you. It’s available in walnut and midnight black and can hold up to eight knives using both sides. “I really like the mid century-modern vibes, its clean lines, and how cool it looks in my kitchen,” says Kwame Onwuachi, James Beard Award–winning chef.  Photo by Alex LauMaterial Knife Stand$90 at MaterialIn-Drawer Knife Blocks and OrganizersAdvantages: This is an out-of-the-way choice that’s safer than a magnetic strip and can accomodate a customized knife collection.Disadvantages: You need an empty drawer! And the inserts can be challenging to clean, depending on the material.Recommendation: This Knife Dock Storage Tray is a great drawer storage option because it doesn’t have designated slots, which means you can use it for any set of knives you want—be it your steak knife, bread knife, or paring knife. The cork-lined box protects the blades and provides tight cushioning to keep your knives secure. Cork inserts are Chef Jet Tila’s favorite affordable option: “You can actually get a lot of knives in there when you’re starting to build a collection.”Knife Dock Storage Tray$30 at Sur La TableSolid wood storage trays are easier to clean and, to some, more attractive. Karen Tedesco, author of the cookbook Family Style, recommends the Wüsthof 14-Slot In-Drawer Knife Tray, if you have a drawer that can accommodate it. “An in-drawer knife organizer fits more and is much tidier” compared to magnetic racks, says Tedesco.Wüsthof In-Drawer 14-Slot Knife Organizer$55 at Williams Sonoma$55 at Sur La TableIndividual SheathsAdvantages: Affordable and lightweight, sheaths allow you to take your knives anywhere. Even if they’re not your primary knife storage solution, they make a great temporary option for weekends away at under-equipped Airbnbs.Disadvantages: It can be annoying to have a bunch of loose knives in a drawer—and even more annoying to unwrap and rewrap your knives every time you use them. There’s also the danger of moisture getting trapped in the sheath, which can cause corrosion and rust. To avoid this—we’ll say it again, what the heck—always make sure both your knife is clean and dry before storage.Recommendation: For the budget-minded, Noble Home & Chef makes great protection sleeves. Their 2-Piece Universal Knife Edge Guards are felt-lined and made of durable, long-lasting BPA-free plastic.2-Piece Universal Knife Edge Guards$10 at AmazonIf you're interested in a handcrafted sheath, Knifeware offers a selection of artisan wooden blade guards; these Japanese sayas are designed to fit gyuto (Japanese-style chef’s knives) and come with a little loop of leather attached so you can keep them hanging near your prep area. These are favorites of Rachael Narins, owner of Chicks With Knives in L.A., who prefers maplewood for its strength and beauty. They range in price from $27 to $38 per sheath.You now have the cutting edge information on all things knife storage to make an informed choice for your home. But remember, whichever method you choose, clean and dry is the name of the game.Stay sharp:Explore Bon AppétitKnivesShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-09", "author": ["Condé Nast", "Carrie Honaker", "Tiffany Hopkins"]}