{"id": "eb356331decd2fda54329f907d17f270", "url": "https://www.bonappetit.com/recipe/sai-ua-samun-phrai", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Sai Ua Samun Phrai Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueSai Ua Samun PhraiSeptember 22, 20204.8(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintChef Parnass Savang of Atlanta’s Talat Market has learned how to make a variety of Western sausages—bologna, cheddarwurst, and pepperoni—from the chefs he’s worked with in Atlanta. But the first sausage he learned to make was sai ua from his dad. It has a vibrant flavor from the slew of herbs and spices that get mixed in. It’s what started his journey into exploring Thai food and his own roots.Ingredients4 ServingsChile Dip2medium shallots, unpeeled1head of garlic, unpeeled4Anaheim chiles1red or green Thai chile2Tbsp. (or more) fresh lime juice1Tbsp. finely chopped cilantro (some stem is good)1Tbsp. (or more) fish sauce1tsp. (or more) sugarKosher saltSai Ua and Assembly1lb. ground chicken1small shallot, finely chopped2makrut (Thai) lime leaves, thinly sliced¼cup red curry paste2Tbsp. fish sauce2Tbsp. unsweetened coconut milk1tsp. granulated sugar2Tbsp. finely chopped cilantro, plus \tsprigs for servingKosher salt⅓cup vegetable oilThin cabbage wedges, thinly sliced daikon (Japanese radish), and cooked sticky rice (for serving)PreparationChile dipStep 1Heat broiler. Broil shallots, garlic, and Anaheim and Thai chiles on a rimmed baking sheet, turning halfway through, until charred in most spots, 4–8 minutes. (Alternatively, you can char individually over a burner if you’ve got a gas stovetop.) Let cool.Step 2Peel shallots, garlic, and chile (it’s okay if some charred bits stay attached; they will add smoky flavor), then coarsely chop. Transfer to a mortar and pestle or a food processor and mash or pulse to a coarse paste. Mix in lime juice, cilantro, fish sauce, and sugar; season with salt. Taste and add more lime juice, fish sauce, and/or sugar if needed.Step 3Do ahead: Dip can be made 1 day ahead. Cover and chill.Sai ua and assemblyStep 4Combine chicken, shallot, lime leaves, curry paste, fish sauce, coconut milk, sugar, and 2 Tbsp. cilantro in a medium bowl; season with salt. Using your hands, mix until chicken is sticking to itself and mixture is smooth, about 3 minutes. Using wet hands, form about 2-Tbsp. scoops of chicken mixture into 1\"-thick patties.Step 5Heat oil in a large skillet over medium-high. Working in batches, cook patties until golden brown, about 2 minutes per side. Transfer to paper towels to drain.Step 6Serve patties with chile dip, cabbage, daikon, cilantro, and rice.How would you rate Sai Ua Samun Phrai?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleFor the love of god, check the label on your red curry paste before adding any additional salt to this! I ruined my batch by following these directions while using a curry paste with salt. They were inedible. Could tell they would have been delicious otherwise. AnonymousConnecticut 10/27/2020This was really good! Followed almost exactly except I used serrano instead of a Thai chili and butter lettuce in place of cabbage. Just make sure you watch your salt in the chicken mixture. Mine turned out a little too salty because I used a salted curry paste (Mae Ploy), so my fault.AnonymousDenton, TX10/22/2020I’ve never made Thai food, but I made this tonight, substituting ground turkey because it was all I could find. I also used jalapeños and tomatillos instead of Thai chile and Anaheim chiles, both because I couldn’t find the others, and because it scares me that the Thai are 15x hotter than jalapeños. The dish was amazing and I will definitely make it again. My arm felt like it would fall off after I mixed for three minutes with a wooden spoon, and I’m a pretty buff dude. I feel like a stand mixer with a dough hook would have worked better (if I had one). After that, the meat forms a sort of emulsion and looked similar to bratwurst after cooking. A cast iron skillet with peanut oil (high smoke point) and a fish spatula worked well. I found the lime leaf at Mollie Stone’s, and it’s such a unique and delicious ingredient. It tastes very reminiscent of tom kha and other Thai dishes I’ve tried, but I never would have been able to place it before. Thanks Parnass! AnonymousSan Francisco10/20/2020I made this last night with a few substitutions: ground turkey for chicken, 1.5 tsp of lime zest for the lime leaves, and only 1 tbsp. of the fish sauce. My husband and I ate these as romaine lettuce wraps with the sticky rice, chile dip (SO GOOD) avocado and some fresh herbs and it was absolutely delicious. Looking forward to trying it again with the regular ingredients!caitmarybarryQuincy, MA9/30/2020Explore Bon AppétitThaiSoutheast AsianAsianGround ChickenChickenPoultryAnaheim ChileChileVegetableMainDairy-FreeGluten-FreeKetoSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}