{"id": "eb3fa1479b9ccfd53d8d64d08c394811", "url": "https://www.bonappetit.com/recipe/arctic-char-tostadas", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Arctic Char Tostadas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueArctic Char TostadasBy Daniela Soto-InnesJanuary 8, 20194.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintChef Daniela Soto-Innes thinks of these as a Mexican take on bagels with cream cheese and lox. The addictive caramelized fish sauce vinaigrette brightens every bite.Ingredients4 servingsSalty-Sour Vinaigrette3Tbsp. fish sauce1cup unseasoned rice vinegar¼cup sliced scallions1½\" piece ginger, peeled, finely gratedKosher saltTostadas¼tsp. finely grated lemon zest½cup farmer’s cheese or whole-milk ricottaKosher salt18-oz. boneless arctic char or salmon filletExtra-virgin olive oil (for drizzling)44\"–6\" tostadasCilantro leaves with tender stems, sliced serrano chiles, capers, and lime wedges (for serving)PreparationSalty-Sour VinaigretteStep 1Heat a small saucepan over medium. When hot, pour in 1 Tbsp. fish sauce. It should bubble up vigorously and then get thicker and slightly darker, about 30 seconds. Repeat with remaining fish sauce, incorporating 1 Tbsp. at a time. Carefully add vinegar (it may spatter), then transfer mixture to a small bowl; let cool. Stir in scallions and ginger. Taste and season with salt.Step 2Do Ahead: Vinaigrette can be made 1 week ahead. Cover and chill.TostadasStep 3Preheat oven to 300°. Mix lemon zest into cheese in a small bowl; season with salt and set aside. Place fish on a rimmed baking sheet and drizzle very lightly with oil; season with salt. Bake until just opaque throughout, about 5 minutes for char and 8–10 minutes for salmon. Remove from oven and break apart into large flakes. Drizzle with ¼ cup Salty-Sour Vinaigrette.Step 4Divide reserved cheese mixture among tostadas. Top with fish, then cilantro, chiles, and capers. Serve with lime wedges.How would you rate Arctic Char Tostadas?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleGreat recipe. I left out the cheese, was delicious TracyAlberta, Canada8/7/2021Delicious! I love this recipe. I never leave reviews but I felt the reviews were too negative given how delicious this is and I wanted to boost this recipe's rating. You should definitely cook this!!Sarah B. 1/20/2021Explore Bon AppétitTostadaMexicanLatin AmericanArctic CharFishSeafoodRicottaCheeseSalmonQuickWeeknight MealsMainNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Daniela Soto-Innes"]}