{"id": "eb6efe4b7780f866bb6f078842f32d40", "url": "https://www.bonappetit.com/recipe/pan-pizza", "year": 2020.0, "month": 7.0, "day": 4.0, "content": "Vegetarian Pan Pizza With Lots of Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegetarian Pan Pizza With Lots of GreensBy Sarah JampelJuly 28, 20204.2(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Sarah Jampel EmailPinterestPrintEmailPinterestPrintIn this pizza, which is reminiscent of a Sicilian pie, the dough is enriched with whole-wheat or rye flour, then topped with a thin layer of anchovy-spiked tomato sauce (skip the fish, if you wish), and once it comes out of the oven, grated Parmesan and a mountain of greens. You have several pan options: For the thinnest crust with the crispiest bottom and edges, use a 13x9\" rimmed baking sheet. If you don’t have one, you can also use a 10\" or 12\" cast-iron skillet: Your dough will be a bit thicker, more pillowy, and not as crisp. Or you can also easily double the recipe and use an 18x13\" rimmed baking sheet. Just make sure to plan ahead: This dough needs to rise in the fridge for at least 12 hours.Ingredients2 servingsDough1⅓cups (167 g) all-purpose flour⅔cup (83 g) whole wheat, white whole wheat, or rye flour1tsp. instant yeast or active dry yeast2tsp. Diamond Crystal or 1 tsp. Morton kosher salt3Tbsp. extra-virgin olive oil, dividedSauce and assembly4whole peeled tomatoes from a can or 4 oz. (generous ½ cup) tomato purée2tsp. double-concentrated tomato paste (optional but recommended)½tsp. Diamond Crystal or 1/4 tsp. Morton kosher salt1–2anchovies (optional but recommended)1garlic clove, coarsely chopped3tsp. extra-virgin olive oil, dividedFreshly ground black pepperPinch of sugar (optional)¾oz. Parmesan, finely grated (about ½ cup)2cups tender greens or herbs (such as arugula, basil, dill, and/or parsley)1tsp. fresh lemon juice or vinegar (any kind except distilled white)PreparationDoughStep 1Using a wooden spoon or your hands, thoroughly mix all-purpose flour, whole wheat flour, instant yeast, salt, 1 Tbsp. oil, and ¾ cup plus 2 Tbsp. lukewarm water in a large bowl just until no dry spots of flour remain, about 30 seconds. (If using active dry yeast, mix together yeast and water. Let sit 5 minutes, then stir in both flours, salt, and oil.) Cover bowl with a dish towel and let sit 5 minutes.Step 2Using a wet hand or a bowl scraper, reach slightly under dough and lift one side up from the bottom and pull it up as far as you can without breaking it (this won’t be very far at first), then fold it over and toward the center. Rotate bowl 90° and repeat process. Repeat two more times. Cover bowl again and let sit another 5 minutes, then repeat folding process. Let sit and fold twice more (you will have folded dough a total of 4 times, with a 5 minute rest in between each). Your dough will get smoother and stretchier as you go and sit a bit rounder in the bowl. (You’re building the gluten structure here so that the dough will have lots of little air pockets when it bakes.) Cover bowl with plastic wrap or a silicone lid and chill at least 12 and up to 72 hours. (Dough should look bubbly and full of life, but don’t worry if it hasn’t doubled in size—it will continue to grow during the second rise.)Step 3Fully risen and ready to go in the pan.\nPhoto by Sarah JampelStep 4About 3 hours before you want to eat, take the dough out of the refrigerator. Pour 2 Tbsp. oil into a 13x9” pan; transfer dough to pan and turn to coat. Cover with a kitchen towel and let rise at room temperature until doubled in size—it should look airy, puffy, and nearly fill out the pan, 2–5 hours, depending on the temperature of your room. (If it’s cold in your kitchen, place dough in the oven with the light on. It’s better to be patient than to rush this process. If your dough has risen before you’re ready to bake, you can chill it until you are ready. Let it sit at room temperature 5–10 minutes to take the chill off before baking.)Sauce and assemblyStep 5Meanwhile, make the sauce. Purée tomatoes, tomato paste (if using), salt, anchovies (if using), garlic, and 2 tsp. oil in a food processor, blender, or a medium bowl with an immersion blender. It should look smooth and lighter in color. Season sauce with pepper. If sauce tastes super acidic, stir in sugar. (If using tomato purée, finely grate in garlic, finely chop anchovy, then mix until well combined.) You should have ¾ cup sauce.Step 6Place a rack in lower third of oven and preheat to 475° for at least 30 minutes. With lightly oiled hands, gently lift and  pull out dough from the center so it fills the pan completely. (If it resists, let rest a few seconds, then proceed.) Dimple dough deeply all over with your fingers, then spread a very thin layer of sauce over top all the way to the edges.Step 7Dimpled, coated with sauce, and ready to bake.\nPhoto by Sarah JampelStep 8Bake crust 8 minutes. Remove from oven and quickly spread remaining sauce over crust all the way to the edges. Bake until sauce is mostly set and a shade darker in color and you can see the crust has started to get crispy and brown (use a spatula to take a peek!), 8–10 minutes.Step 9Remove crust from oven and immediately sprinkle all over with Parmesan. Run a knife or an offset spatula around perimeter of pizza to help it release from pan, then let cool 5 minutes.Step 10Pizza, get ready to meet greens.\nPhoto by Sarah JampelStep 11Meanwhile, toss greens, lemon juice, and remaining 1 tsp. oil in a medium bowl to combine; season with salt and pepper.Step 12To serve, transfer pizza to a cutting board, top with greens, and cut into pieces.Step 13Do ahead: Sauce can be made 4 days ahead. Let cool; cover and chill.How would you rate Vegetarian Pan Pizza With Lots of Greens?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleParmesan cheese requires animal rennet (from a sheep intestine) therefore it’s not vegetarian. Switch it out for a vegetarian friendly cheese containing non—animal \nrennet. CJWA1/6/2022That’s not vegetarian. E11/8/2020This is such a good recipe -- feels \"lighter\" than other more cheese-heavy pizzas. I love that you can make the sauce + dough ahead and then cook it for dinner 2 nights later with minimal hands-on time. Also, the sauce is so good I would eat it with a spoon. Considering making it again soon to eat over pasta. AnonymousSeattle. WA10/20/2020Overall a decent recipe! I baked the dough in a rimmed baking sheet but had a bit of a soggy bottom problem...Anonymous8/12/2020So delicious! I doubled the sauce and found that a 28 oz can of whole tomatoes worked perfectly and tried it on store-bought pizza dough and the recipe dough (mine was kind of dense, but I think it was the yeast) and it was fabulous both waysAnonymous8/11/2020I love this pizza!! I used BA's no-knead focaccia instead, though, because the dough in this recipe takes a long time. It was very similar and absolutely delicious. Will 100% be making this again.AnonymousLos Angeles, CA7/30/2020Explore Bon AppétitPizzaItalianEuropeanRye FlourFlourWhole Wheat FlourCanned TomatoTomatoVegetableLeafy GreensMainNut-FreeVegetarianHealthyishSuper BowlDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-28", "author": ["Condé Nast", "Sarah Jampel"]}