{"id": "eb736a86ed38097c804ae8fdde051169", "url": "https://www.bonappetit.com/story/steaming-blanching-poaching-boiling", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "What's the Difference Between Steaming, Boiling, Blanching, and Poaching? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat's the Difference Between Steaming, Boiling, Blanching, and Poaching?Water works.By Sarah JampelMarch 16, 2021FacebookTwitterEmailPhoto by Joseph DeLeo FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Maybe you're the type of person who puts a pot of water on to boil as soon as you walk in the door (or, in these WFH days, at the first sign of stomach grumbles). And kudos to you! Chances are high that you'll find some way to put that pot to use, whether it's to boil (or steam!) a couple of eggs, make rice, cook noodles or pasta, or poach a piece of chicken.Water can do it all. Well, almost—it's pretty useless when it comes to crisping or browning. But it can help you cook your vegetables, proteins, and leftovers to tender perfection with no risk of them drying out or burning. Below, we'll break down some of the most common ways we cook with water so that you can finally understand the difference between blanching, steaming, and boiling broccoli. (Haven't you always wondered?) Here's how—and why and when—to put these four techniques to use:SteamingThis is the technique that takes the most maneuvering: Bring a pot of water to a simmer, then place your food, whether that’s broccoli florets, new potatoes, sweet potatoes, kabocha wedges, fish wrapped in banana leaves, tamales, dumplings, rice, or—a tip we learned from cookbook author Amy Chaplin—a heat-proof container of leftovers, into a metal basket or bamboo tray that fits in pot but sits above the water. Cover the whole contraption.Once you’ve got your set-up in place, steaming is fast (as you may remember from high school science class, steam is hotter than water), versatile (you can cook a whole meal in one go by adding quicker-cooking ingredients later on), and water-efficient (no need to fill a whole pot), all while preserving nutrients and flavors.OXO Stainless Steel Good Grips Steamer with Extendable Handle$20 at AmazonBoilingWe like to boil whole or chopped vegetables when we've already got a full pot on the stove, say for noodles or grains. If your water is well-salted, you’ll also be seasoning from the get-go. Take care with delicate greens like spinach, which will need lots of squeezing post-boil. You’ll also find recipes, especially those from the culinary traditions of Southeast and East Asia, that call for boiling meat like pork, chicken, beef, and bones in order to remove undesirable flavors and/or create a clearer, cleaner-tasting broth.Photo by Chelsie Craig, Food Styling by Pearl JonesBlanchingWhen you throw what you’ve boiled into an ice bath to halt the cooking process and preserve the color and texture, that's called blanching. This is handy for maintaining the sweet freshness of precious ingredients, like first of the season peas or asparagus, as well as removing the clingy skins from tomatoes, peaches, pearl onions, and even almonds and hazelnuts.But in most cases, blanching is not strictly necessary! Unless you’re cooking for a love interest or the Queen, skip the ice bath: Rinsing the veg under cold water in a colander, then spreading them out so they continue to cool, is sufficient.For Korean spinach namul, mature spinach is boiled, then blanchedand squeezed.\nPhoto by Emma Fishman, Food Styling by D'mytrek BrownPoachingPoaching refers to cooking in hot—not boiling—water, a gentle way to approach delicate foods such as fish, chicken breasts, and eggs. It’s healthy, hands-off, and great if you need a blank canvas (hello, chicken salad), but don’t expect crispy bits or textural variance. Be careful about the water temperature—if the water is too hot, fish could curl, meat could toughen, and eggs could scramble.Poached chicken breast can be the perfect base to a springy salad.\nUp your game by adding flavors—citrus peels, a splash of soy, white wine—or switching out the water for olive oil. Though some may say that you're now confit'ing?Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Sarah Jampel"]}