{"id": "eb7d22af089561688f78b153ec3f53d9", "url": "https://www.bonappetit.com/story/okinawa-soba", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "In Okinawa, Soba Is My Ultimate Post-Snorkeling Move  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAn Okinawa Childhood Spent With a Snorkel and Bowls of SobaAfter all these years, the little restaurant near the seawall is still bustling, and the noodles are just as chewy. By Katherine LaGraveNovember 6, 2019FacebookTwitterEmailFacebookTwitterEmailThis piece is part of This Is Why We Travel, a hyper-specific travel guide from Healthyish and Women Who Travel.The Sunabe seawall on the west side of Okinawa, in Chatan Town, is not architecturally significant; just a curl of concrete built to protect the island against lashing waves in typhoon season. Behind it are condos and hotels, restaurants and boutiques. But sit on it, facing the spread of sea, and all you’ll see is water. At sunset, the wall fills with couples who’ve come to watch bright orange puddle into wispy pinks, purples, blues. And to many on Okinawa, the seawall is a reference: “Meet me on the seawall”; “I’m going to the seawall after school”; “I saw him at the seawall,” you’ll hear. For me, it’s a jumping-off point for my favorite thing to do on Okinawa: experience it underwater, and eat soba. Closer to Taiwan than Tokyo, and on a similar equatorial plane as Hawaii, Okinawa has a tropical climate and vibrant marine life—much of it just off Sunabe. On weekends, as a kid, I’d sit on the lip of the seawall, don a rash guard, tighten my mask and fins, and slip into the sea to swim out to the drop off over corals humming with life. It was easy to get lost in the quiet, in the whorls of coruscating fish. But snorkeling wasn’t without its dangers: a black-banded sea snake flaring up from its den, or habu kurage (box jellyfish) trailing diaphanous tails.In the eight years my family lived on Okinawa, more changed than did not. Buildings went up and came down, and protests over the U.S. military presence on the island strengthened and waned. I went from a tween to a teen to something of an adult. But one constant was a feeling, a joy that I got swimming out over ecosystems that had been there thousands of years before I had and that would remain after I’d gone. It was a comfort. Same, in a way, as slurping bowl after bowl of a soup that had become a culinary touchstone decades before I was even born.My family and I first arrived on Okinawa in the tarry pit of night, when I was 13, after my parents accepted jobs as elementary school teachers on the island. A fellow teacher, there to pick us up from the airport, was chipper at 11:30 p.m. My mom and dad mustered sober responses to her inquiries—Yes, the flight was fine; No, we’ve never been to Japan before—while my two siblings and I sat in silence, our heads sloshing in the stew of jetlag.Slowly, then quickly, I grew accustomed to the new life—new house, new school. And I began exploring the island with my new friends who, like me, hadn’t even heard of it before arriving with their families from Minnesota or Germany, Texas or Panama. Most of the time, we’d end up at the seawall.Formerly its own kingdom, and then under U.S. rule for 27 years after Japan’s defeat in World War II, Okinawa “officially” became part of Japan again in May of 1972. (Okinawa is both a Japanese prefecture comprising 160 islands and the name of the largest island in the prefecture.) Due to its history and subtropical climate, unsurprisingly, it has a distinct culture, dialect, and cuisine.In Uchinaaguchi, the Okinawan language, there is a saying: “Aramun jooguu ya duu ganjuu,” or, “One who eats plain food is healthy.” And food plays a factor in longevity: Okinawa has the highest overall global rate of centenarians, and residents here live to be some of the oldest people in the world. In the low-calorie, high carbohydrate diet, popular dishes include goya champuru (bitter melon with eggs), rafute (pork stewed in soy sauce and brown sugar), and soba.Unlike Japanese soba, which is typically made with buckwheat flour, Okinawan soba is formed with wheat flour; the noodles are also flatter, broader, and wavier than their counterparts. Hamaya, which has been open for more than 33 years, is where you’ll find some of the island’s best soba. And so: After hours of snorkeling, I’d dry off, change into shorts and a T-shirt, and walk three minutes from the seawall to Hamaya’s nondescript building with metal roofing and whitewashed brick walls.Hamaya offers soba iterations with yushi tofu (tofu that hasn’t been pressed and formed), tebichi (pig’s trotters), or san-mai niku (three-layered pork). But my order, and the restaurant's most popular dish, is topped with small coins of green onion, soy-flavored yellow egg, and soki, a mass of tender pork spareribs with the cartilage still attached—another Okinawan specialty. The soup is both ordered (from a vending machine near the entrance) and delivered (minutes later) with little fanfare. In hardly any time at all it’s slurped up, gone.Though Okinawa has long been a popular destination for Japanese travelers looking for a little sun and surf, the secret, otherwise, seems to be out: In 2018, the prefecture saw 9.84 million tourists, just shy of Hawaii’s 9.95 million. International flights to Okinawa have increased, and new hostels and five-star hotels have popped up to accommodate the flow of visitors. Even the seawall has been given a makeover. But not everything has changed.When I returned to Okinawa last year, after nearly a decade of being away, Hamaya was still bustling, the metal roofing still overhead. The noodles were as chewy as I remembered, and the broth just as light and deep with flavor. Underwater, the architecture was different every time I put on my snorkel and descended, but my delight of discovery was still there.Explore Bon AppétitHealthyishGo Here NowJapanSobaessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-05", "author": ["Condé Nast", "Katherine Lagrave"]}