{"id": "eb917e4d38a0531011cc138a51cac1e2", "url": "https://www.bonappetit.com/recipe/crispy-pan-fried-shrimp-with-cabbage-slaw", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "Crispy Pan-Fried Shrimp With Cabbage Slaw and Gochujang Mayo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCrispy Pan-Fried Shrimp With Cabbage Slaw and Gochujang MayoBy Joy ChoJuly 11, 20214.8(70)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintWhen it comes to preparing shrimp, I always thought there were just two methods: simply seared in butter or olive oil, or heavily battered and deep-fried. My mom taught me an easy trick that provides a low-effort, barely breaded middle path: dredging seasoned shrimp in cornstarch and pan-frying them over high heat (the high heat and liberal use of oil are key to producing a crispier result). The thin dusting of starch may not seem like much, but it adds texture while keeping the shrimp tender. And they pair well with the vinegar-based cabbage slaw and punchy gochujang-spiked mayo. A bed of farro and a healthy sprinkle of scallions and toasted sesame seeds round out this bright flavor-packed dish. Though the recipe is made up of a few different components, the mayo, slaw, and farro can all be made ahead and assembled with the shrimp just before serving. —Joy ChoAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Pot with Lid$155 At AmazonWooden Spoon$6 At AmazonMesh Sieve$13 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSmall Bowl$13 At AmazonLarge Bowl$18 At AmazonWhisk$10 At AmazonCutting Board$10 At IKEASmall Rimmed Baking Sheet$28 At AmazonLarge Nonstick Skillet$50 At AmazonTongs$13 At AmazonWire Rack$23 At BA MarketIngredients4 servings¼tsp. kosher salt, plus more1cup semi-pearled farro or wheat berries, rinsed⅓cup Kewpie mayonnaise4tsp. (or more) gochujang (Korean hot pepper paste)3½tsp. (or more) honey, divided1tsp. (or more) gochugaru (coarse Korean red pepper powder)½tsp. plus 3 Tbsp. unseasoned rice vinegar½tsp. plus 2 Tbsp. mirin½tsp. (or more) pure or toasted sesame oilFreshly ground black pepper½small head of red cabbage (about 1½ lb.)2scallions1lb. large shrimp, peeled, deveined, tails removed⅓cup cornstarch¼cup (or more) vegetable oilToasted sesame seeds (for serving)PreparationStep 1Cook 1 cup semi-pearled farro or wheat berries, rinsed, in a medium pot of boiling salted water, maintaining a simmer and stirring occasionally, until tender but not mushy, 20–35 minutes, depending on grain. Drain well and set aside. (Alternatively, skip the cooking and use 2 cups leftover cooked grains.)Step 2Meanwhile, make the gochujang mayo. Mix ⅓ cup Kewpie mayonnaise, 4 tsp. gochujang (Korean hot pepper paste), 1½ tsp. honey, 1 tsp. gochugaru (coarse Korean red pepper powder), ½ tsp. unseasoned rice vinegar, ½ tsp. mirin, ½ tsp. pure or toasted sesame oil, ¼ tsp. kosher salt, and several cranks of freshly ground black pepper in a small bowl to combine. Taste and add more gochujang and gochugaru for a spicier sauce or more honey and sesame oil for a milder version.Step 3Next, make the cabbage slaw. Whisk remaining 3 Tbsp. unseasoned rice vinegar, 2 Tbsp. mirin, 2 tsp. honey, and a few pinches of salt and pepper in a large bowl until smooth. Thinly slice ½ small head of red cabbage (about 1½ lb.). (You should have about 4 heaping cups.) Add to bowl with dressing and massage cabbage with your hands until softened and evenly coated, about 30 seconds. Taste and season with more salt and pepper if needed. Thinly slice 2 scallions; set aside for serving.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Spread 1 lb. large shrimp, peeled, deveined, tails removed, out onto a small rimmed baking sheet (a large plate also works). Season liberally with salt and pepper and toss to coat. Return shrimp to a single layer.Step 5Sprinkle ⅓ cup cornstarch evenly over shrimp. Using your hands, press cornstarch into each shrimp so that they’re evenly and fully coated.Step 6Heat ¼ cup vegetable oil in a large nonstick skillet over high. Once oil is hot, reduce heat to medium-high and, using tongs, carefully arrange shrimp in a single layer in pan (you may need to work in batches and add more oil). Cook, adjusting heat if needed and turning once, until barely golden brown, about 2 minutes per side. Transfer shrimp to a wire rack.Step 7To serve, divide farro and cabbage among bowls, leaving any juices from cabbage behind, then scatter shrimp over. Top with gochujang mayo, toasted sesame seeds, and reserved scallions.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronDo ahead: Farro can be cooked and gochujang mayo and cabbage slaw can be made 3 days ahead; cover and chill separately.How would you rate Crispy Pan-Fried Shrimp With Cabbage Slaw and Gochujang Mayo?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleIs nutritional information available?\nThanks PJMMillville, NJ1/31/2022So delicious! I used bulghur wheat instead of farro (didn't have access to farro) and it worked well. The prawns were crispy and delicious, and the sauce was so good. A really tasty, fresh and fairly quick meal to pull together. \n\nI made it with Bon Appetit's \"Smashed Cucumber\" recipe and they worked well together. Also, due to a mishap (I mistakenly used 4 tablespoons of of gochujang instead of tsp - lol) I ended up making a lot of the sauce and keeping it in the fridge and using it as a spread on sourdough toast and adding the leftover smashed cucumbers and cabbage slaw on top - so good.HansweenNew Zealand12/21/2021I wanted to make something different.  There are a lot of ingredients but this is worth the trouble.  Tastes really good and healthy.  I have made it 3 times so far. Kathy DittonCoral Springs Fl11/9/2021This may have a few steps but they are quick and it is so worth it. \nThe slight sweetness of the gochuchung Mayo, the crispness of the slaw and the beautiful shrimp pulled together for a wonderful meal. I used sweet potato noodles instead of the farro and gave them a light coating of the seasoned Mayo so they wouldn’t stick. I also added white pepper to the shrimp seasoning. \nChefs kiss! Kerri Moseley, Va 9/17/2021Loved this dish! Chewy farro is the perfect vehicle for the crunchy slaw and crispy shrimp. I subbed 1/4 tsp cayenne pepper for the gochugaru and the spice level was perfect. Strong heat without overpowering any complexities. \n\nThe dish plates beautifully and I will be keeping this in my repertoire for feeding houseguests!AnonymousChicago, IL8/12/2021Delicious! Good balance of flavors and perfect balance of light/heavy. Don’t skip the cabbage. I’ll have to make it in a taco next time - great idea by another reviewer. Rebecca Houston, Texas7/27/2021This dish is a winner! It was very flavorful and straightforward to put together. Thank you Bon Appetit!DianeSan Francisco Bay Area7/25/2021I’m confused. The photo shows shrimp with shells and tails on but the recipes says  shrimp shells and tails removed. What to do? No shells \n  make senses for a crispy edible shrimp, But  the cover photo clearly shows shells, tentacles and tails on. ??\n AnonymousPhoenix az7/18/2021I used equal parts cornstarch and rice flour for the shrimp coating, which worked quite well. But don’t expect the coating to brown as much as all-purpose flour because this combo just won’t without overcooking the shrimp. The shrimp gets crispy still, despite the paler hue.nratt30NC7/17/2021For anonymous in California.  If you don’t have any nearby Asian stores, you can always order the ingredients online.\n\nI’ve had the gochuang paste for months and am happy to now have a recipe that seems quite popular.  I’ll be making this tomorrow and am sure it will be delicious.AnonymousNew Jersey7/17/2021This recipe is so easy and straight forward, with huge rewarding tastes! I subbed the gochuchang for Sriracha but kept everything else the same as written in the recipe. The red cabbage slaw is so refreshing and can be whipped up pretty quickly for a busy night. We did not add any grains as we are trying to do low-carb and this recipe works fantastically for that. PickyeeeeVancouver, BC7/17/2021This was a great recipe. Will definitely make againAnonymousBoise, Idaho7/16/2021Excellent! Winner winner fried shrimp dinner. Served over white rice and was still a hit. The spicy Mayo is a true gift. Will keep it on hand for all sandwich related meals! Perfection.ManzieLos Angeles7/14/2021Ten out of 10! I actually skipped the farro and served the slaw and shrimp in warm flour tortillas. The sauce was the perfect balance of sweet and spicy. I highly recommend making this, and try it as tacos like I did for a fun twist!Lydia CRichmond, VA7/13/2021Where do I get the Asian ingredients?AnonymousCalifornia7/12/2021Explore Bon AppétitRice and Grain BowlRed CabbageCabbageLeafy GreensVegetableShrimpShellfishSeafoodFarroRice & GrainsWheat BerryEasyQuickWeeknight MealsMainDairy-FreeFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-11", "author": ["Condé Nast", "Joy Cho"]}