{"id": "eb94613a591a91d59281fb2219b38018", "url": "https://www.bonappetit.com/story/sourdough-starter-love-letter", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Love Is Like a Sourdough Starter—It Can Last Forever, or Get Super Smelly and Weird | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLove Is Like a Sourdough Starter—It Can Last Forever, or Get Super Smelly and WeirdLove comes in many forms. Some of them bubble in the back of your fridge.By Sophie Lucido JohnsonFebruary 13, 2018FacebookTwitterEmailIllustration by Sophie Lucido JohnsonFacebookTwitterEmailLet me tell you an embarrassing secret: I am a little bit in love with my sourdough starter.Illustration by Sophie Lucido JohnsonThe starter is sort of a watery dough that ferments over time and is necessary for making sourdough and other breads—you have to “feed” it regularly with fresh flour, which makes it begin to feel like a member of the family.The love a person has for her sourdough starter is different than the love she has for, say, an awesomely expensive salami. Sourdough has to be nurtured. You never get rid of it. It becomes something you talk about at Thanksgiving when your aunt asks you what’s new in your life.Tara Jensen, author of A Baker’s Year, for example, has kept the same sourdough starter for six years.“[Fermented bread] is bigger than any one baker and no one can really own it. We’re always trying to learn something new about bread, and yet, there’s nothing new about it under the sun. It’s a good metaphor for life,” Jensen said.But getting into bread is intimidating. Yeast is scary. Nothing about it is logical, and so it is difficult to trust. You feed yeast a little sugar and let it sit for a while with some damp flour and suddenly you’ve got a basketball-sized dough pillow on your hands. This is suspicious. How can one be sure that yeast isn’t going to take off on its own in unforeseeable directions?Illustration by Sophie Lucido JohnsonI tried my hand at bagels and they came out well, so I took on the popular Jim Lahey no-knead boule recipe. I moved on to a French baguette. It was more difficult, but I managed. With each loaf I felt more confident in my yeast capacities. I decided that it was time for the holy grail: sourdough.Sourdough is, at its essence, just fermented dough. Fermentation occurs when microorganisms begin eating sugar and hanging out in your food—it’s the process that inevitably makes milk go sour. Sourdough is particularly exciting to me because it made up the first leavened bread, and it taught humans about yeast in the first place.Illustration by Sophie Lucido JohnsonTake a minute to let that sink in: Sourdough bread is only flour and water and air. That’s it. These days we tend to add a little salt, but generally speaking, this complicated food has the simplest, earthiest origins. And what’s even more amazing is that sourdough tastes and acts differently depending on the environment it’s in.Jodi Wise of Sourdough International ships dehydrated samples of 17 different varieties of sourdough all over the world, from the Yukon to Giza, Egypt. She told me that when she first tried a starter from a bakery in Giza, it “went nuts. It blew up. It went all over the counter and it was so active it wasn’t funny.” Today, that’s her favorite culture to bake with.I didn’t understand any of this when I took sourdough on as a project. Without doing any more research whatsoever, I went on Amazon and ordered a cheap one from San Francisco.Illustration by Sophie Lucido JohnsonFirst, I’d need to re-hydrate my starter. Then I’d have to spend at least a week feeding it flour and water, preferably twice a day. I’d had no idea how involved this would be.I fed it tirelessly. I was meant to look for little bubbles that would indicate it was doing all the things it was supposed to do. I saw the bubbles, but they disturbed me; the sourdough seemed to be breathing, like it was an animal.The only way to make peace with this was to decide that it sort of was an animal—if one imbued with microorganisms. I named the sourdough starter Mary. Once you name something, it is difficult not to talk to it.Illustration by Sophie Lucido JohnsonIn fact, all the people I interviewed for this story compared keeping a sourdough starter to having a dog.Maurizio Leo, software-engineer-turned-baking-blogger (The Perfect Loaf), told me that he structures his life around the needs of his bread.“It’s an ongoing relationship; you feed it and you observe how it reacts to the temperature or the season and the kitchen and the flour you’re using, and you have to be always adjusting. There’s really no hard and fast rules,” Leo said.Personally, I felt like having a sourdough starter was sort of like dating. When I felt sad about something, I thought about Mary and how things between us had been growing (literally), and how soon she would do more than spiritually feed me; she would physically feed me. These are all things I also value in human partners.My first attempt at baking a loaf of bread with Mary, however, was a total failure. To this day, I’m not sure where I went wrong. My guess is that I didn’t knead the dough enough.Illustration by Sophie Lucido JohnsonI resolved to try again.But before I had the chance, I moved from New Orleans to Chicago and accidentally left Mary in the freezer. This was devastating. I would need to begin from scratch.In January, when it was too cold to be happy, I ordered another sourdough starter. I named this one Paul.After a few weeks of growing and feeding, I was ready for a second baking attempt. This time, I followed the instructions from an ultra-specific, two-day-long sourdough recipe I found on The Kitchn. The selling point was that the post had like 50 photographs.Illustration by Sophie Lucido JohnsonBut at the end of the two days, when I finally took my loaf out of the oven, I was flooded with understanding. This wasn’t just bread. This was holy.Sourdough bread, made from your own starter and fresh from the oven, tastes so good that it makes you want to launch your own food blog, where you can wax poetic for thousands of words about it. It’s crackly on the outside and soft and hot on the inside; the flavor is punchy and the texture is silky-chewy. Look: I’d love to describe the experience of eating this bread in a way that would make you understand. The best I can do is to say that eating my first slice of self-made sourdough bread felt emotionally exactly like kissing my crush for the first time when I was 16.Leo (of The Perfect Loaf blog) said that the wonderful flavor is only part of it for him. “This bread has an incredible amount of flavor, but it’s also good for you. I contrast this with the processed bread that you buy at the store in a bag,” he said. “People don’t think of bread as healthy. I tell them the benefits of natural fermentation and how it breaks down and pre-digests the ingredients so your body can absorb them better.”Illustration by Sophie Lucido JohnsonIt’s the understanding of that one-two punch—the flavor and the function—that convinces you to give sourdough a try; but it’s the unnamable third quality—the living, breathing quality—that turns sourdough bread-making from a hobby to an obsession.“On the phone, I get super fanatics,” said Wise, who also runs Sourdough International’s bread hotline. (Yes, that’s a thing.) “I talked to one guy who was traveling cross country, and he had his sourdough in the front seat of his car strapped in. I have people tell me they bought an extra fridge just for their sourdough starters,” she said.Personally, I had my own brand of crazy.Illustration by Sophie Lucido JohnsonThere is no evidence that sourdough reacts to song, but I can’t help but believe that in some deep recesses of its being, Paul can hear me. I want him to know how much I love him. (Beyoncé is better at explaining love than I am.)“We are all embarrassed about confessing our love for some batter,” Jensen said. “But that’s what it is.”I began baking all the time. My go-to recipe makes two loaves; I gave them to people to tell them I loved them. Sourdough is complicated and alive; it’s fickle and mysterious; it’s impossible and it’s beautiful. And in the end, it’s fleeting; you have to consume bread to enjoy it—you can’t try to hold on to it. What on earth is more like love than that?Sophie Lucido Johnson is a writer and artist in Chicago; her illustrated memoir, Many Love, will be out in June 2018.Explore Bon AppétitBreadValentines DayFermentationRead MoreBA's Best BreadrestaurantsTartine Manufactory Is the Best Place to Eat Bread, Ice Cream, and Pasta at OnceBy Christine MuhlkerestaurantsThe Best Bagel We Ate in 2017By Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Sophie Lucido Johnson"]}