{"id": "eb98ed3712910e8cbeed2c0d20e53326", "url": "https://www.bonappetit.com/recipe/trini-stewed-eggplant", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Trini Stewed Eggplant Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTrini Stewed EggplantBy Brigid WashingtonAugust 2, 20204.7(33)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Sarah JampelEmailPinterestPrintEmailPinterestPrint“In my home country of Trinidad and Tobago, this garlicky eggplant dish, known colloquially as baigan or melongene, isn’t considered a recipe because all it requires is a low flame, a handful of garlic cloves, a generous dash of curry powder, and eggplant,” writes Brigid Washington. “The process of making this dish seethes with a simplicity that defines island life. Folded into the ease, however, are deep flavors rightfully attributed to the island’s vast and vibrant East Indian culture, from which this dish is believed to originate. If you can’t find Chief curry powder, madras curry powder is an acceptable substitute (although not an exact one).” Read more about the origins of the recipe here. Serve with Brigid's Citrusy Chicken Thighs, arugula, and brown rice for an easy summer meal.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCutting Board$10 At IKEAChef's Knife$34.53 At AmazonVegetable Peeler$10 At AmazonMeasuring Spoons$10 At Bon Appétit MarketLarge Skillet with Lid$40 At AmazonLarge Basting Spoon$16.37 At AmazonForkIngredients4 servings1medium globe eggplant (about 14 oz.)3Tbsp. vegetable oil2tsp. Chief or madras curry powder7garlic cloves1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more¼tsp. (or more) Tabasco or other spicy hot sauceCitrusy Chicken Thighs (for serving)PreparationStep 1Cut top off of 1 medium globe eggplant (about 14 oz.) as close as possible to stem. Using a vegetable peeler, remove skin and discard. Slice eggplant in half lengthwise. Lay halves flat on their cut sides, then slice each half lengthwise into thirds to create long slabs. Cut each slab into large cubes.Step 2Heat 3 Tbsp. vegetable oil in a large skillet over medium heat about 30 seconds, add 2 tsp. Chief or madras curry powder, and stir to combine. Reduce heat to medium-low. Add eggplant and stir to coat in oil. Pour in ¼ cup water, stir again, and cover pan. Cook until eggplant is tender but not falling apart, 7–9 minutes.Step 3Meanwhile, peel and finely chop 7 garlic cloves.Step 4Uncover pan and pour in another ¼ cup water. Stir, re-cover, and cook 7 minutes (eggplant should be soft enough to mash easily). Uncover and mash eggplant with a fork. Mix in garlic, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and ¼ tsp. (or more) Tabasco or other spicy hot sauce and cook, uncovered, until garlic mellows and flavors have come together, about 3 minutes. Remove from heat; taste and season with more salt and hot sauce if needed.Step 5Do ahead: Eggplant can be made 3 days ahead. Let cool; cover and chill.How would you rate Trini Stewed Eggplant?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleSo easy to cook and sooooo delicious.  Will be making this recipe again and again.  My favorite eggplant dish, I will be cooking eggplant much more now that I have this scrumptious recipe.  Wooo  hooooo!Mary EllenPortland, OR4/26/2021So easy, so good! A perfect comforting veggie base for any protein of choice. I went with baked crispy tofu. I'm not usually a big eggplant fan because of the skin/texture, but I do like baba ghanoush and this texture looked similar in that way. I'll make this again! CJSan Diego, CA3/11/2021Just made this with the citrus chicken thighs.  So easy and delicious!  I didn't have the curry powder that was called for in the recipe (only the S&B \"oriental\" curry powder) but it still came out great.  Like the citrusy chicken, I feel like this recipe is a great foundation to experiment with!BenLos Angeles, CA1/28/2021Delicious. Was nervous about the amount of garlic it called for at first but I was wrong. It taste delicious. This is sure to be a frequent side in my rotation. Best kind of cooking easy cheap and extremely tasty. MikeNew York 1/13/2021Definitely missing something: acid and sweetness, I guess. Going to go add a squeeze of limeAnonymous10/19/2020The curry is strong in this one.Anonymous10/2/2020Amazingly simple and cheap to make. It was hard not to eat it all by myself in one sitting (with no other accoutrement besides some fresh lemon to squeeze on top). I do think 7 cloves of garlic is a little much To use with only one eggplant, even a large one. Next time I’ll use 3-4 cloves. AnonymousSan Diego9/16/2020Love this--so simple and tasty, over rice or with chicken as suggested!Erin AllinghamPortland, Oregon8/6/2020Easy, tastes great. Put it over rice for a great vegetarian meal. Stephanie LammHouston, TX8/4/2020Thanks a lot, I love it.Pitorro1947Puerto Rico. 8/3/2020so no salting eggplant first to pull out liquid??\nKay BrownReno8/2/2020I make this all the time without the curry, I think this should be called curried egg plant.AnonymousTrinidad8/2/2020Explore Bon AppétitTrinidadianCaribbeanEggplantVegetableSummerQuickEasySideDairy-FreeGluten-FreeVeganVegetarianBraiseKwanzaaDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-02", "author": ["Condé Nast", "Brigid Washington"]}