{"id": "eb9dfeae3f6bafa9d7b0444bb756d831", "url": "https://www.bonappetit.com/recipe/lemon-meringue-pie-2", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Lemon Meringue Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueLemon Meringue PieBy Chris MoroccoOctober 15, 20194.4(41)Read ReviewsTriangleEmailPinterestPrintPhoto by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintA sharp lemon filling, sweet-and-salty meringue, and shatteringly crisp crust combine to make a balanced update to this classic.Ingredients8 servingsCrust2Tbsp. granulated sugar2tsp. Diamond Crystal or 1 tsp. Morton kosher salt2⅔cups all-purpose flour, plus more for dusting1½cups (3 sticks) chilled unsalted butter, cut into ½\" piecesFilling1cup sugar⅓cup cornstarch2large eggs4large egg yolksZest of 4 lemons1cup fresh lemon juice1tsp. kosher salt3Tbsp. chilled unsalted butterAssembly4large egg whites¾cup sugar½tsp. kosher salt¼tsp. cream of tartarPreparationCrustStep 1Whisk sugar, salt, and 2⅔ cups flour in a large bowl. Add butter and, using your fingers, smash each piece into a thin disk. Take your time doing this and don’t feel compelled to break butter into even smaller pieces. Drizzle ⅔ cup ice water over, dispersing it as widely as possible, and mix with a rubber spatula to bring mixture together into a shaggy mass.Step 2Turn dough out onto a surface and work together with your hands, pushing and flattening until dough holds together when squeezed in your palm but some streaks of dry flour are still visible. Divide dough into 2 portions.Step 3Flatten 1 portion of dough into an 8\"-diameter disk. Cut into quarters, stack pieces on top of one another, and flatten dough with a rolling pin to about half of its original height. At this point dough should hold together with no dry spots remaining, and have nice big flakes of butter showing. Use a bench scraper or a large knife to clean any clingy bits of dough from surface. Dust surface with flour, then dust top of dough with flour. Roll out to a ¼\"–⅜\"-thick round. Wrap dough around rolling pin and transfer to a standard 9\"-diameter pie dish. Unfurl into dish, then lift edges and allow dough to slump down into dish. Trim overhang to an even 1\" (there will be some excess). Fold overhang under and crimp as desired. Cover and chill until very cold, at least 1 hour and up to 12 hours (cover tightly if chilling longer than 1 hour). Repeat process with remaining dough and another pie dish. Or form into a 1½\"-thick disk, wrap in plastic, and chill up to 3 days (or freeze up to 1 month).Step 4Place a rack in middle of oven; preheat oven to 400°. Lay 2 sheets of parchment paper over dough and fill with pie weights or dried beans (they should fill the dish). Set on a foil-lined rimmed baking sheet (this will keep any butter drips from smoking up your oven). Bake until edges are golden brown and bottom is opaque (carefully lift parchment to check), 30–35 minutes. Remove from oven; reduce oven temperature to 300°. Lift out parchment and weights. Bake crust until evenly chestnut brown all over, 10–15 minutes. If baking both crusts, turn oven dial back up to 400° and let oven preheat; repeat with remaining crust.Photo by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFillingStep 5Whisk sugar and cornstarch in a large saucepan to combine. Add eggs and egg yolks and whisk vigorously, making sure to get into corners of pan, until smooth and pale. Whisk in lemon zest and juice, salt, and 1½ cups water.Step 6Place saucepan over medium heat and bring to a simmer, whisking often and making sure to get into corners of pan, 8–10 minutes (mixture should be bubbling and thickened). Reduce heat and continue to simmer, whisking constantly, 3 minutes. Let cool 5 minutes, whisking every minute.Step 7Add butter to filling and whisk until melted and fully incorporated. Scrape filling into pie crust; smooth surface. Chill until cold and set, at least 2 hours and up to 3 days.AssemblyStep 8Combine egg whites, sugar, salt, and cream of tartar in the bowl of a stand mixer or another large heatproof bowl; set over a large saucepan filled with 1\" simmering water (bowl shouldn’t touch the water). Heat, stirring constantly, until sugar is dissolved and mixture is warm to the touch, about 4 minutes.Step 9Fit bowl onto mixer fitted with whisk attachment (or use an electric mixer) and beat on medium-high speed until meringue is more than tripled in volume and medium peaks form, about 4 minutes. Transfer to a piping bag fitted with a large round tip (or a resealable plastic bag will work—just snip off a corner after bag is filled). Pipe meringue over filling and toast with a kitchen torch or under the broiler.Step 10Do Ahead: Pie (without meringue) can be made 2 days ahead. Keep chilled.How would you rate Lemon Meringue Pie?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleworked perfectly.  Mixed the pie crust on the first day, blind baked, made the curd, filled and finished the next day. TOTALLY worth the work.  The filling/curd tasted a bit thin initially, but after setting for a few hours turned out to be perfect. I did use a little more zest than the recipe called for, mostly b/c I zested almost every lemon I used, and it took 6+ lemons to get the necessary juice. No torch, so  I just whacked it under the broiler for a minute and it was perfectly crisped.  Heather KDenver, CO3/4/2021Came out great! A question, is the meringue in this recipe Swiss meringue? NicoleLos Angeles, CA12/21/2020Everything about this pie was absolutely incredible. And making it definitely makes you feel like some kind of chef. The result is SO devine that my family was surprised it was not boulangerie bought. \nYes, it takes time to make, but the result is very much worth it. The meringue is sweet yet not sickly and perfectly balances the lemon cream, which set pefectly as well. Everything just went as it was supposed to and that is thanks to he very clear and helpful recipe. As a Frenchie I have had my share of good and bad lemon meringue pies, yet this one really felt like something you would order in a boulagerie or a restaurant. I also liked that the ingredients are simple. \nI halved the crust ingredients and made just one (in the recipe it makes 2 crusts) for convenience, it turned out perfect. AmeliaSaubusse, France12/5/2020This was the most delicious pie I have ever made. Not too sweet, and the meringue had the texture and weight of  whipped cream. \nWe could not stop eating it!\nThe only change I made was to only use 6 egg whites (instead of 8 for two pies). This was what made that meringue so delicious & thick. I will make this a thousand times over. Roberta MunroeLos Angeles California11/21/2020I've made this on thanksgiving and it was wonderful, made it again yesterday because it's a favorite. I think that because my AC isn't working, a couple things went wrong. When making the pie dough the butter melted too quickly and was too sticky, so I had to add more flour and then couldn't mold it in the dish like I could last time. The filling also didn't set as completely, and the meringue didn't hold up as well. I think all the factors are partly due to the temperature so you may need to work more quickly/ whip meringue more/ boil filling more to get it thicker and set in the fridge easy. Still delicious!  cuisinefeenNY7/30/2020This was my first time making lemon meringue pie (a personal favourite of mine) or any pie for that matter, and I am very pleased with the result. The pie crust turned out nice and crisp. The lemon filling set well and tasted a lot like some others I've had and loved in the past. The only problem was the meringue, but that was my own fault. It tasted divine but I probably could have whipped it a bit more. I've now frozen the extra pie dough and can't wait to use it to make another of these in the future and improve on my previous mistakes.lallinationAustralia4/25/2020Loved this recipe! Filling tasted exactly like my great grandmothers recipe... just do not put the pies directly under the broiler, we had some flamage on Easter. I suggest putting the pies on the lowest rack AnonymousNYC4/12/2020\"Too much butter\" are not words I usually say but... the crust has too much butter for my preference.  It baked up greasy and there was a literal lake of melted butter that covered the entire sheet tray when I took it out of the oven - what a waste!  The filling tasted fantastic and was super easy.  after reading the other reviews about it not setting up, I cut the water in the filling from 1.5 to 1 cup.  It set up beautifully.  I will definitely be making this pie again, but next time I'll also cut down the butter in the crust.AnonymousAB, Canada3/16/2020Awesome recipe! Was very successful for today's lupper (dinner but served a little after lunch time). The filling set up perfectly within an hour in the fridge. It was tart and sweet and worked perfectly with the meringue. I was nervous about the pie crust because it tasted weird right out of the oven. I had to cook it much longer after the blind bake and got concerned. However, it ended up tasting great.elvindmtRhode Island1/5/2020This was my first lemon meringue and it was a New Year's Eve showstopper! It came together fairly easily (probably because I used premade crust). The lemon custard set up within an hour without issue, and the meringue was glossy perfection. Next time I'll suck it up and make my own crust, too. Winner!AnonymousAlameda, CA1/4/2020The recipe was very easy to follow, and the pie is delicious. Very lemony, but the meringue balances it nicely. However, the second day the pie was very watery — I’m not sure if it was the filling or the meringue, but there was water in the pie plate. Still was delicious, just with a soggy crust, but would appreciate advice on how to avoid this if anyone knows how!AnonymousBoston12/1/2019Absolutely beautiful recipe. I went through with the filling and meringue as stated; however, I used a different recipe for the crust (already had one out for another pie) and it tasted amazing. The custard is very lemony (in a good way) and the meringue gives a gorgeous gloss. I would only add that I felt like it was overall too sweet for my palate and if perhaps we could be given more information about the meringue (how long can it last? how much time under the broiler?), otherwise, it's a solid pie that was an absolute hit at dinner. AnonymousCairo11/29/2019I used a different crust recipe (already had one left from an earlier batch), but otherwise followed faithfully. Taste is amazing and The recipe is relatively simple. For those whose filling didn't set properly, my best guess is that it was probably slightly undercooked. Could be wrong, but having made a number of curds and custards that's what I usually find is the issue when a recipe is sound. Give it an extra 30-45 seconds on the stove.HitoriKaiCincinnati, OH11/29/2019I made this for Thanksgiving and let me just say, I'm glad my adoring mother was at the table. Man was this a stinker. It never set, even though i refrigerated it for 2 hours (then my at my sister's house). It jiggled each time I moved it, which confused me, given the time in the fridge. then when i served it, it slumped over on the plates. I doubled the recipe to accommodate the pie crust recipe (two crusts). Maybe that was the problem. Doubling it required me to put three cups of water into the filling mixture, which seemed like a lot. The crusts were good but the filling did not hold its shape. Can anyone shed light?mjdeerySan Francisco11/29/2019I made this for Thanksgiving and let me just say, I'm glad my adoring mother was at the table. Man was this a stinker. It never set, even though i refrigerated it for 2 hours (then my at my sister's house). I jiggled each time I moved it, which confused me, given the time in the fridge. then when i served it, it slumped over on the plates. I doubled the recipe to accommodate the pie crust recipe (two crusts). Maybe that was the problem. Doubling it required me to put three cups of water into the filling mixture, which seemed like a lot. The crusts were good but the filling did not hold its shape. Can anyone shed light? mjdeerySan Francisco11/29/2019Explore Bon AppétitPieDessertAmericanLemonCitrusFruitNut-FreeBakingEasterThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Chris Morocco"]}