{"id": "ebbea5b59eb6527b123489618e4323e0", "url": "https://www.bonappetit.com/story/trader-joes-january-2021-reviews", "year": 2021.0, "month": 1.0, "day": 5.0, "content": "Everything New at Trader Joe’s in 2021, Reviewed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTrader Joe’s Kicks Off 2021 With Hell in a JarJoe is either trying to kill me or marry me with these crispy fried habaneros. Plus more reviews!By Alex BeggsJanuary 29, 2021FacebookTwitterEmailFacebookTwitterEmailWell, slather me in cookie butter and roll me in Everything But the Bagel Sesame Seasoning Blend, because 2021 is HERE and so is a ton of new stuff at Trader Joe’s. Including the hottest, spiciest product it’s ever sold. Intrigued yet? I have heartburn! It’s crazy how the years keep coming, presidents change, pandemics rage, and Trader Joe’s manages to find a new way to season nuts. Let’s embark on this journey together, forever.Is That a Crunchwrap?Hatch Chile Chicken WrapsPop one of these hexagons into the oven and your lunch can be a crispy, somewhat dry flour tortilla containing a few tender bites of almost spicy chicken, black beans, and goo sauce. On a walk after this lunch, my partner proclaimed, “My burps taste like gas station.” Which is high praise, depending on what circles you run in. (Never-ending circles.)On TrendUncured Turkey Bacon & Cheese Sous Vide Egg BitesJiggly smooth! Radiate these for a few seconds in your magic box, douse in hot sauce, and squish between an English muffin for optimal results. Alternately, stuff your bra with each bite, then enjoy as a snack later in the afternoon during another boring Zoom.Things That Inch You Closer to TacosHot Hot Crispy Habanero PeppersWOWPeople love chile crisp, so why not crisp chiles? These are crispy, wispy shreds of fried habanero slices. They are the texture of fried butterfly wings. If you eat one straight, you will feel things ignite behind your eyeballs. They are truly hot. Like right on the tongue, HOT. There’s no slow build here, no nuance of flavors and spices. It’s a little shred of hell. And I love it here. On Instagram, a friend we’ll call “Cousin Tony” conjectured that this is the spiciest product Joe has ever sold, and I agree. Previous hot sauces and ghost pepper this-and-that did not come close. Try it yourself!Organic Yellow Taco ShellsBeen AWHILE. Been awhile. These oily shells must be revived in the oven, otherwise, you’ll have chewy, stale folded-over tortilla chips on your hands, which are also covered in oil. They’re so oily! But—thoughtful pause—at least they’re organic.Nut StuffEverything But the Bagel Nut DuoI’m getting tired of this anti-bagel agenda. And these nuts—rancid from sunflower oil past its prime, dry and dusty, lacking the dried garlic integral to the spice mix—sealed the deal. I want everything AND THE BAGEL, Joe. Enough is enough.Guara AlmondsTIL Guara almonds are slightly larger than Marcona almonds. They remind me of the “slightly irregular” socks at T.J. Maxx, my second favorite TJ. They’re fancy, but off-brand fancy. And that’s good enough for me, baby. These Guara almonds are buttery and don’t leave a bitter aftertaste, but they DO leave your fingers glittery with salt. Lick each finger and let the salt commingle with the Purell. There’s nothing quite like it.Grainless GranolaWhat is granola without oats? Sticky seeds all stuck together. Fantastic! One huge clump will satisfy your midafternoon cravings for something, anything, whatever’s closest. It did mine!Someone’s Obsessed With Cacio e PepeSpaghetti Cacio e PepeIt instantaneously congealed on my plate into a mound of gummy worms bound by cacio-e-glue. Baaad.Cacio e Pepe (AGAIN?!) RavioliRubbery ravioli stuffed with ricotta, parm, and pep. Much better than the frozen spaghetti.From the Airline CollectionFrench Onion Macaroni & CheeseIf you miss traveling during this endless pandemic, heat some frozen macaroni and cheese in your oven, eat it directly from the sad little tray, and pretend you’re on a plane. A special edition from Trader Joe’s airline food collection, this slightly oniony baked pasta mush will make you feel full when you’re hungry.Spices, I Mean, “Seasoning Blends”Cuban Style Citrusy Garlic Seasoning BlendInspired by Cuban mojo sauce, which is wet, this is a combination of once-wet things that are now dry. Hmm. I want to bathe in tangy-garlicky-sweet-citrus mojo sauce. Not sure what I’m going to do with this mojo exfoliant. The dehydrated lime zest and lime oil come on STRONG and puckery, and then the garlic and onion make themselves known, while the dried herbs cheer from the stands. Sprinkle it on things you will cook over fire, report back on how it went!Za’atar Seasoning BlendThere’s chickpea flour in this za’atar that seems to serve as filler, making it a little dustier than the Israeli-style blend I get from the Spice House. The lemon oil, another random addition, is overpowering. There are better za’atars out there, or you could DIY, but I appreciate Trader Joe’s for helping people get one step closer to za’atar fish and chips.Sugary ThingsChewy Chocolate and Peanut Butter Protein BarsThe puffed rice is rice-krispie-crunchie. The protein powder doesn’t give me dry mouth or much definition in my abs. And the chocolate is well distributed. Like wearing bike shorts with no intention to bike, I enjoy the delusions of fitness this cookie bar offers. Yum!Partake Crunchy Sprinkle CookiesNotes of nothing, and, oh, a sprinkle, and then more nothing. Interesting aftertaste of something.12 Classic Lemon BarsThe number 12 here makes it seem like you’re getting 12 lemon bars. But each lemon “bar” is a perfect square inch. Four of these squares make up one “bar,” according to my formula chart from the SAT. And while I did terribly on the math portion of the test, I still made good money tutoring kids in algebra once I got to college ($10 an hour). The crust is a little too dry, but the curd is nicely tart.Oil-BasedAvocado Oil SpraySpritzy!Extra Virgin Spanish Olive OilOnce upon a time, Andy Baraghani told me that you should taste olive oil, and if tasting it plain is delicious, it’s good olive oil. Okay, Andy! This cloudy Spanish olive oil tastes like peppery olives that may have been sitting out in the olive bar for a few weeks.Suzie’s Real Organic MayoSuzie loves the truth. Suzie lives in a reality that is real. Whatever she sees before her is as it is. Plain and simple. Not the nuanced reality the rest of us wallow in, our opinions distorted by a few long captions on Instagram and one memorable episode of Bar Rescue. Suzie, though, is free of this nonsense. She is real mayo. With soybean oil, eggs, egg yolks, lemon juice (from concentrate), and white vinegar. The same ingredients in my beloved Hellmann’s, and yet the flavor is sweeter, tangier, and less eggy. So if this is “real” and Hellmann’s is also “real,” which one is realest? They’re living in two separate realities of their own making. And that is a SHAM. I don’t like it one bit. But I’ll choose mine.FishesSesame Crusted Hardwood Smoked Ahi TunaA tasty treat!Oak Smoked Scottish SalmonFantastic!Canned ThingsGreek Chickpeas With Parsley & CuminCumin-forward.Fire Roasted TomatoesWatery, with occasional flecks of burnt tomato skin.New SalamiCalabrese SalamiWhiffs of barnyard. Not very good.See you next month!Catch up:My final 2020 Trader Joe’s reviews complete with Netflix Christmas movie pairingsFall Trader Joe’s reviews, very maple-yPre-pandemic reviews, when the world was growing darker every dayExplore Bon AppétitTrader Joe'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-29", "author": ["Condé Nast", "Alex Beggs"]}