{"id": "ebcf4f27ad44b11761d3081da2f951bb", "url": "https://www.bonappetit.com/recipe/malfatti-with-pancetta-and-cherry-tomatoes", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Malfatti with Pancetta and Cherry Tomatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueMalfatti with Pancetta and Cherry TomatoesBy Ignacio MattosApril 17, 20184.4(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintMalfatti—literally “badly made”—are not as tricky to shape as you think. A lot of fresh pastas are fussy and delicate, but this sturdy gnocchi-esque dumpling dough is a breeze to work with—low pressure, high participation, big payoff. You don’t need any fancy equipment, just plenty of workspace to spread out on. For a long, lazy lunch menu serve this pasta alongside sea bream crudo, tomatoes and haricots verts, grilled turbot, and tiramisù with cookies.Ingredients8 servings1cup all-purpose flour, plus more2cups whole-milk fresh ricotta, preferably box-drained1large egg, room temperature6oz. Parmesan, finely grated, plus more for serving1½tsp. kosher salt, plus more4oz. pancetta (Italian bacon), thinly sliced3Tbsp. extra-virgin olive oil, plus more for drizzling2cups Sun Gold and/or cherry tomatoes2Tbsp. unsalted butter, cut into piecesFreshly ground black pepper½lemonSpecial EquipmentA sheet of cheeseclothPreparationStep 1Dust a parchment-lined rimmed baking sheet generously with flour; set aside. Place ricotta in the center of cheesecloth. Gather up the sides in your hands and wring out excess liquid. Transfer ricotta to a few sheets of paper towels and pat dry with more paper towels.Step 2Pulse ricotta, egg, 6 oz. Parmesan, and 1½ tsp. salt in a food processor to combine. Transfer to a large bowl; sift in 1 cup flour and mix until just barely combined (try not to overmix). Scrape ricotta mixture onto a floured surface and divide into 4 pieces. Roll each piece into a 22x¾\" rope. Cut into ¾\" pieces and place dumplings on prepared baking sheet.ChevronChevronStep 3Combine pancetta and 3 Tbsp. oil in a cold large skillet and set over medium heat. Cook, stirring often, until pancetta is brown and crisp, 6–8 minutes. Using a slotted spoon, transfer to a bowl; reserve skillet.Step 4Meanwhile, bring a large pot of water to a simmer (do not let it boil). Working in batches if needed, cook dumplings until they expand in size and float to the surface, about 3 minutes.Step 5Ladle about ¾ cup pasta cooking liquid into reserved skillet and add dumplings, tomatoes, and butter. Increase heat to medium-high and cook, stirring gently (don’t toss), until sauce thickens slightly and coats dumplings, about 4 minutes. Remove from heat and season with salt and pepper.Step 6Divide malfatti among bowls. Finely grate lemon zest over, drizzle with oil, and top with pancetta and Parmesan.How would you rate Malfatti with Pancetta and Cherry Tomatoes?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI have made this many times.  I like to take the tomatoe skins off the cherry tomatoes and roast them in the overn at 200F for about an hour and half with olive oil and a dash of sugar.  Then cook them with the gnocchi as in the recipe above. Pancetta on top with a zest of lemon.  Always a hit. Simple and elegant.Andrew EPalm Springs, CA9/3/2021I LOVED this recipe. It was a fun, easy recipe to make and made for an impressive meal. I agree with the review to through in some fresh basil - it would make a lovely addition. Don't be intimidated by this recipe if you are a beginner home chef - just follow the steps and you'll be good to go! If you don't want to use pancetta, you could also use bacon, I'd bet. Also a splash of wine wine as the tomatoes are cooking up. AnonymousKent, Ohio6/12/2018This is really, really good and not difficult at all. Grated the parm in food processor ahead of pulsing with ricotta/egg so no grater needed. I didn't have cheesecloth so I just squeezed the ricotta between a few sheets of paper towel and that seemed to work just fine. The dough comes together really quickly and is easy to work with. Going in the regular rotation!Anonymous5/16/2018This recipe was a bit difficult (because you are making pasta by hand after all), but honestly I had a lot of fun making it. My only modification was to add fresh basil when serving, because why not? AnonymousChicago5/6/2018Loved this recipe! It was extremely easy considering you're making fresh ricotta dumplings from scratch. I used regular thick-cut bacon as I didn't have Panchetta and it still turned out phenomenal. I love lemon, so in addition to the lemon zest I squeezed half the lemon in prior to serving. We loved it and will definitely be bookmarking this recipe to make again and again.AnonymousCincinnati 5/6/2018A whole lotta work for what I considered an average result.  Also, messy to put together.  Too many dishes required including pasta pot, frying pan, cookie sheet, food processor, cheese grater and cheesecloth.  Isn't there an easier way?Brigette MartinLouisiana4/30/2018Super duper easy! Whipped it up after a long day at work - and it was delicious - whole family enjoyed it. AnonymousLawn Guyland NY4/30/2018Explore Bon AppétitPastaItalianEuropeanRicottaCheesePancettaCured MeatMeatCherry TomatoTomatoVegetableMainNut-FreeSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}