{"id": "ebd1b286aa82e4a4b063954e546c48c3", "url": "https://www.bonappetit.com/story/girlfriend-sick-make-soup", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "What To Do When Your Girlfriend Gets Sick? Make Soup | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusWhat To Do When Your Girlfriend Gets Sick? Make SoupKaty's COVID-19 symptoms had me panic-buying bidets and sleeping with a hatchet. Then I remembered the kitchen.By Cameron EspositoApril 20, 2020FacebookTwitterEmailIllustration by George WylesolFacebookTwitterEmailOf all the cucumbers in all the world, I am one of the least cool. My nervousness knows no bounds under even the most normal circumstances. I can sweat through a shirt at the slightest compliment or challenge, say exactly the right thing and then beat myself up for not saying it better, or exhaust myself planning out every possible way to relax on a day off. So when my girlfriend, Katy—an immunosuppressed person and true delight of a human being—began to show symptoms of COVID-19 several weeks ago, the first thing I did was panic-buy a bidet.We had plenty of toilet paper at the time, but given the choice to wait to see what would happen next or anxiously purchase an item I will definitely never install in my toilet, I chose the latter. The bidet attachment is still in its box, being used as a doorstop, and will eventually be returned for hopefully every last cent since my live stand-up comedy income has presently dried up.Katy already has about 97 doctors who work together as a team to balance the slew of medications she takes daily to manage her chronic illness, an autoimmune disease she’s been battling for years. Conversely, as she recently pointed out, I have zero doctors I see regularly. (Well, that’s not totally true; I have this beloved hippie chiropractor who fixes my frequently-out-of-whack right shoulder while telling me about his dance career. Besides him, no one.) So in some ways, it was good Katy was the one to get sick. She had all these doctors to call, who, after a cough, fever, and exhaustion turned into extreme shortness of breath and chest pains, suggested we go to Urgent Care.Urgent Care sent Katy to the ER in an ambulance. She’s been in and out of the ER again since—also on doctor’s orders—and never throughout the three or so weeks she’s been sick have I had a true, lasting feeling of calm.So what do I do? I make soup.Besides keeping our apartment bleached and sanitary and for some reason deciding to sleep with a hatchet (it’s making me feel better), soup is all I can do. Katy’s home now resting, and sleeps for most of the day. Her breathing has massively improved. I spend my days overwatering all our plants, attempting to work while heavily distracted, and listening to news podcasts. Relief comes from calls with friends, Zoom meetings with family, and soup.This soup is the only thing Katy wants to eat. It’s a recipe I improvised using flavors she grew up with, some absentminded taste-testing, and a whole lot of love. To make it, I use things like: sea salt, black pepper, enough crushed red pepper flakes that it could be considered a controlled substance, vegetable stock (pre-made and purchased at the dang store), sesame seeds, and sesame oil. Depending on our refrigerator at the time, I also include fresh celery, shallots and Swiss chard, frozen green peas, rice noodles, one egg, a sense of humor, and a low-hum feeling of dread. And I use pre-minced garlic for god’s sake. Don’t need to be mincing my own garlic at a time like this.Substitutions: Mushrooms instead of celery, corn instead of peas, rice instead of rice noodles. Honestly, at one point I even tried beets. FYI that made the soup pink. Whatever veggies are available, I make sure to thinly chop them until I substantially cut my finger and after that, switch to tearing them apart with my bare, Band-Aid-wrapped hands.Making soup is really all I should be trusted to do. For instance, I shouldn’t be trusted to walk, because I tried to go for a walk around the block while masked and gloved-up and became so focused on a cop car across the street—so sure they would ticket me for some unintended slight—that I forgot to look directly in front of me and fell into a large, very visible hole, badly spraining my ankle in the process.I shouldn’t be trusted to drive. I recently leased a Prius after years of driving heavily-used Honda CRVs and forgot to turn the Prius off when meeting Katy’s ambulance at the ER because the car is quiet as hell and has an off button—both modern conveniences to which I am not accustomed. I left the car unlocked and running for the full half-hour during which I attempted to visit Katy and it was still there when I was sent home by myself, unable to see her while the doctors figured out what to do next.When I got home, I made soup.The most important thing in this soup is really the salt, which doesn’t need to be sea salt. I’m not even sure ours is. Just wrote that earlier to seem fancy. I heat the salt plus various items in that one nice saucepan I have, the one I got from my parents, and then simmer it all for a few minutes while pacing nearby. If we have chard, I add it to the soup at the very start, but remember directly after doing so that it will basically dissolve. So then I make fishing it out and returning it to the cutting board for later use into a game by cursing myself with every piece I gather.May I suggest really going for it with the soup-simmer pacing? For instance, earlier this week I hit 10,000 steps walking in circles around my kitchen table. Then I crack an egg in right at the end, after turning the soup up to boiling, and quickly break up the yolk with some sticks—I use chopsticks, but really any two sticks will do. Next, I pour the soup into a bowl while also spilling lots down the side of the bowl, onto the floor and my pants. Finally, I finish with dried seaweed, which floats around and makes the soup look like soup from a restaurant. Then I creep over to the room where my still-sick-but-on-the-mend girlfriend is resting.Fighting the urge to yell, “SOUP’S ON!” I instead wake her up gently. I try to ease my fear while noticing how she coughs on awakening, how her face is thinner than usual, by saying a prayer to whatever God I might believe in. “Please, someone, keep her safe.”Then, as she slowly opens her eyes, and right when I almost forgot, I add back that chard.Cameron Esposito is an American comedian, actress, and podcaster, best known for her show Take My Wife, and her podcast, Queery. Her new memoir Save Yourself is now out.Explore Bon AppétitCoronavirusFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-20", "author": ["Condé Nast", "Cameron Esposito"]}