{"id": "ebdb5e6db09b3d53b0a48393caec3f8b", "url": "https://www.bonappetit.com/story/heads-of-the-table-send-chinatown-love-ruth-li", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "My Chinatown Restaurant Was on the Brink of Collapse. Then the Community Stepped In. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Chinatown Restaurant Was on the Brink of Collapse. Then the Community Stepped In.Ruth Li and her husband have owned their restaurant in Elmhurst, Queens, for nearly 10 years. But when COVID-19 hit, they needed help from Chinatown’s next generation.By Ruth Li, translated by Er Li Peng and interviewed by Elyse InamineSeptember 14, 2021FacebookTwitterEmailRuth Li at her restaurant, BocBoc Chicken Delicious, in Elmhurst, QueensPhoto by Isa ZapataFacebookTwitterEmailThis story is part of Heads of the Table, our celebration of 12 restaurants, people, and organizations that led the industry through the pandemic and beyond. Meet all the winners here.When I first came to the U.S. in 1994, I always worked in restaurants. English was a barrier, so this was one way of making a living. The village I lived in, Ting Jiang [in China’s Fuzhou province], didn’t have many opportunities. I saw a brighter future in the States. First I worked at a take-out restaurant in Harrisburg, Pennsylvania, then I ran my own take-out place in Syracuse, New York. Once my children started going to school, I sold the restaurant and opened a gift shop. But once the whole financial crisis hit in 2008, I shut down the shop and went back to restaurants. We were living in New York City, so I worked at Noodle House in Queens Center in Elmhurst, Queens. Sometimes I was the cashier. Other times I took orders over the phone and packed them.But I wanted to make more money for my children’s college tuition. On a friend’s recommendation we visited a Korean fried chicken restaurant in Flushing. We enjoyed the food so much that we connected with the owners. They said, “You can open a restaurant like this too.” They trained us for a small fee and sold their secret sauce to us. In 2012 we opened BocBoc Chicken Delicious in Queens Center.When I was working at Noodle House, which is now run by another family member, I realized that the mall is a good location because customers come in to shop. It’s very busy. But BocBoc had a rocky start because people were unfamiliar with our restaurant. So we handed out samples—my husband gave it his all to get people to try something new. A taste was all they needed to start lining up. Soon we had a lot of regulars. They loved the fried chicken breast since it could be used in wraps and salads. We made around $2,500 a day in sales. Customers always came back.I first heard about COVID in January 2020. Within the Chinese community information was being passed along. At that point none of the domestic airports here had shut down and people were coming in and out, so I knew that it would come to the U.S. And New York.By March 12 we started wearing masks at the restaurant, and we put up a sign, saying, “We want to keep everyone safe, so at BocBoc, wear a mask.” However, we had already been seeing business go down for a couple months at that point. By March 17 we couldn’t even make $200 a day. On March 19 the mall closed. Then the citywide shutdown happened.Li frying the chicken\nPhoto by Isa ZapataThe beloved fried chicken sandwich at BocBoc Chicken Delicious\nPhoto by Isa ZapataWe were closed from March to September last year, almost half a year. Whereas other restaurants could do takeout, we couldn’t since the mall was closed. No money was coming in, so we couldn’t pay our employees or rent, which was the most nerve-wracking thing. Our rent is $23,000 a month, and we were behind on several months of rent, which added up to around $100,000. Luckily, the mall waived rent from April through August, but we didn’t know this until October. It was the scariest time, the not knowing.I was able to reopen the restaurant last year in September. The entire sitting area at the mall was still closed at that time, which hurt business. Since I have a fast-food restaurant, the food is best ordered and eaten right away. I had applied to PPP [Paycheck Protection Program], which helped with rent and payroll, but it was running out. I considered closing the restaurant.My daughter Lily worked with Send Chinatown Love and helped them with design and writing copy about each merchant they worked with. When they brought on a Chinatown business, they wrote a story about them, then posted it online and on social media to make sure people know these shops are around. When BocBoc shut down, I didn’t even think about asking Lily for help.So around November I reached out to Send Chinatown Love. They interviewed me, wrote up a story about me, and posted it online and on social media to spread the word. They helped me with fast financial relief with a fundraising campaign to raise $20,000. Within the first week we had $4,000. They also created a gift-a-meal program to raise money to buy meals from my restaurant to donate to different nonprofits and charities. We were able to donate 250 meals and receive $2,500.We were also part of Send Chinatown Love’s gift card program, which allows people to purchase gift cards to spend at restaurants working with the organization. Because of this, younger people were coming in to visit the restaurant. They would come to redeem their gift cards and order a $10 meal and leave a $20 tip. Some people would come and use their gift cards, have $5 left over, and just tell us, “Keep it.” It made me so emotional. It really showed me that this younger generation is willing to help and has a big heart. It reminded me there is hope in the world.Now that we’ve gotten PPP and RRF [Restaurant Revitalization Fund], I told Send Chinatown Love to save their money for other restaurants. A lot of chain restaurants have a lot of resources and funds to advertise. But small mom-and-pop restaurants can’t market ourselves as easily since we’re not as good at using social media or technology. We’re focused on making traditional dishes. And even though BocBoc was open for almost 10 years, many people didn’t know us. This is where the second generation of kids have come in. They combine their knowledge about social media and understanding of English with love, empathy, and care for the community. And they’re keeping Chinatown going.More Stories from Heads of the Table:Introducing Heads of the Table, the trailblazing, community-building, future-making leaders changing the restaurant industry for good.How Michael Carter’s time in prison shaped his perspective on the justice system and gave him purpose at Down North Pizza in Philadelphia.Why Farm Club in Traverse City, Michigan, is the least pretentious farm-to-table restaurant you'll ever visit.Restaurants are still struggling, but chef Edward Lee is optimistic about what’s to come.During the pandemic, Francesca Hong went from chef to politician—and she’s not done fighting for food workers.Explore Bon AppétitRestaurantsFirst PersonCoronavirusFuture of RestaurantsHeads of the TableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Ruth Li", "Translated Er Li Peng", "Interviewed Elyse Inamine"]}