{"id": "ebdd95c1b69bc7b40c3114b3292e126d", "url": "https://www.bonappetit.com/story/stasher-bags", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "Reusable Stasher Bags Help Me Banish Single-Use Plastics from My Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingReusable Stasher Bags Help Me Banish Single-Use Plastics from My KitchenI bought my first Stasher bags out of eco-guilt. I didn’t know they would revolutionize the way I cook.By Mehreen KarimJune 21, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I must confess, I was embarrassingly slow to join the masses in reducing my kitchen usage of landfill-destined single-use plastics. While I knew that it would take long-term systemic environmental progress to safeguard the future of our planet, I also knew the least I could do was curb my dependence on wasteful plastic products. But I dragged my feet. Surely, I thought, making the switch to reusable storage containers wouldn’t be easy or efficient, and it certainly wouldn’t be cute. But then I discovered Stasher bags, the reusable, dishwasher-, microwave-, freezer-, and oven-safe silicone pouches that also come in the pastel bubblegum-pink of my Y2K dreams.Photo by Emma FishmanStasher Bags$55 at Amazon (set of 4 small)$22 $15 at Amazon (half-gallon)When I first got my hands on Stasher bags, which I ordered in a variety of colors and sizes, I looked forward to the order they would bring to my fridge—no more stained containers and haphazardly plastic-wrapped bowls cluttering the shelves. It wasn’t long before I had filled my lime-green gallon-size mega bag with dozens of cookie dough balls and a cantaloupe-hued sandwich Stasher with crackers from a half-eaten charcuterie board. Snack- and pocket-size Stasher bags meant I was no longer wasting half-cans of tomato paste or the last chipotle in adobo. And it took me no time at all to realize there’s no better way to store raw meat than inside a lavender midsize Stasher. The leakproof seal means there’s no risk of chicken juice seeping out into your fridge.Another word about that seal—Stasher bags close so tightly (shout-out to Pinch-Loc™ seal technology) that you can even sous vide in them. Place your ingredient of choice—whether it’s a cut of steak or some vinegared onions ready for quick-pickling—in a Stasher bag, submerge in hot water, and let the sous vide magic happen. This guide on how to steam veggies in Stashers allayed any concerns I had about boiling my pretty little silicone pouches, and now I’m fitting more produce into my meals without laboring in front of a stove. Not in the mood to boil even water? Microwave a stand-up mini bag filled with last night’s chicken tagine and basmati, leaving it half-open for optimal ventilation and half-closed to contain splatters and keep that meat moist. This one’s for you, Team No Microwave: You can use the same method to reheat your Stasher leftovers in the oven too. And when you’re done using your them for cooking or food storage, just throw them in the top rack of the dishwasherNow I’m expanding my collection and inching closer to banishing single-use plastic from my kitchen. I knew that making the switch to Stasher bags would be easier on the environment. I didn’t anticipate they’d make my life so much easier too.Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-21", "author": ["Condé Nast", "Mehreen Karim"]}