{"id": "ebe368a364294b033f9a1e7a1d785375", "url": "https://www.bonappetit.com/story/co-fermented-wines", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Co-Fermented Wines Are Our Summer Drink | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWe'll Be Drinking Co-Fermented Wines All Summer LongMade by fermenting multiple grape varieties in one vessel, co-fermented wines are this summer's most delicious drink.By Marissa A. RossMay 22, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Nidia CuevaFacebookTwitterEmailThere is no season more intoxicating than summer, and it’s not because we all have that one friend with a pool, porch, or roof. It’s because long afternoons of hot concrete and wet grass melt into longer evenings of meaty smoke plumes and salty air; so many aromas, textures, and “feels” coming together at once. You want a white, a rosé, a chilled red—you want it all. And that’s why this summer you want to check out co-fermented wines.Co-ferments are made by fermenting multiple grape varieties in one vessel. Red, white, seriously any grape can be co-fermented with another to create a new expression. But don’t confuse these with blends, wines that are fermented separately, then poured together to taste, kinda like daiquiris (I’m kidding!). Think of co-ferments like sunsets: slightly unpredictable because you’re dealing with nature but always beautiful.Some co-ferments have higher percentages of white wine to red, like Sonoma Mountain Winery’s 70 percent Chardonnay and 30 percent Merlot “Char’mer.” Its color is the coral of that decorative plate your parents got in Sedona in the ’90s; it tastes like punchy grapefruit juice. Sam Vinciullo’s “Red/White” is 55 percent Merlot, 45 percent Sémillon, and smells and tastes like green bell peppers stuffed with rose petals off the grill, hit with a squeeze of lime.Because these wines have qualities of both white and red—juicy and high acid plus a soft tannic finish— they work everywhere from the patio to the dining room. Chill one down and hop in the pool, then serve it with salmon, grilled veg, or one of those smash burgers Rapo’s always ’gramming. Why make tough choices about red or white? It’s summer, you can have it all—in one bottle.Explore Bon AppétitHealthyishWinenatural wineTrendsRead MoreLifestyleKrista Scruggs Is Making the Most Exciting, Most Delicious Natural Wine Right NowBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-22", "author": ["Condé Nast", "Marissa A. Ross"]}