{"id": "ebe5604b81b2a58a6059a7390d55ea70", "url": "https://www.bonappetit.com/recipe/ice-water-salad", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Ice Water Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueIce Water SaladBy Molly BazMarch 19, 20195.0(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskyEmailPinterestPrintEmailPinterestPrintFor shaved veg salads with the coldest crunch, submerge the cut roots and tubers in a big bowl of icy water. Instead of oxidizing or drying out, they'll get even crisper as they soak. The best news? You can do this step up to six hours in advance, perfect for when you're prepping for a big dinner party. Set yourself up for a stunning salad by using a mix of multicolored root vegetables, or keep it monochromatic if there’s a single standout at the market.Ingredients4 servings1½lb. mixed crunchy vegetables (such as fennel, radishes, turnips, beets, and/or carrots), tough skins peeled1cup walnuts5oil-packed anchovy fillets2large garlic clovesKosher salt⅓cup extra-virgin olive oil, plus more for drizzling3Tbsp. fresh lemon juice2oz. Parmesan, shaved, dividedSpecial EquipmentA mortar and pestlePreparationStep 1Thinly slice vegetables on a mandoline (they should be about the thickness of a nickel). Fill a large salad spinner (or bowl) with ice water and add vegetables; let sit at least 15 minutes or up to 6 hours. (Cover and chill if letting sit longer than 1 hour.)Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 2Meanwhile, preheat oven to 325°. Toast walnuts on a rimmed baking sheet, tossing once, until deep golden brown, about 9 minutes. Let cool, then crush or chop to about the size of a lentil.Step 3Smash anchovies, garlic, and a big pinch of salt in a mortar and pestle to form a smooth paste. (Alternatively, you can use the side of a chef’s knife to crush the garlic, then mash with the anchovies and salt on a cutting board.) Transfer to a small saucepan and add ⅓ cup oil. Cook over medium-low, stirring often, until garlic is just starting to turn golden brown, about 3 minutes. Transfer to a large bowl and let cool slightly. Mix in walnuts and lemon juice; taste and season with salt.Step 4Skim off any ice cubes from water bath and drain vegetables. Cover salad spinner and spin vegetables, periodically pouring off any collected water as needed, until they are very dry. Add to bowl with dressing and toss to coat. Add half of Parmesan and toss again just to evenly distribute.Step 5Arrange salad on a platter. Top with remaining Parmesan, drizzle with some oil, and season with pepper.How would you rate Ice Water Salad?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThis is a long shot. I am commenting on this recipe in the hopes someone can tell me where in the heck I can find those utensils! They're so pretty! I want these on my table stat. \n\nLike every other recipe I've made from BA, I'm sure this one is delicious. KateMichigan4/25/2021Made this for a dinner party last night.  SO SO good.  Got nervous about numbers so served on a bed of spinach and it was beautiful and delicious.  That dressing was so good- briny and acidic.  I will make this again!AnonymousNew Hampsure12/9/2019Deliciously crunchy and surprisingly satisfying for a simple lunch. I used radishes, beets and fennel as the base and swapped out pecans for walnuts - this dressing is sublime. Topped it all off with pumpkin seeds and homemade croutons. Will absolutely make again. AnonymousTX6/24/2019This dressing is phenom! My chovie-hating boyfriend loved it, too. This salad is also good next day when it has lost some of the crunch and soaked up some more of the dressing flavor. We used fennel, carrots, and broccoli (what we had left in the fridge). Those cruciferous veggies worked well. cgchargingFargo, ND4/6/2019Fantastic dressing... need suggestions for veggies - we are staring at old produce in the markets at this time of year... tough fennel, wrinkled root veggies and sad looking greens.AnonymousVictoria Canada3/29/2019Not a review, a reply to Anonymous.  I love anchovies and when I hide them in pasta or sauces, my anchovy-phobic family do not taste them, only the depth of flavor they add.  But if I am cooking for the vegan, I substitute with a briny olive like kalamata, and some nuts (which the dressing already includes) so try subbing olives, olive paste.robin0575south of the south3/29/2019Looks and reads great! But, I really can't deal with anchovies. Skeeve me! So, I'll try another dressing. Any suggestions!AnonymousSan Francisco3/26/2019Explore Bon AppétitSaladFennelVegetableRadishTurnipBeetCarrotSideGluten-FreeHealthyishThanksgivingLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Molly Baz"]}