{"id": "ec0123bf6eb185bb2d1bdcf7194630cd", "url": "https://www.bonappetit.com/story/chaider-recipe", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "This Chaider Recipe Is The Warming Drink Getting Us Through February | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Chaider Recipe Is the Drink Getting Us Through FebruaryChai + Cider = Chaider, and it's keeping our insides warm all winter long.By Aliza AbarbanelFebruary 8, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Kat Boytsova, Prop Styling by Emily EisenFacebookTwitterEmailIn the middle of February, we crave comfort, and nothing is doing it quite like this chaider recipe. Wait, chaider? Yes, it's a hot apple cider and masala chai mash-up, and it's one of the coziest drinks we've had in ages.We first noticed chaider at spots like Baked & Wired in D.C. and Joe Coffee in NYC, but unlike pumpkin spice, this is a seasonal flavor we continue to crave well into winter. Our version starts by combining apple cider with a fragrant mix of cardamom, cinnamon, ginger, cloves, and peppercorns. Once the chai spices have been infused, black tea bags are added and allowed to steep for several minutes. The final mixture is strained and served with a pat of ghee or coconut oil on top—a next-level move added during recipe development by senior associate food editor Molly Baz. Think of it as a spicy, wintery alternative to bulletproof coffee—that emulsified, butter-coffee mixture popular with keto diet devotees for purportedly boosting energy and keeping you full all morning.“The fat is optional, but it coats your stomach and kind of acts like a way to turbocharge your morning,” says Baz. “The ghee is super nutty and yummy in it, and the flavor really rounds out the sweetness of the apple cider and the spices in the tea.” Add the moderate caffeine boost from those black tea bags, and you’ve got the perfect combination to start out the day.This chaider can be kept in the fridge for up to five days, so we recommend making a big batch on Monday and sipping all week long. When you're ready for a cup, just gently reheat a portion in a small saucepan over medium heat and let your kitchen fill with the smell of warm apple and spice. February's suddenly looking a little lot more doable.Prepare to steep:ChaiderThis chaider recipe is our warm, spiced-up, wintery alternative to bulletproof coffee. It’s a sweet mash-up of masala chai flavors and mulled cider, with an unexpected buttery finish to smooth it all out.View RecipeExplore Bon AppétitHealthyishHot DrinkWinterChaiApple CiderRead MoreLifestyleThese Espresso-Free Lattes Will Make You Cheat On Your Morning CoffeeBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-08", "author": ["Condé Nast", "Aliza Abarbanel"]}