{"id": "ec059e90b06d12f402aa17b2918f676f", "url": "https://www.bonappetit.com/story/fall-soup-season", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "My Mood Is Dark, But the Soup Is Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Mood Is Dark, But the Soup Is GoodThe only thing good about fall is soup.By Carla Lalli MusicOctober 10, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Carla Lalli MusicFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I’ve written before about the feelings of dread and despair that accompany the fall season, and I realize that my perspective may be offensive to the leaf-peepers and sweater-weatherers. I don’t love death and decay, is that so wrong? Seriously. Trying to talk a summer-lovin’, peak Leo person into loving fall is a fool’s errand, so save it. But there are a few techniques I employ when darkness descends on the upper 48, and one of them is soup.Yeah: Soup. You know the saying—soup is good food. It is! It’s also Sunday stuff, which is my favorite day to get a pot of something going early in the day so that you can smell what you’re having for dinner for many hours leading up to it.I make a version of my mom’s pasta e fagioli almost every weekend, as she did when I was growing up. But there’s a never-ending variation on beans, greens, and noodles (or rice) that you can turn to. I love lentils and sausage, or navy beans and escarole, or gigante beans and mushrooms.Want this letter before it hits the website? Sign up for our newsletter!Photo by Chelsie Craig, Food Styling by Rhoda BooneIf you’re a chicken noodle person, there’s a caramelized ginger version that I love, or this chicken and rice with spicy chile oil that’s ridiculously satisfying, or this riff on khao soi that can be made in about an hour.Creamy soup people can have their needs met, too, and when soup-making starts later than it should, it’s Instant Pot to the rescue. Black bean? Check. Split pea? Check. Or maybe you just want to fast-track a batch of homemade stock that you can use in your soup of choice? Chicken stock, vegetable stock—we got you!There are a few keys to any good soup. One is taking your time sweating out the vegetables that go into the base. Whether it’s a bonafide sofrito or just a basic mirepoix, cooking those ingredients until they’re very tender is key to coaxing out maximum flavor in the finished recipe. If you don’t have good stock, use water, but make sure you season every step of the way. If you’re a vegetarian and a soup calls for bacon, pancetta, a ham hock, or another meat as part of the base, feel free to omit it, but add back in a few tablespoons of olive oil to make up for the richness and fat that the porky product would have delivered. Last thing—and this is key—put out thick slices of lightly toasted bread, naan, pita, or a stack of warm tortillas. The tableside dunk is very necessary.Explore Bon AppétitCarla NewsletterSoupFallWinterRead MorecookingWhen You're Cooking Dried Beans, You're Already Halfway to SoupBy Sarah JampelcookingFor Dinner That Comes Together in No Time, Make Red Bean Soup with Taco FixinsBy Deb PerelmancookingThe 4-Ingredient Rice Porridge I Make When I'm Too Sick to CookBy Carey PoliscookingThe Most Opinionated Editors Came Together to Make BA’s Best Matzo Ball SoupBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-10", "author": ["Condé Nast", "Carla Lalli Music"]}