{"id": "ec0bf81096d58daf53a804a5e5d8c0ff", "url": "https://www.bonappetit.com/story/buffalo-cauliflower-wedge-salad", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Buffalo Cauliflower Is a Surprisingly Great Wing Substitute | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBuffalo Cauliflower Is a Surprisingly Great Wing SubstituteThe cauliflower tastes so much like boneless chicken wings, it's unreal.By Alyse WhitneyJanuary 30, 2018FacebookTwitterEmailPhoto by Lauren V. AllenFacebookTwitterEmailTwo foods that I rarely make at home but always order at restaurants are chicken wings and wedge salads. Everything I thought about both dishes changed when I made a Buffalo cauliflower wedge salad.It jumped out at me in the latest Short Stack cookbook, an ongoing series of highly collectable, miniature cookbooks focused on one ingredient. Kristin Donnelly, former Food & Wine editor and author of Modern Potluck, wrote the new cauliflower-centric Short Stack, creating everything from cauliflower pickles to cauliflower rice steak bowls. But I was alllll about this weeknight salad that tastes exactly like chicken wings and has the irresistible crunch of a wedge.This is an ideal salad for salad haters. It's a great compromise for wanting to eat a little healthier this year and get more vegetables into your diet, while still wanting to consume a lot of blue cheese.Here's how to make it:Preheat the oven to 425° and line a baking sheet with parchment paper. Cut one large cauliflower (about 3 pounds) into medium florets and toss in a bowl with 1 Tbsp. cornstarch, 1 Tbsp. melted coconut oil (for high smoke point and a subtle sweetness, but a neutral oil is also okay), 1 tsp. garlic powder, and salt and pepper to taste. Roast for 20 minutes, then stir and roast again until tender—about 10 minutes longer. The cornstarch does wonders for oven-roasted texture, giving it a crispy boost. Do a little taste test for seasoning and texture, toss with ½ cup hot sauce (like Frank's RedHot) in the same bowl, and then roast for about 10 minutes until it's blistered in spots.Also great as Buffalo cauliflower lettuce wraps.\nPhoto by Lauren V. AllenWhile that's cooking, whisk together ¼ cup blue cheese, ¼ cup buttermilk, ¾ cup sour cream, 1 Tbsp. apple cider vinegar, ½ tsp. garlic powder, and 1 Tbsp. thinly sliced chives. Season with salt and pepper, and use a whisk to mash up larger chunks of blue cheese. It'll be tangy from the vinegar, which helps cut through the richness of all that dairy.Once the cauliflower is done, top each wedge with a hefty drizzle of dressing, sprinkle on some extra blue cheese, and arrange the Buffalo cauliflower around it. That way you can cut up the wedge, spear a piece of cauliflower, and build the perfect bite. If you close your eyes, it mimics the flavor and texture of boneless chicken wings. Want more of a deep-fried wing crispiness? Fry the cauliflower! But the roasted is healthier and reheats better. This recipe serves four, but could be transformed into lettuce wraps for a vegetarian option at Super Bowl parties to serve more. Any excuse to eat more Buffalo wing-flavored food is a touchdown.Courtesy of Short StackRecipe reprinted with permission from Short Stack Editions Vol. 31: Cauliflower, by Kristin Donnelly.You could also make Buffalo popcorn as... croutons?Explore Bon AppétitBuffaloChicken WingSaladBlue CheeseSalad DressingCooking Without RecipesRead Morerecipes51 Cauliflower Recipes We Want to Eat All the TimeGallery51 SlidesBy Mehreen KarimWedge Salad with Blue Cheese DressingrecipesOur 23 Best Chicken Wing Recipes for Saucy, Finger-Lickin’ FunGallery23 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-30", "author": ["Condé Nast", "Alyse Whitney"]}