{"id": "ec0c702c43352e48ef8875100a79dc90", "url": "https://www.bonappetit.com/recipe/brioche-au-rhum", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Brioche au Rhum Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueBrioche au RhumBy Ignacio MattosApril 17, 20184.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintBaba au rhum (yeast cakes soaked in rum) but with store-bought brioche. Because only professionals can pull off the real thing. For an over-the-top dinner menu, serve with Romano bean salad, arugula with Italian plums, paccheri with shellfish, grilled red mullet, and grilled bistecca. We said over-the-top.Ingredients8 servings8brioche sliders (about 1½ oz. each), split2¼cups sugar1½cups dark rum42x1\" strips orange zestPinch of kosher salt2tsp. vanilla extract1cup heavy cream16fresh figs, tornPreparationStep 1Preheat oven to 375°. Toast buns, cut side down, on a baking sheet until golden brown, about 6 minutes; let cool.Step 2Meanwhile, cook sugar, rum, orange zest, and salt in a medium saucepan over medium heat 5 minutes. Reduce heat to medium-low and simmer, stirring occasionally, 6 minutes. Pluck out and discard orange zest. Add vanilla and let syrup cool slightly. Transfer ½ cup syrup to a bowl; reserve the rest for serving.Step 3Working one at time, gently dunk and turn brioche in syrup until evenly coated and soaked through, about 30 seconds each. Place on a wire rack set over paper towels; let sit 5 minutes. Repeat dunking process with brioche and let rest 10 minutes (you want them to get sticky).Step 4Beat cream in a medium bowl to medium-soft peaks. Divide brioche among plates and top with a dollop of whipped cream. Arrange a few figs around and drizzle with a bit of the reserved syrup.How would you rate Brioche au Rhum?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleMade this last night. Used fresh figs, but also offered strawberries for the non-fig-lovers in the group. Pretty sweet, but yummy. One caveat: the recipe says use 1/2 cup syrup to dip the brioche in, and save the rest for pouring over. Pretty sure you save the 1/2 cup for pouring over, and use the larger amount for soaking the bread. Otherwise, you won't have nearly enough.fraupNew Mexico7/27/2020Explore Bon AppétitDessertRumAlcohol & Other DrinksEasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}