{"id": "ec0f7c4a3f389e3a480828915d9d3be0", "url": "https://www.bonappetit.com/story/indoor-citrus-plants", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "This Citrus Tree Is An Apartment Game Changer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Is The Year To Grow Citrus Indoors Move aside, succulents.By Joseph HernandezOctober 2, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!Growing up, calamansi was my favorite fruit. My mom used the little citrus in so many Pinoy dishes, steeping some in soy sauce or sprinkling it over garlic rice. The fruit was so sweet, the pith so tart and slightly bitter—I especially loved squeezing the calamansi one at a time, my sharp, feral fingernails capturing a bit of sunshine under my claws.Our calamansi came from the Filipino grocery store, but we were lucky in our citrus bounty: Our matchbook-sized yard was home to a prolific tangerine tree, kumquat tree, and lemon tree (which, in contrast, only ever produced one sad lemon in the entire decade we lived there).I haven’t lived in California for 15 years, but I still think about those citrus trees, especially when New York’s dishwater gray days of winter creep in. Luckily, I now have a slowly growing, sweet little thing of a calamansi tree named Clementine. I purchased her last year from Via Citrus, an online plant company that specializes in the dwarf citrus tree—a few months ago, I procured a Meyer lemon sibling for Clementine, which I’ve named Lem.If you’re a plant parent looking to level-up from pothos and grocery store succulents, consider the citrus tree. The low-maintenance plants thrive indoors and out, as long as there’s lots of light. Over the summer, Clementine and Lem sat outside on my Brooklyn stoop in their colorful Chinatown pots, inching skyward and soaking up as much sun as they could. When autumn turns into winter and I see the first signs of frost, I’ll place them indoors near my south-facing bedroom window for maximum daylight. In a few months, these self-pollinating cuties will produce lovely aromatic blossoms that transform into equally fresh-smelling fruits by January, when I’ll need sunshine the most.My first harvest last year only yielded seven quarter-sized baubles of citrus, not enough for the calamansi-based variation on key lime pie I have been dreaming of making since I first got Clementine. It was, however, enough to make a hot caffeine-free Filipino beverage called salabat, made by steeping ginger and citrus in hot water—perfect for fighting off cold and flu season. (Add a splash of bourbon, as a treat.) For now, I’ll continue imagining the daiquiris, marmalades, and vinaigrettes I will make one day.With Clementine and Lem’s help, of course.Calamondin$65 at Via CitrusPlanters from Ikea, UltraLight Dreams, and Areaware.Explore Bon AppétitHealthyishMarmaladeKey LimeMeyer LemonShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-02", "author": ["Condé Nast", "Joseph Hernandez"]}