{"id": "ec11eb373329301cd068b983e612f6a3", "url": "https://www.bonappetit.com/story/kuniko-yagi", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Kuniko Yagi Moved From Tokyo to the U.S. for Love But Became a Chef Instead | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Moved From Tokyo to the U.S. for Love But Became a Chef InsteadHow Kuniko Yagi went from banker to udon waitress to owning her own restaurant in L.A.By Kuniko YagiMay 21, 2019FacebookTwitterEmailPhoto by Dylan + JeniFacebookTwitterEmailKuniko Yagi is the chef-owner of Pikunico, a karaage fried chicken restaurant in Los Angeles. Born and raised in Japan, she was the executive chef at David Myers’ brasserie Comme Ça and opened the award-winning Hinoki & the Bird with Myers. In this essay, she reflects on her career in kitchens and how gender dynamics in restaurants are changing .I was a banker in Tokyo after I graduated from college. I married someone from L.A. so we moved there, but the marriage only lasted about a year. My family was really against my marriage so I didn’t want to tell them I failed. I couldn’t say, “I got a divorce and now I’m back!” I told myself that I had to stay here and make something happen.I started working in restaurants because there was no other job I could get. I didn’t speak English, and I couldn’t drive, so I biked around Beverly Boulevard until I found a “Help Wanted” poster in front of a noodle shop. It turned out to be Ubon by Nobu Matsuhisa. I worked there as a waitress for a year, but then the restaurant closed. I realized that being a waitress didn’t have career longevity, but cooking can take you anywhere in the world. Even though there were no women in the kitchen at Ubon, I decided to become a chef.One of my regulars told me to look at Zagat to find restaurants, so I biked to Barnes and Noble after my shift and looked for the red book. Then I knocked on the door at the French restaurant Bastide. I interned at Bastide for three months, but they said they couldn’t hire me because I didn’t go to culinary school. So I biked over to Sona, David Myers’ French restaurant, and saw one of my regulars from Ubon in a white chef’s coat. It was David Myers! The entire time I was serving noodles to him, I had no idea that he was the chef at Sona.I told him I was looking for a job and he said, “Maybe we can train you as a back server and you can clear the table and make cappuccinos.’ But I told him I was looking for a job in the kitchen.  He was very hesitant and said, “I don’t think you understand, it’s a very tough job in the kitchen, physically and mentally.” But I asked him to give me a chance and he let me work as an intern chef for a week. Then I asked him for a job. He said I could start from 7 dollars an hour, and that was the best thing I’d heard in a long time. I said, “Okay, seven dollars is wonderful. I can survive.”From the moment I started working in the kitchen, I knew that this was the right call for me. Kitchen jobs are all about the skillset you can perform, and if you cook better and work harder than others, your chance will come. I became the chef de cuisine at Sona and, later, chef at David Myers’ restaurant Hinoki and the Bird. I was really happy there but, after I left, I realized that if you don’t own the concept or restaurant you don’t have control. I decided my next life goal would be owning a restaurant.I saw my peers opening and closing restaurants, and it looked like they did it so easily. Why was it not happening for me?I thought it would be easy, but it took me five years to find the right business partner. Those five years felt like ten years, and I often felt blocked by being a woman. People would never say it, but I think they felt that women don’t have longevity in their careers because they might get pregnant and prioritize family. But a lot of wealthy investors don’t hesitate to invest a big chunk of money in men. I saw my peers opening and closing restaurants, and it looked like they did it so easily. Why was it not happening for me?When I finally met David Lee, the founder and president of Kaizen Dining Group, he didn’t hesitate to talk to me or to invest in Pikunico. I knew I wanted to cook for as many people as I could, so fast-casual made the most sense. I started brainstorming foods that have comforting, nostalgic, craveable qualities, that people don’t necessarily want to cook at home, and I kept coming back to the idea of fried chicken. So many people have experiences and memories tied to fried chicken—it was my weekend cheat meal with my grandma in Japan—and the restaurant evolved from there.This past March, I went back to Japan to cook fried chicken for my best friend’s wedding reception. David Myers was filming for the Michelin guide in Tokyo, so we went to the kaiseki restaurant Tsurutokame together. It’s an all-female restaurant, and, to be frank, I first thought, “This is a different kind of discrimination. Why can’t boys apply?’” But I understood after I ate there.Usually only men work in kaiseki restaurants, and they start very early; they graduate high school and do an internship immediately after. Also the majority of them are sons of high-end restaurant chefs, so they grow up in that environment. I’m the daughter of a policeman—I never thought to go into that world and say “I’m a chef.”Often when you go to a really high-end kaiseki restaurant in Japan, it’s silent. People are focused on enjoying the meal and sake and looking at what the chef is slicing. But Tsurutokame was cheerful. Guests were talking, laughing, smiling at the counter. None of the young chefs were intimidated by their environment. I realized you have to have an example like Tsurutokame to evolve where we are in the culinary industry.As an owner, I care about how my kitchen staff is doing. I try to really communicate with my cooks about what’s happening in their lives, and I try not to bring any of my problems into the kitchen. I want my kitchen to be an oasis, where you can focus 100 percent on cooking to make other people smile.My kitchen is split between men and women. I think that, because I’m the owner, it’s easier for women to knock on the door. Every time someone knocks, it reminds me of my past. I smile and think, Oh wow, you’re like me.Explore Bon AppétitHealthyishLos AngelesChefsessayRead MoreLifestyleWhy I Launched the First Indonesian Food Truck in San FranciscoBy Siska Silitonga MarcusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Kuniko Yagi"]}