{"id": "ec1d796df1638f82d21ba79c0876a2cd", "url": "https://www.bonappetit.com/story/travel-like-a-tourist", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "Stop Telling Me To Travel Like a Local, Okay? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureStop Telling Me To Travel Like a Local, Okay?It’s really the very worst vacation advice.By Mari UyeharaFebruary 27, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn all my years of travel, from twisting off bits of pastry in gold-tinged Vienna coffee houses to stumbling around the jungle-wrapped temple ruins in Cambodia, I have relied on the condensed wisdom of those who knew those places well to find my way through abbreviated stays. I plan my trips like a cultural interloper, making sure to hit the “only-here” greatest hits like the tourist that I very much am. This is not the going wisdom these days.If you have researched a trip in, say, the past five to ten years or so, you may have noticed a recurring and aggressive directive: TRAVEL LIKE A LOCAL! You’ve probably also seen the entreaty, the shaming: How to Not Look Like a Tourist; How to Not Act Like a Tourist; How to Not Be a Tourist.On the surface, the promise is an attractive one: You’re getting the inside scoop for the best places to eat and shop with none of the tourist traps. You know, only the spots that those truly in the know can find. But it’s all a complete farce. At best, “Travel Like a Local” is a silly paradoxical myth; at worst, it’s terrible vacation advice.For one thing, locals aren’t traveling. They are working. Or folding laundry or cleaning their bathrooms or packing lunches or any of the eight zillion other inane chores that somehow take up every minute of your free time when you are NOT on vacation. Locals are not spending leisurely days strolling on stunning promenades or gawking at the crank-your-neck-tall Art Deco buildings or sparkly turquoise waters lapping on fine white-sand beaches. They are making to-do lists in their heads on cramped morning commutes or scurrying between the grocery store, the dry cleaner, and the pharmacy, trying to complete enough tasks before falling into bed. The whole point of travel is to get away from the humdrum of everyday life. It is to very much not be a local.Put it this way: You simply cannot travel like a local. It is a contradiction in terms. Staying at a neighborhood Airbnb in Mexico City’s Roma doesn’t make you a chilango. Parisians don’t nibble on buttery pastries every day for breakfast while overlooking the Seine. And rarely do New Yorkers tuck into a three-hour tasting-menu on a Tuesday night. And locals certainly don’t eat 17 meals in a week at some of the best—and, at times, most expensive—restaurants in town. (Perhaps they are saving up to do so when they go on their own non-local sojourn.)Locals pick up takeout and watch a junky TV drama in their PJs. They’re not going to three museums and a boat tour before draining their bank account on regional textiles, which as a non-local you should definitely not miss! Neither do locals wander around a city with fresh eyes until their feet are sore. These are the unique pleasures of being a tourist.Getting the most out of your visit to a place requires acknowledging both ignorance and vulnerability and that you don’t know much and need some help. There’s nothing wrong with that: remedial cultural lessons are both fun and necessary. I love taking cooking classes, typically chock full of naïve tourists in dorky aprons, and market tours in different cities. Sure, I can and have visited markets without guides and enjoyed it, but having an actual expert to explain ingredients and practices I couldn’t intuit on my own makes the experience all the richer.More than that, being that vulnerable, ignorant non-local sometimes gets you special treatment. Some of my best travel experiences arose from a very un-local ineptitude and the kindness and hospitality shown by actual locals. In a small village in northern Thailand, a woman once closed down her coffee shop, despite my pleas not to, to drive me on her motorbike to rice noodle factory when I merely asked her for directions. In Kyoto, when I asked about ceramic stores at a small coffee shop—because as a dumb tourist I did not know where they are—I got an invite into a couple’s home to learn kintsugi, the Japanese art of repairing broken pottery with gold or silver. I’ve been whisked from an artisan bread bakery to macaron shop in Paris by friends with cheery gusto. Hospitality to visitors is a gift; embrace it with gratitude, not shame.The bid to Travel Like a Local—with suggestions to buy the de rigueur anorak in Copenhagen and study maps on your phone lest you stick out as a foreigner—all seems a little middle-schoolish. At the stage in life when you can book your own trip abroad, you’re old enough to not worry about fitting in. (This is, of course, distinct from respecting local customs on religious and cultural dress.) One of the delicious freedoms in traveling is that no one knows you, that there is a very low likelihood that your ex-boyfriend will happen upon you covered in dust and sweat after a half day of hiking around temple ruins. You can wear a fanny pack or shoes that you don’t mind muddying up. You can ask a stranger for directions. What’s the point of looking like a local when an actual local can help you get where you’re going more quickly?Now that I think about it, acting like a tourist in your hometown—which, yes, I admit is also a contradiction in terms—seems like a better way to approach your everyday life too. Taking a bus tour through town will give you a completely different perspective. Actually visiting a museum—instead of meaning to—is way more fulfilling than sitting on your couch cruising Twitter and Instagram. I’ve never been to the Statue of Liberty in New York or the Emily Dickinson house in my home state of Massachusetts. It’s been years since I’ve visited the Cloisters in upper Manhattan and many months since I’ve hiked through the Mt. Holyoke range 15 minutes from the house where I grew up. That urgent tourist energy to see and do all sorts of things is far superior to the apathy of knowing something will always be there. Maybe it’s best not just to travel like a tourist, but to live like one too.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-27", "author": ["Condé Nast", "Mari Uyehara"]}