{"id": "ec20c97b92f3e3bb255989628d216085", "url": "https://www.bonappetit.com/story/ciao-gloria-brooklyn", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "Ciao Gloria in Brooklyn Is Pastry Heaven and There Are Rainbow Cookies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Have Been to Pastry Heaven and There Are Rainbow CookiesCiao, Gloria in Brooklyn has everything, from banana bread to coffee cake, but the dialed-in Italian rainbow cookies keep me coming back.By Alex PastronFebruary 4, 2020FacebookTwitterEmailPhoto by Noah FecksFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.There are a lot of mediocre Italian rainbow cookies out there. They can either be dry, flavorless, and full of food coloring, or drowning in almond extract and a chalky chocolate coating. The bad tend to out number the good so often that the question logically follows: If getting it right is so hard, why even try at all? Well that’s because when the cookies are good, there’s little else that’s so perfectly fudgy but not dense, sweet but not cloying, satisfying, without putting you over the edge. The promise of greatness is enough to keep me crossing my fingers for a version to love. And at Ciao, Gloria in Brooklyn, the pastry gods made all my cookie wishes come true.Technically, it’s called a Neapolitan tricolor bar, an “offshoot” of the green, red, and white Italian rainbow cookies owner Renato Poliafito grew up eating. His version gives each layer a different flavor that corresponds to its hue—cocoa, vanilla, and strawberry—with a tangy raspberry jam between them to offset the richness of the cake. The whole thing is then enrobed in a bittersweet chocolate coating that has a nice candy-bar-like snap to it.But that’s not the only thing Ciao, Gloria gets right. The Mediterranean blue counter practically overflows with prayer-answering baked goods made by Polifiato and pastry chef Ginger Fisher Baldwin. There are limoncello bars with salty shortbread-pistachio crust, coffee cakes with espresso-tinged batter, flaky croissants filled with pistachio cream, and banana bread that can (and should) be ordered with whipped mascarpone on top.I say go ahead and try them all. Now that you’ve reached pastry heaven, there’s no point in holding back.Go there: Ciao, GloriaExplore Bon AppétitHighly RecommendRestaurantsBrooklynRead MorerestaurantsAlmondine Bakery Is the Only Reason You’ll Find Me in DumboBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-04", "author": ["Condé Nast", "Alex Pastron"]}