{"id": "ec4964dc42d2507d256c0ec5a9e2443b", "url": "https://www.bonappetit.com/recipe/kimchi-fried-grains", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Kimchi-Fried Grains Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueKimchi-Fried GrainsBy Claire SaffitzMarch 20, 20184.8(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintMake a batch of grains on Sunday and you’re within striking distance of a winning dinner on any weeknight (and lunch al desko for days). Case in point: This easy stir-fry, which, when combined with the trusty #putaneggonit, is irresistible. We use kimchi juice to finish; it keeps the grains moist and gives the dish a kick.Ingredients2 servings ½cup kimchi, plus 3 Tbsp. juice from jar4scallions2Tbsp. extra-virgin olive oil2large eggsKosher salt1medium carrot, peeled, cut into matchsticks2cups cooked grains (such as farro, spelt, quinoa, or barley)2tsp. soy sauce1tsp. toasted sesame oilPreparationStep 1Squeeze kimchi over a small bowl to catch juices. Add juice from jar and set aside. Chop kimchi; set aside. Cut dark green tops from scallions and thinly slice; set aside. Thinly slice white and pale green parts and set those aside too. (Whenever you make a stir-fry, you should prep your ingredients in advance, but it doesn’t have to be a whole thing; just scoot these things into their own piles on your cutting board.)Step 2Heat olive oil in a large nonstick skillet over medium-high. Crack eggs into pan; season with salt. Cook, shaking occasionally to prevent sticking, until whites are golden and crisp around edges and puffing up and set near yolks, about 4 minutes. Transfer eggs to a plate.Step 3Return skillet with oil to medium-high heat, add carrot, and cook, tossing often, until slightly softened, about 2 minutes. Add reserved white and pale green parts of scallions and kimchi and cook, tossing often, until scallions are just golden, about 3 minutes. Add grains, soy sauce, sesame oil, and reserved kimchi juices; cook, tossing, until grains are slightly softened, about 2 minutes. Season with salt; divide between plates. Top with eggs, then nori, sesame seeds, and reserved scallion tops.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Kimchi-Fried Grains?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleHow much nori?  How much sesame seeds - are they toasted?VirginiaDetroit1/16/2022I have made this with rice but tonight I used cauliflower/broccoli rice and both were very tasty but different. Originally I used a Korean kimchi but tonight I used a new product from Woolies and preferred the more authentic taste of the Korean version. \nOverall an easy to prepare dish which is very tasty.VegieRoseSydney Australia 7/23/2021This is SO GOOD.  I used locally made kimchi from a vendor at my farmer's market and farro for the grain.  I also added some leftover braised pork shoulder and used more than 3 T of the kimchi juice.  Topped with the eggs and then a drizzle of Zhong Dumpling sauce (from Fly By Jing).  Just writing this is making me crave it again!MBChicago5/2/2021I absolutely love this recipe. Perfect go-to dish for lunch. Haven't tried with cooked grains. But I've had it with white rice, brown rice but I think black rice is my fave. It looks so pretty too with the purple from the black rice. Reheats well for leftovers the next day. I don't reserve the scallion tops and just cook them all together. I usually add in a bit of chopped onion at the same time as scallions. Occasionally stir in a bit of gochujang like a reader suggested which adds a nice kick! Sydney10/27/2020Really good. I would highly recommend adding some raw kitchen in the bowl at the end if you really want that flavor. Otherwise super easy and yummy!Anonymous5/27/2020Lovely. Staring at the bottom of my empty bowl and debating whether to finish off the other serving. Used barley and added some kale in with the carrots. (Note: nori and sesame seeds aren't listed in the ingredient list.)JDMcVancouver4/24/2020Insanely delicious and easy! I used farro and added frozen edamame. Such a flavorful dish to throw together with pantry ingredients. AnonymousSan Diego4/21/2020Great recipe! I fried a small onion in butter and veg oil before adding the kimchi. Added a teaspoon or two of gochujang too. I like to shave a carrot into ribbons with a peeler and saute w salt and pepper until tender and put it on as a topping, but that's just a personal preference :)AnonymousMinneapolis4/6/2020A hidden gem! I added a little onion in place of the scalion, and I used farro! So delightful! AnonymousSeattle11/1/2019Explore Bon AppétitFarroRice & GrainsSpeltBarleyQuinoaEggQuickEasyWeeknight MealsMainDairy-FreeVegetarianHealthyishFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Claire Saffitz"]}