{"id": "ec526b7512edf7507fcc1f64c8b56aa8", "url": "https://www.bonappetit.com/story/plant-based-labeling", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "As Plant Based Meat and Dairy Picks Up Speed, A Labeling Fight Heads to Court | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAs Plant-Based Meat and Dairy Picks Up Speed, A Labeling Fight Heads to CourtWill people want to buy oat milk or Beyond burgers by any other name?By Aliza AbarbanelSeptember 4, 2019FacebookTwitterEmailCourtesy of Impossible BurgerFacebookTwitterEmailOver the past few years, the grocery store refrigerated aisle has undergone something of a revolution. Yogurt, once categorized as either Greek or not Greek, is now made from coconuts, cashews, pili nuts, and almonds. Oat milk has claimed squatters rights at our favorite coffee shops. And at summer cookouts and drive-through windows, burgers are sharing grill space with patties of a decidedly different biological makeup.Plant-based food companies like Just, Impossible Foods, and Beyond Meat have collectively racked up over $1 billion in funding, according to TechCrunch. But now lawmakers, backed by influential meat and dairy industries, are pushing back on the burgeoning industry by controlling the packaging language they're allowed to use.In March, Wisconsin senator Tammy Baldwin reintroduced the Dairy Pride Act “defending against imitations and replacements of yogurt, milk, and cheese to promote regular intake of dairy” after a failed attempt in 2017. And in July, Arkansas’s “Truth in Labeling” law went into effect, imposing fines on companies who use words like “burger” and “bacon” to describe non-meat products. The same goes for dairy: No more “nut cheese”, no more “oat milk.” The Arkansas Bureau of Standards has not yet begun enforcement of the law, which will require plant-based products to changing their packaging accordingly or pull product from the state to avoid the fine.Arkansas’s law is part of a wave of legislation recently introduced in a number of states, including Mississippi, Missouri, and Louisiana, plus the European Union, all seeking to restrict labeling for plant-based products. Proponents say the laws are intended to protect unsuspecting consumers who might grab a carton of almond milk instead of cow’s milk by mistake. But critics are rolling their eyes at this argument, saying that the laws are blatant ploys by the meat and dairy lobbies to keep plant-based competition off the shelves.“Consumers haven’t been confused for 30 years, and I don’t think they’ll be confused in the future,” says Peter Truby, vice president of marketing at Elmhurst 1925, a company that pivoted to making plant-based milk after a 91-year tenure as one of New York’s largest dairy processing plants. “If you [look at] our carton, there are almonds on the package and it says ‘plant-based.’ ”These language bans are largely being pushed in states where agricultural lobbies hold power and sway. Dairy generates 16.4 percent of Wisconsin’s total state revenue. Mississippi’s bill was presented by Rep. Vince Mangold, a poultry farmer who is vice chair of the House Agriculture Committee, and agriculture is Arkansas’ largest industry, with beef cattle farms making up fully half of all farm operations in the state. (According to a story published on the Arkansas Democrat Gazette, the Arkansas Cattlemen’s Association worked with the Arkansas Rice Federation on the bill, which also targets cauliflower rice.)Danielle Beck, Director of Government Affairs for the National Cattlemen’s Beef Association, characterizes this legislation as a response to insufficient enforcement of the FDA’s food labeling law, which requires “imitation” to precede the name of the modified food. “Until the FDA enforces the law as written we support states taking matters into their own hands,” says Beck. “Those laws exist for a reason, just like how words have meaning.”Beck argues there’s an uneven playing field for plant-based products like Beyond that aren’t subject to regulation under the USDA Food Safety and Inspection Service (FSIS), which mandates special processing inspections and pre-production label screenings for meat, poultry, and egg products.But some plant-based food brands are fighting back, claiming that these new laws limit companies’ constitutional rights. In July, meat-substitute brand Tofurky and the ACLU teamed up on a lawsuit against the state of Arkansas, arguing that its language law is in violation of the First Amendment. Similar lawsuits have been filed in Missouri and Mississippi.“It’s fundamentally unfair, un-American, and unconstitutional,” says Jaime Athos, president and CEO of Tofurky. “The government shouldn’t be trying to influence success or failure in the marketplace, but that’s why [reportedly] the Cattlemen’s Association helped to draft the [Arkansas] legislation.”Athos estimates it would cost Tofurky over $1 million to alter packaging and replace noncompliant inventory, but stresses the fight over language is about more than the bottom line. Some companies believe that calling a veggie burger a “burger” or mozzarella made from cashews “cheese” will normalize plant-based eating—now considered a crucial part of the fight against climate change.A recent report by the United Nations’ Intergovernmental Panel on Climate Change concludes that if enough of the world's population shifts to a plant-based diet, carbon emissions could be reduced by up to eight gigatons per year. (For context, the United States emitted 4.8 gigatons in 2017.) Still, we’re a long way from achieving those low-carbon lifestyle eating habits. Dairy sales dropped by 6 percent (while non-dairy milk sales grew by 9 percent) last year, but Americans still consumed a record amount of meat.Many plant-based brands argue that providing familiar products will help ease dietary shifts. The shortage-inducing success of KFC’s Beyond chicken nuggets and Impossible Whoppers shows that an appetite is there—but will people want to buy a “burger” by any other name?“If we don’t use familiar terminology, people won’t know what they’re looking for or what they’re buying at the store,” says Miyoko Schinner, founder of the vegan creamery Miyoko’s Kitchen. “We’re now at a point where we are questioning the impact of food on our health, the environment, and animals, but people are used to eating a particular way. If we don’t provide foods that they’re familiar with, that they can do a 1:1 swap with in their culinary applications, they’re not going to switch.”For now, these preliminary lawsuits will serve as a barometer for how America’s regulated food systems will adapt to shifting preferences and products. But with lab-grown meat set to hit our food system in the next few years, new chapters in this food fight are on the horizon. On August 29, five leading cell-cultured meat and fish companies announced the creation of a joint lobbying group to address regulatory issues head-on. If—and when—the legal debate shifts to lab-grown vs. traditionally farmed, the next generation of alt meat producers won’t just be playing defense.Explore Bon AppétitHealthyishVeganVegetarianTrendsRead MoreLifestyleWhat IS Nut Cheese, Exactly, and Can't We Call It Something Else?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-04", "author": ["Condé Nast", "Aliza Abarbanel"]}