{"id": "ec55d5a79ff98747dac159b380beef71", "url": "https://www.bonappetit.com/recipe/halo-halo", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Halo-Halo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHalo-HaloBy Tiana GeeJuly 6, 20214.3(49)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich EmailPinterestPrintEmailPinterestPrintHalo-halo is one of my favorite summertime desserts. From the Philippines—the name means “mix-mix\" in Tagalog—the refreshing dish layers shaved ice and condensed milk on top of all sorts of ingredients for an end result that packs in lots of contrasting textures, from chewy to crunchy, creamy to sticky. While components vary, you'll find some common add-ins at most halo-halo carts and bars: jellies, flan, macapuno, palm seeds, sweetened red beans, shaved ice, ube ice cream, fresh fruit, toasted coconut flakes, pinipig. My version uses mango jelly with fresh fruit set into it as well as pandan-infused sweetened condensed milk.I encourage you to choose your own adventure, layering the elements in a tall glass or wide bowl. Make sure to use a long-handled spoon to reach everything, and for mixing and swirling. By the end, once things are mostly melted, you can practically drink it. —Tiana GeeAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonLoaf Pan$15 At AmazonSmall Saucepan$155 At AmazonMicroplane$16 At AmazonCitrus Juicer$7 At AmazonSmall Skillet$40 At AmazonIngredientsMakes 4 mango jellyZest and juice of ½ lime¼cup mango nectar2ripe mangoes (preferably Ataulfo), peeled, cut into small cubes (about 2 cups)Kosher salt1envelope unflavored powdered gelatin (about 2½ tsp.)Flan¼cup plus 2 Tbsp. sugar4large egg yolks½cup plus 2 Tbsp. unsweetened coconut milk½cup sweetened condensed milk½tsp. vanilla extract¼tsp. kosher saltCorn and Assembly2ears of yellow corn, shucked, kernels removed3Tbsp. sugar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1tsp. vegetable oil¼cup small sago pearls1½cups unsweetened coconut milk¼cup sweetened shredded coconut1pint Ube ice cream (such as Wanderlust Creamery Ube Malted Crunch)114-oz. can pandan or regular sweetened condensed milk1cup sliced strawberries½cup macapuno½cup drained palm seeds, dyed green or color of choiceSweetened red beans and store-bought toasted pinipig (for serving)PreparationMango jellyStep 1Blend lime zest, lime juice, mango nectar, half of mangoes, and a small pinch of salt in a blender until very smooth.Step 2Heat gelatin and ½ cup water in a small saucepan over medium heat, stirring constantly until gelatin is dissolved. Remove from heat and stir in mango purée. Pour jelly into a 9x5\" loaf pan. Carefully add remaining mangoes and stir to combine. Cover jelly tightly and chill until set, 20–30 minutes.Do ahead: Mango jelly can be made 5 days ahead. Keep chilled.FlanStep 3Place a rack in middle of oven; preheat to 350°. Cook sugar and 1 Tbsp. water in a small saucepan over medium heat, stirring until sugar is dissolved, then cook, undisturbed, swirling pan occasionally and brushing down sides with a wet pastry brush as needed, until mixture turns deep amber, 7–9 minutes. Scrape caramel into another 9x5\" loaf pan.Step 4Whisk egg yolks, coconut milk, condensed milk, vanilla, and salt in a medium bowl to combine. Pour through a fine-mesh sieve into loaf pan with caramel. Cover with foil. Set inside a roasting pan and place on oven rack. Carefully pour hot water into roasting pan to come halfway up sides of loaf pan (a tea kettle makes this easy if you have one).Step 5Bake flan until just set in the center (it should still wobble a little when gently jiggled) and barely golden on top, 55–60 minutes. Let cool (still covered), then chill until cold, at least 4 hours. Do ahead: Flan can be made 2 days ahead. Keep chilled.Corn and AssemblyStep 6Spread out corn on a rimmed baking sheet. Sprinkle sugar and salt over, then drizzle oil over and toss to combine. Roast until crisped slightly but not yet browned and a little sticky, 12–15 minutes. Let cool.Step 7Meanwhile, bring sago pearls and ½ cup water to a simmer in a small saucepan and cook until translucent and firm-tender, 8–10 minutes. Drain, then combine in a small bowl with coconut milk, stirring well to separate pearls. Let cool.Step 8Toast coconut in a small skillet over medium heat until edges start to brown and crisp, about 5 minutes (be careful not to overcook).Step 9Cut flan into 1\"pieces and divide some among tall glasses or wide bowls. Cut out mango jelly into desired shapes and arrange on top, then spoon in ice cream, condensed milk, shaved ice, strawberries, macapuno, palm seeds, corn, sago pearls, toasted coconut, red beans, and pinipig as desired.How would you rate Halo-Halo?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleGrowing up we had halo halo all the time, especially in the summer. However no one had ever made the add ins, except for the flan and ube. I don't eat it with strawberries or mangoes. Try with Jackfruit (langka) it's my favorite. I just bought coconut jelly, red mung beans (mongo) and the langka. Sometimes I'll put macapuno in it. And I use Evaporated milk, tastes better (at least to me.)VeronicaUtah9/9/2021After trying halo halo in a Hawaiian diner, my husband and I joked that this concoction was invented by a thrifty mama with a few spoonfuls of this and that left over who threw it all together in a pretty dish and exclaimed \"oohh is it ever GOOD\" to get her kids to eat it! The diner version was not a hit, but this version looks very yummy with the mango jelly and homemade flan!JZHawaii7/31/2021This looks great! I think y'all forgot the baking step for the flan, though!AnonymousAtlanta, GA7/11/2021halo-halo is the best! 💯🇵🇭christinaseoul7/8/2021Explore Bon AppétitParfaitDessertFilipinoSoutheast AsianAsianMangoStone FruitFruitCornVegetableCoconut MilkOther IngredientsCoconutStrawberryBerrySummerGluten-FreeBakingSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Tiana Gee"]}