{"id": "ec570abf67e24b6a6e68ac2a4a706f44", "url": "https://www.bonappetit.com/story/shift-drinks", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "Are Shift Drinks Bad For Restaurant Culture or a Tool For Change? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIs This Restaurant Tradition Bad For Work Culture or a Tool For Change?Shift drinks—the free drink that restaurant workers often get after work—has come under scrutiny for promoting an unhealthy culture. But there are those who insist it's not to blame. By Priya KrishnaMarch 10, 2020FacebookTwitterEmailPhoto by Xavier Girard LachaineFacebookTwitterEmailWork a grueling shift on the line, or at the host stand, and get rewarded with booze at the end of the night. It’s called the shift drink, and for years, it’s been an unspoken standard of the hospitality business. Once an insider term for restaurant folk, over the past decade the shift drink has become widely known, even giving its name to podcasts, bars, and comedy troupes. Here at Bon Appétit, we’ve called it “one of the restaurant industry’s most hallowed traditions.”But as alcohol consumption has waned nationwide, and the #MeToo movement has lifted the veil on bad behavior fortified by substance-fueled kitchens, a lot of restaurants have started to rethink and renounce the practice. Missy Robbins, the chef of Lilia and Misi in New York, told me, unprompted, that she doesn’t do shift drinks because the practice encouraged inappropriate behavior. A few months ago, Angie Mar, chef of the Beatrice Inn in New York, proclaimed on The Sporkful podcast that she doesn’t let her staff drink at work because that’s not the kind of culture she wants to cultivate. Numerous articles have questioned why restaurants even offer shift drinks, considering the liability factor of providing alcohol in the workplace and the booze-fueled bad decisions they perpetuate.Yet there are plenty of restaurateurs who believe that the industry’s systemic problems can’t be fixed by banning a free cocktail, and that the shift drink can even be a helpful, community-building tool.Stefani Velazquez, co-owner of Tlahuac in Houston, used to always offer employees shift drinks, but she felt that people were focused less on the work, and more on their free drink. Last year, she decided to take a break on shift drinks. “Everything was getting done faster, and people weren’t lingering around,” she says. “It was just a positive environment.” She credits the shift drink ban for this — when people weren’t just working toward booze at the end of the night, she says, they were more present.Irene Li, the owner of Mei Mei Restaurant and Mei Mei Street Kitchen in Boston, did the same two years ago, after she noticed that some employees were having a few too many shift drinks.“We act like this is a benefit to the staff, but it is really not good for them,” she says. “It makes me feel like less of a hypocrite” to not offer a shift drink altogether. She knows it won’t fix every issue at the restaurant, but “it is a value signal,” she says.Similarly, Michael Beltran, executive chef and co-owner of the Ariete restaurant group, got rid of shift drinks not because he thought they were the root cause of problems, but because of what the practice stood for.When Beltran was a young cook, he used the shift drink as a coping mechanism for the difficulty of the job. “At very low points, I thought shift drinks were okay midday,” he says.Not offering shift drinks means changing what employees perceive as the reward for their service, he says. “It is so lazy from a leader perspective to give them a beer and say, ‘Good job.’”“You don’t get benefits, you get free beer instead.”The shift drink custom isn’t always enjoyable for employees, either. “Sometimes when I am working my manager will just come on the floor and hand me a coffee cup that has a beer in it,” says Meghan, who works at a brewery in Vancouver (editor’s note: she did not provide her last name out of fear of losing her job). “It’s kind of awkward because I have to drink it or dump it out, and when you dump it out it seems like you’re not fun.”“You don’t get benefits, you get free beer instead,” she says, adding that it was “very normal” for back-of-house staff to be drinking throughout their shifts.A lot of these chefs do offer benefits in lieu of shift drinks. Beltran organizes boxing classes and team lunches. Larson and Li offer healthcare, and Li sets employees up with mental health professionals with flexible hours. Li believes that getting rid of the shift drink should happen in tandem with providing less grueling work schedules and better compensation—factors that initially drive people to substance abuse.But the reality nowadays is that a lot of restaurant workers see the shift drink as one of the most satisfying parts of the job.“Shift drinks are sometimes the only bright spot when you’re working a twelve-hour Saturday shift,” says Jake Talon, a line cook in Vancouver.“It meant a positive ending to a stressful cruddy day,” says Jessica Nelson, who worked at Araka, a former high-end restaurant in Clayton, Missouri. “It is an affordable perk that the restaurant can offer to foster morale and camaraderie amongst the team.”“One shift drink is not going to replace the fact that you have no days off, no vacation, and it is hot as fuck in the kitchen,” she adds. “But it is better than nothing.”But for all the restaurateurs who have gotten rid of shift drinks and seen positive impacts on their culture, there are owners who have incorporated it in constructive ways.“I want to acknowledge that yes, any business with booze is tricky,” says Kavitha Raghavan, the owner of the wine bar, Indian Paradox, in San Francisco. But shift drinks are okay, she adds, as long as they are framed appropriately. To her, they are an educational tool, since wine is the cornerstone of her establishment. She makes it clear to employees that no one is allowed to drink while there are still customers in the bar. Drinks are poured only when the closing checklist is complete.People have occasionally overdone it, “but it is not the shift drink policy that is causing the challenges, it is more the person,” she says.Sara Jenkins, chef and owner of Porsena in New York and Nina June in Rockport, Maine, also allows shift drinks. Her policy is strict—everyone gets one drink that is entered into the computer so that she has a log of how many were consumed each night.“If you completely ban [shift drinks], people will sneak around behind your back,” she says. “I would rather have it out in the open, controlled and monitored and accounted for.”She adds that the industry often attracts people with a history of substance abuse, and “you can either encourage that or set a tone where you treat everyone with respect and set firm boundaries,” she says. The conversation shouldn’t be around shift drinks; it should be about leadership and building trust.“There is this puritanical attitude that alcohol is inherently bad,” she says. “You have to have an awareness that it can get out of control really fast, but on its basic premise, a shift drink is not a bad thing.”Explore Bon AppétitHealthyishRestaurantsAlcohol & Other DrinksTrendsRead MoreLifestyleAt These Restaurants, Staff Runs Are Replacing Staff Bar NightsBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-10", "author": ["Condé Nast", "Priya Krishna"]}