{"id": "ec623968e8c807cdb539de7876e1ada8", "url": "https://www.bonappetit.com/story/fruits-and-vegetables-you-shouldnt-be-refrigerating", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "8 Fruits and Vegetables You Shouldn't Be Refrigerating | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking8 Fruits and Vegetables You Shouldn't Be RefrigeratingKeep them on the counter, people!By Alex DelanyAugust 10, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailIn an ideal world, you’d never need to put produce in the fridge. You’d go to the market before each meal, pick up your locally-grown vegetables, walk home, unpack, and start cooking right away. There’d be no need for refrigeration at all. And that sounds nice, but that’s definitely not the world we live in. Some produce needs to go in the fridge, because we don’t have the time or energy to go to the market three times a day.But there are also some fruits and vegetables that would prefer to be left out on the counter. Or in a little ceramic pot on top of the fridge. Or in a cabinet under the drawer where all your spoons and ladles go. You shouldn't just go throwing everything in the fridge. Here are the fruits and vegetables that are best kept outside the fridge:TomatoesTomatoes do best on the counter, in the warm light of the sun (assuming you have a window in your kitchen), where they can ripen to absolute perfection. Putting a tomato in the fridge does weird things to it’s texture, making the flesh mealy and unpleasant. And when we're shelling out cold hard cash for heirloom tomatoes at the peak of their season, preserving that perfect texture and juicy flesh is our number one priority.Christina HolmesGarlic, Onions, and ShallotsWith the exception of spring onions and scallions, alliums shouldn’t be stored in the fridge. These bulbs benefit from being kept in a cool, dry, dark place. And make sure to avoid wrapping them in plastic bags. Your shallots, onions, and garlic want to breathe! And breathing in a plastic bag isn’t the easiest thing to do.Hard SquashesYou should store summer squash (like zucchini) in the fridge, but thick-skinned squash like acorn, butternut, or kabocha should stay at room temperature. This is partially to preserve their texture, but it’s mostly because squash tend to take up a lot of real estate in the drawers and on the shelves of your fridge. It’s crowded enough as it is in there, so keep those hard squash out on the counter and save that space for something else.Photo by Alex LauPotatoes and Sweet PotatoesSimilar to the alliums we were talking about earlier, you want to store these starchy vegetables in a cool, dry, dark place. This keeps potatoes from sprouting, which is facilitated by sunlight and moisture. Sprouting your potatoes won’t result in more potatoes, just the added chore of trimming off the sprouts (which taste terrible and have some potentially harmful compounds in them).CornCorn isn’t really a vegetable—a story for another time—and it doesn’t really belong in the fridge. But that doesn’t mean that you can’t call it one...or put it in the fridge. Putting corn in the fridge isn't going to hurt it per se, and it may keep it fresher longer, but if you're going to use it within a day or two you might as well leave it out and free up some fridge space.Alex LauStone FruitLike tomatoes, putting stone fruits—think plums, peaches, and cherries—in the fridge can make their flesh go mealy. So if you want that incredible, silky, juice-dripping-down-your-chin bite, leave them out on the counter.PineappleOnce you pick a pineapple, it doesn't get any riper, so you should try to buy a perfectly ripe pineapple with the intention of eating it sooner rather than later. That also means that you should just leave it at room temperature—keeping it in the fridge isn't going to have an effect on its ripeness.MelonsYou could put melons in the fridge...if you really wanted to. But we prefer to eat melons at room temperature, so the flesh is as soft as possible. Changing the temperature of the melon will tense up the interior, possibly making it a tad less succulent.Now, let's use those room temperature tomatoes:A Rent Week Tomato Sauce for August and BeyondCheap? Yes. Tasty? Yes. Easy? Yes. Simple? Yes. Versatile? Yes. Should we start? Again, yes.View StoryExplore Bon AppétitBasicallyVegetableStone FruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-10", "author": ["Condé Nast", "Alex Delany"]}