{"id": "ec639c736af398a69babd20c532178c8", "url": "https://www.bonappetit.com/recipe/mini-baked-alaskas", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Mini Baked Alaskas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueMini Baked AlaskasBy Cheryl DayOctober 19, 20213.4(8)Read ReviewsTriangleEmailPinterestPrintPhotograph by Christopher Testani. Food styling by Victoria Granof. Prop styling by Alex Brannian.EmailPinterestPrintEmailPinterestPrintThe idea of making a baked Alaska may seem daunting, but these petite desserts from Cheryl Day’s Treasury of Southern Baking can be broken down into easy-to-make components that can all be made ahead of time. Feel free to use any flavor ice cream for the center. We prefer to use a kitchen torch to brown the meringue, but in a pinch you can brown the baked Alaskas under a broiler—just watch them very carefully and rotate often.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronKitchen Torch$38 At AmazonRound Cookie Cutter Set, 12-Pack$12 At AmazonStand Mixer$460 At AmazonInstant-Read Thermometer$35 At ThermoworksOffset Spatula$12 At AmazonScale$25 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients6 ServingsCakeUnsalted butter or nonstick vegetable oil spray (for pan)1¾cups (219 g) all-purpose flour, plus more for pan2large eggs, room temperature1large egg yolk, room temperature1cup buttermilk, room temperature1cup lukewarm brewed coffee½cup vegetable oil1tsp. vanilla extract1¾cups (350 g) granulated sugar¾cup (60 g) Dutch-process cocoa powder2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt2tsp. baking soda1tsp. baking powder2oz. (57 g) bittersweet chocolate, melted, slightly cooledMeringue and Assembly½cup (160 g) strawberry or raspberry jam1quart any flavor ice cream4large egg whites1cup (200 g) granulated sugar1tsp. cream of tartar1tsp. vanilla extractspecial equipmentA 3\"-diameter round cookie cutter (not fluted); a kitchen torchPreparationCakeStep 1Place a rack in middle of oven and preheat to 350°. Butter a rimmed 18x13\" baking sheet or lightly coat with nonstick spray. Line with parchment paper; lightly butter or coat parchment and dust lightly with flour, tapping out excess. Whisk together eggs, egg yolk, buttermilk, coffee, oil, and vanilla extract in a medium bowl.Step 2Mix granulated sugar, cocoa powder, salt, baking soda, baking powder, and 1¾ cups (219 g) flour in the bowl of a stand mixer fitted with paddle attachment on low speed until combined, about 1 minute. Add egg mixture in 3 additions, beating on medium speed 30 seconds after each addition. Add melted chocolate and beat, scraping down sides of bowl to ensure everything is well mixed.Step 3Scrape batter into prepared baking sheet and rap on counter to level. Bake cake until a tester inserted into the center comes out clean, 20–25 minutes. Let cake cool 15 minutes, then run an offset spatula along edges to loosen. Set a wire rack upside down over baking sheet and flip over to release cake. Carefully peel away parchment paper and let cool completely.Meringue and AssemblyStep 4Transfer cake to a cutting board. Cut out 12 rounds with cookie cutter (leftover scraps are for snacking). Top 6 cake rounds with a 1 Tbsp. dollop of jam each; sandwich with remaining cake rounds. Place each cake sandwich on an 8\" square of plastic wrap (lightly moistening the counter will help plastic stay flat).Step 5Just before serving, heat egg whites, granulated sugar, and cream of tartar in the bowl of a stand mixer set over a saucepan of barely simmering water (do not let bowl touch water), whisking constantly, until sugar is dissolved and an instant-read thermometer registers 120°, 5–7 minutes.Step 6Soften ice cream just enough to be able to scoop with a #8 ice cream scoop (or a heaping ½ cup). Arrange a scoop of ice cream, flat side down, on top of each cake sandwich. Pull plastic wrap up and around cake and ice cream and twist to seal tightly. Freeze until ice cream is very hard, at least 1 hour.Step 7Fit bowl onto stand mixer fitted with whisk attachment, add vanilla extract, and beat on medium-high speed until meringue forms stiff, glossy peaks, about 5 minutes.Step 8Unwrap ice cream domes and place on individual heatproof plates. Working quickly, spread meringue over domes with a spoon or small offset spatula, making lots of decorative swirls and peaks all over. (You can also use a pastry bag fitted with a large fluted tip and pipe meringue over each dome.) Make sure all of the ice cream and cake is covered. Toast meringue with kitchen torch until golden.Do ahead: Ice cream domes can be assembled 3 days ahead. Keep frozen. Cover with meringue and toast just before serving.Recipes adapted with permission from ‘Cheryl Day’s Treasury of Southern Baking’ by Cheryl Day (Artisan Books). Copyright © 2021.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Mini Baked Alaskas?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI made these for Christmas Eve, 2021. I followed the recipe but made some changes which I think will be helpful: I made the cake and followed the directions, once the cake cooled I cut out the 3 inch diameter individual cakes. I cut each cake in half horizontally so I ended up with a lot of little cakes which I froze and will use for my next dinner party. I mixed the raspberry jam with some Grand Marnier and spread that between the layers. I made homemade vanilla ice cream and a scoop was perfect. I froze them overnight and made the topping after dinner, it made so much. But it was a perfect dessert and so delicious. I make large Baked Alaska's all the time and this was quite fun. Everyone raved. My next dinner party in New Year's Eve and I will make this again with my homemade salted caramel ice cream e TraversoSonoma CA12/26/2021Why is there no print option?AnonymousAtlanta12/19/2021Steps 5 and 6 need to be reversed.AnonymousHartford CT11/17/2021Explore Bon AppétitDessertBakeButterCoffeeAlcohol & Other DrinksChocolateOther IngredientsJamCakeEggRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Cheryl Day"]}