{"id": "ec6a592a74efa759184e5da26346bd67", "url": "https://www.bonappetit.com/recipe/the-garlickiest-fried-rice", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Garlic Fried Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueThe Garlickiest Fried RiceBy Andy BaraghaniSeptember 18, 20184.9(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintFried garlic boasts an incredible ease-to-“wow” ratio—put slices of garlic in cold oil, crank the heat, and fish them out when they’re bronzed. But also the oil that’s left behind is a flavor-packed product all its own, just waiting to be whisked into sauces or turned into a cooking medium for the most aromatic fried rice that ever was. Dried-out cooked rice is the best option for stir-fries as the grains will get really crunchy.Ingredients4 servings8garlic cloves, thinly sliced⅓cup grapeseed or vegetable oilKosher salt12\" piece ginger, peeled, finely chopped1large egg, beaten to blend3cups chilled cooked short-grain rice2tsp. toasted sesame oil4scallions, thinly sliced on a diagonal¾cup coarsely chopped cilantro2tsp. toasted sesame seedsPreparationStep 1Toss garlic and grapeseed oil in a large nonstick skillet. Arrange garlic in a single layer and set over medium heat. Cook, shaking pan often, until garlic is barely golden and crisp (oil should stop bubbling at this point), about 5 minutes. Using a slotted spoon, transfer garlic chips to paper towels to drain; season with salt.Step 2Increase heat to medium-high and cook ginger in oil in the same skillet, stirring occasionally, until just softened and fragrant, about 2 minutes. Add egg and stir to break up; cook until just set (this will take a matter of seconds). Add rice and sesame oil and toss to combine. Cook, undisturbed, pressing down on rice with a spatula so it makes good contact with the pan, until rice begins to crisp, about 2 minutes. Give rice a toss, then press down on it again, cooking until you get more crispy bits, about 2 minutes. Remove skillet from heat and toss in scallions and half of garlic chips; season with salt.Step 3Transfer fried rice to a platter and scatter cilantro, sesame seeds, and remaining garlic chips on top.Step 4Do Ahead: Garlic chips can be made 1 day ahead. Store airtight at room temperature.How would you rate The Garlickiest Fried Rice?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleCan I substitute brown rice?mlerylLong Island, NY1/19/2022I make this fried rice weekly. Simple, excellent flavors, pushed this non-reviewer to encourage EVERYONE to put this on their meal plan. Thanks Andy!KaylynTampa, FL12/29/2020Super easy recipe, and very yummy! Maybe my scallions were large, but I simply didn't need four?? More like 1 or 2 haha. Loved the dish :) Anonymouscalifornia 6/10/2020Love this recipe and shocked it doesn't have more reviews! It's soooo flavorful, savory, and just plain delicious. An easy and quick way to dress up some fried rice. I also like to finish it off with a big squeeze of lime and a dash of red pepper flakes. Have made it several times now... just wish I had a mini mandolin for the garlic. AnonymousFlorida4/16/2020Had doubts every step of the way but it was absolutely amazing.AnonymousNew Zealand 2/26/2020My husband and I loved this recipe! It comes together so quickly and it's absolutely delicious! I cut the recipe in half since there's just the two of us but soon I was wishing I made the full recipe! I'll definitely be making this again!Holly AltNew Berlin, WI7/12/2019Yes, yes, yes, a thousand times YES! This was amazing! I let it cook longer for maximum crunchiness and it was so delicious. Not a great keeper for leftovers though unless you were to re-fry it. AnonymousFlorida2/19/2019This was excellent and my family raved about it. I kept things simple by going tony local Chinese food place and getting a large order of white rice. The trickiest part is getting the garlic to not burn. You have to keep a sharp eye on it and take it out as soon as you start to see a little bit of color on it otherwise it will burn. Will def make again. AnonymousNyack, NY2/7/2019Absolutely delicious! I decided to try this on a whim and ended up eating it all myself! I made more for dinner and even my mother loved it, she is very picky. Hands down the best garlic fried rice recipe :)JellykupCalifornia10/31/2018This was amazing! Really takes rice to the next level. Fed to a family of 8 and they all loved it. Will be making again and again! lilamadeleineAustin, Tx10/23/2018Explore Bon AppétitFried RiceChineseEast AsianAsianGarlicVegetableGingerHerbs & SpicesScallionOnionWeeknight MealsEasyQuickOne-Pot MealsSideMainDairy-FreeSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Andy Baraghani"]}