{"id": "ec7b470abf0521b171665cda8df47f82", "url": "https://www.bonappetit.com/story/72-hours-taipei-taiwan", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "72 Hours in Taipei, Taiwan in 14 Seriously Delicious Photographs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eatWe Spent 72 Hours Eating as Much as We Could in TaipeiMile-high shaved ice. Crispy golden crullers. Steaming vats of rich noodle soup. With a Taiwanese-American as his guide, photographer Alex Lau shows us what a long weekend in Asia’s most underrated food city looks (and tastes) like.By Sue LiMay 20, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn Taipei you can eat out-of-this-world soup dumplings with skin so thin it’s almost translucent, like you’d find in Shanghai. Mouth-numbing noodles with crunchy chili oil, like in Sichuan. The crispiest Peking duck with shattering skin just as good as in Beijing. But the capital of Taiwan, a small autonomous nation in the shadow of China, also has a cuisine all its own. Steaming bowls of beef noodle soup with meat so tender it’ll melt in your mouth. Finely shaved ice dotted with chewy tapioca balls and drizzled with sweetened condensed milk. It’s one of the reasons I return regularly to the city I was born in. My brother, parents, and I emigrated from Taipei to north Texas in 1990, trading our language and the city’s colorful alleys for strip malls and pickup trucks. Each time I return I am delighted and surprised by my hometown. And I love to introduce my friends to the city, which is how BA’s Alex Lau ended up with me on a whirlwind 72-hour tour, watching vendors roll out flaky flatbread at 5 a.m. and sampling stinky tofu after dusk and capturing it all on film.Photo by Alex LauBubble TeaBefore your mom said she was “into” bubble tea, it was on street corners all over the city (this one’s from Qi Li Ting Teahouse).Photo by Alex LauDongmen MarketWet markets with fish, meat, etc., are as worthy a stop as the famed night markets. Don’t be afraid of the aggressive grandmas—they’re just shopping for dinner.Photo by Alex LauChinese BreakfastStart savory with soy milk (flavored with vinegar and soy sauce), crullers for dipping, and flatbread at Yong He Soy Milk King.Photo by Alex LauTea TastingIf you’re the type who samples every ice cream flavor before committing, you’ll love tea shopping in Taipei. Dong Tai, or most any tea store, will invite you to a tasting, offering snacks like salted plums with the oolong.Photo by Alex LauElephant MountainThe steps will seem endless, but the view of the skyline is worth it.Photo by Alex LauBeef Noodle SoupEvery shop claims its version of the Taiwanese staple is the best. Only Liu Shandong Beef Noodles is right.Photo by Alex LauBreakfast PrepJust join the line snaking down the sidewalk at Yong He Soy Milk King. You’re there for the traditional Chinese breakfast, while others are queueing up to fill their Zojirushi thermoses with soy milk for their families back home.Photo by Alex LauShaved IceYou know those hot, steamy days when you want to stick your head in a freezer? Taipei has a lot of those. And shaved-ice desserts are a tastier option than the freezer. Ice Monster takes a modern approach, topping snowy shaved ice with fresh fruit and soft panna cotta. If that’s not enough sugar (but it probably is), add a bit of the sweetened condensed milk that comes on the side.Photo by Alex LauMr. Liu, Noodle ProThe move at the nearly 70-year-old Liu Shandong Beef Noodles: Get the clear broth beef noodle soup and deck it out with a big spoonful of pickled mustard greens, a sprinkle of fermented black beans, and nibbles of raw garlic between bites.Photo by Alex LauTonghua Night MarketNight markets are essential to any visitor’s experience, but this is one of the older, less-touristy options. The trick is to sample widely, eat a few bites, and move on (nothing is more than a few dollars). Don’t miss the stinky tofu with fermented cabbage (just try it!), fried squid on a stick, and sweet sesame dumplings.Photo by Alex LauSun Yat-Sen Memorial HallFollow the cool kids in their Supreme sweatshirts to this park where they’ll dance to K-pop for hours. These college students probably would’ve performed until dark if the guy with the boom box didn’t have to go home.Photo by Alex LauRice Noodle SoupWalk to the end of a winding alley in the Dongmen Market to find Mama Luo’s Rice Noodle Soup shop. Get the rice noodle soup (the pork bone broth has been simmering for hours) with a side of tofu and lightly blanched greens. Sprinkle with white pepper and a few dashes of rice vinegar.Photo by Alex LauGrass Jelly Shaved IceWe’re not ones to use the word mouthfeel, but this dessert is truly a study in textures. Jiggly grass jelly (a slightly herbal gelatin) meets flaky shaved ice, chunky sweet red beans and peanuts, chewy tapioca and taro balls, and a thimble of rich coffee creamer. Get it at Ice in Wonderland.Photo by Alex LauRice PorridgeRice porridge/congee spots are popular late-night destinations (but they may not all have servers this happy). Join the cab drivers and clubbers at Xiaolizi Rice Porridge, pick up a tray, and choose your dishes, like stewed eggplant or braised tofu. Take a seat and your waiter will bring a pot of rice porridge, a blank canvas for your selections.Photo by Alex LauSoup DumplingsVisitors line up for hours to score a table at the now-international Din Tai Fung. Which makes sense: Its soup dumplings are perfect.Explore Bon AppétitTaiwanTaipeiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-20", "author": ["Condé Nast", "Sue Li"]}