{"id": "ec81754bc31a777e6757e4a266acacc4", "url": "https://www.bonappetit.com/story/run-for-health", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "Like Ahmaud Arbery, I Run For My Health. Do I Have to Fear For My Life? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Run For My Health. Do I Have to Fear For My Life?Ahmaud Arbery was killed while doing what I've encouraged so many people to do: get out and move. By Shanika HillocksMay 12, 2020FacebookTwitterEmailPhoto by Theodore SamuelsFacebookTwitterEmailMy grandparents raised my sister and me to care deeply about our health. Every morning our vanity would be pre-set with toothpaste and mouthwash. Nutrient-dense porridge and juice from the grapefruits in the backyard were on our breakfast table alongside cod liver oil and bush tea—West Indian remedies to keep our immune systems in shape.My grandpa, who kept checkbooks balanced and the garden fertilized, was less fastidious about his health. He indulged in second plates and desserts at church potlucks and kept physical activity—outside of tending to the yard—to a minimum. My grandpa’s steadily declining health loomed in the background of my childhood: blood sugar checks and doctor’s appointments in the morning, shots of insulin in the afternoon, a multitude of prescriptions, and occasional insomnia caused by sleep apnea at night. Despite surviving a stroke and a heart attack, he passed away during my sophomore year. Diabetes, hypertension, and prostate cancer—a common trifecta among African-American men—is what killed him.When I share my concerns with my doctor about inheriting my grandpa’s poor health, exercise is one of his first recommendations. And he’s right. No gym? No problem. Simply take to the outdoors and enjoy a walk or jog outside. Exercise may not cure the illnesses that took my grandpa’s life, but it's one of our best, and most accessible, weapons against them. Unless it becomes a weapon used against us.On February 23, 2020, while jogging through a neighborhood near his home, Ahmaud Arbery, a 25-year-old Black man, was shot and killed by Gregory and Travis McMichael, two armed white men. The news of his murder surfaced on a national scale when a video of the death made its way across social media late last week, igniting a call for justice 74 days after his murder.His attempt to do something for the care and keeping of himself was what cost him his life.Arbery was a former high school football star; jogging, taking care of and moving his body, was a part of his routine. The news of his death shook me to the core. His warm smile brought to mind the faces of other Black men in my life. His attempt to do something for the care and keeping of himself was what cost him his life.I was introduced to athletics in high school but as a spectator, singing our Alma Mater & Fight Song at Friday night football and homecoming games. I appreciated the camaraderie that I saw among the mostly Black and Brown young men, many hoping for sports scholarships and college fame. At the time, I was busy with my first part-time job. The only movement I cared about then was driving the car I’d been saving up to maintain.After graduating from college, I moved to New York and landed in the wine & spirits industry. Champagne breakfasts, midday visits to bar clients, dinners of butter-bathed steaks paired with Tuscan Montalcino: this became my lifestyle. And the physical manifestations were evident. I was restless at bedtime, fatigue greeted me in the morning, and a quick run downstairs to catch the subway had me out of breath. Awake at night, I would flash back to my grandpa grabbing insulin from the fridge to pierce it in his gut.Along with mediation, rest, and a plant-focused diet, exercise became my lifeline. I discovered a friend’s fitness studio, SESSION, and I started running: a big deal for someone who always thought running was the worst kind of exercise imaginable. With each pound of the foot, I could hear my heart beating against my ribcage and up through the pressure in my eardrums. Was this the path to the cult runner’s high I’d heard so much about? Expanding my lung capacity and learning to breathe deeply was challenging enough. But I wasn’t trying to beat any records; I was showing up for myself, creating a space where I could let my thoughts flow freely. I felt like I was protecting years of life that my genetics—and racial inequality—could otherwise steal from me.Black and Brown communities are disproportionately affected by chronic diseases like the ones my grandfather died from: diabetes, hypertension, and certain cancers. We often reside in close proximity to pollution hot spots, exposing us to harmful air toxins that make us more susceptible to respiratory illness like COVID-19. And access to quality food, wellness, or fitness centers in our neighborhoods is often limited. Today, the spread of COVID-19 further illustrates this very fact: people of color are dying at twice the rate of white people in cities like Chicago and New York. And at a time when finding solace outside is supposed to be a balm for all of us, where we’re told to prioritize our health and wellness while social distancing, Black bodies are, yet again, under threat.In early May, when I first heard the reports of Arbery’s killing, I was hurt and scared. Exercising outdoors was where I’d learned to relax, to let judgments go. The danger of my own movement had never crossed my mind until now. Even moreso, I felt myself fearing the very thing I admired about those boys in blue and white at the 50-yard line back in high school. Then, they seemed invincible, lauded for their physical abilities and bringing championships to my hometown. Who would demand justice for their lives if they ended today? I thought about outdoor wellness initiatives that’ve sprung up in recent years, like Hike Clerb and Mastermind Connect, spearheaded by womxn and men of color. They were pointless if their members were going to be targeted for entering the wellness spaces that White people have so effortlessly embraced and monetized. Images of my friends and family members who favor Ahmauud physically made my stomach flip. Many of them also jogged in the early mornings or late afternoons. Would they make it back home?We should not have to move our bodies in secrecy for fear of being seen as a danger. When I run now, I think about all the loyal fans—of all races and backgrounds—who cheer for Black athletes as they run across football stadiums, basketball courts, and asphalt tracks. I urge them to speak out just as loudly when a Black man is killed. I hope that women and men of color can be memorialized with more than just a hashtag or a 2.23-mile marker in an app. I hope allies will educate themselves on the racial inequalities using resources available to them, rather than leaning on their Black peers to revisit oppression for the sake of their teaching. I hope they will check their friends and family when racist remarks and actions are made the first time, and continue to engage in those conversations openly and often. I held myself accountable for my own health and changed the course of my life; now, I’m now holding those who consider themselves allies accountable: keep us moving, and keep us alive.Explore Bon AppétitHealthyishSelf CareessayRead MorecultureI Run to Silence My DemonsBy Sandy AllenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-12", "author": ["Condé Nast", "Shanika Hillocks"]}