{"id": "ec8b072ca07d43998c2d09dd1a10c2df", "url": "https://www.bonappetit.com/recipe/zaatar-chicken-with-garlicky-yogurt", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Za’atar Chicken with Garlicky Yogurt Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueZa’atar Chicken with Garlicky YogurtBy Katie Jackson, Nick Perkins, and Aaron CrowderMarch 19, 20194.2(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintTo make the most of your chicken, you have to make the most of your pan drippings. Here the garlic- and lemon-infused chicken fat is mixed with a citrusy za’atar and spooned over the fall-apart meat. Make sure the garlic halves are turned cut side down and in contact with the pan for gloriously caramelized cloves.Ingredients4 servings 4chicken legs (thigh and drumstick; about 2½ lb. total)2medium red onions, cut into 1\"-thick wedges2heads of garlic, halved crosswise, plus 2 cloves1lemon, quartered, seeds removedKosher salt⅓cup extra-virgin olive oil1½cups plain whole-milk Greek yogurt3Tbsp. za’atar1tsp. ground coriander1tsp. finely grated lemon zest1tsp. finely grated lime zestIngredient InfoZa’atar, a blend of sumac, dried herbs, and sesame seeds, can be found at Middle Eastern markets, specialty foods stores, and online.PreparationStep 1Preheat oven to 325°. Pat chicken legs dry with paper towels. Arrange chicken, onions, halved garlic heads, and lemon in a 13x9\" baking dish; season liberally with salt (remember to season both sides of chicken). Pour in oil and toss everything to coat. Turn garlic cut side down and nestle it in so it is in contact with the baking dish. Roast, rotating pan halfway through, until meat is almost falling off the bone, 50–60 minutes.Step 2Meanwhile, finely grate 1 garlic clove into a small bowl. Add yogurt, a big pinch of salt, and 1 Tbsp. water and mix well. Set aside yogurt sauce.Step 3Remove baking dish from oven and transfer onions, garlic, and lemon to a plate. Increase oven temperature to 425° and continue to roast chicken until skin is golden brown, 10–15 minutes more. Transfer chicken to a cutting board and let rest 10 minutes. Set aside pan with juices.Step 4Finely grate remaining garlic clove into another small bowl. Add za’atar, coriander, lemon zest, and lime zest. Pour reserved juices in pan into za’atar mixture until you’ve reached an oily consistency (about ⅓ cup). Mix in a pinch of salt.Step 5Spread reserved yogurt sauce over a platter and arrange chicken legs on top. Scatter onions, garlic, and lemon around; drizzle with za’atar oil.How would you rate Za’atar Chicken with Garlicky Yogurt?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleThe flavor combo was delicious, but I changed the cooking times and temp drastically. I had just bone-in, skin-on chicken thighs and used those. 5 of them was the 2.5# the recipe called for. I cranked the heat to 415 degrees and cooked skin side down for 20  mins. Then flipped the thighs to brown for a remaining 20 minutes. In that time the skin crisped perfectly, the onions and garlic were well cooked and provide plenty of drippings to prepare the Za'atar oil. Next time I will use 1/2 the yogurt for the sauce and half the spices for the oil, just because there was a lot left after the chicken was gone. Overall a great recipe, just the temps seemed off to me. Will definitely make again.Gregg C.San Francisco, CA8/11/2021This is the BEST RECIPE EVER! I have made this about four times now and every single time to rave reviews from friends. I find myself craving it regularly. Absolutely perfect and couldn’t be more delicious.AilsaLondon5/9/2021I made this because I had way too much chicken thighs in my fridge and was looking for something exciting to do with it. I had pretty much everything in my fridge/ pantry except lime so I skipped it and doubled up on the lemon zest. Man, this was deeeelish!  I prepped a side of olive oil fried sourdough bread and my husband was dipping the bread in the leftover yogurt sauce and zaatar oil because it was all so delicious. The sauces are so good I'm thinking I can spread it all over some roasted potatoes too. Chicken came out juicy and cooked perfectly!Hannah PLA, CA2/2/2021bangin' flavors, but I w/held 5 stars because: \n* I would've liked to have more of the spices flavor the chicken meat more than just the salt\n\nmodifications I'd suggest making (some of which have already been commended in other reviews) : \n* use Greek yogurt, non-Greek whole milk yogurt was too runny for my taste when serving \n* cook the onions, garlic and chicken at a higher temperature than 325 (more like 375) for slightly less time allowing the onions to cook more thoroughly and soften a bit more \n* add lemon juice and a bit of zest to the yogurt mix (for a little bit of acid + tiny tiny bit of brightness) and fresh cracked black pepper (to taste) godsyllaLos Angeles, CA 12/26/2020Delicious! Served with rice and warmed pita bread. Sooo good.LoridpVancouver BC11/23/2020Savory and homey--the lemon juice and zest  give it a very nice aromatic note and echo the sumac in the za'atar. I salted my chicken the night before and left it to air-dry in the fridge overnight, then baked it in the top of the oven to help the skin brown and crisp. I served it with basmati, but couscous or flatbread would have been a good match too.AnonymousCT8/29/2020I loved this recipe! To ensure the skin on the thighs got crispy, I seared just the skin-side for 3-4 minutes on a cast iron before putting the chicken in the pan with the rest of the ingredients and into the oven, and skipped the extra step of turning up the heat and continuing to oven roast. They came out perfect!AnonymousBrooklyn, NY5/13/2020325 is way too low. After 60 min., the chicken was barely cooked and certainly not “falling off the bone.” Next time I will go with 425 the entire cooking time. The dark meat can handle It.AnonymousKnoxville, TN1/7/2020Really delicious.  We brought back Za'atar from Israel and looking for recipes.  Made this last night and it was a huge hit.  I agree directions aren't so clear on the back and forth in the oven and when the yogurt comes in.  I ended up hitting the chicken with the broiler for a little crunch, plated the yogurt on a platter, placed my chicken and added the pan dripping to the top.  The combo of the drippings and the yogurt made for an incredibly delicious sauce.  With a little clarification in the directions, this is simple and delicious.ChefCindyNew York8/26/2019Question about the yogurt - does the chicken get a bath in it, if so when? \n\nDoes it go bake chicken>remove from oven and rest>dress in yogurt>back in the oven for a final bake?\n\nThank you so much for your help! DiscocookingChicago 8/26/2019This is absolutely delicious.  Disappointed that the skin never browned or crisped.  I peeled off the flabby skin before serving to my family - more healthy anyway.LeeKFairfield Cty, CT5/17/2019This recipe is incredibly flavorful! I left out the corriander (I thought I had some, but didn't, and didn't feel like going back to the store) and it was just fine. I don't know where BA is buying their chicken legs from, but I could not find 4 of them that were under 5lbs. It kind of crowded my pan, so I don't think I got as much browning on anything as I wanted. STILL! Delicious and well worth the minimal effort it already takes to make! EagleM16Denver, CO4/25/2019Enjoyed this recipe -- I used a whole chicken cut up rather than chicken legs.  AnonymousNJ -- @stressfreecook4/3/2019Made this last night and I am in love. Currently eating pretzels dipped in a mixture of the leftover yogurt and za'atar. (There was no chicken leftover). Easy, pretty hands off, and so impressive on a platter. AnonymousMiami, FL3/27/2019this is totally awesome. since i already had a yogurty side prepared, i spread this onto hummus instead.stawkpawtmassachusetts3/23/2019Explore Bon AppétitChicken LegChickenPoultryGarlicVegetableMainGluten-FreeNut-FreeKetoHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Katie Jackson", "Nick Perkins", "Aaron Crowder"]}