{"id": "ec8fac1530250579fce6c63611193765", "url": "https://www.bonappetit.com/story/david-chang-ugly-delicious-netflix-clip", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "David Chang's Netflix Show Features \"One of the Ugliest Dishes\" He's Ever Made | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWatch David Chang Make “One of the Ugliest Dishes” Ever on His Netflix ShowIn an exclusive clip from Chang's new docu-series 'Ugly Delicious,' the chef shares how to cook his favorite type of cuisine.By Alyse WhitneyFebruary 20, 2018FacebookTwitterEmailUgly DeliciousCourtesy of NetflixFacebookTwitterEmailDavid Chang is okay making “really ugly food.” On his new Netflix docu-series Ugly Delicious (streaming in full on Feb. 23), he candidly focuses on creating interesting flavors—not made-for-Instagram dishes. The eight-episode series explores how different people make and eat things like pizza, barbecue, fried chicken, and tacos, but doesn’t rely on gratuitous shots of gorgeous food. Instead, Chang lets chefs’ tell the stories of their favorite dishes, no matter how “ugly”—including April Bloomfield, Sqirl’s Jessica Koslow, Massimo Bottura, and Wolfgang Puck. He also dines around various cities with comedians like Jimmy Kimmel, Ali Wong, and Nick Kroll to see food through their eyes.ContentThis content can also be viewed on the site it originates from.In an exclusive clip from the series’ third episode “Home Cooking,” Chang shares the meaning behind the show’s name. “Home cooking, or [what] I call ‘ugly delicious’ food has now become the food I also want to make in the restaurant. There’s a way to coax more out of a dish.” He calls the spicy braised cod dish “one of the ugliest dishes I’ve ever made” in the clip above. It’s a donabe filled with a “peasant dish of potatoes, peppers, and fish.” There are no fancy garnishes—it’s basically a pile of peppers with fish on top, served in the vessel it’s cooked in. Chang has never been shy about mixing cuisines at his restaurants—in this case, Portuguese, Korean, and Szechuan-style. “If you try to respect these cultures you can figure out how to merge them together without bastardizing any of it,” he explains.This is Chang’s version of “ugly delicious”: spicy cod stew cooked with sweet potatoes and mung bean noodles.\nCourtesy of NetflixThe point of Ugly Delicious is to show how different people “use food as a vehicle to break down cultural barriers, tackle misconceptions and uncover shared experiences.” The “Home Cooking” episode is most exemplary of that, showing Chang making Galbi (Korean short ribs) with his mother on Thanksgiving. Snippets of how different chefs translate restaurant cooking to their own homes is intriguing—Chef René Redzepi and his wife, Chef Nadine Levy Redzepi throw a dinner party for Chang and his wife, Grace, that rivals anything you could get a Noma. Although Chang may playfully call this food “ugly,” the stories are beautifully told. If you plan to binge the series, maybe put some of Momofuku’s bo ssam braised pork in the oven before you queue up the first episode... and make some backup snacks. There’s no way you’ll get through 10 minutes without getting hungry for something—whether it’s ugly delicious or not.Stream Ugly Delicious on Netflix beginning February 23.Learn more about David Chang’s Momofuku empire:Explore Bon AppétitDavid ChangNetflixPop CultureRead MorecultureLet David Chang Take You on a Korean Food Tour for the OlympicsBy Evelyn WangcultureEpisode 14: David Chang, Momofuku (and Maple) MaestroBy Bon AppétitcultureWhat's New on Netflix in December—and 5 Things to Eat While WatchingBy Alyse Whitneyculture8 TV Shows That Are Secretly About FoodBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-20", "author": ["Condé Nast", "Alyse Whitney"]}