{"id": "ec976708bf794382bbfe72d2c5052b4a", "url": "https://www.bonappetit.com/recipe/grilled-pineapple-drumsticks", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Grilled Pineapple Drumsticks Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueGrilled Pineapple DrumsticksBy Rachel GurjarJuly 6, 20214.6(15)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintWhen you’re grilling drumsticks, you end up walking a fine line: A low temp is necessary for keeping the dark meat tender, but there’s a lot of skin, which you want to crisp up. For the best of both worlds, tenderize the drumsticks in this pineapple-forward marinade, made with shallots, garlic, shrimp paste, and coconut cream (not to be confused with cream of coconut, which is sweetened and used in cocktails). Then grill the marinated drumsticks over indirect heat to ensure juiciness and then hit them (and some pineapple slices) over direct heat for a few minutes to get the skin crackly. —Rachel GurjarAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonCharcoal Grill$98 $82 At AmazonHeat Resistant Leather Gloves$22 At AmazonInstant-Read Thermometer$35 At ThermoworksLarge Basting Spoon$16.37 At AmazonIngredients6 Servings3lb. skin-on chicken drumsticks2shallots, peeled, halved6garlic cloves15-oz. can coconut cream¼cup fresh lime juice2Tbsp. Diamond Crystal or 1 Tbsp. plus ½ tsp. Morton kosher salt2tsp. crushed red pepper flakes2tsp. shrimp paste13-lb. pineapple, peeled, cored, sliced ½\" thick, divided2Tbsp. vegetable oil, plus more for grillCoarsely chopped cilantro and lime wedges (for serving)PreparationStep 1Make a ½\"-deep cut along each side of each drumstick (this will help the marinade penetrate quickly into the flesh) and place in a large bowl; set aside while you make the marinade.Step 2Purée shallots, garlic, coconut cream, lime juice, salt, red pepper flakes, shrimp paste, half of the pineapple slices, and 2 Tbsp. oil in a blender to a smooth paste. Set 1 cup marinade aside; pour remaining marinade over reserved drumsticks. Toss until drumsticks are completely coated in marinade. Let sit 15 minutes.Step 3Prepare a grill for medium indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Lightly oil grate; arrange drumsticks over indirect heat. Baste chicken with reserved marinade, then cover and grill 20 minutes.Step 4Uncover grill and turn drumsticks over. Baste one more time with marinade, then cover and grill until drumsticks are golden brown and an instant-read thermometer inserted into the thickest part of a drumstick registers 165°, 25–30 minutes.Step 5Move drumsticks over direct heat and grill, turning halfway through, until golden brown and charred in spots, about 4 minutes. Transfer drumsticks to a large platter.Step 6Arrange remaining pineapple slices on grate over direct heat and grill, turning halfway through, until golden brown and lightly charred in spots, about 5 minutes. Remove from heat and arrange over and around drumsticks.Step 7Top pineapple and drumsticks with cilantro and serve with lime wedges for squeezing over.How would you rate Grilled Pineapple Drumsticks?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleMade this tonight,  in a 400 degree oven 40 minutes (flipping after 20) was enough to get the drumsticks up to 165. Then I put it under the broiler for about 7 minutes on each side, trying to crisp the skin. I wish I had remembered that we like our chicken a bit more \"done\" than most food magazine writers, it needed more baking time and a temp of about 175 for our tastes.\n\nThe finished meal was just so-so, not worth the time or the expense of the ingredients.  It might have been better done on a grill.  The chicken might have been more flavorful if I'd used skinless chicken parts. Shirley PUP of Michigan12/23/2021Anyone have any suggestions for those of us without grills? Can this e baked int he over then put under the broiler to crisp the skin?\n\nI see that Kathy and Jay asked this question in July, and there still doesn't seem to be an answer.  I really wish recipe writers would think about those of us who don't or can't grill.ShirleyUP of Michigan12/20/2021This marinate definitely helps brown nicely, but I think I marinated too long (maybe 2-3 hours?) and the skin got a little chewy instead of crispy - so don't overdo it and stick to 15 minutes or so.  Not suuuuper flavorful, even after that amount of time.  Can never go wrong with grilled pineapple - but I usually like to glaze pineapple with cinnamon-sugar. Jackie MMadison, WI9/12/2021Hmmm… not sure what I did wrong but it wasn’t very flavorful at all and needed more salt as well. It was tender though. LaurenTexas8/20/2021What Kathy said... 👇🏻JayJersey City, NJ7/18/2021Just in case, If it's raining when I start the grill for the drumsticks, I'd marinate my chicken for a day or so, then add lemon juice with a dash of seasoning salt to intensify the flavor of the drumsticks.AnonymousUpstate, New York7/15/2021Love this recipe!  However, I guess I didn’t oil the grill enough because the skin stuck and was pretty much gone by the time it finished.  I substituted anchovy paste for the shrimp paste since no one sells shrimp paste around here.  Served with corn salad with hot honey lime dressing from this site.\nYumDCrimminsFolsom, CA7/14/2021For those of us without a grill, could this be done in the oven? Or even just a pared down version on a George Foreman Grill? Apartment living really is a pain sometimes!Kathy GOak Ridge, TN7/12/2021Explore Bon AppétitChicken DrumstickChickenPoultryCoconut MilkOther IngredientsPineappleFruitSummerMainDairy-FreeGluten-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Rachel Gurjar"]}