{"id": "eca6b0ba2e055b897848f9e1d2036a85", "url": "https://www.bonappetit.com/story/turkey-tails-lineage-maui", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "The Turkey Tails at At Lineage Are The Most Delicious Thing to Eat in Maui | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsTurkey Tails Are The Most Delicious Thing You Didn’t Even Know You Could EatAt Sheldon Simeon’s Maui restaurant Lineage, the least familiar dish is the tastiest one.By Elyse InamineMay 2, 2019FacebookTwitterEmailPhoto by Jenny SathngamFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.It’s not every day you see turkey tails on a restaurant menu. But there they were at Lineage, the newest restaurant from chef Sheldon Simeon in Wailea, Maui, tossed in adobo and served with chunks of juicy tomato and sweet Maui onion. I didn’t even know you could cook and eat turkey tails! So naturally I had to try them, and it was mind-blowing. How did Simeon turn oily turkey organs into the most delicious, orange-chicken-esque dish? Here he breaks it down.The TailTechnically the oily gland that holds the turkey’s feathers together (don’t google it), the tail has long been a reliable cheap cut for Hawaii residents like chef Sheldon Simeon and his crew of Filipino cooks. They grew up eating the tails steamed in taro leaves for laulau or slicked in adobo sauce.The Adobo“We love adobo so much it’s scary,” Simeon says of his obsession with the staple Filipino sauce. He’s been tweaking his recipe for years, adding berbere to bring out the pepperiness and heat and holding back on the vinegar after sampling more soy sauce–forward versions. The result is a deeply rich adobo that you’ll want to steal a quart container of (not guilty).The Fry-Braise-FrySimeon picked up on this technique when he was traveling in the Philippines a few years ago: The tail is fried to get some color, then braised in the adobo sauce and fried once more before going back into the sauce to finish. That final fry seals each tail in a crispy, crackled shell akin to, in Simeon’s words, “the joy of eating chicken wings.”The MarinadeThe turkey tails bathe in a mixture of soy sauce and apple cider vinegar, bobbing with peppercorns, bay leaf, ginger, and garlic, to tenderize the meat and echo the flavors of the adobo sauce. “We are adding these same ingredients but at different moments in the recipe, which brings a more complex flavor in the end,” he says.The SaladYou can’t eat adobo without a raw tomato salad. “It’s a very Filipino thing to have,” Simeon says. It cuts through the glorious fattiness of those glossy turkey tails but also gives the dish a needed hit of acid. Hunks of sweet Maui onion (duh) and tomato are tossed with a little olive oil and fish sauce, then sprinkled on top of the turkey tails for a refreshing and actually useful garnish.Explore Bon AppétitMauiRestaurantsDish DecodedRead MorecultureI Instagram-Stalked This Croissant, So I Found Out How It’s MadeBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-02", "author": ["Condé Nast", "Elyse Inamine"]}