{"id": "eca8a594845262c49bff5f137946ce85", "url": "https://www.bonappetit.com/story/davelle-nyc", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Breakfast at Davelle Is the Best Way to Start a Day in New York | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsBreakfast at Davelle Is the Best Way to Start a Day in New YorkTheir artful Japanese milk bread toasts are almost enough to turn me into a morning person.By Aliza AbarbanelApril 10, 2019FacebookTwitterEmailPhotograph by Aliza AbarbanelFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m a late riser with an aversion to lines, which is why I avoid brunch like Times Square. But if I’m ever in a restaurant before noon, I’m at Davelle. It helps that the Japanese all-day cafe is just blocks away from my Lower East Side apartment, but I would happily journey cross-borough to start my day with their Kyoto-style cold brew, elegantly dispensed from a vaguely steampunk slow-drip Oji cold brew machine.While Davelle’s lunch and dinner menus are devoted to all kinds of delicious things, from uni spaghetti to fluffy omurice, the morning menu is a singular salute to toast. But there’s a twist: There’s no avocado in sight. Instead, thick slabs of Japanese milk bread are artistically smeared with a cream cheese and berry jam checkerboard, polka dots of cinnamon sugar, or swirls of natto (fermented soybeans) and cheese. Each toast is stunningly beautiful—but far too tasty to be pure Instagram bait.Best of all, the quietly minimalist space feels miles away from the hysteria of boozy brunch and bagel lines. It’s also an excellent launchpad for lazy walks up to the Union Square greenmarket or other dreamy weekend activities. On rare weekday mornings, I’ll even stop by before work for cream cheese toast and a corner seat at the bar. There, with sunshine on my back and a cup of genmaicha in hand, the charms of early rising are revealed.Go there: DavelleExplore Bon AppétitHighly RecommendNew York CityRestaurantsRead MorerestaurantsYes, There Are Potato Chips in Your Bagel SandwichBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-10", "author": ["Condé Nast", "Aliza Abarbanel"]}