{"id": "ecc1aebe94b6555958ef073b1b549cee", "url": "https://www.bonappetit.com/story/angela-dimayuga-self-care", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Angela Dimayuga on Taking Time for Self-Care and Learning to Say No | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAngela Dimayuga on Taking Time for Self-Care and Learning to Say NoThe former Mission Chinese chef is making her own space to succeed.By Fariha RóisínOctober 24, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn Who Is Wellness For?, writer and activist Fariha Róisín interviews people who are reshaping narratives about wellness for themselves and their communities. Here she speaks with chef Angela Dimayuga,\nwho is currently the creative director of food and culture for the Standard International hotel group.I knew I needed to meet Angela Dimayuga from the minute I walked into the Mission Chinese bathroom in its old location on Orchard Street in the early fall of 2013. As a fan of Twin Peaks, I was floored by the radiant photo of Laura Palmer like a vigil above the toilet seat, the mnemonic sounds gently playing as I peed and washed my hands with a mild soap, transporting me into my own twilight zone. There was a flair to the whole restaurant that inspired me, and I had to know who was behind it.Four years later, having become friends with Dimayuga recently, I was moved by her statement to Ivanka Trump after she was asked to do an interview for the first daughter’s site. On Instagram, she wrote: “As a queer person of color and daughter of immigrant parents, I'm not interested in being profiled as an aspirational figure for those that support a brand and president that slyly disparages female empowerment. Sharing my story with a brand and family that silences our same voices is futile.” It was empowering for me to see another Asian femme fight back.Since Trump’s win in 2016, I have become more aware of the ubiquitous anxiety and mental health troubles that afflict the community that Angela and I exist in—a community made up largely of queer, non-binary and trans people of color. For many of us, living through this political climate can feel like a fight for survival. And that’s why, I think, wellness is so top of mind for us right now: So many parts of our identities have been attacked; we’re in search of a way to protect and heal so we can continue to live as we are.In this interview, Dimayuga and I talk about these challenges and how to take care for ourselves and each other so that we can better fight for our futures.What does wellness mean to you as a chef and an artist?Wellness to me means staying ambitious to your cause but being conscious of what your body and mind need to get there. This might mean trying to put yourself first. We don't always do it, and we each have our own way of doing it. It might mean skipping a drink when offered, or just listening to your body. Does it feel good? Do you need to make time to not be social? Do you need to arrange an extra day during the worktrip to have time for yourself?Has wellness always been an important goal for you? I’ve found that I’ve had a lot of ups and down and hiccups when it comes to wellness and self care. I think a lot of kids of immigrants (well, ones particularly that didn’t grow up with wealth or privilege) deeply struggle with this.Wellness became an important goal when I moved into my first position of leadership as an executive chef in 2012. Initially, I was tasked to require all my salary employees to work 16 to 17 hours days, six days a week. After three months of trying to do as told, I had to put my foot down. People were dropping like flies, and it became important to me to stress that the kamikaze-style or celebrated martyrdom of restaurants is just not okay. I also had to unlearn this for myself over the years. It’s only in the last few years I've been consciously trying to care for myself in the most basic of ways: Giving myself days off, eating better, developing a workout routine (which I'm still working on!). And I'm finally working toward researching a QTPOC-friendly counselor, which is such a privilege. I had to work my ass off to get to the top, and getting to a better position means that I can finally afford a counselor. It's funny how success works that way.How do you navigate feeling well specifically in the industry you work in—which is male-dominated, white, and traditionally bro-y? How do you make space for yourself as an innovator, as a creative person, and as a highly successful, driven femme?I am super thankful that I had mentors as a young chef. When I was a younger cook at Vinegar Hill House, I hid my age from a lot of the staff and ran a line of people that were all more experienced than me. I made space to hang with my friends outside work—most of them were artists who really inspired me.Eventually I worked for chefs that were combinations of white, bro-y, misogynists and appropriators/fuck boys. I became proud and outspoken for who I am because I always felt like an outlier within the industry. Needing creative liberation, I also looked to collaborate with my immediate community, oftentimes people who were \"out of my league:\" a MacArthur genius-grant filmmaker, performance artists, Hugo-Boss-prize-winning conceptual artists, activists, food scientists, designers, all working toward mastering their own crafts.I make space by being the most me. Representation matters. I'm never not repping because there was never a young, brown (or Filipinx) queer female chef on PBS when I was 6. It was Jacques Pepin or Julia Child. I loved those chefs but imagine if I’d seen someone who looked like me?You wrote in your eulogy for Anthony Bourdain earlier this year that as an immigrant child, validity is important to you. I found that so moving, and I can relate. What was it like to process losing your mentor, especially when this industry, as you said, doesn’t nurture that space for success?I'm still processing it—I'm aware it will take me years. Tony never got to actually mentor me, but he offered up his mentorship right before he passed. It was utterly heartbreaking. Validity as an immigrant child is super important to me. Right now, we in the food industry see a changing of the guards, but there is still a very apparent boys club like in many industries. A white, straight male nearly double my age making a food show that was actually a political and cultural show was huge—it made people pay attention. And the fact that he was even interested in me as a voice in the future of food: I thought, How was this possibly happening to me?The sadness is so real. I think we've all been aware of our sadness of recently. We go through moments as a culture, and art is made out of it. Judge Kavanaugh just secured his seat. We are sad and we are angry. We are living in a period where our administration does not want people like us (queer brown femmes) to succeed. What do we do? Make our own space to succeed. Keep making work. Access your anger or anxiety and work through it and make things. It feels like survival.  A good friend and I drew some comparisons to how Rei Kawakubo and Mary J Blige has made some amazing work by staying mad—I think about them a lot.I often get this question that self care or wellness is targeted towards white people… what do you think we can do, as a community, to make it more accessible for, and to, marginalized folks?Self care and wellness have absolutely been packaged for white people. These adaptogens, powders, and jade face rollers have been repackaged and sold to a mainly white, female audience. A bundle of palo santo you can buy in Sunset Park for 5 bucks is $8 for a single stick at some boutique in Manhattan. First we must acknowledge this and question it. We also need to share resources. During my current quest for a counselor, I sought out information from a dear friend in grad school studying social work. He had all the QTPOC counselor referrals in his back pocket. File the info, and share with your people.We were talking about this the last time we saw each other, how it’s hard to prioritize yourself when you have so many things on your plate. You’re an ambitious person that’s doing so much with your time—how do you fit it all in?I'm nerdy about my calendar on my phone. I block out time during the week for myself or for my partner. I also block out time to have some spontaneity too. For my cherished loved ones, I book them in advance, and lock it in. We are so incredibly busy. I also love throwing a party, but I feel that it's a part of my job now, so I usually make time to go to parties that I am working on or hosting. Again, staying inspired is important to me. I'm learning how to say no to a lot and being intentional about where I spend my dollars.What inspires you?People who are blowing up their industries and representing. I love it when I'm with people who are going through transformations. They don't give a fuck and are down for anything. I'm at a time in my life when I have some talented friends that are getting recognized. It feels good to see them be seen. I recently saw a fashion show in Bangkok, and the level of creativity and camp coming from a queer Thai designer and an all-Asian cast of models and musicians was so inspiring. Awkafina's Asian American dream monologue on SNL. Always the work of my dear friend Shakirah Simley, a writer, community organizer, radical activist, and food justice advocate.What tips can you give young QTPOC kids that are looking to you for guidance?Think about what you are obsessed with and who you are obsessed with. Trust your instinct and listen to yourself. What mark do you want to make with your work? Who do you admire and what work do you want to do? Approach your work like craft. I was fortunate enough to find a mentor as a young adult. Who might want to mentor you? Find them and go after them. Cold-call people; make yourself available. Be loyal to others but also to yourself and own needs.What’s one life changing thing you found recently that’s exponentially made your life better?The Asian-style fruit slush. Equal parts fruit and ice. Blend it up and crave it everyday (Try watermelon, mint, and lime).Explore Bon AppétitHealthyishangela dimayugaWho Is Wellness ForSelf CareInterviewsRead MorecultureI Never Thought Wellness Was Meant For MeBy Fariha RóisínRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-24", "author": ["Condé Nast", "Fariha Róisín"]}