{"id": "ecc4f41cd5ed506f16ead7e007387297", "url": "https://www.bonappetit.com/story/dusen-dusen-dish-towels", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "These Cheery Dish Towels Brighten Up My Winter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Cheery Dish Towels Brighten Up My WinterWhen it’s dark by afternoon, I’ll take all the help I can get.By Bekah WaalkesDecember 14, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.In December the sun sets at 4:15 p.m. in Boston, which means by the time I get back from work it’s fully dark out. Compared to summer nights, when I bike back from campus to a kitchen full of sunlight and fresh vegetables from my farm share, coming home to cook dinner in winter is depressing. Walking through my dark house, flipping all the lights on, staring at the squash and carrots that don’t really have to be cooked tonight…well, it’s enough to make me want to order takeout and eat it in bed.These days I’m looking for light wherever I can get it, so when I saw Dusen Dusen’s Penrose dish towels, I knew I had to have them. In perfectly patterned yellow, green, and red, these three dish towels liven up my kitchen. It may have been dark for hours by the time I pull my baked ziti out of the oven, but the handle of my oven door? Bright and sunshiny with my yellow Dusen Dusen dish towel hanging there!Dusen Dusen Dish Towel Set$50 $35 at Shopbop$50 $43 at GarmentoryThese towels are 100% cotton, soft enough to comfortably dry your hands but heavy-duty enough to scrub out a remnant of turmeric and miso sweet potato soup crusted onto a pot, forgotten by an absent-minded dishwasher. The towels wash easily and dry just as nicely in the air as in the dryer. While the material is superior, it’s really the patterns—vibrant with a funky geometry that keeps my eye surprised—that draw me back to Dusen Dusen’s home goods. The print, named after physicist Roger Penrose, looks like the kind of flowers I doodled in middle school notebooks, loopy and colorful. It’s a little thing that gets me excited to return to my vegetable drawer and Dutch oven when I’d rather be under the covers—a literal bright spot in my dim Cambridge kitchen.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-14", "author": ["Condé Nast", "Bekah Waalkes"]}