{"id": "ecc6ea5308e45c74136b4de5a02a15c5", "url": "https://www.bonappetit.com/recipe/braised-short-ribs-with-onions-and-curry-leaves", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Braised Short Ribs With Onions and Curry Leaves Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueBraised Short Ribs With Onions and Curry LeavesBy Rachel GurjarAugust 10, 20214.9(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintTwo ingredients make these braised short ribs stand out: fresh coconut and curry leaves. Unlike dried coconut, the fresh stuff doesn’t need to be toasted to bring out its natural nutty and sweet flavors (though dried will work just fine here in a pinch). Fresh curry leaves impart a subtle citrusy, nutty, lemongrass-like taste unlike anything else and are an excellent contrast to the richness of the ribs. They are readily available online if you can’t find them at a local market. This is our answer to the classic big, meaty braise.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonMicroplane Grater$16 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients4 Servings3lb. bone-in beef short ribsKosher salt2Tbsp. ghee or clarified butter3large onions, thinly sliced4garlic cloves, finely grated12\"-piece ginger, peeled, finely grated¼cup tomato paste3Tbsp. garam masala3Tbsp. ground coriander2tsp. paprika1tsp. cumin seeds1tsp. ground turmeric3sprigs fresh curry (about 30 leaves)½cup fresh or frozen grated coconut or dried unsweetened coconut2lb. medium Yukon Gold potatoes, halved lengthwise¼cup extra-virgin olive oilFreshly ground black pepperCilantro leaves with tender stems and lime wedges (for serving)PreparationStep 1Pat short ribs dry; season with salt. Heat a dry Dutch oven over medium. Cook ribs until golden brown, about 3 minutes per side. Transfer ribs to a plate with tongs.Step 2Preheat oven to 350°. Add ghee to fat in pot and heat until melted. Add onions, garlic, and ginger and mix to coat. Cook, stirring, until onions are softened and starting to turn translucent, about 2 minutes. Stir in a pinch of salt, cover pot, and cook until onions are golden, 8–10 minutes. Uncover and cook, stirring often, until onions are golden brown, 15–20 minutes. Most of the water will have cooked off at this point and there might be some bare spots where the onions could start to burn. If this happens, stir in a splash of water. The liquid will dissolve the cooked-on bits, which onions will reabsorb. Continue to cook, stirring occasionally, until onions are deeply browned and almost blackened around the edges and very soft, 8–10 minutes.Step 3Add tomato paste, garam masala, coriander, paprika, cumin seeds, and turmeric to onion mixture, season generously with salt, and cook, stirring, until spices are fragrant, about 2 minutes (you should have a thick dark brown paste). Add curry leaves, coconut, and 3½ cups water and mix to make a thick braising liquid. Return short ribs to pot, nestling in so they are covered in some liquid. Bring to a simmer, cover pot, and braise in oven until liquid is thickened and meat is tender and falling off the bones, about 1 hour and 45 minutes. Remove from oven and set aside.Step 4Meanwhile, arrange potatoes, cut side down, on a rimmed baking sheet. Pour in 1½–2 cups water so it covers baking sheet in a thin layer. Cover with a double layer of foil, crimping sides very tightly to seal.Step 5When ribs have cooked 1 hour, slide potatoes on a rack just below pot and bake until a fork slides easily through them, about 45 minutes. Let potatoes cool 5 minutes.Step 6Increase oven temperature to 500° (or as high as your oven goes). Using tongs, lift up foil at 1 corner; pour off water into the sink (foil will hold back the potatoes). Remove foil and drizzle oil over potatoes; season generously with salt and pepper. Let sit until cool enough to handle, then toss to coat. Turn potatoes cut side down again.Step 7Roast potatoes until skins are golden and cut sides are deeply browned and crisp, 20–25 minutes. Transfer to a large shallow bowl or platter.Step 8Serve reserved short ribs with cilantro and lime wedges and roasted potatoes.Do ahead: Ribs can be braised 1 day ahead. Let cool; cover and chill.How would you rate Braised Short Ribs With Onions and Curry Leaves?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleI followed the recipe exactly and even found fresh curry leaves.  The braise was good.  But none of my guests liked eating the curry leaves, finding their texture off putting.  I’m not sure how much flavor the leaves actually give the dish, and I think if I should make these ribs again, I would use one of the curry leave substitutions such as lime zest or bay leaf.  Joe6969Seattle, Washington2/2/2022I made this for dinner tonight and, wow. WOW. We already can’t wait for leftovers tomorrow! I used a little over 5 lbs of short ribs, so upped the rest of the ingredients except the onions. Don’t skimp on the curry leaves! Also, I added some coconut milk with the water for the braising liquid. Followed the method for the potatoes exactly as directed but with large chunks of rutabaga and carrot. Absolutely delicious, and so good with the ribs and sauce. Definitely a keeper!Elizabeth Boston, MA1/21/2022Great combination and good direction on browning the onions, paste, etc. to get the best flavor. I must  say the potato technique is a lot of wasted effort. Why boil on a sheet pan covered in foil then discard the water when you can just toss in seasoned oil and roast the potatoes? Uncovered. They come out perfect. Chris1/19/2022This sounds delicious. Please consider providing nutrition information. That’s a big hole in your offerings.Anonymous1/18/2022Curry leaves? I didn’t think there was such a thing. Curry is a combination of spices.LoisNorthern Virginia 1/18/2022Question.  I am planning to cook the short ribs this weekend.  Is there a substitute for fresh curry leaves?  I am having a difficult time finding them.\nAnonymousPittsburgh, PA1/18/2022every short rib dish is much better with ox tails  use same exact methods Anonymousny and az1/18/2022This was outstanding!  Rave reviews.  The coconut is very subtle as are the rest of the flavors but comes together beautifully.  The potatoes are maybe the best I've had.  ErinLA, CA9/29/2021This dish was ridiculously delicious, I mean, out of this world delicious. I used some asado ribs that a butcher cut too thick to grill, so I cut them in chunks for the braise. Deeply umami rich and intense curry that works so well with the potatoes and the squeeze of lime amplifies. PatMelbourne, Australia8/28/2021Explore Bon AppétitIndianSouth AsianAsianShort RibBeefMeatOnionVegetableCurry LeafHerbs & SpicesCoconutFruitPotatoYukon Gold PotatoEasyMainGluten-FreeBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Rachel Gurjar"]}