{"id": "ecd0ca59d0d95e51ce8697ae94a89a5f", "url": "https://www.bonappetit.com/story/call-your-mom", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "It Took a Global Pandemic, But I'm Finally Calling My Mom | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusIt Took a Global Pandemic, But I'm Finally Calling My MomOver FaceTime, she coaches me through meatballs and eggplant parm, and for the first time I understand the scope of her love.By Phillip PicardiApril 14, 2020FacebookTwitterEmailPhoto by Marcus NilssonFacebookTwitterEmailThis story is part of the Healthyish Guide to Being Alone, a series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.Just a few weeks (which feel like months) ago, CNN’s Chris Cuomo invited his brother, the governor of New York Andrew Cuomo, onto his show to update the nation about the state’s response to an increasingly dire pandemic. Chris ended the segment by saying, “No matter how hard you’re working, there’s always time to call Mom.”“I called Mom,” the governor responded. “By the way, she said I was her favorite. Good news is, she said you were her second-favorite son.” The tit-for-tat became a rare moment of levity for a very stressed out country—a much-needed, warm-hearted distraction.If you are from an Italian family—or have at least joined one of us for a home-cooked meal—you’d know that the mother is often the anchor of our households, the foil to tough-as-nails fathers, the reason we put aside our differences and begrudgingly agree to sit peacefully for a meal. Mom is the nurturer and provider, the one who’s always asking if you’re hungry before prying into the details of your personal life. The Cuomos’ “call Mom” shtick is a classic move by us Italian children who are always vying for her attention, affection, or (let’s be honest) culinary talents. It’s our way of saying, “I talked to Mom and you didn’t, you ungrateful bastard.”Unfortunately, this guilt trip rarely worked on me. I was the only one of Mom's five children to fly the coop, landing hundreds of miles from Boston in New York City. Mom always wants to speak to me, and usually comes prepared with detailed questions about what’s happening in my life, prompted by tweets she’s read or scenes she’s observed on my Instagram Story. For much of the last 10 years, we’ve endured an unfortunate routine every time I finally answered the phone: When are you coming home next? And then, when I do agree to come home, the frantic back-and-forth: Why are you staying for so short a time? What can I cook for you before you get here? Who should we see while you’re home? Is your fiancé coming? (If no: Why not? Does he have to work? Is everything okay? If yes: What does he like to eat? Should we make reservations? Your father will pick a place. What does his mother cook for him? I can make that.) I frequently dodged the phone calls, only to inevitably get a text from my sister: “Please call Mom, she’s driving me nuts.”Once Governor Cuomo officially sanctioned shelter-in-place orders in New York City, my mom (like most mothers, I’m sure) panicked. The FaceTime calls started coming daily, lasting for as long as it took for me to calm her anxiety. She was prepared to drive down to my apartment in Brooklyn to come get me and bring me home—regardless of the potential risk I could expose her to. I had to explain that social distancing was designed to protect people in her age group, and that she was the most at risk of anyone in our family, not me. Resolved to her confinement, Mom responded by printing her own shipping labels and mailing me boxes filled with “essentials,” including bleach, Lysol wipes, and...freshly-baked loaves of banana bread.How would I ever be able to forgive myself for not calling when she asked, for not going home when I had the chance?Trapped in my own apartment, I (like many millennials) have enjoyed using this time to try recipes I could never have imagined myself cooking before. With my fiancé working 12-hour shifts at the hospital, I find myself alone more than I’d like in this particular moment, which often allows my curiosity to get the best of me. Whenever I panic or second guess myself—which is often, especially when making anything that involves multiple pans—I call mom.I FaceTimed her one Sunday because I wanted to make my first-ever batch of Italian wedding soup, but I couldn’t find chicken broth anywhere in Brooklyn. She sent me to the grocery store for a whole chicken, celery, carrots, herbs, and onion, then coached me on making my own—following along for three hours as I skimmed the top and the broth came to a hearty simmer. I began to grow impatient with the whole process, and even though she warned me against adding the orzo pasta too early, I did it anyway. Sure enough, the orzo soaked up all the broth in just a couple of hours. I called her back to let her know she was right. “Now you know for next time,” she said.The next day, she followed up to ask what I was doing with the leftover chicken. She reminded me that my fiancé was particularly fond of quesadillas, so I shred it into small pieces, chopped some cilantro, and grated some cotija cheese. When he came home for dinner that night, he was elated, proclaiming that this was my “best meal yet.” (As someone who had recently prepared eight pounds of Momofuku Ssäm-inspired pork butt, I was thoroughly unamused.)One time when she had come to visit, she insisted on making a homemade eggplant parmesan, which my fiancé promptly devoured in under 24 hours. A few weeks ago, I got inspired to make the same thing happen again in an attempt to lift his spirits. I consulted Mom on my list of ingredients and tackled the recipe myself. Over FaceTime, she reviewed the width of my eggplant cutlets and schooled me on how to properly salt them upright in a colander to avoid a watery finished result. She also insisted I dry out loaves of Italian bread instead of using store-bought breadcrumbs—apparently those are a sin. (Who knew?) So I blended two whole loaves of scali bread, a few slices at a time, until I was finally left with rich, golden crumbs. To make it extra special, I prepared my own pomarola, following a Samin Nosrat recipe that is basically the same as a typical red sauce, but at the end you add a cup of expensive olive oil and purée it in a blender. The finished product is a delightfully creamy, practically velvety, fire-red sauce—I used it to build my layers of eggplant, mozzarella, and shredded basil exactly as Mom advised.I sent her a picture of the pot right as I removed it from the oven, concerned that it looked too charred on the top, especially compared to hers. “It looks perfect,” she said. “You’re becoming a really good cook.” I was sure she was lying to make me feel better, but I got a text from her the following night, asking for the pomarola recipe. This time, she sent me a video from her phone, adding the oil to her red sauce, letting me watch along with her as it emulsified to find its new, creamy texture.Once the grocery stores became even more precarious to visit (my fiancé barely has enough surgical masks at the hospital, let alone for me to wear while running errands), I decided to order online from our local fish market and butcher. Once I saw the menu, I puzzled over the options—I couldn’t just ask the person behind the counter for their opinion like I always do. Mom guided me through selecting a chicken of appropriate weight, meatballs with the right kind of beef chuck, and a pound of prosciutto for snacking—and she urged me to treat my fiancé to his favorite: ribeye steaks. When everything was delivered, I called her as I put it all away, thanking her for her help. She saw the inside of my fridge via FaceTime and suggested I place my parsley and cilantro upright in small glasses of water so they would stay fresh. Once again, she knew best: They lasted for two whole weeks longer than average.I realized recently that, even though I’m not physically with my mom, at home with her like she’d prefer, we are speaking more during quarantine than we ever have before. Most days of the week, we’re on FaceTime trading recipes or cooking together, or she’s watching me unbox the latest shipment of baked goods she’s sent to the apartment. Sometimes we are both quiet, going about our routines, comforted just knowing that a person we love is on the other side, healthy and doing their best.Sometimes, when I’m home alone at night and my fiancé is late returning from work, I start to spiral. How can you sleep when the collective sadness is so damn loud? Sometimes I lay with my face down in the pillow and cry as I think of the people I read about that day. I imagine the worst-case scenarios for my loved ones—what this pandemic could do if we are not careful, what kind of havoc it could wreak on our lives. I think of seeing my mom on FaceTime, and the fear fills my throat to the brim. It’s people her age who are being intubated or placed on ventilators, left alone in the hospitals without family to help them. What would I ever do if something happened to her? How much of our time spent apart would I regret? How would I ever be able to forgive myself for not calling when she asked, for not going home when I had the chance?It may have taken the fear induced by a global pandemic, but I think I finally grasp the scope of my mother’s love. I understand the incessant yearning that came from my mother when I moved away—and the kind of heartbreak that comes from not being able to reach out and see me when she wants to. I’m beginning to understand why, whenever I’m home, she clings to me like I’m already gone, like I’m disappearing before her while she’s holding my sleeve.On my birthday last weekend, my fiancé led me to his laptop, and suddenly I heard screams of “Surprise!” My friends had organized a Zoom party without me finding out—a major coup on their part. Beneath the surprise, though, lay a familiar virus-induced sadness: I didn’t realize how much I’d miss hugging these people I love.Right before everyone sang happy birthday, my doorbell rang: the chocolate bundt cake Mom had mailed arrived right on time. I blew out the candles and looked at the screen full of people clapping, laughing, and blowing kisses. At the top left corner was my mother, smiling into her camera, looking over me.Explore Bon AppétitHealthyishHealthyish Guide to Being AloneCoronavirusessayRead MorecookingMake a Whole Galette For Yourself Because You’re Worth ItBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Phillip Picardi"]}