{"id": "ecf40333c775981c244add4befeab810", "url": "https://www.bonappetit.com/recipe/chicken-thigh-biryani", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "Chicken Biryani Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken BiryaniBy Sohla El-WayllyOctober 23, 20194.7(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintBiryani can be an elaborate, ambitious affair, packed with layer upon layer of spiced meat and vegetables all steaming together with ghee. This version is simplified, with just two layers—marinated chicken thighs and parboiled basmati—cooked together in a heavy-lidded dutch oven to keep all the steam (and flavor) locked in. Because biryani is all about the rice, this is the time to splurge on some extra-long, premium aged basmati. (You might need to go beyond your local supermarket and search online or at a specialty store.) Look for rice with a golden hue which indicates that it has been properly aged and ensures fluffy, distinct, fragrant grains.Ingredients4–6 servingsOnion Raita and Chicken1lemon½tsp. sugar1½cups whole-milk yogurt, divided3tsp. kosher salt, divided1tsp. fresh ground black pepper, divided1red onion14\" piece fresh ginger, peeled, thinly sliced2garlic cloves, smashed, peeled¾tsp. ground cinnamon½tsp. ground cardamon1½lb. skin-on, bone-in chicken thighs (4–6 thighs)2dried bay leavesRice and Assembly¾cup kosher salt2cups aged basmati rice (such as Daawat)1red onion, thinly sliced¾cup melted ghee or neutral oil½cup mixed coarsely chopped nuts, such as almonds, pistachios, pine nuts, and/or walnuts1Tbsp. sugar¾cup mixed dried fruit, such as prunes, apricots, pineapple, and/or cranberriesPreparationOnion Raita and ChickenStep 1Finely grate 1 tsp. lemon zest into a small bowl. Squeeze in juice from one half of the lemon. Add sugar, 1 cup yogurt, 1 tsp. salt, and ¼ tsp. pepper. Finely chop one-quarter of the onion and stir into raita. Let sit at room temperature at least 1 hour or chill up to overnight.Step 2Purée ginger, garlic, cinnamon, cardamom, juice of remaining lemon half, and remaining three-quarters of onion, ½ cup yogurt, 2 tsp. salt, and ¾ tsp. pepper in a blender until smooth. Transfer to a medium bowl.Step 3Using your hands, pull skin off chicken thighs and discard. (Don’t worry about any straggly bits of skin and fat; they will render out during cooking.) Transfer to bowl with ginger mixture, add bay leaves, and toss to combine. Cover with a plate and let marinate at room temperature at least 2 hours or preferably chill up to overnight.Rice and AssemblyStep 4Place a rack in lower third of oven; preheat to 350°. Bring salt and 3 qt. water to a rapid boil in a large pot over high heat.Step 5Meanwhile, place rice in a medium bowl. Cover with cool tap water, use your hand to gently agitate the grains, and drain. Repeat at least 2 more times until water runs clear enough to see your hand through it.Step 6Add drained rice all at once to boiling salted water. Initially the water will stop boiling and the rice will sink to the bottom. Stir a few times with a wooden spoon to prevent sticking, then stop stirring. After a couple of minutes, the water will return to a simmer and a few grains will begin appearing near the surface. The rice is ready to drain when the grains have nearly doubled in size, the water returns to a boil, and most of the rice rapidly bubbles to the surface. When you bite into a grain, you want to see a hard white core; just like pasta cooked al dente, the grains should remain firm. Depending on the quality of your rice, this can take anywhere from 3–7 minutes, so begin tasting the grains early. Drain rice and rinse with water until cool. Set aside.Step 7Cook onion and ghee in a 4–6-qt. Dutch oven over medium-high heat, stirring constantly, until onions are golden and crisp, 8–10 minutes. The sides and bottom of pot may brown and even develop some char. Don’t worry, this is a-okay! Color adds character! Using a slotted spoon, transfer onions to a plate.Step 8Reduce heat to medium-low and toast nuts in ghee in same pot, stirring occasionally, until fragrant and darkened in color, 2–3 minutes. Using slotted spoon, transfer nuts to another plate; set aside for serving. Transfer half of ghee in pot to a small bowl; set aside.Step 9Increase heat to medium-high and sprinkle sugar over remaining ghee in pot. Cook, stirring frequently, until sugar forms deeply caramelized clumps, 3–5 minutes. Add chicken, scraping in marinade, and bring to a simmer. Remove from heat and arrange chicken and marinade in an even layer. Sprinkle with dried fruit and one-third of fried onions. Top with rice. Poke 5–7 holes into rice with the back of a wooden spoon until you reach the chicken. Drizzle reserved ghee over and top with another third of fried onions. Cover with a tight-fitting lid and return to medium heat. Cook until you can hear the chicken gurgling in the pot and wisps of steam just begin to escape from lid, about 5 minutes. Do not open the lid at any point! If you peek, you will risk losing too much steam, preventing the rice from properly cooking through. Transfer pot to oven and bake, covered, 45 minutes. Let rest at least 15 minutes and up to 1 hour before uncovering.Step 10Using a large spoon or small plate, gently scoop rice off chicken and transfer to a platter. Carefully spoon chicken thighs and any sauce over rice. Top with reserved fried nuts and remaining onions. Serve alongside onion raita while ghee is still hot and rice is steamy.How would you rate Chicken Biryani?Leave a ReviewTell us what you thinkReviews (35)Back to TopTriangleThis was amazing and easy to make.  Next time, I'll follow some of the other suggestions to add some additional spices - like tumeric, cumin, and maybe some garam masala.  This cooked very well - the chicken was fall-off-the-bone tender and the rice was excellent.  It says 4-6 servings - there were 3 of us, and no leftoversBrian H2/21/2022Thanks, Sohla.  This was my first try at biryani and it inspires me to take on other versions.   The technique you suggested was perfect.  I didn't need to add any stock as you said and the parboil instructions were perfect.  As well as not touching the lid!  Big win, thanks.MichaelBoston, MA8/16/2021This was lovely. I just followed the cooking instructions on the bag of rice to the al dente point, and then added to the dutch oven. I didn't find this recipe to be difficult! A fair amount of prep, but nothing challenging. The flavors are incredible! I did add 1/2tsp of turmeric and 1/2tsp of cumin. Anonymous11/4/2020A labor of love but it is magnificent. Trust the process, trust Sohla. Make sure you allot a few hours for this one. AnonymousBrooklyn, NY10/27/2020This is a beautiful recipe. Also works well with leftover rice (arguable the best way to use leftovers even if it isn’t as perfect as the recipe intends). We are vegetarian so we sub in paneer and it works well- I add extra ghee to make up for the lost fat. Like others have suggested, I think it can be worth boosting the spices in a way that compliments the emphasis on warm spice in the recipe- I imagine this is particularly true if you’re making a vegetarian version because you lose all that great flavour that browning the meat gives. Almonds and dried apricots are my favourite combo!AnonymousCanada 9/23/2020This is an amazing dish. So many wonderful flavours. I cannot say enough. Thanks so much for this fabulous dish. \nVeeZeeToronto 9/6/2020Pretty involved but worth the effort for the huge quantity. There's more like 8 servings, can't imagine this just serving 4 lol. My rec: When you have the cooked rice in a bowl, mix in a 1/2 teaspoon turmeric and a teaspoon of garam masala. I also add a bit more ghee to the rice before I put on the lid for baking. I've made it a couple times now, with currants, walnuts, pistachios, cashews, anything works. I serve it up with achar for balance against the buttery sweetness of the biryani.SrAsparagusOakland, CA7/11/2020ANONYMOUS JACKSON HOLE 05/26/20   Have you tried Clorox Cleaner + Bleach spray?  I'm using it for a lot in the kitchen! SoCal6/20/2020I think it’s fantastic that Sohla created this recipe to introduce biryani to people who might not be familiar with it.\n\nSohla has done an amazing job of simplifying biryani and I reach for this method when I'm short on time.\n\nFor those readers who want the full Hyderabadi style  flavour, I suggest adding fresh mint and fresh cilantro and these extra spices: coriander powder, cumin powder, turmeric powder, whole bay leaves, black cumin or caraway seeds, mace, star anise or fennel seeds, brown cardamom, red chilli powder, black stone flower (optional), white poppy seeds (optional), green chillies.\n\nI personally opt for raisins and cashews as my favoured fruit and nut in biryani.  \n\nCaramelised ghee- noms!AnonfiletmignonAustralia 6/16/2020This is one of the best recipes I have ever tried on Bon Appetit. Following the recent scandal, I returned to see who made it. OF COURSE IT WAS SOHLA! \n\nTime to pay up $$$$$$$$AnonymousOakland6/15/2020Three stars for the advice on choosing the rice. What a difference! As far as the Biryani itself was concerned........there is definitely something missing in this recipe. Mediocre, so not worth the effort.Anonymous6/14/2020DELICIOUS. I accidentally started cooking this around 8pm resulting in not serving dinner until 10:15pm. While my friends were skeptical of the late dinner, they were blown away by how flavorful the dish was. And one of them is even a very picky eater! I marinated my chicken overnight which I think added a huge amount of flavor. The only problem is my dutch oven was basically stained after this and I can't get it clean again. Any tips for this??AnonymousJackson Hole5/26/2020YUM. I made a few moditifications, I only had 1 1/2 cups of basmati rice, so the other 1/2 cup was wild rice (yum) which I cooked it separately so the basmati wasn't overcooked. I used 1/4 cup of coconut oil and 1/2 cup of room temp butter instead of 3/4 cups ghee. My last moditifcation was greek yogurt instead of plain yogurt in the raita because it's just what I had, oh and I also got into a deep political discussion with my mother while cooking (thanks covid-19) so I forgot to simmer the chicken in the dutch oven for 5 minutes and instead chucked it straight into the oven. I quickly realised my mistake and decided to keep it in the oven an extra 5 minutes to compensate. It was delicious nonetheless. adamorangeSydney, Australia4/29/2020Ok so this legit took me all day (maybe because it's the first time I made it so I wanted to be thorough) but um yum. We don't really have much Indian food to be honest so maybe I'm not the best judge but I mean how can you go wrong with any recipe requiring ghee fried nuts, rice and dried fruit. I paired it with the bon appetit green bean salad to get some veg in and was super yum (DON'T SKIP THE RAITA). My family said it was like a restaurant meal! Maybe something saved for more special occasions rather than a weekly thing but will definitely be a recipe to keep in my inventory!bloodynomNew Zealand4/25/2020This is a tough one! In general I would say it was good, especially for those not familiar with Biryani or access to great Indian food.  \nAs the one anonymous guest alluded to, there IS a spice that is missing from this recipe. The recipe was easy to follow and the raita turned out as expected. I was disappointed in the Biryani itself, because I was expecting a deeper flavor like many of the Biryanis I’ve had at our local Indian food restaurants here in the Bay Area (Berkeley/Oakland). I would recommend this recipe for those who have a light Indian food palate. But for those who know what a Biryani is supposed to really be like, you may be a little underwhelmed by the flavors. I’m going to find out what the spices are that are missing and maybe try it again (garam masala, nutmeg, mace, pepper, cloves, chilis). AnonymousOakland, CA4/23/2020Explore Bon AppétitIndianSouth AsianAsianRiceRice & GrainsChickenPoultryChicken ThighYogurtOther IngredientsMainGluten-FreeRamadanDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-23", "author": ["Condé Nast", "Sohla El-Waylly"]}