{"id": "ecfa9578fa6e219b01353c483e25e604", "url": "https://www.bonappetit.com/recipe/orange-peel-chai", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Orange Peel Chai Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueOrange Peel ChaiBy Sonia ChopraApril 20, 20214.4(19)Read ReviewsTriangleEmailPinterestPrintPhotograph by Heami Lee, food styling by Maggie Ruggiero, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrintThis tea combines warming spices with the bright, bitter flavor of orange peels. Perfect for sick days, the recipe is totally adaptable—add cloves or fennel seeds, or stir in ground spices (or ½ tsp. of a blend like chai masala or haldi doodh) at the end. And if you like your drinks on the savory side, try adding ¼ tsp. smoky black cardamom.Ingredients2 Servings2clementines or 1 large orange2cinnamon sticks or 1 Tbsp. Burlap & Barrel cinnamon verum shavings5green cardamom pods, crushed1¾\" piece ginger, peeled, sliced2tsp. loose black or green tea or 2 tea bagsLemon wedges and honey (for serving)PreparationStep 1Remove peels from clementines, trying to leave as much white pith behind as possible; set clementines aside for another use (or snacking!). Bring 3 cups water to a boil in a small saucepan. Add clementine peels, cinnamon sticks, cardamom, and ginger and cook 3 minutes. Remove pan from heat and let sit 5 minutes.Step 2Set mixture over high heat and return to a boil. Remove from heat and stir in tea. Let sit 2 minutes.Step 3Strain chai through a fine-mesh sieve into 2 glasses, dividing evenly. Squeeze in lemon juice and add honey to taste.How would you rate Orange Peel Chai?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI’ve made this recipe twice. I had no use for whole oranges with extra pith, squeezing them and scooping out the white lining made for less bitter tea and fresh juice. The second step is useless. After boiling ingredients for five minutes, turn off the heat, wait for bubbles to recede, add tea, steep to desired taste then serve with honey alone. Lemon here seems like a throw at it and it was the worst idea. The green tea version on the stove is cooling now. Bon Appetite nailed this combination of flavors as Indian tea trifecta.Emme SfeaDenver, CO8/10/2021I'm curious to know why remove from heat and let sit then heat it up again?Cami SoCal Cycling ChefSan Diego, Ca6/15/2021I totally missed “cook for three minutes” in Step 1 the first time around. Perhaps it should be a separate sentence or the paragraph should end there. I was so confused I re-boiled, cooked, and let sit again. Anyway, I obviously didn’t do a good job following the steps exactly, but it seemed like the lemon just overpowered the whole thing. Don’t be like me!Anonymous5/7/2021I can\"t wait to try it.Anonymousoklahoma city5/6/2021Explore Bon AppétitHot DrinkDrinks AllIndianSouth AsianAsianCardamomHerbs & SpicesCinnamonGingerGreen TeaAlcohol & Other DrinksFallWinterEasyQuickSnackDrinksDairy-FreeGluten-FreeNut-FreeVegetarianKetoNonalcoholicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Sonia Chopra"]}