{"id": "ed0addcc363797115005fc31fbc80613", "url": "https://www.bonappetit.com/recipe/soy-ginger-dinner-scramble", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "Eggs for Dinner Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSoy-Ginger Dinner ScrambleBy Chris MoroccoDecember 17, 20184.9(45)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Frances BoswellEmailPinterestPrintEmailPinterestPrintScrambled eggs don’t have to be served plain with all the fun happening elsewhere. Ginger and soy sauce transform their basic reputation and make scrambled eggs for dinner feel like more than a cop-out.Ingredients2 servings3small Persian cucumbers, very thinly slicedKosher salt2Tbsp. unseasoned rice vinegar1tsp. honey1Tbsp. ghee or unsalted butter4large eggs2tsp. mirin (optional)1tsp. finely grated peeled ginger1tsp. white or regular soy sauceSteamed white rice, toasted sesame seeds, and sliced scallions (for serving)PreparationStep 1Place cucumbers in a small bowl. Add several pinches of salt. Massage cucumbers with your hands, gently at first, then squeezing more firmly as they expel excess water and become more pliable. Pour off any liquid they release.Step 2Stir vinegar and honey in another small bowl until honey is dissolved. Add to cucumbers and toss to coat. Season with salt if needed.Step 3Melt ghee in a small skillet (preferably nonstick) over medium-low heat. Whisk eggs, mirin (if using), ginger, and soy sauce in a medium bowl until eggs are completely smooth and no visible bits of whites remain. Add to skillet and cook, stirring with a rubber spatula, until large wavy curds form and no wet egg remains, about 2 minutes. Taste and season with salt.Step 4Serve eggs on top of rice. Top with pickled cucumbers, sesame seeds, and scallions.Step 5Do Ahead: Cucumbers can be pickled 3 days ahead. Cover and chill.How would you rate Soy-Ginger Dinner Scramble?Leave a ReviewTell us what you thinkReviews (26)Back to TopTriangleThis dish is my go-to comfort food. I find I don’t need quite so much rice, and if I’m pressed for time (or just tired), it’s fine to leave the cucumbers fresh and skip the pickling step. The vinegar in the rice is plenty of acid. \n\nI’ve made this dish at least once a month for years. Even the biggest soy or ginger skeptics will enjoy this combination of textures, temperatures, and flavors. Edith B.Providence, Rhode Island 3/26/2022The pickled cucumbers are delicious! Who knew rice vinegar and honey could do so much?! But the eggs were... not good. The flavor was really off — I can’t put my finger on it, but I suspect it’s the butter (there’s a reason why it’s almost never used in Asian dishes!). Plus, if you use regular soy like I did, expect a pile of gray, muddy-looking eggs. Jen NealNYC, NY2/12/2021Embarrassed to admit as much as I love eggs, I'm just not great at seasoning them unless they're pickled for ramen. This was really good, easy, and filling. Used brown rice and added a bit more seasoning to it. BilliePittsburgh, PA1/27/2021Really delicious, though I would definitely suggest adding more soy sauce on the rice. I pickled some round slices of carrots, too. Would also be nice with a bit of sweet chilli sauce and beansprouts. This dish reminds me of a similar taste to Vietnamese omelettes. I'm making it again for lunch!PhoebeGlasgow, UK1/26/2021OMG!!  This dinner is scrumptious and quick to pull together. Never better eggs. Anonymous1/21/2021Oh my god, this is now one of my favorite dinners. Period. This is so delicious it's insane; it's a go to now, and my relationship with eggs has been forever changed. MAKE THIS NOW. I cannot recommend it more. Though fair warning, if you use regular soy sauce and not white soy sauce, the eggs will not be the beautiful yellow color you see in the photo, they will be tinted brown. Still ungodly delicious but won't look like you expected. AnonymousChicago, IL11/4/2020Simple, foolproof, tasty, fun! Add heat and crunch if you love heat and crunch. AnonymousWashington, DC5/12/2020This recipe is fantastic and exceeded my expectations! Thank you Chris for another favorite that we will go to again and again for a quick weeknight dinner! The ginger, soy and mirin do wonders for the eggs and the cucumbers add a delightful brightness and crunch! Topping with sesame seeds is a must! AnonymousLong Beach, CA5/6/2020Excellent, easy way to get some protein and to jazz up pantry staples. Still good if you can’t make the pickles, but they take it to the next level.Royal Oak, MI, USA5/2/2020Lo in the time of quarantine when the delivery driver does pick up the wrong cucumber, this dish does still deliver excellent flavor with minimal effort.AnonymousUnited States5/1/2020Great recipe! I could see eating this for breakfast as well. \nAdding fresh ginger and mirin to the eggs is INCREDIBLE - I never would have thought to do this. \nSuper, filling, and delicious. AnonymousSeattle, WA4/24/2020This was amazing and so very filling. During the time of quarantine, this recipe creates something delicious with pantry staples. Definitely use the mirin! Makes all the difference.  900264/23/2020This is so incredibly delicious! And easy! My go to recipe when I don't feel like making supper.  The flavours compliment each other so well! Added some local arugula sprouts for extra greens and it was perfect New Brunswick, Canada4/21/2020LIFE-CHANGEINGLY GOODbrinydepthsEngland4/16/2020Sooooo good. I made these at 4am because I was hungry and couldn't go back to bed. If you ever wanna make something that SLAPS just right, these are your eggs.emmyathomeWisconsin4/9/2020Explore Bon AppétitCucumberVegetableEggGingerHerbs & SpicesQuickWeeknight MealsMainVegetarianHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-17", "author": ["Condé Nast", "Chris Morocco"]}