{"id": "ed0a50e11f53042c804703fedbf8b50d", "url": "https://www.bonappetit.com/recipe/prime-rib-roast-with-habanero-crema", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Prime Rib Roast With Habanero Crema Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssuePrime Rib Roast With Habanero CremaBy Ayesha CurryNovember 23, 20214.1(29)Read ReviewsTriangleEmailPinterestPrintPhotograph by Eva Kolenko. Food styling by Susie Theodorou. Set design by Kira Corbin. On set producer: Jennifer Thomas.EmailPinterestPrintEmailPinterestPrintThis festive recipe is inspired by the braised oxtails that actor and cookbook author Ayesha Curry’s mom served at Sunday dinners: It has all the same flavors but repackaged into a prime rib roast. Be sure to rest the meat before slicing for maximum juiciness and tenderness.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonMortar and Pestle$25 At AmazonInstant-Read Thermometer$35 At ThermoworksCast Iron Skillet$30 At AmazonIngredients8 ServingsHabanero Crema1habanero chile, seeds removed, finely chopped1cup sour cream½cup cilantro leaves with tender stems2Tbsp. drained prepared horseradish1Tbsp. fresh lime juice1Tbsp. Worcestershire sauce2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt½tsp. freshly ground black pepperRoast and assembly¼cup fennel seeds¼cup garlic powder2Tbsp. caraway seeds2Tbsp. dried thyme2Tbsp. smoked paprika2Tbsp. black peppercorns17-lb. bone-in prime rib roast, chine bone removed, fat trimmed to ¼\", tied with kitchen twine2Tbsp. grapeseed or vegetable oil2Tbsp. plus 1 tsp. Diamond Crystal or 4 tsp. Morton kosher salt Fresh bay leaves (for serving; optional)special equipmentA spice mill or mortar and pestlePreparationHabanero CremaStep 1Blend chile, sour cream, cilantro, horseradish, lime juice, Worcestershire sauce, salt, and pepper in a blender until smooth. Transfer to a small bowl and chill until ready to use.Do ahead: Crema can be made 2 days ahead. Cover and keep chilled.roast and assemblyStep 2Place a rack in middle of oven and preheat to 325°. Coarsely grind fennel seeds, garlic powder, caraway seeds, thyme, paprika, and peppercorns in a spice mill or with a mortar and pestle. Place roast on a rimmed baking sheet. Rub with oil and season all over with salt. Sprinkle spice rub over, ensuring all sides of beef are coated. Chill roast, uncovered, 8 hours.Step 3Heat a dry large cast-iron skillet over medium-high; cook beef until browned, about 4 minutes per side. Transfer skillet to oven and roast beef until an instant-read thermometer registers 120°–125°, about 2 hours. Transfer to a cutting board and let rest 20 minutes.Step 4Transfer roast to a platter; tuck bay leaves around if desired. Serve sliced with habanero crema.How would you rate Prime Rib Roast With Habanero Crema?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleAmazing!  Great twist on classic beef rib roast.  Haberno crema is out of this world.  I made extra of the spice rub and think it will go great on a pork loin.JLBWashington, DC12/25/2021The roast is delicious but the horseradish sauce is the star of the show here. The recipe makes for a lot of super fragrant spice rub and the roast gets a really nice bark on it when it's resting in the fridge. With the spice rub on the outside I didn't think the searing step actually added that much, if anything it broke up the bark that formed while resting. Going to try skipping it next time I make it.Sam A12/24/2021I know how to roast beef. It was the sauce I was after. Made it with my home grown fresh Thai peppers rather than a store bought habanero. Delighted with the outcome.RARNorth Idaho12/24/2021Does not make any sense!?!? It says to turn oven on at 375 and than you say to chill roast for 8 hours??? What am I missing?\nI really want to make this tomorrow!\n\nThank youAnonymous12/24/2021So it’s a beautiful recipe with subpar instructions.  Can’t wait to try part(s) or all of it.  Chill, friends.  After everything!!! that’s gone down the past few years, we are still here cooking and feasting with the ones we love. CissyFort Valley, Virginia12/21/2021I think we can all figure out not to preheat for 8 hrs. Come on people!JaneOrlando, FL12/21/2021Yes, the instructions were not the best but the end result was amazing!  The flavors were so rich.  I seared it, put it in the 325 degree oven, (luckily) used a meat thermometer because instructions said it would take 2 hours and mine was perfect at 1 1/2 hr. and was medium rare.  The Habanero Crema was perfect!  I will make this again--knowing what to do.  susan schmitzMadison, WI12/21/2021Whoever wrote this recipe is an idiot. You turned the oven on, but never roasted the meat. Hire someone who can actually cook this recipeDennisPasadena ca.12/17/2021These instructions are poorly edited.  Based on a similar recipe from Epicurious.com for a rib roast with roasted garlic horseradish crust, this should be \"Coarsely grind fennel seeds, garlic powder, caraway seeds, thyme, paprika, and peppercorns in a spice mill or with a mortar and pestle. Place roast on a rimmed baking sheet. Rub with oil and season all over with salt. Sprinkle spice rub over, ensuring all sides of beef are coated. Chill roast, uncovered, 8 hours.\" first.  Then do the searing, roasting (after pre-heating the oven but not for 8 hrs) and resting as instructed.AnonymousMA12/17/2021I'm going to assume that I stand the roast back up after browning. CalvinLos Angeles, CA12/17/2021I look forward to trying the recipe.  Will it work using the \"500°F for 5 minutes per pound, then turn off the oven and let sit for 90 minutes\" method of cooking?  A lot easier than wrangling around this large chunk of meat in a hot skillet.  Bob AzPhoenix AZ12/17/2021We will definitely try this. We love spice and prime rib. And we can decipher that “preheat the oven…” should have been in step 3 not 2.  Maybe edit this for the rookies. Thanks for all the inspiring recipes. NildyOmaha, NE12/17/2021I understand the issues with how the recipe is written but we made this last night for a “friendsmas” dinner and it was phenomenal.  The flavors of the rub, the method of chilling in the fridge for eight hours, and the Crema all made for one of the best rib roast I’ve ever done.  The flavors are very bold.  Perfect for my spice loving friends.Anonymous12/5/2021Yup, something’s not right with this recipe. Pre-heat oven then chill?AnonymousNew Haven, CT12/2/2021Am I reading this right?  Preheat the oven, then CHILL the roast for 8 hours.  So the oven is left on for 8 hours while the roast is in the fridge?  And then I'm assuming you don't need to bring it back to room temp before you sear it?AnonymousRichmond, CA11/28/2021Explore Bon AppétitPrime RibRoastChileVegetableDinnerCast ironRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Ayesha Curry"]}