{"id": "ed0fc55fdade15d2ae09e0b708d9db89", "url": "https://www.bonappetit.com/story/slow-up-bars", "year": 2020.0, "month": 11.0, "day": 1.0, "content": "These Energy Bars Are Basically a Portable Grain Bowl  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Energy Bars Are Basically a Portable Grain BowlSo fresh, they’re stored in the fridge.By Ali FrancisNovember 6, 2020FacebookTwitterEmailCourtesy of Slow UpFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!It was with a fair shake of skepticism that I tried Slow Up's sweet and savory “fresh food bars” made from fruits, vegetables, and grains. Could these tiny beige squares really compete with a freshly prepared snack? But considering my big domestic goddess energy ran dry in June, and I still wanted to feed myself nourishing things without blowing my budget on Seamless, I figured it was worth a shot. Approximately 14 to 17 bars in, I’m a convert.With 11 grams of protein and only three grams of sugar on average per bar, Slow Up bars are objectively better for me than pretty much everything in the snack aisle. They’re also vegetarian, gluten-free, and tucked inside colorful, compostable packaging. My favorite bar, poblano black bean, is made only of ingredients I can pronounce—like almonds, egg, quinoa, corn, vegetables, and honey—and tastes like a vegetal grain bowl that’s been whizzed up and compressed into a palm-size square. The Calabrian chili lemon flavor is pleasantly spicy and noticeably packed with pine nuts, and the cacao almond is dark and nutty, like a less sweet (but still chocolaty) brownie. Texturally, they’re similar to a firm frittata, with a snappy exterior and spongy middle.The one trade-off with fresh ingredients is that they’re perishable. “Good food goes bad,” head chef Caroline Schiff says. “There are only a few ways to make something last for a long time out of the fridge—dry it, pack it with sugar or salt, or pump it full of chemical preservatives or acids.” That’s why Slow Up bars are designed to stay in the fridge, where they’ll last up to 14 days. (Not to worry—if you’re anything like me, you’ll finish the variety pack long before its expiration date.)When I need to get a jump start on lunch, I’ll cube up the poblano bar and sprinkle it over lettuce with grated cheese, or crisp it up in the toaster and top it with a fat hunk of avocado and a drizzle of olive oil. But even when I’m too frazzled to do anything but open and chew, Slow Up bars don’t let me down. Photo courtesy of Slow UpSlow Up Bars Variety Box$39 at Slow UpSlow Up ships to most parts of the Northeast U.S. Explore Bon AppétitHealthyishHealthyish Loves ItShoppingSnackRead MoreshoppingI Can't Start the Day Without Crunchy Sprouted BuckwheatBy Amber GibsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-06", "author": ["Condé Nast", "Ali Francis"]}