{"id": "ed19532c2f4d7fdc873f9a49a9cd34c3", "url": "https://www.bonappetit.com/recipe/toast-skagen-swedish-shrimp-toast", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "Toast Skagen (Swedish Shrimp Toast) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesToast Skagen (Swedish Shrimp Toast)By Hana AsbrinkJune 6, 20214.4(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Micah MortonEmailPinterestPrintEmailPinterestPrintToast Skagen is one of the quintessential Swedish foods, a popular appetizer in both home and restaurant kitchens. Named after a fishing port town located at the northern part of Denmark’s Jutland peninsula, it was created by famed Swedish restaurateur Tore Wretman in the years after World War II. You’ll find many renditions of this elegant and easy knife-and-fork, open-face toast—luckily, I’ve never met one I haven’t liked. In my version of Skagenröra, the shrimp are bound with mayonnaise and crème fraîche, then punctuated with fresh dill, lemon (both the zest and juice), and whitefish roe. Traditionally, the shrimp used in the creamy mixture (called Skagenröra) are small, sweet North Atlantic shrimp that are wild-caught and hand-shelled. You can occasionally find such shrimp Stateside in the frozen aisle, but any small shrimp (sometimes called salad shrimp) in the 91–110 count per pound will do. The Skagenröra is chilled in the refrigerator before being heaped upon slices of white bread that have been toasted in a bit of butter.—Hana AsbrinkAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCutting Board$10 At IKEALarge Skillet$84 At AmazonMicroplane$16 At AmazonGet It Right Spatula$13 At BA MarketMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonMesh Sieve$13 At AmazonLarge Bowl$18 At AmazonSmall Bowl$13 At AmazonTongs$13 At AmazonIngredientsMakes 4 ¼small bunch dill¼medium red onion112-oz. bag frozen cooked peeled, deveined, tail-off small shrimp (preferably North Atlantic), thawed1lemon3Tbsp. mayonnaise (preferably Hellmann’s or Best Foods)2Tbsp. crème fraîche¼tsp. kosher salt, plus moreFreshly ground black pepper2Tbsp. unsalted butter4slices white bread (such as Pepperidge Farm)4tsp. bleak fish or whitefish roe (optional)PreparationStep 1Finely chop tender sprigs from ¼ small bunch dill to yield ¼ cup.; place in a large bowl. Set some larger sprigs aside for serving.Step 2Finely chop ¼ medium red onion (you should have about 3 Tbsp.) and add to bowl with dill.Step 3Thoroughly pat dry one 12-oz. bag frozen cooked small shrimp, thawed, with a kitchen towel or paper towels. Coarsely chop half of the shrimp. Place all shrimp in bowl with onion and dill.Step 4Using a Microplane, finely grate zest of 1 lemon into bowl, then cut lemon in half and squeeze juice of one half through your hand or a fine-mesh sieve into a small bowl; you should have 1 Tbsp. Add lemon juice to bowl with shrimp and mix gently with a rubber spatula to combine. Cut remaining lemon half into 4 wedges and set aside for serving.Step 5Add 3 Tbsp. mayonnaise, 2 Tbsp. crème fraîche, and ¼ tsp. kosher salt to shrimp; mix gently to coat. Season with freshly ground black pepper and more salt if needed. Cover with plastic wrap or transfer to an airtight container and cover. Chill at least 30 minutes and up to 1 hour.Step 6When ready to serve toast, melt 2 Tbsp. unsalted butter in a large skillet over medium-low heat. As soon as butter is sizzling, arrange 4 slices white bread in pan and cook, turning a few times to allow both sides to absorb some butter, until golden brown, about 4 minutes.Step 7Transfer toast to plates and top with shrimp salad. Spoon 1 tsp. bleak fish or whitefish roe (if using) over each toast and top with reserved dill leaves. Serve with reserved lemon wedges for squeezing over.How would you rate Toast Skagen (Swedish Shrimp Toast)?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleI’m from the United States. The onion is awesome!AlanOhio8/28/2021Delicious but I find it very rich with the buttered toast.  I would prefer with a grainy bread and no butter or crackers.  DtroubleOttawa 7/17/2021The onion is traditional, and heaps of horseradish as well. My favourite appetizer!AnonymousSweden7/16/2021Very good! Made it without toast for our midsommar meal. In Los Angeles/Santa Monica, Shoop’s Delicatessen has frozen little shrimps just for this purpose. Looking forward to trying more Asbrink recipes!AnonymousLA7/11/2021Agree that the onion is an abomination.AnonymousMichigan6/22/2021Absolutely fantastic! It's simple to assemble and tastes delicious. I've been raving about this recipe to everyone I know. (also, I used salmon roe since I couldn't find whitefish or bleak fish roe, and it still tasted awesome) EmmaToronto, Ontario, Canada6/15/2021If you don't like or want to use the red onion, try a shower of fresh chopped chives. I tried this when I wanted to make the shrimp toasts but was out of onion, and the fresh chives were a lovely substitute. This is a great recipe!MomcatusaAnderson, SC6/10/2021Love the onion Anonymous6/10/2021I am from Denmark, the onion is an abomination.Mette6/8/2021Explore Bon AppétitToastSwedishScandinavianEuropeanShrimpShellfishSeafoodDillHerbs & SpicesLemonCitrusFruitEasyStarterNut-FreeLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-06", "author": ["Condé Nast", "Hana Asbrink"]}