{"id": "ed3689c8a45d62e1b34ce9b509d1b776", "url": "https://www.bonappetit.com/story/pretend-restaurant", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "We Can’t Go to Restaurants Anymore, So I Opened a Pretend One | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureWe Can’t Go to Restaurants Anymore, So I Opened a Pretend OneCOVID-19 has robbed us of pleasures both big and small. Dining at Chez Raché’s is a minor defense against major grief.By Rachel KhongApril 13, 2020FacebookTwitterEmailPhoto by Rachel KhongFacebookTwitterEmailIt’s a time of minor disappointments that we don’t feel right feeling, because they don’t compare to the vastness and ubiquity of the world’s suffering. My husband, Eli, had a trip to France scheduled for the end of March. When it became clear that he couldn’t go, we joked that I could cook a French meal for him as consolation. My own minor disappointment was that I’d been looking forward to going to a writers’ residency for the month of April—one of those residencies where I would be cooked for—and it was canceled. We joked that, instead, I could shut myself in the bedroom, and Eli could leave picnic basket lunches at the door.I took my French meal assignment seriously. I emailed a Google calendar invite for 7:15 p.m. on a Wednesday. (He RSVP’d yes.) I considered the ingredients we had on hand: a frozen package of beef stew meat; carrots and cardoons that had come in our farm box. His trip was supposed to have taken him to Lille, in Northern France, where a Belgian beef-and-beer stew called carbonnade flamande is popular. I could roughly approximate it if I swapped in our last two cans of Pabst Blue Ribbon for Belgian ale.I painted, in watercolor, a menu for Chez Raché’s (which I realized, after the fact, should have correctly been “Chez Raché,” but didn’t have the energy to repaint). And on the night of, I lit candles and played music: “La Vie En Rose” and Spotify’s “French Bistro” playlist. Making his way over from the bedroom to the kitchen, Eli wore a coat jacket, button-down shirt, and wingtip shoes. (He immediately shed the jacket because: comfort.) We clinked our wine glasses together. Dessert was “pepites de chocolate,” which Google Translate told me meant “chocolate chips.” I presented them in a glass dish.What’s good about restaurants is what’s always been good about them: They’re a venue for the willing suspension of disbelief from life, which is always, even under normal circumstances, a far cry from perfect. The best restaurants are transporting—they take us to a place where someone else has made decisions with our happiness in mind. They provide respite, however illusory, and feed us, too. Or, at least, they did, before this pandemic. Before our governments mandated we no longer dine out.By now, you’ve likely read about—or experienced yourself—the many cruel things that COVID-19 does to the human body. That it can take from us two senses—taste and smell—which happen to be crucial to the enjoyment of eating. It’s a virus that robs us of pleasure, and some of us of life itself.Since shelter-in-place began, I keep thinking back to all the times I’ve been sick and, in the throes of miserable illness, regretted that I’d been taking my healthy days for granted. The privileges I’d presumed were givens are now glaringly obvious: the ease of shopping for food, the access to innumerable ingredients, the pleasure of dining out. This period has been the rare opportunity to not overlook what’s good: that, for the moment, I am healthy. I can taste food. I am alive.Lately I’ve been wondering if not allowing ourselves to feel our minor sadnesses is its own heartbreak amid this global one. That this big collective grief has been a blunting force, erasing lesser griefs, erasing joy, and erasing the hope that might ultimately help us create a better world at the end of all this, a world that takes nothing and no one for granted.So I’d recommend, if it sounds fun and possible to you, opening your own pretend restaurant for a night. It’s not exactly escapism; escape isn’t really possible. But it can be a joyful-sad reminder of what we’ve been taking for granted, and what we still have.The restaurants I’m planning in the weeks to come include Halal Gal, which will serve Halal cart–style chicken over rice with a squeeze bottle of creamy white sauce; Rachiehana’s, where the chef will attempt an onion volcano and to flick a shrimp into the sole diner’s open mouth; Trattoria Khongo, where the pasta will come in gigantic, un-Italian portions, and house wine will be served by the carafe. It’s a minor defense against our minor disappointments, and major grief. It’s fortification to go on living, however life will look, even if—especially if—we don’t yet know.Explore Bon AppétitCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-13", "author": ["Condé Nast", "Rachel Khong"]}