{"id": "ed3b7d0231c9397614edca29a55b1eb1", "url": "https://www.bonappetit.com/story/yesfolk-tonics", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "Yesfolk Tonics Makes Kombucha Like You've Never Seen—Or Tasted—Before | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleYesfolk Tonics Makes Kombucha Like You've Never Seen—Or Tasted—BeforeThe small-batch company ferments with ceremonial-grade herbs and teas to make wildly tasty kombucha.By Aliza AbarbanelNovember 26, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThere's never been a better time to be a kombucha lover. The fermented tea-based drink has overtaken the grocery store, edging out coconut water and sparkling switchel to claim an entire aisle for funk. It’s a brave new world of beverages, with brands hailing from Portland, OR, Portland, ME, and everywhere in between. But in this heavily saturated, highly carbonated market, one brand has stood out to me for its nuanced flavors and conscientious sourcing: Yesfolk Tonics kombucha feels totally fresh.Yesfolk founders Yiyi Mendoza and Adam Elabd are trained herbalists who have experimented with fermentation together since 2012. (Elabd has even authored a book on the matter, Fermenting Food Step by Step.) The couple’s process is rooted in respect for ingredients and a deep knowledge of fermented foods, often derived from their own Mexican and Egyptian heritages. Their family-run microbrewery in upstate New York is located in a converted church—a fitting location for producing such ethereal drinks.Frank Mendoza, Yiyi Mendoza, Adam Elabd and Javier Mendoza in the converted church where Yesfolk is brewed.\nPhoto by Michael ValiquetteYesfolk enlists ceremonial plants like calendula, palo santo, and yaupon to create functional tonics that go beyond your standard probiotic fizz. Their kombucha is fermented in custom-made oak barrels, fortified with wild harvested (and often ceremonial grade) single-origin teas, and packaged in sleek, marbled aluminum cans. “We both worked on organic medicinal herb farms, so we are always thinking about quality and sourcing, even with not overtly medicinal herbs,” says Elabd. ”It’s an opportunity to think about how we can pair this drink with ingredients that are going to promote wellbeing and be uplifting and nourishing in multiple ways.”The trio of core flavors—yaupon, osmanthus oolong, and jasmine—is supplemented with a rotation of tonics like hibiscus blossom water kefir, palo santo coffee, and ginger beer. The resulting beverage is delicate and smooth, balancing aromatic teas with that telltale fermented earthiness. It’s an herbal elixir that tastes as complex as any cocktail, served up in a can that’s unlike anything else in the kombucha aisle. “We really wanted the bottles to be a continuation of the craft and process that goes into the drink,” says Mendoza, a ceramicist who works with artist Felicity Grace Jones to design the cans. “It strikes you as something that’s different because it’s in a differently shaped can.”Still, choosing cans wasn’t just a matter of aesthetics. Aluminum cans are recyclable and lighter than the typical glass kombucha bottle, so they require less fossil fuel for transportation and are easier to carry around. (For now, the Mendozas and Elabd hand-deliver their tonics to wholesalers across New York state.) While bottles can let in trace amounts of light or air, which can affect fermentation, Yesfolk’s cans are tightly sealed to preserve the drink in its peak.Once that bottle is cracked open, the first sip is a lesson in what kombucha can be. My favorite flavor is yaupon, a plant native to North America that’s rich in caffeine and theobromine. It tastes of dried sweet desert mint and tangy guava, and the little bubbles of carbonation roll across my tongue. Osmanthus oolong kombucha is silky and peachy, and Yesfolk’s water kefir, a dairy-free ferment pairing wildflower honey with hibiscus, chamomile, and calendula flowers, is even more aromatic. These tonics can be tracked down at bagel shops, yoga studios, and cafes throughout New York state, with more locations serving soon. Those overcrowded kombucha aisles better make some room—that distinctive Yesfolk can is coming for them.Buy Yesfolk in stores throughout New York state.Explore Bon AppétitHealthyishKombuchaNew YorkShoppingRead MoreLifestyleThese Sparkling CBD Drinks Have Replaced My La Croix Habit For GoodBy Annie DalyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-26", "author": ["Condé Nast", "Aliza Abarbanel"]}