{"id": "ed3b6dcc5222f1bdd29b9812f8e77e89", "url": "https://www.bonappetit.com/story/phyllo-crinkle-cake-recipe", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "The TikTok-Famous Phyllo Crinkle Cake Recipe Is Worth the Hype | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDon’t Sleep on This TikTok-Famous Phyllo Crinkle CakeIt’s one of the best things you can do with store-bought phyllo dough.By Zaynab Issa, as told to Nico AvalleMarch 1, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat BoytsovaFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.This might come as a surprise, but even though I share a lot of my own recipes on Tiktok, I don’t spend a ton of time on the app. Sure, there’s a seemingly infinite amount of food and cooking videos to scroll through (a vortex), but I have a job to do, and apparently watching recipe videos in the test kitchen doesn’t count as “research.” Still, the algorithm is efficient, so rest assured that if there’s a hot new trend on #FoodTok, it’s going to show up on my For You Page right away. And if it’s really good, it’ll probably show up more than once as others on the app re-create, rehash, and riff on the recipe.That’s how, during a quick scroll through TikTok in bed at a totally normal hour, I found this phyllo crinkle cake recipe. First, I saw the original video by Ramena from @RamenaSaidWow, where she cleverly folds sheets of phyllo dough together like an accordion, then douses them with butter, sugar syrup, and a simple custard. Ooooh, wow, I thought looking at the crispy-crackly end result, that looks gooooood. So I did what I do with all of the best-looking recipes: Tossed it a heart and swiped on with my evening.TikTok contentThis content can also be viewed on the site it originates from.But the phyllo crinkle cake kept popping up. Other creators on the app were going wild for the crispy, crunchy layers of folded phyllo, raving over the pillowy insides, bread pudding-esque flavor, and the recipe’s undeniable simplicity. Don’t get me wrong: Not every TikTok recipe that takes off is a masterpiece. But Ramena’s multi-bake technique—which manages to soak up butter, custard, and a sugar syrup without creating a soggy pastry—seemed almost too good to be true. But after giving it a shot or three, I’m happy to report that this phyllo crinkle cake is well worth the hype. With a few simple ingredients, these fluffy croissant-like layers are only an hour away.ContentThis content can also be viewed on the site it originates from.Here’s how to make it:To make Ramena’s recipe, start by holding 2 sheets of phyllo dough by the corners, like you’re shaking out a bedsheet. Scrunch the sheets up into a fluffy accordion about 1\" thick. I highly recommend watching Ramena’s original TikTok to get the technique down so you can achieve that trademark crinkle. Lay it into a parchment lined 13x9\" baking pan—folds facing upward—and repeat until the baking pan is full. Then bake the phyllo on its own for 10 minutes at 350°.After the first bake, drizzle 1 cup melted unsalted butter evenly over the phyllo. Bake for another 10 minutes. During this bake, whisk together 1 cup milk, 2 eggs, 1 cup sugar, and 1 Tbsp. vanilla extract in a medium bowl until combined. Remove the phylo from the oven and pour the custard evenly over the phyllo before returning to the oven until the top is golden and crispy, 30–40 minutes.Last, you’ll want to prepare the syrup by simmering 1 cup sugar, 1 cup water, and 1 tsp. lemon juice in a small saucepan over medium heat. The sugar syrup won’t go back into the oven, so you should aim to reduce the liquid until the texture is slightly thicker than simple syrup to avoid a soggy cake. Remove the cake from the oven and drizzle syrup on top. Then allow the cake to cool before cutting and serving.It’s a brilliantly simple recipe, practically begging to be customized. So far I’ve tried a rosewater version using floral extract in the syrup, another with chai spices mixed into the custard, and a nuttier take with crumbled pistachios sprinkled on top. The genius of the cake is that there’s room to riff at pretty much every step. Bake some fruit on top during the last trip to the oven, replace the sugar syrup with a drizzle of dulce de leche, or stud chocolate chips into the phyllo folds. There's an infinite scroll of content—I mean, of potential. Whatever you do though, don’t sleep on Ramena’s recipe.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-01", "author": ["Condé Nast", "Zaynab Issa", "As Told To Nico Avalle"]}