{"id": "ed3c7ede3f5c0fda7a4c0428861c53b6", "url": "https://www.bonappetit.com/story/jessamine-chan-breastfeeding", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "I Thought I'd Have to Break Myself to Feed My Baby. Then I Found These Lactation Cookies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Thought I'd Have to Break Myself to Feed My Baby. Then I Found These CookiesAn effortless breastfeeding journey is rare, but there are ways to make it gentler.By Jessamine ChanFebruary 8, 2022FacebookTwitterEmailIllustration by Hazel ZavalaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is All on the Table, a column featuring writers we love sharing stories of food, conflict, and community. This month, Jessamine Chan, author of The School for Good Mothers, recounts her tumultuous breastfeed journey—and the rituals she developed to cope.There's a photo that captures my first weeks of motherhood, but it’s too embarrassing to publish. I’m sitting on a folding chair at the top of the stairs in a narrow hallway. The TV tray in front of me holds a pile of Chinese food. I’m pouting, my body curled small with my arms crossed tight, posed like a kid in time-out. My parents, who’d come to Philadelphia to help with the baby, wanted me to follow the postpartum Chinese principles of confinement or “zuo yue zi,” which, according to my father, translates from Mandarin to “sitting still indoors for a month.” During this period of rest, a new mother is fed special foods, such as rich chicken soup perfumed with ginger and wine or bone broths laced with plump red dates. The meals aim to promote blood flow, restore qi, and most important for me, increase milk production.My C-section had left me bedridden, so I was stuck upstairs, eagerly awaiting the exquisite dishes my father prepared. But my appetite while nursing far outpaced my father’s cooking. I craved filling, starchy sweets, like chocolate babka from the local bakery. I felt so loved but so hungry. And despite my family’s efforts, confinement hadn’t solved my milk problem.In the hospital I’d learned that my C-section had slowed the natural process of lactation. As a result I wasn’t producing enough milk for my daughter to gain weight. Every two hours I nursed and pumped, praying my body would cooperate. My inadequate supply drew the attention of a parade of medical personnel—especially the lactation consultant who, along with a litany of corrections, matter-of-factly noted my baby’s shallow latch and how I wasn’t holding her properly. The consultant meant well, but I was crushed. Due to pregnancy-related carpal tunnel syndrome, my arms and hands felt electrified with pain, so even holding my baby was excruciating.Without the right latch, my daughter wouldn’t get enough nutrients from my milk. If she didn’t get enough nutrients, I’d have to supplement with formula. And if I didn’t agree to use formula, I might need to leave her at the hospital until she reached a healthy weight.I wanted to scream. But I was too anxious and sleep-deprived to do even that. Nothing had gone according to plan. I didn’t breathe through my contractions. I didn’t surrender to the pain. I didn’t have a natural birth. And now I couldn’t provide my baby with the milk she needed to thrive. I’d arrived at motherhood consumed with big-picture worries: whether I’d raise a confident daughter, what values I’d impart, if I’d have time to write. I hadn’t expected to fail so soon.Going home without her wasn’t an option. That night I cranked the breast pump to its highest setting, willing myself to ignore the pain. I didn’t care about hurting myself. If they needed me to try harder, I’d keep trying until I broke my body.The effortless breastfeeding journey is rare. According to a study by Pediatrics, only 8 percent of women nurse easily within the first days of motherhood. Yet no one at the hospital mentioned the commonness of my experience. Similarly, my parents—despite their good intentions—didn’t explain why confinement was beneficial or necessary. “Sitting the month” is an opportunity to convalesce after the trauma of birth, to be doted upon and protected. You aren’t supposed to feel trapped.On the flip side, new mothers in America are often characterized as tireless superwomen who “do it all.” While I understood this to be a fantasy too, I still wanted to be capable and independent. Already hemmed in by the rules of postsurgical recovery, I didn’t want any more limits. I yearned to make decisions for myself, to discover my own maternal instincts.The School for Good MothersChan’s debut novel, The School for Good Mothers, is out now.$23 at Amazon$25 at Bookshop.orgThough I’d brought my daughter home, her weight was still being monitored, along with my milk supply. So I rotated through a flurry of homeopathic tricks. I drank mother’s milk tea until I reeked of fenugreek. I increased my calorie intake until I was consuming enough food for a family of five. When none of that worked, I did what anyone does in times of stress—I turned to the internet. I needed to find a different kind of stillness, on my own terms.Deep in mommy-blog-land, I discovered lactation cookies: chocolaty oatmeal biscuits made with magical milk-stimulating brewer’s yeast. I’m prediabetic, so sweets of any kind are rare delights. Luckily enough, my sister found a recipe that used low-sugar ingredients like figs and agave, plus sprouted quinoa, flaxseed meal, and coconut oil. She baked a couple of batches, shipped them over, and soon I had a stash to last for weeks. Each morning I hopped off the hamster wheel of newborn care long enough to eat a cookie. After changing diapers, nursing, and pumping in the afternoons, I ate another. The palm-size treats tasted nutty, rich, decadent. With this gentle ritual, I could savor a moment alone, just for myself, relishing the hope and pleasure it provided.Whether it was the cookies, pumping, or time, during my baby’s first month home, my milk increased. My daughter’s latch improved. She became plump. I stopped feeling guilty about supplementing with formula. My strength returned. I started taking walks. Eventually, the pain in my body subsided and I held my daughter easily. Perhaps the solution had been there all along, in the maternity ward or at the top of the stairs in my narrow hallway. Instead of doubling down when I felt pressure, I could stop pushing and let go. Accept rest as the gift that it was. Be gentle, by doing something as simple as eating cookies.I nursed my daughter for the last time on the evening of her first birthday. I dimmed the lights in her room and cradled her, feeling triumphant but knowing I’d miss this singular closeness. How strange and difficult and wondrous it had been to feed her from my body, to have her need me, to provide. Her breathing slowed. Her hands relaxed. As her velvety cheek pressed against me, she closed her eyes and drank.Get the Recipe:Lactation CookiesThese nutty, chocolaty treats are perfect for anyone who’s lactating—and just as delicious for everyone else.View RecipeExplore Bon AppétitAll on the TableCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Jessamine Chan"]}