{"id": "ed4fe468075399e071dbe7c63edc893a", "url": "https://www.bonappetit.com/recipe/vegetarian-green-curry", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Coconut Green Curry With Mushrooms and Chickpeas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCoconut Green Curry With Mushrooms and ChickpeasBy Andy BaraghaniMay 4, 20203.9(47)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Andy Baraghani EmailPinterestPrintEmailPinterestPrintThis vegetarian Thai curry comes together in about 30 minutes—and you don't need store-bought curry paste to make it. Our streamlined version is fresh-tasting and easy to throw together—just blitz cilantro stems (the most flavorful part of the herb!), ginger, garlic, shallots, and green chiles in a food processor or blender. Sizzle the paste in oil along with mushrooms and its flavors will sharpen into a spicy counterpoint to the creamy coconut milk. The chickpeas, while not traditional to Thai curry, are a satisfying addition, but you could use cubed tofu in their place. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonMicroplane$16 At AmazonFood Processor$49 At AmazonMeasuring Spoons$10 At Bon Appétit MarketMedium Saucepan$39 At AmazonWooden Spoon$6 At AmazonColander$11 At AmazonIngredients4 servings1bunch cilantro13\" piece ginger6garlic cloves2medium shallots1–2green chiles (such as serrano or jalapeño)2limes, divided1Tbsp. light brown sugar1tsp. ground coriander1tsp. kosher salt, plus more4baby bok choy or ¼ medium head of Napa cabbage8oz. shiitake mushrooms2Tbsp. vegetable oil115.5-oz. can chickpeas, drained113.5-oz. can unsweetened coconut milk8oz. dried rice noodlesLarge handful of unsalted dry-roasted peanutsPreparationStep 1First thing is to bring a large pot of water to a boil for the noodles.Step 2Meanwhile, prep the curry ingredients. Using a chef’s knife, coarsely chop stems from 1 bunch cilantro, working from the root ends all the way to where the leaves begin. (You should have about ½ cup stems.) Set some leaves with tender stems aside for serving and save the remaining leaves for your next cooking project. Peel one 3\" piece ginger with a spoon and thinly slice. Using the side of your knife, crush 6 garlic cloves; discard papery skins. Coarsely chop 2 medium shallots, then 1–2 green chiles (such as serrano or jalapeño), depending on your heat preference. Using a Microplane, finely grate zest from 1 lime. Set lime aside for serving.Photo and Food Styling by Andy Baraghani Step 3Combine cilantro stems, ginger, garlic, shallots, chiles, and lime zest in a food processor or blender and add 1 Tbsp. light brown sugar, 1 tsp. ground coriander, and a big pinch of kosher salt. Purée, adding 1–2 Tbsp. water to loosen things up if needed, until a mostly smooth paste forms, about 1 minute. Set curry paste aside.Photo and Food Styling by Andy Baraghani Step 4Cut 4 baby bok choy lengthwise into quarters. Or, if you are using ¼ medium head of Napa cabbage instead, coarsely chop. Set aside. Remove stems from 8 oz. shiitake mushrooms; discard. Tear caps into bite-size pieces.Step 5Heat 2 Tbsp. vegetable oil in a medium saucepan over medium-high. Add mushrooms and cook, stirring occasionally with a wooden spoon, until golden brown and starting to shrivel, about 5 minutes. Season with kosher salt. Add reserved curry paste and cook, stirring constantly, until it begins to stick to the bottom of the pot, about 4 minutes.Step 6Rinse one 15.5-oz. can chickpeas in a colander and add to mushroom mixture, then add one 13.5-oz. can unsweetened coconut milk and 2 cups water, scraping up any browned bits stuck to the bottom of the pot. Season with 1 tsp. kosher salt and bring to a simmer over medium heat. Cook, stirring occasionally, until flavors come together and curry thickens slightly, 8–10 minutes.Step 7Add reserved bok choy to curry and cook, stirring occasionally, until tender, about 4 minutes. Taste curry and season with more salt if needed.Photo and Food Styling by Andy Baraghani Step 8While the curry is cooking away, cook 8 oz. dried rice noodles in pot of boiling water according to package directions. Drain noodles in a colander, then rinse thoroughly under cold water to stop them from cooking any longer. Shake off excess water and set aside until ready to serve.Step 9Divide reserved noodles among bowls and ladle curry over. Cut reserved lime and 1 more lime into wedges. Coarsely chop a large handful of unsalted dry-roasted peanuts. Top curry with peanuts and reserved cilantro. Serve with lime wedges for squeezing over.How would you rate Coconut Green Curry With Mushrooms and Chickpeas?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleMade this a couple of times now. Needs more chilies. A couple of jalapeño or serranos is fine, but also begs for 1-2 more Thai green chiliesA cook in BuffaloBuffalo, NY8/29/2021This was great! I followed recipe as is (it’s my first time after all!) but after my first bowl, i did squeeze in a little vegetable broth concentrate and some tamari. The second bowl was better, and I would definitely make again. Definitely packs some heat.AileenHalifax, NS4/28/2021Start by boiling water? \nbaffling but ok we all give bad advice\notherwise delicious and unique\nEric Land1/27/2021where is the recipeAnonymous10/14/2020This is a decent recipe that I would definitely make again! But I did have to make a few adjustments (like many others in the comment section) - you definitely need to use a little more coriander in the curry paste, the paste needs to cook in the pan for closer to 20 minutes (rather than 4 as suggested) before you add the chickpeas, and I don't think you need more than 1 cup of water. Also, using fish sauce at the end brings the curry to another level. I ended up with a not-so authentic but still delicious curry that was plenty to feed my family and I. vanillafrances7/19/2020Love this recipe, has become one of my family's favorites.  I do use two bunches of cilantro because I make a big pot.  Last night I added shrimp, it was a hit!!!  One of the things I like about this dish is that before I put any meat is complete vegetarian for my son.  I substitute the shallots for regular onions.  I have been cooking it every Tuesday!  SHazlehurstNew York6/17/2020I made this with a few modifications and it turned out delicious. For one thing, I followed the advice of other commenters and only used the coconut milk (no water). I also added some fish sauce because I couldn't believe there wasn't fish sauce in the original recipe...it is Thai curry. Also added about a teaspoon of jarred green curry to give it a little more of that curry flavor. It ended up tasting very fresh and light. Perfect summer recipe!AnonymousJersey City, NJ6/15/2020I loved this recipe! I normally don't like chickpeas or mushrooms but I wanted to be more adventurous and decided to give this a go. I'm glad I did because it was delicious and I would definitely make it again! Following the advice in the comments, I used about half the amount of water but you could use even less. It has a consistency much closer to soup, it seems like a lot of people expected an Indian curry-type thickness. Overall, I really enjoyed making this and it was actually quite easy!samirafaeEngland6/12/2020NEVER again. The color was way off. Probably should have used more leaves instead of a half of cup of stems. Bought all of the vegetables yesterday, washed and dried appropriately and... it’s gray. If you find that the color of the curry paste seems off, STOP THERE. Figure something out. The dish came out an unappetizing color of grey. Needs more testing in the BA kitchen and addressed in the recipe because apparently I’m not the only one this has happened to. Jamey LTexas6/9/2020My sauce was amazing, used a little olive oil in place of water. I also used shiitake and portobello mushrooms. I'll definitely make this again.Anonymous6/4/2020Mine was not even remotely the same color.  I had to add fish sauce, lime, and an entire bottle of store bought green curry paste to make it yummy.  It’s still very watery. If you make this I wouldn’t add ANY water until after you see how it simmers. AnonymousChicago, Il6/3/2020Had very high hopes for this, but the curry sauce in itself was dull and lifeless. The lack of flavor did not translate well with the heaping amount of cabbage used and the chickpeas were yummy, but seemed out of place. I think the sauce could be improved to be stronger; if I made this again I would use less fluids (too much water, sauce wasn't thick enough). AnonymousSouth Africa 5/31/2020Rare that I make a recipe from Bon Appetit that is actively bad if prepared as written. I subbed baby bella mushrooms because that's what I could find during quarantine but that was the only substitution. I added less water than called for as other commenters suggested. When I first tasted the sauce it was extremely bitter so I added lime juice, 2 tbsp of fish sauce and more brown sugar. This improved the flavor but it's still a lifeless curry. I don't make enough Thai food to know what it's missing, but the curries I've made with Maesri brand curry paste are much more flavorful and balanced. Somethings are great as a stripped down weeknight version but I will not be making this recipe again.AnonymousNew York, NY5/31/2020Delicious! but after adding the 2 cups of water and letting it simmer for 20 minutes, the flavours were much too subtle. I ended up making another batch of the paste, cooking it out in a frying pan and adding it bit by bit until the flavour was at a level I wanted. Next time I make it, i'll add 100ml or so of water. Oh I also had an old orange so I used the zest of that too, yum.adamorangeSydney5/28/2020This ended up soooo good, though with the caveat that (like others) I did a few modifications. Some had commented that there was \"something\" missing and I think I figured out what it needed -- coconut aminos! Also some extra lime juice cooked in which I feel like balanced out some of the bitterness/spiciness from the jalapeno and ginger. I did the can of chickpeas but also added some cubed tofu that I pre-baked then tossed in at the end. Overall it was delicious and I'd totally make it again!AnonymousDenver, CO5/25/2020Explore Bon AppétitCurrySoupSoups and StewsThaiSoutheast AsianAsianRice NoodleNoodlePasta & NoodlesMushroomVegetableChickpeaBeanCoconut MilkOther IngredientsCilantroHerbs & SpicesEasyWeeknight MealsMainVegetarianVeganGluten-FreeDairy-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-04", "author": ["Condé Nast", "Andy Baraghani"]}