{"id": "ed50735451493474bbb4d847612e8c69", "url": "https://www.bonappetit.com/recipe/shrimp-scampi-pasta", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Shrimp Scampi Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesShrimp Scampi PastaBy Molly BazMay 20, 20194.4(112)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintButtery, garlicky, irresistible shrimp scampi—but make it pasta. We like how the heat from the red pepper flakes cuts through all the richness in this dish, but if you’re spice-sensitive, hold back half of the chile (you can always serve more on the side). This recipe calls for frozen shrimp, which we're huge fans of. You never have to wonder how long they've been sitting on ice at the seafood counter, and they thaw in no time at all, making them a great weeknight protein option to have in your back pocket. (Err...freezer. Freezer is definitely a better place for shrimp than your back pocket.)All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketLarge Bowl$18 At AmazonPlate$55 At Bon Appétit MarketPaper Towels$13.45 At AmazonLarge Pot$55 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonMicroplane$16 At AmazonSmall Bowl$13 At AmazonDutch Oven$80 At AmazonWooden Spoon$6 At AmazonTongs$13 At AmazonGlass Measuring Cup$19.99 At AmazonIngredients4 servings1lb. frozen large peeled, deveined shrimpKosher salt1medium onion7garlic cloves, divided2lemons1cup parsley leaves with tender stems¾cup panko (Japanese breadcrumbs)6Tbsp. extra-virgin olive oil, divided, plus more for drizzling8Tbsp. (1 stick) unsalted butter, divided½tsp. red pepper flakes¾cup dry white wine1lb. fettuccinePreparationStep 1Thaw that shrimp! Place unopened 1-lb. bag of shrimp in a large bowl and fill with cool water. Place a heavy plate on top to submerge until thawed, about 45 minutes. If you're the kind of person who actually thinks about dinner more than a few hours before you're going to make it, you can also let the shrimp thaw overnight in the fridge. Alternatively, if you're in a hurry, take the shrimp out of the bag and let them soak in a big bowl of cold water—they'll be ready in about 15 minutes. However you thaw them, make sure to pat them dry before proceeding. Season shrimp with 1 tsp. salt. Let sit until ready to use. While all that's happening, bring a large pot of salted water to a boil.Step 2This dish comes together quite quickly, so you're going to want to have all of your prep done before you start cooking. Peel 1 medium onion, then finely chop so that all pieces are about the size of lentils. Transfer to a medium bowl. Using a Microplane, grate 5 garlic cloves right into bowl. Finely grate zest of ½ lemon right into bowl. Coarsely chop 1 cup parsley leaves with tender stems; transfer to a separate small bowl and set aside.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Heat ¾ cup panko, 2 Tbsp. olive oil, and ¼ tsp. salt in a large Dutch oven over medium, stirring to coat panko.Step 4Grate remaining 2 garlic cloves into pot and stir to combine. Cook, stirring often, until panko is golden brown, 3–4 minutes. Transfer panko mixture to a small bowl. Let cool. Wipe out any panko stuck to bottom of pot.Step 5Heat 2 Tbsp. olive oil in pot over medium-high until just beginning to shimmer and you can see wisps of smoke. Cook shrimp, undisturbed, until golden brown on the underside, 2–3 minutes. Turn with tongs and continue to cook until shrimp is barely cooked through, about 15 seconds longer (the shrimp will keep cooking as it sits, and we’re going to add them back into the pot later so they’ll get a chance to finish cooking there—err on the side of undercooked). Transfer shrimp to a plate.Step 6Add onion mixture, 4 Tbsp. butter, 1 tsp. salt, and ½ tsp. red pepper flakes to pot and cook over medium-low heat, stirring frequently, until very fragrant and softened but not browned, about 2 minutes.Step 7Add ¾ cup dry white wine and bring to a simmer. Cook, stirring occasionally, until most of the liquid evaporates, some of the harsh alcohol scent cooks off, and sauce is thick and glossy, 2–3 minutes. Remove from heat while you cook the pasta.Step 8Drop 1 lb. fettuccine in boiling water and set a timer according to package directions for al dente. Scoop out 1½ cups pasta cooking liquid.Step 9Pull off and discard tails of shrimp while pasta cooks, then cut each shrimp into 3 pieces.Step 10Drain pasta and add to Dutch oven along with reserved pasta cooking liquid and remaining 4 Tbsp. butter and 2 Tbsp. olive oil. Cook over medium heat, stirring often, until well coated and glossy, about 3 minutes.Step 11Remove pot from heat and stir in shrimp and reserved parsley.Step 12Cut 1 lemon in half and squeeze juice into pot (it should be about 2 Tbsp.), stirring to combine. Taste and adjust seasoning for salt. Cut remaining lemon into wedges for serving.Step 13Divide pasta among bowls. Drizzle with more olive oil. Top with reserved panko mixture. Serve with lemon wedges alongside.How would you rate Shrimp Scampi Pasta?Leave a ReviewTell us what you thinkReviews (50)Back to TopTriangleThis is an excellent recipe. I have made it several times and it is always a palate pleaser!MarianSarasota, FL3/14/2022This was really good.  In tasting halfway through the process, I was worried it had too much lemon zest but it completely mellowed out in the finished dish.  I did only add half the lemon juice it called for at the end because I did not want the lemon to be overpowering.  There seemed to be too much butter with the onions - looked like soup.  So I only did half the butter in later instructions.\n\nThis recipe is definitely a keeper!AnonymousAustin, TX3/8/2022Great recipe, and yes it does help to have all ingredients ready before starting to cook!ElenNew Hope,PA10/17/2021Very good! Even though I hate recipes that call for 12oz of pasta instead of the full pound (what the hell do I do with the remaining 4 oz?!), if I made this again, I'd probably only use 12 oz and keep everything else the same (well, maybe a lil less butter/oil to compensate). \n\nAs is, this made six (very good, very large) servings but I'd rather a saucier, shrimp-ier 4-serving dish next time.HeatherCanada8/19/2021This was to die for delicious! I doubled the red pepper flakes and used about 10 cloves of garlic. Other than that I followed the recipe precisely. My husband said it was one of the best shrimp meals he has ever had. Thank you!JackieLexington, KY6/7/2021I don’t have any of these ingredients at home. Could you rewrite this based on the food I do have in my house? I’m not going to tell you what food I have. You have to guess.Coleman4/11/2021Wow, really good. Reasonably easy and so flavorful. It does move quite quickly. I made this for 3 other people and they all loved it! The crunchy panko takes it over the top! We did use less oil/butter than called for and thought it came together just fine. AnonymousSeattle, WA2/26/2021Outstanding. Very easyAnonymousFL2/18/2021Delicious!\nThe only thing I didn’t do was chop up the shrimp. I just prefer them whole in the pastaChicagoChicago IL1/13/2021Made a smaller batch of this for my New Years meal, and I loved it! Super balanced, rich but not heavy!AnonymousBuffalo1/1/2021I made this last night and it was absolutely delicious. The panko  bread crumbs gave this dish a  wonderful texture. I will definitely make again!!AnonymousDallas12/22/2020I followed the recipe exactly as is and it turned out perfectly. Those Panko garlic crumbs for the top are amazing too! This recipe was soooo good and so easy. Its just important to have everything ready before you begin to cook as it comes together so quickly.  Very delicious! Served it with garlic bread. Oh, and it made a lot and the leftovers were fabulous the next day!! British Columbia10/25/2020Excellent recipe! I added some cherry tomatoes when I added the shrimp. Also I would say this easily serves 6 not 4. AnonymousFlorida8/27/2020LOVED it. I poured the pasta water in quite slowly and didn't end up needing all of it. I also skipped the additional olive oil on the plated pasta. The dish is well-balanced, quick to throw together, but has a lot depth in flavor. Will be making again!AnonymousChicago8/19/2020This turned out amazing. I had friends over for dinner and it has been one of the best dinners ive made. I used less butter , since we are trying to eat healthy and amazing AnonymousNYC7/11/2020Explore Bon AppétitPastaItalian AmericanAmericanShrimpShellfishSeafoodGarlicVegetableFettuccinePasta & NoodlesWeeknight MealsMainNut-FreeSautéDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-19", "author": ["Condé Nast", "Molly Baz"]}