{"id": "ed5296302c3cfe81d495d525c1a81d19", "url": "https://www.bonappetit.com/story/go-un-nude-with-attitude", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Go Un-nude with attitude. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredGo Un-nude with attitude.By Maybelline® April 23, 2018FacebookTwitterEmailFacebookTwitterEmailDiscover a new take on nude with Maybelline® SuperStay Matte Ink™Un-Nude Liquid Lipstick. Up to 16 hours of liquid matte! This Liquid Lipstick features a precise application for a flawless matte finish. Find it today at Ulta Beauty!Buy 1, Get 1 50% off at Ulta Beauty from 4/22-5/13.One per customer. While quantities last. 50% off item must be of equal or lesser value to the lowest-priced item purchased. Excludes promotional packs, value packs and clearance.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-23", "author": ["Condé Nast", "Maybelline"]}