{"id": "ed56406177845a9cc4778e8d730cba9a", "url": "https://www.bonappetit.com/recipe/sweet-potato-pone", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Sweet Potato Pone Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSweet Potato PoneBy Brigid WashingtonNovember 23, 20214.8(8)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Food Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintImagine if sweet potato pie shed its crust and took a trip to the tropics and you might end up with something like this sweet potato pone. Prized for its versatility, pone is a Caribbean staple typically made with grated yuca (cassava) and can be either sweet or savory. In this version grated sweet potatoes replace the yuca and mingle with a triple coconut threat (oil, flakes, and milk), plus a dynamic mix of aromatics from rum to citrus and warm spices. The result is a dessert capable of dethroning even the most beloved of holiday desserts, especially when served with a scoop of good vanilla ice cream. While a traditional yuca pone is denser and often served in cake-like slices, this one is more scoopable, almost like a pudding. Finely grating the sweet potatoes by hand does require some elbow grease, but the results make it well worth it. —Brigid WashingtonAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonMicroplane Grater$16 At AmazonOXO Good Grips Small Citrus Juicer$11 At AmazonCast Iron Skillet$30 At AmazonIngredients6Tbsp. unsalted butter, room temperature, divided1cup (packed; 200 g) dark brown sugar2Tbsp. solid virgin coconut oil1large egg, room temperatureZest and juice of 1 large limeZest of 1 orange11\" piece ginger, peeled, finely grated½tsp. ground cinnamon½tsp. freshly grated nutmeg½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt2large or 3 medium sweet potatoes (about 1½ lb.) peeled, finely grated on a box grater (6–7 cups)½cup unsweetened coconut milk1Tbsp. dark rum½tsp. Angostura bitters½tsp. vanilla extract1cup (60 g) unsweetened coconut flakes, divided2pints vanilla ice cream (optional)PreparationStep 1Place a rack in middle of oven; preheat to 350°. Melt 2 Tbsp. butter in a medium cast-iron skillet over medium heat, swirling butter to coat skillet; set aside.Step 2Beat brown sugar, oil, and remaining 4 Tbsp. butter in the bowl of a stand mixer fitted with the paddle attachment on medium-low speed until combined, about 2 minutes. Add egg and beat until mixture is pale brown and fluffy, about 1 minute. Add lime zest, lime juice, orange zest, ginger, cinnamon, nutmeg, and salt and beat to combine, about 1 minute (mixture may look curdled, which is fine). Reduce speed to low and add sweet potatoes, coconut milk, rum, bitters, vanilla, and ½ cup coconut flakes. Mix until well combined, about 2 minutes. Scrape batter into reserved skillet and top with remaining ½ cup coconut flakes.Step 3Bake pone until golden brown, bubbling around the edges, and the center doesn’t jiggle when you gently shake the pan, 50–60 minutes. Let pone cool in skillet 10 minutes.Step 4Using a large spoon, scoop pone onto small plates and serve with vanilla ice cream if desired.How would you rate Sweet Potato Pone?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI had never heard of pone before, so I was excited to try this (also never used the “fine” side of my box grater, either haha). I was mostly excited for the rum and bitters flavors, but all I ended up tasting was orange from all the zest. Maybe this is how it’s supposed to be, but the texture just wasn’t my jam either - slightly crunchy sweet potatoes. Maybe if the batter had been more wet, the sweet potatoes would have steamed/cooked more. It wasn’t overly sweet, which was nice, just too much orange for me. JoshMilwaukee1/29/2022Haven't made this yet, but it sound like it might be similar to Bibinka, which I love.  Thanks, I'm shopping for the coconut!beejayCalifornia1/22/2022Explore Bon AppétitDessertBakeSweet PotatoCast ironRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Brigid Washington"]}