{"id": "ed5a6b2bfafd862f989b996573d991c6", "url": "https://www.bonappetit.com/recipe/herby-dutch-baby-with-smoked-salmon", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Herby Dutch Baby With Smoked Salmon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueHerby Dutch Baby With Smoked SalmonBy Sarah JampelMarch 15, 20224.1(11)Read ReviewsTriangleEmailPinterestPrintPhotograph by Allie Holloway, food styling by Taneka Mooris.EmailPinterestPrintEmailPinterestPrintThis verdant Dutch baby hits that elusive middle ground of festive and fast. It gets its striking color, freshness, and flavor from the addition of baby spinach and tender herbs (you can use the ones you have on hand—a mix of dill and cilantro is especially nice) and turns into a complete meal with the addition of fatty smoked salmon. To achieve the fluffiest, puffiest pancake possible, make sure your eggs and milk are both at room temperature (pro tip: Bring your eggs up to temp fast by letting them sit in warm water for 5–10 minutes).All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonCast Iron Skillet$30 At AmazonCitrus Juicer$7 At AmazonMicroplane Grater$16 At AmazonIngredients4 servings½small red onion, thinly sliced1lemon, halved¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more4large eggs, room temperature1large egg white, room temperature2garlic cloves, finely grated1(packed) cup baby spinach⅔cup whole milk, room temperature1cup tender herb leaves (such as dill, cilantro, basil, and/or parsley), plus more for serving⅔cup (83 g) all-purpose flour2Tbsp. cornstarchFreshly ground black pepper2Tbsp. unsalted butter, cut into pieces4oz. smoked salmonPreparationStep 1Place a rack in middle of oven and place a medium ovenproof skillet, preferably cast iron, on rack. Preheat oven to 425°. Place onion in a small bowl; squeeze in juice of ½ lemon and add a big pinch of salt; set aside. Slice remaining ½ lemon into wedges and set aside for serving.Step 2Blend eggs and egg white in a blender on high speed until very frothy, about 1 minute. Add garlic, spinach, milk, and 1 cup herbs and blend on high speed until well combined and very green. Add flour, cornstarch, and ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt and season with lots of pepper; blend to combine.Step 3Carefully remove skillet from oven. Add butter to pan and swirl to coat bottom. Immediately pour batter into pan and bake pancake until puffed and brown around the edges, 20–25 minutes. (It will start to deflate as soon as it comes out of the oven, but don’t worry, that’s normal.)Step 4Top Dutch baby with smoked salmon, onion, and more herbs; season with pepper. Serve with reserved lemon wedges for squeezing over.How would you rate Herby Dutch Baby With Smoked Salmon?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI thought this was very good! I did use a lot of herbs, a mix of basil, dill and parsley. Added some onion powder and a little extra salt  to the pancake batter. Surprisingly impressed!Aileen Halifax, NS3/23/2022Half the spinach and add an addition half cup of herbs to get more of an herby flavor, I added chives into the mix in the original recipe and still didn't get any herbaceous flavors. A dollop of  creme fraiche was also defiantly needed. Audrey S3/21/2022I have a friend in Amsterdam who has a more exotic, albeit more simple, suggestion for making Dutch babies - -  if that's what you really want to do.snerdly fackleIsle of Skye3/20/2022Explore Bon AppétitBreakfastLunchDinnerMainWeeknight MealsEasyQuickHealthyishNut-FreeBakingSmoked SalmonSalmonFishSeafoodSpinachLeafy GreensVegetableDillHerbs & SpicesCilantroBasilParsleyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Sarah Jampel"]}