{"id": "ed63c081a945abd3bb97b28c1d1db863", "url": "https://www.bonappetit.com/recipe/smashed-cucumber-salad-with-lemon-and-celery-salt", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Smashed Cucumber Salad with Lemon and Celery Salt Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueSmashed Cucumber Salad with Lemon and Celery SaltMarch 20, 20185.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintIf you have ever peeled, seeded, and sliced cucumbers for salads, this recipe will hopefully change your mind. Smashing the cucumbers augments the vegetable’s ability to absorb seasonings.Ingredients4 servings5mini seedless or Persian cucumbers or 1 small English hothouse cucumber (about 12 oz.)13x1\" strip lemon zest, very thinly sliced2Tbsp. fresh lemon juice2Tbsp. extra-virgin olive oil¼tsp. celery salt, plus more for servingPreparationStep 1Gently smash cucumbers with a rolling pin or the back of a heavy knife just to break open. Tear into irregular 2\" pieces and place in a medium bowl; season lightly with salt. Let sit at least 5 minutes and up to 1 hour.Step 2Meanwhile, whisk lemon zest, lemon juice, oil, and ¼ tsp. celery salt in a medium bowl to combine; season dressing with salt.Step 3Drain cucumbers, discarding any liquid they have released. Add to bowl with dressing and toss several times to coat. Sprinkle with more celery salt.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Smashed Cucumber Salad with Lemon and Celery Salt?Leave a ReviewTell us what you thinkReviews (1)Back to TopTrianglejust as in the other Smashed Cucumber salad recipes (the one with za'atar + this written one with the lemon), the video is for the Asian version of Smashed Cucumber Salad (the one with the chili oil).  they're all wonderful variations.  keep 'em coming!hollis5Vero Beach, FL3/27/2019Explore Bon AppétitSaladCucumberVegetableQuickEasySideDairy-FreeGluten-FreeNut-FreeRawVeganVegetarianKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast"]}