{"id": "ed69b75478a6f317538204f46fe1197f", "url": "https://www.bonappetit.com/story/la-copine", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "La Copine Is a Queer Oasis in the California Desert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Diner Is a Queer Oasis in the California DesertLa Copine is a gussied-up roadside diner in the heart of Joshua Tree. Here's how the close-knit staff built their desert home.By MacKenzie Chung FeganFebruary 13, 2019FacebookTwitterEmailPhoto by Katie ThompsonFacebookTwitterEmailAccording to Instagram, the high desert that surrounds Joshua Tree National Park is a progressive Millennial dream. There’s the Integratron, a dome built by an alien abductee where visitors can bathe in the vibrations of crystal bowls. Desert chic Airbnbs abound, most of them featuring some combination of Acapulco chairs, macramé wall hangings, and galvanized steel hot tubs. And the park itself is a favorite among weekending Echo Parkers and Silverlakians, skin impossibly dewy despite the arid climate.La Copine's citrus and beets salad, topped with sunflower seeds and poblano-lime vinaigrette.\nPhoto by Katie ThompsonBut Joshua Tree and the surrounding towns of the Morongo Basin are also part of California’s 8th Congressional District, one of the most conservative in the state. Just down the street from the Integratron is a low-slung church surrounded by chain link fence, the word “JESUS” perched on the roof in white letters. On the road to a popular outsider art museum, there’s a sign for a gun range written in what looks to be the spidery hand of a serial killer.It’s in this land of contrasts that Claire Wadsworth and Nikki Hill—partners in life and business—decided to open their restaurant, La Copine. Located on the vividly named Old Woman Springs Road, La Copine seats just 42 and feels like a gussied-up roadside diner. For a queer visitor to the desert, walking through the door feels like stumbling upon a gay, matriarchal oasis. The staff is largely female or gender nonconforming, and everyone seems delighted that you’ve decided to stop by, even when the wait list is twelve deep. The positive vibes, as they say in Joshua Tree, are strong. Add to that Hill’s food—architecturally craggy fried chicken, flattop-blistered green beans showered with mint and dill, a brownie masquerading as chocolate almond cake—and it’s no surprise that customers can expect to wait two hours on the weekends.We spoke with Wadsworth, Hill, and other members of the La Copine community about the pull of the desert, the importance of inclusive spaces in the food industry, and what makes La Copine such a special place.Photo by Katie ThompsonClaire Wadsworth, co-owner and front of house\"Nikki and I met at a dinner party. My sister Ali and I were in a band, and we lived in this all-girl band house in Philly. I will never forget the first time I saw Nikki. I walked in the front door, and Nikki was rolling out gnocchi dough on our kitchen table. My heart dropped, and I froze. We just immediately fell in love, and two months later she moved in.We had been living in LA for a few years, and we had just gotten married. It was Earth Day, and it’s free to get into the national parks on Earth Day, so we decided to go to Joshua Tree. We’d never been. So we went to the park, walked around Pioneertown, saw a double rainbow and a lightning storm, found the Integratron, and that was it. We knew we were moving to the desert. Joanne [the owner of] the Integratron told us about the restaurant. Two weeks later we were buying it. The previous tenant literally handed us the keys and the lease, said, “Well ladies, it was really nice doing business with you. Call me if you need anything. If I were you, I’d get myself a shotgun,” and walked out the door.You look at a place that votes as a conservative county, and you think, “These people aren’t going to like me because I’m different than them.” And then they’re the ones who are calling you saying, “Hey, I saw someone in your parking lot at two in the morning, and I chased them out.”  It’s such a wonderful community.Still, to this day we get letters in the mail with religious, anti-gay material. We get one every other month, and it looks really cute on the outside, like someone let their kid decorate it with stickers and glitter. And inside it’s packets saying, “The gay man is the devil.”All the people who protested and fought for civil rights, they did it so that we could just exist. And that’s what we’re doing. We’re just existing and doing what we’re good at. We’re so lucky. Every night, we put our hands on the building, and we tell La Copine that we love her. Every night. We just want to fill the building with our love so that it keeps it going. Love makes things grow.\"Photo by Katie ThompsonNikki Hill, co-owner and chefMy friend told me about these girls who were in a band together and hosted these pop-up dinner parties where they would play music and wine would be flowing. Did I want to spend my one day off cooking for a dinner party and washing all the dishes for a bunch of girls in a band?  I said yes.The idea of La Copine came about because we always wanted to recreate the night we met, so we started doing personal dinner parties for friends. We knew we wanted a name that was a little feminine and French, and “la copine” came up. It means girlfriend, but it’s also a casual meaning for girlfriend. So it’s not like, “We’re lovers!” but it also could imply that.Photo by Katie ThompsonSandy Guevara, line cookI identify as pretty thoroughly genderqueer. Generally I prefer non-gender pronouns like “they,” but mostly I feel like gender is for other people’s comfort. I’ve been trying to get people to go with “it,” but nobody’s picked up on that.I was living in LA and coming out to the desert quite a bit. There feels like so much possibility here in the desert. When I was younger, all the queers would move to the city for possibilities because you got to be yourself. Now it feels like reverse migration. Cities have become so expensive and so restrictive that now the country feels like where possibilities exist. But my fear in moving up here was isolation. The first time I walked into La Copine, I went, “Wow! Look at all these beautiful freaks!” It felt like a pocket of home.I’ve been a baker for the last ten years. I’ve seen and experienced some horrific harassment in kitchens, and it’s nice to be in a place where that doesn’t even seem like a possibility. It’s nice to be able to come to work and not wear armor. And the food is delicious and the atmosphere is beautiful and everybody is happy here. Nikki and Claire took a pretty big risk opening a business in a place that isn’t always welcoming. It’s a lot of people busting their ass to do a good thing. You can feel the difference when you work in a place like that, and hopefully you can feel the difference when you eat in a place like that.Photo by Katie ThompsonAli Wadsworth, Claire’s sister, front of houseI’m very close to Claire—Nikki too. It’s like having two sisters, which is the best. When they were living in LA, I would go out to visit them, but as soon as they moved to the desert, my trips got longer and longer.Living in the middle of nowhere is not for everybody. Claire and Nikki say, “The desert spits out what it doesn’t like.” It makes you face shit that maybe you would just avoid back home. It pulls things out of you.We’re open Wednesday through Sunday, two to seven. Most nights, the waiting list is so long that we have to shut it down at five. When celebrities come in, we make them wait. But even the people who are pissed that they have to wait, as soon as they sit down and eat, they’re the happiest people in the whole world. Everything Nikki makes is going to be the best, and everything is going to be sent out with love.We have family meal together at the end of every night, which is a magical thing. A really nice meal helps you be in the moment and look at the beautiful place that you’re in right now, enjoy the people you’re with. It does feel like family. I mean, it is my family.Photo by Katie ThompsonHannia Sobrevilla, owner of Teocali, the shop in an Airstream in La Copine’s parking lotI was born and raised in Mexico, and I have a background in fashion. When my brother got married in Oaxaca, I got the idea to collaborate with artisans there. So my business is textiles and accessories that are handmade, fair trade, ethical, and sustainable.I met Ali when I was in college, and Claire and I became friends through her. A little over a year ago, I was living in Portland, and Claire invited me to come visit. That was when she said, “I don’t know how your business is doing, but our parking lot is yours if you want to set up in a trailer.” And now Claire and Nikki and Ali and I all live within a three-block radius of each other. It’s like Sesame Street. When I first moved out here, I had zero cell service so Claire got me walkie talkies for my birthday. We would come home from work and just radio over invitations to hang out.My mom is into astrology, so a few years ago she bought me a reading. I asked about the business, and the lady said, “I don’t see it in the Pacific Northwest. I see it taking off in three years, but I see you in the desert.” The desert is a crazy place but it provides, and Claire and Nikki have given me a world of opportunities.Explore Bon AppétitHealthyishCaliforniaRead MoreWhere to eatI Took a Sound Bath in the Desert and It Was Only Sort of AbsurdBy Marian BullRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-13", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}