{"id": "ed87a53b93ebad44a976911acbab67c7", "url": "https://www.bonappetit.com/story/tuesday-before-thanksgiving-is-most-important-day", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "The Most Important Day of Thanksgiving Prep is the Tuesday Before | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy the Tuesday Before Thanksgiving is the Most Crucial Cooking DayThe key to Thanksgiving success, without the stress, is the day before the day before.By Sarah JampelNovember 15, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailI was watching the Season 1 Thanksgiving episode of This is Us recently (yes, I know I’m behind) and I was struck not by the giant skeleton in the closet (I’ll say nothing more!) but by the fact that Randall woke up on Thanksgiving morning and started to prep. To cook from scratch. On Thanksgiving morning. The day of Thanksgiving. On that very morning.Now call me a stick in the mud (go ahead—do it!), but unless you’re having a very small Thanksgiving, how is it possible—what, with the constraints of oven space and counter space and the movement of planet earth in space (a.k.a. the passing of time)—to make the whole meal the day-of? Just like you wouldn’t cram for a final astrophysics exam or train for a marathon by running 10 miles once and hoping for the best (...or would you?), it’s not so advisable to tackle your whole Thanksgiving checklist on the same day you plan to eat, especially if you take the cooking and eating seriously. You need to prepare. You need to plan. You need to set yourself up to succeed.And, I’ll argue, it’s even better if you can make headway on your list on Tuesday—the day before the day before. You might not have the day off from work, but even a bit of legwork that evening will help you stay on track as the clock ticks closer to turkey time. You don’t need to make charts and spreadsheets; you don’t have to email your staffers (sorry, sorry, I mean family members) with a list of their duties. All you have to do is think about A) what dishes won’t suffer with time (and which might even get better?!) and B) what components—dressings, grains, doughs, the like—can stand to be made in advance even if the whole recipe can’t be completed.If that all seems like it’s too much to wrap your head around, never fear. This rough list will get you started:Tuesday is turkey prep day. You want to give your bird 48 hours to sit in the fridge with its dry rub (sounds complicated, but our dry rub is only salt plus brown sugar) for meat that’s flavorful all the way through and skin that’s crispy and shiny. The moment is now.And since you’ve prepped the turkey, you can use its neck to make gravy. This Umami Gravy requires neither homemade stock nor pan drippings, which means you can cook it start to finish on Tuesday. When you’re ready to eat, reheat it over low, stirring occasionally.Make the cran sauce(s), which’ll only get better with time. (Or, even better, ask a guest to do it. It’s so easy!)Set yourself up to finish the dessert as soon as you wake up on Thursday morning (or, in some cases, on Wednesday night). That means you’ll make pie or tart dough or shortcut puff pastry, and cook or roast any fillings (like the apples for the Glazed and Flaky Apple Tart, the squash for the Tarte Tatin, or the cranberries for the Cranberry Linzer Tart) on Tuesday. When the big day comes, all you’ll have to do is assemble and bake.Whisk together your salad dressings, then store them in jars in the fridge.Mashed potatoes! No, we’re not crazy—our make-ahead mash can be done two days in advance. To serve, loosen them up with a bit of cream and milk and reheat over low.Get a start on stuffing. If you’re making classic stuffing, the kind with airy, country-style bread, tear that loaf into chunks and dry them out in the oven. If you’re making cornbread stuffing, bake, cube, and toast the cornbread. And if you’re making a wild rice dressing, cook the rice, then toss it with a tiny bit of olive oil so that it won’t stick together when you chill it.Can I say with certainty that the This is Us Thanksgiving would’ve been less disastrous had they started prepping on Tuesday? Well, it seems like it was doomed for other reasons. But would there have been more time and energy to emotionally unload and start family-wide fights (what Thanksgiving is really about) had the cranberry sauce been out of the way? I, for one, think so.Read MorecookingThe Glazed Brussels Sprouts You’ll Be Making All FallBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-14", "author": ["Condé Nast", "Sarah Jampel"]}