{"id": "edac7046476b9e3080383716dcff8487", "url": "https://www.bonappetit.com/recipe/fudgy-flourless-chocolate-cake", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Fudgy Flourless Chocolate Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFudgy Flourless Chocolate CakeBy Kat BoytsovaFebruary 10, 20193.6(92)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Rhoda BooneEmailPinterestPrintEmailPinterestPrintThis (gluten-free!) flourless chocolate cake is decadent, rich, and easy to make as long as you pay attention to some key steps. First, you must have an oven thermometer to gauge the exact temperature in your oven. You also need to have patience when you're beating the sugar and eggs together—in the end, they should be light, airy, and have tripled in volume. If you follow these tips, the result is a delicate cake that wants nothing more than a dollop of unsweetened whipped cream and a sprinkling of crunchy toasted hazelnuts for contrast.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketGlass Measuring Cup$19.99 At AmazonRound Cake Pan$12.99 At AmazonParchment Paper$3 At AmazonScissors$17.95 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Saucepan$39 At AmazonSpatula$12.99 At AmazonElectric Mixer$40 At AmazonLarge Bowl$18 At AmazonWire Rack$23 At BA MarketSmall Rimmed Baking Sheet$28 At AmazonPlatter$29 At AmazonWhisk$10 At AmazonMedium Bowl$17 At AmazonSieve$18 At AmazonIngredients8–10 servings¾cup (1½ sticks) unsalted butter, plus more for pan12oz. good-quality bittersweet chocolate6large eggs1¼cups granulated sugar1tsp. kosher salt1tsp. vanilla extract½cup raw hazelnuts1cup cold heavy creamPowdered sugar (for serving)PreparationStep 1Place a rack in middle of oven; preheat to 325°. Using your fingertips, generously butter bottom and sides of a 9\" round cake pan (make sure pan is at least 2\" deep). Line bottom of pan with parchment paper, smoothing to eliminate air bubbles. (It may sound fancy, but making a parchment circle is easy! Place pan on a piece of parchment, trace circumference with a pencil, then cut it out.)Step 2Coarsely chop 12 oz. good-quality bittersweet chocolate into ½\" pieces. Transfer to a medium saucepan.Step 3Add ¾ cup (1½ sticks) unsalted butter to saucepan and cook over low heat, stirring occasionally with a heatproof spatula, until butter and chocolate are melted, about 8 minutes. (Alternatively, microwave chocolate and butter in a heatproof bowl in short bursts, stirring in between, until melted and homogenous.)Step 4Remove pan from heat and let cool to room temperature, about 15 minutes. (You can encourage chocolate mixture to cool faster by occasionally stirring it.)Step 5Meanwhile, using an electric mixer on high speed, beat 6 large eggs, 1¼ cups granulated sugar, 1 tsp. kosher salt, and 1 tsp. vanilla in a large bowl until pale yellow and fluffy, 8–11 minutes. You’ll know it’s ready when the egg mixture has almost tripled in volume, the beaters start to create a ribboning effect, and when you lift the beaters, the mixture should leave a trail as it falls back on itself.Step 6Pour in chocolate mixture. Gently fold two mixtures together with a rubber spatula by scooping underneath, then cutting through the middle with the side of the spatula. Continue to work in this motion juuuuust until batter is well combined and homogenous—take care not to overmix!Step 7Pour batter into prepared pan. Bake cake until a thin, dry crust has formed on the surface, and cake has risen and is firmed up but still wobbles ever-so-slightly in the center underneath the crust, 30–40 minutes. Transfer pan to a wire rack and let cake cool in pan about 10 minutes.Step 8While cake cools, roast ½ cup raw hazelnuts on a small rimmed baking sheet until lightly browned, 10–12 minutes. Transfer to a cutting board. Let cool, then coarsely chop.Step 9Place a flat cutting board or large plate over pan. Using a towel to protect your hands, swiftly invert plate and pan; cake should release on its own. Lift pan off, then peel off parchment.Step 10Gently place a flat platter or cake stand onto cake and invert again. Be careful because this cake is very delicate! It’s okay if there are some cracks along the top; the beauty is in the imperfection. Let cake cool to room temperature.Step 11Vigorously whisk 1 cup cold heavy cream in a medium bowl until medium peaks form.Step 12Sift powdered sugar over cooled cake.Step 13Serve cake with whipped cream and hazelnuts alongside.Step 14Do Ahead: Cake (without powdered sugar) can be made 1 day ahead. Cover with plastic and store at room temperature.How would you rate Fudgy Flourless Chocolate Cake?Leave a ReviewTell us what you thinkReviews (61)Back to TopTriangleI would like to make this in a 6 inch pan.  How would I convert the ingredients?  Thank you.ShariNew Jersey1/29/2022I made this last night on a whim because I had everything needed minus hazelnuts. This turned out great!  I used other reviewers suggestions and baked it 45 minutes.  I was terrified when it came out thinking that I had overbaked it. But it still came out great. Adrienne MHouston, Texas12/30/2021I liked your old flourless chocolate cake better. It called for eggs to be separated. Recipe at this point is the same BUT don’t put egg whites in yet. You whipped eggs whites separately until fluffy and peaks. Folded that in after your chocolate mix. Cake comes out less wobbly and doesn’t sink. And it was one flip out of springform pan. Not 2. So bottom became top. Please bring back your old recipe out of the magazine. Jan GCalifornia12/22/2021This cake is a great recipe for impressing a crowd (it's a very rich cake and will last quite a few days after making since it's all moisture - i would store this in a dry space - not a fridge, otherwise it's impossible to cut cleanly). \n\nWhen you're tipping in the melted butter/choc mixture, stir a little bit of the Sabayon (the whipped egg) to the chocolate - this helps the hot mix emulsify better with the egg without knocking the air out. You also need to whip the sabayon for about 20 mins, as a rough guide, to get really a great airy mix. \n\nWe make this with a melted white chocolate drizzle, lime zest and a little sprinkling of chilli powder for a zesty serving - with chocolate soil (a mix of sugar or glucose, water and chocolate) if you want to be extra fancy!HarrietBristol, UK9/13/2021Do yourself a favor and make this cake tonight! I splurged and bought Valrhona 71% chocolate and used European butter. Followed the recipe exactly. No hazelnuts and added a little confectioners sugar to the whip and dusted the cake. I used a 10 inch springform and baked it for 35ish minutes. It came out perfectly, almost everyone at my dinner party had seconds. Chloe FettuccineSan Diego CA6/25/2021This cake is delicious, but you definitely need a cake pan that is at least 2 inches deep. This cake was easy to make, I love the video clips, results in a tender and delicious cake. Dessert QueenBandon, Oregon3/1/2021Agree that the batter is overflow the 9” pan.\nBaked for 45” jut to be sureArik Jakarta2/19/2021This cake was a HIT!!!  Made it for my daughter's boyfriend's birthday tonight and everyone gave it a 10!  The trick is you need to follow the recipe carefully.  I used a springform pan because I eyeballed it and knew there would be too much batter for one round cake pan.  I used the convection bake and baked it for exactly 40 minutes ( I have a Miele oven).  I left it to cool, like the recipe stated and then took the springform pan off.  I left it overnight covered with plastic wrap on the counter.  Tonight I sprinkled the confection sugar on top and served it with whipped cream and ice cream.  Everyone thought it was so delicious and they all loved the consistency.  I used three Ghirardelli 60% cacao bars which I highly recommend.\nThis recipe is fabulous and I will be making this again.  Thank you for posting.Longport FoxPhiladelphia, PA2/18/2021The consensus seems to be that either the oven temperature or the bake time is incorrect. Too bad nobody from BA ever reads the comments. This recipe needs to go back to the test kitchen for revision.\n\nI didn't have an eggy layer like some described. I think that has to do with the temperature of the chocolate mixture being too warm. Also, it does take a fair amount of folding to get the batter well combined. Don't be too afraid of overmixing if all you're doing is folding.\n\nI made some good decisions and some bad ones. GOOD: I used a 9\" springform pan. The batter rose all the way to the top during baking. I believe it would have come out of the pan nicely if not for the bad decisions. BAD: Because of the nonstick springform pan, I shouldn't have used the parchment circle in the bottom. That bad choice meant I had to flip the cake twice and the second flip was disastrous. The cake was too soft and moist. It fell all apart. The other bad decision can either be blamed on an inaccurate recipe or my impatience. I had baked the cake for 45 minutes and it was still wobbly; it was just too wobbly. Expect this cake to bake for an hour or more. Wait until the \"ever-so-slightly\" stage of wobble, however long that takes.\n\nThe flavor of the shreds of cake I ended up with had good flavor. Glad I was making it for myself and not company.Willy MOMissouri2/17/2021Yes, a thousand times yes.  I did cook mine the full 40 minutes on convection and it still could have used more time.  a 9 inch pan was perfect.  I generally use parchment circles on the bottom of all of my cakes so that was not a challenge.  I don't normally use parchment AND butter the sides, I did both this time. I loosened the edges before the flip, it was wet even at the edges, that should have been a clue for me, it was not.  It flipped out easily and then flipped upright easily.  When you make your's trust your gut more than you trust the timer.  Also, serving it with the whipped cream is really a splendid combination.TriciaSF Bay2/16/2021The cake is actually pretty tasty but a crumbly mess!  I had enough batter to fill a 9” spring form pan.  Used convection bake for 30 min and still way too wobbly.  Another 10 fixed the wobble but the exterior was pretty dry.  I’m glad I didn’t plan on company!AnonymousGeorgia2/15/2021This is a BA Basically recipe with few ingredients. Easy to make but important not to skip steps. The chocolate (I used 7 oz Lindt 70% Cocoa and Ghiradelli 60% Bittersweet chips) and butter mixture must cool down completely. My saucepan retains heat so I transferred the chocolate mixture briefly to the refrigerator to continue cooling. I beat the eggs and sugar for 10 minutes with a handheld mixer on the highest setting. Folding the chocolate mixture carefully and thoroughly into the egg mixture to retain aeration. I made sure the chocolate/egg mixture became a dark chocolate color like the video.  I did switch to a buttered (no parchment paper needed) 9\" springform pan and it was easier than flipping this fudgy crackle topped cake onto a plate. I baked it for 40 minutes @325 - the top was dry but couldn't tell if it was jiggly underneath. It was very slightly warm & gooey in the middle when we cut into the cake. I thought it may need a little more time in the oven. Though after an overnight in the refrigerator, it was nicely dense and fudgy. A rich cake that pairs well with unsweetened cream, coffee, or milk to compliment the richness. AnonymousAlexandria, VA2/15/2021just made this for Valentine's yesterday....turned out great! \ncooked for about 45 minutes. I used a 10inch springform cake pan so I didn't have to attempt flipping it.  I used semisweet chocolate chips and omitted the 1/4 cup of sugar.  The cake was gooey chocolate yumminess! Served it with vanilla ice cream too.Beth Millbrae, CA2/15/2021Made this today, read everything here before I started. Used springform pan, batter came close to top. Waited for chocolate/butter to cool down until bottom of pan was cold. Beat eggs in stand mixer at highest speed (12) x 11 minutes. Mixed together, yeah it was kinda grainy, but shrugged it off. Needed to bake x 60 minutes at 325 before it stopped jiggling everywhere. Tastes like a really rich chocolate soufflé cake. I didn’t get the egg bottom some people had. Thanks everyone for all the adviceSandy_in_lala_landLA2/15/2021Brilliant recipe, but you MUST let the chocolate and butter recipe cool. I used a makeshift double boiler for the butter and chocolate, which made it easy to set on a pan of cold water to bring to room temp. Family favorite! AmySt. Louis, MO2/15/2021Explore Bon AppétitCakeDessertChocolateOther IngredientsHazelnutNutGluten-FreeBakingPassoverBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-10", "author": ["Condé Nast", "Kat Boytsova"]}