{"id": "edb46adefe43649568eb1e068ee5d0d8", "url": "https://www.bonappetit.com/story/ruby-tandoh", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Ruby Tandoh On Throwing Out Sick Day Rules and Eating Curry Instead | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleRuby Tandoh On Throwing Out Sick Day Rules and Eating Curry InsteadWith numbed tastebuds and blocked noses, we ate like queens.By Ruby TandohMarch 7, 2018FacebookTwitterEmailIllustration by Ruby Taylor, courtesy of Eat UpFacebookTwitterEmailThis story is part of the Healthyish Guide to Feeling Better Already, a collection of recipes, remedies, and distractions to get you back on your feet.My girlfriend had a horrible cold recently. When Leah’s sickness was just beginning to take root, burrowing into her sinuses and throbbing in her head, I made her a smoothie. I made it with fresh ginger, orange juice, big chunks of frozen mango, carrots, and green apple, and poured it into her Thermos flask so she could sip it at work. I cooked her a warming soup that day, too, packed with all the veg that her ailing body probably needed. I gave her mugs of acrid-smelling, syrupy cold and flu remedy, and steady doses of herbal tea, and prescribed an early bedtime. I was sure she’d wake up the next day feeling better for all the love and vitamins I had sent her way, and as she sank into sleep with a wad of tissue bunged up one nostril, I graciously laid a healing hand over her heavy head and congratulated myself on a job well done.The next morning, both Leah and I woke up foggy-headed and shivering. Cocooned in blankets and surrounded by a constellation of scrunched-up tissues, we lay in the living room all day watching old episodes of Come Dine with Me, drinking hot water and lemon, and praying for death. We did everything our mums would’ve asked us to—hot showers, hydration, soup, hydration, rest, hydration—and grew weaker by the hour. By mid-afternoon, Leah was so frail that she gagged when she tried to swallow a paracetamol [Tylenol], and it looked like we’d just have to let this sickness run its course.But sometimes, at the gates of death, you get a flash of divine light and see all the beauty of the world and all the hope that’s left to live for. In that moment, teetering at the pearly gates, so close that you can almost feel the candy floss clouds beneath your feet, you see your glorious future unfurl around you, and you decide to stomp right back into life and seize the day. That’s exactly what happened when, ten minutes after gagging on a pill and turning down a cup of tea, Leah turned to me with an unfathomable light behind her eyes and said: \"I have ordered £30 of Indian food on Just Eat.\"\"For an hour or two, reclining in a happy, burping, bloated haze, we felt alive again.\"With numbed tastebuds and blocked noses, we ate like queens. We had Bombay fish curry (a fiery hot, creamy sauce, rich with chunks of tender mackerel), which came, as everything does on that takeaway menu, \"especially recommended by Abdul.\" We wolfed fluffy, steaming rice with heaps of garlicky tarka dal, and, between spoonfuls, nibbled on spicy chicken wings, bright with lime and coriander and the punch of fresh red chilli. We ate with ferocious delight until we could eat no more. Our heads were still pounding, our bodies still bristled with goosebumps, and our skin was still tender to the touch. But for an hour or two, reclining in a happy, burping, bloated haze, we felt alive again.It doesn’t have to be a blow-out curry, of course: you can feel better again with a slice of dry toast or a teetering mountain of soft-baked fudge brownies, depending on your mood. It might be that a bowl of chicken soup or shepherd’s pie is what you need to revive your spirits, or it could be—flying in the face of every piece of mum-wisdom you’ve ever been given—that what you really need is one of those McDonald’s milkshakes that drags through the straw and coats your mouth and catches in your throat with delicious, saccharine glee. (For what it’s worth, it’s been shown that dairy doesn’t actually increase mucus production after all, and any association between consumption of dairy and coughs has been shown to be negligible.) These foods might not be packed with precisely the vitamins and minerals and macronutrients that your body really needs right then and there, but they will make your soul soar, and sometimes—when the very fabric of your life is one big snotty tissue—that’s all you really need.Food is both fuel and medicine, but this doesn’t mean we have to strip it bare of its magic and reframe it as a power source for some robot-like, maximally efficient human body. Yes, the reality is that food is a basic, physical human need. It is fuel, in a sense, and by extension, we are machines that need fueling. But we’re also thoughtful aesthetes who enjoy things like the smell of the sea air, and Buffy reruns, and pub quizzes. Our bodies are not just heavy machines that we drag around with us, and our gastronomic pleasure isn’t just an aside when it comes to the mechanics of eating. Food can be medicine, and still be a joy.This post is excerpted from Eat Up! Food, Appetite and Eating What You Want by Ruby Tandoh, a food columnist for The Guardian and contestant on the 2013 season of 'The Great British Bake Off.' It is published in hardback and ebook by Serpent’s Tail.Explore Bon AppétitHealthyishSoupGet WellRead MoreLifestyleThe Healthyish Guide to Feeling Better AlreadyGallery13 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast"]}