{"id": "edb7d5bdcd052f2a766f7167af85ba6f", "url": "https://www.bonappetit.com/story/super-bowl-etiquette-2021", "year": 2021.0, "month": 2.0, "day": 1.0, "content": "Is It Ever Okay...to Skip the Super Bowl but Keep the Super Bowl Snacks? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay...to Skip the Super Bowl but Keep the Snacks?Solicited advice from Alex Beggs for whatever your Super Bowl “party” looks like this year.By Alex BeggsFebruary 1, 2021FacebookTwitterEmailIllustration by Cari Vander YachtFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.How do you have a socially distant Super Bowl party? –Sociable ShawnaWhen we have our friend Noah over to watch football (my comfort level for guests is one), we watch outside on a TV atop a card table. Six feet between us, masks on, extension cords everywhere, individual plates of food. Is the great outdoors not for you? Make yourself a personal serving of queso and enjoy the fact that you can actually watch Bridgerton instead. Illustration by Cari Vander YachtIs it legal to make the snacks but not watch the game? –Abnormal AnaI am here for the superior snacks of sport. How many grown adults have you seen wearing sweat-wicking jerseys to watch a game on a couch? Same principle, we’re just fans of different teams. Team bread bowl all the way. Whoop for the open kitchen concepts on Fixer Upper, boo at the 15-car garages on Selling Sunset, watch whatever you want. What’s important is that we get a random winter day to gorge on cheesy, saucy, meaty snacks because we have something, at least ONE THING, to cheer for.As a registered dietitian, am I expected to serve a plate of vegetables? –Misdirected MaggiYes! This is your MOMENT. “Plate of vegetables” is just bad marketing. There’s so many snazzy healthy Super Bowl snacks out there on Healthyish, from broccolini cheesesteaks to ranch fun dip to crunchy seaweed snack things. I have been intrigued by buffalo cauliflower for years, though admittedly I don’t get out much.Can I ask if there’s canned chicken in the Buffalo chicken dip? –Realistic RyanWhat’s the point? You’re going to eat a pound of it regardless and say things like, “Why don’t we eat this year-round?” “I just can’t STOP eating this!” “The diet starts tomorrow!” Enjoy it!You can’t double-dip in the era of COVID-19. But will we ever return to double-dipping? –Longing LadkiYou can double-dip all you want in your own personal bowl of dip! But even in a post-pandemic world, humans will never get over the double-dipping taboo. I think every time we see someone double-dip, we picture ourselves tongue-kissing that person, which can be horrifying or super cool depending on the person. But now that we know what power microscopic spittle can wield, shared dips are a thing of the past, like Costco samples and the term “tongue-kissing.”Illustration by Cari Vander YachtWhat are the most sanitary Super Bowl snacks? Does everyone get their own cheeseball? –Brainstorming BriannaAn extra-contagious pandemic is raging. If you’re having a distant “party,” it’s easiest (and laziest) to have everyone bring their own snacks. It’s that, or you create individual platters for everyone/pod, which is exhausting. NOTHING COMMUNAL. Here are some past offerings from my exclusive backyard sports bar:Baked peppercorn wings, distributed by tongsPersonal. Pan. PizzasA quarter sheet tray of nachos per personBYO Lamb shawarma gyrosPigs in a blanket but the blanket is a Lysol wipeDeconstructed seven-layer dip, one layer per personThose hotel breakfast-sized boxes of cereal where the box is also a bowlPopeyesAre you allowed to eat your sister’s leftover wings when she disgraced them by not eating all the meat? –Mooching MariahThis is beyond the scope of my invented expertise.Illustration by Cari Vander YachtCan I eat only the guacamole layer of the seven-layer dip? –Sacreligious SadieThis offends me to my Tex-Mex core! No! My Aunt Yolanda didn’t spread lard-fried refried beans, drain homemade pico de gallo, evenly sprinkle cheddar cheese (not easy!), and sculpt seven symmetrical layers into an aluminum pan to be disrespected like this. Now this isn’t as bad as people who blot the grease off pizza, but it’s getting close. Enjoy the chaotic symphony of textures and flavors!Illustration by Cari Vander YachtWhat about this one: Can I eat the top layer of nachos and then leave the bottom layer of bare chips? –Bottomless BeccaYeah, this checks out. But people: cheese the first layer, then cheese the second layer. Full-coverage nachos are easier to come by than full-coverage bikinis these days, but I want to believe in a world that has both.My partner loves wings. LOVES them. Is it ever okay to tell him that the way he eats them is disgusting? Licking of fingers included. –Kritical KaraEveryone eats wings like a flesh-starved vulture; that’s part of the beautiful carnivorous experience. It’s not just your partner. (It’s me.) Let us have this!Explore Bon AppétitIs It Ever OkayEtiquetteSuper BowlSnackRead MorerecipesThese 71 Meaty Super Bowl Snacks Are the Real WinnersGallery71 SlidesBy Bon AppétitrecipesOur 23 Best Chicken Wing Recipes for Saucy, Finger-Lickin’ FunGallery23 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-01", "author": ["Condé Nast", "Alex Beggs"]}