{"id": "edbde59039b5fcf1de77dd0d2c2fe7bc", "url": "https://www.bonappetit.com/story/bragg-nutritional-yeast-seasoning", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "This Spice Even Makes Salt Taste Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Spice Even Makes Salt Taste BetterAnd it’s why I always keep it on my kitchen counter.By Carla Lalli MusicSeptember 11, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I keep exactly seven things on the caddy next to my kitchen countertop so that I can reach out and touch them on a daily basis. Chances are you already have them, too: Extra-virgin olive oil. Regular vegetable oil. Red wine vinegar and rice vinegar. Kosher salt and my peppermill. That’s six. Item number seven: Bragg’s nutritional yeast.That’s right, friends. I will hunt around in my spice drawer to find crushed red pepper flakes, but I want the nutritional yeast to be in my line of vision the second I walk through the door. That’s because it makes most things taste better.Before you ask: No, nutritional yeast is not the same kind of yeast you’d use for baking bread or brewing beer. It’s related, but nutritional yeast is grown specifically to be harvested and dried into flakes. The leavening power is deactivated in the process, but lots of desirable qualities remain. Nutritional yeast is weirdly high in protein (5 grams per tablespoon) and is a decent source of fiber. Most of the brands on the market are also fortified with B vitamins, which is especially important if you’re on a vegan or vegetarian diet. I am not on either of those diets. I am, however, on the nutritional yeast diet. I have become a Bragg’s aficionado because I can find it everywhere and its texture is appealingly voluminous, with giant-sized flakes. Plus, I love their cider vinegar, so there’s some brand loyalty there, too.Nutritional yeast has salty, cheese-esque attributes, and when you combine it with actual salt, it legitimately turns into something best described as Magic Dust. It is superlative on popcorn, which is one of my favorite foods, but it will also add a subtly addictive flair to vinaigrettes (or maybe it’s addictively subtle?!). I stir it into standard salsa verdes to give them a pesto-ish depth, and I shake it with abandon all over sauteed greens and bowls of beans. If you had some sour cream and mixed in some garlic powder, lemon juice, and “nut yeast,” you’d have a ranch-y dip that the kids would clamor for. If you served some buttered rice showered with nutritional yeast, you’d never go back to denuded rice again. Seared mushrooms, already packed with umami, get even more so when dusted with “nooch.”What I’m trying to say is that anything that you’d serve with a pinch of flaky salt or a squeeze of lemon, you can serve with a little shake of Bragg’s nut yeast. As essential as olive oil, but with a little more magic.Buy it: Bragg Nutritional Yeast Seasoning, $9 at amazon.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendIngredientsSeasoningRead MorecookingAll About Za’atar, the Spice Mix That We Can’t Stop SprinklingBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-11", "author": ["Condé Nast", "Carla Lalli Music"]}