{"id": "edc0405f128c842a6362dac59775d79b", "url": "https://www.bonappetit.com/story/bliss-and-fear", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Bliss and Fear | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBliss and FearTerrible things and beautiful things can happen at the same time.By Amanda ShapiroMarch 26, 2020FacebookTwitterEmailPhoto by Alex Lau FacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I’ve felt a lot of ways in the last week, and every feeling—whether it’s sadness, fear, worry, gratitude, or love—has been intense. I’ve had anxiety so high that my throat constricts (not a helpful feeling during a respiratory pandemic). I’ve felt complete, irrational joy at the sight of blossoms on a tree. I’ve laughed uncontrollably at photos of my friend’s cat. I don’t even like cats.I was talking about this with a friend who is a parent, and she compared it to having a newborn. “You’re living on the knife’s edge of bliss and fear,” she said, and I can’t get that phrase out of my head.These days, my mornings start whenever my eyes bolt open, usually around 6 a.m., and I take my temperature while looking at my phone. I’m not saying this is a good morning routine, but it’s the way things are right now. I put on “The Daily,” then I listen to this new podcast from The Atlantic, which makes me feel informed, terrified, or both, depending on the day.Recently the hosts of that podcast talked about how it’s okay to acknowledge that terrible things and beautiful things are happening at the same time. “People are dying and TV is good,” as one of the hosts put it. I can watch the infection rates rise, and I can dance alone in my apartment to Robyn. I can know that my governor is using prison labor to make hand sanitizer, and I can be calmed by his daily press briefings. I can let the internet swallow me with bad news, and I can be held up by strangers I’ve connected with there. All of these things can be true.Here is a poem that made me cry in a good way.Here is a silly three-minute workout I did today.Here are some healthyish cookies that keep for weeks.Here is an incredibly soothing list of Good Food Things. (Tag yourself: I’m “the tightest coils of curly fries.”)Here is an app that’s helping me, and a lot of other people, find calm.Here’s a way to keep your butt clean that doesn’t involve hoarding TP.And here is a list of pasta shapes to match your emotional state. Wishing I were Reginette (Translation: little queens) but feeling more Fregula (Translation: little fragments) these days.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletterCoronavirusessayRead MoreLifestyleWhat “Together” Means When We’re ApartBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-26", "author": ["Condé Nast", "Amanda Shapiro"]}