{"id": "edc4373e526f67c687c75ac6f1d431f2", "url": "https://www.bonappetit.com/story/spinach-water-feud", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "What to Cook When It’s Dark at 4 p.m. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat to Cook When It’s Dark at 4 p.m.Wintry stew recipes, a spinach water debate, and Instagram tips from the BA social media team.By Alex BeggsNovember 9, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The days, our lives, are getting shorterDid you enjoy that bonus hour of sleep on Sunday? Or did you, like Carla Lalli Music’s son Cosmo, wake up at 5 a.m. on Monday, boldly open a pomegranate, and end up smearing pomegranate juice all over the fridge door, kitchen counter, and your PJ pants before wondering where everybody was? Sweet, sweet Cosmo. Kid can open a pomegranate though.Now he just learns how to make: Andy Baraghani’s Pomegranate-Glazed Chicken with Buttery Pine NutsWhat else is good to cook when it’s dark at 4 p.m.: These 6 wintry stewsWant this letter before it hits the website? Sign up for our newsletter!Football catIs all of us when the mashed potatoes on Thanksgiving are ready. The football cat has nothing to do with food but it was obviously the best news story of the week. Here’s a BA connection: our features editor Meryl Rothstein was at the game!! She cheered the kitty as he sped his way to the end zone. My colleagues told me the cat looked like “fat Roger” (I have a black cat named Roger), which was heartwarming. I hope he got a bowl full of tuna after that sprint.Photo by Alex Lau, Food Styling by Sue LiHow the tempeh crumblesAmanda Shapiro made this vegetarian recipe for tempeh that’s crumbled and browned, and served with a peanut/soy/lime/honey/sambal dressing on noodles. “Tempeh kinda sucks,” she said, “it tastes weird and ferment-y and bitter. But I’m reeaalllly trying to cook less meat for, you know, the planet and also my budget. This was the first tempeh I ever liked. The dressing carries the flavor, and suddenly it doesn’t taste like tempeh at all.” Aliza Abarbanel popped into the conversation: “I make these weekly.” Christina Chaey turned around, “SO GOOD.” So that’s a triple endorsement!Try it and see: Peanutty Noodles with Tempeh CrumblesWow how niceThe wonderful and hilarious Bobby Finger wrote about his love for the BA YouTube channel this week at Jezebel. I like what he says about how we think of anything unrelated to politics as a guilty pleasure/escape from those horrors: “That crippling badness should not wholly negate its opposing force. There are good things everywhere, scattered throughout the otherwise barren and apocalyptic landscape like unsown seeds.” It applies to Claire Safftiz making Takis, definitely, as well as so much other goodness right now...like football cat.Read it: My Obsession With the Bon Appétit Cinematic UniversePhoto by Chelsie Craig, Food Styling by Kate BuckensIt was a rough dayWhen Christina Chaey and Claire Saffitz, at the end of a long day of filming their episode of Making Perfect: Thanksgiving, realized the brussels sprout recipe they’d come up with already existed. It was Molly Baz’s glazed sprouts from last year, a recipe that changed my life. (It never occurred to me to preheat the baking sheet, which makes the sprout halves brown and crisp up FAST.) Anyway, Chaey and Claire were in near-tears. I stood there, useless. But the sprouts they ended up developing have this amazing brown butter, pistachio, and lime dressing. Both recipes are great! Make them and report back with your notes.The recipes: Roasted Brussels Sprouts with Warm Honey Glaze and Brussels Sprouts With Pistachios and LimeMust readI am obsessed with grocery stores and it’s very upsetting to me to read about how dollar stores are taking over, causing local groceries to close. Dollar stores don’t sell produce! They sell Queen Helene’s famous mint julep face mask, giant cans of Campbell’s soup, and the myth of a good deal.Read it: Farm Country Feeds America. But Just Try Buying Groceries There.Find your natty lightWe had a funny meeting this week about taking better personal food photos to be regrammed by the Bon Appétit Instagram account. Social media editor Emily Schultz brought a plate of fried eggs to demonstrate with. This applies to you too, readers, who make recipes and tag us! We’ll regram ya! I will share my notes with you here:VERTICAL ONLY, NO SQUARESFIND YOUR NATTY LIGHT (I think Schultz means natural light, not...the beer)TAKE ON A NEUTRAL OR CONSISTENT BACKGROUNDFOOD MUST LOOK IRRESISTIBLE (a nice photo I had of a salad was rejected for being a salad)SANDWICHES NEVER LOOK GOOD FROM THE TOP, SHOW US THE SIDEEVERYTHING ELSE BETTER BE TAKEN FROM THE TOP THOSOMETIMES THERE’S TOO MUCH PIZZAUnnecessary food meme of the weekUnnecessary food feud of the weekWhile demonstrating how to make Basically’s spinach and feta tarte soleil on Instagram this week (see DM replies above), Sarah Jampel revealed she was saving her squeezed-out spinach water...to drink. It’s spinach tea! “It tastes surprisingly salty even though there’s no salt,” she told us. “It’s a well-seasoned, vegetal broth. You could use it as a base for garlic broth and it’d be delicious!” “Okay, she’s convincing me,” admitted a skeptical Emily Schultz. “This is upsetting,” said Carla Lalli Music. “I drink spinach water. I drink spinach water with pride,” said ally Sohla El-Waylly. “Thawed spinach water? No,” said Andy Baraghani, who continued: “Juiced celery and spinach with just a drop of pickled Thai chile vinegar, some lemon, yes!” Right. Jampel wasn’t giving up: “You know when you deglaze a pan with wine and then pour yourself a glass? It’s like that!”Everyone else: 👀Explore Bon AppétitBeggs NewsletterRead MorecookingThese 6 Brothy Stews Are Our New Winter ClassicsGallery6 SlidesBy Aliza AbarbanelLifestyleTempeh Crumbles Are My Weeknight WingmanBy Sarah JampelcookingThe Perfect Thanksgiving Brussels Sprouts and the Only Salad You Need This YearBy Alex BeggsSpinach and Feta Tarte SoleilRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-09", "author": ["Condé Nast", "Alex Beggs"]}