{"id": "eddf5974164bef66577993d433b7a387", "url": "https://www.bonappetit.com/story/beans-solve-dinner-problems", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Cook Beans Once, Solve a Week’s Worth of Dinner Problems | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCook Beans Once, Solve a Week’s Worth of Dinner ProblemsThey’re even more versatile than my favorite white T-shirt.By Carla Lalli MusicNovember 7, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I’ve been thinking about beans a lot lately, because I’ve been making a lot of beans lately, and the thought process unfolds in a very predictable way.Me: I love beans; I want to eat beans; making beans is a delight; I’m so glad I have cooked beans.I have the first and second thoughts sometime on Saturday night or Sunday morning, and that’s the signal for me to put a few cups of dried beans in a pot big enough to cook them in, cover them with cold water, and set them on my stovetop to soak.Want this letter before it hits the website? Sign up for our newsletter!Brothy and beautiful.\nPeden + MunkHours later, or the next day, I click on the burner under that pot and I have the third realization, as I start the joyful process. I make all beans the same way, and I’ve covered that extensively, so I won’t rehash it again here. (Don’t drain the soaking water!) The revelation is all the things you can do with the beans once they’re made. A pound of beans will yield two to three quarts of cooked beans, depending on how brothy they are, and those will hold in the fridge for many days. I love to eat a bowl of hot brothy beans seasoned with a squeeze of lemon or lime, a few dashes of hot sauce, and a warm tortilla, but there’s a lot more you can do with them than that. Here are nine of those potential payoffs:Make the ultimate refried beans. Skip to the second stage. Use any bean. Rejoice.Drain the cooked beans, then marinate them. Beans on toast! Beans in a salad! Beans as a side dish!Have tasty tomatoes around?! (I know, it’s fall, but dare to dream.) Beans and tomatoes is a dream combo.Get married to some mushrooms and farro and make this incredibly slurpy soup.This seedy arepa recipe features black beans in an award-worthy supporting role, but you could make with pinto, cannellini, kidney beans, lentils...Reheat and finish them with cream, which is honestly great advice for so many things.Add them to pasta! Beans, greens, sausage, noodles… hello dinner in 20 minutes.Or this pasta, with quick-cooking mussels and a zippy tomato sauce.Okay I haven’t done this yet, but I’m going to: Pour off half a cup of the brothy bean liquid and turn it into a delicious dressing with mustard, vinegar, some chopped shallots, and chopped tender herbs if you have them. I think this would be a stupendous way to sass up a batch of cooked grains or pot of rice, and I promise to do that and report back.Even more ways to cook beans:1 / 86ChevronChevronKale Minestrone With PistouView RecipeExplore Bon AppétitCarla NewsletterBlack BeansCannellini BeanKidney BeansWhite BeanRead MorecookingThese White Beans Are More Reliable Than My WiFiBy Alex BeggscookingWhen You're Cooking Dried Beans, You're Already Halfway to SoupBy Sarah JampelcookingWhat's The Deal With The Goop In Canned Beans?By Emma WartzmancookingNow That I Know How To Cook Beans, I’m Making This Dish All The TimeBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Carla Lalli Music"]}