{"id": "edfb9f93ab828a228781ba7b504863c3", "url": "https://www.bonappetit.com/recipe/best-roasted-cauliflower", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Roasted Cauliflower Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueRoasted CauliflowerBy Claire SaffitzMarch 20, 20183.7(3)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThe key to developing crispy browned surfaces on roasted cauliflower is baking it in a super hot oven on the lowest rack, so the baking sheet is close to the heat radiating off the bottom of the oven.Ingredients4 servings1medium head of cauliflower, cut into 1\"–2\" florets5Tbsp. extra-virgin olive oil, dividedKosher salt, freshly ground pepperCoconut-Turmeric Relish (for serving; optional)PreparationStep 1Place oven rack in lowest position and preheat to 450°. Toss cauliflower and oil on a large rimmed baking sheet; season with salt and pepper. Arrange cauliflower so a flat side is facing down and roast until dark brown and crisp on bottom, 15–20 minutes. Remove from oven and turn pieces over. Roast until second side is dark brown and crisp, 10–15 minutes. Let cool slightly.Step 2Transfer warm cauliflower to a platter. If using, spoon relish over top and season with more salt and pepper.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Roasted Cauliflower?Leave a ReviewTell us what you thinkExplore Bon AppétitCauliflowerVegetableEasySideDairy-FreeGluten-FreeVeganVegetarianKetoHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Claire Saffitz"]}