{"id": "ee1a1fabb6e9c7157a4b39fbb810d91b", "url": "https://www.bonappetit.com/story/fried-capers", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Fried Capers Are Even Better Than Regular Capers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCapers Are Good. Fried Capers Are BetterIt follows the logic that most things improve upon being fried.By Sarah JampelMarch 15, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailThere are so many exciting aspects of Christian David Reynoso’s new recipe for Rustic Leek and Potato Soup. (Permission to call it a chowder?) There’s the gremolata, where the herbs are fried before they’re crumbled (hello, texture!), there’s the fact that because it’s “rustic” you don’t have to deal with puréeing potatoes (food mills, blergh), and, last but not least, there are the fried capers.I do love capers’ briny, chilly punch straight from the jar—I’ll chop them coarsely and stir them into vinaigrette or scatter them on top of a fancy composed salad or blitz them into green sauce—but I like them best when they’re cooked. Not only do they release their salty assertion into whatever they’re cooking in—be it oil or sauce or butter and wine (piccata!)—but they also get soft and plump, ready to melt in your mouth rather than pop like a balloon.And when capers are not just gently sautéed but aggressively fried, they’re even better. On my list of “Foods Very Good Fried” (which, I’ll let you know, is constantly expanding), capers rank up there, along with green tomatoes, mozzarella, olives, tofu, pizza dough, and choux pastry (which, when fried, becomes a French cruller!). Frying causes capers to open, like flowers blooming in slow motion (and the Dominique Ansel marshmallows they’ve inspired). The insides retain some moisture, but the exteriors dry out, turning brown and crisp. Now, they’re not just a salty contrast, but a salty, crunchy contrast—a logical crown atop polenta, brothy beans, charred, roasted cauliflower, yogurt dip, tomato toast, and, of course, creamy chowder.Frying capers is a bit more work than opening up a jar, sure—but it’s worth it. To do it, you’ll first want to dry your capers well. Pat them down on a kitchen towel. The drier they are, the less they’ll sputter and the crispier they’ll become. Then heat your oil in a skillet or, to reduce chances of splattering, a high-sided saucepan. You’ll want about ¼–½\". Wait for the oil to get hot: It should be shimmering. You can see if it’s ready by adding just ONE caper first; it should sizzle immediately. Add the capers, working in batches if you’re doing a lot at once (otherwise, you’ll cool the oil down)—and fry until they start to open up and turn brown, as few as 30 seconds and as long as 3 minutes, depending on your oil temp. Remove the capers from the oil with a slotted spoon or skimmer and let drain on a lined sheet pan. They’ll crisp as they cool.Now you have snackable capers, but you also have another gift: caper-infused oil. For Christian’s soup, he uses that flavorful oil as the base for his sautéed aromatics. Use it as the base of a salad dressing or drizzle it over smashed potatoes or a big plate of sliced tomatoes. The world, as no one says, is your caper.Get the recipe:Rustic Leek and Potato Soup With Fried Herb GremolataA creamy potato soup without the puréeing, plus a crunchy, fresh topping you'll want to scatter on everything.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-15", "author": ["Condé Nast", "Sarah Jampel"]}