{"id": "ee286611ef1d9ed51c078ab26d5fa9b8", "url": "https://www.bonappetit.com/story/pork-marbella", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "Thought it Couldn’t Get Better Than Chicken Marbella? Welcome to Pork Marbella | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThought it Couldn’t Get Better Than Chicken Marbella? Try it with PorkIt’s brothy. It’s crispy. It’s pretty much perfect.By Adam RapoportMarch 22, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailIf you grew up during the ’80s and your mom (or dad!) read magazines like Bon Appétit, then there was a 99.99 percent chance that you grew up with Chicken Marbella. It was the chart-topping recipe from The Silver Palate Cookbook, a publication chockablock with hits. (No wonder we chose it for our February cookbook club.) At once sweet and salty, a touch acidic, both brothy and crispy, the dish was everything a dinner-party main course should be.And really, it couldn’t have been easier to prepare. You basically made a dressing of red wine vinegar and olive oil and you hopped it up with olives, oregano, dates, and brown sugar. You then marinated a bunch of chicken parts in the mixture, before roasting them in the same marinade—hence the brothy-but-crispy part.It was the kind of dish that stuck with you, long after you moved out of your parents’ house.Which is why, one night several years back, I got to thinking about Chicken Marbella again. I was at my friend Ted Lee’s, and he was roasting pork tenderloins in a bath of madeira wine, allowing the meat to remain impossibly moist while imbuing it with an alluring sweetness.Hmm...kind of like my mom used to do with Chicken Marbella.A couple nights later, I gave it a shot. I whisked up the Marbella marinade, placed two tenderloins in a Zip-Loc bag and poured the liquid over them. A few hours later, I seared the tenderloins till beautifully browned and all caramelly looking. I filled a large pan with the marinade, about halfway up the sides of the twin tenderloins, and into an oven they went for about 15 to 20 minutes.Soon they were just about done—creeping toward medium, but still a smidge pink in the center, like how good pork should be cooked. And that smell, talk about taking me back. Sweet and fragrant. Irresistible.I sliced the pork into medallions and draped it with the sauce. Pretty much perfect.All these years later, I (nervously) introduced Pork Marbella to the professionally judgmental BA Test Kitchen. Senior editor Molly Baz rode shotgun while I prepared it one recent afternoon, weighing in with the kind of advice that you expect from a pro.“Let’s just incorporate the brown sugar into the marinade—no need to sprinkle it on top of the pork when it’s in the oven.”“Once the pork is done, we’ll definitely need to reduce the sauce on the stovetop so it gets all syrupy.”“Remember that the residual heat will continue to cook the tenderloin when you remove it from the oven. So let’s pull it when the thermometer reads 150.”Cooking with Molly is like playing tennis with someone who’s much better than you—she makes you play better.By the time we finished, the pork was a exactly almost-medium, the sauce was just as I remember my mom making it. Well, almost. Don’t tell Maxine, but it was even better.Get the recipe:Pork MarbellaWe took the classic, beloved Chicken Marbella and made it weeknight-friendly by using quick-cooking pork tenderloin instead.View RecipeExplore Bon AppétitPorkDinnerWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-15", "author": ["Condé Nast", "Adam Rapoport"]}