{"id": "ee371a42c45a2a58895147190cc2c83d", "url": "https://www.bonappetit.com/story/love-is-blind", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "How Love Is Blind Turned Out to Be the Perfect Show for Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirus2020 Was Going to be the Year I Found Love. The World Had Other Plans.Instead of a boyfriend, I got a global pandemic, “Love Is Blind,\" and a new understanding of connection.By Lily DiamondMay 4, 2020FacebookTwitterEmailPhotographs Courtesy of NetflixFacebookTwitterEmailThis story is part of the Healthyish Guide to Being Alone, a series of tips, recipes, and stories about how to be alone when we’re together and together when we’re aloneTucked in bed next to me, my iPhone screen glows with two new Bumble notifications––chipper reminders that finding love today is nothing like it used to be. “Stay inside and get your daily dose of human connection,” the app quips. “Physical distance ≠ loneliness. Keep connecting safely online.”All day long my screen is alight with these safe, cyber connections—forced distance and technology making it easy for people to blip into and out of each other’s lives. I’ve gotten FaceTime requests from people I haven’t talked to in a year, Marco Polo video chats from distant relatives. My Instagram feed is flooded with Lives, bloggers baking, artists leading painting-dance-knitting classes, healers proffering free Zoom sessions, teachers advising weary parents, business owners coaching each other to innovate, celebrities admonishing the young and restless for not staying home, and nearly everyone claiming an ecstatic, loving authority to be there for you, whomever you may be.I am swimming in digitally delivered oxytocin, yet like many who share the privilege to stay home, I am also more alone than ever. But that’s not just because of the pandemic.In December of 2019, I moved from Los Angeles to Maui, Hawai’i, the place where I grew up and part of the world’s most isolated archipelago. The new decade, I’d decided, would not just be good, it would be transformative. I’d reconnect with a community and grow my own food; we’d elect a sane human to be president; and, most definitely, I’d find love after a decade-long romantic dry spell. 2020 would be the year I redefined love—of all kinds.Clearly, 2020 had other plans.My iPhone chirps out yet another Bumble truism, but this one I ignore. I’m now focused on something far more urgent: The final episode of Netflix’s “Love Is Blind”. The reality TV show offers an addictively irrational universe in which a “social experiment” separates male and female participants, placing them in isolation pods where they are required to “date” the human on the other side of the wall. Here, success means falling in “love” over the course of a week (or less), sight unseen, and executing an emotionally overblown marriage proposal from within the isolation pod.At the show’s start, participants revel in the ways that dating “blind” is teaching them to articulate and connect over values, rather than fixate on physical attributes. They’ve skipped over lust to the part where they find out what could carry a relationship into the long-term. Once the successfully betrothed lovers meet face-to-face, they’re whisked off to a Mexican beach vacay and a thirty-day countdown to their wedding.Then comes the real work: Can they sustain the connection, even when the high wears off and the person in front of them is maybe shorter than expected, kind of annoying, smells a certain way; is a body and a mouthpiece whose values are as aspirational as they are realistic? Can they relinquish life-long habituation and self-interest to prove—as the show’s hosts are fond of asking—that love truly is blind?From the confines of my own isolation pod (aka home), life was beginning to look a lot like reality TV. In every available form of media, on every possible screen, lonely folks in quarantine were seeking connection-at-a-distance, hoping the abstract love beaming from Instagram Lives, FaceTimes, and Zooms might sustain them through the pandemic.I get it. Like several of the women on this whiplash of a series, I’ve built a life and a livelihood online—I’m an “internet person,” as blogger Joy Wilson puts it. The closest I come to coworkers are colleagues who live thousands of miles from me, and the four walls of my home are always my workplace, not just during a pandemic. This is both privilege and curse, for as much of a freedom as it is to make my own hours and publish my own writing, working from home can be its own kind of self-fulfilling isolation prophecy. I spent the better part of the last decade searching for ways to be less alone, less screen dependent, and yes, less single.After seven years living by myself in California, I hit a wall of loneliness. I’d built the business, amassed the readers, published the book, done the workouts, nurtured the community, braved the therapy, doubled down on the self-love, vibed the manifestations, and yes, gone on hundreds of online dates that rarely lived up to their on-screen promise. Still, I was alone. At thirty-six, friends were having second kids and buying homes while I took my third-wheeling skills to black-belt levels and learned to mainline connection through a screen.The irony of my pre-Covid move from L.A. to Maui is not lost on me. Several months into the new year, I have gone on zero dates. I spend more time than ever staring at a screen. Instead of a boyfriend, I got a global pandemic and “Love Is Blind,” two fates (and lessons) perhaps deserving of each other.As the couples in “Love Is Blind” start spending time together in person, they quickly realize they don’t actually know––or necessarily even like—each other. With a few exceptions, their love is performative and fleeting, born of dating app swipes, social media addiction, hollow “omg I love you”s dropped on YouTube. In “real” life, Damian can’t stand Giannina’s social media use and iPhone addiction. Carlton is terrified to disclose his bisexuality. Amber forgot to mention her piles of credit card debt. Lauren doesn’t know if she wants to give up “personal space forever.” Kelly doesn’t orgasm easily. And Jessica can’t open up to Mark without a wall between them, never happier than when he engineers a date that replicates the isolation pods.At one point, Jessica says something that makes me stop, mid-Insta scroll: “Something about being in this pod-like scenario brings down the walls, and you just open up.”It’s everything I’ve been feeling and seeing in quarantine: that hazy projection of love into the digital cosmos that delivers a sense of being heard and supported, even if it’s an illusion.As an “internet person,” I know firsthand the way screens—like the walls that separate “Love Is Blind”’s participants—allow me to edit and share my life, curating a virtual self far more palatable than the realities of full-spectrum me, in flesh and (monthly) blood. I know there is no substitute for the other, real me. Like there’s no substitute for physical attraction in a romantic relationship, or getting to know someone over the course of months or years rather than days. And that feeling of opening up––whether in isolation, or from the protective distance granted by a screen—might be a euphoric taste of intimacy with self and the illusion of empathy, but it’s not the same as being vulnerable, as showing up, in person.Dating during quarantine feels almost unimaginable. But inside this collective isolation experiment, as weeks expand into months, as markets crash, death tolls rise, and unemployment numbers soar, I catch glimpses of a love that feels less illusory and more tangible. It’s a love that demands to encompass entire communities, including people I will likely never meet. Or as author and historian Ibram X. Kendi tweeted, “We are all realizing how interconnected we all are as we distance ourselves from each other.”What does it look like to actually hear and support each other right now, when inequities of access to food, health care, and safe shelter are laid so very bare? It’s easy to be a staunch, anti-racist feminist—or an eternal font of “love and light”—from behind a smartphone keyboard, but what happens when a pandemic presents the clear opportunity to show up for people who do not look, talk, or live like me? The choices I make right now, from six feet apart, speak far louder than any performative activism or virtual love.Here on Maui, I’ve been trying to scroll less and do more. I grow my own food and barter with neighbors. I deliver weekly hauls of avocados to the unsheltered. I am more patient with my father, and more connected to my community—more willing to address people’s most urgent needs for food, masks, tents, five gallon buckets to use as toilets—than I was before I was distanced from it.The Greeks might call this something like pragma: a realistic, mature love born of experience over time, compromise, and mutual exchange. Erich Fromm described it as “standing in love,” but I’d say it’s more like moving, or acting, in love. Pragma is what’s being asked of us, whether we’re sheltering at home or working on the front lines of the pandemic. It’s a call to show up, to love by seeing and responding to what’s on the other side of the pod wall. For the two couples who manage to get and stay married on “Love Is Blind,” pragma is the glue.This wasn’t the definition of love I expected, or even wanted, but it’s the one I got. And now, the real question: will it last when the pod walls come down?Every evening I say goodnight to my iPhone and fold myself into an isolation chamber of my own making, king-sized pillows on either side of my body. I imagine the future the way we all do these days: not a two-year or five-year plan, but just three months out, maybe six. Will I still barter seeds and bring food to the unsheltered? Will I remember it feels good to be closer than six feet apart? Will I crave the messy, the human, the contagion of sex? Will I be able to build a generous, meaningful life from this blueprint of love we’re all drafting—separately but together—in the face of global crisis, extreme income inequality, climate change, and mandated isolation? And will it prove that love really is blind?I think it’s time I learn how to love with eyes wide open.Explore Bon AppétitHealthyishCoronavirusHealthyish Guide to Being AloneessayRead MorecultureLeading a Virtual Dance Party Is What I'm Living For Right NowBy Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-04", "author": ["Condé Nast", "Lily Diamond"]}