{"id": "ee4b45d096f7a118b9e16e3c21572144", "url": "https://www.bonappetit.com/story/f-and-f-pizzeria-brooklyn", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "A Grain Guru, Tomato Whisperer, and Two Hospitality Mavens Walk Into a Pizzeria... | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsA Grain Guru, Tomato Whisperer, and Two Hospitality Mavens Walk Into a Pizzeria...At Brooklyn’s F&F Pizzeria, Chad Robertson, Chris Bianco, and The Franks come together for one hell of slice shop.By Alex DelanyOctober 17, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIt’s Saturday night around 7 p.m., and already F&F Pizzeria is sold out of slices. “We baked 400 pies today,” says co-owner Frank Falcinelli. “And we don’t have any more pizza to serve. That’s bad. I mean, it’s good, don’t get me wrong. But it’s...insane.”Maybe he’s surprised because the shop hasn’t even been open a week. Maybe he’s surprised because New York has no shortage of slice shops, including newer ones that use house-milled flour, housemade mozzarella, or naturally leavened dough, just like his does. But I wasn’t surprised.It feels silly to say that a slice shop feels important. Or highly anticipated. Or destined for greatness. (It’s just pizza, right?) But if you enjoy a good slice in the slightest—and you look at who built F&F Pizzeria—it’s hard not to feel that way about Brooklyn’s newest, buzziest pizza joint. And to start, you have the Franks.From left: Frank Falcinelli, Chris Bianco, Chad Robertson, and Frank Castronovo.\nPhoto by Alex LauFrank Falcinelli and Frank Castronovo are the Italian-American chefs and restaurant owners behind Cobble Hill, Brooklyn’s beloved Frankies Spuntino (with a location in Manhattan too) and Franks Wine Bar (formerly Prime Meats). Their spots, serving reliable, well-executed Italian classics, made with top-notch ingredients, are neighborhood favorites—just look at the lines out the door any night of the week. If they’d opened a pizzeria by themselves, it would have been noteworthy. But what makes F&F even more impressive is the fact that Falcinelli and Castronovo asked two legends to help them: American pizza savant Chris Bianco, whose Phoenix pizzeria has been making pies of the highest quality for close to 30 years—long before “responsible grains” or “naturally leavened dough” were buzzwords in the industry—and whose canned tomatoes are some of the best in the country.) And grain guru Chad Robertson, whose knowledge of grain varieties, dough fermentation, milling techniques, and wheat suppliers makes his bread at San Francisco’s Tartine Bakery some of the most celebrated in the world. Needless to say, F&F’s All Star team, isn’t just turning out great pizza, it’s responsible, nutritious, and considered too.A week before they sold their first slice, I got to sit down with the guys to talk pizza, bread, tomatoes, health, and life in general. Here’s what gets said (and sometimes shouted) when a bunch of pizza nerds get together for espresso:Quality pizza starts with quality ingredients.\nPhoto by Alex LauThe Franks on F&F… “I think what’s great about this group here is that we’re totally aligned in what our mission is, as far as feeding people. It’s good, simple, nutritious, delicious food. Healthy food without screaming, It's a health food! When we started this project, we said, ‘If we’re going to do pizza, it’s gotta be like that, or it wouldn’t be us.’”Chad on food’s final frontier… “I feel like grain is the last frontier of where chefs are looking at the source. It happened with produce, it happened with meat, it happened with fish. For most of our lives it’s been white flour or wheat flour. But now there are dozens, no hundreds of varieties, and different extractions, and different types of milling. You can make bread that looks like white bread—the texture and the volume are about the same—but it's got more flavor, more nutrition, and when you eat it, your body reacts differently. Pizza can be healthy, based on what you’re putting on top, but the grain itself is more of a focus now.”Chris on the future… “I didn’t invent pizza and Chad didn’t invent bread. But we need to leave things better than we found them, or at least ask why or what we could’ve done to push, you know? I would say we could blame the unintentional ignorance or lack of transparency of our fathers [for where we are now]. They might have used something that was in their pantry for years. Maybe it was something their mother used. But maybe we should turn the label around sometimes.”Bianco’s tomatoes are clutch.\nPhoto by Alex LauChad on the Fourth Wave… “With Third Wave, it became acceptable to wait half an hour for someone to make your coffee. But with Fourth Wave, it’s about taking the quality of Third Wave and making it convenient and accessible and affordable to everyone. I feel like that's got to be the thing with ‘farm to table’ or ‘local’ or ‘regional’ or ‘organic’ or whatever. This is a slice shop and it's going to be the best stuff: the best grain, the best long fermented process, best olive oil, tomatoes, all that, but it’s not fancy pizza. It's not, you know, $30 pie.”Chris on dedication... “I got three kids and if I had one more, I’d be a fucking serial killer. But it took me a lot of years to understand that, Holy shit, I might have to share something with small people that they'll be able to use in their lives. And really all I can think of is just, Don't be an asshole. That's as much as I can do, the rest is up to them. I can give them some structure to be kind, to understand that a person, place, or thing needs more than what you want to give them. And whether it’s a slice shop, a drugstore, affordable housing, mass transit—fill in the blank—it will always serve you best to study it.”The Franks on the power of pizza… “At the base of it, we’re really trying to change the food system. To put a face to the agriculture—put it within a product and serve it to people—without being so preachy about it. Pizza is one of the most commonly eaten foods in the world. There's a pizzeria in every city on the planet. So why not take the most basic thing, the thing that everybody loves and do the best with it? It's a very humble Trojan horse to try to change shit with.”Explore Bon AppétitRestaurantsBrooklynPizzaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-17", "author": ["Condé Nast", "Alex Delany"]}