{"id": "ee5a551f58cee51e16233ebbd169cfaf", "url": "https://www.bonappetit.com/story/fermenting-supplies-online", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "13 Fermenting Supplies to Buy Online Before You Start Making Kombucha | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture13 Fermenting Supplies to Buy Online Before You Start Making Kombucha or WhateverWant to brew kombucha? Make sauerkraut? Become a hot sauce master? Here's what you'll need to get fermenting.By Alex DelanyJanuary 29, 2018FacebookTwitterEmailFacebookTwitterEmailIf you've been watching our video series It's Alive with Brad, you know that we have a thing for fermented foods—eating and drinking them, as well as experimenting with our own in the Test Kitchen. But you don't need a Test Kitchen to ferment at home. And you don't have to trek to some fancy Scandinavian restaurant to try your hand at fermented green garlic. You don't have to hit your local health store to explore the wonders of kombucha. You can produce that tangy, electric, exciting fermented flavor at home.Hot sauce. Sauerkraut. Pickles. Kombucha. Kimchi. They can all happen at home. But you'll need the right equipment. Thankfully, our  fermentation guru Brad Leone has a list of trusty tools to get you started. Here’s his lineup:Cheese Cloth“Cheese cloth is a breathable fabric that also keeps unwanted bugs and contaminants out of your fermented treasures,\" said Leone, \"It’s the perfect thing to fold and cover an open jar lid. Just seal it up with a rubber band. I use these all the time.”Use It For: Covering any open jarsBuy It: $3.73 each at JetAuto Siphon“This is a sanitary way to get liquid from a large vessel to a smaller vessel. You know what I’m talking about. Bottling. The smooth transfer isn’t disruptive to the liquid, and you don’t have to make a siphon with a tube and your mouth. I used to do that when bottling kombucha. That’s not fun.”Use It For: Bottling kombucha, tepache, or beerBuy It: $17 on AmazonBottle Brush“Get those dirty bottle all the way out of here. You want a long brush that’s able to properly clean the necks and corners of bottles. Scrub your shit good.”Buy It: $12 (for a set) on AmazonCrock and Weights“Most things are fermented in brine, a salty liquid that cures whatever goes into it. Think about sauerkraut, miso, or kimchi. You want to keep your product submerged in the brine, so it ferments evenly.”Use It For: Making sauerkraut, kimchi, or misoBuy It: $60 (for both) on AmazonFermentation Kit“This kit is great for beginners. It includes lids and air locks for Mason jars, a vegetable pounder, and a book with recipes. If you want to start with small batches and buy everything in one swoop, look no further.”Buy It: $55 on AmazonGlass Bottle“Flip-top glass bottles are mandatory for fermented beverages. I used to use corked ones, but I’ve learned better. These are easy to clean, reliable, and look pretty nice too. And always ferment in reusable vessels. The world’s dirty enough as it is.”Use It For: Bottling kombucha, tepache, or beerBuy It: $11 each at WalmartGallon Jar with Air Lock“Two cups of something? What am I going to do with two cups of something? If you’re putting the time into fermenting, commit to a big batch. This one gallon jar comes with an air lock that promotes healthy fermentation and encourages large batches.”Use It For: Sauerkraut, kimchi, and picklesBuy It: $19 (for two) at WalmartKombucha Starter Jar\"The Mother is the living force that makes kombucha tangy and funky, and you maintain it like bakers do a sourdough starter. While you can use just about any jar, I like the size of this one. It provides enough room for the mother to grow. Give the lady a comfortable home.\"Buy It: $20 (for two, comes with plastic airtight lid, muslin cloth, and rubber bands) on AmazonJacobsen Kosher Sea Salt“A clean, high-quality salt is the secret to any good brine. Don’t even think about touching the iodized stuff, which tastes like chemicals. If you start with high quality ingredients, you’ll (hopefully) end up with a high quality product.”Use It For: Sauerkraut, kimchi, corned beef, and picklesBuy It: $13 on AmazonThermapen“You should know what temperature your brine or fermented beverage is sitting at. The best fermentations happen at around 70°. I'll check in on kombucha to make sure it isn't too hot or too cool. If it is, I'll move it to a safer spot and thank my Thermapen.\"Buy It: $99 at ThermoworksThermoworks Digital Thermometer“I’m not a weatherman, but I like to know what my fermentation environment is looking like. Having a thermometer that reads the temperature and humidity in whatever room you're in will give you a better understanding of how the fermentation is going. Keep those numbers in your notebook for next time. It’s science.”Buy It: $39 at ThermoworksRefractometer“This is a little nerdy, but a refractometer uses light to identify the components and ingredient levels in solutions, which is super helpful for calculating the percentage of alcohol in a beverage. When I make tepache (a spicy, fermented pineapple drink), this comes in handy for reading sugar levels. It makes me feel like a scientist.”Use It For: Measuring sugar and alcohol levels in tepache, kombucha, tepache, or beerBuy It: $22 on AmazonSaniclean\"Look, you have to keep things clean. I don’t care what your room looks like at home. Your fermentation station should be spotless. Saniclean is an affordable, well-known, food-safe disinfectant made from a solution of two super-obscure acids. It’s the industry standard, and giving your vessels a wash with a diluted solution of Star Sani and water will make sure all your fermented projects go according to plan.”Buy It: 18 (for 16 oz.) on AmazonSpeaking of fermented hot sauce, that's something you should give a try:Fermented Hot Sauce Is Definitely Having a MomentLook what's bubbling up at restaurants around the country.View StoryExplore Bon AppétitFermentationToolsShoppingRead MorecultureHere's What Happens When You Drink 2 Gallons of Kombucha a DayBy Bill Bradleycooking3 Cocktails That Prove Kombucha and Booze Are Made For Each OtherBy Alex DelanyLifestyleSauerkraut Is Getting the Love We Always Knew It DeservedBy Carly FishercookingJust Kimchi It: How to Turn Any Veg Into Addictive Spicy PicklesBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-29", "author": ["Condé Nast", "Alex Delany"]}