{"id": "ee5d6a97bd78bbef5bf43f1fc197b269", "url": "https://www.bonappetit.com/story/japanese-breakfast", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "Japanese Breakfast on Making Her Mom’s Kimchi Soup and Embracing Her Half-Korean Roots | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleJapanese Breakfast on Making Her Mom’s Kimchi Soup and Embracing Her Half-Korean RootsBetween touring nationally and writing a memoir, Michelle Zauner somehow finds time to cook.By Alyse WhitneyFebruary 20, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailMusician Michelle Zauner (who performs as experimental rock band Japanese Breakfast) is not Japanese. She’s proudly half-Korean, growing up in the suburbs of Eugene, Oregon to a Caucasian father and a Korean mother. Last year, Zauner wrote a piece in the New Yorker called Crying in H Mart, about her mother and her aunt, who both passed away from cancer. “When I go to H Mart, I’m not just on the hunt for cuttlefish and three bunches of scallions for a buck; I’m searching for their memory. I’m collecting the evidence that the Korean half of my identity didn’t die when they did.”The question of identity hit close to home for me, a Korean woman adopted by white parents in upstate New York. So when Zauner was in NYC to work on a music video late last year, we sat down for lunch at Hanjan and talked about what it means to be Asian and the foods that define us. While we spoke, I watched her tattooed arms—a Kewpie man to symbolize a scallop dish her mom made on New Year’s, and a portrait of her umma—toss jajangmyeon noodles (a dish made of pork belly and fermented black bean paste), and serve tteokguk, a rice cake soup.We talked about the kimjang kimchi-making parties she hopes to host and how she connects with young Asian women as she tours across the country. (Catch where she’s playing in 2019 here.)You mentioned in your New Yorker piece that your mom never gave you any recipes. Did you learn by osmosis? Or did you just kind of enjoy the food when you were a kid, and then later in life wish that you knew how?I never thought about cooking for myself until maybe my junior year of college. I was like, “Mom why didn’t you teach me?” Because I didn’t even know how to make rice. I think that’s why YouTube star Maangchi is such a big deal for a lot of Korean-American kids—she's one of very few resources of an authentic Korean woman cooking and explaining it in English. My mom didn’t withhold it from me, but she wasn’t specific. She’d be like, “Put in a thumb size of this,” or “add soy sauce until it tastes like Mommy’s.” When she was sick I didn’t think, “I should really get those recipes!” And when I was growing up, I didn’t think there would be a day when I couldn’t just call her and figure it out.What are the dishes that stick out to you most fondly?I went to Bryn Mawr, like three thousand miles away, so when I came home for extended vacations she would make galbi, short rib barbecue. She would marinate it two days before and always have dongchimi, a radish-water kimchi that is so tart and refreshing. I’ve never found any grocery store, even H Mart, that has one that is of the same flavor profile as the one that my mom bought from the Korean grocery store in Eugene. She would leave it on the counter and ferment for a specific amount of days, and then add sesame oil, sesame seeds, and red pepper flakes. I’ve never had it since she passed away.Did you learn most of your Korean cooking from Maangchi? That’s the only way I’ve learned.A lot of it. I remember watching my mom cook all the time, so a lot of times I just watch Maangchi to get the base knowledge of how a dish is done, and then make changes to how my mom would do it. So like with her kimchi soup or whatever, I know my mom would never use anchovy sauce—she just used pork—so I tweak it to make it taste more like my mom’s.I make kimchi with her base recipe whenever I can. A lot of Korean cooking is a communal, shared thing. There’s this thing that’s called kimjang, when a whole village would spend the day making kimchi for the whole year at once. A lot of times women will take a plastic kids’ swimming pool, fill it with the marinade for the kimchi, and then everyone sits around it painting all the cabbage. I really want to have a kimjang party. My mom and I used to do that with dumplings. We would invite our friends over, sit at the table, and fold a shit-ton of dumplings out of this huge amount of stuffing. So then we would just have dumplings in the freezer that we made forever.Did you worry about being half when you were a kid?I hated being Asian. I grew up in a place that was largely white, so I was so embarrassed. I hated going to Korean school every Friday and I didn’t have any Asian friends. The only Korean things I loved were my family, the food, and going to Korea. I felt like the goody-goody impression of Asian people was so far from who I was, culturally.It’s so crazy, because I grew up in such a white town, everyone just assumed that I was full Asian. And I always felt like, “Oh I look so Asian for being half.” But then if I go to Korea, everyone just thinks I’m white. And then here if I go to a Korean restaurant and a Korean person is speaking to me in English, I’ll be like, “No, no no, listen to my accent, I speak Korean.”Being raised by a white father and a Korean mother, do you feel that now, culturally at your core you’re more Asian? Or are you culturally very white but have found the Asian parts of yourself later?I  simultaneously feel so Asian and so American. White people treated me like I was full Asian, and that’s how everyone saw me. Simultaneously, every time I go to Korea I realize I interact with the world like an American. It’s weird, because every time I’m at the doctor’s office and fill out a form, there is no option for me. It asks your race and you can only pick one, but it’s like, \"I am literally both of these things; I have no idea what you want me to do.\" Am I other? It feels misleading to say I’m “Other.”Has sharing your story helped you understand who you are more?Yeah, and I’m working on memoir that will be an extension of my New Yorker piece about growing up biracial and what happens in your teenage years when you start to reject that identity. When I was younger, I was so proud to be Korean and special and different. And then when you’re a preteen you’re like, “I hate being different, I need to be exactly the same, like everyone else.” And then I find myself coming full circle as an adult and wanting to connect to that culture again that I rejected. And all of that was amplified by losing my mother.Do you feel like your music is influenced by that part of your identity?There are no Asian instruments, but there are a couple of little Easter eggs. My first record has a voice recording of my mom, and she says something in Korean. I wasn’t like, “This is where I proclaim my Asian identity!” It was just, “This is a voice recording of my mom leaving me a message and I want it on a piece of vinyl.”When I went to Korea I was inspired by Jeju diving women, and there’s a reference to that on the first song of the second album. A couple of my music videos are influenced by that, mostly just as commentary of people thinking that I was Japanese. I wanted to wear a Korean hanbok and express that I’m not hiding behind anything; the choice for the name Japanese Breakfast had nothing to do with me pretending to be Japanese and taking that culture. I’m proud to be Korean.Do you specifically seek out other Korean people creatively to support and surround yourself with?I’m always just the kind of person that tries to connect with people. I think especially after my mom died talking about my experiences brought me comfort and then a lot of people came to me. It also comes from just feeling so alone as a kid, because the internet wasn’t what it is now. We didn’t know that people like us existed. Now kids are able to see that their community exists, and that there are other people having that same kind of experience as them. I felt so alone in my experiences but now that I play music, I  know a bunch of other Asian women who play the guitar and play in rock bands. It’s just comforting, because we were robbed of it for so long, and now it’s so easy to find.A lot of our fans are young Asian girls, and they’ve expressed to me that they feel empowered by that experience. Mitski is a friend of mine, and it’s been powerful to watch her impact too. I just want to do a good job of being a powerful example for those girls. They’re my community and if I’ve been given this platform I have to use it for good.Explore Bon AppétitHealthyishKoreanMusicCelebritiesInterviewsRead MoreLifestyleThe Buddhist Temple Ingredient You Can Buy at CostcoBy Dakota KimRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-20", "author": ["Condé Nast", "Alyse Whitney"]}