{"id": "ee8816071ab872b645a9dfc1c6691fe7", "url": "https://www.bonappetit.com/recipe/butternut-squash-tarte-tatin", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Butternut Squash Tarte Tatin Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueButternut Squash Tarte TatinBy Claire SaffitzOctober 16, 20184.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintHold the apples, sub in squash for a delightfully earthy-sweet tarte tatin. Precooking the squash seasons and softens it, but don’t let it get dry or brown. The moisture it retains ensures it will be tender after baking and helps keep the caramel saucy.Ingredients8 servings6Tbsp. chilled unsalted butter, divided, plus more for pan1large butternut squash (about 3½ lb.)1cup plus 2 Tbsp. granulated sugar, divided¼tsp. kosher salt, plus more1Tbsp. fresh lemon juice1tsp. vanilla extract½Shortcut Puff PastryAll-purpose flour (for surface)1cup chilled heavy cream1Tbsp. powdered sugar½tsp. ground cinnamonPreparationStep 1Place a rack in upper third of oven; preheat to 350°. Butter a 10\" springform pan or cake pan and line bottom with a parchment paper round. Cut off neck from squash. Peel neck and bulb until you reveal the orange flesh underneath (you might need to take off a few layers). Slice both pieces in half lengthwise; scoop out seeds. Slice all squash pieces crosswise ¼\" thick. Arrange on a rimmed baking sheet. Melt 3 Tbsp. butter in a small saucepan and drizzle over squash. Sprinkle with ¼ cup granulated sugar\nand a pinch of salt and toss to coat. Arrange squash in a single layer (use a second rimmed baking sheet if needed) and roast until tender and just starting to curl around the edges but not yet browned, 30–35 minutes. Let cool. Carefully move oven rack to highest position and increase oven temperature to 400°.Step 2Meanwhile, cut remaining 3 Tbsp. butter into pieces and set aside. Bring lemon juice, ¾ cup granulated sugar, and 3 Tbsp. water to a boil in a large saucepan over medium-low heat, stirring with a heatproof rubber spatula until sugar is dissolved. Continue to cook, swirling pan often (do not stir), until caramel is light amber in color, 6–8 minutes. Remove from heat and add reserved butter a piece at a time, stirring after each addition until incorporated and smooth. Once all the butter has been added, stir in vanilla and remaining ¼ tsp. salt. Pour caramel into prepared springform pan and tilt to coat bottom. Let cool.Step 3Starting with slices from the neck, layer squash in an overlapping rosette pattern over caramel.ChevronChevronStep 4Sprinkle with 1 Tbsp. granulated sugar. Arrange remaining squash over first layer, placing pieces wherever needed to create an even thickness of squash across entire tart (this layer doesn’t need to be pretty since it won’t be visible).Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 5Sprinkle with remaining 1 Tbsp. granulated sugar and chill while you roll out the puff pastry.Step 6Let pastry sit at room temperature about 4 minutes to soften slightly. Roll out on a lightly floured surface, dusting with more flour as needed to prevent sticking and rotating a few times, to a round that’s a little over 11\". Using pan as a template, trim excess dough to make an 11\" round. Using a fork, prick pastry in 12–15 places. Drape pastry over squash and use a spoon to tuck edges in slightly between squash and sides of pan.ChevronChevronStep 7Bake tarte Tatin 20 minutes. Reduce oven temperature to 350° and continue to bake until pastry is puffed and golden brown, 45–50 minutes. Transfer to a wire rack and let cool in pan 10 minutes.Step 8If using a springform pan, remove ring and carefully invert tarte Tatin onto rack (take care as some of the hot caramel could drip). If using a cake pan, set rack upside down over pan and invert tarte Tatin onto rack. Let cool 20 minutes.Step 9Meanwhile, whisk cream in a small bowl to soft peaks. Beat in powdered sugar and cinnamon.Step 10Serve tarte Tatin warm topped with dollops of cinnamon whipped cream.Step 11Do Ahead: Tarte Tatin can be baked 10 hours ahead. Store loosely wrapped at room temperature. Reheat in a 250° oven.How would you rate Butternut Squash Tarte Tatin?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI agree with the other review that the caramel needs tweaking. I added a half vanilla bean and entire zested orange to the caramel after the butter was incorporated and that helped a lot. It just needs more zing! Otherwise lovely. Anonymous11/28/2019Very good - but needs some tweaking.  \nMagazine make-ahead suggested you could make the squash and caramel ahead and then bake day of.  NOT a good suggestion.  Hard caramel oozed when refriegerated.  You can make the squash in advance - and then assemble and bake day of.  Squash/caramel needs more flavor.  Will add rum or brandy next time and maybe more vanilla and lemon juice.  AND I don't suggest using rough puff - I will use pate brissé or your favorite pie crust next time.  It was chewy and the texture of a pie crust would be preferred. AND it turned out suprisingly thin, given the large squash.  It will only serve 6.  Have photo. Looks nice! AnonymousBoston area11/2/2018Explore Bon AppétitTartDessertFrenchEuropeanButternut SquashSquashVegetableCinnamonHerbs & SpicesPuff PastryOther IngredientsFallBakingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Claire Saffitz"]}