{"id": "ee9c93378545c44a562a4d3a147056ef", "url": "https://www.bonappetit.com/story/never-fail-marinated-olives-new-years-eve", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "These Marinated Olives Are Better Than Any New Year’s Eve Kiss | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Marinated Olives Are Better Than Any New Year’s Eve KissI don't know where I'll be on New Year's Eve, but I know I'll be eating these marinated olives.By Emily SchultzDecember 28, 2018FacebookTwitterEmailPhoto by Heidi's Bridge, styling by Molly BazFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.There’s a lot of hype around New Year's Eve. Old habits (supposedly) give way to resolutions. Filmmakers organize the climax of movies around ball drops and choruses of “Auld Lang Syne.” When I was 17, I got asked to senior prom—very awkwardly—on New Year's in my friend Lexi's living room. But these days, my year-end traditions are less grandiose. All I'm looking forward to is plenty of sparkling wine, a good sequined top, and these marinated olives with feta—the snack to end all snacks (or, at least, the best snack to end the year).Here's my recipe for a great night. In typical New York City fashion, around two weeks before the 31st, your best friend, your colleague, your roommate’s boyfriend, and the girl from your yoga class will all send competing Google Calendar invites for their respective New Year’s parties, which all happen to be conveniently spread across the city. You don't know which one(s) you'll go to. You don't know who you'll go with, or how you'll get there. But it doesn't matter, because you know you'll be bringing these marinated olives, the easiest snack on the planet to throw together.It's beyond simple. First, you smash some Castelvetrano olives (the best olives) with the back of a knife, which breaks them open enough so that the olives will absorb the marinade and the pits will release more easily later on. Then you smash and peel three three garlic cloves, too. (You know what people say about not eating garlic if you’re planning on kissing someone? Well, that rule doesn't matter if both parties are eating garlic, so the best place to look for a New Year’s kiss just might be right by this olive app.) Then, you’re going to use a vegetable peeler to remove the zest from a lemon in wide strips, which will release their oils when cooked and give the whole dish a subtle, citrusy note. You throw all of those things into a pan with half a cup of olive oil and some red pepper flakes, then turn on the heat and let the mixture warm up for about 5 minutes, just until the garlic starts to sizzle and brown around the edges.It's a holiday, so spring for the (slightly more expensive) feta in brine—the best feta, if you ask us.\nWhile the olives are getting their fancy olive oil bath spa treatment, you break feta into irregular, bite-sized chunks and place them in the bottom of a bowl or transportable vessel of your choice. We’re springing for the nicer feta here, the kind that comes in brine, rather than the dry, shrink-wrapped stuff. It’ll have so much more flavor and not an overwhelming amount of saltiness. Then the warm olive mixture gets poured over the feta, and bingo bango bongo, you've got a bowl of olive-y goodness that'll ensure the last night of the year is an unmitigated pleasure.This is a perfect snack to eat on it’s own, with some toothpicks for people who are weird about eating with their hands and a little dish for olive pits, but I like it best with a bunch of bread for soaking up the tasty, tangy marinade. (That bread also happens to be perfect for soaking up a bit too much sparkling wine, just saying.) And there you have it folks: a fancy-seeming appetizer that's super quick to make, easy to transport, and makes you look like you have your shit together a little more than that pre-sliced cheese plate would. It's like the song says: Make new friends, keep the old—but feed them all these marinated olives. Or something like that.What're you waiting for? Marinate some olives already!Marinated Olives and FetaAn appetizer you can have it ready within 10 minutes of walking in the door.View RecipeExplore Bon AppétitBasicallyNever FailFetaOliveappetizerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-28", "author": ["Condé Nast", "Emily Schultz"]}