{"id": "eeab344e12a9aa5094fdf837c9c69b74", "url": "https://www.bonappetit.com/story/broccoli-delight", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "My Broccoli Delight Recipe Won’t Be Censored Any Longer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Broccoli Delight Recipe Won’t Be Censored Any LongerIt’s the best thing I ever made (apparently), but no one would let me share it—until now.By Carla Lalli MusicMarch 28, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I have made the best dish of my life (so far), and my coworker refuses to publish it. Today, I take matters into my own hands.A few months ago, on a weeknight, I came home with some cheddar cheese left over from a Trader Joe’s shoot, and without thinking about it, paired it with a head of broccoli that was in the fridge.I was hungry, and I had cheese, and cheese goes with broccoli, and that’s all the inspiration I needed. Urgently, I started cooking without a plan. “Broccoli takes a while to cook,” I said to no one, “so I should get it going, no matter what happens next.”Want this letter before it hits the website? Sign up for our newsletter!Photo by Carla Lalli MusicI considered and rejected steaming, then simmering, because honestly who can even deal with bringing water to boil. I set my trusty 10” cast-iron skillet over a medium-high flame, then I turned to my cutting board and started butchering the broccoli. I separated the crown from the stalk, then cut the florets into big wedges. I trimmed and peeled the stem, then cut it crosswise into large coins. The pan was hot by now, so I drizzled in enough olive oil to coat, then added the broccoli, seasoned it with salt, and arranged it so the flat sides made contact with the pan.I brushed the loose bits of broc off of my cutting board and got going with the cheddar, an aged and very crumbly specimen. I broke about 4 ounces of it into ½-inch bits, scooted them back into a pile.I checked on the broccoli, which was developing a nice dark brown seared edge on one side and turning bright green and steamy on the top. Without even knowing what would happen next, I sprinkled the cheddar all over the broccoli. Immediately the cheese started to soften, and the pieces that tumbled onto the pan’s surface started to bubble and crisp. In a minute or two, the green broccoli hill tops were blanketed in melty cheddar and there were islands of cheese frico all over the pan.Photo by Carla Lalli MusicQuickly, I grabbed a plate and served myself some of the Broccoli Delight. “Is this a deconstructed broccoli gratin?” I asked the universe. I sprinkled some crushed red pepper flakes onto the broccoli and added a squeeze of fresh lemon. Did I just invent cruciferous cheese crispies, or is this just cheesy broccoli?These are existential questions, and Broccoli Delight is the answer. The next day I came to work and told everyone about it. Amiel Stanek, editor of Basically, was so taken with my tale that he asked me to write an actual recipe for Broccoli Delight. That was months ago. The recipe remains under seal. Amiel won’t answer my calls. I made it again last night and my child told me it’s the best thing I’ve ever made. I have made a lot of things for him. I feel the need to share. Broccoli Delight may be an unpublished recipe, but the exposé is here.Explore Bon AppétitCarla NewsletterBroccoliRead MorecookingFood Tastes Better When You Shop SmarterBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-28", "author": ["Condé Nast", "Carla Lalli Music"]}