{"id": "eeb7ac71fbfdd938850cd9566105467f", "url": "https://www.bonappetit.com/story/social-media-etiquette", "year": 2020.0, "month": 9.0, "day": 5.0, "content": "Social Media Etiquette: Is It Ever Okay…to Postpone Dinner While You Take a Photo? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay…to Postpone Dinner While You Take a Photo?Solicited advice about Instagram from Alex Beggs, who isn’t even very good at it.By Alex BeggsSeptember 29, 2020FacebookTwitterEmailIllustrations by Cari Vander YachtFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.How much can you edit a photo of a sandwich? —Tinkering TedOur social media team prefers barely a touch of editing to enhance the sandwich’s natural beauty. But I think we’ve double-tapped every sandwich out there at this point, right? Now we need ART. Amp that saturation till those folds of deli meats glisten. Tune up the warmth; I want to smell that toasted bun. Inch up the contrast until the lettuce has more definition than a dictionary. When it feels right, you’ll know. Post.Is it okay to post something if it looked really, really good but didn’t taste very good? —Superficial SullivanYES. Once you accept that Instagram is a performance space, an app for entertainment, decide which role you will play. Selfie savant. Eater of food. Fitspo quad killer. Parent of a three-month-old who will soon be a four-month-old. Meme Lord. They’re all unreliable narrators. Best to trust no one and nothing in general but especially on Instagram. Assume that any marble is vinyl contact paper. Suspect every pot pie of hiding something (ugh, turnips). Only then are you actually living in reality.Illustrations by Cari Vander YachtThe shot of an ice cream cone against a cool wall seems overplayed. What else can we shoot food in front of? —Background BernardVery large cowsSomeone’s air-drying bed sheetsAny novelty T-shirt but especially the tuxedo onesCheerleaders in full pyramidShiny elevator doorsA passing trainThe vast expanse of a human backIllustrations by Cari Vander YachtHow long can you make your friends wait to eat while you take the perfect shot? I hate myself at the time, but sometimes it takes a while. —Self-loathing Layla1.5 minutes.Any advice for getting the perfect food shot? I only have 1.5 minutes! —Blurry BenicioCrowd-sourced from people with WAY more followers than I:Get to a window or take it outside. Natural light above all.Overhead shots are the safest.Shoot on a neutral surface that isn’t too dark (so we can see the food clearly).Take a bite of food to make it more “lived in.”If your silverware is reflecting you taking your photo, move it.Always keep Instagram’s 4:5 ratio in mind, which really just means that you should shoot vertically.Add elements that give a sense of place or tell the story behind a dish (the grass you’re picnicking on, Grandma’s recipe card…).Illustrations by Cari Vander YachtCan I post a photo of plain cottage cheese eaten straight from the container? That’s what I ate today. —Zealous ZahraLarge or small curd? Just curious. I think large is better. If it will make you happy, post it.Are you obligated to share a recipe if you post a delicious pic of something you cooked? —Indifferent IraInstagram makes it cumbersome to share links for nonbusiness accounts, and even those are annoying (who likes the likeshop?). You should happily assume that if you cook something and share it, you’re inspiring someone else out there in the universe to make it too. Cool! Make it easy on them. Give them the info they need to find it on Google or write “GOOGLE ‘super moist chocolate mocha cake’ for the recipe!” in the caption.Illustrations by Cari Vander YachtIs it rude to comment, “This looks gnarly, but I’m sure it tastes GREAT!”? —Cheerful ChandlerOnce I posted a photo of a cherry pie with a cutout-hole crust pattern and was swarmed with angry commenters freaking out about their hole phobia being triggered. AAH LOOK AWAY, they screamed. GONNA FALL IN THE HOLE AND DIE, they all-capped. It’s a real thing. It’s called trypophobia. I thought the pie was beautiful!! I was kinda hurt, on behalf of the pie. People transfer their emotions to the food they cook, so when you call out the hideous plop of corn pudding on my plate, I’m immediately concluding you think I live a hideous, ploppy life. And maybe I do! You’ll certainly never find out from my Instagram! Save your criticism for the New York Review of Books and instead simply comment, “That looks delicious.” Just do that. For the love of God, please just do that.Explore Bon AppétitEtiquetteIs It Ever OkaySocial MediaRead MorecultureIs It Ever Okay…to Bring a Single Serving to a Picnic?By Alex BeggscultureIs It Ever Okay...To Hide Special Treats from Your Roommates In Isolation?By Alex BeggscultureIs It Ever Okay...to Bring 11 Items to the 10 Items or Less Aisle?By Alex BeggscultureIs It Ever Okay...to Fake an Engagement for Free Dessert?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-29", "author": ["Condé Nast", "Alex Beggs"]}