{"id": "eecb5f66d5fc744c47505e462d466939", "url": "https://www.bonappetit.com/story/carla-loves-turkey-burgers", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Stop Shaming Turkey Burgers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingStop Shaming Turkey BurgersFood director Carla Lalli Music shares why this recipe deserves its own night of the week in her newsletter.By Carla Lalli MusicSeptember 6, 2018FacebookTwitterEmailPhoto by Chelsie Craig, styling by Claire SaffitzFacebookTwitterEmailTalking turkey (burgers)Turkey Burgers are the Rodney Dangerfield of the recipe world: They can’t get no respect.They’re not smashburgers, and they’re not bar burgers. They don’t have the allure of a cheese-stuffed Juicy Lucy and you’d never organize a grill party around them. They’re not even juicy pork patties.That’s all true, which is why beef and pork exist.But there is one turkey burger in this world that deserves that headliner’s role, and it’s the one with “extra-juicy” in the title.This turkey burger is the antidote to every mean thing anyone ever said about all other turkey burgers. I’ve been collecting those insults for years now, and am prepared to counter them below. Point. By. Point.“Turkey burgers are dry.” —Desirée from DesertvilleI know why you’re saying that, Desirée. Turkey has less fat than ground chuck. In the context of a burger, fat equals juiciness. Remove the fat, remove the juice, right? Combine that with the fact that poultry has to be cooked well-done, and all of a sudden you’re on the Highway to Dry-way. Usually, yes. In this case: No. There’s half an avocado added to the ground meat, which adds fat, and also interrupts the protein’s ability to bind tightly to itself, which causes cause shrinkage and a loss of juices. Don’t worry about the science, just follow our advice. Amp up the fat, retain the juice.“Turkey burgers have no flavor.” —Barney from BoringtownWhat you mean is that they don’t have the same flavor as beef, and that’s both obvious and true. When cooking a regular, fatty beef burger, we would tell you to season it right before cooking with salt and pepper, which is all a beef burger ever needs. That advice is upended in this recipe, which treats lean, mild ground turkey the way it needs to be treated. Since you’re mashing avocado into the mixture anyway, that’s a great time to season it, too. This patty gets umami and southwestern vibes from the addition of Worcestershire sauce, garlic powder, cumin, and fresh onion, a profile heretofore known as Texmami-Mexi.“Turkey burgers are for dieting.” —Joan of NarcOkay, Joan: Let’s say you have no imagination and hate pleasure and simply replace marbled ground beef with ultra-lean ground turkey breast. That decision will reduce calories and fat, and it will also reduce enjoyment of food, thus defeating the purpose of eating. We’re not about that life. This dark meat turkey burger is a celebration of the fine work that fat does, and the joy it brings. There’s avocado in and on this one! There’s mayo in the patty and on the bun! There’s oil in the pan, ensuring a dark brown crusty sear, and there’s fat in the slaw, too. We didn’t put cheese on it, but we’re not going to picket in your driveway if you choose to add it at home (and in that case, may I recommend pepper jack?).“Turkey burgers are stupid.” —Brian BrainiacOh really? Did you see the mountain of slaw and the squishy bun??? Did you know there’s Sriracha mayo on it??? Why would you even say such a thing???? Claire Saffitz developed this recipe and she went to Harvard.NO MORE QUESTIONS.If you have more insults you feel like throwing around, it may be time to ask yourself where this prejudice comes from. Was it that one bad diner experience? That terrible crash diet you did in college? The ex-girlfriend who made you do Meatless Mondays for a year?We understand. And we fixed all that. It’s time to repair, forgive, and move on. If you’re still mad after you eat this burger... Well, you know where to reach me.Get the recipe already:Extra-Juicy Turkey BurgersTurkey burgers always sound like a great idea, but they too often taste like a fat sawdust patty. No more, friends! Mashing avocado into the turkey mixture helps prevent the meat from shrinking and drying out during cooking, which is why these stay awesomely juicy, even when they’re cooked all the way through.View RecipeExplore Bon AppétitCarla NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-06", "author": ["Condé Nast", "Carla Lalli Music"]}