{"id": "eed07810bf4f268bb564a68b8d8054d3", "url": "https://www.bonappetit.com/story/best-salad-spinner", "year": 2021.0, "month": 9.0, "day": 5.0, "content": "The Best Salad Spinners According to Bon Appétit Editors | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Salad Spinner Is Worth the GreenSay no to gritty, soggy salads!By Molly Baz and Ali FrancisSeptember 29, 2021FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Sure, even the best salad spinner essentially does only two things: wash and dry your leafy greens. But think about a pile of well-dressed romaine, an herby frittata, or glossy spaghetti with THREE bunches of garlicky kale. Those meals are not only Good For Us, they’re also some of life’s greatest pleasures—unless they’re seasoned with silt and grit, in which case, blech. So do you need a salad spinner? Yes. One thousand times yes.Because greens grow in the dirt, they tend to be covered in it—even by the time they’ve made it from field to fork. No matter how much yogurt-ranch you add to the bowl, sandy, gritty greens simply cannot be resurrected. But washing is only half the battle (or half the fun) because while dirty lettuce is gross, soggy lettuce is wan and joyless. Excess water weighs down the leaves and salad dressing slides right off, making for a particularly swampy-yet-bland eating experience. And while you could (and perhaps have at certain ill-equipped Airbnbs) tenderly hand dry every stalk of lacinato kale with a kitchen towel, a good salad spinner will prep your greens way quicker and easier. And the best salad spinner, the one our Test Kitchen swears by, is the Zyliss Easy Spin Salad Spinner.ZYLISS Easy Spin Salad Spinner$35 at AmazonThe principle behind most salad spinners is pretty much the same. To wash, add your greens to the basket and submerge them in the cold-water-filled bowl. Use your hand to swish the leaves around to loosen sediment, and then let them hang out for a few minutes so the dirt settles to the bottom. Pull the basket out of the water, marvel at how much grit has accumulated (wow!), then dump out the dirty water from the bowl and put the basket back inside.Now, the dry: Depending on your model of salad spinner, you crank a handle or push down on a knob, which causes the colander to spin round-and-round, propelling the water through the perforations and into the bowl and leaving your greens clean and dry. To go full Newton for a minute, what’s happening here is known as centrifugal force—a.k.a., the outward momentum created when objects (in this case: rinsed Bibb lettuce) are spun quickly around a central axis point. Pour off any water that’s accumulated, and then repeat until the leaves have nothin’ left to give.However, not all salad spinners are created equal. Efficiency and ease of use hinges on, as your yoga teacher likes to remind you, the little things. Can yours handle a honkin’ load of leaves? Do tender herbs get stuck in the basket? Does it feel like a wayward top during use? It can be tough out there for a greens-lover, which is why we’ve taken it upon ourselves to bring you our top pick and a few other solid contenders.Why is the Zyliss the best salad spinner?In our Test Kitchen, the Zyliss Easy Spin Salad Spinner is the hot commodity. While some salad spinners have you pushing down on a button repeatedly or whipping the basket around by a knob, this one functions like one of those old school hand-crank lawn mowers or chainsaws. The pull cord gives you maximum power for minimum work, as well as the quickest, driest spin. Bonus points for a brake button that actually performs, stopping the spinning mechanism in its tracks and leaving you with fluffed-up leaves ready to dress.There she is in action!\nTED CAVANAUGHThe Zyliss also boasts an impressive capacity that can hold up to six servings of salad, and the large-holed colander removes water faster than other brands without holding your herbs hostage. The clear outer bowl moonlights as a serving vessel and storage container for your salad greens (pop your spinner full of washed and dried collards right into the fridge until you need them), and the non-slip base grips your countertop and prevents wobbling while you’re busy spinning leaves. Not to mention, the whole system is made of BPA-free plastic, which, based on a whole host of terrifying research, is what you should be buying—always.What do I need to know about cleaning a salad spinner?The Zyliss comes with a dishwasher safe outer bowl, but the brand recommends rinsing the inner basket and both lids under water separately. For all other models, check the manufacturer instructions.I like to do my research before buying. Got any other salad spinner recommendations?Sweetgreen cofounder Nicolas Jammet, a guy who undoubtedly knows his leafy greens, loves the OXO Stainless Steel Salad Spinner for its non-slip ring, one-handed operation, effective braking system, and sturdy metal bowl. A small quibble: Unlike the clear plastic bowls, the stainless steel bowl makes it harder to quickly assess how dry your greens are.OXO Stainless Steel Salad Spinner$65 $52 at Amazon$65 at Bed Bath & BeyondAnother OXO product, the Good Grips Large Salad Spinner, is a favorite of our friends over at Epicurious. Much like the Zyliss, we love this one for its large capacity, super-stability, and ease of use. The eponymous good grips handle—that soft, push-button on the lid—features a pump mechanism instead of a pull cord. Deciding between them comes down to handling preference. You do you!OXO Good Grips Large Salad Spinner$26 at Amazon$31 at TargetFor design enthusiasts, the Meuller Salad Spinner looks like something you casually picked up at a garage sale in Vienna. With a five quart capacity, it’s about 20 percent smaller than the others but will still easily handle enough salad for four. The only major difference is the handle, which protrudes from the lid at 90 degrees and works like a horizontal bicycle tire pump. Oh, and it’s red!Mueller Salad Spinner$30 at Amazon$34 $30 at WalmartIf you’re a family of one or not really into salad but you love herbs, the OXO Little Salad & Herb Salad Spinner is for you. It functions just like the other OXO models but is both more adorable and takes up way less space in your kitchen.OXO Good Grips Little Salad & Herb Spinner$25 at Food52$26 at TargetSalad: It's what's for dinnerExplore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-15", "author": ["Condé Nast", "Molly Baz", "Ali Francis"]}