{"id": "eed258f87a36807610dadc4ac8bfa112", "url": "https://www.bonappetit.com/recipe/pineapple-upside-down-cake-2", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Pineapple Upside-Down Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssuePineapple Upside-Down CakeBy Cheryl DayOctober 19, 20214.4(14)Read ReviewsTriangleEmailPinterestPrintPhotograph by Christopher Testani, Food styling by Victoria Granof, prop styling by Alex BrannianEmailPinterestPrintEmailPinterestPrint“Upside-down cakes are such a joy to bake,” writes Cheryl Day in her newest book, Cheryl Day’s Treasury of Southern Baking. “It’s the surprise when you unmold the cake that makes them so satisfying.” For an instant upgrade to this retro classic, ditch the typical fire engine red maraschinos for sophisticated, fruity Luxardo cherries. Flip the cake while it’s still warm—but not hot!—for easy removal.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonLuxardo Maraschino Cherries$24 At AmazonMetal Baking Pan$22 At AmazonScale$25 At AmazonOffset Spatula$12 At AmazonSmall Saucepan$155 At AmazonMicroplane Grater$16 At AmazonSilicone Spatula$13 At BA MarketIngredients12 ServingsCaramel topping1cup (packed; 200 g) light brown sugar6Tbsp. unsalted butter1Tbsp. vanilla extract1tsp. Diamond Crystal or ½ tsp. Morton kosher salt115-oz. can pineapple slices, drained, patted dry8maraschino cherries (such as Luxardo), stems removed, patted dryCake and assembly2½cups (288 g) cake flour1Tbsp. baking powder1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt¼tsp. ground mace or freshly grated nutmeg3large eggs, room temperature1Tbsp. vanilla extract12Tbsp. (1½ sticks) unsalted butter, room temperature1½cups (300 g) granulated sugar1½cups sour creamPreparationCaramel toppingStep 1Place a rack in middle of oven and preheat to 350°. Place a 13x9\" metal baking pan by the stove. Cook brown sugar, butter, vanilla extract, and salt in a small saucepan over medium heat, stirring occasionally, until butter is melted and mixture is bubbling, about 5 minutes. Pour caramel into baking pan and spread to evenly coat bottom with a heatproof rubber spatula, nudging into corners.Step 2Arrange pineapple slices on top of caramel without overlapping. Place a cherry in the center of each pineapple ring. Set aside.Cake and assemblyStep 3Whisk flour, baking powder, salt, and mace in a medium bowl. Whisk eggs and vanilla extract in a small bowl.Step 4Beat butter and granulated sugar in the bowl of a stand mixer fitted with paddle attachment on medium-high speed until light and fluffy, about 4 minutes. Add egg mixture in 4 batches, beating on medium speed 30 seconds after each addition and scraping down bowl as needed. Reduce mixer speed to low and beat in dry ingredients in 3 additions, alternating with sour cream in 2 additions, mixing 30 seconds after each addition. Fold batter a few times with a clean spatula, scraping down sides to make sure everything is well mixed. Scrape batter into reserved baking pan; smooth surface.Step 5Bake cake until golden and a tester inserted into the center comes out clean, 40–50 minutes. Transfer pan to a wire rack; let cake cool in pan 15 minutes. Run an offset spatula along edges of cake to loosen. Set a large platter over pan and flip over to release cake; carefully remove pan. If any fruit or cake sticks to pan, scrape it off and press back onto top of cake. Serve warm or room temperature.Do ahead: Cake can be baked 3 days ahead. Store airtight at room temperature.Recipes adapted with permission from ‘Cheryl Day’s Treasury of Southern Baking’ by Cheryl Day (Artisan Books). Copyright © 2021.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Pineapple Upside-Down Cake?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleWill make it again!  \n\n\nAnonymousAnchorage, Alaska2/25/2022The cake part was truly delicious and moist, but the canned pineapple was a bit flavorless and no tang; I think I will try fresh pineapple next time.Anonymous1/12/2022We have been making our version of this cake in our 12\" cast iron skillet for the past 30 years, as did my my mother-in-law before us. It has always released onto our big, round platter.BryanMilton, Wi11/4/2021Mace! The secret ingredient in this old fashioned cake.  So glad to see this included.AnonymousWenonah NJ10/26/2021Explore Bon AppétitCakeDessertPineappleFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Cheryl Day"]}