{"id": "eedc683cf97fde69d4132631f352cfaf", "url": "https://www.bonappetit.com/recipe/chicken-and-tomato-stew-with-caramelized-lemon", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Chicken and Tomato Stew with Caramelized Lemon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueChicken and Tomato Stew with Caramelized LemonBy Andy BaraghaniJanuary 9, 20184.7(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Emily EisenEmailPinterestPrintEmailPinterestPrintCooking lemon slices to almost-burnt adds a layer of complex flavor to this comforting dish. Cinnamon's sweet, earthy flavor tames tomatoes' juicy acidity. Apply this same thinking to other baking spices like nutmeg and cloves.Ingredients4 servings Stew4chicken legs (thigh and drumstick)Kosher salt2tablespoons extra-virgin olive oil1large onion, thinly sliced6garlic cloves, halved2tablespoons honey1tablespoon tomato paste¾teaspoon ground turmeric½teaspoon ground cinnamon114.5-ounce can whole peeled tomatoes, preferably San Marzano3cups low-sodium chicken brothCaramelized Lemon and Assembly1lemon1½teaspoons sugar2tablespoons extra-virgin olive oil1tablespoon toasted sesame seeds½cup torn mintFlatbread (for serving)PreparationStewStep 1Pat chicken dry and season with salt. Let sit at room temperature at least 15 minutes and up to 1 hour ahead (or cover and chill for up to 24 hours).Step 2Heat oil in a large Dutch oven or other heavy pot over medium-high. Cook chicken, adjusting heat as needed to avoid scorching, until deep golden brown on both sides, 10–12 minutes. Transfer chicken to a plate, leaving drippings behind.Step 3Add onion to pot and cook, stirring often, until softened, 6–8 minutes. Add garlic and cook, stirring often until onion begins to brown around the edges, about 3 minutes. Stir in honey, tomato paste, turmeric, and cinnamon and cook until fragrant, about 2 minutes. Add tomatoes and juices and smash tomatoes with a wooden spoon until pieces are no larger than 1\". Return chicken to pot, pour in broth (it should barely cover chicken), and bring to a simmer. Reduce heat to low, mostly cover pot with lid (to allow steam to escape), and gently simmer until chicken is tender and juices thicken, 70–80 minutes.Caramelized Lemon and AssemblyStep 4Meanwhile, trim the top and bottom from lemon, perch on a flat end, and cut lengthwise into quarters; remove seeds and white pith in the center. Thinly slice quarters crosswise into quarter-moons. Place in a medium skillet, pour in water to cover, and bring to a boil. Cook 3 minutes, then drain and pat dry with paper towels. Transfer to a small bowl; sprinkle with sugar and toss to coat.Step 5Wipe out skillet and heat oil over medium-high. Arrange lemon pieces in a single layer in skillet. Cook, turning halfway through, until deeply browned in most spots, about 3 minutes. Transfer back to bowl and season with salt.Step 6Ladle stew into bowls and top with caramelized lemon, sesame seeds, and mint. Serve with flatbread.Step 7Do Ahead: Stew (without mint) can be made 3 days ahead. Let cool; cover and chill. Add mint just before serving.How would you rate Chicken and Tomato Stew with Caramelized Lemon?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleThis recipe was DELICIOUS! An incredible depth of flavor. I was worried given the small amount of spices, but the stew was incredibly flavorful and complex. I used large skinless drumsticks because that's what I had, and half of a 28 oz can of tomatoes. The lemon was still bitter, but I liked it. I served it with brown rice. Will definitely be making again!Anonymous5/8/2020Very good recipe!  While I do love the addition of lemon, I did get some bites that were bitter than others.  I think if you sliced the lemons very thinly, you might be able to avoid that.  I only had a 28 oz can of tomatoes so I upped the spices to 1 tsp of turmeric and 3/4 tsp of cinnamon.  Amazing flavor, will serve the leftovers over rice pilaf to soak up the tomato juices.se27Boston, MA4/2/2020Unpopular opinion. Unlike other BA recipes- my husband and I really hated this. Smelt like a broiler. The lemons tasted like an Indian pickle. And unbelievably heavy. I’m pretty sure I made it right but this is a big no for me.EshaChatDubai3/22/2020This ruled. I used a full 28 oz can of tomatoes (that’s the only size I found with whole/peeled) and it all worked out great. I followed the recipe to a T past that. Use a nonstick for the lemons, they add a ton of really great flavor! AnonymousDenver12/24/2019It was just so delicious with cinnamon and turmeric mix 😍😍Caramelized Lemon and the mint  are the best company for this recipe!Definitely will do this again.milkywayyGermany12/8/2019Wow, this was so amazing and delicious. The flavor! I served this with warm flat bread and made it exactly as written (I usually do the first time through a recipe). This is good food. It reminded me a bit of a delicious Moroccan cornish hen tajine that I had once, with all the rich flavor, spices, and sauce.\n\nI salted my chicken the night before. I had untoasted sesame seeds, so I toasted them in a small skillet while the stew cooked. Next time I'll slice the lemons a bit thicker - I sliced them pretty thin, and they didn't hold up to the boiling and caramelization. I basically had little rinds left at the end (still delicious though). There is so much good sauce! I might make some plain couscous tomorrow to soak up some more of the sauce along with the flat bread, but it's perfect just the way it is. I will definitely be making this again, soon!lifeis_shortLos Angeles, CA8/16/2019Yes Of Cos! I hv cooked this dish a few times now, and everytime it was loved by all!\nJust wondering if i wana increase the quantity of the chicken legs to (say) 10 chicken legs, do i have to increase the amount of the ingredients as well? And by how much?AnonymousSingapore8/13/2019Absolutely delicious! Don't skip the lemons. Very easy to put together and comes together beautifully :) Tasha.SpitzerMaui5/7/2019Saw Andy making this recipe on the BA's YT channel, and thought \"hey, this looks like a easy to put together recipe!\" \n\nIndeed, very simple to put together, needs only a few easily obtainable ingredients. Most of the time is spent simmering the stew. Paired it with store-bought pita bread.\n\nNot sure about the caramelised lemons; maybe I cut them too thick, maybe my lemons were just too bitter. Even after cooking them and caramelising them, there was still that cutting bitterness that spoilt the taste for me. Thinner bits tasted nicer; maybe my cut was too thick.\n\nOverall, great easy recipe, would make again. AnonymousSingapore4/14/2019Outrageously delicious, Andy. You outdid yourself. Easy enough to make on a weeknight (if not in a rush), but fabulous enough for company any day of the week. Crazy About AndySouth Florida4/14/2019Wow, great flavors without a lot of different spices! I'll probably serve with rice or potatoes next time as the flatbread was very messy but will definitely make again.AnonymousStockholm, Sweden4/13/2019This was just FANTASTIC - I wanted to switch it up a little by adding some fennel seed, and I think the deep sweetness really brought an extra dimension. Was suspicious about the caramelized lemon but it's a MUST. Adds just something else. Really great recipe, pretty sure it's going into my regular rotation! aboliIndia4/11/2019Protip: save the lemon caramelization  part for your non stick. I see at least one person had an issue and not sure why you would use anything but.\n\nRegardless...the lemons actually are an integral part of the flavors and well worth it. I skipped the sesame seed but everything else by the note, with the addition of fresh cilantro stems and some leaves at the end.\n\nThis sauce is beautifully developed and warm, but not in a spicy sense, but as in, it makes your mouth water for the 90 minute braise. I brought it to a simmer and into a 350f oven for 90 in my 5 at Dutch oven, with the lid tilted a bit.\n\nAs someone who loves to make developed long cook curries, was all too tempting to add some chilies, ginger, etc, but held out to try the recipe as is. I'm happy with it. Very.\n\nI would suggest learning [if you're not familiar with already] break down a 3.75-4 lb whole chicken so you can do the leg/thigh in one piece and save the breasts for something else, as they dont braise well after 45 minutes, and just not a slow and low cut as it is.\n\nDont be afraid to sub out mint for basil, it's all the same strain, but mint would be the more regional/authentic herb. \n\nI'll be working some chickpeas into this perhaps...or working in some tweaks here and there. \n\nOverall: 4.75 star recipe. Very happy.MK_UltraNew Hampshire4/8/2019Loved it! The caramelized lemon was a little tricky--because they were coated in sugar I had trouble with them sticking to the pan; I think more oil will remedy that for next time. Delicious flavors, and even reminded me of my mom's braised chicken (my favorite)! Well done, Andy. AnonymousSeattle4/7/2019Very good, and I'd definitely make it again. This is a great rainy spring or cold fall meal. My market didn't have whole chicken legs or mint, so I used chicken thighs and basil as substitutes. The chicken was very tender, and I wouldn't blame someone if they picked up their bowl to drink the remaining sauce at the end of the meal.\n\nThe only thing my wife and I weren't completely sold on was the way the caramelized lemon was added to the dish—the bitterness of the pith was overpowering even after boiling and frying. When I make this again, I'll cut a lemon in half, sprinkle a bit of sugar on the cut halves, and fry them cut-side-down in olive oil. I'll include the lemon on the plate as a garnish, and the diner can choose how much of the grilled/caramelized juice they'd like to add. The flavor of the caramelized lemon is necessary for balance in this dish but the bitterness is not, and I think this approach would work better.AnonymousSaratoga Springs, NY4/6/2019Explore Bon AppétitStewSoups and StewsChicken LegChickenPoultryCanned TomatoTomatoVegetableLemonCitrusFruitWinterMainDairy-FreeGluten-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}