{"id": "eedface9dabc52c98fbfdfa793193511", "url": "https://www.bonappetit.com/story/st-agrestis-boxed-negroni", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "St. Agrestis Boxed Negroni Is My Generation’s Franzia | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Boxed Negroni Is My Generation’s FranziaI celebrate and curse the day St. Agrestis put cocktails in a box.By MacKenzie Chung FeganSeptember 28, 2020FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I grew up in a Cheap Wine household. It wasn’t that my dad didn’t like the good stuff, but on a Tuesday night an $8 bottle of supermarket Zinfandel did the trick. And even though he had a wine cellar full of Two Buck Chuck—and by “wine cellar” I mean a hot hall closet cluttered with off-brand liqueurs that were on special at BevMo—he instilled in me a prejudice that lasts to this day: In this house we do not drink boxed wine.So it was with some hesitancy that I tried Brooklyn distillery St. Agrestis’ latest offering—boxed Negroni. Would the ghost of George Fegan haunt my happy hour? Three-quarters of a box later, there’s no sign of his displeasure, and I’m a boxed cocktail convert.St. Agrestis, a pioneer in the small-batch American amaro trend, released its eponymous amaro in 2014. A few years later it launched Inferno Bitter—a red aperitivo akin to Campari but with even more of a bitter bite—along with single-serving Negronis. The pre-batched cocktail combines Inferno Bitter with Greenhook Gin and house-made vermouth and comes in adorable bottles perfect for the park or smuggling into a movie theater. For the boxed version, St. Agrestis gave its Negroni the Costco treatment. Each box contains 60 ounces of cocktail packaged in a plastic bag inside a spigoted box about the size of a babka. It’s as good a Negroni as I could make at home—bittersweet and complex with herbaceous notes balanced by warm vanilla and citrus. At 24% ABV, it’s also bracingly boozy, so even though I store the box in my refrigerator, I drink it over ice for a bit of dilution, sometimes even topped off with a splash of soda.Both the best and worst thing about boxed Negroni is how terribly convenient it is. Like a frozen pizza bagel, Negroni in a box is a Negroni you can have anytime. As far as problems go, this is a good one to have—but during a global pandemic, I’m not sure I needed drinking to be more accessible. In normal times, the 20-serving box would be fantastic for a party, relieving the host of bartending duties. But there are no guests to help me work through more than a magnum’s worth of straight booze, and I don’t live in a big co-op where lentils and nutritional yeast and cocktails are bought in bulk. When I open my fridge to contemplate dinner or forage for a cheese snack, the purple-and-yellow St. Agrestis box is there and a Negroni is only a squeeze of the spigot away. I’d like to say that I at least go to the trouble of peeling an orange for a garnish, but my Old Man didn’t raise a liar.KARL BISCHOFFSt. Agrestis Boxed Negroni$60 at Astor Wine & SpiritsExplore Bon AppétitHighly RecommendCocktailNegroniGinproductShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-28", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}