{"id": "eefc47c662eca4a0b3653bd9f518c8dd", "url": "https://www.bonappetit.com/story/white-pepper", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "What is White Pepper, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat is White Pepper, Anyway? Black pepper sheds its coat. By Emma WartzmanJanuary 23, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Yekaterina Boytsova FacebookTwitterEmailWhen you think about the ubiquity of black pepper—always in a shaker next to the salt—it’s funny that white pepper feels somewhat elusive, especially considering that it’s common in East Asian and some European cooking. It’s a traditional seasoning for congee, it's the source of heat in hot and sour soup, and it camouflages into pommes purée and béchamel.White peppercorns and black peppercorns both begin as the same berry on the same pepper plant. Yep, that’s right: They’re a fruit! In fact, the lesser-known green and red peppercorns come from that same plant, too. Green peppercorns are harvested early in the season, in January, whereas red ones are harvested several months later, in March and April. For the sake of this article, we’ll focus on black and white, both harvested in the middle of the season but treated so that they have quite distinct tastes. (Pink peppercorns come in from left field: They grow on an entirely different plant but due to their similar taste, shape, and size, have the same name.)Black peppercorns are dried as soon as they’re picked. Their skin becomes black and shriveled  (look closely at whole black peppercorns—they’re super wrinkly). The taste is quite biting—spicy but not necessarily hot. Use enough of it and it’ll make your mouth tingle.So wrinkly, like miniature prunes. \nPhoto by Chelsie CraigWhite peppercorns, on the other hand, are soaked before they’re dried so that that outer layer comes off. The surface underneath is smooth and, yes, white. “The taste is brighter and sharper and more herbaceous than black pepper,” says chef, author, and spice expert Lior Lev Sercarz. “Some varieties even have a little bit of a piney, resin-y aroma.”That being said, white peppercorns can be poorly processed, meaning that they’re packaged before all of the water has evaporated. When that happens, they develop a slightly fermented, barnyard-y flavor, which only increases the longer they sit.In order to find the best-tasting white pepper you can, Sercarz recommends researching your source. But if you don’t have a specific purveyor you love, there are some things to look out for: The color should be a creamy white—not beige, but also not bleach white (sometimes sulfur or other chemicals are added to make the peppercorns look extra bright). Their size should be as uniform as possible, with no visible specks of gray or black. And a mention of origin on the label is also a good sign.Once you have a jar (for the freshest flavor possible, we recommend buying whole peppercorns, then grinding them yourself), try adding it to marinades, soups, stews, and stir-fries. It pairs particularly nicely with pork, but will bring an earthy heat wherever you put it.“When it’s good, it’s really good,” Sercarz says. “There’s sadly not enough awareness of pepper in general. We had the salt revolution a few years ago. Perhaps pepper will be next.”Get the recipe:Pork and Shiitake CongeeSince congee can take hours to make on the stovetop, we came up with a clever trick: Rinse the rice and freeze it overnight. View RecipeExplore Bon AppétitPeppercornWhite PepperRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-23", "author": ["Condé Nast", "Emma Wartzman"]}