{"id": "ef1c4a9c69a779c49aeae833e74d8530", "url": "https://www.bonappetit.com/recipe/fried-fish-sandwiches-with-cucumbers-and-tartar-sauce", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Fried Fish Sandwiches with Cucumbers and Tartar Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueFried Fish Sandwiches with Cucumbers and Tartar SauceBy Chris MoroccoMay 22, 20184.4(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris MoroccoEmailPinterestPrintEmailPinterestPrintFrying at home is a drag, unless you happen to be outdoors, holding a beer, and not worrying about spills or smelling up the house. That’s right: we’re frying on the grill. For the best results for this fish sandwich recipe, use hake, pollock, or cod.Ingredients4 servingsTartar Sauce½cup mayonnaise¼cup finely grated lemon zest2Tbsp. fresh lemon juice2Tbsp. sweet relish1Tbsp. chopped drained capers1Tbsp. Dijon mustard1small garlic clove, finely gratedKosher saltFish and Assembly2Tbsp. Old Bay seasoning1tsp. baking powder1tsp. cayenne pepper¾cup all-purpose flour, divided¾cup cornstarch, dividedVegetable oil (for frying; about 6 cups)5–6mini seedless or Persian cucumbers (our favorite!)⅓cup seasoned rice vinegar8potato rolls2Tbsp. unsalted butter, melted1large egg, beaten to blend¾cup light beer84-oz. pieces skinless, boneless firm whitefish fillets (¾\"–1\" thick)½cup very coarsely chopped dillKosher saltLettuce leaves (for serving)Special EquipmentA deep-fry thermometerPreparationTartar SauceStep 1Mix mayonnaise, lemon zest and juice, relish, capers, mustard, and garlic in a small bowl to combine; season with salt.Fish and AssemblyStep 2Prepare a grill for medium-high heat. Whisk Old Bay seasoning, baking powder, cayenne, ½ cup flour, and ½ cup cornstarch in a medium bowl. Whisk remaining ¼ cup flour and ¼ cup cornstarch in another medium bowl.Step 3Set a deep cast-iron skillet or large Dutch oven fitted with thermometer on grill; pour in oil to come 1\" up sides. Heat until thermometer registers 375°.Step 4Meanwhile, thinly slice cucumbers lengthwise. Toss in a third medium bowl with vinegar and gently massage with your hands to soften them slightly. Let sit, tossing occasionally, at room temperature at least 10 minutes.Step 5Lightly brush insides of rolls with butter and grill just until toasted, about 30 seconds. Transfer to a plate.Step 6Gently whisk egg and beer in a small bowl to combine, then gently whisk into Old Bay mixture in 3 additions. Working in 2 batches, season fish lightly with salt. Dredge in flour mixture, knocking off any excess, then dip into batter and lift up with a fork, letting excess drain off and wiping against side of bowl to eliminate any thick drips. (Batter should completely coat the fish without looking clumpy.)Carefully lower fish into oil and fry, turning halfway through, until deeply browned and an instant-read thermometer inserted into the thickest part of each piece registers 125°–130°, 7–9 minutes. Using a slotted spoon, transfer to a wire rack set inside a baking sheet.Step 7Drain most of vinegar from cucumbers and toss in dill. Build sandwiches with fried fish, cucumbers, lettuce, and tartar sauce.Step 8Do Ahead: Cucumbers (without dill) can be pickled 2 days ahead. Cover and chill.How would you rate Fried Fish Sandwiches with Cucumbers and Tartar Sauce?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleAbsolutely delicious, a huge hit all around.  The batter is so light and crispy from the cornstarch and beer.  I could only find the hot version of Old Bay, so I left out the cayenne and put out some hot sauce if anyone wanted to add extra heat.  Used shredded cabbage instead of the lettuce, and added avocado.  We absolutely loved it!\nTo the person who mentioned not being able to find hake, pollock or cod, they are more commonly found on the east coast of the US.  While I personally prefer cod, you could probably use halibut or even tilapia for this dish with good results.Miriam GrossNJ8/19/2019I don't love battered fish, I much prefer a simple breading, but this was spectacular. The tartar sauce is what all tartar sauce should strive to be. The pickles are exceptional on this kind of sandwich, and the fish itself is incredible. I used thick cod filet and PBR as my beer. I'll definitely make this again.charles_wesley_pitNorth Carolina6/16/2018Outstanding. We used fresh cod & subbed a local IPA for the light beer.  Frying on the grill is genius! Audra NicholeOregon6/3/2018This looks good except that (and maybe I'm missing something) I don't see the kind of fish in the recipe.Anonymous6/1/2018What beer?Anonymous5/30/2018Explore Bon AppétitSandwichCucumberVegetableCodFishSeafoodSummerEasyWeeknight MealsMainFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Chris Morocco"]}