{"id": "ef268c011ed6eaad7ae062d49004e458", "url": "https://www.bonappetit.com/story/what-is-a-waxy-potato", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "What Are Waxy Potatoes? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWTF Is a \"Waxy\" Potato?A waxy potato doesn't belong in Madame Tussauds.By Sarah JampelSeptember 12, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailHere’s a thought: Would life would be (just a tad bit) easier if, at the grocery store, potatoes were divided up into the “waxy,” “floury,” and “in-between” categories?If you’ve ever bought a couple of russets thinking you were going to make potato salad, or a pound of fingerlings thinking they’d make a really unique mashed potato situation… then you feel my pain. Waxy and floury potatoes are not interchangeable—your gloppy potato salad or gluey mash will have alerted you to that truth.But what do these categories even mean, which type is best for what use, and what common potatoes fall in each group?! And is there a kind of potato that will almost surely work in any situation?You have questions, and we have answers:WaxyNew potatoes, Red Bliss, pee wees, fingerlings! These potatoes, which are often small (and apparently, fun-named?), have thin, smooth skin and creamy, almost shiny flesh. They’re also known for their particularly potato-forward flavor. Because waxy potatoes are relatively low in starch and high in moisture, their cells stay intact when they’re cooked, meaning that slices or cubes hold up when boiled or baked.Waxy potatoes will hold their shape when boiled—and dressed with a ton of cheese and pepper.\nEva KolenkoThis makes waxy varieties the best choice for dishes where you want the potatoes to maintain their shape: Think potato salad, gratin, smashed crispy potatoes, cacio e pepe potatoes, or a tray of salt-roasted spuds.But beware: They won’t break down into a creamy spoonable mash, and they’re not great for that classic baked and butter-topped beauty.: The interior ofr a waxy potato is firm (even a bit squeaky) rather than fluffy or yielding.FlouryHigher in starch and lower in moisture than waxy potatoes, the floury varieties, like matte-skinned russets and Idahos, fall apart when boiled (the starches harden and expand, causing the skin to split and the interior to crumble into meal).Floury potatoes are starchy, which means they crisp up nicely in rosti and latkes.\n© 2015 Christopher TestaniThis fragility makes floury potatoes ideal for adding dairy-free creaminess to puréed soups or providing the elusive airy, whipped texture to a mash (though not alone: we favor mashing them with a waxier variety for optimal flavor). And since starchiness often translates into crispiness, floury potatoes are good candidates for roasting and frying: Use them in French fries, latkes, hash browns, or rosti for a delightfully crispy shell and creamy insides.In-betweeniesAnd finally, there are the “all-purpose” potatoes, which fall somewhere between the waxy and floury poles. If, by the number of times you’ve seen Yukon Golds in a BA recipe, you’ve guessed that these are our AP potatoes of choice, you are correct.Yukon Golds are our choice for Perfectly Roasted Potatoes.\nBen DeweySemi-starchy and semi-waxy, they’re simultaneously more plush than waxy potatoes and less crumbly than floury ones (which makes sense, since YGs are a cross between a starchy North American white potato and a waxier South American yellow one). Because they hold their shape when boiled, grated, or fried and yield to mashing, they’re incredibly versatile: Roast them, smash them, boil them, shred them into latkes, or break them down into creamy oblivion. What can’t this potato do?!In Molly Baz’s Slow-Roast Gochujang Chicken, baby Yukon Golds sizzle in the chicken fat that drips off the bird as it cooks: By the time the meat is fall-apart tender, the potatoes are buttery-soft. You can smash into the schmaltz without sacrificing their cute globular shape.Now that you can tell a waxy potato apart from a floury one, you’re destined for never-starchy potato salads and deep, dark hashbrowns. But when in doubt, Yukon Gold.Chicken and potatoes, a match made in heaven:Slow-Roast Gochujang ChickenThis isn’t the crisp-skinned, high-heat-roast chicken you’re probably familiar with. Instead, it’s a melt-in-your-mouth tender, schmaltzy, slow-roast version.View RecipeExplore Bon AppétitPotatoRusset PotatoYukon Gold PotatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-12", "author": ["Condé Nast", "Sarah Jampel"]}