{"id": "ef32c9e8ef22b63e62ef40dec2fdc2f0", "url": "https://www.bonappetit.com/recipe/tomatoes-simmered-with-cotija", "year": 2020.0, "month": 9.0, "day": 3.0, "content": "Tomatoes Simmered in Olive Oil with Cotija Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTomatoes Simmered in Olive Oil with CotijaSeptember 21, 20204.9(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Christian ReynosoEmailPinterestPrintEmailPinterestPrintIt seems like no one cooks tomatoes just a little bit. This dish is a compromise; it’s somewhere between a fresh tomato salad and a full-blown tomato sauce. Tomato slices are salted ahead and then set into a garlicky, somewhat spicy olive oil bath with Cotija, a dry-aged Mexican cheese. The tomatoes keep their shape but yield a jam-like texture. Soak up the infused olive oil and tomato juices with plenty of bread. Choose a platter that is the same size or a little larger than your pan so you can slide the simmered tomatoes onto it. If you have a cazuela that can be used on a stovetop, try it out and just scale down on ingredients to fit.Ingredients4 Servings2large or 3 small heirloom tomatoes (about 1 lb.)1tsp. Diamond Crystal or ½ tsp. kosher salt2large garlic cloves, thinly sliced½red Fresno chile or jalapeño, thinly sliced, loose seeds discarded⅓cup extra-virgin olive oil⅓cup pitted green olives (such as Picholine), coarsely chopped2Tbsp. chopped oregano2tsp. red wine vinegar1½oz. Cotija cheese, feta, or ricotta salata (salted dry ricotta), coarsely crumbledToasted or fresh bread of your choice (optional)PreparationStep 1Place a wire rack inside a large rimmed baking sheet. Core tomatoes by cutting out a small cone-shaped wedge from around stem. Slice tomatoes in half from top to bottom. Slice half of tomato halves ½\" thick. Slice remaining halves into ½\"-thick wedges. Set tomato pieces on prepared rack. Sprinkle on both sides with salt; let sit 10 minutes.Step 2Cook garlic, chile, and oil in a large high-sided skillet over medium-low heat, stirring until fragrant, about 2 minutes. Add tomatoes, one at a time,  into a snug single layer with little overlap (like filling a fruit tart). Leave out any that don’t fit. Scatter olives over top of and in between tomatoes. Increase heat to medium-low so oil is simmering very lightly, cover, and cook 2 minutes. Uncover and sprinkle oregano over tomatoes. Cover again and cook tomatoes until warmed through and very fragrant but not falling apart, 3–5 minutes more.Step 3Remove pan from heat; set a platter that is the same size as the pan beside it. Lift pan and tilt so tomatoes, along with any liquid, slide out onto platter. Drizzle with vinegar and top with crumbled Cotija. Serve with bread, if using, for soaking up tomato juices.How would you rate Tomatoes Simmered in Olive Oil with Cotija?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleI can't wait for heirloom tomato season to come back around so I can make this again...WOW!Tim TLos Angeles, CA6/3/2021Turned out great! Didn't have cotija, so I used a mixture of queso fresco and feta. I used fresh oregano from the farmers market and it was almost overpowering. Not mad about it, but I might use 1T next time. I agree with some commenters that 1/4 cup olive oil would probably suffice for this dish. I served it on a bed of quinoa and fresh arugula on the side. Ski DaddyDenton, TX5/20/2021Omg wow. I want to make this tomorrow and any day, every day. Didn’t have olives so I used small capers. Perfect. Ate it tonight with crusty toast and orzo al limone. HannahSeattle, WA5/12/2021BOMBBBBBBBBB!!!! I def used to much spice and definitely didnt have the proper cheese, still just as good. Soak Soak Soak dat goo up with that bread!AnonymousBerkeley 10/2/2020Made this recipe mostly as written, but I used a thinly-sliced shallot instead of the chile, used half green and half Kalamata olives, and parsley instead of oregano. I combined the cooked tomatoes with meatballs and served over a little pasta. I used Feta, my husband used Parmesan. It was restaurant quality - a superb dish!AnonymousLouisiana10/2/2020Made this pretty much as is and it's delicious! Found some ripe farmer's market heirloom tomatoes for this. I think I used maybe only 1/4 cup of olive oil just to lessen the calories a bit and it was fine. Used fresh feta cheese and some flaky sea salt at the end.  You could probably substitute basil or parsley for the oregano but the fresh oregano was really nice in this dish. Served with toasted bread. This would make a delicious and pretty appetizer for a party or I made it for a light lunch for 2 people. Will definitely be making again!AnonymousSan Diego, CA10/2/2020\"Serve with bread, if using...\"  Who wouldn't be using bread/tortillas or something to enjoy the soppings?Anonymousboise9/28/2020Well slap my forehead and call me Nobody, 'cause I lightly cook tomatoes quite frequently. One favorite, similar but much easier than this recipe, is Huevos a la Mexicana. Saute onion in olive oil, push that to the side and break a few eggs, salt and pepper and sorta scramble the whole skillet with a fork. Add chopped jalapeno or serrano and give it a minute. When the eggs are about set, add chopped tomato and scrape around with a spatula so the tomato moisture releases any stuck egg bits, then slide it all onto a plate and consume with a warmed Sonora-style tortilla (lard-based, thin and translucent enough to use for a window). Another favorite is Italian stir-fry: Into a skillet with olive oil shimmering, add coarse-chopped zucchini or crookneck and give it a minute. When the skillet is once again good and hot add thick-sliced red onion and give it another minute. Jalapeno added at this stage is good, as is a sprinkle of Italian herb mix (dried) and/or garlic.  Salt and pepper. When the onion gets to tender-crunch stage, add chopped tomato and give it half a minute. Remove from heat, add torn basil leaves and serve (with fava beans and a nice chianti).  A third fave is smoked-salmon puttanesca. But snark aside, I do look forward to trying your olive-cotija mix if the garden ever gives me tomatoes. Salud, amigos!TroutappleTucson9/26/2020Explore Bon AppétitTomatoVegetableOliveOther IngredientsCotijaCheeseSummerFallQuickEasySideStarterNut-FreeVegetarianGluten-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-21", "author": ["Condé Nast"]}