{"id": "ef3d920ec221f1c98052a81927c89a30", "url": "https://www.bonappetit.com/story/the-cyclists-wine-guide-to-the-niagara-region", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "The Cyclist’s Wine Guide to the Niagara Region | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredThe Cyclist’s Wine Guide to the Niagara RegionBy Destination Canada/Tourism Partnership of NiagaraOctober 2, 2018FacebookTwitterEmailPHOTOS BY SUECH + BECKFacebookTwitterEmailOn the surface, there’s certainly plenty to love about Canada’s lush Niagara Region. Verdant and green, orchards and vineyards extend in every direction. In the distance, the fast-moving waters that plunge over Niagara Falls crash down with awe-inspiring, ferocious intensity. But much of what makes this green corner of the world special is actually underneath it. Translation: The soil here is special. Although the wine industry in the Niagara Region is relatively young—serious winemaking here dates only to the 1980s—the area is smack-dab in the middle of an ancient glacial plain, which over thousands of years has enriched the soil with pockets of different minerals and nutrients. This means that the terroir of one vineyard can wildly differ from another’s just down the road. In other words, if you’ve tasted one Niagara wine, you most certainly have not tasted them all.The natural forces that produce Niagara Region’s great wines also make for breathtaking natural scenery, which is why the best way to experience it is on a bicycle. The country roads that link some of the area’s best wineries are relatively flat, so cycling between them is a breeze. If you’re worried about drinking and biking, don’t be: Responsible cyclers either take modest sips or learn how to spit, which when done properly, can actually help you taste wine better. Plus, if you really dig some of the wines you’ve tried along the day’s journey, you don’t have to hold a bottle under your arm as you try to keep your bike steady. Many wineries in the area will arrange to have a bottle sent directly to your hotel, and we can’t think of a better reward for a day of cycling than a glass of your favorite new Niagara Region vintage.Maria SainteWhether you rent your own bike or join up with one of the wine region’s many bike tours, these are the stops you can’t miss on an epic cycle through the area.Jackson-Triggs WineryA fantastic starting point for your cycle around town is the modern Jackson-Triggs Winery. The airy, glass-enclosed main building overlooks roughly 12 acres of finely manicured vineyards, with two-story-tall, garage-style doors that roll up on clear and sunny days to let in a gentle cross breeze. It’s a gorgeous and open space that marries contemporary and traditional architecture, and you might be tempted to linger here all day. Nosh on tacos, cheese, and charcuterie at the on-site cafe, The Patio, or grab a glass of Sauvignon Blanc (or Pinot Noir, or Merlot, or any of Jackson-Triggs’s other delightful offerings) and hunker down in the winery’s 500-person-capacity amphitheater, which is built into the hillside of the vineyard. Don’t leave without walking around the grounds; if you’re lucky, you might glimpse grapes being crushed on the outdoor “crush pad.”Two Sisters VineyardsFrom Jackson-Triggs, cycle past grassy fields lined with towering, leafy trees and through Niagara-on-the-Lake’s historic old town. As you roll up to the estate of Two Sisters, scope out its towering pillars and grand, symmetrical windows; they’re inspired by Renaissance architecture and the founders’ roots in Italy’s Campania region. The wines here, though, are all Niagara. Drop into the moodily lit tasting room for sips of the winery’s small-production reds like Merlot, Cabernet Franc, and Cabernet Sauvignon, which helped earn Two Sisters the Best Performing Small Winery of the Year award from WineAlign’s National Wine Awards of Canada in 2018. Pro tip: Take the Experience Tour and try a handful of vintages directly from French oak barrels in the winery’s candlelit cellar. Afterward, hang out on the outdoor patio at Kitchen76, the property’s Italian-inflected bistro. We’re into the house-made pizzas like the Dolce e Salato pie, a sweet-and-savory creation piled high with creamy mozzarella, pungent gorgonzola, slices of pear, prosciutto di Parma, toasted walnuts, arugula, and honey.Peller Estates Winery & RestaurantAlthough it’s practically next door to Two Sisters, Peller Estates feels like it’s in another country altogether. Specifically, France. You’ll find Peller down a tree-lined private road that leads to a massive French-inspired château, which rises magnificently before you. Don’t be intimidated, though: Some well-heeled diners dress to impress at the on-site Winery Restaurant, an elegant dining room with crisp white linens and twinkling chandeliers, but plenty of visitors hop off their bikes dressed more casually in cycling gear. (If you’re here for lunch, pair Peller Estates’ French-oak-aged Chardonnay with the fresh lobster linguine draped in Chardonnay-spiked cream sauce and slivers of black truffle.) Don’t leave without dropping in on the property’s Greatest Winery Tour, which grants visitors entrance to 10Below, the chilly downstairs lounge where everything—from the seats to the bar—is made with blocks of ice. Once inside, you’ll be provided with a heavy winter jacket and a glass of ice wine made from late-season Riesling and Cabernet Franc grapes.InniskillinA short way down the leafy Niagara Parkway, which hugs the banks of the mighty Niagara River, you’ll come upon Inniskillin, one of the oldest wineries in the area. The specialty here is Icewine, which is made from Vidal, Riesling, and other grapes that have been left to mature on the vine into the winter season. The result is a decadent, sweet wine with a concentrated, nectar-like flavor. Take a guided tasting inside Inniskillin’s restored 1920-era barn or post up on the property’s sprawling red brick patio, where on weekends, more than 200 cyclists a day will chill out at picnic tables shaded by large red umbrellas. Ice wine isn’t just for dessert—it can also stand up to the hearty, unctuous fare from the property’s walk-up Market Grill. Specialties include sandwiches brimming with tender 16-hour-smoked brisket, maple syrup pulled pork, and pulled chicken doused with ice wine-infused barbecue sauce. Make sure to leave room, though, for the fresh Malpeque oysters and gooey poutine.Caroline CellarsThere are roughly 40 bikes parked outside Caroline Cellars at any given time, and with good reason. Even with 20-foot-high ceilings, the dining room of the winery’s Farmhouse Cafe feels warm and cozy thanks to the building’s handsome Canadian pine paneling and homey, seasonally driven menu. Park your bike outside (or, if it’s an e-bike, recharge it at the property’s charging station) and settle in for rib-eye steak sandwiches and juicy sirloin burgers made with local meat, focaccia sandwiches stuffed with grilled golden beets and summer vegetables, and tacos conveying fried nuggets of local Lake Erie pickerel. Wash it all down with a sip of Caroline Cellars’ house-made wines, which in addition to the usual reds and whites, include vintages made with local plums, cranberries, and blueberries.Stratus VineyardsFeeling the burn in those quads? You’ve cycled a giant loop, and you’re nearly back to where you started. Sleek and minimalist, the glass-and-concrete tasting room at Stratus Winery’s LEED-certified facility—the first of its kind in the world—is filled with light all day long. It’s only a small part of the entire estate, which spans a staggering 62 acres filled with 16 different grape varieties, from Petit Verdot and Sangiovese to Syrah and Tannat. Walk up to the long marble bar for a casual tasting, or pop into the property’s petite, mesquite-wood-lined tasting room and pair Stratus vintages with local cheeses, dark chocolate, and sea salt shortbread. Afterward, bring your glass out to the couches on the large stone patio in back, which overlooks vines as far as the eye can see. The view is stunning, especially at sunset, making it the perfect place to conclude a long day of cycling.Additional stops to consider:Reif Estate WineryMarynissen Estates WineryWayne Gretzky Estates WineryTrius Winery & RestaurantBig Head WinesNo matter if you choose to hit up one winery or a half dozen, cycling past rolling fields of vineyards and never-ending greenery is an unparalleled experience—one that simply can’t be recreated in a car. After all, wine tasting in the Niagara Region is all about lingering, whether over a glass of crisp Riesling or a dusty country road. The joy is in the journey.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-02", "author": ["Condé Nast", "Destination Canada Tourism Partnership Of Niagara"]}