{"id": "ef3e336924b5ff291b028e815ffc2bae", "url": "https://www.bonappetit.com/story/store-bought-curry-paste", "year": 2021.0, "month": 1.0, "day": 3.0, "content": "Store-Bought Curry Paste is An Acceptable Substitute for Homemade Curry Paste—And These Are the Best Ones | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingAs an Avid Thai Cook, I Had to Know: Is Store-Bought Curry Paste Ever Okay?Those of you who dread breaking out the mortar and pestle might be pleased.By Katrina YentchJanuary 20, 2021FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.In a world where authenticity in food is highly valued (and for good reason), many home cooks want to work with real flavors and real ingredients, avoiding shortcuts and workarounds. But sometimes that desire butts up against reality: We don’t always have access to grocery stores with wide selections, time to simmer and braise for hours, or money to buy another round of spices.So when it comes to making Thai curry paste, a time-consuming process that requires ingredients that aren’t always easy to find, it’s okay to give yourself a break: As an avid Thai cook myself, I’ve asked Thai chefs and other Thai home cooks about curry paste—and they assured me that it’s okay to use a store-bought version. If you’re selective about the brand you use and the other ingredients you’re putting into the final dish, you can almost replicate a meal from the Thai restaurant down the street (yes, they’re likely making it from scratch, but in big batches that they can dip into every time a new order comes in).Making curry paste from scratch is a project:The times I’ve made curry paste from scratch, I’ve had to mentally prepare myself for the long road ahead. Here’s a breakdown of what you’ll do: Gather 8–10 ingredients, which typically include items like galangal, Thai chile, makrut lime leaves, lemongrass, garlic, shallots, shrimp paste, cilantro root, and spices like coriander and peppercorns. Then pound them until they’ve formed a paste. If you want to do this the traditional way, you’ll need to use whole spices (no spice grinders allowed) and a mortar and pestle, which preserves the natural moisture and flavors in a way a blender cannot. All of this happens before you even begin cooking the curry itself.And, in addition to the time, fresh Thai ingredients can be difficult to source depending on where you live. While I grew up just 30 minutes away from Los Angeles Thai Town, many people are not blessed with the convenience of finding lemongrass and makrut lime leaves just down the street. Although it’s certainly easier nowadays to source dry ingredients online, the intense aroma of Thai food dishes hinges on fresh herbs and spices that don’t ship well.The care that goes into curry paste makes sense when you think about the importance in Thai cooking of knowing what goes into your food. Chef Hong Thaimee is a Thai chef and culinary expert who is working on a line of made-to-order curry pastes under her brand Thaimee LOVE. She explains that curry paste was created by women who had the time to thoughtfully prepare dishes: “[Historically,] a Thai woman in the kitchen had to be pra-nee, or refined,” she says. “You had to pay attention to know what you put in your food,” she says. Hong also emphasizes that a curry paste was a family’s “secret weapon,” and that it took patience and time to prepare the perfect one.“A good analogy to making your own curry paste is making your own jam,” says Pailin Chongchitnant, author of Hot Thai Kitchen and host of Pai’s Kitchen/Hot Thai Kitchen on YouTube. “Do most people make it? No. Is it totally fine to buy? Absolutely. Do I make it? Rarely, now that I have a baby! But is it better if you make it? In some ways, yes.”When you have the time, this red curry paste from Ugly Baby is worth the labor.\nPhoto by Alex LauBut that doesn't mean homemade curry paste isn't worth it:While it’s not crucial to use a fresh paste when making curry, there are admittedly some differences between homemade and store-bought. Have I mentioned that Thai food thrives on fresh ingredients? When herbs are added at the very end, they create a meal with unparalleled freshness. The same is true of curry paste, where the pounded herbs play a vital role—without those vibrant herbs, the paste does not smell as pungent, sharp, and distinctive; you can’t sense the individual ingredients, and, in some cases, the shrimp paste is overwhelming. “There's something about homemade pastes that I can't quite put my finger on, but its flavors always seem a bit more complex, probably because of fresh ingredients,” says Pailin.When you use store-bought curry pastes, you also lose the ability to customize based on dietary restrictions and flavor preferences. Often, pastes contain common food allergens like shellfish and gluten or are not vegan-friendly and, what’s more, many Thai chefs also make pastes according to what they love, whether that’s more spice from chiles or more sweetness from palm sugar. As Chef Hong advises, “Authenticity doesn’t mean how you make it, but how you make it your own.”If you do decide to make a paste from scratch, it’s also okay to cut corners. Try switching out the mortar and pestle for a blender to save time. “What I have found is that it is okay to use high-powered blenders to blend the ingredients,” says Hong. “You have to learn how to live with your reality. We have to learn to adapt.” You can also prepare big batches to use for later, rather than starting from scratch every time you’re making curry. Pastes can be stored in airtight containers in the fridge and will be at their freshest for two weeks. After that point, there will be a noticeable decline in flavor and pungency. This rule of freshness also applies to store-bought paste.You can also prioritize the other ingredients you’ll be adding to the finished dish. For Hong, “palm sugar, fish sauce, and coconut milk is a marriage made in heaven.” Avoid low-fat versions of coconut milk—they result in a chalky consistency instead of the rich, creamy, fatty goodness.When you only need a small amount of curry paste, like for these chicken legs, store-bought makes sense.\nPhoto by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonWhat to consider when buying store-bought curry paste:A good paste, according to many Thai chefs and home cooks, should be aromatic, whether you’re making it from scratch or buying. “If you buy curry paste from the grocery store, the smell of herbs should be strong as soon as you open it,” says Phongchanok Fern Boontong, owner of Jeed Curry Paste in L.A. A great curry paste should hold its own in the finished curry: “We hardly add anything except coconut milk, palm sugar, and salt (or fish sauce) for flavor,” says Phongchanok.Pailin Chongchitnant advocates buying Thai brands. Many of them have distribution facilities in the U.S. and work with ingredients sourced directly from Thailand. Pay close attention to what’s on the ingredients list. “There should be nothing apart from herbs, spices, salt, and shrimp paste. No oils, no additives, no water” advises Pailin. In some cases, you should also be avoiding heat, especially with curries like Massaman and yellow. “Stop thinking Thai food or curry has to be spicy,” says Hong Thaimee. “Thai food is a symphony of flavors and especially green curry, which is a curry that’s sweet and green and coconut milky.”While both Phongchanok and Hong are working on their own lines of curry paste, there are also some favorites, found both online and in most Asian grocery stores, that many of us Thai home cooks love to use:Maesri: After conducting a survey in my Thai community group on Facebook, most of the commenters suggested this brand. Many even said that they had a few cans of this in their pantry right now. They’re small, which means it won’t dry out and lose its flavor before you’ve reached the bottom.Mae Ploy: Mae Ploy was the second most suggested brand in my poll. Be gentle on the fish sauce when using this, because it tends to be on the saltier side.Chef’s Choice: Chef’s Choice is a personal recommendation by Hong Thaimee, and mostly found in Europe and Asia and available online. She likes how vibrant the color of the paste is, which she says is another indicator of freshness.Curry is in your future:Photo by Laura MurrayMaesri Red Curry Paste (Pack of 4)$15 at AmazonKatrina Yentch is a coffee and lifestyle writer and editor based in Portland, Oregon.Explore Bon AppétitThaiCurrySoutheast AsianShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-20", "author": ["Condé Nast", "Katrina Yentch"]}