{"id": "ef5b951ebf558ff466085a278b6e221b", "url": "https://www.bonappetit.com/recipe/everyday-greens-salad", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Everyday Greens Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueEveryday Greens SaladBy Molly BazMarch 19, 20194.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintOur homage to the towering greens at NYC’s Via Carota, this salad is at its most dramatic—and most delicious—with a variety of leaves, some mild and large (butter, Bibb, Little Gem), some spicy and small (like arugula). The tender herbs (like mint, dill, basil, tarragon, parsley, cilantro) are optional but highly recommended.Ingredients4 servingsNew-Standard Vinaigrette1½cups extra-virgin olive oil¾cup any combination red wine vinegar, white wine vinegar, and/or apple cider vinegar1Tbsp. Dijon mustard1Tbsp. honeyKosher saltSalad8oz. mixed tender greens1cup torn tender herbs (optional)Kosher saltPreparationNew-Standard VinaigretteStep 1Combine oil, vinegars, mustard, and honey in a large resealable jar or airtight container; cover and shake vigorously until emulsified, about 30 seconds. Season with salt.Step 2Do Ahead: Vinaigrette can be made 1 month ahead. Cover and chill. Shake to re-emulsify.SaladStep 3Drizzle 3 Tbsp. vinaigrette into a large bowl, coating sides and bottom of bowl. Add greens and herbs (if using). Using your hands, fold greens, working from the bottom, out and up the sides of the bowl, until evenly coated in vinaigrette. Season with salt until greens taste vibrant (you may need to season and toss a few times). Mound salad, higher than wide, on plates or in shallow bowls.How would you rate Everyday Greens Salad?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleExcellent go-to for salad dressing! I always have these ingredients on hand and mix with whatever greens I have that week. Delicious and easy!AnonymousVirginia1/15/2020Explore Bon AppétitSaladLeafy GreensVegetableArugula5 Ingredients or FewerSideVegetarianRawGluten-FreeDairy-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Molly Baz"]}