{"id": "ef68579cfab6d7a97891e499627f81db", "url": "https://www.bonappetit.com/recipe/fruit-galette-with-buckwheat-crust", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Strawberry-Rhubarb Galette with Buckwheat Crust Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueFruit Galette with Buckwheat CrustBy Chris MoroccoMarch 20, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintGalettes were invented to make amateur bakers feel like pros. The less perfect they are, the cooler they look. No trimming, no tucking, no crimping, no venting, and no soggy bottom. They’re also versatile: You can make a version of this year-round with the same amount of peak-season fruit.Ingredients6–8 servings Dough1cup all-purpose flour⅓cup buckwheat flour3Tbsp. sugar1tsp. kosher salt½cup (1 stick) unsalted butter, cut into piecesFilling and AssemblyAll-purpose flour (for surface)1lb. rhubarb, cut into ¾\" pieces8oz. strawberries, hulled, halved if large1Tbsp. plus 1½ tsp. cornstarch⅓cup sugar, plus more for sprinkling½vanilla bean, halved lengthwise, or ½ tsp. vanilla extract1large egg, beaten to blendWhipped cream, ice cream, or crème fraîche (for serving)PreparationDoughStep 1Whisk all-purpose and buckwheat flours, sugar, and salt in a large bowl to combine. Add butter and work into dry ingredients with your hands, mashing it into big flat pieces and smooshing it between your palms into the flour, until you have pea- and nickel-size pieces.Step 2Drizzle ¼ cup ice water over mixture and rake it in with your fingers until evenly dispersed. Squeeze clumps with your hands to moisten until a shaggy dough forms, then turn out onto a work surface.Step 3Gather dough together, pushing and working it into a ball, then flattening it, until only a few dry spots remain. Pat into a ¾\"-thick square. Using a bench scraper or knife, divide dough into 4 pieces. Stack pieces on top of one another, placing any unincorporated dry bits in between layers, and press down to combine. Form dough into a ¾\"-thick disk and wrap tightly in plastic. Chill until firm, at least 2 hours and up to 3 days.Filling and AssemblyStep 4Preheat oven to 400°. Roll out dough on a well-floured surface to a 14\" round, rotating dough and tossing more flour underneath as needed to keep it from sticking. Transfer dough to a large parchment-lined rimmed baking sheet (most galettes will spring a leak at the creases of the pastry, even for pros). Place rhubarb, strawberries, cornstarch, and ⅓ cup sugar in a medium bowl. Scrape in vanilla seeds and discard pod; toss ingredients to evenly distribute.Step 5Mound filling in center of dough, making sure to scoop up all the sugar and cornstarch in bowl, and spread out, leaving a 2\" border around edges. Fold dough up and over filling, overlapping slightly. Brush dough with egg and sprinkle dough and filling generously with sugar.Step 6Bake galette until filling is bubbling and crust is deeply browned, 40–50 minutes. Let cool slightly. Serve topped with whipped cream.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Fruit Galette with Buckwheat Crust?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThe buckwheat really accented the tart and sweet fruit, delicious! I am going to try to adapt to make a savory galette with a buckwheat crust next.AnonymousCape Cod, MA 5/25/2020A keeper! The method of dividing the dough in 4 and stacking it results in a delicate, flakey crust that I don't get by just rolling. I printed this one!schoojergerKnoxville, TN9/23/2019Explore Bon AppétitGaletteDessertFrenchEuropeanRhubarbFruitBuckwheatFlourStrawberryBerrySpringBakingEasterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Chris Morocco"]}