{"id": "ef684c54270c2e90b9b2cfe6d8f6ea40", "url": "https://www.bonappetit.com/recipe/sumac-rubbed-lamb-with-minty-artichokes", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Lamb with Artichokes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueSumac-Rubbed Lamb with Minty ArtichokesBy Alison RomanApril 16, 20195.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintWe can't think of a better large-format meat. A leg of lamb is fatty and flavorful, and its size makes it hard to overcook. Since you’re making a decadent and generous roast, so there’s no crime in using canned artichokes.Ingredients6–8 servings14–5-lb. boneless leg of lamb3Tbsp. sumac, plus more for serving5tsp. Diamond Crystal or 1 Tbsp. Morton1Tbsp. freshly ground black pepper, plus more2heads of garlic, halved crosswise214-oz. cans unmarinated artichoke hearts, drained, halved lengthwise½bunch oregano, plus leaves for serving1cup dry white wine¼cup extra-virgin olive oil1½cups mint leaves, divided1–2bunches red radishes with tops, quartered, and/or 4–6 watermelon and/or purple radishes, thinly sliced1shallot, thinly sliced into rings2Tbsp. white wine vinegar3Tbsp. toasted sesame seedsAioli, labneh, or plain whole-milk Greek yogurt (for serving)Ingredient InfoSumac, a tart, citrusy spice generally sold in ground form, can be found at Middle Eastern markets, specialty foods stores, and online.PreparationStep 1Place a rack in middle of oven; preheat to 275°. If lamb is tied or trussed, remove any twine or netting. Sprinkle lamb all over with 3 Tbsp. sumac, 5 tsp. Diamond Crystal or 1 Tbsp. Morton kosher salt, and 1 Tbsp. pepper.Step 2Reroll lamb so the fattier side is on top (it doesn’t have to be tight; you can just close it back up like a book). Using 3–4 pieces of kitchen twine, tie lamb in 2\" intervals to close. Place bottom halves of both garlic heads, cut side up, in the center of a 13x9\" baking dish and set lamb, fat side up, on top (the garlic acts as a makeshift, better-tasting wire rack). Scatter cloves from remaining top halves of garlic heads around lamb, then tuck artichokes and sprigs from ½ bunch oregano around. Pour in wine and oil; season vegetables with salt and pepper. Roast lamb and artichokes until a thermometer inserted into the thickest part of lamb registers 135° for medium-rare, 2–2½ hours.Step 3Remove lamb and artichokes from oven and increase temperature to 500° (taking the lamb out while the oven heats up prevents the meat from overcooking).Once oven temperature is at 500°, slide baking dish back into oven and roast until fat on lamb is golden brown and artichokes are sizzling and starting to crisp around the edges, 10–12 minutes. Carefully transfer lamb to a cutting board and let rest at least 20 minutes.Step 4Meanwhile, scatter half of mint leaves over artichokes and toss well to coat. Toss radishes, shallot, and vinegar in a small bowl to combine; season radish salad with salt and pepper.Step 5Thinly slice lamb and arrange on a platter or serve directly on cutting board and spoon some of the artichoke mixture and any pan juices over. Scatter sesame seeds, oregano leaves, more sumac, and remaining mint on top.Step 6Spoon some aioli into a bowl and serve lamb with radish salad, aioli, and remaining artichoke mixture alongside.Step 7Do Ahead: Lamb and artichokes can be roasted 3 hours ahead. Let sit at room temperature. Reheat artichokes just before serving.How would you rate Sumac-Rubbed Lamb with Minty Artichokes?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleLoved it. Was also my first time. It was a fairly foolproof recipe if you have a meat thermometer.\nHas anyone considered letting the dry brine sit on there for hours before roasting?AlexMexico City4/5/2021We made this last night for Easter dinner and it came out great. Don't skip the radish salad - it adds some much-needed acidity to the dish that cuts through the richness of the lamb. tybananaboyLos Angeles, CA4/13/2020I decided to make use this recipe to try making leg of lamb for the first time ever... and it came out a resounding success. I will absolutely make this again, yum!lisie831Westchester, NY4/12/2020Explore Bon AppétitLeg Of LambLambMeatMintHerbs & SpicesRadishVegetableArtichokeOreganoSpringMainGluten-FreeKetoRoastEasterDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Alison Roman"]}