{"id": "ef79b2864ad2214036ec0730cce68fec", "url": "https://www.bonappetit.com/story/pineapple-lies", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Questionable Restaurant Behavior and Pineapple Lies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureQuestionable Restaurant Behavior and Pineapple LiesA dive into the week’s weird food news.By Alex BeggsMarch 16, 2019FacebookTwitterEmailPhoto by Hulton Archive/Getty ImagesFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the* BA *offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Is it ever okay...To call out a mansplaining waiter? To demand free food at a restaurant? To wipe stranger’s pee off a toilet seat? These urgent etiquette questions about questionable restaurant behavior—and more!—are answered here. Also, I have to write this column every month and I always need more questions, so please send them to me at staff.bonappetit@gmail.com. Or questions about recipes you’re looking for. (A good vegetarian meatball? THESE, FRIENDS!)Read “Is it ever okay…?” right this wayThat’s one way to do itThis week, a video went viral of U.S. Senator Mitt Romney removing each individual candle on his birthday cake and huffing and puffing it out. This is called “the wish-extender,” a birthday loophole practiced by the few and the brave (you really shouldn’t mess with birthday magic). It’s bold, it’s a little odd, but it’s also hygienic. We’ll only know how effective it is if, in the next few months, Romney retires to a ranch in Utah, takes up porch-sitting and crosswords, wins the lottery, learns Spanish, finally finishes The Power Broker, meets Beyoncé, fits into those old jeans again, and finds some peace and quiet in this wild, crazy world.Want this letter before it hits the website? Sign up for our newsletter!The other viral thingWas this video of a pineapple being eaten one spike at a time. “Wait, is this is how we should’ve been eating it all along?” the collective internet asked. So BA’s social media duo Rachel Karten and Emily Schultz went to Whole Foods and asked the Test Kitchen editors to assist. Chris Morocco “did his whole Chris thought-process thing,” said Emily, and he told them to score the pineapple with a knife first. Instead they followed the video, cut off the pineapple top, and tried to pull off wedges. It didn’t work. Next, Emily scored it, but she didn’t do an accurate job so it didn’t work and “Rachel was mad.” The second pineapple was accidentally cut through the core—another failure. “We think it was a different type of pineapple in the video, one without a core,” Emily concluded. Uhhhh.Courtesy of NightfoodGood night, sweet creamThis week I sampled a Brand New Snack Product. It was a healthy-ish, lower sugar, lower calorie ice cream that “promotes” better sleep called Nightfood. Does it make you sleepy? Nope. Does it fight the debts, deadlines, and demons keeping you up at night? Sadly nope. Does it contain “glycine”? Yes! Not sure what that is? It’s an amino acid that contributes to a good night’s sleep. I liked the Bed and Breakfast flavor, a hint of maple cream ice cream with little cookie dough-esque pieces of waffle, and the wonderfully unsweet decaf coffee flavor. One thing is undeniably true: These are much better than another lower calorie ice cream I SHALL NOT NAME.Speaking of caloriesI read a fantastic longread this week in 1843, The Economist’s lifestyle magazine (which I’d never heard of until the publicist sent me the promo for). “The Death of the Calorie” is about how we’ve been misperceiving calories all this time, how often the calorie count listed on foodstuffs is inaccurate, and all kinds of facts that made me want to eat more greens. However, I am currently eating Cheez-Its off a large plate I call my “chip plate.” Which brings me to...Photo by Heidi's Bridge, styling by Anna BillingskogThis dip saves marriagesAt least according to one reviewer, “BHURLOW,” who wrote “this dip literally saved my marriage.” I’d love to know the whole story, so if you’re out there, BHURLOW, fill me in!Get the recipe: French Onion DipUnnecessary food meme of the weekUnnecessary food feud of the week“Is Life a good cereal?” Now imagine a chorus of YESNO belting out in beautiful cacophony. “They get soggy before you can even put a spoon in it,” said Amiel Stanek. “So you need a spoon in one hand, milk in the other, and then you gotta eat it fast.” Alex Delany agreed, “There’s a milk application process, for sure,” and then sent me a 210 word exposition on why Life is a good cereal, which I refuse to share here. It begins with “you have to come from a place of cereal humility to appreciate it.” To me, Life, the cereal, is as torturous as Life, the game, and Life, the life. Cristina Martinez felt that “only people who eat Triscuits could like Life cereal,” which perked up Aliza Abarbanel, who is a Triscuit-loving Life appreciator. Meryl Rothstein emerged from a pile of red-penciled papers and proclaimed, “Life is a fine cereal.”Explore Bon AppétitBeggs NewsletterRead MorecultureIs It Ever Okay...To Call Out a Mansplaining Waiter?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-16", "author": ["Condé Nast", "Alex Beggs"]}