{"id": "ef961fd9ac7ff29edea35bd0d73cd432", "url": "https://www.bonappetit.com/story/ipa-beer-styles", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "What Is an IPA Beer? A Complete Guide to the India Pale Ale | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat Is an IPA? A Complete Guide to the India Pale AleThe IPA is everywhere, but not all IPAs are the same. Learn about the 10 styles of IPA before you order your next round of beers.By Alex DelanyJanuary 30, 2018FacebookTwitterEmailPhoto by Matt HaasFacebookTwitterEmail“I hate IPAs. They’re bitter.”“I love IPAs. They have so much alcohol in them.”Those are the two most common things I hear people say about IPAs, and neither of them are really true. Not all IPAs are bitter, and not all IPAs have a ton of booze in them. You can’t throw a blanket statement over an extremely broad style of beer. It’s an unfair simplification. But whether you fall on the love or the hate (check yourself) side of this relationship, there’s one thing we can’t deny: IPAs are here to stay.But what do you actually know about IPAs? IPAs come in a range of styles, and the modern approach to hoppy beer isn’t a declaration of bitterness, but a beer that explores the world of fruity flavors that can also come from hops. Here’s everything you need to know about the IPA, from vocabulary to style breakdowns to the breweries doing them right.The IPA VocabularyThese are terms that can applied to any style of beer, not just IPAs. For instance, you can have a session West Coast IPA and a session Belgian IPA.Session: Less alcohol! Which may or may not be a good thing, depending on your lifestyle. Modern session IPAs usually fall below 5% ABV (although historically, the style is 4% and below). With lower alcohol comes a thinner body, so these are the types of beers you can drink on repeat.Double/Imperial: Double and imperial IPAs are essentially the same thing: IPAs with a higher hop concentration. To balance all that hop flavor, the brewer uses more malt, which results in a higher ABV (usually over 7%). It’s an IPA on steroids, and in the stoic words of Dave Chappelle (as Samuel L. Jackson), “This shit’ll getcha drunk!”A single and a double canned IPA from The Alchemist and Foley Brothers, respectively.\nPhoto by Josh DickinsonDry-Hopped: Dry-hopping is the process of steeping hops in fermenting beer, instead of adding them while the liquid is boiling. The process creates an extremely strong aroma, amplifying the fruity/piney/candy-sweet notes of the hops. It makes the beer smell better, without adding any bitterness.Double Dry-Hopped: A lot of brewers say IPAs are “double dry-hopped.” And while this sounds self-explanatory, it’s actually meaningless. There’s no real definition for “double dry-hopped.” It could be a dry-hop with twice the amount of hops or the addition of a fresh batch of hops halfway through the process. Regardless, it’s more of a marketing ploy to sound like you’re getting an over-the-top hoppy-ness/dose of hops  than a quantifiable word, so no one knows exactly what it means.Triple Dry-Hopped: Seriously. No one knows what this is.Single-Hopped: Brewers combine multiple hop varieties for the same reason you’d put multiple seasonings in a marinade—to bring different flavors to the table. A single-hopped IPA, however, is brewed exclusively with one hop variety. That means that in a Citra single hop IPA, Citra hops are used in the boil, on the finish, and in dry-hopping (if dry-hopped). This is great news if you’re a member of the Citra Hop Fan Club.Fresh-Hopped: Fresh-hopped IPAs, also called wet-hopped or harvest ales, only come around once a year, at the peak of hop harvesting season in late August and September. To qualify as a fresh-hopped IPA, the hops have to leave the vine, travel to the brewery, and end up in the boil in under 24 hours. The closer to the brew date you drink it, the more intense the brilliant, fresh flavor of the hops will be.Brews being poured at Perennial Artisanal Ales\nPhoto by Matt HaasIPA StylesThese are classification categories for IPAs. A “style” means that an ingredient in the brewing process or technique (or both) lends a certain flavor, mouthfeel, or appearance to the beer that is always true for the style.British IPAThe IPA was invented in Britain. Here’s the abridged version: British sailors, while sailing to India, loaded up barrels of beer with hops, because hops were a preservative. The hops hung around in the beer for so long that they lost their fruity flavor and left a bitter tasting beer. So…British IPAs are malty, bitter, and one-noted. They aren’t the most popular style today, but it’s important to know one when you see it. These are best consumed on some kind of a cliff with sea mist spraying in your face.3 Breweries Crushing the British IPA: Great Lakes Brewing Company, Yards Brewing Company, and Samuel Smith’s BreweryWest Coast IPAThe West Coast IPA was the beginning of the fruity hop explosion. This style gets credit for exploring the rowdy, fruity flavors in hops, while shedding some of the bitterness. That’s not to say that West Coast IPAs aren’t bitter; they are. But that bitterness is balanced with an exceptionally clean, crisp body, higher carbonation, and big tropical fruit notes (It is a “West Coast” IPA, after all). Early classics in the style were brewed by Sierra Nevada Brewing Co. and Stone Brewing Company.3 Breweries Crushing the West Coast IPA: Fieldwork Brewing Company, Half Acre Beer, Pipeworks Brewing Co.Hazy, New England style IPAs at Narrow Gauge Brewing\nPhoto by Matt HaasNew England Style IPAThe New England IPA is what people are drinking right now. This IPA is unfiltered (which makes it hazy) and has extremely low bitterness from using blends of hops that lend intense, fruity flavor. New England style IPAs are often dry-hopped and tend to be fermented to have lower carbonation. These beers look like orange juice, smell like fruit salad (sprinkled with weed), and taste like fresh fruit cobbler. This is the IPA for the “I don’t like IPAs,” person in your life, which might be why they’re so popular right now.3 Breweries Crushing the New England IPA: Hill Farmstead Brewery, Civil Society Brewing Company, and Trillium Brewing Co.East Coast IPAAlthough this isn’t necessarily an “official” style of beer (according to the beer lords over at Beer Advocate), there’s something to be said for the East Coast style IPA. It’s the stepping stone between the British and West Coast IPA, with an emphasis on piney hop flavor and a solid malt backbone. It’s not as bright as a West Coast IPA, but more complex in flavor than a British IPA.  Dogfish 60 Minute and Victory Hop Devil are good examples.Three Breweries Crushing the East Coast IPA: Carton Brewing Company, Dogfish Head Brewing Company, and Victory Brewing CompanyOat IPA“Soft” is a word that’s becoming a lot more common when talking about IPAs, and that’s thanks to oats. While West Coast IPAs are crisp, clean, and sharp, IPAs brewed with either flaked oats or oat milk have a lazy, lethargic, cozy mouthfeel. They’re soft in the way that the blanket you keep on the couch for extended stays is soft. You can get lost in there, with the bonus of fruity hop flavors.3 Breweries Crushing Oat IPAs: The Veil Brewing Company, Cerebral Brewing, and Monkish Brewing Co.Lactose IPA aka “Milkshake” IPAMilkshake IPAs (also called cream IPAs) do not contain milk, and you should not shake them. Lactose IPAs get the nickname “Milkshake” because of the sweetness the milk sugar adds to the beer. It’s common (but not mandatory) to see fruit or vanilla added to these IPAs to take the effect even further. With a low carbonation, these usually end up drinking like a fruity milkshake, super smooth like a milk stout but much lighter in flavor and color.3 Breweries Crushing the Lactose IPA: Tired Hands Brewing Company, Omnipollo, and Other Half Brewing CompanyBelgian IPAThe driving flavor in a Belgian IPA comes Belgian yeast, which provides sweet, bready, warm notes to the beer. These usually end up tasting like a British IPA mixed with a Belgian tripel. These get better and better the closer you get to a fireplace.3 Breweries Crushing Belgian Style IPAs: Central State Brewing Company, Brouwerij De Ranke, and New Belgium BrewingPouring IPAs in a glass, instead of drinking them from a can, release all those lovely hop aromas.\nFruited IPAAdding fruit to beer is a risky procedure, but IPAs handle it pretty well. Brewers intensify all that fruit flavor coming from the hops by adding puréed fruit to the beer while it’s brewing. With fruited IPAs, you want fruit purée added to the beer, not fruit juice. It creates better flavor and shows that the brewer isn’t taking shortcuts.3 Breweries Crushing the Fruited IPA: Burial Beer Company, Mikkeller, Burlington Beer CompanySour IPAIn a perfect world, a sour IPA would be equal parts tart, juicy, and fruity, but the sour IPA is still largely uncharted territory. Some brewers will call a dry-hopped sour beer a “Sour IPA,” but it isn’t the same. The body of a sour beer is generally lighter, so adding the bold flavor of hops directly to that beer doesn’t always work out. There’s really only one brewery making sour IPAs the right way. Hudson Valley Brewing Company blends sour ale with a separately brewed IPA to create one sour, fruity, cohesive beer.A Brewery Crushing the Sour IPA: Hudson Valley BreweryBrett IPA:Brettanomyces. So hot right now, Brettanomyces. This yeast strain (also seen in winemaking), added in the primary fermentation of the beer, gives a funky, melon-y quality to beer. Brett is showing up in IPAs more and more frequently, adding an underlying aroma of musty fruit salad and boosting ripe fruit flavors. That’s a good thing. Promise. And you say it like this: Brett. Uh. Nom. Mih. Seas.3 Breweries Crushing the Brett IPA: Homage Brewing, Allagash Brewing Company, and Anchorage Brewing CompanyWant to drive around Vermont in search of IPAs? You can do that.Take an Epic, Beer-Fueled Road Trip Around VermontView StoryExplore Bon AppétitBeerAlcohol & Other DrinksRead MorecultureIPAs for People Who *Think* They Hate ThemBy Joshua M. BernsteincultureBored by IPA? Here Are the Craft Beer Trends to Crush in 2016By Joshua M. BernsteincultureWhy the World Needs More Crowlers—Wait, What’s a Crowler?By Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-30", "author": ["Condé Nast", "Alex Delany"]}