{"id": "ef9b8c330b186ee6a22bf16343aedd82", "url": "https://www.bonappetit.com/story/never-fail-loaf-cake-grapefruit-juice", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "This Loaf Cake Is Soaked with Grapefruit Juice, and I Think That’s Pretty Cool | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Loaf Cake Is Soaked with Grapefruit Juice, and I Think That’s Pretty CoolA loaf cake is a loaf cake is a loaf cake—until you literally douse it in citrus. Then it's something else.By Alex BeggsMay 24, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.When Claire Saffitz publishes a new cake recipe, particularly a loaf cake recipe, I adjust my life plans around making it. I could compare this to numerous things in my life. When Louise Penny writes a new murder mystery, I need to read it. When Film Forum puts on a Hepburn and Tracy series, I need to see them all. That's just how I am; the universe suddenly stops me in my tracks and demands my attention.So a few years ago, Claire dropped this grapefruit-poppy seed loaf cake recipe and I had to bake it. Then I baked it again and again. Once I subbed in lemon for grapefruit—wild times ensued! But what makes it special is how damn moist it is, and how remarkably citrusy it tastes.How does she do it?!Like this. For mega-citrus flavor, you zest a grapefruit and then massage it into sugar for a minute. It’s not a hard technique, standing there musing on things and playing in the sugar sand, but it’s a smart one. You activate the essential oils in the grapefruit zest and spread it throughout every molecule of sugar; the citrus flavor POPS, it doesn’t hide in the background like sensible wallpaper.For mega-moisture, you take the cake out of the oven and POKE HOLES IN IT with a chopstick or whatever, and then fill the holes with grapefruit juice!!!!! You may be familiar with “poke cakes,” in which gelatin is dropped into holes in a cake for a wacky-varied texture effect. This is...sort of like that. But not really, other than the word “poke.” Instead of creating lava drip Jell-O, three tablespoons of grapefruit juice sink in and leave the cake crumb fluffy and nearly wet (but not quite!), then the poppy seeds hop in for a good crunchy time.And just because: There’s yogurt in the cake batter for even more moisture/tang/fun. And one tablespoon of yogurt in the simple glaze on top (powdered sugar, water). There’s something virtuous about that dollop of yogurt. I like it.Yogurt makes this cake feel virtuous enough to eat for breakfast, for some reason.\nThis is what makes a Claire Saffitz cake a Claire Saffitz cake. We’re not mixing flour and eggs and calling it a day. There’s an extra bit of effort. There’s grapefruit-infused sugar, people! The last time I made it, I poured the batter into muffin tins. HOW CUTE. (Cook time is shorter.) It’s a versatile cake: Make it as a breakfast cake (a thing, I swear!!!), make it as an afternoon tea cake, put some candles in it and sing Happy Birthday to your cat! It’s light and spongy and hell, pro-freaking-biotic. So now it’s about time you stopped everything and baked it too.Get the recipe:Grapefruit–Poppy Seed Loaf Cake with Yogurt GlazeView RecipeExplore Bon AppétitNever FailCakeBasicallyGrapefruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-24", "author": ["Condé Nast", "Alex Beggs"]}