{"id": "efab2b0da6646c194068bea41dd11abe", "url": "https://www.bonappetit.com/story/cynthia-erivo-workout-warrior", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Cynthia Erivo On Being a Workout Warrior And Holding Hollywood Accountable | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCynthia Erivo On Being a Workout Warrior And Holding Hollywood AccountableShe's at the top of her game on stage, on screen, and in the gym.By Claire SaffitzJanuary 29, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIf Cynthia Erivo’s name isn’t on your lips already, it will be in 2018. The British-born singer and actress won a Tony for her starring role in \"The Color Purple\" in 2016, followed by a Grammy and an Emmy. She has four films coming out in the next two years, including Harriet, the Harriet Tubman biopic in which she plays the title character. Anyone who follows Cynthia on social media (like I do) knows that she is an absolute powerhouse in the gym, posting workouts from The Dogpound gym in NYC and chronicling her journey from fit to ultra-fit. I spoke to Cynthia recently about how someone as busy as she is manages to keep it together in the gym and in life.When and why did you decide to go vegan?I have been vegan for about 5 years. I don't eat red meat very often anyway because my body can’t process it. I don’t have dairy because I’m a singer and, quite frankly, I don’t want to mess around with my vocal chords and how those behave, and dairy is an allergen for me. I was cutting so many things out of my diet for health reasons—my body was letting me know that it wasn’t right for me—it ended up that being vegan was the most correct way for me to treat my body.You live in NYC but also travel a ton. How do you maintain your feel-good diet when you’re constantly on the move?I actually find it easy wherever I go. I’m going to look in my suitcase now because I’ve only just gotten back, and I still have everything in it. I travel with seaweed chips, edamame chips, tea, peanut butter, avocados. I always take my supplements with me because they’re easy to carry. I always make a meal for the flight I’m going to be on that day and carry it in a thermos. I always have nuts and apples. If I’m in a hotel, I always ask them to make sure have a kettle and a fridge.Tell us more about the supplements you take—are they for your voice?There’s one by doTerra—they do essences like lavender oil, all of those things, and there’s one thing they have called OnGuard, which is a combination of clove oil, tea tree oil, black pepper, and oregano. It’s really great at preventing you from getting ill from being on a plane for a long time. I take biotin to make sure hair and nails are growing well. I take a B complex because I’m traveling a lot. I take spirulina and chlorella to get my greens in tablet form if I don’t have enough greens during the day; flaxseed oil because I work out a lot and that helps for joints; a proper multivitamin tablet, which is, again, just to make sure I have all the vitamins I need; probiotics because we as women need it anyway. I take an adaptogen, which also helps muscle rehabilitation, and, because I work out a lot, the more that I can take to help with healing the better. I take a vitamin D because you don’t always get sunshine when you’re inside, and I take a digestive enzyme.When you’re not traveling, walk us through your daily routine.I wake up in the morning and I have a lemon and hot water or a tonic that I take every morning that usually has turmeric in it. I make sure that I do my workout first, before I’ve eaten, because working out on a full stomach makes me feel sick. And then I will come back, have something to eat, usually high in protein. I tend to take my vitamins with my breakfast. I don’t drink anything other than water and herbal tea. I don’t tend to curb how much I eat because I know I eat the right food and I am constantly moving around throughout the day. I tend to make a lot of my food so I know what I’m putting in my body. I stop eating around 8 or 9 p.m. so my body can relax and digest everything.Cynthia Erivo enjoying a moment of joy at home.\nPhoto by Emma FishmanWhat drives all your hard work in the gym? Where do you find that motivation?I know that my body asks for that amount of activity and it makes me feel good. I don’t think that working out is just a physical thing, I think it really is about how you feel. You release serotonin when you work out, so I think I may be slightly addicted to the feeling. The Dogpound is a great place. They try out new workouts on me because they know I can handle it.When you were on Broadway in \"The Color Purple,\" how did you take care of yourself while maintaining such a grueling schedule?I was working out really early in the morning. There is so much going on that I needed a that time when I could go to just be. That show is a tough one to do and you need to make space for yourself elsewhere. Working out became the place I would go to escape a little bit.Do you have other go-to methods of relieving stress or doing self-care?Everything I do is pretty holistic when it comes to stress relief because I don’t drink, I don’t smoke. The thing I go to most is working out because it’s the most easily accessible thing. But there are times when I just read or listen to music and play some jazz and burn a candle and let that be a moment of quiet.Erivo catches her breath between sets.\nPhoto by Emma FishmanCan you talk about your approach to cooking and eating?I have always enjoyed food, but now I try to make sure that whatever I put into my body is genuinely feeding my body. I want to find the most natural way to make things taste good: That’s my approach to food. I think there’s a way to be super healthy but to still have fun with it.Healthyish is all about living a healthy lifestyle without denial. What is an example of something you do in moderation because it feels good?I am a fiend for potato chips. That’s my thing that I love. I always try to have balance so I do allow myself a day or so when I can just eat whatever I want.As someone in the public eye who also has a social media presence, how do you decide how much of yourself to share?I have had to learn when to shut it down and not give too much of myself. Because the problem with social media is that people forget that anyone typing is human. The times when I engage are when I feel there’s a lesson to be learned or a conversation to be had. I want to make sure people know that I appreciate them when they send out something positive, so I try to engage with people like that as often as I can. Lately I’ve been better at giving my attention where I need to and keeping some space for myself.You have four movies coming out in the next two years. As a relative newcomer to Hollywood, what are your views on women in the industry, especially in light of this pervasive culture of sexual harassment that's being revealed?I am really glad that we’re getting to have the conversation about those people who have violated the trust of women in entertainment, because really that is what it is—a violation of trust from those who have power. It’s unforgivable, I think, because when you go into film, you go into a production, and you put your trust in someone to take the reins so that you can do your job. And if that doesn’t happen, your trust is violated; it's broken. I think it’s good that it’s coming to a head and we’re holding people accountable. And we definitely need to see more women directors, more women front-and-center.What is next for you? Are you someone who sets goals for the future?I will set goals. I tend to say them out loud because I think that’s important, then see what happens. In the next five years, I do have goals, but I'm holding them to my chest for now. The things that I want to happen always happen in the most unexpected ways, so I just go with it. Like I knew I wanted to be successful, and I knew I wanted to be actress, and I knew I wanted to perform, but I never knew it was going to happen like this.Explore Bon AppétitInterviewsHealthyishRead MorecultureActor Sandra Delgado on the Power of Latinx Theater and Exhausting Herself on StageBy Alejandra BorundaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-29", "author": ["Condé Nast", "Claire Saffitz"]}