{"id": "efaeef526b0d6f3729faeb73085d43c5", "url": "https://www.bonappetit.com/recipe/chicken-and-mushroom-sauced-noodles-with-thai-basil", "year": 2021.0, "month": 1.0, "day": 5.0, "content": "Chicken and Mushroom Sauced Noodles With Thai Basil Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken and Mushroom Sauced Noodles With Thai BasilChewy noodles, umami-packed mushrooms, and garlicky chicken, all coated in a spicy, sweet, and savory sauce.By Betty LiuJanuary 31, 20214.4(57)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintIn a lot of noodle shops in China, there’s a choice between soup noodles and sauced noodles. While I usually gravitate toward soup noodles during cold weather, there's something very comforting about sauced noodles, where each strand is coated in a complex savory sauce that flavors the entire dish. This recipe—with its thick gravy, umami mushrooms, and garlicky chicken—has everything I look for in sauced noodles: spice, sweetness, and savoriness, all elements coaxed out by the layering of flavors. The sauce itself consists of tian mian jiang (sweet bean sauce) and red miso. The combination of these two fermented sauces, one sweeter and one savory, makes for complex, multilayered flavor—a technique that is the basic principle behind a traditional northern Chinese dish zhajiangmian.This dish is equally inspired by Thai pad krapow, spicy minced chicken stir-fry tossed with holy basil. I’ve always had it served over rice, and it’s one of my favorite dishes to cook at home because of how quickly it comes together. Here, as in krapow, the aromatics from Thai chile and garlic infuse the meat and add a brightness that punctuates the rich sauce. A note on substitutions: You can use ground chicken instead of thighs, but chopping the thighs yourself will give you meat that’s more succulent and juicy. You can use regular soy sauce instead of dark. And if you don’t have or can’t find tian mian jiang, substitute hoisin sauce and omit the additional sugar. —Betty LiuAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronTian Mian Jiang$13 At AmazonSilicone Spatula$13 At BA Market8-Inch Chef's Knife$47 At AmazonMeasuring Cups$18 At Bon Appétit MarketSmall Bowl$13 At AmazonCutting Board$10 At IKEAMeasuring Spoons$10 At Bon Appétit MarketMedium Bowl$17 At AmazonLarge Skillet$84 At AmazonLarge Pot$55 At AmazonColander$11 At AmazonIngredients4 servings1lb. skinless, boneless chicken thighs (about 4 small) or ground chicken2cups shiitake mushrooms (about 5 oz.)5garlic cloves4red or green Thai chilesKosher salt¼cup tian mian jiang (sweet bean sauce) or hoisin sauce (see headnote)¼cup red miso¼cup black vinegar2Tbsp. dark soy sauce (preferably Pearl River Bridge)2Tbsp. sugar16oz. fresh or dried thin wheat noodles (such as lo mein, lamian, or ramen)2Tbsp. vegetable oil, dividedHandful of Thai or holy basilPreparationStep 1If using 1 lb. skinless, boneless chicken thighs (about 4 small), cut into ¼\" pieces on a cutting board with a chef’s knife. (To make this process easier, freeze chicken on a baking sheet 30 minutes, then cut chicken when it’s half thawed.) If you’re using 1 lb. ground chicken, skip this step.Step 2Transfer chicken to medium bowl and wash cutting board and knife.Step 3Trim stems from 2 cups shiitake mushrooms (about 5 oz.) and tear into 1\" pieces.Step 4Coarsely chop 5 garlic cloves and 4 red or green Thai chiles. Add a pinch of kosher salt and crush with the flat side of knife to a coarse paste (or pound in a mortar and pestle).Step 5Mix ¼ cup tian mian jiang (sweet bean sauce), ¼ cup red miso, ¼ cup black vinegar, 2 Tbsp. dark soy sauce (preferably Pearl River Bridge), and 2 Tbsp. sugar in a small bowl to combine; set sauce aside. (If you don’t have or can’t find tian mian jiang, substitute ¼ cup hoisin sauce and omit the additional sugar.)Step 6Bring a pot of salted water to a boil. Cook 16 oz. fresh or dried thin wheat noodles (such as lo mein lamian, or ramen) according to package directions until al dente. Drain, rinse under cool running water, and set aside.Step 7Meanwhile, heat 1 Tbsp. vegetable oil in a large wok or skillet over medium-high. Cook garlic mixture (the wok should be hot enough that it sizzles immediately), stirring constantly, until softened and fragrant, about 30 seconds. Add chicken and cook, stirring constantly, until pieces are just cooked through and no longer translucent, about 3 minutes. Transfer to a plate along with any juices.Step 8Wipe out wok and reduce heat to medium. Heat another 1 Tbsp. vegetable oil in wok and cook mushrooms, stirring occasionally, until browned and softened, 6–8 minutes.Step 9Increase heat to medium-high. Add chicken mixture and any accumulated juices and reserved sauce and cook, stirring often, until sauce is dark, most of the liquid is evaporated, and everything is coated, about 5 minutes. Add 1 cup water to wok and mix gently to incorporate. Bring to a simmer then reduce heat to low. Simmer uncovered, stirring occasionally, until thick and shiny (it should be about the consistency of gravy), 20–25 minutes.Step 10Coarsely tear a handful of Thai or holy basil and add basil and cooked noodles to chicken; toss gently to coat each strand with sauce.Photo by Laura Murray, Food Styling by Pearl JonesHow would you rate Chicken and Mushroom Sauced Noodles With Thai Basil?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleLOL. Now you're all locked behind a paywall. How nice. Time to cancel my subscription with you.Ben Spencer-CookeCalifornia2/6/2022LOL. Now you're all locked behind a paywall. How nice. Time to cancel my subscription with you. Anonymous2/6/2022Made this using all of the listed ingredients (yay local markets!). Even though hoisin was a suggested substitute I added a little in addition to the bean paste/miso for the sweetness. In the end the flavors really balanced out nicely. I suggest that you DO NOT skip the \"cup of water\" step to make sure that your sauce is balanced and not too salty.  Very excited to have this for leftovers! I suspect it will only improve.Clarissa MelanLos Angeles1/6/2022Absolutely love this recipe. As one other commenter said, 16 oz of dried noodles, once cooked, is WAY too much noodle for this dish. 10-12oz of noodles is better, try cooking that much and then adding them slowly to the sauce in the pan, tossing to coat. Stop when you have the noodle to sauce ratio you want. The sauce is so flavorful that you can add more noodles than you think, but still, think the full 16 oz is overwhelming if using dry. Overall, love this recipe so much. Anna SeePortland, OR1/2/2022I cook this often using hoisin sauce and adding some shredded carrots and sliced scallions.  I think eggplant would also be a yummy addition for more veggies.\n\nWhile some people are using white miso and rice vinegar to good effect, I think the flavor profile is very different from red miso and Black vinegar, which is more similar to balsamic in flavor.JodiNYV12/19/2021I made too many substitutions and ruined this dish (rice vinegar for black, white miso for red, poblano for Thai chiles, regular soy sauce for dark, and oyster sauce for the tianmianjiang). It came out way too salty, needed more heat, and definitely needed more vegetables. My own fault for stretching my cupboard too thin instead of just going to the store. FYI: About 8-10oz of dried noodles is the appropriate amount to sub for 16oz fresh.Lauren DProvidence RI10/12/2021I didn't have chicken, mushrooms, the bean paste, red miso or black vinegar so I just made the sauce subbing hoisin, white miso, and seasoned rice vinegar, used ramen noodles from a package, slapped an egg and some sesame seeds on it, and it is a DELICIOUS lunch!  This recipe is nothing if not adaptable :) SydneyGreensboro, NC5/7/2021The sauce is really yummy, but I think its important to make a distinction between dried and fresh noodles. I used 16 oz. of dried noodles, and the sauce to noodle ratio is way off. 16 oz of dried noodles and 16 oz of fresh noodles are not the same!!Julia PUlm, Germany4/20/2021This was everything I wanted in a sticky, sweet n' salty noodle dish! The flavors from the red miso, vinegar, dark soy sauce, and tian mian jiang were incredibly complex and perfectly paired with the garlicky-spicy chicken and mushrooms. I used fresh ramen noodles (shoutout to Sun Noodles) and loved the chewiness with the rich sauce. Don't skip the Thai Basil as that fresh anise flavor really came through! I found everything in Asian markets and am pumped to now have these ingredients I otherwise wouldn't have known about. Will definitely be making this again - highly recommend! Katie GNew York, NY3/5/2021This was SO good. Found everything I needed at a local Asian market (and for cheap, too!). I doubled the recipe and added less water since there was a ton left from the chicken. This is definitely going into my favorites folder. :)Drew JCorvallis, Oregon2/15/2021Waaaaayyyy too salty! Hannah The Netherlands2/10/2021This was an excellent recipe. I used hoisin sauce instead of bean paste and added toasted cashews as a garnish. Will make this again for sure. JudiSForest Hills, NY2/10/2021Really tasty, with maybe a little room for improvement depending on ingredients. I used white miso instead of red, rice vinegar instead of black, and hoisin instead of red bean paste. Still made for a nice salty/sweet/spicy rich sauce and I think all those subs work great! I used dried lo mein noodles and that's where I think it could be improved - even with substantial rinsing etc after cooking, the noodles were still quite starchy & sticky, which absorbed a lot of the sauce and made the dish more gummy than glossy.  Still comforting and tasty though. Next time I will try to find fresh noodles, and I might also use even more mushrooms since they turned out nice and rich and punchy after simmering. AnonymousCambridge, MA2/9/2021Very tasty, added onions and ginger to make a little more flavor.  Will definitely make this again.  ScottOregon2/8/2021Sounds good, but I don't eat chicken. What piece of Beef would work best for this dish.LizzieBTexas2/7/2021Explore Bon AppétitChicken ThighChickenPoultryShiitake MushroomMushroomVegetableEasyWeeknight MealsMainDairy-FreeSautéDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-31", "author": ["Condé Nast", "Betty Liu"]}