{"id": "efb5c21b7270d4777f2b4451cc79bed9", "url": "https://www.bonappetit.com/recipe/garlic-chile-vinegar", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Garlic-Chile Vinegar Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueGarlic-Chile VinegarBy Andy BaraghaniSeptember 18, 20184.7(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis spicy-tangy-funky condiment will become your secret weapon. Make a big batch (you can also try using different chiles, such as jalapeño, serrano, habanero, Fresno) and add a splash to soups, stews, braises, and creamy dressings. It'll bring some heat, acid, and lots of garlic flavor.IngredientsMakes about 2 cups7red or green Thai chiles8garlic cloves, thinly sliced11½\" piece ginger, peeled, thinly sliced2cups distilled white vinegar1Tbsp. sugar1½tsp. kosher saltSpecial EquipmentA heatproof 1-qt. jarPreparationStep 1Place chiles, garlic, and ginger in a jar. Bring vinegar, sugar, and salt to a boil in a medium saucepan, stirring to dissolve sugar and salt. Pour hot brine into jar; let cool 30 minutes. Cover and chill at least 4 hours before using.Step 2Do Ahead: Garlic-chile vinegar can be made 4 weeks ahead. Keep chilled.How would you rate Garlic-Chile Vinegar?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI found that the following changes make a bit more flavorful vinegar:\nAdd 1 tbsp coarsely ground mixed peppercorns and 1 tbsp crushed mustard seed .\nI added 12 Thai chilies instead of just 7 or 8.\nCut open the Thai chilies and de-seed them, adding the seeds in seperately from the chili's outer skin: also, thinly slice the skin into small pieces.\nI minced my garlic instead of thinly slicing it, but eh.\nFyreDrakonKansas3/13/2019This is so easy and so good. Really brightens up vinaigrettes, tastes great in stir fry and fried rice dishes, and I cannot wait to try a som tum adjacent application with cucumbers. \n\nThanks again, Allicin. ;)AnonymousDurham11/28/2018Explore Bon AppétitCondimentThaiSoutheast AsianAsianThai ChileChileVegetableGingerHerbs & SpicesGarlicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Andy Baraghani"]}