{"id": "efb658033863928ad1ecd92740b1764e", "url": "https://www.bonappetit.com/story/cbn-cannabis", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Is CBN (Cannabinol) the Key to Better Sleep? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIs This Cannabis Ingredient the Key to Better Sleep?First it was all about CBD. Now another compound is getting the buzz.By Charlotte PalerminoJanuary 24, 2019FacebookTwitterEmailPhoto by John RawlingsFacebookTwitterEmailFor something that regulates mood, helps skin glow, prevents illness and is free it’s a wonder Americans don’t prioritize the original detox; sleep. Over a third of all Americans are sleep deprived which, according to the CDC, leads to “increased risk of developing chronic conditions such as obesity, diabetes, high blood pressure, heart disease, stroke, and frequent mental distress.”There are endless options out there for the sleep-needy ranging from holistic to pharmaceutical, but now there’s a chemical in weed that might be added to that list. No, it’s not THC or CBD—it’s Cannabinol, or CBN. While most attention gets paid to the two most dominant chemicals in weed, THC and CBD, CBN is a cannabinoid found only in small doses until the weed ages. As weed oxidizes, THC converts to CBN. Remember the cannabis they found in that ancient Chinese tomb? The most abundant cannabinoid when the lab results came back was CBN.Dr. Jeremy Riggle, the Chief Science Officer of Mary’s Medicinals, clarified that CBN has been a known cannabinoid since the 1940s. Cannabis research is limited due to federal restrictions, but, Riggle says that CBN appears to be similar in many ways to THC but has a “weaker binding affinity for CB1 receptors,” meaning it won’t make you as high but you may get other benefits including drowsiness and a better night’s sleep.Cannabis brands are already starting to market CBN products for sleep. Kinslips recently released Shut Eye, a sublingual strip with 5mg of CBD and 5mg of CBN, Mary’s Medicinals has CBN options, and Mineral, a tincture and topical line that looks like Aesop’s cooler cousin just dropped a CBN-dominant sleep tincture. But is there any real evidence that it works?So far, not really. The most commonly cited source for CBN’s benefits is this report from cannabis testing lab Steep Hill, which likens CBN to diazepam, but the findings were based on extrapolated data from a 1995 study on mice. Dr. Michele Ross, founder of Infused Health and a neuroscientist who focuses on cannabis, noted that preclinical CBN studies show promise in a few realms that could help people stay asleep and is best when combined with other cannabinoids like CBD or THC. It has the potential to reduce inflammation around the eyes (due to lack of sleep), reduce neural and muscle spasms, boost mood, and fight depression: all issues that can interfere with sleep.So while there is some preliminary evidence linking CBN to sleep, most of our knowledge is pre-clinical and anecdotal from doctors like Dr. Alex Capano, Chief Science Officer at Ananda Hemp, who recently helped formulate a sleep tincture for the cannabis lifestyle magazine Gossamer. Called Dusk, the tincture is a custom blend of CBD, CBN, and other compounds that help you sleep. Capano has personally “observed improvements in a several patients with insomnia and restless leg syndrome in patients who use CBD products with higher CBN levels (present at all or up to 0.5mg/serving).” According to Capano the patients didn’t “ respond as well to CBD products with absent or lower doses of CBN.”Until more CBN products hit the market, doctors are likely to recommend CBD and THC–dominant products which are readily available in dispensaries, or, in the case of CBD, online. In the end, getting to the bottom of CBN, like so many other aspects of cannabis, will require the federal government to stop classifying it as a Schedule I drug in the company of substances like heroin, which will allow medical communities to fully study it. In the meantime, brands will continue rolling out CBN products, and—if our national obsession with sleep is any indicator—people will continue to buy them.Explore Bon AppétitHealthyishCannabisSelf CareTrendsRead MoreLifestyle8 Things to Think About Before Going to a DispensaryBy Charlotte PalerminoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-24", "author": ["Condé Nast", "Charlotte Palermino"]}