{"id": "efb870dfc140f79136d5248bf1fd42cd", "url": "https://www.bonappetit.com/story/lunar-new-year", "year": 2022.0, "month": 1.0, "day": 5.0, "content": "My Lunar New Year Menu Brings a Taste of Taipei to My NYC Apartment | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Lunar New Year Menu Brings a Taste of Taipei to My NYC ApartmentA mini menu festive enough to channel the spirit of the holiday, even thousands of miles from home.By Jessie YuChenJanuary 30, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaFacebookTwitterEmailFor as long as I can remember, the Lunar New Year has been the most important holiday of the year. Sure, you might say I’m biased because I’m from Taiwan. But it’s not just in my head: Billions of people across the world celebrate the Lunar New Year. And with hundreds of millions of them returning home to visit their families, it’s one of the planet’s largest human migrations.The beauty of the Lunar New Year is that many cultures, from Malaysia to Korea to Vietnam to Tibet to China, celebrate it in their own unique way. While I might not be an expert on how every group celebrates this special holiday, I have celebrated the Taiwanese Lunar New Year more than 20 times.In Taiwan the rituals and traditions revolve around welcoming the new year and spending time with family. There are clear rules for what to do each day, whether that’s decorating spring couplets—propitious verses, written in black or gold ink on red paper, that express luck in the year to come—the day before the new year; wishing each other good fortune (we say “wish you get rich” as a greeting); staying up past midnight on New Year’s Eve (the literal translation for this practice is “guarding the year”); or wearing new clothes. And of course, a big festive meal is an essential part of the holiday.While it might be challenging—if not impossible—to host a large meal for a crowd this year, I think we can still find ways to celebrate and pay tribute to the traditions. My mini-but-festive menu fills my diaspora stomach with nostalgia, bringing a little Taipei to New York for me—I hope it brings joy to your table.The riceFirst up is youfan, my favorite rice dish of all time. This Taiwanese sticky rice specialty is enjoyed on special occasions, like when a baby turns one month old. It’s got a satisfyingly dense texture and is usually flavored with umami-intense ingredients. My version is made with fried ginger, dried mushrooms, dried shrimp, black sesame oil, fried shallots, rice wine, and soy sauce. Everything gets steamed together in one bowl so that the glutinous rice can absorb all the delicious flavors. To make this dish vegan and gluten-free, omit the shrimp and seek out gluten-free soy sauce.Mushroom YouFan (Taiwanese Sticky Rice)This deeply savory (and vegan!) take on Taiwanese youfan will make a gorgeous addition to any Lunar New Year feast.View RecipeThe mainFor the main dish I’m making something traditional: steamed whole fish. What you cook and eat on Lunar New Year’s Eve is all about auspicious puns, and the whole fish is a classic example. It symbolizes excess fortune for the year because the word fish in Mandarin sounds the same as the word for “excess.” And who doesn’t want to carry over extra fortune into the coming year?But since it can be challenging to steam a whole fish at home (you need a big pan and some bulky equipment), I opt for a smaller fish. And my twist is that I steam it directly on a bed of aromatics (in this case, onions, scallions, and ginger) rather than on a plate set atop a rack. The result is an excellent whole fish that checks off the prosper-pun box, plus incredibly saucy vegetables to serve it with.Jessie’s Special Steamed Whole FishA showstopping whole fish is a Lunar New Year staple. Assistant food editor Jessie YuChen’s version is straightforward yet stunning, doesn’t require any special equipment, and did we mention it’s absolutely delicious?View RecipeThe greensWe can’t have a proper dinner without some greens, and I love this tasty cucumber salad from chef Justin Lee of Fat Choy. It adds the necessary freshness to the spread, and it’s a simple side dish everyone loves.Smashed Cucumber SaladThis refreshing, saucy cucumber salad will cool you down all summer and is fun to make with kids in the kitchen.View RecipeThe sweetFinally, let’s end the meal with something sweet: mochi-stuffed jujubes, or as we call them in Taiwan, 心太軟 soft hearts. It’s a beautiful dessert in which dried jujubes—a common ingredient in East Asian desserts and herbalism—are filled with balls of glutinous rice flour dough, then simmered in (and doused with) a simple syrup infused with dried osmanthus flowers. The fruity, woodsy aroma of the jujubes pairs with the floral, honeyed syrup, and their dense, spongy texture complements the chewy mochi.Mochi-Stuffed Jujubes (Soft Hearts)These mochi-stuffed jujube dates in syrup are the Lunar New Year dessert that’s (almost) too adorable to eat.View RecipeThis dessert is also my own attempt at an auspicious pun for the next year: We all went through challenging times over the past couple of years, and I hope we can soften our hearts and treat each other gently in the next year. My wish is that we can be like soft mochi, easily bent but too stretchy to break.Explore Bon AppétitcookingLunar New YearRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-30", "author": ["Condé Nast", "Jessie Yuchen"]}