{"id": "efbfb950c9b72d58edbd2fcdc91490d7", "url": "https://www.bonappetit.com/recipe/tomato-and-egg-drop-noodle-soup", "year": 2021.0, "month": 1.0, "day": 3.0, "content": "Tomato and Egg Drop Noodle Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTomato and Egg Drop Noodle SoupA beloved Hong Kong dish with approximately one billion variations, this soup—which relies heavily on fridge and pantry staples—is meant to be a little sweet and a touch sharp. By Hetty McKinnonJanuary 17, 20214.3(81)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThe combination of tomato, egg, and noodles is a beloved dish in the cuisine of Hong Kong cha chaan teng, tea cafés that date back to the 1850s. There are many variations of this dish: Often, the egg is scrambled and mixed through a tangy tomato and macaroni soup; other times, a thick tomato soup is served with instant noodles and a fried egg on top. This recipe takes its cues from dan faa tong, which translates to “egg flower soup” (more commonly known as egg drop soup), a reference to the way the egg flocculates and blooms when dropped into the boiling soup. Canned tomatoes make this recipe a year-round dish, and the diced variety used here adds texture to the soup. If you’d prefer, use crushed tomatoes, which will provide you with a smoother soup. This soup is designed to be a little sweet and a touch tart, so adjust your sugar and salt as needed until you achieve this balance. —Hetty McKinnonAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMaggi Seasoning$15 At AmazonOXO Good Grips® Smooth Edge Can Opener$22 At AmazonWinco 8-Ounce Stainless Steel Ladle$10 At Amazon8-Inch Chef's Knife$47 At AmazonLarge Saucepan with Lid$39 At AmazonCutting Board$10 At IKEAColander$11 At AmazonWooden Spoon$6 At AmazonWhisk$10 At AmazonNew Star Foodservice Measuring Cups and Spoons Set$13 At AmazonPyrex 4-Cup Measuring Cup$8 At Bed Bath and BeyondIngredients4 servings2½tsp. Diamond Crystal or 1¼ Morton kosher salt, divided, plus more1small yellow or red onion2garlic cloves11\" piece ginger1scallion12oz. instant ramen or other wheat noodles2Tbsp. grapeseed or vegetable oil128-oz. can diced tomatoes4cups low-sodium vegetable broth or water4large eggsPinch of freshly ground white pepper3Tbsp. (or more) light or dark brown sugar or granulated sugarToasted sesame oil or chili oilMaggi seasoning sauce or soy sauce (for serving)PreparationStep 1Fill a small Dutch oven or large saucepan with water, season with salt, and bring to a boil.Step 2While water is coming to a bowl, prep your vegetables. Peel 1 small yellow or red onion, halve, and thinly slice into half-moons. Smash and peel 2 garlic cloves, then finely chop. Scrape skin from one 1\" piece ginger with a spoon. Thinly slice ginger; stack slices two at a time and cut into matchsticks. Line up matchsticks and cut crosswise into tiny squares. Finely chop 1 scallion; set aside for serving.Step 3Add 12 oz. instant ramen or other wheat noodles to the pot of boiling water and cook according to package directions until just tender. Drain in a colander and rinse under cold running water; set aside. Dry pot and reserve.Step 4Heat 2 Tbsp. grapeseed or vegetable oil in reserved pot over medium-high. Add onion and cook, stirring constantly, until soft and golden, about 5 minutes. Add garlic and ginger and cook, stirring, until fragrant, about 30 secondsStep 5Add one 28-oz. can diced tomatoes and 4 cups low-sodium vegetable broth or water to pot. Reduce heat to medium, cover pot with a lid, and cook broth until flavors have come together, 10–15 minutes.Step 6Meanwhile, whisk 4 large eggs, 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt, and a pinch of freshly ground white pepper in a large measuring glass or a small bowl with a lip.Step 7Uncover broth and stir in 3 Tbsp. light or dark brown or granulated sugar and add ½ tsp. Diamond Crystal or ¼ Morton kosher salt. Taste and add more sugar and/or salt if needed. The broth should be slightly sweet and a little tart.Step 8Increase heat to medium-high and bring broth to a boil. Very slowly trickle beaten eggs into soup (no need to stir). Cook eggs until set, 30–60 seconds from when you start pouring. Remove soup from heat. The egg doesn’t need to be totally cooked through—it will continue to cook in the residual heat of the broth.Step 9Rinse noodles under running water again to loosen them up. Divide among 4 bowls and ladle soup over. Drizzle with toasted sesame oil or chili oil and Maggi seasoning sauce or soy sauce and top with reserved scallions.How would you rate Tomato and Egg Drop Noodle Soup?Leave a ReviewTell us what you thinkReviews (18)Back to TopTriangleWe really enjoyed this dish for a comforting lunch time meal - not sure how some reviewers ended up with a taste like spaghetti-o's?! The fresh ginger sang throughout the soup, and the sugar / salt balance was spot on for me. Followed recipe exactly but split it in half for 2 people. Also, crispy chilli flakes / oil + sesame oil drizzle are a must! Yum.RGMelbourne, Australia3/22/2022Loved this- a great combo of simplicity and flavor! A comfort meal with a kick. Meredith2/26/2022I really liked this! I ended up adding more salt than the recipe said because I personally like the mix of tomatoes and salt, and I also added some fresh ground white pepper to the broth while it was cooking. I also only had fresh tomatoes on hand, and those took about 5 more minutes to simmer than the recipe said. All in all, I would make this again!JessieSeattle, WA1/11/2022Had high hopes for this. Honestly it just taste like SpaghettiOs.MarthaBroomfield CO12/22/2021This was yummy! A comforting and flavorsome dish. That said, 12oz is a lot of noodles for what is a pretty low volume of water. It did feel more like soupy noodles rather than a noodle soup. Still tasty. TimothyChicago, IL12/11/2021This was super tasty!! I added 1/2 lb. shrimp for the last few minutes. Will definitely make again. Anonymous11/23/2021Really good! A surprising combination of simple ingredients that makes a tasty meal!JudyAllentown, PA11/9/2021I made this pretty much as is (rare for me), and it was quite tasty. It’s pretty quick, especially if you use instant ramen and keep garlic ginger paste in the fridge. I added a bit of soy sauce and also sesame oil, because I have become a sesame oil addict and needed my fix. Topped with chili oil too. Sunny5/14/2021This was quick, easy, and delicious! Made with rice vermicelli (cooked just before serving by pouring boiling water over and letting them sit a few minutes) and tamari to make it gluten-free, and used black pepper because that’s what I had on hand. My partner and I got two dinners and a lunch out of this recipe (storing the broth by itself and cooking more noodles for each batch). Forgot to add the soy and sesame at the end for one reheat and it was noticeable so definitely don’t skip it!Anonymous2/10/2021I made this recipe with fresh ramen noodles (went by the back of the package as to what constituted 4 servings) instead of instant. I omitted the sugar and think the recipe was super tasty and quick MirandaCalifornia2/10/2021People be like \"I did not have any of the ingredients, so I made a completely different dish, substituting the recipe's ingredients for my own based on my liminal judgment of Chinese cooking and flavors. 1/5 stars; this was nothing like my local takeout place. >:(\" Spoiler alert: not everything has to be bright and punchy or overly fatty and cheesy to be a solid dish. Wow, it's almost as if different cuisines have different flavors.\n\nThis was great. I didn't find it bland at all. It's very soothing—I grew up eating HK stir-fried eggs and tomatoes, and I'd make it again exactly as is.Anonymous2/7/2021I thought flavors of this soup were wonderful. However, recipe calls for too many noodles. Next time I’ll reduce by half.LynneMorgantown W 1/29/2021I was not impressed with this recipe. The flavors were bland. I would add more ginger some white miso paste and more veggies? This was a bland tomato soup to me. Not my fave BA recipe.NatalieAustin Texas1/28/2021This was great!  I grew up in a Taiwanese-American household eating corn egg drop soup and stir-fried tomato & eggs, but never had tomato egg drop soup before.  I made this for breakfast (without the noodles, but with a slice of toast) and my SO requested it for breakfast the rest of the week.  I topped with a pinch of white pepper and a little drizzle of sesame oil during serving, as is my family tradition.MichelleSAN MATEO COUNTY, CA1/27/2021This was horrid. AnonymousSomewhere where there’s real Chinese soup1/24/2021Explore Bon AppétitSoupSoups and StewsChineseEast AsianAsianCantoneseRamen NoodleNoodlePasta & NoodlesEggCanned TomatoTomatoVegetableWeeknight MealsEasyMainVegetarianDairy-FreeNut-FreeSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-17", "author": ["Condé Nast", "Hetty Mckinnon"]}