{"id": "efc351fdce594f88d546b5591d04168c", "url": "https://www.bonappetit.com/story/emergency-shrimp-tacos-made-for-weeknights", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "These Emergency Shrimp Tacos Are Made for Frantic Weeknights | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Emergency Shrimp Tacos Are Made for Frantic WeeknightsYou can go from frozen shrimp to dinner in 20 minutes.By Alyse WhitneyJuly 10, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailSometimes the most memorable dinner parties start with the biggest disasters. Last week, I decided to make chipotle–honey shrimp tacos on a random Wednesday night for a couple of friends who live in my neighborhood. I ordered everything from Instacart to arrive when I got home, thinking I would save myself some precious shopping time and, well, it was a miserable 98° outside. (I do not cherish you.) I arrived home to a bag full of groceries and got straight to work. After stirring together maybe the simplest marinade of all time (equal parts adobo sauce from a can of chipotles in adobo and honey), I realized that they accidentally delivered cooked shrimp instead of raw.I dropped what I was doing and ran down the block to find raw shrimp. (Okay, maybe I didn't run—it was hot as hell out there—but I was definitely frantic.) The first two stores that I went to didn’t have fresh peeled, deveined shrimp, so I grabbed a pound of frozen and Googled around for some guidance on how to thaw frozen shrimp in a hurry. (It worked out anyway because frozen shrimp are actually fresher than “fresh,” by the way.) It’s surprisingly simple: Put frozen shrimp in a bowl of cool water while you prep other ingredients. That's pretty much it. You may have to change the water once or twice, but they should thaw in 15 minutes or less. Now if you forget to put shrimp in the fridge to thaw or don’t want to pay a premium at the fish counter for thawed shrimp the day of, this will be your saving grace.The rest of the tacos were a cinch too. I chopped cabbage and cilantro, massaged thinly-sliced red onions in lime juice and salt to soften and flavor them, and warmed up corn tortillas. The pièce de résistance is the sauce, which is not your typical sour cream. It's mayonnaise with a clove of grated garlic, a pinch of salt, and secret ingredient...water. Yes, water. It thins down the sauce to a drizzle-able consistency and creates a crema-esque sauce that you may be tempted to dip your entire taco into. To taste test cooked shrimp, I dipped one straight into the sauce with no regrets. It has just enough of a bite from garlic, is super creamy, and it got rave reviews from friends who couldn’t tell that it was mayonnaise but loved the taste and texture. I could see this as a great sauce for grain bowls, a dip for crudités (like a thinned-out aioli!), or the perfect sauce to pour all over crispy roasted potatoes.And those shrimp? They cook so fast! I heated up the pan with some neutral oil and let those shrimp sizzle for two minutes per side. The sugars in the honey caramelize quickly and almost blacken the shrimp, so there may be a little smoke in the apartment. It’s important to have your taco-building station ready so you can get hot shrimp into the tortillas and top ‘em quickly. The adobo sauce that mingled with the canned chipotles lends smokiness and a little spice, but the honey balances things out. I misread the directions and just cooked the shrimp instead of pouring the marinade in the pan, but I think that helped them caramelize more deeply rather than getting sauced up.The next thing I knew, the entire skillet of shrimp had disappeared. We had sundaes for dessert, my friend did the dishes, and suddenly all the stress of searching for last-minute shrimp melted away. My two new favorite routines: weeknight dinner parties and chipotle–honey shrimp tacos.Get the recipe:Honey-Chipotle Shrimp TacosThese easier-than-easy shrimp tacos are packed with flavor, and ideal for busy weeknights.View RecipeExplore Bon AppétitTacoShrimpWeeknightBasicallyRead Morerecipes34 Taco Recipes for Cinco de Mayo (or Any Day)Gallery34 SlidesBy Bon AppétitcookingHow to Not Overcook (or Undercook) Your ShrimpBy Alex DelanycookingFrozen Shrimp Are Actually Fresher Than \"Fresh,\" and Other Things You Should KnowBy Alex DelanyBA's Best GuacamoleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Alyse Whitney"]}