{"id": "efd35303dfb21ccbc4fd8224cbbc99f2", "url": "https://www.bonappetit.com/story/julian-fellowes-dinner-party", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Julian Fellowes, Creator of 'The Gilded Age,' Would Party With Its Real-Life Socialites | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Gilded Age’s Creator Julian Fellowes Would Party With Its Real-Life SocialitesAt his dream dinner party, the director and screenwriter would serve coronation chicken and crepes Suzette.By Dawn DavisFebruary 14, 2022FacebookTwitterEmailIllustration by Lauren TamakiFacebookTwitterEmailWelcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.Dinner parties were never dull in Downton Abbey, Julian Fellowes’s breakout upstairs-downstairs drama. And they surely are not in his latest show, The Gilded Age, or his new film, Downton Abbey: A New Era either. Here the author, screenwriter, director, baron, and member of the UK’s House of Lords reveals who he’d have at his own fantasy fete.You have two period pieces out now which focus on English and New York society, respectively. Which group of characters would you prefer to party with?New York would have been more fun. At the time the ways of the English were all quite settled and seemingly low-energy. But in New York, Mrs. Astor had forged this new society, mixing the old families and the old money with the new arrivals who came with great fortunes and built their palaces up and down Fifth Avenue. Their parties, with people like Alva Vanderbilt and Jay Gould, would have been pretty good fun.If you could invite any three people—dead or alive—who would they be and why?Apart from my wife, of course, I’d have to invite Marilyn Monroe. The thing about movie stars is in order to be emotionally moving, they must convey a sense of needing the viewer’s help. Marilyn had that more than anyone. You wanted to get her safely through the story. I’d also invite Ella Fitzgerald, my all-time favorite singer. There was mastery in the way she took possession of a song. I’d also like to learn what it was like to be a Black woman who was a huge star at a time of ubiquitous racist persecution. Like the time she was traveling to Australia for one of her greatest tours, and she and her companions were thrown off the plane. The third guest would be novelist Anthony Trollope. I’m president of the Trollope Society, and while many look down on him, as if he were writing soap operas instead of proper dramas, I believe he had a much more modern take on people. His heroines were never all good—they’re not Dickens’s sainted angels wearing white—and his villains were never all bad.Like Thomas Barrow from Downton Abbey, a perfect villain. Where do you host?In my dining room in Dorset, with its long table and Gothic chairs. We’d use the china with the family crest and turquoise trim, and the room would be lit with silver candlesticks. What do you serve?We’d start with ice-chilled vichyssoise, followed by coronation chicken, a cold dish with a sauce made out of cream, mayonnaise, apricot jam, onions, and curry. It was invented for the present queen’s coronation and is absolutely delicious. For pudding, crepes Suzette with Cointreau in it, served with a glass of Beaumes-de-Venise.What’s the opening conversation starter?These guests and I have been up against people who didn’t believe in us. Producer Darryl Zanuck and others didn’t think Monroe was really an actress. Ella Fitzgerald was rejected by the establishment. I’ve had my material dismissed by many. You have to find your own faith in yourself. When I meet young people who are in a similar situation, I say to them, “Stay away from those who don’t believe in you. Later on, when your career has fallen into place, you can pick them up again. But in the beginning, there is a limit to how much negativity you can withstand.”Explore Bon AppétitDream Dinner PartyPop CultureInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-14", "author": ["Condé Nast", "Dawn Davis"]}