{"id": "efd4129a06d179743ce621c54e98b22e", "url": "https://www.bonappetit.com/story/afternoon-restaurant-gainsville", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "I’d Gladly Spend My Entire Day (and All My Money) at Afternoon Restaurant in Gainville | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’d Gladly Spend My Entire Day (and All My Money) at AfternoonPop over for a popover; stay all day for the chill vibes.By Zoë SessumsApril 12, 2019FacebookTwitterEmailPhoto by Nicolette PerdomoFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I spent roughly 25 years living in Gainesville, Florida. I think it’s accurate to say I know nearly every crack in the sidewalk, every back street shortcut, and every place to get a pancake. I know that refreshes to empty lots and buildings often take decades—a prominent corner of the city sat as an unresolved, vacant patch of dirt for most of my upbringing. I know that the selection of places to eat midday are slim pickings, if you want something thoughtfully prepared. So, when Afternoon opened up in the fall of 2017, it was an exciting update to a neighborhood best known for its Publix Supermarket and burger drive-thru spot. With its beautiful tile work, handmade ceramics, excellent record selection, and other highly curated vibes that owners Grace Glennon and Kyle Spor brought back with them after a time living in Portland, Oregon, the place is a venerable lunchtime oasis. Sure Friday and Saturday night are just as wonderful with Afterdark, their limited dinner menu full of farm-fresh produce and citrusy little cocktails. But its dishes like a Dutch baby with Florida oranges and thyme maple syrup, shakshuka with homemade sourdough toast, cold brew slushies, and a seasonally changing pastry case that make it the perfect place to while away the day. With all its sophistication, variety, and abundant sunlight, it’s enough to make me wish the sun never set on Gainesville at all.Go There: AfternoonExplore Bon AppétitHighly RecommendRestaurantsFloridaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-12", "author": ["Condé Nast", "Zoë Sessums"]}