{"id": "efddd554dcbaeeac8359fd3f7e086fa6", "url": "https://www.bonappetit.com/story/kewpie-sesame-dressing", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "If You’re a Kewpie Mayo Loyalist Like Me, You’ll Love Kewpie Sesame Dressing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf You’re a Kewpie Mayo Loyalist Like Me, You’ll Love This Sesame DressingIt’s tangy, nutty, and super versatile.By Elyse InamineApril 2, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I first bought this sesame dressing because of my reverence for the Kewpie brand. (They put MSG in mayo! Respect.) The mottled, miso-hued liquid initially looked sugary-sweet—like something from Newman’s Own—but where was the flaccid plastic bottle I love-hate?! This one came in glass, and it called to me from the shelves of the Japanese supermarket I was in. Seeing “Kewpie” in all caps on the label was all I needed to gingerly plop it into my shopping basket. It was a guarantee of delicious things ahead, an invitation into the Kewpie lifestyle.Now, several months into living that #Kewpielife, I have a minimum of two bottles in the fridge at all times.It is nectar of the umami gods. It’s super savory, thanks to soy sauce and sesame seeds (and, surprisingly, no MSG), balanced with zingy vinegar and brown sugar. But my favorite thing about this salad dressing is that it’s got body. It’s not one of those thin, salty, mouth-puckering vinaigrettes; it’s cloudlike and creamy like toum. It makes eating my vegetables feel less virtuous and more indulgent.A generous drizzle of this sweet-savory liquid gold gets me out of my lunch rut, perking up soggy leftover lentils and my thousandth serving of roasted broccoli. This dressing has replaced ranch for all my raw veg needs (healthier snacks!) and will make its debut at picnics in the park very soon. More often than not my husband will bring out the bottle for whatever we’re eating, from pan-seared salmon to mille-feuille nabe.At BA, we tend to gravitate toward hyperbole when we talk about things we like, but that’s the only way to talk about this sesame dressing. On the Kewpie site there are 2,458 (and counting) glowing reviews. Some have compared this salad dressing to The Empire Strikes Back (“you can't imagine life without it”). Some reviewers are actually just desperate customers looking for a fix because their Costco stopped selling giant jugs of it (to which I want to respond, “You can buy it right here, on Amazon.”).There’s just something about this tangy-sweet, sesame-seed-flecked dressing that thousands of us can’t shake off. It brings a little joy wherever it goes, and you notice it when it’s gone, which it never will be in my house, because of my aforementioned two-bottle rule.In the meantime I’ll keep scouring the shelves of my Japanese supermarket, looking for the next Kewpie condiment to add to my collection.Photo by Emma FishmanKewpie Deep-Roasted Sesame Dressing$17 at Amazon (Pack of 2)Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-02", "author": ["Condé Nast", "Elyse Inamine"]}