{"id": "eff0c7611e5f472b6d141bed188c1d33", "url": "https://www.bonappetit.com/story/homemade-bagel-chips", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "Bagel Chips: How to Make Them at Home  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBagel Chips Give Stale Bagels Another Chance at LifeEvery bagel deserves a second chance.By Alex DelanySeptember 25, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed.I wish I could have been there when the first bagel chip was made. Like Edison inventing the lightbulb or Marie Curie discovering radioactivity or the series finale of The Sopranos, it feels like a monumental moment, an important step forward for human kind. I’m sure cars stopped, jaws dropped, and the ground shook. Because, in case you forgot, bagel chips rule. And we should be eating more of them.And lucky for us, we can up our bagel chip intake pretty easily—and I don't mean by going to the store and buying a bag. Nope. Because with ten minutes, you can make your ow bagel chips, right at home. All you need is some leftover, nearly-stale bagels. If you’re anything like me (meaning that you cannot enter a bagel shop without buying a dozen), you just might have some hanging around. (Maybe you're keeping a bag in the freezer in anticipation of the day you thaw them for a cured salmon party? Those are fair game, too.)Whether it’s one, two, or ten old bagels, you should be making them into bagel chips. You’re cheating yourself out of a phenomenal snacking experience if you don’t. Here’s how:I’ll start by saying that you should be using everything bagels, for no reason other than the fact that they are the best type of bagel. The best type of bagel makes the best type of bagel chip. That’s science. Look it up.Eggplant dip is great with bagel chips. Just saying.\nPhoto by Chelsie CraigIf your bagels are frozen, thaw them. If they’re at room temperature, don’t do anything to them. You’re good to go. Heat your oven to 450° and use a bread knife to slice across the bagels (yes, this is the opposite way you'd normally cut) into 1/4\"-thick coins and ovals. Toss the pieces in a large bowl with a few glugs of olive oil and a couple pinches of kosher salt.Spread the slices across a rimmed baking sheet in a single layer so that none of the pieces overlap. Toast them in the oven for about 5 minutes, until chips start to brown. Flip them and toast the chips for another 5 minutes, until both sides are golden brown. Well, would you look at that. You made bagel chips.Now, although you may have been giddy with joy as you were making these bagel chips, the real fun starts when you put them in a bowl and serve them with a dip of some sort. Maybe it's slow roasted onion dip. Maybe it’s eggplant dip. Maybe it’s hummus. It really doesn't matter. What matters is that you—just like the first person to make a bagel chip, all those years ago—did the important work. You turned old bagels into one of the world’s most amazing dip delivery vehicles. You’re amazing. You deserve an award. Or a bunch of bagel chips.You know what else is easy? Yup, herby ricotta dip.5-Minute Herby Ricotta Dip, Because Vegetables Taste Better with CheeseLife is all about balance, isn't it? This easy ricotta dip makes eating your veggies a pleasure, not a chore.View StoryExplore Bon AppétitIt's That SimpleChipsDipBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-25", "author": ["Condé Nast", "Alex Delany"]}