{"id": "eff15bcd62de2edb33e19bd67dffdc08", "url": "https://www.bonappetit.com/recipe/shishito-pepper-pistachio-dip", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Shishito Pepper Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueShishito Pepper–Pistachio DipBy Konbi, Los Angeles, CASeptember 17, 20194.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThe chefs at Konbi in Los Angeles (No. 1 on our 2019 Hot Ten list!) serve this creamy dip with crunchy vegetables, but we found it’s also great with meat, spread on sandwiches, or thinned out with water and used as a salad dressing.Ingredients4 servings⅔cup raw pistachios6scallions, chopped12oz. shishito peppers (about 5 cups), seeds removed, coarsely chopped4cups carrot tops or parsley leaves with tender stems1toasted nori sheet, coarsely torn2Tbsp. unseasoned rice vinegar2Tbsp. white soy sauce½cup soft tofu (preferably Meiji Supreme)¼cup vegetable oilCrunchy vegetables (such as carrots, radishes, celery, and/or cucumbers; for serving)Ingredient InfoWhite soy sauce, also known as white shoyu, is lighter in color and flavor than standard soy sauce. It can be found at Japanese markets, in the Asian foods section of some supermarkets, and online.PreparationStep 1Preheat oven to 350°. Toast pistachios on a rimmed baking sheet, tossing halfway through, until golden brown, about 5 minutes. Let cool; set aside.Step 2Meanwhile, bring a medium pot of water to a boil. Boil scallions, peppers, and carrot tops until peppers are tender, about 5 minutes. Using a slotted spoon, transfer to a bowl of ice water and let cool. Drain and squeeze out as much excess water with your hands as possible. Transfer to a plate and chill in freezer 5 minutes (this will keep the dip bright green).Step 3Finely grind nori in a blender; transfer to a small bowl. Wipe out blender, then blend vinegar, soy sauce, and reserved nuts in blender until nuts are coarsely chopped. Add chilled vegetable mixture along with tofu and blend, streaming in oil, until very smooth (this may take up to 4 minutes, depending on your blender). If mixture seems thick, add 1 Tbsp. water to loosen.Step 4Transfer dip to a bowl and sprinkle with nori powder. Serve with vegetables alongside for dipping.How would you rate Shishito Pepper–Pistachio Dip?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI can't believe there are only 2 reviews of this dip. It is SO good! I used parsley instead of carrot tops. I grow shishitos and have a good crop of them currently. The flavor is mild, not spicy and the texture is so creamy and luscious.Natalie MatzOmaha, Ne7/17/2021Absolutely outstanding. Gorgeous dish to serve to the family Jane doe Boston MA4/7/2021Quite delicious. The soy and pistachios provide a good strong umami flavor backdrop. While the carrot tops are an interesting idea and provide nice flavor, the practicality is that they also add a stringy fibery texture...unless you want to remove ALL the stem pieces from the carrot top leaves.. I would go with parsley in the futureacookfromdetroit10/1/2019Explore Bon AppétitDipPistachioNutShishito PepperVegetableTofuOther IngredientsSnackStarterVeganVegetarianDairy-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Konbi", "Los Angeles"]}