{"id": "eff2bf489fb16affa24a13fc66c02106", "url": "https://www.bonappetit.com/story/vegetable-forward-cooking", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "How 'Vegetable-Forward' Became Just the Way I Eat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow 'Vegetable-Forward' Became Just the Way I EatAt Adam Rapoport's house, meatloaf is not what's for dinner anymore.By Adam RapoportJanuary 17, 2018FacebookTwitterEmailIllustration by Camilo HuincaFacebookTwitterEmailAt the Rapoport household in the 1970s, you got salad every night with dinner. The same salad. Iceberg lettuce, some underripe tomatoes, and a few cucumber coins. “Eat your salad or you don’t get dessert.” That was the refrain.Finishing it was easy, in that it didn’t really taste like much—other than the Thousand Island dressing that my brother and sister and I glopped on top.I don’t mean to throw my mom under the bus. She was a top-notch home cook, and still is. But back in the day in Washington, D.C., let’s just say that she wasn’t exactly, to borrow a current restaurantism, “vegetable forward.” A native Wisconsinite, she had a repertoire of meatloaf and mashed potatoes, brisket, breaded veal chops for my dad’s birthday. As kids, my brother and sister would fight over the crispy bacon strips affixed atop the weekly meatloaf. They were good days.You can make the Brassicas Bowl from Two Hands at home.\nLaura MurrayFast-forward to 2018.As I write this letter, I’m sitting in an exceptionally cheery Aussie-owned, all-day café in Tribeca called Two Hands. I’m eating what the menu terms a Brassicas Bowl—a tangle of kale, shaved brussels, and charred broccolini; a jammy 7-minute egg; half an avocado; and a swoosh of hummus. Which, as it happens, is basically what I made for dinner the previous night, swapping in some farro and roasted butternut squash.Not that I eat this way all the time. I firmly inherited my parents’ penchant for the meaty things in life. My ten-year-old son will tell you that I make the best smash burger in New York City, and I’m not going to argue with him.But the breadth of ingredients that I reach for in my kitchen these days is kind of astounding. By going to restaurants like Two Hands and its wave of sunlit siblings, I now come home asking my wife whether we shouldn’t be stirring tahini into our salad dressing. And why aren’t we spooning labneh onto our plates like nearly every cookbook author in America? And how exactly does one cook with turmeric?Not that these ingredients or techniques are new; they’ve been around for millennia. But they’re now easily accessible in the States. And in that inimitable American fashion, professional chefs and home cooks alike are incorporating them in ways that are, at times, “authentic” and other times not. What matters to us here at BA is that they're always delicious.Crudite as done at Healthyish spot De Maria:Explore Bon AppétitHealthyishVegetarianessayRead Morerecipes60 Vegan Dinner Recipes That We Just LoveGallery60 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-16", "author": ["Condé Nast", "Adam Rapoport"]}