{"id": "eff2b67753d5596724b391e4ea88bfbb", "url": "https://www.bonappetit.com/recipe/roast-fish-with-cannellini-beans-and-green-olives", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Roast Fish with Cannellini Beans and Green Olives Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueRoast Fish with Cannellini Beans and Green OlivesBy Claire SaffitzSeptember 18, 20184.3(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue LiEmailPinterestPrintEmailPinterestPrintCreamy cannellinis studded with olives and chile flip the script on baked beans (though you can use chickpeas or butter beans instead of cannellini). This is one of those throw-together dinner recipes that relies on staples like canned beans and lemons; all you have to do is pick up the fish. You could cook said fish in less time on higher heat, but slow-roasting provides the best insurance against overcooking.Ingredients4 servings 4sprigs oregano215.5-oz. cans cannellini (white kidney) beans, rinsed½cup Castelvetrano olives, pitted, tornKosher salt1½lb. whole skinless whitefish fillet (such as cod, haddock, or halibut)2small shallots, thinly sliced into rings1Fresno chile, very thinly sliced into rings2lemons, divided5Tbsp. extra-virgin olive oilPreparationStep 1Preheat oven to 300°. Combine oregano, beans, olives, and ½ cup water in a shallow 3-qt. baking dish; season lightly with salt. Place fish on top and nestle into beans; season fish generously with salt. Scatter shallots and chile over fish and beans. Very thinly slice 1 lemon and wriggle out seeds. Arrange slices, slightly overlapping, over surface of fish. Drizzle everything with oil and roast until fish is opaque throughout and flesh in the center flakes when gently pressed, 25–35 minutes, depending on the type and thickness of the fish. Let rest, occasionally pressing beans down into the liquid so they don’t dry out, 5–10 minutes.Step 2Cut remaining lemon into wedges and serve alongside fish and beans for squeezing over.How would you rate Roast Fish with Cannellini Beans and Green Olives?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleWe omitted the Fresno chiles, but otherwise followed the recipe to the letter. We added a side of kale sautéed in olive oil, lemon, garlic, and salt. We had high hopes for this dish, but the only thing that worked well was the fish texture, which was excellent. The beans just tasted like canned beans, the shallots were mostly raw, the olives looked and tasted out of place amidst the pale beans in the watery broth, and the fish tasted like nothing at all. Overall this \"dish\" was just a collection of random mediocre flavors that did nothing to enhance each other. The only saving grace was our delicious sauteed kale, which masked the other flavors enough to make the whole thing go down.\n\nWe're going to use this as inspiration in the future, but the recipe (as it was written) really is pretty awful. The plan for next time is to start with some nice dried beans, sauté the shallots and garlic, use broth and white wine instead of water, maybe add some other flavors and definitely more salt, cook the whole thing to deliciousness on the stove, and then bake everything with the fish. We'll probably keep the side of sautéed kale, or we might incorporate it into the main dish.BunAppétitCalifornia1/5/2022I followed the recipe as is. It is easy and delicious. Make sure you have some good crusty bread to soak up all those delicious juices. I’ll be making this for my next dinner party for sure. Thanks, Claire!ChrisPutnam Valley, NY12/4/2021I make a variation of this when I have no fresh produce and I don't really feel like doing a lot of cooking. I use frozen tilapia, no olives (never liked 'em), dried oregano (instead of fresh), dried chili flakes (instead of fresh peppers) and ACV (instead of lemon). I don't know how similar it is to the original, but the way I do it is really satisfying and delicious. Salty, tangy, fatty, it hits all the right spots. \n\nThanks for the inspiration, BA!Teun Putker Amsterdam, The Netherlands10/2/2021I also LOVED this recipe with borrowed tips from other reviewers + a couple of my own.  Cassis' review suggested warming in a pot to meld the flavors togther.  I totally agree. I briefly sauteed the shallots and two small cloves of minced garlic until fragrant.  Then added beans, chicken broth (rather than water), oregano (used fresh sprigs but next time I'll use dry), olives, and a couple of thin lemon slices plus a few slices of jalapeno (which were just fine for this recipe) and put the covered pot over a LOW heat for about 20 minutes.  Then remove, place in the baking dish and nestle in fish as indicated.  Top with remaining shallots , peppers, lemon & olive oil.  Note: I added one seeded and sliced sweet red pepper to the (green) jalapenos for color and a little added flavor (will add two next time - yummy).  Bake for 25 minutes at 300 degrees F + 5 minutes under broiler.  The only \"significant\" change I would make next time is to Instant Pot dry cannellinis rather than canned.  I know the original recipe was intended for a quick week night dinner using stuff in your pantry, but canned beans -- even when rinsed -- remain salty and soft.  Another reviewer commented on the single dimensional texture of the dish.  I think taking the extra time (not much) to pressure cook them would be a great improvement.  If, you don't have the extra time -- save this dish for the weekend.  It's truly a winner.  Loved it!ChuckPalm Spring, CA7/29/2021I have made this recipe 3 times now.    So full of flavor .   Change in the techniques in the recipe, though.    A little olive oil in a  3 quart pot.  Add some of the shallot or onion to the oil to cook.  THEN add the beans, water, oregano [dried ok], olives, and some of the thin lemon slices, pepper.   Cook for 20 minutes or more to get flavors together.  THEN when ready for dinner, add the fish, topped with the shallots , hot pepper, lemon & olive oil.  Bake/broil until done.   I baked for the 25 minutes and then gave it  5 minutes under the broiler to toast the lemon slices.  Love this with the fresh halibut now in the stores.cassiswest Tennessee7/1/2021Wow, I make cod with olives and lemons all the time. I can’t believe I never thought of adding cannellini beans - I usually have potatoes at the bottom of the pan. This will be my next fish dinner, as it’s stuff I always have on hand!AntonineGoodyear, AZ4/7/2021My fault for using a frozen white fish from TJs. It happens.  But the fish came out tough and rubbery, even though it was just barely cooked.  However, we LOVED the mixture of castelvetrano olives, cannellini beans, oregano, and lemon.  I did as another reviewer did and replaced the water with chicken stock, which made this became almost a quick cassoulet.  It would be delicious with pork or chicken!  If I made it with fish again I would use a better quality, fresh fish, and probably sousvide it separately.    AnonymousLos Angeles, CA6/17/2020This was delicious. Today I am going to make it again using chicken thighs with the skin removed. I think it will be just as good. I will pre-cook the chickenIn olive oil with lemon and oregano then brown e on top of the beans. AnonymousNew york4/6/2020I loved this recipe, but after reading the negative reviews, I made a small change to the preparation. I was worried that the roasting temperature would be too low for the flavor of the beans to come together but I didn't want to overcook the fish. I minced and sauteed the shallots and peppers in olive oil (plus a small clove of garlic), then mixed the beans and olives into the pan for a few minutes before transferring to the baking dish. I also used dried oregano instead of fresh since it saved a few dollars. Twenty-five minutes at 325 worked well, but this will likely vary depending on thickness of the fish.audzkyMichigan1/4/2020Made this with cod and it turned out great for a fairly quick healthy meal.AnonymousRichardson, Texas1/2/2020This was delightful. I made a few changes due to available items - grouper, and lime instead of lemon, and no olives as I don’t like them. It was just great. I sopped up the juice with some crusty bread. YUMAnonymousSalt Lake City 8/17/2019I am surprised at the bad reviews.  My family raved about this recipe!  It tasted like we were eating at a pricey restaurant.   I have requests to make is again for Easter!  That is why I'm back here printing it again.  WastedTime1970Toms River, NJ4/15/2019I agree with many of the other comments....this recipe was good, but not great. I actually cooked my own beans which helped and added to the flavor and used jalapeno popper instead of fresno chilis.  I found all the textures to be far too similar and will toast up some herbs with crispy panko bread crumbs next time to see if that helps round this out from a texture perspective. I think I will also use less water since it was really soupy. AnonymousMemphis, TN12/10/2018Disappointing. The idea was good. Ingredients are those I’ve used may times before in other recipes. It came together easily and looked beautiful but tasted flat. Something was missing. I agree with the reviewer that said the 300 oven wasn’t hot enough..... but then again, I doubt the tempeture is the problem here. Sorry that I am unable to pinpoint exactly what didn’t work here.GarilynnsSanta Barbara 12/2/2018This was a great recipe! Easy to assemble and cook, great light taste. The Castelvatrano olives were key here. I wish Bon Appetit let you upload photos of your final product here because this one was a beauty!AshleyBrookeWashington, DC11/9/2018Explore Bon AppétitAmericanCannellini BeanWhite BeanBeanVegetableCodFishSeafoodOliveOther IngredientsFresno ChileChileEasyMainDairy-FreeNut-FreeGluten-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Claire Saffitz"]}