{"id": "eff584b46a0fe214595a20152db3c5a0", "url": "https://www.bonappetit.com/story/sushi-bake", "year": 2021.0, "month": 2.0, "day": 1.0, "content": "Sushi Bake Is the Lockdown Trend I’ll Never Stop Making | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSushi Bake Is the Lockdown Trend I’ll Never Stop MakingGood for dinner at home now, great for (eventual) potlucks in the future.By Hana AsbrinkFebruary 4, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.What lockdown food will you be happiest to take with you into the post-pandemic world? Would it be sourdough? Banana bread? Dalgona coffee? The answer for me is a trend that hasn’t quite hit mainland American shores in the same way—yet. It’s the sushi bake, and if there’s one lockdown food I’ll be happy to make on repeat when I finally relinquish sweatpants for real jeans, it’s this one.What is a sushi bake?Imagine a California-style roll, but deconstructed, layered, and baked in a casserole format: Seasoned rice is topped with furikake rice seasoning, a creamy, spicy mayo-laden seafood layer, more furikake, and drizzles of mayonnaise and Sriracha, and then it all gets heated up in the oven. After it comes out, let it cool long enough to set before spooning out portions onto seasoned Korean-style dried seaweed or gim (a.k.a. the roasted seaweed snack you might find in stores like Trader Joe’s) with optional garnishes of cucumber and avocado.Where did the sushi bake come from?I first started noticing sushi bakes on my social media feeds in the early summer of 2020, with the majority of the videos and images coming from the Philippines, where sushi bake had taken off in the early days of lockdown. It wasn’t only all the rage in home kitchens—there also seemed to be plenty of homegrown shops selling sushi bakes via pickup and delivery in and around the capital of Manila.“When the quarantine started, my sister and I re-created recipes from TikTok and other social media platforms,” says Leiana Aika Go, who started Manila-based Sushi Lab with her sister, Debbie Ann Go. “The kitchen became our laboratory. It was an avenue for us to experiment with different flavors from sweet to savory. When the sushi bake craze went viral, we tried making one of our own, and it turned out to be so good that we decided we had to share it with others.”The sushi bake has all the hallmarks of a great dish waiting to be brought to a potluck (remember those?): highly shareable; delicious warm; rich and creamy. And while parties of the usual kind aren’t condoned in the current environment, food that’s big on comfort and fun, to enjoy with your household pod, is welcome.“Filipinos love to eat rice and share a good meal with their loved ones,” says Pamela Chuateco, the chef and owner of Taste & Tell, whose sushi bake trays are inspired by Japanese aburi-style, or flame-seared, sushi. “Given that everyone is spending so much time at home with their families due to quarantine protocol, the sushi trays have become such a big hit because it’s a really easy meal to share with the whole family.”According to my friend and former colleague Rebekah Daniels, who grew up in Hawaii, sushi bake isn’t new and she’s always known it as an easy, crowd-pleasing party dish. “It seemed to always be a staple dish during holidays or special occasions,” she tells me. “And even in a more casual setting, it would be at a party or potluck since it was something that was meant to be shared with people. I’m sure that there are restaurants or places that will sell you trays of sushi bakes, but in my experience, they have always been homemade, often served cold or at room temp, or be placed in the oven for a bit so that it has a warm and melty texture.” (In my own research, I also found several delicious-looking uncooked renditions of the sushi casserole, in the form of a “pan sushi” and a “poke pan sushi” on beloved Hawaii grocery chain Foodland’s own site.)Photo by Laura Murray, Food Styling by Pearl JonesIt quickly became apparent in my search that there’s a sushi bake to suit every taste. While imitation crab usually makes up the bulk of the seafood layer, there are countless versions that mix in cooked salmon, shrimp, scallops, eel, fish roe, and more. Sushi Lab in the Philippines offers non-seafood fillings like rib-eye steak on the menu, while Taste & Tell incorporates ingredients including mango, fried garlic chips, and fried salmon skin in a variety of its aburi trays. “The fun thing about making this,” Daniels says, “is that you never need a recipe! Everything is to taste.”Back in the continental U.S., it wasn't long before I started hearing of sushi bake services cropping up, including in my own friend group.“I could see sushi bakes becoming more commonplace in the States, whether it’s with home cooks or from businesses like mine,” says Gia Lee, who calls her Chicago-area Hot Box Sushi a “COVID baby.” Lee, who grew up in Manila, started her take-and-bake casserole business over the summer of 2020, anticipating that the popularity of the food trend would hit the mainland. “With dining out at restaurants no longer being an easy option, people are really looking for unique experiences they can enjoy at home.”What will the fate of sushi bake be, once the pandemic is over and some semblance of “normal” returns? Time will tell but Leiana Aika Go of Sushi Lab has a feeling they’re here to stay. “Honestly, we never really thought of [the trend] lasting this long,” she tells me. “It has unexpectedly caught the Filipino palate.” Go believes sushi bakes will join the ranks of the traditional lechon and adobo that are often served on special occasions.Here’s how I make a sushi bake:In learning about sushi bake, I’ve tried different versions and I’ve finally settled on one that suits my household perfectly.Start by making 2 cups uncooked sushi rice according to package or rice cooker directions (if you use the small plastic measuring cup that comes with your rice cooker, it will be about 2¾ of these cups)—you want 5–5½ cups cooked rice. Once the rice is cooked, transfer to a large bowl. Add 1 tsp. toasted sesame oil (optional), and carefully mix and keep covered with a clean kitchen towel while you proceed with the recipe.Heat oven to 400°F.In a large bowl, combine 1 pound imitation crab meat, separated and chopped into small but not minuscule pieces, 1–2 Tbsp. Sriracha, 3–4 scallions, finely chopped, 3 Tbsp. masago or tobiko (fish roe), and 1 cup Kewpie mayo. While many recipes rely on some combination of mayonnaise and sour cream or mayonnaise and cream cheese as the primary binder, I prefer Kewpie (a rich, slightly sweet Japanese mayonnaise) for the best flavor, without being over-the-top heavy. Combine crab mixture thoroughly, but gently.Add your rice to a 9x13\" baking or casserole dish. Press down firmly, but not too tightly, in an even layer. Sprinkle about ⅓ of one 1.7-ounce bottle of furikake rice seasoning across the top of the rice.Add the imitation crab mixture on top of the furikake layer. Again, press firmly (not tightly) and evenly. Sprinkle another ⅓ of the furikake bottle on top of this mixture.Using the fine tip of the Kewpie bottle, garnish the top of the sushi bake in a zigzag pattern. Repeat the zigzag pattern from the opposite direction with the Sriracha bottle. Using your finger or the tip of a butter knife, sprinkle 1 Tbsp. of masago or tobiko on top of the sushi bake. I love using masago or tobiko fish roe in the imitation crab mix and to top the sushi bake because it adds salty brininess as well as a nice pop of texture.Bake in the oven for 15–20 minutes, until the top gets a light golden brown. If you’re using a glass pan, you may see the edges of the rice start to sizzle (that’s a good thing!).Remove from the oven and let cool for 5–10 minutes. Serve with about 3–4 packages seasoned, roasted Korean seaweed snack (a.k.a. gim), sliced cucumber, and sliced avocado. You’ll spoon a small portion onto the roasted seaweed sheet and it will resemble a mini taco of sorts. Cucumber adds a much-needed crunch and cooling respite and avocado's inherent creaminess pairs well too—it’s even better if it's cold from the fridge. Refrigerate any leftovers. Reheat in a 325°F oven for about 10—15 minutes.This is not traditional sushi as you know it, but if you’ve ever enjoyed an American-style spicy roll, I have a strong feeling you will also enjoy the sushi bake. Having tested the following recipe more than a handful of times for a rapt crowd (my husband and six-year-old), I can safely say it’s already become a family favorite.While I would recommend following my version of sushi bake as written the first time around, I’d encourage you to customize it to your and your household’s tastes moving forward. Use this extra time at home now to perfect your sushi bake so that when we can eventually gather with others again for a real potluck, you’ll know exactly what your contribution will be.Hana Asbrink is a writer, editor, and recipe developer based in New York. She likes long walks and the elusive egg bagel.Explore Bon AppétitIt's That SimpleSushiRiceSeafoodRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-04", "author": ["Condé Nast", "Hana Asbrink"]}