{"id": "eff6daaa486a6ff0215d3e65a15c1ad8", "url": "https://www.bonappetit.com/recipe/instant-pot-glazed-and-grilled-ribs", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Instant Pot Glazed and Grilled Ribs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesInstant Pot Glazed and Grilled RibsBy Carla Lalli MusicJune 20, 20184.2(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kat Boytsova, Prop Styling by Emily EisenEmailPinterestPrintEmailPinterestPrintPressure-cooking the ribs for a mere nine minutes makes them completely tender and succulent, but the meat won’t be quite at the stage where it slumps right off the bone. We think they’re the perfect texture for picking up and eating with your hands, with just the right amount of chew. After that, they spend ten minutes on a hot grill to get crisped up and glazed with a punchy hot-and sour-sauce. Play your cards right and you’ll be grilling on a weeknight.Ingredients4 servingsRibs2Tbsp. Chinese hot mustard powder1Tbsp. garlic powder1Tbsp. sugar4tsp. kosher salt4lb. St. Louis–style pork spareribs, cut into 3- or 4-rib sections¼cup mirin (sweet Japanese rice wine)Glaze and AssemblyVegetable oil (for grill)2Tbsp. distilled white vinegar2Tbsp. Sriracha1Tbsp. fish sauce1Tbsp. sugar23\" pieces ginger, scrubbed, bruised with the dull side of a chef’s knife, sliced into ½\"-thick roundsKosher salt (optional)Special EquipmentAn Instant Pot, other electric multi-cooker, or standard stovetop pressure cookerPreparationRibsStep 1Mix mustard powder, garlic powder, sugar, and salt in a medium bowl to combine. Pat ribs dry with paper towels and arrange on a large rimmed baking sheet. Season ribs on both sides with all of dry rub, patting it on if needed. Cover with parchment paper or loosely with plastic wrap. Chill at least 1 hour or up to 2 days.Step 2Pour mirin into Instant Pot. Place ribs in pot, orienting them on narrow sides so they’re leaning against walls of pot and each other (rather than stacking them flat, one on top of the other). Lock on lid, making sure steam release valve is in the proper sealed position. Select “Manual” and program for 9 minutes at high pressure. Let pressure release naturally 10 minutes, then manually release pressure. Unlock lid and transfer ribs to a rimmed baking sheet. Let sit at room temperature until ready to serve.Step 3Do Ahead: Ribs can be cooked 1 day ahead. Let cool; cover and chill.Glaze and AssemblyStep 4Prepare a grill for medium-high heat. Clean and oil grate. Pour cooking liquid from Instant Pot through a fine-mesh sieve into a medium measuring glass (keep sieve handy, you’ll need it again). Using a spoon, skim off excess fat from surface (you should have about 1¼ cups cooking liquid after skimming).Step 5Pour cooking liquid into a large skillet. Add vinegar, Sriracha, fish sauce, and sugar and stir to combine. Add ginger, then bring mixture to a boil. Cook, swirling pan occasionally, until liquid is reduced by half, 7–8 minutes. Strain glaze through reserved sieve back into measuring glass and set close to grill.Step 6Rub a little bit of oil on ribs to lightly coat. Grill ribs, meaty side down, until lightly browned, about 2 minutes. Turn ribs, generously brush glaze onto exposed side, and grill until underside is lightly browned, about 2 minutes. Turn ribs again and brush with glaze. Continue to grill, turning and brushing with glaze every 2 minutes, until ribs are dark brown and nicely lacquered on both sides with some charred spots, about 5 minutes total (smaller end of rack will be done first).Step 7As they finish cooking, transfer ribs to same rimmed baking sheet and brush immediately with glaze. Let cool 5–10 minutes before cutting into individual ribs. Serve with any remaining glaze drizzled over; season with salt, if needed.How would you rate Instant Pot Glazed and Grilled Ribs?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThe flavor is FANTASTIC. I never measure salt or most of my seasonings so I can't say much about the salt level like others noted. We also didn't have Chinese mustard powder so we used regular with a pinch of cayenne for some kick in the rub. Upped the Mirin and added a cup and some extra to the liquid for pressure cooking. The reducing of the liquid takes awhile bc of the extra liquid but it's worth it, also added a little hoisin to the glaze. Lastly cooked these under the broiler because it's cold out and didn't want to bother with the grill. They were GREAT. This is a pretty flexible recipe, as you can see, but the bones (pun intended) are good. AnonymousNashville3/8/2020Delicious, easy to prepare.  I serve it with a Thai peanut slaw and everyone gobbles it up.  I agree with the saltiness and yet I always forget to reduce the salt!  Maybe I will remove some of the rub tonight.\npaperdiva67California 10/30/2019Those were the best ribs I have ever made!  I topped up the liquid with water to make just over a cup.  My teen inhaled them and so did I.  Thank you!AnonymousVancouver, BC9/28/2019Too salty and I can’t figure out why, but addictingly delicious. Absolutely will make again with more liquid in IP. See previous comment about adding 1 cup of water with mirin. I think that would work. My ribs were not cooked enough after 9, did five more and probably needed a full 9 more minutes with more liquid. Will reduce salt in rub next time assuming that is why it was too salty. But worth trying again!kgkerrDelaware12/29/2018Yes, for sure.  But Karla forgot an important ingredient for any Instant Pot recipe.  \"...Minimum of one cup liquid...\"  Almost ruined me on first IP attempt!!  Luckily my model has an instant shut down before any serious scalding takes effect.\nThe recipe calls for 1/4 C of Mirin.  That means you need to add another 3/4C of liquid to avoid \"shutdown\".  I corrected by adding water.  All was well.  Great recipe!  Will rate a 5Star next time...San Francisco Bay Area12/16/2018Explore Bon AppétitRibsAsianPork RibPorkMeatEasyWeeknight MealsMainDairy-FreeGluten-FreeInstant PotSuper BowlFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-20", "author": ["Condé Nast", "Carla Lalli Music"]}