{"id": "effe8c5669d724d42bd6958ba3e8981d", "url": "https://www.bonappetit.com/story/slow-roasting-better-than-braising", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "If You’re Not Slow-Roasting, Are You Really Living? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You’re Not Slow-Roasting, Are You Really Living?Turn the rules of braising upside down for hands-off, slow-roasted meat allll winter.By Carla Lalli MusicDecember 13, 2018FacebookTwitterEmailPhoto by Marcus Nilsson, Food Styling by Rebecca Jurkevich, Prop Styling by Angharad BaileyFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Slow-roasting > braisingI came of age as a fancy restaurant cook in the early 2000s, a food era dominated by seared foie gras, truffle butter, and braised short ribs. At that moment, short ribs were a lowly “butcher’s cut” in the process of being rediscovered by professional chefs, who were happy to simmer, glaze, and lacquer them and then sell them at an enormous profit. These ribs were rich, saucy and sticky, and you could eat them with a spoon. Where I worked, we served them on top of a taro root puree loaded with truffle butter—a real twofer!Want this letter before it hits the website? Sign up for our newsletter!If you had told me then that you could slow-roast a thinly cut short rib in a can of coconut milk, I would have have ratted you out to the sous chefs. For years I had witnessed giant vats of short ribs being submerged in a simmering mixture of red wine and beef stock, and I thought that was the best way—maybe the only way—to cook them. I thought those chefs knew best.Well, turns out those fancy pants French-trained chefs didn’t know what our own Chris Morocco knows, which is that beef short ribs have so much marbling, collagen, and integrity that they can handle all kinds of long stints in the oven, and they don’t need to be covered in liquid in the process. Mon dieu—but it’s true.This recipe turns the rules of braising upside down for a hands-off method that is easier, more delicious, and texturally more awesome. And it all happens while you do nothing. Here’s how:Ditch the lidUnlike a standard braise, this low-heat roasting method happens in an unlidded cast-iron skillet, which exposes the meat and the coconut milk to the open air. In the process, the surface of the meat dries out a bit so that you end up with a chewy, glazed exterior, but the gentle oven temperature ensures the ribs stay moist and tender. At the same time, the liquid reduces down to a concentrated, jammy consistency—not unlike the fancy glazes from days of yore, but with a lot less fussing.Use less liquidAll short ribs benefit from a long cook time to transform their tough muscle fibers to shreddable, juicy meat. When you slow-roast, the heat level stays low and gentle, but you don’t need to submerge the meat like you would for a braise. In fact, the amount of liquid —a single can of coconut milk—amounts to a mere puddle in the bottom of the pan. It throws off enough steam to keep the ribs hydrated and mingles with the meat juices to create a (gobsmackingly good) concentrated pan sauce.Skip the searingBecause the ribs are mostly exposed to the dry heat of the oven, you don’t need to sear them before cooking. (When you make a braise, you could easily spend 20 minutes browning the meat before adding any other ingredients). These ribs spend between five and six hours in the oven, which is plenty of time to let them gradually take on color as their surface is transformed into a chewy bark.Load up on aromaticsBeef rendang was Morocco’s inspiration for the flavors in this dish, and instead of hinting at it, he went big. For just 13.5 ounces of coconut milk, there’s two whole lemongrass stalks, shallots, garlic, a couple of chiles, a hunk of ginger, and curry powder. As the liquid reduces, the aromatics slowly brown and their essences get bolder. At the same time, any sharp edges are softened by the natural sweetness of the coconut milk and the fats rendering from the ribs.Sass up the endingWhen I think about those 4-star short ribs, the demi-glace consistency of the pan sauce is what sticks with me—it was so thick, it stuck to the ribs and the dinner plate, too. At the end of the slow-roast, though, you have fall-apart meat with a little chew to it, and a jammy pan sauce rife with tangy aromatics. The flourishy finish is the coconut gremolata that goes on top—a toss-together mix of toasted coconut flakes, fresh lime juice, and fresh cilantro.It’s oven season: Time to throw a bunch of ribs in a pan and find out if I’m telling the truth.Get the recipe:Short Ribs Slow-Roasted in Coconut MilkExplore Bon AppétitCarla NewsletterRoastShort RibRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-13", "author": ["Condé Nast", "Carla Lalli Music"]}