{"id": "f001a4a5608c1db9c02fb5387bb2e43f", "url": "https://www.bonappetit.com/story/never-fail-chewy-molasses-cookie-recipe", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "This Molasses Cookie Recipe Restored My Faith in Holiday Confections | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Chewy Molasses Cookie Recipe Restored My Faith in Holiday ConfectionsThey're crisp, chewy, and remind me of everything good about the season—without any of the gimmicks.By Jesse SparksDecember 21, 2018FacebookTwitterEmailMichael Graydon + Nikole HerriottFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Here’s the thing about holiday cookies that people miss: Most of them are bad. Like, moisture-sapping, gritty, too-sweet mounds of sadness bad. Nobody wants that, no matter how cutely those pucks are decorated or how festively they're packaged. I'm over it! I want a cookie that tastes good, first and foremost. Which is why I’m forever a devotee of the OG (original glitter–bomb): Chewy Molasses Cookies.Sure, I love cookies that make a visual impact. Raspberry rugelach that shine like Christmas tree ornaments? Great! Zebra cookies with a dazzling collar of ruby–red sugar? Nice! But there’s a simple beauty in this molasses cookie recipe, a throwback from when BA contributor Alison Roman worked in our test kitchen. (Yep: The same person who brought the world The Cookies.) They dazzle quietly, showing up without needing too much attention. Plus, they make your house smell more festive than a holiday candle store, and are a whole lot less complicated to make than any of the disappointing, look-better-than-they-taste “showstoppers” that are bound to turn up at the cookie swap. What more could you ask for?Here’s how to get started. Bump your oven racks to the lower and upper thirds of the oven and preheat it to 375º. Whisk together those dry ingredients and wet ingredients in separate bowls, per usual. Then, combine the mixtures—no special equipment necessary!—until well incorporated. Nothing fancy, folks!Okay, you should probably make these Salted Butter and Chocolate Chunk Shortbread Cookies too...\nThrow some sanding sugar into a separate shallow bowl. Scoop out dough by the tablespoonful (cookie scoops encouraged) and form into balls and roll in the sanding sugar. Plop ‘em onto two cookie sheets lined with parchment paper and toss them into the oven. After 8–10 minutes, rotating the cookies halfway through, they’re done and ready to relieve you from bad sugar cookie–tyranny.Just like that, you’ve made a batch of beautiful, pillowy cookies that twinkle ever so slightly from that sugar bath you gave them earlier. They're so much more complex tasting than they seem like they should be, with punchy hits of cinnamon, a kiss of cardamom, and just the right about of zing from ginger, all backed up by that just-the-right-amount-of-bitter molasses. They basically capture the feeling of hygge better than any cozy log cabin in Aspen. And after weeks of force-feeding yourself bland cookies, you could use a little rest.The molasses cookie recipe in question:Chewy Molasses CookiesMolasses keeps these cookies magically fresh and chewy for days.View RecipeExplore Bon AppétitBasicallyNever FailCookieHoliday CookiesMolassesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-21", "author": ["Condé Nast", "Jesse Sparks"]}