{"id": "f01395137cde6c0b8a69fb35ee697255", "url": "https://www.bonappetit.com/story/salted-caramel-chocolate-tart-sophisticated-milk-dud", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "This Salted Caramel-Chocolate Tart Tastes Like a Sophisticated Milk Dud | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Salted Caramel-Chocolate Tart Tastes Like a Sophisticated Milk DudAnd we're so here for it.By Emma WartzmanFebruary 28, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailThere are three genius elements to this Salted Caramel-Chocolate Tart. First is the almost-bitter chocolate crust, which holds court against its sweeter counterparts. Second is the layer of salted caramel, which goes from silky-smooth to perfectly chewy as it sets. And third is the chocolate ganache swirled on top, which is made from chocolate, heavy cream, butter, and nothing else. Lucky for you, and whoever in your life is fortunate enough to snag a slice, these are the only three elements in this tart.The recipe is a bit of project, as each part is a separate process with a decent amount of waiting in-between for things to set and cool. But it's completely worth it, and by tackling each piece individually (both the crust and the caramel can be made ahead), you can take away some of the stress. Just think of it like three mini-baking projects that come together to form one show-stopper.Begin by making the crust, a process which only takes about 30 minutes. The dough can hang out in the fridge overnight, or, if you're making the whole thing in one go, it needs about two hours to chill before you roll it out.  Whisk together cocoa powder, sugar, salt, and flour. At this point, you want your wet ingredients measured and at the ready—you're about to get your hands dirty. Mush cold pieces of butter into the dry ingredients by pressing between your fingers until all the lumps have disappeared, a highly-satisfying task. Think of it like making pie dough, only less scary, because there's no fear of over-mixing. Make a well in the center and dump your egg yolk and milk. Knead until it all comes together into one mass, wash your hands, wrap tightly in plastic, and put in the fridge.Step 2 for the crust is rolling it out and fully baking in a 9\" or 10\" tart pan, the only part of the recipe that requires an oven. Before you start, though, make room in your freezer. Now would be a good time to throw away the two-year-old lamb chops and that anonymous pint container of red-ish liquid. The dough has to firm up for about 10 minutes before baking.There's a trick written into the recipe (with illustrations!) for transferring the raw, rolled-out dough without ripping or cracking it. Do it! It works! Slide the removable bottom insert of the pan underneath the flattened-out center of the dough, gently fold the edges inwards so that everything is resting on the insert, place back inside the tart ring, and then gently unfold so that the edges are slumped against the side of the pan and hanging over. Press the dough snugly to all sides (a straight-sided measuring cup helps) and then sweep your rolling pin right over the top to trim off the extra hanging dough in one swift move (another highly satisfying task). Stick it in the freezer and then stick it in the oven. Twenty minutes later and you're one third of the way there.Swoosh it good.\nAlex LauNext is the caramel. I know caramel can be daunting. I, for one, have had my fair share of caramel mishaps. The best advice I have? Don't panic and change the temperature or walk away to practice calming breathing exercises. Trust the recipe. The recipe works. The other best advice I have? Measure out your butter, cream, and salt (our test kitchen recommends Diamond Crystal in this instance, as it will dissolve better) ahead of time, because you'll want to focus on the sugar cooking. Once that's done, you've got to make fast moves so that it all comes together.First, dissolve sugar in water in a large saucepan, along with a touch of cream of tartar. While you technically don't need this ingredient, even the small ⅛ of a teaspoon helps prevent crystals from forming as the sugar heats up. Worth it, in my opinion. Stir this mixture constantly with a heat-proof spatula until there are no granules left in the liquid. Then, take a step back, only swirling the pot every so often as it bubbles vigorously and turns a deep amber. This will take about 10 minutes, but watch it closely, as the transformation is quick. You may even get a little bored waiting, but suddenly, in the last minute and a half or so, you will see some color, and then it will quickly get darker. Take it off too soon and there won't be enough flavor. Take it off too late and it will burn. Trust your gut to find the happy medium. As soon as you do, in goes your butter, one piece at a time as each cube melts, then your cream, which will stop the bubbling and turn the whole concoction into a silky caramel. Finally, your salt. Let it cool. (If you're not using the caramel right away, you can store it in the fridge and heat it up until just pourable when you're ready to go.)The caramel goes right into your now-also-cooled tart shell, and then into the fridge for at least an hour, where it will firm up. While said firming is happening, make the ganache out of the aforementioned chocolate, heavy cream, butter, and nothing else. Melt them all together in a double boiler (or, you know, a heat-proof bowl over a simmering pot of water because nobody has an actual double boiler except for my mom). Take it off the heat and let it sit until it's thick enough to hold an indentation. The recipe says the indentation should come from a spoon, but I used my finger because taste testing is also important.Now you're really in the home stretch. Swoosh dollops of the ganache over the top with the back of a spoon (no fingers this time) and sprinkle with some large flakes of sea salt. The end result is rich in the best way, so slice it thin and share accordingly.There were leftovers of my tart which stayed in my boyfriend's refrigerator for the next several days, where people, myself included, broke off chilled pieces and ate them while watching movies, like a next-level version of Milk Duds. Maybe it's just me, but it tasted even better that way.Get the recipe:Salted Caramel–Chocolate TartWe can't stop staring at the layers of bittersweet ganache and buttery caramel.View RecipeExplore Bon AppétitDessertTartChocolateCaramelRead MorecookingHow to Make Caramel Sauce That You'll Want to Put on EverythingBy Claire SaffitzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-28", "author": ["Condé Nast", "Emma Wartzman"]}