{"id": "f025cf0a4990f9201e8c149de859b3a6", "url": "https://www.bonappetit.com/recipe/beet-tostadas-with-fried-eggs", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Beet Tostadas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueBeet Tostadas With Fried EggsBy Rick MartinezFebruary 11, 20204.6(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintMany think Mexican food is heavy and meat-forward, but that came with Spanish colonization. Before, it was mostly vegetables. We tapped into that tradition by seasoning beets with chorizo spices. An egg on top adds Texas-style breakfast taco vibes. Beets can stand up to a hard roast and plenty of spice. Their sweet earthiness and firm texture are ideal for making meatless chorizo. If beets aren’t your thing, winter squash or another sweet root vegetable will also work. (For those craving a little chicken, try Rick’s  easy tostadas recipe with chicken tinga and black beans.)IngredientsMakes 61½lb. red beets (about 2 large), peeled, cut into ¼\" pieces2garlic cloves, finely grated2Tbsp. ancho chile powder1tsp. crushed dried oregano, preferably Mexican1tsp. paprika¾tsp. ground cumin½tsp. freshly ground black pepper1Tbsp. Diamond Crystal or 1½ tsp. Morton kosher salt, plus more2⅓cups plus 3 Tbsp. vegetable oil, divided1large white onion, halved through root end, sliced ¼\" thick6medium serrano chiles, quartered lengthwise, leaving stems and seeds intact⅓cup sage leaves66\"-diameter corn tortillas6large eggsSalsa de Árbol (for serving)PreparationStep 1Place a rack in middle of oven; preheat to 350°. Toss beets, garlic, chile powder, oregano, paprika, cumin, pepper, 1 Tbsp. Diamond Crystal or 1½ tsp. Morton kosher salt, and ⅓ cup oil in a medium bowl until beets are coated. Scrape onto a foil-lined rimmed baking sheet; bake, tossing every 15 minutes, until beets are tender and spices are very fragrant and smell slightly toasted, 35–45 minutes.Step 2Meanwhile, heat 2 cups oil in a large saucepan over high until oil bubbles immediately when the edge of a tortilla touches the surface. Carefully fry onion, adding a little bit at time to avoid too much spattering and reducing heat as needed, until tender and beginning to brown, about 5 minutes. Transfer to a paper-towel-lined baking sheet. Repeat process with chiles, about 5 minutes. Transfer to same baking sheet. Fry sage leaves until crisp, about 30 seconds. Transfer to baking sheet. Working one at a time, fry tortillas, turning once, until crisp, puffed in places, and deep golden brown, about 1 minute per side. Transfer tostadas to baking sheet.Step 3Heat remaining 3 Tbsp. oil in a large nonstick skillet over medium-high. Crack eggs into skillet, leaving space around each one, and cook until whites are set and edges are crisp, about 4 minutes. Season with salt.Step 4Spoon beet mixture onto tostadas, dividing evenly, and top each with an egg, then fried onion, chiles, sage, and Salsa de Árbol.How would you rate Beet Tostadas With Fried Eggs?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleThis wasn't my favorite, which was so disappointing after all of the stellar reviews. The worst part for me was that, after frying the serranos with the entire seed pod intact, my meal became so overwhelmingly spicy that I couldn't even finish it. I don't think I'm overly sensitive to spicy foods, and I wonder if my serranos were spicier than normal. I would have preferred jalapenos, I think, for a more mild spice. I found myself reaching for yogurt, sour cream, or anything dairy to try to cool some of the heat. I'm not disappointed I turned to this recipe to use up some beets, but probably will not make this again.AnonymousChicago, IL9/15/2020Exquisite. I cut up a chayote squash as well into 1/4\" pieces and mixed it in with the beets. Served it on guajillo chile tostadas. Fried the eggs slowly to get them super jammy. Wow.a.goekler7491Denton, TX7/10/2020My partner and I are still processing how delicious this was. Found this recipe looking for a way to use up some sage. These are amazing. Bon Appetit, pay Rick fairly to make this into a video. The depth o flavors.AnonymousCalgary, AB, Canada6/27/2020I made this with a mix of beets and potatoes (didn't have quite enough beets on hand), and it was delicious! I will definitely cook this again, especially in the fall when I get a glut of root vegetables from my CSA.AnonymousBoston6/8/2020These were so so good. I ended up using sweet potatoes instead of beets, and could only find jalapeños (quarantine is making it hard to find the right ingredients). I don't regret the sweet potato choice at all, it works so well with the spice blend. I also added avocado to add a little fat to everything, and it just made everything better. These were amazing. They aren't spicy, but at the same time are really flavorful. I may end up adding more chiles in the future for added heat, but all around amazing.AnonymousMassachusetts5/22/2020I've made these twice now. Highly recommended! Simply delicious AnonymousAustin, TX5/5/2020I've never taken the time to write a review before but these were so good I had to!  Saw this recipe and thought to make it.  When my neighbor down the street (who I had never meet before!) showed up with a bag full of beets I had to make it.  Had it for breakfast this morning and it was amazing.  Tasted like something you would find in a restaurant!  juliadDenver, CO5/3/2020Thank goodness for you, Rick. I got unexpected and bonus beets (!!!) in my first ever CSA box and had no idea what to do! I already have everything I need to make this recipe happen in my pantry which is so essential in (said ominously) these times. I have yet to make it but I couldn't wait to express my joy for one of the only (???) beet recipes on Bon Appetit to be something that looks easy and flavorful, and so well reviewed.breebridger3741Houston, TX4/27/2020Super yummy! Well worth the work. Frying the tortillas makes all the difference. It was a delicious flavor combo.carterjohnsenMontana, USA4/27/2020We've made several of the Taco Nation recipes and this has been favorite so far (with the Duck Carnitas a close second).  Well worth the dicing of the beets.  Will branch out next time and try carrots, butternut squash, etc.  I'd make double the filling next time so we could have leftovers.  I did remove the seeds from the serranos which was just perfect for us.  SO SO SO good.maryfabrikant5429Denver, CO4/26/2020These were so so good.  Had a really good kick to them and worth the time and effort!  Crowd pleaser for sure.AnonymousChicago4/24/2020Wow! This tostada was SO good. I love beets. It gave the tostada a more earthy taste. Runny yolk and the salsa de arbol is was so tasty. My boyfriend said it’s the best tostada his had so far! Will for sure make it againCookitkelly_Colorado3/27/2020Wow. Just, wow. These were absolutely amazing! In fact, my husband said that it was the best vegetarian meal he's ever made: crunchy tostadas, spicy beets, melt-in-your-mouth onions, all covered with a delicious, fatty egg. Incredibly delicious.  AnonymousSeattle3/22/2020A splendid medley of flavors and textures! We prepped ingredients the night before and stored them in the fridge. It made the cooking go quickly. If you wish to reduce the heat of the peppers, just remove the seeds prior to plating.AnonymousChattanooga, Tennessee3/20/2020These are incredibly good. Made the recipe exactly as written. Each bite has like 5 layers of flavor happening at once that all go together incredibly well. EricUChicago 2/29/2020Explore Bon AppétitTostadaTex-MexAmericanBeetVegetableEggDairy-FreeGluten-FreeNut-FreeVegetarianHealthyishBreakfastLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Rick Martinez"]}