{"id": "f029b9bcd21e0643d106254891d3b9c3", "url": "https://www.bonappetit.com/story/spicy-asparagus-stir-fry", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "An Asparagus Stir-Fry That’ll Get the Whole Family to the Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAn Asparagus Stir-Fry That’ll Get the Whole Family to the TableDeb Perelman’s kids and husband all like varying degrees of spiciness in their food. This dinner manages to satisfy them all.By Deb PerelmanMarch 18, 2020FacebookTwitterEmailPhoto by Laura Murray, food styling by Rebecca JurkevichFacebookTwitterEmailWelcome back to Picky Eaters’ Club, where Smitten Kitchen’s Deb Perelman reveals what she actually cooks for her two kids.My husband and I have a joke about how much he likes my cooking. “This is delicious!” he’ll say as he shakes a bottle of Sriracha all over the soup/tacos/omelet/spaghetti I’ve made. I’ve learned not to take it personally, and in fact I’ve joined him, finding that my own spice tolerance has slowly crept up from virtually nonexistent to “Who finished the chili crisp again?!”Then there are the other two people in our family: the Picky Contingent. The older one, never wanting to miss out on the fun, asks for a microscopic dot of hot sauce on his plate at dinner and then immediately washes it down with half a glass of water. Still, this is progress. The four-year-old, also known as the one who recently requested “pasta with nothing on it and nothing near it,” would prefer not even a speck of black pepper in her food. This, of course, poses a challenge to the way I like my food: seasoned to the point where you might actually taste it, no matter how radical this sounds.What’s a cook who refuses to make multiple versions of the same meal to do? The first time I make something, like this asparagus stir-fry that’s loosely inspired by my love for Sichuan dry-fried green beans, I go easy on the heat. Mostly I’m just trying to get everyone to the table. Then, once I’ve (hopefully) convinced everyone that they like this dish—blistered yet snappy asparagus and crispy pork in a robust sauce, how could they not?—I might sneak in an extra spoonful of chili crisp next time, hoping the slight shift won’t be too detectable. We may never get to a place where my husband doesn’t need to “adjust” his plate with hot sauce, but it’s nice to be heading in the right direction.Get the recipe:Pork and Asparagus Stir-FryBlistered yet snappy asparagus and crispy pork in a robust sauce.View RecipeExplore Bon AppétitPicky Eaters’ ClubAsparagusPorkStir-FryRead MorecookingHow to Get Your Kids to Eat a Giant Tray of VegetablesBy Deb PerelmancookingFor Dinner That Comes Together in No Time, Make Red Bean Soup with Taco FixinsBy Deb PerelmancookingWhen in Doubt, These Hummus Bowls Are the AnswerBy Deb PerelmanLifestyleIn a House of Picky Eaters, These Jarred Sauces Are Always a WinBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-18", "author": ["Condé Nast", "Deb Perelman"]}