{"id": "f04164d683d6ce66bf35c57f5356bbb7", "url": "https://www.bonappetit.com/story/palizzi-stuffed-shells-recipe", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "These Old-School Stuffed Shells Will Make You Feel Like a Member of an Exclusive Club | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Old-School Stuffed Shells Will Make You Feel Like a Member of an Exclusive ClubWhen you can’t go to Palizzi’s in Philadelphia (...and you can’t), you can make their shells at home.By Sarah JampelSeptember 27, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailWhen I set out to make the Stuffed Shells with Marinara from Palizzi Social Club in Philadelphia, BA’s fourth Best New Restaurant in 2017, I had no idea that I wouldn’t be able to go to Palizzi to try the officially-sanctioned shells.See, you need a membership (or a friend with a membership) to dine at PSC, as I’m calling it, and less than a week after being awarded the spot on BA’s list, they stopped accepting any new members—a freeze they have yet to lift.But I can’t be mad. This recipe is so good (and so simple!), I don't need to go the restaurant any time soon. (Though let’s be clear: I still want to.)Is Molly Baz a Palizzi Social Club member?!Stuffed shells, according to chef-owner Joey Baldino, are one of those “lost and forgotten old-school Italian-American dishes”—the kind of comfort food that appeared in the buffet spreads at the baptisms, weddings, and funerals held at the club when it first opened nearly a century ago. Baldino keeps his rendition as true to the original recipe as he can: nothing too complicated, with fresh tomato sauce and a ricotta-mozzarella filling.Now, I took a couple of, um, liberties here. First, my giant shells weren’t all that big (they were jumbo shells in the “jumbo shrimp” sense of the word, meaning they were still quite small). Second, I skipped the recommended marinara for an Instant Pot version so that I could avoid any stirring whatsoever. (If you, too, are going it on your own with the sauce, a warning: I made the mistake of adding too much carrot, which made the sauce sweeter than I would have liked. Learn from my error!) Third, I did not have enough ricotta, so I used some roasted garlic-ricotta that I had leftover from making the new Broccoli and Garlic-Ricotta Toasts along with some heavy cream. And, lastly, I added lots of fresh basil (you can’t sleep on that stuff—it wilts if you avert your eyes even for a second), both to the filling and as garnish.The interior of Palizzi, which you may never see in person.\nPhoto by Alex LauShould I be ashamed of my deviation? It all worked out in the end: four of us nearly finished the whole “serves 8” recipe. Plus, Baldino told me that “if you're cooking with high-quality ingredients, taking your time, and putting in some love, it's going to turn out really well.” And he was right! (But also, make sure your filling is well-seasoned with salt and pepper.)So, yes, try to find a friend with a PSC membership so that you can eat the real thing, straight from Baldino himself. But if you have no member-friends (or no friends at all...), don’t be sad: Make these at home and it’s almost like you’re there.Get the recipe:Stuffed Shells with MarinaraRemember: If the shells are perfectly cooked in the first step, they’ll be mushy and flabby after baking. This recipe is from Palizzi Social Club in Philadelphia, PA.View RecipeExplore Bon AppétitPastaItalian AmericanRead Morebest-new-restaurantsPalizzi Is the #4 Best New Restaurant in America 2017By Andrew KnowltonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-27", "author": ["Condé Nast", "Sarah Jampel"]}