{"id": "f048e8cd8871c40e3136c6557314ba42", "url": "https://www.bonappetit.com/story/weeknight-dinner-party-planning-tips", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "Tips for Throwing a Weeknight Dinner Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Throw a Weeknight Dinner Party Without, Quite Simply, Perishing A Rocky-style training montage for how I pull off a midweek get-together without breaking a sweat. By Maggie LangeFebruary 5, 2020FacebookTwitterEmailAlex LauFacebookTwitterEmailHaving a weeknight dinner party is like having a thrilling nemesis: It’s exhilarating—maybe the only thing that breaks up the monotony of the brutal week—and the closer it gets, the more terrifying it is.Instead of just waiting for my worthy rival to show up, my strategy is to catch them off-guard and tackle them way in advance. I’m my own plot twist! The following is a day-by-day prep—a training montage, if you will—for my recent weeknight party that could model how to grab your own enemy by the guts, even on a Tuesday.Five Days Out: Mopping and ShoppingClean: There’s a micro-particulate layer of dust in my house that’s only visible when I know a judgmental guest is about to visit. Four or five days is near enough to the party that my deep-ish clean (like, I get out the counter sprays) will hold up. Since I have two tall friends, I also dust even the high shelf.Supply: A weeknight dinner party isn’t the time for ingredients that could take their last breath on the way home from the store, and it’s not the time for a creamy pasta that has to be mixed à la minute. Because I can’t stash fresh morels (a tragedy!) five days in advance, I always stack the menu with dishes that either cook fast or keep well. For this party, I decided on parsnip soup, steak with chimichurri, zesty-ass couscous, and a huge salad that I’m mainly excited about because of pistachios. Every dish has make-ahead components: the steak marinates, the soup matures. This staggering is key to time management for a hectic  night. The day before, I’ll snag the few sensitive dudes (sad bagged arugula; cherry tomatoes) on my way home from work.Recruit: On the night of the dinner, I’ll only have an hour and this hour will feel like 38 seconds. I ask my prompt friends to bring over cheeses now so that they can shop with ease. Some dreamy Bucheron during the drinking-and-immediate-gossip hour will distract from my howling in the kitchen.I also pick up an easy-breezy-beautiful dessert that will hold its own in the freezer. Wow, you sized me up very quickly: Yes, I always buy ice cream. My greatest design flaw is that I don’t like sweet things, but my greatest asset is that I’m selfless. I get cardamom ice cream (Three Twins!) and ginger cookies and think about my shortcomings.Three Days Out: Soup and Other Things That Keep WellIf you have a lovely little boring streak like me, the sensation of being prepared and organized is fleeting but ecstatic. So a few days in advance, I set out to accomplish the bulk of the prep: I make a trough-load of lemon vinaigrette. I roast beets for the salad. And since many soups are most delicious after hanging for a couple days—so the ingredients can stop being polite and start getting real—I make the parsnip soup from start to finish.Doing the labor-intensive tasks now also means I have my pre-hosting panic—let’s cancel everything! let’s leave! let’s go to Ojai!—two nights in advance, rather than two hours in advance. This is a very generous amount of time to wind myself back to baseline.The Night Before: MarinatingIt’s weeknight dinner party eve! It’s the hour of marinating! A convenient phone alert reminded me to scootch home and get the steaks under their sauce. For this party, I’ll also toast and plump the couscous a day in advance (controversial, yes, but if well-stirred, a lemony couscous can be just as delicious a day later). And with the steak getting juicy and the couscous getting cozy in the fridge, I’m 85% done.Late Night Before: OverachievingI employ some useless restless energy to set the table, with the glasses and plates turned upside down for dust protection (and doesn’t it sort of look like they’re sleeping?). Usually, I’m super cool/casual and save table-setting for when first guests arrive, but a weeknight dinner party is never not a scramble, so I know something else will crop up. It’s the time to use all the forward-thinking I can get.Morning Of: Pre-Scramble ShuffleHousekeeping tasks. I empty the dishwasher, tidy the counters, take out the trash. I make sure the wine is in the fridge. I get the stool out and unearth the water pitcher from a high place. I rustle my bones about 20 minutes early to get through the list, knowing it will be worth it on the other end. This is the stuff that really adds up in the WILD HOUR before people arrive.The WILD HOUR BeforeThe time is now! When I arrive on the scene, many dishes squeal for attention, so I triage, focusing on the most urgent matters: Since the soup will take the longest to warm up, I get that on the stove first. Then I pull out anything from the fridge that needs to be at room temperature  and start chopping the vegetables and herbs to complete the salad and the couscous. Then, I leave the kitchen to air out my armpits and change clothes. I think it’s kinda elegant to be chopping parsley as someone arrives—instead, someone usually rings the doorbell as I’m brushing my teeth or putting a bra back on.My friends always run late, which I love because it means I actually have time to extract the goat cheese from its tube and throw fresh things on top of the couscous. I sear the steak after we’re done with soup, waiting for the perfect moment to say: “Rare or medium-rare?” While the steak rests, I dress and toss the salad, then bring everything to the table at once. Wow, it’s almost like I planned this graceful staggering! I’m waiting for someone to call me organized. Instead, reviews are only in for the steak (“provocative”; just kidding no one said that, it’s steak, everyone loves it).At dessert, I steal someone’s seat so I can face away from both the rubble of pots in the sink and the fact it’s almost Thursday. If the dinner party never ends, you’ll never have to do the dishes!Maggie Lange writes for magazines mainly about music, salty food, books, curly hair, and other things she loves. She lives in Los Angeles, but she still wakes up on East Coast time.Explore Bon AppétitEntertainingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-05", "author": ["Condé Nast", "Maggie Lange"]}