{"id": "f05c923c430f2b993cdae200b71a7cc1", "url": "https://www.bonappetit.com/story/what-is-nut-cheese", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "What IS Nut Cheese, Exactly, and Can't We Call It Something Else? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat IS Nut Cheese, Exactly, and Can't We Call It Something Else?Here's how the vegan cheese gets made.By Aliza AbarbanelApril 24, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIt’s no surprise that the food world has long looked down on nut cheese. Made from nut milk instead of animal milk, supermarket-brand vegan cheese often lacks the creaminess, depth of flavor, and, yes, cheesiness of its dairy-filled counterpart. (The somewhat unappetizing name probably hasn't helped.)Still, things are looking up in the dairy-free cheese aisle, especially as artisanal producers like Brooklyn-based vegan cheese shop Dr. Cow approach the process with the care and craftsmanship of the finest cheesemakers. Brooklyn via Argentina founders Veronica Schwartz and Pablo Castro use raw food techniques and long-term fermentation to create small batches of flavorful, textural nut cheeses. The smooth rounds of cheese are also organic, gluten- and soy-free, and made with \"absolutely no preservatives, stabilizers, artificial ingredients, or additives of any kind.\"In other words, it's nothing like the the gray-ish, mass-produced stuff you may have tried before. \"It’s not an easy process,\" says Schwartz. \"It took us around a year to master it. Even now, after 14 years, you're learning how to make cheese every day.\" Here’s a closer look at how some of the finest nut cheese gets made.Step 1: Nut SelectionMost vegan cheeses are made from cashews, which have a high fat content that helps create a rich texture that mimics dairy products. \"You can make cheese from whatever you want, but the taste will be different,\" says Dr. Cow's Veronica Schwartz. \"Some nuts like almonds are complicated to use, because their skin is bitter.\" Dr. Cow primarily uses soft cashews, macadamia, and brazil nuts—they’re also currently developing a cheese based from buttery-tasting pili nuts, which are grown in the Philippines.Step 2: Soaking and BlendingFirst, the raw, organic nuts are washed and soaked and turned into nut milk. “We’re very careful to wash the nuts and then soak them, because they’re sitting in a warehouse after traveling from other countries,” says Schwartz. \"It’s another part of the living technique—you need to treat the nuts with a lot of love.\" A nut’s size and density dictates its soak time. Tough macadamia and brazil nuts are soaked for a minimum of six hours, if not overnight, while softer cashews soak for just two or three hours before being blended into a creamy consistency.Step 3: FermentationJust like with dairy cheese, the nut milk is then infused with probiotic cultures and fermented to develop flavor and texture.  Dr. Cow ferments their cheese with Lactobacillus Acidophilus, which provides a distinct, dairy-like tang. Lactobacillus is the same culture found in a variety of dairy cheeses—it’s used as a starter culture in Swiss cheese and is added to cheddar cheese in the post-pasteurization process.Fermenting nut milk creates a soft, malleable cheese, some of which is set aside and sold as a cream cheese substitute. The rest of the batch is molded and aged—the depth of flavor and \"cheesy\" odor increases the longer the nut cheese ferments. \"Fermentation takes a minimum of eight hours to a couple days,\" says Schwartz. \"A very strong, smelly cheese will ferment for longer, and milder cheeses take less time.\"Step 4: AgingAging is a key part of the cheese making process—it’s when mild nut cheeses can develop structure and real depth of flavor. \"We usually keep our cheese for a minimum of six weeks, but you can create vegan cheese as hard as Parmesan cheese by aging it about eight months to a year,\" says Schwartz.Step 5: FlavoringTo keep vegan cheeses from tasting like, well, wet nuts, flavorful ingredients are commonly added during fermentation. Dr. Cow adds everything from reishi mushroom spores to blue-green algae to saffron and truffles. In addition to creating a more distinctive dairy-free product, infusing cheese with herbs and spices also helps cheat the taste of traditional dairy cheeses, which get their variation from factors like the type of animal milk and aging process. For example, Dr. Cow uses lapsang souchong, a strong, smoky Chinese black tea, to mimic the flavor of smoked gouda.Advanced flavoring techniques are just one way the vegan cheese market is growing to redefine their products. Small-scale producers like Regal Vegan and Punk Rawk Labs are working alongside big names like Kite Hill to create textural, flavorful cheeses that fill a real niche in the market.  To learn about some of the best nut cheeses around, check out this guide written by a bonafide cheese expert. Look for an artisanal cheese producer near you (smaller batches often translate into more opportunity for experimentation), and keep an open mind. Their products might not replace your favorite Brie, but they're a lot more delicious than their name suggests.Want more cheese content? Yeah, you do.Explore Bon AppétitHealthyishVeganCheeseCheese WeekTrendsRead MoreLifestyleFermented Nuts Aren't Cheese, And That's OkayBy Tia KeenanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-24", "author": ["Condé Nast", "Aliza Abarbanel"]}