{"id": "f05f9962487d0fd4c6ec4b350d66d05b", "url": "https://www.bonappetit.com/story/bryan-washington-memorial", "year": 2020.0, "month": 12.0, "day": 2.0, "content": "Novelist Bryan Washington on Writing—and Snacking—During the Pandemic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNovelist Bryan Washington on Writing—and Snacking—During the PandemicAuthor of the new novel Memorial chats books, food, and zesters with editor in chief Dawn Davis.By Jenna Adrian-DiazDecember 11, 2020FacebookTwitterEmailPhoto by Todd SpothFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.In our new Instagram Live series, Book Report, BA editors sit down (virtually!) with cookbook authors and other food-obsessed writers. Our first episode features editor in chief Dawn Davis and author Bryan Washington talking about his new novel, Memorial, and its unexpected main character: food. Below are some highlights from the conversation; check out our Instagram for the full interview.Dawn Davis: My real and first love is books, and I just became editor in chief of Bon Appétit. So your novel was a way for me to blend my two loves: food and writing. There are so many rich food descriptions. People express affection through cooking.Bryan Washington: Yeah, for me a lot of it was trying to write a story about warmth. And to write a story about comfort, where the characters were approaching one another from a place of affection and love. That was largely the sort of story that I wanted to read, so it ultimately ended up becoming the sort of thing I wanted to write, the kind of thing that would ultimately hold my attention.DD: Talk to me about your relationship with food.BW: A lot of it stemmed from just being a latchkey kid, like in junior high, just growing up. And both my parents worked, so if you wanted to eat, then you kind of had to learn how to cook because you’re the only one who’s there after school.But there are so many great food writers without whom I wouldn’t even be thinking of food in a literary sense, whether it’s folks like Tejal Rao, Samin Nosrat, John Birdsall, Eric Kim, or Elazar Sontag, these folks are really thinking about the different ways that food works, and not only how food works but also how food allows folks to come together or not. It’s just a really heartening thing to get to have work that’s in conversation with folks like that.DD: In many ways this is a novel that turns stereotypes on its heads. Benson is Black and his father, though flawed, is there and wants to be involved in his life. And Mike is Japanese and his father kind of abandons the family and goes back to Japan. Did you set out to disrupt stereotypes or did these characters evolve into that space?BW: I didn’t really set out to turn stereotypes on their head because I feel like if you’re writing life as it’s actually lived, it’s not one in which you’re working stereotypes and archetypes. Houston is a really deeply diverse city. So it is not shocking or strange to have a narrative where you have Black folks, and you have Asian American folks, Latinx folks, and everyone is in congress in the same narrative. There’s a way in which publishing in this country can silo the diverse books and the anti-racist books into being the only ones with characters from marginalized communities. But that’s just not true to life at all. So it was just about trying to write a story I’d want to read, featuring the kinds of stories I’ve been privy to and my friends have been privy to. And those are the kinds of stories, featuring many different kinds of people from many different places, I’m most interested in.DD: So you wrote Lot, a collection of short stories, before Memorial, and you got a lot of acclaim and attention for that. President Obama even named it as one of his favorite books of 2019. So what does that do to a writer’s ego? And how do you, you know, stay focused on writing and going on to the next book without getting overwhelmed by the success?BW: Yeah, I mean, I don’t know that I think of it in terms of ego because I’m surprised any time someone reads whatever the f*#% I’m trying to do, like, that’s always really shocking to me. It was certainly really lovely to hear that he read it, and to see it on that scale, but it’s just as lovely when my friends say that they’ve taken time with the book, or when my students say it, or when my neighbors or folks out in the world say that they’ve taken time with it.DD: Given the pandemic and lockdown I think we’re all hoping that, you know, restaurants will be able to survive despite the possible next wave of infections. What’s your feeling about the restaurants in Houston?BW: It’s hard to say a general feeling. But it’s been really heartening to see the ways the community has come together to support those restaurants, whether it’s through attending pop-ups or fundraisers or buying ready-to-eat packaged meals.DD: Do you have a favorite restaurant there?BW: I don’t know if I have a favorite. But I have a few I’ve been to fairly recently. I guess I’ll say Korean Noodle House, La Guadalupana, and My Baguettes are the places I’ve been going to quite often.DD: What kind of tools would we see in your kitchen? My must-haves include a zester. I take a zester with me if I go to someone’s apartment; I sneak a zester in my pocket.BW: I mean, I feel like a zester is something that is now going to be essential. For me a mandoline is really essential because my knife skills are getting better, but they’re not quite there and a mandoline just makes life so much easier. And also a donabe. If you’re making shabu-shabu or hot pot, if you’re making a really lovely bowl of rice, it’s just super useful.DD: Did you formally study Japanese food? Did you read cookbooks? Or is it just something that came from one thing leading to another? What would you say is your favorite dish from Osaka?BW: I grew up next to a Japanese American restaurant, and I found myself there after school, just hanging out, quite often. So that was probably my first introduction. And I started going to Osaka about five years ago; now, once or twice a year. It was mostly just to visit friends, but being privy to their kindness and the attentiveness that they’d show in their respective kitchens and getting to eat around the city was something I just felt really grateful to get to do. And certainly there are any number of cookbooks, whether it’s Japanese Soul Cooking by Tadashi Ono, which he cowrote with Harris Salat, or Japanese Home Cooking by Sonoko Sakai. There are loads and loads of texts that we’re just really lucky to have in translation.For the latter half of that question, I’d probably say okonomiyaki. The loose English translation is “grilled as you like” because you can fit so many of the things you enjoy into that particular dish. But I also really like tamagoyaki. And y’all actually just had a piece, I think, earlier this month about that dish, which was really lovely.DD: What’s your writing day like and how does food interact with that?BW: Oh, it’s pretty different now, being in the midst of the pandemic. Usually, I’m someone who writes in a bunch of different coffee shops. And where I live in Houston, you have hella boba shops all over the place. So that’s usually my jam. But as of late it’s just been making quick sandwiches like quick snacky foods that you're able to pick up and then have, like, in the midst of doing whatever you’re doing that are not like a lot of work to put together but that have a high payoff. So it’s trying to find little things that are quick but also deeply comforting and satisfying.I’m finding that I have to be kinder to myself, right? Like, not being as productive as I would have been like eight months ago, nine months ago, or even a year and a half ago. So yeah, I think that there’s a certain amount of grace that we should all be extending to ourselves right now.Memorial$19 at Amazon$25 at BookshopExplore Bon AppétitBooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-11", "author": ["Condé Nast", "Jenna Adrian-Diaz"]}