{"id": "f066a95eed26c9f6f174a8e14bfe3322", "url": "https://www.bonappetit.com/recipe/lobster-pasta", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Lobster Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesLobster PastaBy Amiel StanekDecember 11, 20194.6(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food styling by Kat Boystova, prop styling by Allie WistEmailPinterestPrintEmailPinterestPrintThis recipe is no small amount of work, so be sure to make it for the people you really, really like. The pro move is to break up the process over two days—that means cooking the lobsters, picking the meat, and infusing the cream on the first day, which leaves cooking the pasta and heating everything back up to serve on the second. And no, you can’t just buy already picked lobster meat; you need the shells to infuse the sauce with tons of flavor. You can, however, ask your fishmonger to steam the lobsters for you, which many will do for free if you ask. No judgie.Ingredients4 generous servingsKosher salt21½-lb. live lobsters1medium onion, coarsely chopped2celery stalks, trimmed, coarsely chopped3garlic cloves, peeled, smashed2sprigs basil or tarragon4cups heavy cream½tsp. crushed red pepper flakes1lb. bucatini or spaghetti1Tbsp. unsalted butter3oz. Parmesan, finely grated (about 1 cup), plus more for serving3Tbsp. chopped chivesFreshly ground black pepperPreparationStep 1Fill a large pot with a tight-fitting lid with 2\" of cold water. Generously season with salt and bring to a boil. Add lobsters to pot, cover, and steam until shells are bright red, about 8 minutes. (Better to slightly undercook the lobsters since you will be reheating the meat before serving.) Transfer lobsters to a large rimmed baking sheet and let sit until cool enough to handle.Step 2Break down those lobsters! (Never picked lobster meat before? That’s what YouTube is for!) Cut or tear off small legs and eat them (they make for a great snack). Remove tail meat, cut tail meat in half lengthwise, and cut each half into bite-size pieces; transfer to a medium bowl. Remove meat from knuckles and claws, doing your best to keep the meat as intact as possible (it’s nice to have a whole claw for each person); add knuckle and claw meat to bowl with tail meat and chill until ready to serve.Step 3With a sturdy knife, hack carapace and shells into 1\" pieces and transfer to a large Dutch oven or pot. Add onion, celery, garlic, basil, cream, and red pepper flakes. Bring to a boil, then reduce heat to medium and simmer, uncovered and stirring occasionally, until cream is reduced by half, about 45 minutes.Step 4Strain lobster cream through a fine-mesh sieve into a medium bowl, pressing on solids to get as much liquid out as possible; discard solids. (If cream isn’t reduced to about 2 cups, don’t sweat it—you can always reduce it a bit more before adding the pasta.)Step 5Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. (You don’t want it to be too al dente, as it’s not going to spend that much time in the sauce.) Drain, reserving 1 cup of pasta cooking liquid.Step 6Meanwhile, return lobster cream to Dutch oven or a wide deep skillet. Heat over medium and bring to a simmer; taste and season with salt. Add reserved lobster meat and butter to cream sauce and stir to combine.Step 7Add pasta to Dutch oven and toss gently to combine (you don’t want to break up the lobster meat too much), adding 1 cup Parmesan a handful at a time until sauce is thick and cheese is incorporated. If sauce looks too thick, add a splash or two of reserved pasta cooking liquid to loosen it up. Remember: Cream sauces always thicken as they cool, so it’s best to err on the side of loose.Step 8Transfer lobster pasta to a platter. Top with chives and a few cranks of black pepper. Serve with more grated Parmesan alongside.Step 9Do Ahead: Lobster cream sauce can be made 24 hours ahead. Strain and transfer to a reasealable container and chill. Gently rewarm sauce in a Dutch oven over medium-low heat. Lobster meat can be picked 24 hours ahead. Cover and chill.How would you rate Lobster Pasta?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleThis was fantastic - made it for a New Year's Eve dinner.  I used tarragon rather than basil and I just did the lobster stock reduction on its own and then added and reduced the cream afterwards as I didn't want the cream to split.  I also added a splash of brandy.  Tasted amazing.CharlieLondon1/1/2022This recipe was INCREDIBLE!  I cook A LOT and can honestly say that this is one of the best things I've EVER made!  I followed the recipe without modifications.  For herbs I used a mixture of fresh tarragon and basil instead of choosing one.\n\nThe sauce was beyond delicious and I served it with homemade pasta which completed it!\n\nThanks so much for this amazing recipe!⭐⭐⭐⭐⭐Stacey's KitchenToronto1/1/2022Amazing! You can even modify slightly by using Barilla Celletani (curly pasta) instead of spaghetti for more of a Lobster Mac \"LIGHT\". I only had  2 small lobster tails so I added 1/2 bag of frozen shrimp,  16-25 size cut into pieces (3), so each bite would have deliciousness. Didn't have enough heavy cream so did half heavy cream and half  HalfNHalf, which worked. Added zest of 1 lemon as another reader recommended. Topped with shaved parmesan and panko bread crumbs. Low broil 10 minutes. Everyone devoured it. Would I make it again? Absolutely. A great side for any meal or on it's own.Mrs. GoreWalnut Creek, CA10/4/2021OMG! This is lobster pasta is divine! You would not get any better at a Michelin restaurant!JJSydney, Australis8/15/2021Great recipe!  I followed the instructions as indicated, but used 4 lobster tails.  Did not have fresh chives or tarragon, so just used fresh basil.   (Will try the tarragon and chives next time.)  It truly does make 4 servings.  Best thing is you can make the sauce a day ahead,  (and clean up all the mess), making it perfect to serve to dinner guests.  AnonymousDenver, CO1/2/2021This was amazing. Turned out perfectly. I also made my own pasta which is definitely worth the extra effort. Mrs JonesAustralia 4/10/2020Made for Christmas Eve, and it is lovely and indulgent. I did add some lemon zest, as I thought it needed more acid, but depends on your taste. AnonymousNew York3/20/2020Believe the hype! This pasta recipe is absolutely amazing! I made it on a whim and used 4 large lobster tails instead of 2 full lobsters. Highly recommended! MiamiSarahA1/2/2020This was very good. It took my cream closer to 25-30 minutes to reduce, instead of 45, but otherwise, this was spot on (lobster steam time included). Thanks, Amiel!AnonymousNashville12/27/2019This was fantastic! We used it as part of the main course for a Christmas dinner party. I really wondered if I actually need the lobster shells for the sauce - so glad I followed exactly. The flavor was so good! AnonymousDallas, Texas12/22/2019This was excellent. I made it using two pounds of already cooked shell-on claws and arms and am very pleased with how it turned out. When making it again, I might add a splash of sherry to the pan after straining the cream and before adding it back to the pan but wouldn’t change anything else. YUM!Taydub24Portland, OR12/17/2019I agree with loke2112. 6 minutes is a rule of thumb for cooking lobster once it's boiling.\nI learned this in New Zealand from Lobsters fishermen. 12/16/2019This was... so good. Made it exactly as specified here for a birthday dinner and was blown away. kristenoelLA12/16/2019Please read the first line of the prior review. It’s lobster, cream and pasta. Make it. ExpensiveButterNot Jersey Shore12/14/2019Ok I did not make this but....8 minutes for small lobsters is completely cooked. And then there is no indication of using an ice bath so they will continue to cook and the get reheated??. Cook the lobsters for 6 minutes max and chill in ice water or you will be chewing chewing chewing and not enjoying anything fair warning!!Loke2112S JerseyShore12/12/2019Explore Bon AppétitPastaLobsterShellfishSeafoodSpaghettiPasta & NoodlesMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-11", "author": ["Condé Nast", "Amiel Stanek"]}