{"id": "f067bd6944e63f15ec60622429b675d7", "url": "https://www.bonappetit.com/recipe/skillet-cod-clams-and-corn-with-parsley", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Skillet Cod, Clams, and Corn  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueSkillet Cod, Clams, and Corn with ParsleyBy Claire SaffitzJuly 10, 20184.7(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintWho says clam sauce is only good for pasta? Not this buttery corn-studded dish. You might notice we don’t ask you to season the sauce in this recipe. It’s intentional: All that clam liquid is plenty salty.Ingredients4 servings 1¼lb. skinless cod fillet, cut into 4 pieces, patted dryKosher salt, freshly ground pepper⅓cup all-purpose flour4Tbsp. extra-virgin olive oil, divided1large shallot, finely chopped⅓cup dry white wine12littleneck clams, scrubbed2medium ears of corn, kernels cut from cobs (1–1¼ cups)3Tbsp. unsalted butter, cut into pieces¼cup chopped parsleyLemon wedges (for serving)PreparationStep 1Season cod all over with salt and pepper. Sprinkle flour over a large plate and, working one at a time, press side of fillet where skin used to be into flour to thoroughly coat. (Coating the cod with flour before cooking prevents the flaky fillets from tearing; any bits left in the pan will give body to the clam mixture.) Tap off excess and set on a platter, flour side up.Step 2When buying a big portion of cod or other skinless fish, you’ll often end up with the skinny tail end. Keep it from overcooking by folding the tail end underneath itself to create a piece that’s closer in thickness to the rest of the fillets. Then proceed to cook it as you would any other piece.Joe WilsonStep 3Heat 2 Tbsp. oil in a large nonstick skillet with a tight-fitting lid over medium. Cook cod, floured side down, shaking skillet occasionally to prevent sticking, until flesh is opaque and starting to flake around the sides and underside is golden brown, 5–7 minutes. Carefully turn cod over and reduce heat to low. Cook until cooked all the way through (flesh should be completely opaque), about 2 minutes (thinner pieces may go more quickly). Place on platter, golden side up; take care not to break up the delicate fillets.Step 4Turn heat back up to medium, pour remaining 2 Tbsp. oil into skillet, and cook shallot, stirring often, until tender and golden, about 2 minutes. Add wine; cook until almost completely evaporated, about 1 minute. Add clams and cover skillet. Cook until clams open, about 5 minutes (some clams might take a few minutes longer). Uncover skillet and transfer clams, discarding any that didn’t open, to platter with cod.Step 5Reduce heat to low and add corn and butter to skillet. Cook, stirring, until butter is melted, sauce is thick and glossy, and corn is tender, about 3 minutes. Spoon corn mixture over fish and clams. Top with parsley; squeeze lemon wedges over.How would you rate Skillet Cod, Clams, and Corn with Parsley?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleIt’s corn season in NE Ohio! Can’t wait to hit my fish monger tomorrow and make this!Ann pAshtabula, OH8/5/2021my sister made this and it was a huge hit. i would like to make it for a dinner party coming up, but one of the guests is gluten free. has anyone used a gluten free flour, or suggest a good sub for the wheat flour the cod is coated in?gretchen hatzLos Angeles7/21/2021Made this for family dinner tonight.  Based on on the reviews below I tripled the quantities given in the recipe to serve 6 people because my sons are big eaters...fortunate I did so because there was nothing left!   I added 3 cloves of finely chopped garlic with the shallots and a 16 oz pack of frozen sweet corn which I had thawed.  I had lemons ready to use but everyone liked the flavors as they were.  Reminded me of moules mariniere.  Served with crusty bread, linguine cooked al dente tossed with a little butter and a simple Caesar salad with home made dressing and freshly grated parmesan.   Fruit tart with vanilla ice cream ended the meal.  I cook every Sunday and this meal was voted top 5 and I was asked to repeat it soon.FormerbritLos Angeles, CA7/12/2021My guests loved it - rave reviews.  I read the comments before making it and added extra corn, garlic, a bit of chili flakes & extra lemon.  I used a LOT of fresh, sweet corn & it came out beautifully.cary perkinsPortland, OR8/27/2018I am giving this a full 5 star rating. I personally think the flavors are what they are supposed to be here and even after reading the other comments I personally would not change this recipe. It is fresh, healthy and full of flavor. Remember to squeeze the lemon on last as suggested and add the salt. This has become a family fave!\nAnonymousLake Mohawk, New Jersey8/26/2018Looked impressive and tasted pretty good, but one-third cup of wine wasn't enough in my large frying pan to cook the clams without the pan going dry and the shallots burning.Anonymous8/25/2018Great recipe! One tip for all bivalves. Wash and shake them before cooking and discard any that don't close completely. If they fail this test, they are not healthy and not safe to eat. Of course also discard any that fail to open after cooking.John Squires800078/21/2018A fantastic August meal, and, as other reviewers have said, a great pick for a low-stress dinner party showstopper.  I did make some alterations though.  I added 3 cloves of garlic with the shallot, as another reviewer suggested, and I didn't let the wine evaporate off very much, which made a delicious broth that could be soaked up with a little bit of good bread.  Next time I would probably do 3 ears of corn, too.  But with these slight tweaks, this recipe is a definite keeper.AnonymousWestchester County, NY8/20/2018Just ok.  Didn't have as much flavor as I would have expected when I was making it.  Maybe adding some chili flakes, alot of garlic and a squeeze of lemon would help.  I think linguine with clams is probably easier and a little more fulfilling.  On the fence if I would try it again.  I imagine it would be good and easy for a summertime dinner party.AnonymousLong Beach8/8/2018Oops, wanted to write substituted a third of a cup of wine with a third of cup of beer.kalsmiVermont 8/7/2018Made this one pan wonder tonight as written except substituted beer with the wine. Our delicious corn was picked today . My dinner guests raved about it. kalsmiVermont8/7/2018Made this tonight...loved it! Really great blend of tastes, reminded me somewhat of a clambake back in the day on Long Island. I used canned chopped clams & the flavors were there. Also added 3 garlic cloves to the shallot. Would definitely recommend & make again. Served with caprese salad of gorgeous farmstand tomatoes, mozzarella & arugula. Perfect summer dinner! Thank you BA!!AnonymousLos Angeles,CA7/24/2018Explore Bon AppétitCodFishSeafoodClamShellfishCornVegetableSummerEasyWeeknight MealsMainNut-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Claire Saffitz"]}