{"id": "f06939a81177dd55e5d49a3574735d4b", "url": "https://www.bonappetit.com/recipe/tomato-caesar", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Tomato Caesar Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueTomato CaesarBy Chris MoroccoJuly 6, 20214.6(40)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata, food styling by Micah Morton, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintTo stand up against juicy tomatoes, we made this dressing extra thick. A blender will get you the best results, but if you’re hand-whisking, add another 1 Tbsp. mayonnaise for the consistency you need. Tomato slices are better than wedges here; laid flat, they hold the dressing in place.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonMicroplane$16 At AmazonPlatter$29 At Amazon8-Inch Chef's Knife$47 At AmazonIngredients4 Servings3oil-packed anchovy fillets1small garlic clove⅓cup extra-virgin olive oil3Tbsp. fresh lemon juice1Tbsp. mayonnaise1tsp. Dijon mustard2Tbsp. finely grated Parmesan, plus shaved for servingKosher salt, freshly ground pepper1½lb. mixed tomatoes, sliced, quartered, or halved½cup basil leavesPreparationStep 1Purée anchovies, garlic, oil, lemon juice, mayonnaise, mustard, and 2 Tbsp. Parmesan in a blender until smooth. Season dressing with salt and pepper. (Or, finely chop anchovies and garlic and whisk together dressing in a medium bowl.)Step 2Arrange tomatoes on a large plate; drizzle dressing over. Top with basil and shaved Parmesan; season generously with pepper.How would you rate Tomato Caesar?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleHello, I made three batches of this basic dressing. First followed your recipe exactly. Those who ate your exact recipe said it was good but, said it lacked body and the velvety creamy mouth feel. \nSecond I left out anchovies, added egg yolk and Worchestershire. Of the 2 this was a bigger hit as it added some of the body and creamy feel without the fishy taste. Third I made with anchovies (rubbing the wooden bowl) and egg yolk. This was the true favorite.\nBefore serving, each were in fridge 30 minutes. Also, as brands have different amounts of salt I left it out until all else was blended and tasted. Thanks for sharing!raf\nJust an FYI, I worked in a restaurant which served \"custom\" Caesar Salads. The gentleman who made each one reported, requests were very close for, anchovies or not. No one ask to have the egg yolk left out. One table of regulars always asked to have, beer added.\nRobertaLos Angeles, Ca.10/15/2021Anonymous - thanks for turning an ingredient added to a recipe into anti-American bigotry.  Yeah, you don’t have too many issues. JPPortland 10/11/2021I made this and followed the recipe.  I had a 6 ounce grilled chicken breast leftover, so I shredded it and split it between 2 salads. I thought this was wonderful.  I tried to split the dressing for 4 servings, but after the two salads I probably only have enough dressing left over for 1 more salad.  I enjoyed the other reviews - all the banter about what a real Caesar dressing is.  I like this recipe.bullcitybobDurham, NC8/25/2021I made this for a family picnic, and it was delicious. The dressing may not be traditional, but it is great, anchovies and all. I made a big batch in the food processor so I can make a quick salad when I bring in tomatoes and basil fresh from the garden. There is nothing quite like a tomato when it is still warm from the sun.Marko52South Range, WI8/24/2021whisking in the oil is fine, but since I left cooking school I have used a food processor, it's a lot easier.wil wagSan Francisco8/20/2021I am a Caesar salad purist and would never add anchovies. The original Carsar salad dressing was made with Worcestershire sauce (which contains anchovy) but the chef did not ruin a good thing by adding extra.  I don’t think you can improve on true Caesar dressing (ok I get the mayo thing if you want to avoid raw egg, but it does add a different taste to the dressing).  But over-the-top anchovy?  So American.AnonymousCalifornia 8/20/2021Anonymous, Sure, and that would be another recipe! TR8/14/2021I did not use the anchovies, but followed rest of recipe except I put fresh feta instead of extra Parmesan on top with the fresh basil UBHbg. Pa. 8/9/2021Tangy, salty, and delicious! A great combination of flavors. To avoid a split in the dressing, mix all dressing ingredients except for the oil and then add oil in a slow steady stream.ElisabethBoone, NC7/19/2021I though this was okay… but would’ve rather I have just kept it simple with a balsamic and EVOO. The dressing was just a little too creamy and didn’t mesh well with tomatoes. It probably would be better balanced with heavy dosing of some greens. Anonymous7/14/2021Just made this salad last night with fresh heirloom tomatoes and basil picked from our garden. It was delicious and received rave reviews from my family. Highly recommend. SusanMonument, CO7/12/2021Explore Bon AppétitSaladItalian AmericanAmericanTomatoVegetableBasilHerbs & SpicesSummerQuickEasySideGluten-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Chris Morocco"]}