{"id": "f06c7fe4341564c51dc9cb001eda0148", "url": "https://www.bonappetit.com/story/double-pork-carnitas", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "The Summer of Pork Fat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Summer of Pork FatFood director Carla Lalli Music makes a case for double-pork carnitas in August.By Carla Lalli MusicAugust 16, 2018FacebookTwitterEmailLinda XiaoFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I can't stop thinking about this recipe.Guys.Have you listened to last week’s Bon Appėtit Foodcast yet? Episode 176? If you tuned in, you know it was all about last-gasp summer wishlist cooking, and you already heard me get interrupted a thousand times by Adam while I was making extremely important points about how stupid zucchini is and why you should always have a little pot of melted butter and vinegar at your side while you’re grilling.This episode is haunting me because of the epic culinary tale our guest and cohort, Gabe T., told about making carnitas tacos in the Vermont wilderness with a bunch of friends.Gabe’s carnitas were uniquely epic because they were made with the leftovers from cooking an entire pig the day before. This, as I pointed out during the recording, is a tough situation to replicate for the average home cook.Want this letter before it hits the website? Sign up for our newsletter!I couldn’t stop thinking about them, though, and went down a path that led me to our own Double Pork Carnitas, which can be made by anyone, anytime, and you and I and everyone we know should take advantage of that fact. And soon! The double pork in the recipe name does not mean you have to roast, shred, and crisp a whole pig. The two types of pork in this recipe refer to the shoulder and the belly, which are cooked together gently until the meats are tender, and then they’re crisped up in their own fat. Yah! And then the shreddy little browned pork bites (literally, the carnitas) are tucked into warm corn tortillas with all the fixings, and life for anyone who eats those tacos is improved by one thousand percent.I won’t lie: When Rick Martinez was working on this recipe, we all thought his addition of pork belly was typical Rick gilding-the-lily behavior, as if well-marbled pork shoulder isn’t adequate on its own. The carnitas method, though, is a simple and rewarding celebration of fat: Cook a tough cut of pork in enough liquid to tenderize it, then use its rendered fat to add another, contrasting texture. Nothing wasted, everything gained. The belly ensures there are ample drippings available for the second stage of browning and crisping, but it also guarantees that the pork belly is enveloped in fat during the braising stage. That means the pork has no chance of drying out, and the shoulder takes on a positively silky texture as it makes its way to Tenderville.Photo by Alex Lau, food styling by Rebecca JurkevichYes, it’s high summer, and we should be eating tomatoes and eggplant and finding reasons to bake with sour cherries and apricots and all the stone fruit. This carnitas recipe is not made outdoors on a grill (though in Gabe T.’s magical reimagining, it was). But a taco party, with cold beers and a couple pitchers of colorful aguas frescas at the ready—that’s reason enough to get the gang together.We’ve got five weeks left, friends. If you haven’t fried meat in fat and spooned it into a tortilla, did summer really happen?Get the recipe:Double-Pork CarnitasIt’s worth seeking out pork belly for the amazing texture it lends, but if you can’t get it, substitute with another pound of shoulder.View RecipeExplore Bon AppétitCarla NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Carla Lalli Music"]}