{"id": "f07f00d93da7db7952e6186771081875", "url": "https://www.bonappetit.com/story/3-cocktail-parties", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "The Perfect Cocktail Party Menu for Every Kind of Holiday Hang | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Perfect Cocktail Party Menu for Every Kind of Holiday HangA low-key gathering. The day-after brunch. Family fun. Whatever you’re up to this year, we’ve got drinks and snacks for that.By Elyse InamineDecember 1, 2021FacebookTwitterEmailPhotographs by Emma FishmanFacebookTwitterEmailImagine with us: You’re throwing your first holiday cocktail party in what is actually years. You’re not really sure how to socialize again and you start spiraling (welcome to the club!). Then you watch your guests start gravitating to the bar and something changes. Your bestie pours a cup of punch for someone they just met, two acquaintances bond over a shared secret (they’re just here for the food), and a characteristically quiet friend is suddenly regaling a small crowd with stories of holidays past. Look at that: You’re hosting! Listen, we get it. Diving back into the festive spirit feels weird after such a looooong hiatus, which is why we’ve done the heavy lifting for you. Read on for our favorite cocktail party menus.TBH, the party is still goingSometimes the party spills over into the next day, which is what inspired this hair-of-the-dog menu. It begins with the necessary carbs to soften the blow of last night’s decisions. We’re talking salty-sweet scones that balance caramelly dates with funky Gorgonzola and curried egg tartines that your guests can assemble themselves once they roll out of bed. But the star of this menu picks up where the party left off: a celery and salted lemon vodka soda anchored by the most ridiculous (and fortifying) garnish—whatever tinned seafood you have (mussels, boquerones), pickled chiles, a cube of Manchego, and a big lemon wedge. Ah, the holidays.Celery and Salted Lemon CocktailThis brunch cocktail uses 8 celery stalks so, if you ignore the vodka, it’s basically spa water.View RecipeDate and Gorgonzola SconesAs good with a cocktail as they are with tea or coffee, these mostly savory scones are perfect for a hair-of-the-dog brunch when the party continues into the next day.View RecipeCurried Egg Tartines Fried bread is good. A slice of fried bread piled with creamy, curried egg salad is even better. View RecipeMy family is “just dropping by”Sometimes your people come around unannounced and hungry and you need to get it together fast (i.e., before Aunt Mabel starts giving everyone her unsolicited opinions). The key to unlocking this off-the-cuff intimacy is a festive (and bottomless) punch paired with satisfying snacks that come together while everyone’s milling around the kitchen watching you cook: a maple-za’atar kettle corn and a burbling skillet of French-onion-soup-inspired dip.Cranberry Rum PunchThis rum punch is very simple to throw together, but cranberry-studded ice makes it feel deceptively fancy, doubling as a festive garnish and temperature control.View RecipeCreamy French Onion DipThe love child of French onion soup and French onion dip. Need we say more?View RecipeMaple-Za’atar Kettle CornKettle corn is undeniably delicious, so there’s no reason to mess with it—unless the alternative is utterly showstopping. Enter this maple-za’atar kettle corn.View RecipeI just wanna chill with my number-onesIf having just a few friends over is more your speed, we got you. Not every cocktail party needs to be boisterous or even boozy. Instead, invite your pod (remember those?!) or a few folks you haven’t been able to spend enough time with for a cozy gathering. Catch up and stay clearheaded throughout the night with this zero-proof spiced blood orange shrub (but if you want a little something-something, just add 1.5 ounces of vodka or whiskey to each glass). Here we’re taking things slow, sinking into conversations we’ve missed, snacking on fried olives and meaty skewers, and letting the night guide us.Spiced Blood Orange ShrubRefreshing, alcohol-free (just don’t call it a mocktail), and a noble destiny for that bag of citrus hanging out in the fridge.View RecipeCrispy Olives With Calabrian Chile SauceTake olives from snack to PARTY snack by coating them in panko and deep-frying them until golden brown and shatteringly crisp.View RecipePeppery Antipasto SkewersRib eye makes these antipasto skewers extra special, but there’s lots of room to play around with proteins, cheeses, and briny bits.View RecipeExplore Bon AppétitCultureHoliday DrinksCocktailappetizerRead MorecookingAyesha Curry’s Jubilant Holiday FeastGallery5 SlidesBy Ayesha Curry and Nico Avallerecipes47 Easy Cookie Recipes You’ll Make on RepeatGallery47 SlidesBy Alyse Whitneyrecipes70 Healthy Christmas Recipes That Are as Festive as 'Jingle Bells'Gallery70 SlidesBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-01", "author": ["Condé Nast", "Elyse Inamine", "Nico Avalle"]}