{"id": "f084fa1ddc2d3f90dd495e84d90cde98", "url": "https://www.bonappetit.com/recipe/cold-beef-tenderloin-with-tomatoes-and-cucumbers", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Cold Beef Tenderloin Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueCold Beef Tenderloin with Tomatoes and CucumbersBy Anna StockwellJuly 10, 2018EmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintFor this dinner-served-cold recipe, beef tenderloin is precious enough to baby on a two-zone grill: Sear it over high heat, then transfer it to the cooler side and turn it often to hit a perfect medium-rare.Ingredients8–10 servings ¼cup extra-virgin olive oil, plus more13½–4-lb. beef tenderloin3Tbsp. whole black peppercorns, coarsely crushed2Tbsp. kosher salt3lb. heirloom tomatoes (6–8), sliced into ¼\"-thick rounds6mini seedless or Persian cucumbers, sliced into ¼\"-thick rounds1cup basil leavesSherry vinegar or red wine vinegar (for serving)Flaky sea saltFreshly ground black pepperLemony Yogurt Sauce and/or Grilled Serrano Salsa Verde (for serving)PreparationStep 1Prepare a grill for 2-zone heat (for a charcoal grill, bank two-thirds of coals over one side of grill and scatter remaining coals over the other side; for a gas grill, set one burner to high heat and the remaining burners to medium-low heat). Clean and lightly oil grate. Rub tenderloin with ¼ cup oil and sprinkle with peppercorns and kosher salt. Grill over hottest part of grill, turning often, until lightly charred on all sides, about 5 minutes. Move to cooler part and continue to grill, turning often, until an instant-read thermometer inserted into the thickest part registers 120° for medium-rare, 25–30 minutes longer. Transfer to a platter and let cool.Step 2Just before serving, thinly slice tenderloin on a large cutting board you can also serve from (or transfer back to platter). Arrange tomato slices, cucumber slices, and basil alongside. Drizzle tomatoes and cucumbers very lightly with vinegar. Drizzle oil over everything and season liberally with sea salt and ground pepper. Serve with Lemony Yogurt Sauce and/or Grilled Serrano Salsa Verde alongside.Step 3Do Ahead: Beef tenderloin can be grilled 1 day ahead. As soon as it is cool, wrap tightly in plastic (do not slice) and chill until ready to serve.How would you rate Cold Beef Tenderloin with Tomatoes and Cucumbers?Leave a ReviewTell us what you thinkExplore Bon AppétitBeef TenderloinBeefMeatTomatoVegetableCucumberBasilHerbs & SpicesSummerEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Anna Stockwell"]}