{"id": "f089e137c239e32d4a21e97362dbe29e", "url": "https://www.bonappetit.com/recipe/smash-burger-alfresco", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Smash Burger Alfresco Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueSmash Burger AlfrescoBy Molly BazJuly 9, 20194.8(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintLike most everyone else, we can’t seem to get enough of the smash burger, with a lacy griddled patty (or two, actually, to maximize that crispy exterior). But, like drinking an Aperol spritz, cooking it is best done outside. Our grilled version won’t smoke out your kitchen, blanket your stove with grease, or ask you to spend even one more minute of this sweet summer night indoors. We found that a three-ounce patty hits the sweet spot: big enough to fill out the bun when smashed but small enough that two patties aren’t overkill.Ingredients4 servings1cup finely chopped dill pickles½cup mayonnaise2Tbsp. ketchup2Tbsp. sauce from a can of chipotles in adobo½tsp. kosher salt, plus more1½lb. ground beef (20% percent fat)4potato rolls½head of iceberg lettuce, leaves separated, torn into pieces about the size of the buns1white onion, very thinly sliced into rings on a mandoline4thin tomato slices (optional)2Tbsp. vegetable oil8slices American cheesePreparationStep 1Prepare a grill for high heat. Place a cast-iron griddle, flat side up, on grate; heat until very hot, at least 20 minutes.Step 2Mix together pickles, mayonnaise, ketchup, adobo sauce, and ½ tsp. salt in a medium bowl; set special sauce aside.Step 3Divide beef into eight 3-oz. portions (don’t form into patties). Place 4 portions between 2 sheets of parchment paper, spacing 6\" apart, and, using a meat mallet or skillet, firmly smash to create thin patties, about 5\" across. Transfer to a baking sheet. Repeat with remaining portions and fresh parchment paper.Step 4Wrap all the buns together in a large sheet of foil to make a packet (this will keep buns soft and from getting too toasted on the grill). Place packet on grate and grill, turning once, until buns are warmed through, about 1 minute. Spread sauce over cut sides of buns. Place 3–4 pieces of lettuce on bottom buns and top each with some onion and a tomato slice, if using.Step 5Drizzle oil over griddle and use paper towels to evenly coat surface. The oil needs to be hot; you should see smoke almost instantly. Season patties lightly with salt. Place 4 on griddle, seasoned side down, and season top sides lightly with salt. Cook, undisturbed, until outer edges are brown and undersides are very crisp, about 2 minutes. Flip and place a slice of cheese on top of each patty. Cook until cheese is melted, about 30 seconds. Transfer patties to buns with toppings, stacking 2 patties on each bun. Repeat with remaining 4 patties, scraping off any cheese stuck to griddle in between batches.How would you rate Smash Burger Alfresco?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThese are great! I found the double meat + double cheese situation to be a bit too much with the small and soft potato bun (not sure if I bought the wrong size or style, it seems strange to me that the pic shows a sesame-seeded bun but the recipe calls for a potato bun), so I ate the second batch as one patty per burger. I don't have a grill, so I just did it on the stove - works totally fine, it's just very smoky so be warned! AnonymousNew York9/8/2020These are FANTASTIC. Taste just like restaurant style smash burgers and are so easy to make. Just made them twice in three days. KathEatsPhiladelphia 4/27/2020This was the best burger we've ever made period so I'll be smashing all my burgers from now on. And whoever on here talking about calories please leave that at the door and love yourself my god. If this pandemic has taught us anything it's that life is SHORT. Eat the damn burger and shut up.AnonymousIowa4/27/2020This is amazing!  Changed the way we make burgers forever.  Only thing possibly more exciting is the adaptation in the article in which Adam Rapoport explains George Motz’s smash burger...AnonymousAustin Tx9/7/2019Bjoycollier, got nutritional info from epicurious.com site where this recipe was also posted.  But when I went back to that site to copy the link, I'm embarrassed to say I noticed it was for FOUR servings, not one.  That reduces calorie count to 803, which is still quite high but more in line with this type of hamburger.  So if 45g of fat doesn't concern you, go for it!AnonymousCambridge MA9/1/2019Anonymous, you should double check your calculations. When I looked up all the ingredients it came out closer to 950 calories (and that’s assuming all that oil stays on the burgers, which it won’t). Easy enough to sub out some of the cheese or one patty instead of two. OR just live life in moderation and eat the smash burger because man cannot live on salad alone. bjoycollierPhoenix 8/31/2019Hate people who write reviews w/o trying recipe, but after checking nutritional info, feel morally obligated to tell readers up front (shouldn’t Bon Appetit?) that consuming this delicious-sounding concoction may result in cardiac arrest, seriously ... each burger = Calories 3213, Carbs 223g (74% RDA), Fat 179g (275%), Sat Fat 58g (288%), Sodium 3146mg (131%), Cholesterol 481mg (160%). Should have warning:  Could be hazardous to your health! AnonymousCambridge MA8/31/2019👏🏻👏🏻👏🏻👏🏻 Omg, what a hit for a Monday night with the neighbours!!!! Absolutely delicious. Another BA go-to recipe for sure.   \nPS seriously, everybody thinks i’m this great cook ever since Ive started following you guys!!! 👍SueChen25Toronto, Canada 🇨🇦 8/13/2019Very very good, I did it in situ. On a griddle. Next time I will take it outside! roxyticoLucas Valley, CA7/18/2019Explore Bon AppétitBurgerAmericanGround BeefBeefMeatSummerQuickEasyWeeknight MealsMainGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Molly Baz"]}