{"id": "f09f1d3ac3623dde0b4b0873a9cf408a", "url": "https://www.bonappetit.com/story/race-week-diet", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Healthyish Newsletter: My Race Week Diet: Pizza, Lobster, Falooda, and More | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMy Race Week Diet: Pizza, Lobster, Falooda, and MoreFalooda fan mail and other opinions from Healthyish editor Amanda ShapiroBy Amanda ShapiroSeptember 13, 2018FacebookTwitterEmailIllustration by Felicity MarshallFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Hi from our nation's capital,Where the weather app keeps telling me it's raining but the sun is still out. I'm here for our Healthyish Superpowered dinner at Timber Pizza, honoring Simone Jacobson, which is going down tonight!I've been here since Monday, when I did my first-ever Crossfit workout alongside Timber Pizza chef (and seasoned Crossfitter) Daniela Moreira, who handed me my ass (in an encouraging way). Since then I've eaten the best lobster laing of my life at Bad Saint, a to-die-for Japanese fish and rice breakfast courtesy of Spoken English at The Line, and some lamb shoulder from Maydan that I'm still dreaming about. I also biked over to Union Market, where I tried my first and definitely not last falooda (a cold, creamy dessert popular in South Asia) at Jacobson's Burmese grocery/cafe, Toli Moli. And this morning, I finally got to see the National Museum of African American History, which is as incredible as everyone says it is, including chef Jerome Grant's Sweet Home Cafe, where I ate some roasted trout with cornbread and mustard green stuffing. Yeah, I'm full.But it's all fuel for the 10K I'm running this weekend. I've never run a race before, so training was a big experiment. I ran three days a week including a longer run on the weekends, did a day or two of strength training, and cut back on alcohol. I didn't change my diet otherwise but I was hungry more often and got really into these refrigerated protein bars, which actually taste like food and not cement. For race day, I've got my lucky shorts and a good playlist... and some brunch plans for when I'm done.  What's your race day strategy? Let me know: healthyish@condenast.com.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletterRead MoreLifestyleThe Newsletter Is Back and So Is Virgo SeasonBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-13", "author": ["Condé Nast", "Amanda Shapiro"]}