{"id": "f0a1948536b9b4b508681488820ee453", "url": "https://www.bonappetit.com/story/clam-toast-mini-feast", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "How Is Clam Toast Not One of the Seven Fishes? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow Is Clam Toast Not One of the Seven Fishes?Food director Carla Lalli Music’s three favorite words are “bread for dipping,” and this dish delivers.By Carla Lalli MusicDecember 20, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.One of the seven fishesThere are many ways to participate in Feast of the Seven Fishes, the legendary Italian Christmas Eve sea creature celebration.There’s the hardest way, in which at least seven fishes need to appear, a challenging and potentially exhausting undertaking that’s only doable if you have a lot of cooks in the kitchen alongside you. (In my family, we’re loyal to my mother’s majestic menu, which takes three days to prep, and then my mom, my sister, and I cook all the courses for 16 of our closest friends. Everyone stays up until 3 a.m. and we need two days to recover.)Want this letter before it hits the website? Sign up for our newsletter!There’s the medium way, which is good for people who are ambitious but not insane and just want to take the fishes for a spin. For these strategic-realistic folks, I recommend Andy Baraghani’s achievable but still impressive dinner, which smartly combines make-ahead dishes, a hands-off, slow-roasted fish, and one à la minute pasta.Photo by Chelsie Craig, styling by Judy ManciniBut for those of you who go all-out on Christmas Day and can’t pull together a huge multi-course dinner party on the 24th, I’ve got a mini-feast for you, and it’s called clams on toast.That’s right: Clams on toast. The recipe is from Hart’s restaurant in Brooklyn, and it is like having linguine with clams except without the linguine. In place of the linguine, you get a giant hunk of fried bread, and instead of a sauce that clings to the noodles, you get a shallow bowl of herb-flecked, garlic-and-wine-infused, red chile–studded broth, which you’ll quickly realize is what the bread is for.Of course, there are also clams, one of the easiest and most forgiving of all of the fishes in the sea. As long as you buy small, fresh, hard-shelled clams (ideally littlenecks on the east coast, Manila clams on the west), you’re off to a great start. Scrub the shells to dislodge any sand or grit, and throw out any with shells that gape open after you’ve tapped them against your countertop (those ones are dead).The broth-sauce starts with olive oil, chopped pancetta, and garlic. Strictly speaking, The Feast is a fasting meal, so technically you shouldn’t eat meat on Christmas Eve. (I find that hilarious considering you can quite literally enjoy seven courses of seafood during a fast, but that’s one of the great things about Italian traditions.) To omit the pancetta, just add an extra tablespoon of olive oil to compensate for the missing fat. Then you add onion, fennel, white wine, bay leaf, some lemon zest, and ground fennel, which becomes the base for the clam steaming liquid. The clams go in with some more wine (use the bottle you’re planning to drink with dinner). Once you throw a lid on that pot, the clams will steam, and when they’re open, they’re done. As their shells unhinge, the clams release their liquor into the sauce, which you will then sop up with your fried bread.This may amount to just one dish, but I believe it’s special and flavorful enough to feast on. And if you eat at least seven clams, I think it ought to qualify.Get the recipe:Clam Toasts with PancettaExplore Bon AppétitCarla NewsletterClamToastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-20", "author": ["Condé Nast", "Carla Lalli Music"]}