{"id": "f0a47be6bcee5e1acd7d2dbe11c354d1", "url": "https://www.bonappetit.com/story/what-is-escarole", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "What Is Escarole, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Escarole, Anyway?You've heard the name before, but what do you really know about escarole? Do we trust that guy?By Alex DelanyApril 24, 2018FacebookTwitterEmailMichael Graydon & Nikole HerriottFacebookTwitterEmailYou can’t make Italian wedding soup without escarole. Well, you can. But it just doesn’t feel right. The pasta shape is flexible. (Or optional, in the case of some recipes.) The meatball makeup is flexible. The beans are flexible. The broth is flexible. But the greens? No, not flexible. It has to be escarole. Why? Because, wedding soup or otherwise, escarole is the best green for soups. Hands down. Full stop. End of story. Period.Wait, what is escarole though? It’s green and leafy, but is it like kale? Like spinach? Like lettuce? Well, it looks kind of like all of those things. Escarole is leafier than kale, and is usually sold in bunches that look a lot like a head of lettuce, with short, wide, wavy-edged leaves. The color and texture of the leaves varies—those on the outside are darker-green and a bit tougher, while the interior leaves are pale-yellow and more tender.Flavor-wise, escarole is part of the chicory family, which means it’s related to stuff like endive, radicchio, and other bitter greens. And yes, as the family name “bitter greens” suggests, escarole is a tad bitter. There’s a sharpness that comes with escarole's wide leaves, not quite as much as radicchio, but definitely more than a piece of romaine.At the grocery store, escarole can be easy to miss, since it’s a chicory that looks like lettuce. If your grocery store carries it, you usually won't find it in the bins with its cousins radicchio and endive; instead, it's normally tucked up near the heads of lettuce and bunches of kale and collards.Soup BAE.\nSo, what makes it so good for soups? Why would we choose it over spinach or kale? Well, it’s a texture thing. Kale is nice in soup, but it's so hearty that it can dominate everything else—you really have to slice it up into small pieces. And spinach—especially baby spinach—tends to lose too much texture as it simmers, and can sometimes go a little slimy. Escarole hits a happy medium: tender enough to cook quickly and maintain some integrity, with a flavor that neither overpowers nor gets lost. It also looks beautiful, turning semi-translucent as it cooks, giving your soup hues of green from dark to light.Escarole and cannellini beans. Italian AF.\nAlex LauAnd it’s not just a one trick pony. Escarole can be used in a variety of ways. It’s amazing with sausage and beans in pasta. It works well sautéed simply with olive oil or thrown into a pot of beans for added color and a little bite.You might be thinking, well, with all this success and greatness, escarole must be kind of arrogant. What is escarole going to bring to the table with that attitude? All the praise surely goes to its head. Nope. Escarole is great. Humble. Polite. Gracious. All qualities that help build a lasting marriage. Or at least a matrimonial soup.\"Wedding Soup\" always sounds like such a commitment—this one is not:Low-Commitment Wedding SoupThis recipe takes all the right shortcuts and none of the wrong ones.View RecipeExplore Bon AppétitBasicallyEscaroleGreenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-24", "author": ["Condé Nast", "Alex Delany"]}