{"id": "f0a6b90284225d470c204e8fd9bf1c07", "url": "https://www.bonappetit.com/story/detroit-secret-bakery", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "The Secret Bakery in Detroit That I Definitely Didn’t Visit | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Secret Bakery in Detroit That I Definitely Didn’t VisitMaaaaybe senior staff writer Alex Beggs ate pull-apart bread stuffed with sauerkraut there. And had incredible wings on her visit to Michigan too...By Alex BeggsNovember 3, 2018FacebookTwitterEmailPhoto by Michelle & Chris GerardFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Letter from DetroitWhere can I get some good bread around here? I asked Sister Pie’s Lisa Ludwinski while I was in Detroit visiting family last week. Well, there’s this guy, Maxwell Leonard, she told me, who doesn’t sell bread from a secret bakery in his house in Hamtramck. She ran into Max at a bar once and bought some bread off of him. This is the kind of guy who might have some spare loaves in his trunk. Which is how I found myself walking up the steps to Max’s house, where a black cat was snoozing on a chair on the porch, and a sign made from butcher paper hung on the door: “This is NOT a bakery.”Want this letter before it hits the website? Sign up for our newsletter!It turns out Max, who is Elmore Leonard’s grandson (!!!), is an obsessive. Brimming with nerdy passion. Definitely complying with the state’s Cottage Law, which allows you sell non-hazardous food from your home (sorry, razor-spiked-candy confectioners, not you!). The kitchen was covered in flour. Max was covered in flour. A huge basket held seven loaves of the weekly bread: honey wheat. I bought one of those, two fresh English muffins, and a twisted pull-apart bread stuffed with his homemade sauerkraut. It was all fantastic. (Soon Max will be making the bread at Ochre Bakery, a new spot from the wonderfully caffeinated people who brought us Astro Coffee.)Photo by Alex BeggsElsewhere in Detroit, I got my fix of Jet’s square pizza, where I learned you can order an entire squeeze bottle of ranch dressing for $3 instead of getting three sides (HOW ECONOMICAL!). I had pho from Que Huong three times. We feasted on caramel wings at Flowers of Vietnam, which was everything I’d hoped it was after reading dream hampton’s piece on it; and offal yakitori at Marrow, a new butcher shop-slash-restaurant with a killer wine list from owner Ping Ho. We stopped by Adachi sushi in Birmingham where we introduced my outlaws to fatty tuna, a revelation; we ordered big bowls of split pea soup at Russell Street Deli, where I nabbed a “FAMOUS FOR SOUP” shirt for soup’s biggest fan, Christina Chaey. At Eastern Market, I picked up a mini sweet potato pie from sweet potatoes’ biggest fans, Sweet Potato Sensations. A light and barely sweet Algerian pastry dipped in honey and sesame seeds from Warda Patisserie. Bright pink raw kibbeh at Al-Ameer. And how could I forget! We had even more secret food at Kung Food Market Studio, where chef Jon Kung made us pork and chive dumplings in milky white bone broth, rich in calcium from a pig’s head that completely disintegrates after 48 hours. Delicious. (Order all kinds of goodies by Wednesday, waltz into his studio on Saturday, doggo not for sale.)Wow, that was a lot.For EVEN MORE, read our Detroit city guide here!Halloween costume of the weekLook at this amazing Halloween costume of BA’s own Brad Leone and Claire Saffitz!!! Gahh!!! They even made Oreos!?! Big claps for Angela and Tim!Boom shakalakaIt all happened so fast. A BOOM, the sound of glass shattering, a small yelp, several gasps. “What was that?!” “Is everyone okay?” “...Amiel?” A glass bottle of what we thought was a chef’s homemade soda turned out to be something fermented and it spontaneously exploded all over Amiel Stanek’s desk and office carpet. Amanda Shapiro was on a Professional Sounding Phone Call and we heard her tell the person on the other line, “Something just exploded so everyone’s freaking out.” Thankfully, no one was harmed—unlike the time shards of glass split Alex Delany’s lip when someone sabered a bottle of Champagne (long story)—so we carried on with our day.Overheard in the office“Grunts, slumps, and a whole lot of dump cakes.”Unnecessary food feud of the week“Basically, it boils down to this: I’m right and he’s wrong.” That’s Adam Rapoport, defending his vision for a “weeknight” bolognese sauce, which was supposed to be a recipe collaboration with Andy Baraghani before a deep rift threatened to tear them apart. “Adam keeps saying ‘weeknight’ bolognese, which isn't a thing,” Carla Lalli Music told me, “And Adam wants to purée the pancetta. Andy is not going to do that.” Adam already has this broccoli bolognese recipe someone let him get away with—isn’t that enough? This guy is trying to fool TIME and time isn’t having it. “We actually see eye-to-eye on most of the recipe,” said Andy, “This is an ongoing dialogue. We’ll figure it out.” What a diplomat. Recipe...coming eventually!Explore Bon AppétitBeggs NewsletterRead MorerestaurantsFlowers of Vietnam Is As Detroit As It GetsBy Dream HamptoncookingWhy Sister Pie’s Peanut Butter Cookies Are Better Than the Normie OnesBy Alex BeggsWhere to eatWhere You Should Be Eating in Detroit Right NowGallery13 SlidesBy Ben HallRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-03", "author": ["Condé Nast", "Alex Beggs"]}