{"id": "f0ad6f4a838ade252f99f9ea36aae3a4", "url": "https://www.bonappetit.com/story/what-to-eat-when-you-feel-moody", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "These Hormone Balancing Foods Will Save You When You Feel Moody AF | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat to Eat When You Feel Moody AFBecause food makes (almost) everything better.By Martine ThompsonMarch 20, 2018FacebookTwitterEmailPhoto by Peden + MunkFacebookTwitterEmailSometimes the perfect cure for a hard-hitting bad mood is something delicious. After all, our bodies and emotions are inextricably linked. “When we’re sad, we crave foods that evoke comfort and nostalgia,” says Kacie Carter, holistic nutritionist, chef, and co-owner of Echo Park-hotspot Honey Hi. “Often these are junk foods that only increase inflammation, which exacerbates those sad feelings.” Which is to say we should be extra thoughtful about what we consume when we’re having a rough day. That umpteenth order of takeout this week or box of M&Ms may give your dopamine levels a bump when you’re feeling low, but the reprieve, no matter how tasty, tends to be short-lived. So the next time you’re feeling moody AF and find yourself reaching for a snack, give one of these expert-approved hormone-balancing foods a try.When you’re sad:Instead of reaching for candy and other carb-heavy options that’ll make your blood sugar spike followed by a crash, give yourself something sweet and full of natural fiber like dark berries, suggests Pasadena-based holistic health coach Samantha Walker. Nuts, meals with leafy vegetables (kale, spinach), and whole grains (quinoa) can also help boost serotonin levels in the brain and rein in fluctuating moods as it takes the body longer to digest.When it’s that time of the month:During the week of your cycle, incorporating hormone-balancing foods that are high in magnesium, such as raw cacao, avocados, or almonds can help ease cramping and bloating says Lindsey Smith, health coach and author of Eat Your Feelings: The Food Mood Girl’s Guide to Transforming Your Emotional Eating. If you feel up to preparing a proper meal in between binge-watching shows and cursing the agony that is owning a uterus for those 3-6 days, Walker suggests a simple baked salmon fillet, zucchini sautéed in coconut oil with spinach, and a goat cheese salad drizzled with extra virgin olive oil. “The healthy fats from the salmon, coconut oil, and olive oil help to keep the body satiated as it works to break down the healthy fats. The spinach provides a large variety of vitamins, including magnesium which [people who get their period] can run low on during their menstrual cycle.”When you’re anxious or stressed:A warm decaf green tea with a squeeze of lemon and honey, paired with a handful of deep breaths into the belly, will help ease our body or mind when we are feeling anxious says Walker. Since our body releases “fight or flight hormones” (adrenaline, cortisol and/or norepinephrine) when feeling anxious, it’s best to avoid too much caffeine, as it may unintentionally heighten the unpleasant effects of those hormones. If you’re feeling stressed, adding GABA-boosting foods, such as walnuts, broccoli, or even a glass of oolong tea can go a long way, says Smith. “GABA [short for gamma-aminobutyric acid, a neurotransmitter that provides a natural calming effect on the body and mind] is responsible for helping your brain shut down activity, which can help give your stressful brain the proper rest it needs.”When you’re angry:A falling out with a good friend, a stressful work incident, or a romantic partner driving you nuts are all scenarios we’ve likely attempted to eat through (read: inhale copious amounts of unhealthy food, snacks, and desserts to feel less ughhh). As Smith puts it, when you want something in the immediate, eating quick and easy snacks that’ll give your body the nutrients it needs to start calming down are a good way to go. Try almonds, bananas, an apple with peanut butter, or even an egg.When you’re underslept, or depression fatigue is hitting hard:Seek foods with a high level of choline (a macronutrient linked to brain development, nerve function, and energy levels), such as pasture-raised egg yolks, salmon, grass-fed animals, liver, chickpeas, and sunflower lecithin suggests Carter. “Most importantly, incorporate these foods into a meal that brings you joy and lifts your spirit. How and who you eat with is just as important as what you eat when you’re feeling bummed out.”Boost your mood with salmon, walnuts, and whole grainsRoasted Salmon with Celery and Bulgur SaladFor this roasted salmon recipe, finely chopping the walnuts, preserved lemon, and golden raisins gets them into every mouthful.View RecipeExplore Bon AppétitHealthyishRead MorecookingOn Breaking Food Rules and Learning to Cook the Food You LoveBy Alison CarrollRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Martine Thompson"]}