{"id": "f0b419c017867440247400565ab12f2a", "url": "https://www.bonappetit.com/recipe/these-spicy-beef-lettuce-cups-are-a-hit-any-night-of-the-week", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "These Spicy Beef Lettuce Cups Are a Hit Any Night of the Week Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesThese Spicy Beef Lettuce Cups Are a Hit Any Night of the Week1 RatingFacebookPinterestTwitterEmail4 servingsSpicy beef meets the crunch of cucumber, creamy avocado, and the tang of a Cholula® Green Pepper mayo. It’s bursting with flavor and a match made in lettuce cup heaven.PrintIngredients1 bunch scallions1 head Bibb or butter lettuce2 Persian cucumbers1 large ripe avocado1 lime2 tablespoons olive oil1 pound ground beef1 teaspoon kosher salt, plus more4 tablespoons Cholula® Green Pepper Hot Sauce, divided, plus more for serving1/2 cup mayonnaiseRecipe PreparationTrim scallions on both ends and thinly slice crosswise. Set aside about 3 Tbsp. sliced scallions for serving.Separate Bibb lettuce leaves. If necessary, rinse leaves to remove dirt and pat dry with paper towels. Chill leaves until ready to use.Thinly slice cucumbers crosswise on a diagonal. Chill until ready to use.Halve avocado and remove pit. Use a spoon to scoop flesh from skin, discard skin, and cut avocado into ¼”-thick slices.Cut lime in half crosswise and cut one of the halves into wedges (reserve for serving). Squeeze second half of the lime over avocado; set aside.Heat olive oil in a medium skillet, preferably cast iron, over medium-high. Add remaining sliced scallions and cook, stirring occasionally with wooden spoon, until tender and golden, about 4 minutes.Add beef and break up into small pieces with wooden spoon. Let cook, undisturbed, until first side is browned, about 5 minutes.While meat is cooking, stir ½ cup mayonnaise and 3 Tbsp. Cholula Green Pepper Sauce in a small bowl and season lightly with salt; stir to combine then set aside. [NOTE: This amount of Cholula Green Pepper in the mayonnaise will give the mayonnaise a greenish tint.]Season meat with 1 tsp. kosher salt and stir, breaking up even more with wooden spoon into small bits. Continue to cook, stirring occasionally, until meat is cooked all the way through, about 4 minutes longer.Remove from heat and stir in 1 Tbsp. Cholula. Let cool slightly.Build your lettuce cups: Dollop a bit of the spicy mayo into the center of each leaf, then place a slice of avocado and several slices of cucumber over top. Spoon several tablespoons beef mixture into each leaf.Sprinkle lettuce cups with reserved scallions and squeeze reserved lime wedges over top. Sprinkle lightly with more salt and top with several more shakes of Cholula Green Pepper.Recipe by Cholula® Hot SauceRelated VideoThese Spicy Beef Lettuce Cups Are a Hit Any Night of the WeekReviews SectionReviewsWrite a review…Delicious! The sauce could easily be used for tots or fries also.Oregon02/06/21GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredBasicallyMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2021-06-02", "author": ["Cholula", "Hot Sauce"]}