{"id": "f0ce0aec5b4dc8be33dbb68cf4fef11d", "url": "https://www.bonappetit.com/story/healthyish-dinner-party-winter", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "How to Throw a Healthyish Dinner Party When It's Cold Outside | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Throw a Healthyish Dinner Party When It's Cold OutsideWe asked the women who throw the best parties, chef Camille Becerra and stylist Kate Young.By Mackenzie WagonerJanuary 11, 2018FacebookTwitterEmailMichael Graydon + Nikole HerriotFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.Hosting a truly great dinner party is an art form, the work of many moving parts that look deceptively simple when your guests are finally in the room. For cold-weather fêtes, all the universal rules of entertaining still apply (prepare as much as you can in advance, always have a well-stocked bar), but there are a few seasonal twists that evoke not just hygge but lykke—nay, ikigai. We asked De Maria chef Camille Becerra and celebrity stylist Kate Young, two women beloved for their entertaining prowess, how to get people to leave the comfort of their homes in the dead of winter and come to their places instead. Here are Becerra and Young’s eight rules to entertain by:Get the number rightWhen it comes to the number of people at your table, Young and Becerra have both found that eight is the sweet spot—large enough to pair off in small groups, small enough to have a single conversation. Becerra finds that her intermittent absences in the kitchen aren’t a problem when there are enough other people around the table. She’s especially fond of inviting people who don’t already know each other. “They spend time meeting each other,” reasons Becerra. Young and her husband, Keith Abrahamsson, trim the list to six friends when they know they’ll be kids in toe. “That’s my favorite way to do it,” says the mother of two. “The kids can play and the adults can also have a good time.”Cook food that's close to your heartReward your guests for braving the cold with comforting meals that they might not cook for themselves. When entertaining around the holidays, Becerra drew from her own family background. “Lately I’ve been doing a full menu of Puerto Rican food or of Cuban food,” she says. Pastelón, the fried sweet plantain and meat dish, is a crowd-pleaser, much like it’s Italian cousin, lasagna. And, in place of eggnog, she serves Coquito, a traditional cocktail of coconut milk, rum, and cinnamon in a bold glass pitcher from Hay. For Young, dipping temperatures call for the hearty ease of slow-cooked meat, like Momofuku’s Bo Ssam, which Young says is a party favorite because the lion’s share of the work is done well before her guests arrive. Lots of sides like kimchi and rice wraps ensures vegetarians and vegans will be spoken for. Just remember to get any dietary restrictions and allergies from your guests before deciding on the menu.Dora Good Ceramics add a layer of texture to any room.\nPhoto courtesy of Dora Ceramics.Forget the holly-printed fine chinaThe days of fine china are long gone, but that doesn’t mean presentation should lack panache. Becerra stocks up on Beau Rush ceramics for de Maria and, when traveling, Dora Alzamora Good ceramics in Mallorca and stoneware from Paris’s Merci La Table Nouvelle collection. “There are some rectangular pieces that are great for platters,” she suggests. For bowls with real presence, Super Good Thing Platform bowls are impossible to beat. “I think that brand is so awesome,” Becerra says.Bust cold-weather stress with laid-back service“I like things to be more relaxed. I just slap down plates and forks and knives,” She opts for handmade ceramics—but until she creates a full set of her own hand-hewn bowls, cups, and plates, “I have a collection of Russel Wright vintage serving plates.” For the “Swedish country house” aesthetic of her upstate retreat, she collects a mix of modernist mid-century pieces like her vintage Georg Jensen flatware and Friso Kramer table, and rustic details like black and white handwoven napkins and a mix of table runners from Heather Taylor Home. She sometimes creates tablescapes with “classic wintery stuff”—eucalyptus wreaths, evergreens, amaryllis, and paper whites.Keep it brightTo rev up the hygge, bring in decor that speaks to the time of year. “Always candles everywhere,” says Becerra, who nixes scented candles in favor of wax that won’t compete with the dinner smells. Young goes with these beeswax taper candles from Etsy, which she displays on an assortment of pewter candlesticks sourced from flea markets. Becerra might also project a film (on mute) on her tall white walls. During the winter months, she loves to screen eighties Christmas comedies, “especially with Tom Hanks,” she says.But don't go lightWinter is not the time for paring back on menus. Start off with something comforting for guests to sip or nibble on as soon as they come in the door. Young and Becerra both rely on charcuteries to stave off hanger. Hay’s cutting boards make an easy and visually pleasing display, suggests Becerra. And once the show gets rolling, “just make a menu that has multiple courses and keep bringing food out,” says the chef, who is known to regularly entertain for upwards of four hours with courses that casually blend into subsequent courses. “It always happens very organically,” she claims.Nail the playlistA good playlist transcends seasonality. Becerra likes to play whatever suits her mood at the moment. “Wherever your energy is dictates the rest of the meal,” she says. Whatever she’s feeling while she cooks is what’s playing when her guests come in. This could include anything from Buena Vista Social Club to throwback hip hop like RS-One, Whodini, and Digable Planets. Young defers to her husband, co-owner of record label Mexican Summer, on the playlist. “I really like when he plays Ariel Pink and Connan Mockasin—I think it puts everyone in a good mood.”The number one rule for merriment is:“Bad dinner parties happen,” says Young who admits to occasionally sneaking off to bed early, even while her guests are still present. But no matter how your evening unfolds, Becerra advises, “Never apologize. Julia Child says not to. People are just happy to be with you and have an experience.”Explore Bon AppétitHealthyishFeel Good Food PlanDinnerPartyPartiesEntertaining + StyleEntertainingRead Morecooking7 Products Getting Us Through the Coldest Winter DaysGallery7 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-11", "author": ["Condé Nast", "Mackenzie Wagoner"]}