{"id": "f0d266ce59d90f6f4e06ae842d30f57e", "url": "https://www.bonappetit.com/recipe/crunchy-pickle-salad", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Crunchy Pickle Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueCrunchy Pickle SaladBy Andy BaraghaniFebruary 11, 20204.8(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintA crunchy, squeaky pickle salad that would be amazing alongside a super fatty main dish, like this giant pork roast. But don’t worry, it’s not one briny mouthful, there are a lot of different textures going on between the crisp onions, juicy pickles, and crunchy nuts. We tend to favor pickles that are bright with acid and low on sugar; anything labeled “half-sour” usually fits the bill. If using sweeter pickles, add a bit more vinegar and salt. And honestly, you can use whatever pickles you want in this (radishes! Green beans!). Ingredients4 servings½cup walnuts4whole pickles (half- or full-sour), halved lengthwise, sliced crosswise into 1\" pieces, plus 3 Tbsp. picklebrine3Tbsp. red wine vinegar2tsp. Dijon mustard1tsp. honey¼tsp. crushed red pepper flakes½small white onion, thinly sliced, rinsedKosher salt, freshly ground pepper1medium fennel bulb, tough outer layers removed, thinly sliced crosswise½cup chopped dill2oz. Parmesan, shavedExtra-virgin olive oil (for drizzling)Toasted country-style bread (for serving; optional)PreparationStep 1Preheat oven to 350°. Toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool; coarsely chop.Step 2Meanwhile, whisk pickle brine, vinegar, mustard, honey, and red pepper flakes in a large bowl. Add onion and season with salt and pepper. Let sit to allow onion to soften slightly, at least 5 minutes and up to 15 minutes.Step 3Add walnuts, pickles, fennel, dill, and Parmesan to dressing and toss to coat. Transfer salad to a large shallow bowl or platter and drizzle with oil. Serve with toast to sop up the dressing if desired.How would you rate Crunchy Pickle Salad?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleWow this really does work.. Very glad that I read the reviews to this unusual recipe.  We served it with a smoked pork belly, and the acid in the salad really went well with the fattiness of the pork belly.  LynnChristchurch, New Zealand10/23/2021So.. when I read the recipe, it seems like someone who was drunk and hadn’t been to the store in a while was hungry. However, my daughter and I love sour pickles so we made it. SOOOO GOOD!  I ate almost the whole bowl myself, but it was screaming for a brat and a beer to go with it. I added raisins(don’t judge), because my brain was filling in the sweet with the sour. It was awesome!  I also did feta instead of Parmesan because I’m not doing cows milk. I will make this again soon!  StuartLos Angeles, CA6/26/2021What a lovely salad.  It would be awesome for cookout with hamburgers or hotdogs or as a side for some fresh white fish.  Good with any fatty dish.   I made it the first day - EXACTLY AS WRITTEN (although I did forget the olive oil for drizzling.  We weren't in love.  I let it sit in the refrigerator for a couple of days.  It seemed like it kind of fermented a little into a briny deliciousness.  Next time- I will make it 24 hrs. in advance- I would put a little olive oil & garlic on the bread before toasting, and I would only toast lightly so the bread was slightly soft for better sopping.  You will want every drop of the dressing!  Pickle salad - who would have thought it?Wesley Chapel, FLORIDA5/4/2020This is really good! The flavours and textures work together so well. I used ~1/3 of a yellow onion since I didn't have any white onions on hand.AnonymousNew York4/29/2020The unexpected flavor combination in this salad is wonderful! I had to follow the proposed adaption for a sweeter pickle, and didn't have dill, so I substituted fennel fronds and parsley. Would go wonderfully as a side dish for a crispy chicken sandwich! AnonymousSeattle, WA4/11/2020This salad was a great surprise! It might sound unusual to pair fennel, pickle and Parmesan (I actually used grana padano), but the three work wonderfully together. This original salad definitely has a WOW factor.\nLetting the fennel marinate in the dressing really allow its sharp flavor to mellow.\nI feel like it lacks a little taste of citrus. I will try thinly sliced blood oranges next time!baptistePARIS, France3/5/2020Surprisingly delicious. TdMac1Camp Hill, PA3/1/2020This salad is absolutely amazing! This is now in heavy rotation. Yum!AnonymousDetroit 2/27/2020Explore Bon AppétitSaladWalnutNutFennelVegetableDillHerbs & SpicesParmesanCheeseQuickEasySideGluten-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Andy Baraghani"]}