{"id": "f0d45a942362843590af4d98d350a18b", "url": "https://www.bonappetit.com/story/adrian-miller-black-smoke", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "It's Time to Give Black Barbecue Culture the Attention It Deserves | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s Time to Give Black Barbecue Culture the Attention It DeservesFor too long, mainstream food media has effectively told African American barbecuers: “We’re just not that into you.”By Adrian MillerMay 10, 2021FacebookTwitterEmailPaul Miller/Miller PhotographicsFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Why do I care about the ups and downs of Black barbecue? It’s deeper than love. It’s because I’ve been radicalized by something that I watched on television. Actually, it’s more about what I didn’t see.In May 2004, I was intrigued by a Food Network promotional commercial for a one-hour special titled Paula’s Southern BBQ. At the time, I knew much more about barbecue than I did about the host, Paula Deen, and I hoped that Deen would be presenting more of an overview of southern barbecue culture rather than simply a cooking lesson or a cooking competition. I tuned in for the show. By the time the credits rolled, though, my mouth was hanging open—not from an appetite for barbecue but because I was stunned that not one single African American had been interviewed on camera. I saw shots of Black people in the background doing the actual work, but they were anonymous and voiceless. Today it may seem naive, but I recall thinking, as I turned off the television, “Is this what Black barbecuers have become? They’re just B-roll footage now?” Maybe I had misread the ads for the show—perhaps it had been promoted as Paula’s Scandinavian Barbecue, sponsored by Alabama White Sauce?It’s easy to beat up on Deen, given the racism and improper appropriation allegations that surfaced against her five years later (and admittedly, I haven’t rewatched the show since, so I’m relying on shocked memories alone), but I think the show’s production team shares the blame. They are the ones who scout the locations to film, decide who is going to be on camera, and write the scripts. If she’d had it in her, Deen could have leveraged her star power to create a more inclusive show, but this certainly wasn’t a solo act. Apparently, no one had the vision.That episode struck me hard. It showed me that amid all this barbecue abundance, something was missing. What was missing was public acknowledgment of, and appreciation for, African American barbecuers and what they’ve contributed to this hallowed culinary tradition. Imagine that you’re barbecuing meat directly over a slow fire. A nice equilibrium exists as the meat slowly cooks while fat periodically drips down to fuel the fire and provide flavor. Then, after several hours of cooking, someone decides to move the fire gradually to the side of the grill, completely away from the meat, and continues to barbecue indirectly. Black barbecuers have similarly been pushed from the center to barbecue’s margins.Gradually, softly, and tenderly, some very influential food media platforms have fallen deeply in love with four types of White Guys Who Barbecue. They are: the Urban Hipster, who sports interesting tattoos, facial hair, and stylish eyeglasses; the Rural Bubba, who is an overalls-and-ball-cap-wearing kind of guy that one might see on the television shows Duck Dynasty or The Dukes of Hazzard (1970s version); the fine dining chefs who have entered the barbecue game; and some guys who are a combination of the above.The media coverage of these white guys is so intense, comprehensive, and constant that one could easily wonder whether Black people barbecue at all. Before Rodney Scott won a 2018 James Beard Award for Best Chef Southeast, the most high-profile African American barbecuer was arguably the fictional Freddy Hayes, who regularly served ribs to the diabolical president Frank Underwood on Netflix’s smash hit political satire House of Cards. The entire situation is annoying enough to make a nice guy like me develop a “resting barbecue face.”This is all so weird, too, because before the 1990s, food media regularly and overwhelmingly acknowledged Black barbecuers—so much so that, to this day, many people believe that African Americans invented barbecue. Moreover, a general consensus emerged in the late nineteenth century that African American barbecuers made the best and most authentic barbecue. Even racist whites failed to pass up barbecue made by an African American. During the reign of Black barbecuers, barbecue was largely represented in media as hearty, messy, working-class food that was the delicious result of extensive, exhaustive, and specialized menial labor. And though what these Black barbecuers did often absolutely fit the definition of culinary craft, it was rarely presented that way to the larger public.Think about the current conventional wisdom about what barbecue is. Your mental checklist probably includes poor or tough cuts of meat that must be cooked at a low temperature for a long time (“low and slow,” in current parlance), served unsauced—and with an appearance that’s social media friendly. Such thinking gained steam in the 1990s, and it has consequently, and unfairly, redefined barbecue away from long-standing African American barbecue traditions. So many are heavily invested in drawing partisan lines about what true barbecue is, yet they’re unwilling to see how arbitrarily those lines are drawn. Defining barbecue, locally and globally, is highly dependent on time, place, class, race, and a fair amount of mythmaking.Right now, there’s more at stake with barbecue than ever before. Barbecue’s profile is much higher in terms of scope, cultural value, and potential profitability. Barbecue is now viewed as an urbanized, craft cuisine manufactured by so-called pitmasters with their own tribe of foodie followers. A barbecuer savvy in public relations and social media—or any personality with just enough barbecue expertise to exude authority—can now make a lot of money by selling high-priced barbecue, hosting special events, and hawking a line of accessories, cookbooks, and instructional videos. Barbecue circuit competitors have won up to a hundred thousand dollars in just one weekend.Even barbecue writers may get in on this lucrative act. I was surprised to learn that the prolific cookbook author and TV host Steven Raichlen has his own line of barbecue gear. Does this mean it’s time for me to develop a line of very stretchable barbecue clothing with elastic in strategic places? Look for it soon on the fashion runways of Milan and Paris.As barbecue’s cultural terrain has shifted and streams of revenue have flowed, the mainstream food media’s lack of inclusive coverage has effectively told African American barbecuers: “We’re just not that into you.” That means Black barbecuers haven’t prospered as much as their white colleagues, even though they’ve made significant contributions to the culinary tradition.The contemporary barbecue scene is déjà vu for me. Since the early 2000s, African American chefs—some by choice, others by circumstance or from a lack of resources—have missed opportunities to cash in on food traditions that they either created or raised to an art form. Think fried chicken (especially the Nashville hot version), shrimp and grits, and whole-animal cooking. The same need not happen with barbecue. Let’s ensure that African Americans benefit in these barbecue boom times. Let’s change the current narrative. Let’s share African American barbecue culture’s glorious past, vibrant present, and expansive future. Not as a revival or some sort of fresh breath on the glowing embers of a dying culinary tradition, but to make barbecue storytelling more inclusive. To ignite a serious discussion. To celebrate creativity and resilience in a time of tremendous economic, political, social, and racial challenges. To show that Black barbecue traditions endure.This essay is adapted from Adrian Miller’s book, Black Smoke: African Americans and the United States of Barbecue, a Ferris & Ferris Book. Copyright © 2021 by Adrian Miller. Used by permission of the University of North Carolina Press.Black Smoke: African Americans and the United States of Barbecue$30 at Barnes and Noble$30 $17 at Amazon$30 at Adrian E. Miller Official SiteExplore Bon AppétitBooksPeopleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-10", "author": ["Condé Nast", "Adrian Miller"]}