{"id": "f0d85f262f30caa45eaf0ecd12d708a8", "url": "https://www.bonappetit.com/story/make-yogurt-at-home", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Learn to Make Yogurt at Home, There's Never Been a Better Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusThere's No Better Time to… Make Yogurt at HomeWhen you need to coddle and be coddled. By Caroline LangeApril 6, 2020FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. Today: Find comfort in a batch of homemade yogurt.I have been making yogurt at home for years: bringing milk almost to a boil, dipping my finger into the pot to take its temperature, dolloping in a few tablespoons of yogurt reserved from the last batch, bundling it in a blanket and putting it to bed, then hitting the hay myself. The next morning I approach it on tiptoe, cracking the lid a little and then a lot, watching for the telltale wobble of a well-set pot. I gasp every time. Just because I know how the magic happens doesn’t make it less magical. It is a particularly wonderful ritual in this strange, uncertain moment.Yogurt probably came to be as a way of making milk last longer, of extending its life. That’s one reason yogurt-making is a powerful tool: You can deploy it when the gallons of milk you bought start to seem overzealous, but you can also make it with any amount of milk that you’ve got. You can make it if the grocery store is low on yogurt, if you’ve run out of breakfast options, or if you’re feeling the urge to coddle or be coddled yourself. In other words, this is a very good time to make it.Making yogurt is something you do alone, but it’s not a lonely endeavor. Like meditation, it simply demands your slowness and attention. Get distracted and the milk will boil over; add the starter too soon or too late and the bacteria won’t have the ideal environment in which to multiply; rush it and you’ll scorch the milk at the bottom of the pot. Yogurt demands your tenderness: At the moment you add the starter to the milk, the milk should be the same temperature as a baby’s bath.And like sourdough, Amish friendship bread, and chain mail, yogurt is self-perpetuating: Add a little milk and a little heat and the few remaining tablespoons from your previous round and it will refashion itself ad infinitum, each new pot holding part of the soul of the first. If you strain the yogurt for a thicker version, it will give again, this time the tangy-cool liquid called whey that’s as good for drinking plain as it is for cooking rice or potatoes. There is something very hopeful and comforting about this easy, endless giving, this open-handed generosity, this constant anticipation of a future batch.Caroline Lange is a recipe tester and developer, private chef, and food stylist living in Brooklyn.Explore Bon AppétitThere's No Better Time CoronavirusBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-06", "author": ["Condé Nast", "Caroline Lange"]}