{"id": "f0d975133af876e94e75f5b38a7b43c5", "url": "https://www.bonappetit.com/recipe/roasted-fall-vegetables-with-herb-salad", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Roasted Fall Vegetables with Herb Salad Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginhealthyishRoasted Fall Vegetables with Herb SaladFacebookPinterestTwitterEmail8 - 10 servingsPrep Time: 15 minActive Time: 35 minA bountiful and colorful spread of everyone's favorite veggies roasted in flavorful Country Crock® Plant Butter with Olive Oil. PrintIngredients1 fennel bulb with fronds3 rainbow carrots2 cups brussels sprouts1 acorn squash1 Delicata squash6 garlic cloves5 Tbsp Country Crock® Plant Butter with Olive Oil1 shallotKosher salt & fresh pepper1/4 cup parsley1/4 cup mint1/4 cup cilantro2 limesRecipe PreparationRoast the vegetables:Preheat the oven to 425°F. Line two half-sheet pans with parchment paper. Trim the fennel bulb into 1\" wedges ( don't forget to reserve the fronds for later), and peel and cut the carrots into 1\" pieces. Then, cut the brussel sprouts into halves, remove the seeds and trim the acorn squash into 1\" wedges. Finally, remove the seeds from the Delicata squash slice it into 1/2 inch thick half-moons and peel and smash the garlic cloves but leave them whole.In a large bowl, toss the prepared vegetables with the softened Country Crock® Plant Butter and season generously with kosher salt and pepper. Arrange in an even layer on the prepared sheet pans.Place in oven and roast for 35-40 minutes, rotating pans halfway through, until tender and deeply golden brown. Allow to cool slightly and arrange on a serving platter.Make pickled shallot and herb salad:While the vegetables roast, slice the shallots very thinly and toss it with the lime juice and a pinch of salt. Let marinate for at least 10 minutes.Tear the parsley, mint, cilantro and reserved fennel fronds by hand, just before serving. Toss with the pickled shallot and all of the lime pickling liquid. Arrange the dressed herb salad on top of the plated roasted vegetables and serve.Recipe by Country Crock® Plant ButterReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredHealthyishMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Country Crock", "Plant Butter"]}