{"id": "f0e0287c071badd5cfabd896d17cc782", "url": "https://www.bonappetit.com/recipe/sesame-burger-buns", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Sesame Burger Buns Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSesame Burger BunsBy Bryan FordOctober 18, 20205.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintMake these sesame buns today, then question why it took you so long to make your own buns for burgers, egg sandwiches, fried chicken, and fillets o’ fish. This recipe from bread master Bryan Ford is based on his Master Dough recipe; simply portion it out, roll into tight balls, then dip in sesame seeds (or any small seeds and seasonings of your choice—poppy, flax, dried onion…). Ford bakes his buns in muffin rings, which gives them dramatic height—but free-form works just as well.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketChef's Knife$34.53 At AmazonBench Scraper$8 At AmazonSmall Bowl$13 At AmazonShallow Serving Bowl$26.99 At AmazonPastry Brush$9 At AmazonIngredientsMakes 8Bread flour (for surface)Master Dough1large egg¾cup sesame seedsPreparationStep 1To make this recipe, start by preparing one batch of the Master Bread Dough.Step 2Line two 18x13\" rimmed baking sheets with parchment paper. Lightly flour work surface with bread flour and turn Master Dough out onto surface. Using a chef’s knife or bench scraper, divide dough into eight pieces (about 90 g each). Working one at a time, pull edges of portioned dough up and over into center, then turn over, seam side down, onto a less-floured spot (you want the dough to have friction with the surface). Cup your hand around dough and, working your hand in a circular motion, draw dough across surface to create a ball.→ Need help shaping? This video from King Arthur Flour will show you how.Step 3Beat 1 large egg in a small bowl until no streaks remain. Pour ¾ cup sesame seeds into a small shallow bowl. Working one at a time, brush egg wash over surface of a dough ball with a pastry brush. Dip coated portion into seeds, rolling around to coat evenly. Place, coated side up, on prepared sheets (4 per sheet). Let rise in a warm, draft-free place until doubled in size, 1½–2 hours. (Dough should spring back slowly when gently poked.)Step 4Preheat oven to 450° and bake rolls until golden brown, 20–25 minutes.Step 5Do ahead: Rolls can be baked 3 days ahead. Store in a paper bag or a bread box at room temperature, or freeze up to 1 month. Thaw before using.How would you rate Sesame Burger Buns?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleDelicious taste, but a bit of a mess to cook! Take care to put these low in the oven - in the top 1/3rd of my oven, the eggwash burned and started smoking within a couple minutes. Once I moved them down, the rest of the surface area cooked to a beautiful golden brown in just 12 min!  Crusty on the outside, dense but soft on the inside. I'll cook shorter and lower next time, otherwise, these are great. FaithNashua NH 11/4/2020Explore Bon AppétitBreadAmericanBread FlourFlourYeastOther IngredientsSideVegetarianBakingDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-18", "author": ["Condé Nast", "Bryan Ford"]}