{"id": "f0ece9a16387ff5ed293c87390d62627", "url": "https://www.bonappetit.com/story/cab-franc", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "This Cab Franc Pairs Well with Party Subs and Basically Everything Else | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Cab Franc Pairs Well with Party Subs and Basically Everything ElseLes Vignes de Babass’ “Roc Cab” is the rare Cab Franc that's both interesting and well-balanced.By Marissa A. RossFebruary 27, 2020FacebookTwitterEmailIllustration by Katie BennFacebookTwitterEmailIn Unfiltered, Bon Appetit's wine editor Marissa Ross shares her latest favorite bottles and—you guessed it—unfiltered thoughts on natural wine.The wines I love the most are rarely the ones I have for dinner. Instead they’re ones like Les Vignes de Babass’ “Roc Cab” Cabernet Franc, which I drank on a bright Saturday afternoon over a long lunch with good friends and a party sub my husband made with homemade ‘nduja, mozzarella, arugula, and zucchini. The wine and the sandwich paired surprisingly well, and I didn’t have to think too hard about it: just good people, good wine, and good times. (Yes, I know that sounds like something that should be—and probably is—emblazoned in glitter on plastic goblets, but it’s true.)I love Cabernet Franc and have drank a lot of it.  No joke, I had a 30-minute one woman show called “From Franzia to Cab Franc” back when I was performing comedy. What I’ve found with many Cabernet Francs is that they’re either yawnable, with the textbook-taste of green bell pepper (thanks to aromatic compounds called pyrazines), or they are wild as hell. The latter type still have pyrazines, but they drink like off-roading through rocky cow manure with splashes of cheap red wine vinegar. What I’m saying is: It isn’t easy to find a Cab Franc that is both interesting and well-balanced.But Les Vignes de Babass’ “Roc Cab” is. With its flirting acidity that hits you on the tip of your tongue to its velvety vibrato finish, “Roc Cab” is Doris Day serenading with a big band. It begs you to sway with it, to lose yourself in its flavors of smashed, ripe blueberries and diced jalapeño while waltzing down a winding gravel drive sprinkled with white flower petals. It would kill with whatever you’re cooking for dinner, I’m sure. But while there are plenty of wines to pair with roast chicken, I can only think of one wine that can hold up to a 2 p.m. party sub...and this Cab Franc is it.Les Vignes de Babass’ “Roc Cab” Cabernet Franc is imported by Camille Rivieré and was purchased at Psychic Wines in Los Angeles for $36.Buy it: Les Vignes de Babass’ “Roc Cab” Cabernet Franc, $31.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishnatural wineUnfiltered Read MoreLifestyleYou're Not Going to Believe I'm Saying This, But Merlot Is BackBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-27", "author": ["Condé Nast", "Marissa A. Ross"]}