{"id": "f0f57b4218a4f34051667d05c116efb6", "url": "https://www.bonappetit.com/story/steak-salad-with-rice-noodles", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Steak Salad with Rice Noodles Is the Weeknight Dinner We Could Eat Forever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSteak Salad with Rice Noodles Is the Weeknight Dinner We Could Eat ForeverThis version of Hillstone's classic cuts back on sugar but checks every flavor box.By Chris MoroccoMarch 21, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Chris Morocco, Prop Styling by Emily EisenFacebookTwitterEmailThe Thai steak and noodle salad at Hillstone is a guilty pleasure. It seduced me with its towering decadence: a small mountain of noodles, grilled pieces of filet mignon, mango, avocado, and about 15 other things all teetering a foot over the dinner plate like a culinary K2. But, when I adapted their recipe to run in Bon Appétit, I realized just how much sugar went into nearly every component of this dish, and I felt guilty for liking it in the first place. Let’s just say it’s not an every-day salad. The thing is, I want to eat it every day. The mingled flavors of charred steak, bouncy noodles, crunchy vegetables, sweet-tart dressing, and a dose of salty funk from the fish sauce make me want to eat it FOREVER. So I reworked those flavors into a weeknight-friendly, less-sweet version, so I could do just that.You start by chopping and mashing a few serrano chiles (I like to leave the seeds in one of them for extra heat) with a garlic clove on a cutting board. I like breaking the chiles down to release all their flavor into the dressing. Stir that into lime juice, honey, and vegetable oil to make a sauce that works overtime by acting as a marinade for the steak and the base of the dressing. Just ten minutes is all it takes for the marinade to flavor the meat and get it to take on a bit of char as it cooks.Cooking the rice noodles is something you can do right before you need them or days before. Unlike wheat-based pasta, rice noodles manage to be delicious when eaten cold right out of the fridge days later. You can use any sliced crispy-tender veg you like, but my favorite is the cool crunch of Napa cabbage combined with cucumbers and daikon. It’s probably been five minutes since I last shilled for daikon so here we go again—it is the most underrated vegetable out there. Salting the veg and massaging it to the point that they release water you can drain off keeps them crunchy and prevents the dressing from sogging out later on.Okay, time to cook the steak. Because of the honey in the dressing, your steak will take on serious color quickly, and don’t be afraid to let it get dark since it is really the sugar that is carmelizing and developing a racy edge of flavor. It may look slightly burnt which is what you are going for to mimic the flavor and char that only a grill can achieve. Not into steak? It could just as easily be tofu, or any other protein.Bring it all together by thinly slicing the steak and combining it with the remaining dressing, noodles, veg, and a serious amount of chopped mint and peanuts. Spicy, sweet, tart, nutty and strewn with just enough meat to make you feel genuinely excited to find every slice. This salad hits all the right buttons—including the one labelled “every day.”It's steak salad time:Weeknight Steak and Rice Noodle SaladThis salad recipe hits all the flavors we crave in a weeknight dinner: a hit of spice from the chiles, heartiness from the beef, crispy crunch from fresh veg, and even a bit of sweetness from the honey. We highly endorse cooking off extra rice noodles to keep on hand for low-maintenance stir-fries and soups for later in the week.View RecipeExplore Bon AppétitHealthyishSaladThaiSteakRice NoodlesRead MorecookingA Tiny Steak and Smashed Beets Recipe for When You Want Just a Little Red MeatBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-21", "author": ["Condé Nast", "Chris Morocco"]}