{"id": "f0fab30a6e90dd344b940232d333324c", "url": "https://www.bonappetit.com/story/gossip-grill-san-diego", "year": 2021.0, "month": 11.0, "day": 5.0, "content": "Lesbian Bars Are Disappearing. Gossip Grill Paves a Way to Survive | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureGossip Grill Isn’t a Lesbian BarBut the venue is one of the last of its kind for queer women, according to its community members.By Emma Glassman-HughesNovember 30, 2021FacebookTwitterEmailPhotograph by Kimberly MotosFacebookTwitterEmailMoe Girton’s white-blonde faux-hawk floods cotton-candy pink under Gossip Grill’s disco balls and neon lights. She’s sporting loud paisley prints in all shades of blue—a party of one at 3 p.m. We sit at a high-top table on the perimeter of the dance floor, chatting about how she opened this bar 12 years ago; the doors are open to the patio and I can feel the velvet sun, ubiquitous over Hillcrest, warming my legs.We’re in San Diego’s historic gayborhood, as the locals call it, on a stretch of University Avenue that is home to at least six gay bars (boys bars, as Girton calls them). Gossip, the block’s sole dive intended for women, stands out among them. Girton settled in San Diego in 1999—a time when, she remembers, women weren’t welcome at boys bars. She says San Diego lesbians in those days were “spoiled” with three venues to choose from: Club Bombay (later renamed Six Degrees), The Flame, and another called Patti’s Bar. One by one, however, they closed down. Since Gossip opened in 2009, it’s been the only brick-and-mortar lesbian bar in all of Southern California, including Los Angeles.Photograph by Kimberly MotosThe phenomenon of the vanishing lesbian bar isn’t unique to California. Over the past several decades, the U.S. has been hemorrhaging queer female spaces. In the 1980s, over 200 lesbian-identified bars were scattered around the country. Today, only 21 are, according to the fundraising and advocacy initiative Lesbian Bar Project.But while lesbian bars are disappearing, that need for safe community spaces is not. Queer women remain vulnerable: In early August, a group including Gossip employees was assaulted at San Diego’s Mission Beach. The group was celebrating a birthday when two men, yelling anti-LGBT+ slurs, allegedly threw a beer can at one of their heads and even pulled out a gun.I’m not shocked by the story. I was raised 25 minutes up the freeway from Gossip, in a plain, suburban tract that I felt made Hillcrest and all its rainbow flags look like Mars. As a teenager, I had a vague sense that Hillcrest was the “gay” part of town, but nothing about the storefronts lined with rhinestone jockstraps and the rows of sweaty, pulsating nightclubs felt welcoming to me—a closeted soft femme bisexual kid with anxiety. Although Gossip Grill opened when I was in high school, I still didn’t know it existed by the time I moved away for college, nor did I understand its significance within the queer community I’d soon call my own.I’ve come across several explanations for the fragility of sapphic-friendly spaces, not just in California but throughout the U.S. For one, lesbian bars—as many queer bars—have a troubled relationship with racial inclusivity, in spite of their intended role as oases for the marginalized. Several of the first and most influential dyke bars in New York City discriminated against people of color, according to the Lesbian Bar Project. Bonnie and Clyde’s, one of the city’s first lesbian bars to be owned and operated by a woman, opened in 1971 when women weren’t eligible for business loans without a man’s signature. But in the 11 years that the bar was open, management implemented what artist and archivist Gwen Shockey described in a Lesbian Bar Project documentary as an “unspoken, race-based quota at the door,” by which only two or three women of color would be let in at any given time.At Gossip Grill, Girton says the collective reckoning around Black Lives Matter in the summer of 2020 forced her to acknowledge her own shortcomings as a white business owner and helped her imagine a path to greater inclusivity in her establishments. Her first step was to adapt her hiring practices. “As diverse as I thought we were, we had a lot of growing to do,” she says. The pandemic had resulted in massive gaps in her staff; when she was finally able to fill them earlier this year, Girton knew she wanted to be more intentional about diversity. At Gossip, she says 27 out of 50 staffers are people of color, including the head chef and lead host. At Barrel & Board, her new restaurant, she says it’s 14 of the 23, including one of the managers.Lesbian bars may be shuttering because they struggle to practice gender inclusivity too. The term lesbian can hardly encapsulate everyone living with a marginalized gender or sexual identity. Girton says part of the reason Gossip is the last remaining lesbian bar in Southern California is because, well, it isn’t.“We’re not a lesbian bar. We’re a women’s bar,” Girton emphasizes during our initial meeting. “Under that women’s umbrella is gay, straight, bi, trans, pan, you name it. It includes everything in there. Our focus is number one, women. Number two, LGBTQ+. We are open to everyone.”A few days later, Brittany Rae Leach, Gossip’s head of marketing, joins me at the bar during off hours. She has a big smile and auburn hair that’s been waved with precision. When she talks about Gossip, she crackles like a bonfire. She says the decision to identify as a women’s bar and not a lesbian bar is not only motivated by appearances or the bottom line. If anything, it’s personal. “Our choice to view ourselves as a women’s bar affects so many people very deeply rooted in our community,” Leach says. “It was really important to us to be inclusive and as far away from hypocritical as possible.”Gossip Grill is a community space for queer women. Dina Johnson, a sterile processing tech at a nearby hospital and a Gossip regular for the last 12 years, uses the bar as a home base for various fundraising efforts benefiting the local homeless community. When she learned that Gossip was struggling to keep its doors open in the pandemic, she started a GoFundMe to raise money for out-of-work staff members and to pay off the bar’s lingering utility bills. At first, Johnson only asked for $1,000. But donors exceeded that $1,000 mark in fewer than three days.“A lot of people didn’t just donate $10 or $15. They donated hundreds. That’s how much this place is loved,” she says. “If I were to need anything, I’m pretty sure [Moe] wouldn’t say no to me. Moe is always for it, whatever I’m doing.”Seated at the high-top at our first meeting, Girton regales me with tidbits of Gossip history. In 2011, during the county-wide blackout that left 1.4 million residents without power, the community flocked to the bar. Chris Shaw, founder of Gossip’s parent company, Mo’s Universe, had a generator installed on-site, prompting staff to throw an impromptu dance party that became an annual event. When the Pulse nightclub shooting in Orlando happened in 2016, the community grieved at Gossip. When Biden was elected president in November 2020, that same crowd partied here. “Whenever something happens and nobody knows what to do, they come here,” Girton says. “This is important. This is home.”Erica Rose, who created the Lesbian Bar Project with Elina Street, tells me over Zoom that the struggle for space has defined, and in turn confined, lesbian life across the country. “Queer women never occupied neighborhoods in the same way that gay men have,” Rose says. She notes that while gay male communities have managed to colonize entire neighborhoods, there are no lesbian equivalents. And the pandemic, which already burdened small-business owners, disproportionately impacted women.The lesbian businesses that are going to survive for decades to come will have to follow Gossip’s example and shape-shift into something beyond a bar. “We need to look for new ways that bars can serve the current generation’s needs,” she says. “They’re becoming community centers. They’re becoming restaurants, spaces for family, spaces with sober options, spaces for political organizing. Lesbian bars are more than just bars.”Girton and her team are reenvisioning divey, gritty, one-note lesbian spaces to offer variety to lesbians and queers seeking sanctuary from the horde of masc and normative nightlife options. Across the street from Gossip Grill, they opened the upscale sit-down restaurant Barrel & Board this past June to do just that.“We’ve grown up,” Leach says at our off-hours meeting. “And all of us who grew up with Gossip say, ‘I love Gossip, I’ll always support Gossip, but sometimes I just really want to get a babysitter—because yes, I have children now—and just go have a really nice glass of wine.’ Opening Barrel was always about listening to the community and giving them what they want.”Barrel & Board—along with SALAD to-go-go, a queer-friendly salad bar and another new property Girton opened just next door—was a pandemic purchase. Girton and her business partners bought the space for Barrel in February, when they feared Gossip wouldn’t make it through the month. The place came together quickly, acquired in working order from the Cohn Restaurant Group and in need of only light touches. Girton’s team rearranged the suspended tricycle sculpture in the bathroom, stacked whiskey barrels by the fireplace on the back patio, and added a few living trees to the interior speakeasy-type bar already outfitted with ornate chandeliers and melted wax candelabras. As for the fare, my boards (slabs of refinished tree trunks) come piled high with local pickled veggies, house-made hummuses and tzatzikis, gooey burratas, and little balsamic pearls, all meant to be shared around a table. The mojo grilled fish taco board, a specialty, features baby carrot escabèche and jalapeño slaw served on a bed of purple cabbage. The place is elegant and dapper—the perfect foil to the deliciously sloppy late-night scene across the street.Photography by Kimberly MotosLeach has a dreamy look in her eye as she describes the two properties. “Barrel is so pretty,” she says with a sigh. “And Gossip is the gay ‘Cheers.’” She swears that if a regular walks in during one of longtime bartender Freda Horton’s shifts at the latter spot, their drink will already be made by the time they take their seat at the bar.Horton’s eyes, adorned with a pair of falsies, glitter above a rainbow face mask. She nods. “It’s that sense of belonging that we all yearn for. [Coming into Gossip is] like being able to walk in at home and open the refrigerator. That’s what we offer here. That level of comfort.”As a teenager, San Diego never felt like home to me because I didn’t know of any place in all the county's great sprawl where I could be myself. I finally discovered Gossip this year, as an adult living back at home through the pandemic. When I learned that Girton had carved out the only lesbian haven within a 300-mile radius that had not only survived a pandemic, but also thrived for 12 years, I was bewildered. Gossip, and all the spaces spinning out of it, feel miraculous.In the weeks that follow my conversations, I go back to Barrel for dinner and Gossip for a few drinks on a busy Friday night. I am braless and barefaced, aside from blue eyeliner applied without finesse. I smile at Horton behind the bar. I brush up against some cute girls. And I feel decades of shame and apprehension start to melt off my back and flow down to the well-trampled concrete floor.Explore Bon AppétitLifestyleCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-30", "author": ["Condé Nast", "Emma Glassman-Hughes"]}