{"id": "f104660dd31f6924bd93e96fc0555136", "url": "https://www.bonappetit.com/story/heads-of-the-table-francesca-hong", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Francesca Hong's Career in Restaurants Taught Her What Local Government Really Needs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Career in Restaurants Taught Me What Local Government Really NeedsFreshman politician Francesca Hong shares how her understanding of service has evolved as she went from chef and restaurant owner to Wisconsin state assembly representative.By Francesca Hong September 14, 2021FacebookTwitterEmailChef and local politician Francesca Hong at her restaurant, Morris Ramen in Madison, WisconsinPhoto by Adam HesterFacebookTwitterEmailThis story is part of Heads of the Table, our celebration of 12 restaurants, people, and organizations that led the industry through the pandemic and beyond. Meet all the winners here.The human experience is a varied one. But this past year has been one of a shared struggle that has tied all of us together in grief, anxiety, and clarity. The pandemic brought to light many things for me, most revolving around the idea of service—what it has meant for me and what it means to my city, my state, and my country.As the co-chef and co-owner of Morris Ramen in Madison, Wisconsin, I realized as soon as the pandemic hit that the government had failed the restaurant industry. There were no economic safety nets to catch us or others when our doors closed. Many of my fellow industry folks couldn’t afford the rent anymore, federal support grants were an uncertainty, and making a profit was incredibly difficult under stay-at-home orders. We were left largely to fend for ourselves. Those of us who could get loans from family members took them. Some of us had to restructure our businesses to stay afloat, and so many relied on mutual aid to make it through.It became very apparent that our lives and livelihoods were of little concern to those with power. And I knew that something had to change. So I ran for office as a state representative for the 76th district of the Wisconsin State Assembly last year. And I won.Restaurant industry workers spend so much time serving others that we sometimes forget to ask for what is owed to us by policymakers. For years, state and federal governments have left us struggling to pick up the other end of their failed leadership. Stronger labor protections, universal health care, and tax relief would have strengthened small businesses in this time had they been implemented by empathetic policy makers. However, when the pandemic hit, it fell on the shoulders of those of us in the restaurant industry to bridge the gaps when it came to health care, transportation, and fair wages (or any wages at all) for our employees. Survival was in spite of the government, not because of it.When I was in the dish pit, filling in as a line cook, and working as a sous-chef, there was always a soapy helping hand pulling me up. Madison’s restaurant industry has taught me the value of being there for others, especially if you’re barely making it yourself. Through that comradeship, community is built, and with community, anything is possible. That resilience is what pushed me into politics.Now, nine months into my job as a state representative, it is clear more than ever that what is missing from the government is the kind of care I experienced in the kitchen. I’m a freshman legislator in the minority party (Democrat) in a state that is extremely gerrymandered, and I’ll be honest the government is broken, especially in Wisconsin. There is an aversion to the word welfare in government, when in fact we should be more invested in the welfare of our constituents, especially the working class. They have been shut out of policymaking, and now we are all paying the price of not having those impacted the most at the table. Lived experience makes for good, effective policy.My time working in restaurants now informs the legislation I’m working on. In March, I along with state senator Chris Larson unveiled legislation to eliminate tipped minimum wage, which is a paltry $2.33 per hour in Wisconsin, and proposed a fair $15 per hour living wage. It has been referred to the Committee on Labor and Integrated Employment, of which I’m a member, but the committee has yet to call a single meeting this session. So we continue to put pressure on the committee with help from grassroots organizations, organized labor, and progressive thinkers across the state. In June, together with state senator Melissa Agard and state representative Kristina Shelton, we introduced a bill for a pilot program that would allow counties in Wisconsin to apply for grant funding to help locals with down payments on homes. It’s still being circulated for cosponsorship. And then with my chief of staff Nada Elmikashfi, I’m working on fighting for climate justice through writing our own Wisconsin Green New Deal. We want to bridge the divides between urban and rural communities when it comes to environmental reform while ensuring a just transition for those in impacted industries.It’s important that in my new position I uphold the values I learned in restaurants. The policies we are fighting for in the office of the 76th to build economic agency and security will make the restaurant industry stronger because we are advocating for investment in people. Whether we serve in the public or private spaces, we must look past centering ourselves and instead focus on taking care of one another. This is what I love most about restaurants, even if the system has flaws. I know we can change it for the better through collective care and collective action.More Stories from Heads of the Table:Introducing Heads of the Table, the trailblazing, community-building, future-making leaders changing the restaurant industry for good.How Michael Carter’s time in prison shaped his perspective on the justice system and gave him purpose at Down North Pizza in Philadelphia.Why Farm Club in Traverse City, Michigan, is the least pretentious farm-to-table restaurant you'll ever visit.When COVID brought NYC restaurants to a halt, Send Chinatown Love helped Ruth Li’s restaurant survive.Restaurants are still struggling, but chef Edward Lee is optimistic about what’s to come.Explore Bon AppétitRestaurantsFirst PersonHeads of the TableFuture of RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Francesca Hong"]}