{"id": "f10f6729e49059e658a3dff6770001b6", "url": "https://www.bonappetit.com/story/peoples-wine-lobster-salad-pasta", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "This Lobster Pasta Salad Sounds Like a Nightmare But Tastes Like a Dream | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis Cold Lobster Pasta Salad Sounds Like a Nightmare But Tastes Like a DreamOnly chefs Jeremiah Stone and Fabián von Hauske could turn something called “lobster mac” into something spectacular, and it’s at Peoples Wine in New York City.By Elyse InamineMarch 6, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Restaurant menus can be a bit formulaic these days, with each dish described in a minimalist list of ingredients strung together with commas. Endive, pistachios, parm. Scallops, XO sauce, shiso. Kinda boring, right? So, I was delighted and maybe a little unnerved when I came across this freaky-sounding dish at Peoples Wine, the new wine bar/shop in New York City from Hot 10 alums Jeremiah Stone and Fábian von Hauske. “Lobster Mac: cold pasta salad with lobster.” What?! For a brief nightmarish moment, I imagined a Frankenstein of carbs, a gurgling casserole of lobster mac and cheese circa early 2000s and a slippery mound of mayo-lathered fusilli with mealy strands of lobster. Then I remembered this is Stone and von Hauske we’re talking about. I had to order it.I got one thing right: There was fusilli! The lobster mac arrived cold and in an elegant glass bowl, with billowy bonito flakes and thin strips of crispy nori waving me in. They provided the right textural contrast and sharp fishiness to balance all the velvety, creamy goodness of an umeboshi- and shichimi togarashi–powered mayo coating chubby chunks of tender, meaty lobster. I’d never thought of pasta salad as being a particularly balanced dish, but this one had it all: ocean-y umami flavor, a little hit of heat, a much needed sour note, and the right amount of mayo. I had to know how they did it.“So I was doing an event in the Hamptons with Questlove…” Stone began. Maybe Tom Cruise was there, maybe he wasn’t, don’t ask, but at that event, which was 80s-themed, he made two pasta salads: one inspired by a recent trip to Italy and the other inspired by takoyaki (doughy octopus balls topped with mayo, sweet takoyaki sauce, pickled ginger, and bonito flakes) and lobster mac and cheese. The latter one was a hit and Stone tucked the idea way until he started working on the menu for Peoples.The resulting transcendent creation is a combination of smart little tricks: Cooking the fusilli in MSG-forward hondashi (“a naughty dashi”) to imbue it with umami. Adding lobster coral, the salty, sweet roe, to the mayo for extra oomph. Dressing the noodles twice, first with the mayo, then with glug of olive oil and lemon juice to help loosen it up.Sure, my imagination ran wild with the initial idea of this dish, but Stone’s ran wilder. I think we can all agree that we’re better off with his vision, and not mine.Go there: Peoples WineExplore Bon AppétitHighly RecommendRestaurantsNew York CityRead MoreLifestyleThis Is My Favorite Salad in NYC, and Now I Can Make It at HomeBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-06", "author": ["Condé Nast", "Elyse Inamine"]}