{"id": "f113969501598d04328dcac10a881745", "url": "https://www.bonappetit.com/recipe/curry-vegetables", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Curry Vegetables Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueCurry VegetablesBy Rawlston Williams August 10, 20214.1(23)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintWhen I was growing up in St. Vincent and the Grenadines, our curry vegetables were cooked in coconut milk made from scratch. We’d grab sun-dried coconuts that had fallen from the trees, remove the husks, and crack the nut open. Then we’d grate the pulp with a hole-punched piece of metal, mixing with water, squeezing, and straining it to make coconut milk. These days, I rely on the canned stuff (Native Forest for aroma and consistency and Trader Joe’s for its concentrated coconut flavor) to make this Caribbean-style curry with a mix of vegetables: zucchini, carrots, cauliflower, eggplant, okra, mushrooms. It’s got a brilliant yellow hue from grated fresh turmeric (or ground turmeric in a pinch), an assertive curry flavor (look for Chief or Lalah's brands), and a little heat. But if the music is playing a bit too loud and you want to turn it down, that’s what coconut milk does. It balances out sharp, intense, or spicy flavors. —Rawlston WilliamsAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSmall Saucepan$155 At AmazonLarge Skillet$84 At AmazonOXO Good Grips® Smooth Edge Can Opener$22 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketMicroplane Grater$16 At AmazonIngredients4 Servings6Tbsp. virgin coconut oil, divided6cups 1\" pieces mixed vegetables (such as zucchini, carrots, cauliflower, eggplant, okra, and/or mushrooms)Kosher salt, freshly ground pepper12\" piece turmeric, peeled, finely grated, or ½ tsp. ground turmeric2Tbsp. curry powder (preferably Chief or Lalah’s)2tsp. ground coriander1medium onion, finely chopped2garlic cloves, thinly sliced12\" piece ginger, peeled, finely grated1habanero chile, Fresno chile, or jalapeño, finely chopped113.5-oz. can full-fat unsweetened coconut milk (preferably Native Forest)1½cups low-sodium vegetable broth1Tbsp. plus 1½ tsp. honey115-oz. can green pigeon peas or other canned or frozen green peas, rinsedSmall handful of chopped cilantroJuice of ½ lime (optional)Roti or steamed white rice (for serving)PreparationStep 1Preheat oven to 425°. Melt 3 Tbsp. coconut oil in a small saucepan over medium heat. Transfer oil to a large bowl, add vegetables, and toss to combine. Season with salt and pepper. Divide vegetables between 2 rimmed baking sheets and roast until almost tender and starting to brown in spots, 10–12 minutes. Set aside.Step 2Heat remaining 3 Tbsp. coconut oil in a large skillet over medium. Add turmeric, curry powder, and coriander and cook, stirring often, until fragrant, about 2 minutes. Add onion, garlic, and ginger, season with salt and pepper, and cook, stirring often, until onion is translucent and spice mixture starts to look dry and clumpy, 6–8 minutes.Step 3Add chile, coconut milk, and broth to skillet and bring curry to a simmer. Cook, stirring occasionally, until reduced by about one third (it should be almost thick enough to coat a spoon), 13–17 minutes. Stir in honey; taste curry and season with more salt and pepper if needed.Step 4Add pigeon peas and reserved roasted vegetables to skillet and return curry to a simmer. Cook until vegetables are fork-tender, about 4 minutes. Remove skillet from heat and stir in cilantro. Let sit 5 minutes, then stir in lime juice if using. Serve curry vegetables with roti alongside.How would you rate Curry Vegetables?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI will never go vegetarian in my life, and this is still truly one of the most delicious homemade curries I've ever made. TaylaAlexandria, VA10/7/2021One of my FAVORITE recipes I've made from BA lately. Didn't change anything, used carrots, zucchini and cauliflower. The perfect balance of savory and sweet sauce. Casey MSan Francisco, CA10/5/2021Good, flexible recipe for using up a lot of vegetablesAnonymousUSA9/23/2021Explore Bon AppétitCurryCaribbeanTurmericHerbs & SpicesCoconut MilkOther IngredientsZucchiniSquashVegetableCauliflowerCarrotEggplantOkraMushroomEasyWeeknight MealsMainDairy-FreeGluten-FreeVegetarianLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Rawlston Williams"]}