{"id": "f11ce1c1164ceb7e13faa24c0f0d3e74", "url": "https://www.bonappetit.com/story/why-youre-hungry-for-lunch-at-11-am", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Here’s Why You’re Always So Hungry for Lunch at 11 a.m. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHere’s Why You’re Always So Hungry for Lunch at 11 a.m.Let’s investigate this important matter. And then grab lunch after.By Michelle RuizMay 21, 2018FacebookTwitterEmail201404 desk lunch *** Local Caption ***Michael Graydon & Nikole HerriottFacebookTwitterEmailI am standing in Sweetgreen on New York’s Upper West Side, ordering my go-to, the Fish Taco bowl, from a smiling staffer in a “Beets Don’t Kale My Vibe” t-shirt. The usually-packed salad chainlet is eerily quiet—I imagine a tumbleweed made of bean sprouts rolling by—and there isn’t another customer in sight.This is probably because it’s 10:45 a.m.Some people might call this late breakfast, but around this time every day, my roaring stomach begins to demand lunch. It’s a struggle to make it to 12 p.m. before I’m fiending for a salad or a grilled chicken wrap, even though I never skip breakfast and generally get enough sleep (fatigue can spark hunger as a form of fuel). The prospect of 1 p.m. work lunches fills me with palpable dread, because I know I’ll be ravenous by the time we actually eat. “12:30?” I often counter with a smile emoji. At 36, I’m evidently ready for the geriatric dining schedule of the Boca Raton retirement set.“If I am ever invited to brunch with a call time after 11 a.m., it’s safe to assume I have already eaten and have mentally designated this as a lunch in brunch’s clothing,” a supportive friend confided.We call it lunch al desko. It’s a thing.\nPhoto by Alex Lau, Styling by Sue LiAs 5 p.m. is to cocktails, noon is to lunch: It’s widely considered the earliest socially acceptable time to grab a slice of pizza or a sushi special, especially in traditional office environments. “I’m regularly hungry at 11 but feel too ashamed to leave the office so early for lunch,” an editor friend told me. Those brave souls who do venture out before 12 return to their cubes at their own risk. The sight of a Chipotle burrito when the clock still reads a.m. might inspire curious glances at best or outright mockery at worst.It’s a daily struggle and, sometimes, a source of anxiety. Starving for lunch on many a morning, I’ve wondered if there was something wrong with my health (thankfully, blood tests at my annual physical confirmed there is not). On the contrary, according to registered dietician Brigitte Zeitlin, owner of BZ Nutrition in New York, it’s perfectly natural for some people to be hungry for lunch at 11 a.m., especially if they eat breakfast early, too.“The truth is your body is trained to feel hungry three to four hours after your last meal. So, if breakfast was at 7 a.m., it’s normal to be hungry at 11 a.m.,” Zeitlin said. “That’s your body’s way of saying, ‘Yo, I need some energy.’”It was just what I, and every other egotistical human being, longs to hear. You’re not weird; the rest of the world is. Or, in this case, early onset lunching isn’t the problem, but the tendency to suppress your body’s natural hunger cycle to accommodate workday norms. One friend who works in finance said she schedules an 11 a.m. call or meeting to distract her from her desire for “early” lunch. Another said he staves off hunger with a cup of coffee.It’s better, Zeitlin says, to listen to those pangs. If you’re hungry at 11 or 11:30 a.m., you have two choices. “Embrace the fact that your lunch is going to be earlier in the day. Eat at 11, and then have a mid-day snack at 2 or 3 p.m.,” she suggests. Or, “if everyone at your office gets lunch together at 12:30 p.m., and you want to be part of it, structure in a mid-morning snack at 10:00 a.m., so you’re not starving later.”If you’re eating breakfast later in the morning and are still starving for geriatric lunch, you may need to assess whether your breakfast is filling enough. And, no, a bowl of cereal and coffee won’t cut it. “Our bodies break down grains like cereal very quickly,” Zeitlin said. “You’ll get a burst of energy and feel great, but then you’ll crash.”To sustain you through lunchtime, breakfast needs to have a good source of protein and healthy fat, like eggs, plain yogurt, or nut butter, plus some fiber, like a piece of fruit, spinach in your omelet, or a little bit of avocado with your scrambled eggs. For a mid-day snack, pack something healthy yet ostensibly filling like a handful of almonds or walnuts, Greek yogurt, or, like I do for my 4-year-old daughter, part-skim string cheese.We have many, many ideas about healthy snacking.\nMichael Graydon & Nikole HerriottWhat if you’re already eating a robust breakfast and mid-morning snacking and are still yearning for lunch at 11?Consider that “you may not really be hungry at all,” Zeitlin says, “you’re just thirsty,” because our bodies interpret both hunger and thirst in the same way. “The first thing you need to do when you wake up in the morning is have a glass of water,” she said. No need to skip coffee—she’s not a barbarian—but hit the water first.Above all, it’s time to shift the narrative and usher in a brave, new world where it’s okay to eat lunch when some college students haven’t even woken up yet.“Embrace your hunger,” Zeitlin said. “We are meant to eat.”And consider the perks of eating before noon. “For the record, I have lunch at 11:30, and it’s fantastic,” she added. “There’s no line at Sweetgreen. I get in and out real quick.” My thoughts exactly.As a lone-wolf freelance writer, I’m feeling less and less shame about my premature lunching. Although I miss having live co-workers to chat with, I no longer have to consult anyone or conform to standard lunchtimes. At Zeitlin’s instruction to stay hydrated, I’ve been trying to bring a Klean Kanteen of water in my bag to cut down on a.m. hunger and reaching for that mid-afternoon snack, too, (because the 3 p.m. crash is real). But lunch still siren-calls me around 11:30 a.m., at the latest. Marking peace with eating lunch at the same time as my toddlers and, once upon a time, my grandparents, has been half the battle.A fellow freelance friend agrees. When he worked in an office, he was at war with himself, dying to eat lunch before noon, but waiting on co-workers to join him.“Now that I work from home,” he admits, “I sometimes eat lunch at 11:23.”Michelle Ruiz is a writer in New York, and a contributing editor at Vogue.com.1 / 55ChevronChevronGreens-and-Beans SandwichesView RecipeExplore Bon AppétitLunchScienceLunch al DeskoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-21", "author": ["Condé Nast", "Michelle Ruiz"]}