{"id": "f1241328ac9614d548598d726377216b", "url": "https://www.bonappetit.com/story/make-a-whole-galette-for-yourself", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Make a Whole Galette For Yourself Because You’re Worth It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingMake a Whole Galette For Yourself Because You’re Worth ItWho says the only joy of cooking is cooking for others?By Sarah JampelApril 13, 2020FacebookTwitterEmailPhoto by Emma Fishman, Plate by Meilen Ceramics FacebookTwitterEmailThis story is part of the Healthyish Guide to Being Alone, a series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.I should’ve known that Andy Baraghani—the guy who makes crispy chickpeas and raita for his secret single meal instead of eating a bowl of cereal like the rest of us—would be the one to convince me that a galette is the best meal to cook for oneself.Until now, I’d only ever made galettes for parties—the sort of impressive but relatively low effort main I could slide onto a cutting board and cut into wedges, at which point my friends would shower me with accolades. But why make it for myself when I could have scrambled eggs for the fortieth day in a row?Well, Andy had a good point: A savory galette is great hot, cold, or at the ambient temperature of your kitchen, just as welcome at 8 p.m. as at 10 a.m. In other words, it’s a meal prep recipe without the meal prep. This one is full of spicy Swiss chard, so you don’t have to make (or, uh, think about making) a salad, and there’s lots of parm, so you can save the “meal” where you hack at a block of cheddar cheese for another time.“We always talk about how one of life’s greatest joys is to cook for others,” says Andy, “but there’s also something satisfying in refining the craft for yourself.” For Andy, cooking solo is the best opportunity to try something new in the kitchen: If it’s a failure, no one has to know (and you can retreat back to that bowl of cereal). If it’s a raging success, you get to reap all of the rewards.The dough for this galette was just the kind of experiment Andy needed time to work through alone. Unlike his usual formula, this one skips the butter and relies instead on a combination of olive oil and yogurt. At first, it was so delicate that it was tricky to roll out and serve. The next round, though, was thin and cracker-like, missing the air pockets that create flaky layers. Eventually, he found the ratio of oil, yogurt, and flour that yielded the perfect tender, tangy crust.I asked Andy how someone who’s made this galette for themselves should eat it: “Dinner. Breakfast. Lunch. In that order.” If you’re the kind of person who gets bored fast, eat your first slice for dinner warm from the oven, slide on a fried egg for breakfast, and turn it into a lunch with a dollop of yogurt.It’ll be gone before you know it. And you’ll only have yourself to thank.Get the recipe:Olive Oil Galette With Spicy GreensWhile butter is the usual choice for galette or pie dough, a combination of olive oil and yogurt gives this crust a flaky texture and a golden brown color when baked. If the dough is a little crumbly when rolling it out, don’t worry: Just patch it back up.View RecipeExplore Bon AppétitHealthyish Guide to Being AloneHealthyishCoronavirusRead MoreLifestyleThe Healthyish Guide to Being AloneBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-13", "author": ["Condé Nast", "Sarah Jampel"]}