{"id": "f12d7b29a909bb232b65a5c7152ebf48", "url": "https://www.bonappetit.com/story/pastry-ruler", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "A Pastry Ruler May Sound Crazy, But I'm Obsessed With Making Perfect Cookies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s Crazy to Use a Ruler for Baking, But What Can I Say? I’m Obsessed With Making Perfect CookiesThere’s really only one good way to tell the difference between 1/4-inch and 1/2-inch—and no, it’s not to eyeball it.By Sarah JampelDecember 18, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThese trusty, cheerful pastry rulers saved me from myself. Without their help, I surely would have perished in my pursuit to bake 400-plus sugar cookies for a big party (okay, it was a wedding; okay, it was my wedding).Hold up: What even is a pastry ruler? I first learned about these dead-simple tools when I was baking 300 sandwich cookies a week (do you sense a trend?) at a small café, and I ordered a set of my own when I grasped the enormity of my wedding cookie task. The rulers I bought come in a set of three Lifesaver-colored couples that are themselves 1/16-,  3/16-, and 1/4-inch thick. Select the thickness you want (1/4-inch for cookies, but maybe a bit thinner—like 3/16—for pie, and even thinner still for fondant or, godspeed, pasta) and position your dough in between a pair. When you move the rolling pin along them like a track, you’ll squish the dough into the exact thickness of the bars surrounding it, no thinner or thicker.I favor the sturdy plastic rulers over the Silicone sets: Since Silicone is squishy, there’s a chance that if you Hulk out and push too hard, you’ll accidentally get a thinner dough than desired.\nPhoto by Chelsie CraigThis is great because, let’s be real: When’s the last time you took a ruler to your dough and tried to measure its height? It’s impossible! And can anyone who doesn’t roll dough on the reg visualize the difference between 1/4 inch and 1/8 inch? That’s crazy talk! The pastry rulers guarantee that you’ve rolled an even slab of dough to the thickness specified by the recipe, which means that baking times will be more reliable, elusive textures (crispy or flaky or tender) will be more achievable, and cookie batches will bake more evenly.Sure, pastry rulers aren’t the only path to uniform dough, but they are the most versatile. The alternatives include Silicone rings that screw into a corresponding pin, elevating it the desired height above the work surface, and the Epicurious-endorsed J.K. Adams Lovely Rolling Pin, a beautiful pin ingeniously designed to yield 1/4-inch dough every time. (Or, get a set that includes a sibling 1/8-inch pin). With both of these designs, the issue is the same: You’re stuck with a speciality pin that probably can’t be used in every single way you’d like. And before you know it, you’ll end up with a whole drawer of rolling pins, and who has space for that?I’d rather have a singular fancy stick—dead-simple but exceedingly useful—in my drawer, just so long as I also have the pastry rulers that make me feel like a card-carrying Cookier ready for CookieCon.Buy it: Autumn Carpenter Pastry Rulers, Set of 6, $20 at Kitchen JukeboxAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitCookieHoliday CookiesDessertRead Moretest-kitchenThese Chocolate Cookies Are Part Biscuit, Part CookieBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-18", "author": ["Condé Nast", "Sarah Jampel"]}