{"id": "f12e47aa62d59e4a0a0912d2f52e0a22", "url": "https://www.bonappetit.com/recipe/royal-roselle-fizz", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Royal Roselle Fizz Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRoyal Roselle FizzBy Shyretha SheatsMay 25, 20214.2(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alexa RiveraEmailPinterestPrintEmailPinterestPrintA Red Drink is a classic Juneteenth libation, whether it’s tropical punch Kool-Aid, strawberry soda, or this savory-sweet hibiscus and vermouth cocktail from Shyretha Sheats, half of the husband-and-wife duo behind beloved Athens, Georgia pop-up The Plate Sale.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCocktail Mixing Glass$40 $18 At AmazonMesh Sieve$13 At AmazonBar Spoon$10 At AmazonGlass Storage Containers$36 At AmazonSmall Saucepan$155 At AmazonIngredientsMakes 1Tea1cup dried hibiscus flowers, rinsed10dried bay leavesSimple Syrup2cups raw sugar10dried bay leavesCocktail1oz. sweet vermouth½oz. fresh lime juice1tsp. pickle brineA dash of Angostura bittersDry sparkling wine (for serving)Bay leaves (for serving)PreparationTeaStep 1Combine hibiscus flowers and bay leaves in a small bowl. Bring 5 cups water to a boil in a small saucepan and pour over hibiscus flowers and bay leaves to cover. Let sit 8 hours (overnight works well), then strain through a fine-mesh sieve into a large measuring glass or small bowl; discard solids. Cover and chill tea until cold, at least 1 hour.Do ahead: Tea can be made 5 days ahead. Keep chilled.Simple SyrupStep 2Bring raw sugar, bay leaves, and 2 cups water to a simmer in a small saucepan, stirring to dissolve sugar. Remove from heat and let cool.Step 3Strain simple syrup through a fine-mesh sieve into a measuring glass or small bowl; discard bay leaves. Cover and chill until cold, at least 1 hour.Do ahead: Simple syrup can be made 5 days ahead. Keep chilled.Cocktail Step 4Stir vermouth, lime juice, pickle brine, bitters, 2 oz. hibiscus tea, and ½ oz. simple syrup in a glass to combine. Add ice to fill and top off with sparkling wine. Garnish with bay leaves.How would you rate Royal Roselle Fizz?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleLove this! Complex but refreshing; I was in a hurry so I used simple syrup from a bottle and made the tea with a hibiscus tea bag and a bay leaf steeped in the fridge for 45 minutes or so and it tasted great! Also works well with olive juice.Cristine QDallas, TX6/1/2021Explore Bon AppétitCocktailDrinks AllSoul FoodAmericanHibiscusHerbs & SpicesVermouthAlcohol & Other DrinksLimeCitrusFruitDrinksKwanzaaJuneteenthRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Shyretha Sheats"]}