{"id": "f133c228ee7981e625089aa4add17901", "url": "https://www.bonappetit.com/story/hop-alley-denver-tofu", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "I Douse Everything in Hot Sauce, But Hop Alley's Cooling Silken Tofu Won Me Over | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Douse Everything in Hot Sauce, But This Cooling Silken Tofu Won Me OverThis decidedly not-spicy dish is the move at Denver’s Hop Alley.By Emily SchultzAugust 2, 2019FacebookTwitterEmailPhoto by Rachel AdamsFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.My dad used to make fun of me for guarding a bottle of Frank’s RedHot sauce as if my life depended on it. I add it to everything—scrambled eggs, French fries, chicken salad. What can I say? I live for the spice. Which is why, naturally, I’m into all the Sichuan peppercorn-laced things at Hop Alley in Denver.There’s the numbingly hot fried chicken; pork dumplings swimming in fiery chile oil that cures any summer sniffles; and the dan dan mian, noodles tossed with tingly-spicy ground pork. But the thing I actually loved the most at this restaurant wasn’t any of the above. It was the decidedly not spicy chilled tofu dish.It’s a thing of beauty. Silken tofu, sliced and shingled out like a hand of playing cards, is smothered in bang-bang sauce, an addictive mixture of sesame paste, chile oil, sugar, Chinese black vinegar, and soy sauce. On top of that, smashed cucumbers, peanuts, poppy seeds, flaky salt, and cilantro are piled on. Everything works together in perfect harmony: the crisp, watery cucumbers offsetting the salty peanuts; the crunchy toppings balancing the custardy consistency of the silken tofu. It’s exactly the calm, cool rest stop my runny nose and watery eyes need in the middle of my heat-seeking journey.But before you go on thinking I can’t take the heat, I should say that there is just a tiny bit of chile flakes in there. Not too muchl just enough to keep me coming back again and again. Like I told you: I can’t get away from the spice life.Go there: Hop AlleyExplore Bon AppétitDenverHighly RecommendRestaurantsRead MorerestaurantsVenezuelan Sticky Buns > Regular Sticky Buns, Always and ForeverBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-02", "author": ["Condé Nast", "Emily Schultz"]}