{"id": "f143e807afd3eb74c35849cc2b4fa3ad", "url": "https://www.bonappetit.com/story/tway-nguyen", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "TikTok’s star Tway Nguyen Is Bringing Her Vietnamese Cooking to Eaters IRL | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsTikTok’s “Big Sis” Is Bringing Her Vietnamese Cooking to Eaters IRLSocial media star Tway Nguyen wants to share the flavors she knows and loves.By Malik PeayOctober 1, 2021FacebookTwitterEmailPhotograph by Jordan JamalFacebookTwitterEmailIn March 2020, just as the pandemic hit the U.S., Tway Nguyen decided to film something for TikTok. She made sausage and egg fried rice, chopping green onions, mincing garlic, and adding a finishing touch of fish sauce. She didn’t realize it then, but this would be the video that would launch her cooking career.Nguyen, also known as Twaydabae on Instagram, TikTok, and YouTube, now has over a million followers across her social media platforms. She’s using these outlets to share the Vietnamese dishes she grew up eating and to educate her viewers on Vietnamese food, culture, and people. Her detailed recipe videos, along with her sharing the Vietnamese names of each dish she prepares on TikTok, has earned her the title of chi hai, which translates to “big sister.”TikTok contentThis content can also be viewed on the site it originates from.Now Nguyen is expanding her platform to pop-ups in Los Angeles, where she lives. She and I connected over Zoom to talk about how she got into cooking, how social media has become an educational tool for her, and what it’s been like translating her food from the screen to IRL events.The person who inspired me to get into cooking… was Anthony Bourdain. When I came over to America from Vietnam, I didn't know a lot of English, so I watched a lot of television: SpongeBob, Food Network, and the Travel Channel. I happened to see the one episode where Bourdain went to Vietnam. I was probably like 8 or 9. The way that he talked about Vietnam—he just had so much love and respect and passion for Vietnamese food, Vietnamese people. When I was living in Vietnam, it didn't feel like it was anything special. It wasn’t the place to be; America was the dream. But seeing a white man talk about Vietnam the way that he did inspired me.I went to culinary school because... I didn't know the techniques. I didn't know how to use a knife or how to hold it correctly. But there wasn't ever a situation where they were teaching me how to season. I learned that from my mom. In Vietnamese culture, when you get married, you have to move in with your husband's family and take care of them and make their food. So at age 24, my mom had this responsibility. She had to remember all the meals that her mom made and just practice. My mom is not the type of mom who will teach you how to cook. When she is in the kitchen, that's her space. I wasn't really able to follow her or what she was doing, but eventually I learned by smelling and feeling, by instinct.The first recipe video I ever made was... fried rice. I put it on TikTok in March 2020, right before the pandemic, and it’s still my favorite video. I was in culinary school and had extra time on the side. It was spontaneous and I wasn’t expecting anything to come from it, but it ended up changing the trajectory of my career. It blew up. It got over seven million views. I knew that I had to continue making cooking content, and I stuck to making Vietnamese recipes because I felt like not a lot of people were sharing these flavors I know and love. I wanted to give Vietnamese food the love and attention that it deserves.My Vietnamese followers call me... “big sis,” or chi hai. That is truly an honor, for someone who isn’t related to you to call you that. That is what my sister calls me. I’ve been taking care of her since I was in third grade, so I’ve always been in the position of being an older sister and I still give off that vibe. I have people that aren't even Vietnamese telling me that my videos and my recipes are so easy, that they feel like they can do it themselves, too.I went to culinary school with a dream to... one day own a restaurant so I can feed people my food. At the time, I had a very narrow mindset that I needed to work my way up the ladder in the industry because that’s usually how it is. After sharing my recipes online, I realized that I can actually feed people through pop-ups.Transitioning from cooking online to cooking in real life... has been the most rewarding and exciting thing that I have done. I’m able to provide people with different experiences every time I host a pop-up. I did one back in September with i.8sushi, an old culinary school friend, and a future one with Fly By Jing at Family Style Food Festival [happening October 10]. The one with i.8sushi was a sushi box we collaborated on that featured rolls with Vietnamese flavors. At this point in my career, I’m just having fun and exploring all the opportunities that come my way. To be able to walk around and talk to people and meet people and have people taste my food is so surreal.I don’t know what the future holds... but I do know that I'll be working with food for the rest of my life. That's how I express myself. That's how I'm able to honor my culture. That's how I tell my story.Explore Bon AppétitRestaurantsPerson of InterestRead MoreLifestyle‘Kid of the Internet’ Quinta Brunson Wants Us to Keep Growing (and Growing and Growing)By Leigh-Ann JacksoncultureHow Paralympian Kaleo Kanahele Maclay Gets Through Training, Motherhood, and Running a Coffee ShopBy Ali FrancisrestaurantsStefano Diaz Is Building a Better Butcher ShopBy Sara B. FranklinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-01", "author": ["Condé Nast", "Malik Peay"]}