{"id": "f14573fd55edb73bc0d5617a61b8d18b", "url": "https://www.bonappetit.com/recipe/cheesy-stuffed-tomatoes", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Cheesy Stuffed Tomatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueCheesy Stuffed TomatoesBy Andy BaraghaniJuly 9, 20195.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintYou don’t have to use mozzarella; other fresh cheeses like ricotta, goat, or feta will work, though you might miss that stretchy molten-cheese effect.Ingredients4 servings¼cup raw pistachios4large heirloom tomatoes (about 2½ lb.)Kosher salt, freshly ground pepper1garlic clove, finely grated2Tbsp. chopped golden raisins¼cup extra-virgin olive oil, plus more for drizzling1Tbsp. chopped thyme, plus 6 sprigs8oz. fresh mozzarellaPreparationStep 1Preheat oven to 350°. Toast pistachios on a rimmed baking sheet, tossing once, until golden brown, 5–8 minutes. Let cool, then finely chop. Reduce oven temperature to 325°.Step 2Slice about ½\" off the top of each tomato; reserve tops. Using a spoon, scoop out the center of each tomato (save for making sauce). Season insides of tomatoes with salt and pepper. Transfer to a baking dish large enough to hold tomatoes (they can be snug).Step 3Mix pistachios, garlic, raisins, ¼ cup oil, and 1 Tbsp. thyme in a medium bowl; season with salt and pepper. Place about 1 Tbsp. filling in each tomato. Tear mozzarella into bite-size pieces and snuggle into tomatoes. Top with remaining filling (you may need to gently press filling down with your fingers).Step 4Replace tomato tops; drizzle with oil. Scatter thyme sprigs over and bake, uncovered, until tomatoes release some liquid and begin to get a little wrinkly on top, 35–45 minutes. Let cool slightly before serving.How would you rate Cheesy Stuffed Tomatoes?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleSurprised this hasn't  been reviewed yet. I have made this 3 times so far since receiving my August issue. The first time was a learning experience, as the large heirloom tomatoes released far too much liquid and were swimming. We decided they were overripe and that I should have removed more of the flesh, i.e. not just \"the center\", but enough to create a large enough void to hold all the cheese and pistachio goodness easily. I left about 1/3 inch shell of the tomato, and also drained them for a minute upside down to release the extra liquid. Other than that followed the recipe, and watched carefully and removed from the oven as soon as a very small amount of liquid escaped in the pyrex pan I baked them in. Leave for only a few minutes before serving. For cheese I have tried fresh mozzarella, and a combination of fresh mozzarella and mild provolone. This is a wonderful, generous side to a grilled chicken breast or the like, and a beautiful presentation.valerie_joyVictoria, BC, Canada8/13/2019Explore Bon AppétitTomatoVegetableMozzarellaCheeseRicottaGoat CheeseFetaEasyWeeknight MealsSideStarterGluten-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Andy Baraghani"]}