{"id": "f162de8fd2cfe2e9188a0497c9510558", "url": "https://www.bonappetit.com/story/mixed-race-queer-feminist-farmer", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "How Queer Farmers Like  Nikiko Masumoto Are Shaping Food Systems  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat It’s Like to Be a Mixed-Race, Queer, Feminist FarmerFor Nikiko Masumoto, farming is a powerful act of resistance.By Nikiko MasumotoSeptember 24, 2018FacebookTwitterEmailPhoto by Annie Martin for Good EggsFacebookTwitterEmailNikiko Masumoto was raised in California’s Central Valley on a peach farm with a long family history. Her grandfather, a first-generation Japanese American born in this country, broke the ground with dynamite so he could plant the first crop of peaches following World War II, and her father helped pioneer the organic farming movement in the 1980s. Now, Nikiko is gradually taking over the family business, while also speaking out about being a queer woman in farming and advocating for others like her.Growing up as a little girl on a small farm, regardless of gender, you’re going to work. Because when harvest hits, it’s all hands on deck. So, as young as nine-years-old, I was tackling everything from stamping boxes to driving tractors, standing on my tippy toes just to grip the steering wheel.My father is a third-generation Japanese American, and my mother is of German descent. The Central Valley echoes all of the diverse shades of California, and my brother and I never felt different at school because of the many immigrant populations, but now we understand that we’re among the last of a specific community: Japanese Americans in agriculture. In the 1940s, Japanese American immigrants were responsible for 30 to 35 percent of the crops in California. During World War II, many of those families were relocated to internment camps and never came back in the same numbers. My grandfather and father were part of an amazing extended family and farming community when they were younger, but those town halls and potlucks have mostly disappeared.A small faction of the Masumoto peach harvest.\nPhoto by Annie Martin for Good EggsI didn’t choose gender and women’s studies—it chose me. My intro class at UC Berkeley set my heart ablaze. After spending so much time thinking about power dynamics and how to make the world a better place to live in, I knew had to go back to the farm. For the first time, I saw our Japanese American family farm as not just my home but as an incredibly powerful act of resistance. I realized how courageous it was for my grandfather to put down roots in a country that did not want him. I understood my father’s early commitment to organic as rebellion in the face of profit-driven agriculture. I thought about how change happens.I also came back with a passion for supporting women in food systems. As a woman, I want to work with other women, and cultivate the culture of a mixed-gender crew. And we do everything we can to make it a comfortable work environment. As a family business, we often hire family units, and if parents need to leave early, take a day off, or adjust their schedules, we always accommodate.Our female employees often show up for work at the beginning of the season covered from head to foot, with long pants and sleeves, and bandanas tied tightly across their faces. It’s not just the dust. The rates of sexual harassment and violence many farmworker women have to face is staggering: nearly all report having experienced abuse or knowing someone who has. For Mexican immigrant women in the Central Valley in particular, it’s a harsh intersection of sexism, racism, and economic discrimination. But after a few weeks of working with us, the layers of clothes lift off. I cherish the moments when these women get to relax and work without gender-based fear.Nikiko Masumoto with her father David Mas Masumoto\nPhoto by Annie Martin for Good EggsIntimidation is mapped onto the overall experience of being a woman in agriculture, and I’ve felt it too. Men have tried to diminish me, both physically and verbally. It’s everything from white male farmers calling me “honey” and “sweetie,” to macho field workers making aggressive sexual comments, to being groped and touched. But I’ve also had positive experiences and unexpected moments of connection. We have a neighbor, a former Trump supporter who owns guns, who I was afraid of for years, but we now consider one of our closest friends. And I’ve worked with men in agriculture who are proud to have me on their team.Only 14 percent of principal operators are women, and I feel that all the time. Every time I walk into a meeting, everyone in the room is a man. I’ve been mistaken for a secretary and a server. There are so many assumptions about who gets to speak, who is listened to, what questions are asked or not. But I take a deep breath and take a seat at the table. It’s hard to balance being open, aware, and present, but also strong and unapologetic.My grandfather was always proud of me. He lost his ability to speak when I was in sixth grade, although he was always a quiet man, anyway. After undergrad, I moved in with my grandparents for a couple of years. Every single time I pulled into our yard on a tractor, with dirt smeared all over my face, he would let loose the most wonderful chuckle. He wasn’t making fun of me. It was this knowing, sweet, and joyous laugh. Like, \"Wow, she's doing this.\"– As told to Becky DuffettExplore Bon AppétitFarmers MarketPeachCaliforniaInterviewsRead MoreLifestyleWhat Needs to Change for Kitchens to Become More Queer-Friendly?Gallery4 SlidesBy Emily SundbergRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-24", "author": ["Condé Nast", "Nikiko Masumoto"]}