{"id": "f1627d4954cf052516c80a1c27dacaed", "url": "https://www.bonappetit.com/recipe/chimichurri-sauce-2", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "Chimichurri Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJuly 2011 IssueChimichurri SauceBy The Bon Appétit Test KitchenMarch 10, 20223.9(679)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintIt’s no secret that we love a green sauce and this Argentine chimichurri recipe is no exception. Fresh oregano, parsley, and cilantro come together with a heavy pour of red wine vinegar for a punchy condiment that’s as good spooned over a grilled steak as it is drizzled on a bowl of lentils (it’s also an excellent marinade).Chopping everything by hand (as opposed to using a food processor) gives you dynamic texture—and prevents the herby sauce from turning into a paste. Allowing the shallot, chile, garlic, and salt to sit with the vinegar for 10 minutes before adding the herbs softens the aromatics and tames their raw sting.Chimichurri is best served just after it’s made, but if you have any left over, the sauce will hold in the refrigerator for a few days. Use to top roasted chicken, grilled tofu, oven-roasted potatoes, fried eggs, or almost anything else that’s simply seasoned. Mix it with Greek yogurt to create a dip, or work in a bit of mayonnaise for a creamy and herb-packed spread for a sandwich.Editor’s note: This recipe was originally published in our July 2011 issue.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCutting Board$10 At IKEAStainless Steel Mixing Bowls$26 At Amazon13x9\" Baking Dish$20 At Amazon8-Inch Chef's Knife$47 At AmazonIngredientsMakes about 2 cups1shallot, finely chopped1Fresno chile or red jalapeño, finely chopped3–4garlic cloves, thinly sliced or finely chopped½cup red wine vinegar1tsp. kosher salt, plus more½cup finely chopped cilantro¼cup finely chopped flat-leaf parsley2Tbsp. finely chopped oregano¾cup extra-virgin olive oilPreparationStep 1Combine shallot, chile, garlic, vinegar, and 1 tsp. salt in a medium bowl. Let sit 10 minutes. Stir in cilantro, parsley, and oregano. Using a fork, whisk in oil. Transfer ½ cup chimichurri to a small bowl; season with salt and reserve as sauce. Step 2If using for beef, place meat in a glass, stainless-steel, or ceramic dish. Toss with remaining chimichurri. Cover and chill at least 3 hours or up to overnight.Step 3Remove meat from marinade, pat dry, and grill.Step 4Spoon reserved chimichurri over grilled meat.Nutrition Per ServingMakes about 2 cups. 1 tablespoon contains: Calories (kcal) 54.7 %Calories from Fat 95.6 Fat (g) 5.8 Saturated Fat (g) 0.8 Cholesterol (mg) 0 Carbohydrates (g) 0.5 Dietary Fiber (g) 0.1 Total Sugars (g) 0.1 Net Carbs (g) 0.4 Protein (g) 0.1 Sodium (mg) 35.8How would you rate Chimichurri Sauce?Leave a ReviewTell us what you thinkReviews (53)Back to TopTriangleWhat kind of bowl is that in the photo? It looks like it might be volcanic rock.LCSpokane, WA2/8/2022I have used this recipe before and continue to use it!\nIt’s excellent. AnonymousBlue Bell PA1/27/2022This is the worst recipe ever. 1/2 cup of red wine vinegar??? It's waaaay too strong. The next most popular recipe uses 2 tablespoons...Anonymous1/13/2022This is absolutely delicious over roasted cauliflower.AnonymousSilicon Valley11/5/2021This leaves an after taste delicious AnonymousUk7/31/2021Far better than any Jared sauce that you can purchase! Marcos RodriguezBoca Raton, Florida 7/25/2021Was spectacular!  Love love love!  Telling all my friends about it. Can marinade anything with this -beef, pork, chicken or fish and absolutely can use as a side dipping sauce.  Thank you for sharing!!!Carolina4evr7/8/2021Absolutely devine!  I used fresh ingredients from my garden  and it was excellent. \nThank you.Kelly macia Seabrook  sc 6/26/2021Made this and the amount of vinegar was way too over powering. It ruined it. I will add to taste The next time.Larry GAltadena ,CA6/24/2021I was first introduced to Chimichurri at Texas de Brazil....it was good.  Now, I make my own, and it goes great with any meat but especially beef.\n\nOne person who posted a review mentioned that the Red Wine vinegar was over power...that maybe true but I mix half Red Wine and half (ready for this?) White Raspberry  Balsamic vinegar.  Of course,  any Balsamic would work.   Less intense than straight vinegar and a touch of sweetness.\nRoyQuitman, TX6/11/2021Amazing! So delicious. Great burn/acid/flavor combination. We used that for a traditional Argentine choripan. Roxana Wroblewski Argentine and Texas 5/30/2021Love it! Thank you. We’ve made this 4x now and are big fans. I’m not sure if this is a traditional way of making it, but it’s super delicious. My husband is very picky and loves it. We use it on grilled chicken, steak and rice. The acidity is amazing to brighten up a dish. Jen Calgary, AB5/12/2021AMAZING, love this sauce. I've made it countless times! Simple and fresh and pairs well with any type of grilled meat. I specifically like pairing it with picanha or top sirloin.Nicole RToronto, ON5/11/2021Read an article about chimichurri sauce, how it's best if chopped, rustically, rather than processed, so when I made this recipe, I chopped all the ingredients.  \nIt was DEE-licious!  \nMost recipes contained oregano, only this one used cilantro and it adds depth and another layer of 'fresh' taste to the sauce.\nThe amount of red vinegar might not be to everyone's taste, but with a fatty piece of meat, the acid is a perfect counter-balance.\nGreat recipe, we loved it.eatumlotsIrvine, CA5/10/2021A great recipe! It worked perfectly and was the perfect accompaniment to our steak and shrimp lunch. I made it with the red, deseeded chilli option. For the oil I opted for Filippo Berrio extra Virgin. I wasn’t sure about whether the quantity of parsley and cilantro was ‘packed’ or after chopping so i did it by taste. It was super, I’m definitely making this again! AnonymousLondon, UK5/2/2021Explore Bon AppétitSauceCondimentMarinadeLatin AmericanArgentineanSouth AmericanCilantroHerbs & SpicesParsleyOreganoEasyQuickNut-FreeGluten-FreeDairy-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2010-06-14", "author": ["Condé Nast", "The Bon Appétit Test Kitchen"]}