{"id": "f16a7a0b1dea1b1d669b06a047bbf4eb", "url": "https://www.bonappetit.com/recipe/blind-baked-pie-crust", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Blind-Baked Pie Crust Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueBlind-Baked Pie CrustBy Chris MoroccoOctober 15, 20193.2(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintNobody—nobody!—likes a soggy pie crust. That’s where blind-baking comes in. The process of prebaking your crust is crucial for pies with no-bake fillings, like lemon meringue or chocolate pudding. It’s a two-step process: First bake your crust filled with pie weights or dried beans—this helps it keep its shape instead of slumping into a gloppy mess. On the second round, take the weights out and bake until it’s deeply browned—and we mean deeply. You’re aiming for the color of a brown paper bag (yes, that dark!) for the best texture and flavor. When in doubt, it’s better to overbake than underbake. You can also bake this pie crust ahead if you’re multitasking a big meal and need that precious oven space. It will keep at room temperature, tightly wrapped, for up to 2 days.IngredientsMakes 22Tbsp. granulated sugar2tsp. Diamond Crystal or 1 tsp. Morton kosher salt2⅔cups all-purpose flour, plus more for dusting1½cups (3 sticks) chilled unsalted butter, cut into ½\" piecesPreparationStep 1Whisk sugar, salt, and 2⅔ cups flour in a large bowl. Add butter and, using your fingers, smash each piece into a thin disk. Take your time doing this and don’t feel compelled to break butter into even smaller pieces. Drizzle ⅔ cup ice water over, dispersing it as widely as possible, and mix with a rubber spatula to bring mixture together into a shaggy mass.Step 2Turn dough out onto a surface and work together with your hands, pushing and flattening until dough holds together when squeezed in your palm but some streaks of dry flour are still visible. Divide dough into 2 portions.Step 3Flatten 1 portion of dough into an 8\"-diameter disk. Cut into quarters, stack pieces on top of one another, and flatten dough with a rolling pin to about half of its original height. At this point dough should hold together with no dry spots remaining, and have nice big flakes of butter showing. Use a bench scraper or a large knife to clean any clingy bits of dough from surface. Dust surface with flour, then dust top of dough with flour. Roll out to a ¼\"–⅜\"-thick round. Wrap dough around rolling pin and transfer to a standard 9\"-diameter pie dish. Unfurl into dish, then lift edges and allow dough to slump down into dish. Trim overhang to an even 1\" (there will be some excess). Fold overhang under and crimp as desired. Cover and chill until very cold, at least 1 hour and up to 12 hours (cover tightly if chilling longer than 1 hour). Repeat process with remaining dough and another pie dish. Or form into a 1½\"-thick disk, wrap in plastic, and chill up to 3 days (or freeze up to 1 month).Step 4Place a rack in middle of oven; preheat oven to 400°. Lay 2 sheets of parchment paper over dough and fill with pie weights or dried beans (they should fill the dish). Set on a foil-lined rimmed baking sheet (this will keep any butter drips from smoking up your oven). Bake until edges are golden brown and bottom is opaque (carefully lift parchment to check), 30–35 minutes. Remove from oven; reduce oven temperature to 300°. Lift out parchment and weights. Bake crust until evenly chestnut brown all over, 10–15 minutes. If baking both crusts, turn oven dial back up to 400° and let oven preheat; repeat with remaining crust.How would you rate Blind-Baked Pie Crust?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleMade the lemon meringue pie, and the crust was the best part. Buttery, flaky, perfect. Will make again, that's for sure. itamaradamIsrael12/15/2019I was looking for instructions on blind baking a crust - I used my own pastry and lemon pie recipe. The instructions for blind baking resulted in the best crust for my favourite lemon pie. The crust was cooked through, didn’t shrink and was a beautiful colour. I will follow the instructions from now on! Thank you!AnonymousGold Canyon, Az12/10/2019I gave this recipe 3 stars, because while the large proportion on butter allows for the flaky-ist of layers, it doesn't have enough structure.  Both crusts fell down the sides of the pie dish which, ok, whatever, but now I can't fit as much filling in the pie.  The first one I thought I had screwed up the recipe so I filled it with thankgiving leftovers and made a faux-shepards pie.  The second one I carefully formed the pie crust edge on the rim of the dish (to help hold the crust up) and the crust still fell down in 2 places.  \n\nAre you reading this and considering making this recipe?  Fine, but make sure you use pie weight or beans that nearly fill the entire pie, so to help hold the edges up.\n\nPersonally I'll stick to my  2 cups flour to 1.5 stick of butter pie crust recipe (with ample water).AnonymousNew London Ct12/3/2019I'll try again before giving up completely on this, BUT. The texture came out varying between pie jerky and cracker-corn nuts. Not happy - and I consider a Good crust a True Delight.AnonymousSan Diego11/30/2019Made this crust (and the banana cream and chocolate pies in the Nov issue) exactly as written.  Was super excited about the pies.  Turned out okay, definitely tasty, just not as amazing as i was hoping for.  I wanted to review the crust though (this is my first review ever) because I felt there were things people should know.  I have 2 main problems with this crust 1. I placed the crust on a rimmed baking sheet per the instructions, sooo glad I did because it is definitely needed to catch all the melting butter.  The problem was that all my pie dishes were then covered in butter on the bottom.  They were greasy and slippery.  I didnt want to set them on my kitchen counter much less someone's pretty thanksgiving table.  I had to try and hold the crust while wiping off the dish and not wreck my crust in the process.  I set it on paper towels and eventually got it to a manageable level but it really was a pain. 2.  Also a butter issue: the crust falls while baking and so when it is done you have a lot of crust baked over the side of your dish.  Difficult to transport without breaking off pieces of crust, and difficult to serve because you cant get a slice out of the dish without breaking the crust.  I love crust, and i love a pretty crust.  I'm all for a rustic looking one, and nibbling on pieces that fall off,  but this was more than I wanted for that.  I think this crust does not need as much butter, or it needs to be incorporated differently... I guess I don't know what the answer is.  I make a lot of pies around the holidays every year, I have prebaked (blind baked? )  pie crusts before...and I will likely go back to those recipes just so I dont have these issues again.  AnonymousPeoria, AZ11/27/2019Explore Bon AppétitDoughPieDessertNut-FreeVegetarianBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Chris Morocco"]}