{"id": "f16bb329ed6e3d57d34538a0495e0bae", "url": "https://www.bonappetit.com/story/arepas-vegetarian", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "This Arepas Recipe Is My Most Impressive Weeknight Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingArepas Are My Most Impressive Weeknight DinnerStash a bag of arepa flour in your pantry and a satisfying dinner is never far away. By Sarah JampelOctober 15, 2019FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Kat Boytsova FacebookTwitterEmailBeing a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner.The most impressive dinner I make for myself is arepas—blackened on the outside, soft and mellow on the inside, topped or stuffed with whatever my heart desires. But, yeah, it’s less impressive when you consider that there’s really only one essential ingredient: arepa flour.Not to be confused with masa harina or cornmeal (or polenta or grits… the world of corn and its byproducts is vast and varied), arepa flour is pre-cooked, which means that making the dough is as simple as mixing it with water and salt. Once you’ve done that, just shape the arepas (easy!), char them on both sides, then send them into the oven to cook through.I keep a bag of arepa flour in the pantry so that whenever there are who’s its and what’s its galore in my fridge (a half-bunch of kale, an ounce of cheese, an avocado quarter, fewer than twenty black beans), I can make a couple of arepas, then prep those randos while they bake. And, somehow, in 30-ish minutes, I’ve got something resembling dinner.Eaten all over Latin America for meals and snacks, arepas come in countless varieties: They can be cut open and smeared with butter, or split and stuffed to the brim like a sandwich, or filled with a gusher of melting cheese, or flecked with grated cheese throughout, or lightly sweetened and speckled with aniseeds. They can be griddled, or grilled, or baked. Venezuelan arepas are often thicker, intended to be split open and composed sandwich-style (arepas rellenas) with anything from stewed meat to black beans to fried plantains. Colombian arepas, on the other hand, tend to be thinner and crispier, with accompanying ingredients that go on top rather than in the middle.This recipe can work for either arepa style.  You can make them thin (the flatter the arepas, the easier it is to ensure it’s cooked through), and layer them with avocado spread, black beans, and queso fresco. But if you make them a little thicker and get out a sharp knife, you can stuff them, Venezuelan-style. I love adding toasted pumpkin and sunflower seeds to the dough—their crunch breaks up the softness of the arepas’ interiors—but they’re optional: Leave them out or experiment with sesame seeds or nigella seeds (skip the chia seeds and flaxseeds, though: these mess with the dough’s hydration and turn the arepas gummy).I designed this recipe selfishly, to fit how I like to cook—whenever one component is on pause (whether that’s the dough resting or the arepas baking), you’re doing something else, like puréeing the avocado or sautéeing the beans. It keeps me occupied and productive so that I don’t accidentally eat an entire bag of pretzels before dinner is ready. But if you’re only up to do part of the recipe—say, the arepas with the avocado, or the arepas and the beans—go your own way: Add sautéed greens or crisped-up mushrooms or leftover roasted chicken. Just don’t skip the arepas. Once you get the hang of making them, they might be your most “impressive” (shhh) weeknight meal, too.Get the recipe:Seedy Arepas With Black Beans and AvocadoThere are countless variations of arepas all over Colombia and Venezuela, but whether they’re stuffed with cheese, chicken, or pork, the dough starts in the same way: with arepa flour.View RecipeExplore Bon AppétitVegetarianHealthyishThe Not Depressing VegetarianWeeknightDinnerRead MoreLifestyleThat Nut Butter Bar You're Obsessed With Is Easy to Make at HomeBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Sarah Jampel"]}