{"id": "f16c1b1b4eaefc1a377715797a6da367", "url": "https://www.bonappetit.com/story/chicago-red-sauce-ecuadoran-immigrant-arturo-aucaquizhpi", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "The Chef Carrying on Chicago’s Red Sauce Legacy Is Ecuadoran Immigrant Arturo Aucaquizhpi | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Chef Carrying on Chicago’s Red Sauce Legacy Is Ecuadoran Immigrant Arturo AucaquizhpiAfter quietly rising through the unsung ranks at local icon Gene & Georgetti, one ambitious cook opened his own classic Italian steakhouse.By Mike SulaApril 16, 2019FacebookTwitterEmailPhoto by Jeff MariniFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.At the end of 2016, under flapping Italian and U.S. flags on a busy street across from an abandoned Kmart and Chicago’s only Olive Garden, Arturo Aucaquizhpi opened Mirabella Italian Cuisine & Bar. Here, in his mushroom toque, the chef serves shrimp de Jonghe, roasted chicken smothered in bell peppers and pepperoncini, and crispy cottage fries with every steak. It’s a menu that’s hauntingly familiar to anyone who’s ever dined at the restaurant godfather of red sauce Chicago, Gene & Georgetti.That’s not a coincidence. Aucaquizhpi was a 20-year veteran of the latter, the city’s most venerated Italian steakhouse. But Mirabella, staffed almost entirely by Ecuadoran immigrants like Aucaquizhpi, is nothing like Gene & Georgetti. For one thing, it’s not as expensive. But more strikingly, here on the blue-collar northwest side, the average Joe and Jane will never get a stiff greeting and a table in Siberia as they might downtown.Twenty-seven years ago, when Aucaquizhpi left his home village in south Andean Ecuador for Chicago, he was 16 and barely spoke a word of English. He soon took a job clearing tables and refilling water glasses at the Erie Café, an upstart Italian steakhouse in Chicago’s River North neighborhood. Today he’s the upstart.A weathered old German restaurant on the northwest side is now Chicago's newest old-school red sauce joint.\nPhoto by Jeff MariniWhen Aucaquizhpi worked those first shifts at the Erie Café, it had just been opened by the grandson of Eugene (Gene) Michelotti, the onetime dishwasher, bartender, and first-generation Italian immigrant cofounder of Gene & Georgetti. Haunted by decades of canoodling mobsters, politicians, and celebrities, G&G was Exhibit A for the city’s (even then undeserved) reputation as an expense-account convention feedlot. Located just a half mile from G&G, the Erie Café put a new spin on the old vibe, but still featured the same Italian-American steakhouse standards: thick chops, saucy pastas, mussels marinara, and the iconic “garbage salad,” a mountain of chopped iceberg, salami, cheese, and shrimp.It was a matter of months before Aucaquizhpi was plating those salads and working the pantry and sauté station. He was making more money than he’d ever seen and helping his father, a Gene & Georgetti dishwasher, make rent and bring his mother and siblings to the U.S. Life was good, so in 1997 when the call came from Gene & Georgetti executive chef Mario Navarro, he hesitated. The restaurant was expanding its second-floor dining room to accommodate the overflow of no-names, and Navarro needed cooks. (Sidenote: In 23 years I’ve been seated in the coveted downstairs dining room exactly once—at three in the afternoon in an otherwise empty restaurant.)Navarro remembered when Aucaquizhpi was new to town and came in one night to help his father work a large private party held in honor of a prominent local racketeer. He “just stood by with the bus pans and looked at me because I was too strong in my voice calling the orders,” Navarro says. “Arturo was shaking. He’d never been in a kitchen.”But after four years at the Erie Café, it was an easy transition. Navarro, who’d started at Gene & Georgetti in 1976, saw something in the young cook. “He worked with me 15 years,” he says. “He’s the only kid I teach everything I know, because I know he loves to cook. I said, ‘Arturo, when I’m retiring, you gonna take my place.’”It didn’t hurt that after Aucaquizhpi mastered the 60-plus dishes on G&G’s menu, he’d taken a prep shift at nearby Piccolo Sogno and learned how to butcher whole animals, stuff a mean porchetta, and make fresh pasta. “He wanted to learn the Italian kitchen a little better,” says Piccolo Sogno’s chef, Tony Priolo. “And I learned from him. He’s a hardworking guy.”Aucaquizhpi drew on that training to make his own imprint on the menu at Gene & Georgetti, introducing fresh-rolled cavatelli in vodka sauce. Meanwhile, after 36 years in the kitchen, Navarro (now living the sweet life in Puerto Vallarta), was getting ready to take a bow. “I said to the boss, ‘I am retiring. Arturo’s ready.’”“It’s no simple feat to be in the kitchen at Gene & Georgetti when 600 people go through that restaurant on a Saturday. [Aucaquizhpi’s] got his eye on every steak,” says Michelle Durpetti, whose father—in a typically knotty Italian-American family tie—married Gene Michelotti’s daughter and later bought G&G from his mother-in-law. “And still he took the time to learn how to make pasta.”While Aucaquizhpi took over the ordering, butchering, and expediting, not many knew he had his eyes on another prize. “I wanted something for myself,” he says.“He secretly opened his own place and surprised everybody,” Priolo says. Aucaquizhpi scouted locations for a year before he found one in his own northwest side neighborhood when the owner of the Mirabell, a weathered old German restaurant, was desperately looking to sell.The Italian steakhouse tradition continues.\nPhoto by Jeff MariniSituated a block from the expressway that bisects the city, and at the bottom edge of the sleepy working-class Irving Park neighborhood, Mirabella is in no part of town Sinatra ever hung around. Aucaquizhpi replaced the collection of gaudy ceramic beer steins with wine bottles and drew on his network of first-generation immigrant friends and family who’d paid their dues in many of the same kitchens he had. His brother Ernesto is a server, along with his brother in-law Manuel. His wife, Maria, busses tables on weekends, and his dad, now retired, occasionally lends a hand with the dishes. His manager is 76-year-old Eddy Chiqui, a fellow Ecuadoran who served for 31 years in the front of the house at Sabatino’s—another Chicago Italian-American icon—until it closed last winter.Mirabella opened in the dead of winter two-and-a-half years ago to little fanfare, and the first few months were grim. But after word got out that that a Gene & Georgetti vet was executing a similar menu—at significantly lower prices with none of the crusty attitude—the tables started to fill.Chiqui, who attends the same church as Aucaquizhpi, brings a sense of downtown gravitas (and a loyal following) to the proceedings, greeting guests in the small front barroom in a sharp black tuxedo. Sinatra and Buddy Holly are on the soundtrack, and plates of grilled calamari and chicken Mirabella (the north side analogue to chicken alla Joe) are flying out of the kitchen.Aucaquizhpi is building slow. There’s money for a paint job this spring, and Chiqui is planning to revive the performative tableside baked Alaska and bananas Foster service that transfixed me many evenings at Sabatino’s. As word spread, even some of Aucaquizhpi’s old downtown customers have come through, often dangling the promise of capital infusions to build a new kitchen or hire another cook. But the chef politely turns them down. “I come from the bottom,” he says. “I know how hard it is working when you start at the bottom. Nothing comes free. I’m so happy because I’m not working for nobody.”Mike Sula has been a food writer at the Chicago Reader since 2001. He is also the senior editor for Kitchen Toke, the magazine of culinary cannabis.Explore Bon AppétitRestaurantsItalian AmericanRed SauceChicagoRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Mike Sula"]}