{"id": "f16df799c349f966e0f4b25c1e8ff606", "url": "https://www.bonappetit.com/story/the-french-dispatch", "year": 2021.0, "month": 11.0, "day": 3.0, "content": "In 'The French Dispatch,' the Drinks Are the Real Stars | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Drinks Are the Real Stars of Wes Anderson’s Latest FilmTilda and Timothee may lead the cast of The French Dispatch, but it’s the coffee, cocktails, and glassware that really shine.By Jenna Adrian-DiazNovember 16, 2021FacebookTwitterEmailPhotograph courtesy of Searchlight PicturesFacebookTwitterEmailThe writers and editors in the French Dispatch, the new Wes Anderson film about a fictional magazine in ’60s France, love a drink or few (as people working in media usually do). In an opening scene, a server from a street café scales five flights upstairs to the Dispatch offices to deliver a tray full of aperitifs, absinthe, dry white wine, a cola, and an affogato to the editors’ planning meeting. (If you’re wondering why the café server is delivering drinks directly to them, there isn’t really a reason. Like the wine bottle’s label literally reading “Vin Blanc Sec,” it’s typical Wes Anderson quirkiness.)The film follows the staffers of the Dispatch through a series of flashbacks as they discuss stories they’ve written about their time in the fictional French town of Ennui-sur-Blasé. In all but the final story, the characters barely eat or even look at food. But they sure drink like fish, and these libations fill some of the film’s most fun and beautiful scenes. It’s a deeply rewarding watch for aesthetes with a penchant for glassware and great storytelling. Here are three scenes where the drinks steal the show.The Champagne jailbreakA carefully orchestrated party is undone by...Champagne. Incarcerated artist Moses Rosenthaler (Benicio Del Toro) debuts his newest and most ambitious work at a party held in one of his prison’s rooms. A string trio, caterers, and art collectors, dealers, and brokers from around the world all sneak into the prison just for the party. There, they down Champagne (but no food; it’s an art world party, after all). When the artist’s broker, Julian Cadazio (Adrien Brody), realizes the invaluable fresco, painted directly onto the walls of the prison building, can’t actually be sold to anyone, he angrily throws Champagne at Rosenthaler’s painting. The two start fighting as would-be buyers look on. Then dozens of prisoners who have been denied bribes to keep said party secret storm the scene. Champagne bottles fly, delicate crystal coupes shatter to the floor, mayhem ensues, and, honestly, it’s one of the most fun and carefree moments in the movie. Would it be as funny if carafes of water and plastic cups stood in for the bottles of booze and coupe glasses? Probably not! The theatricality and excess are what make the scene.Photography courtesy of Searchlight PicturesThe revolution will be hydratedDisaffected student protestors gather and debate in the Cafe Sans Blague. The café is described by one writer (named, of all things, Herbsaint Sazerac and played by Owen Wilson) as a neighborhood hangout where “hungry, restless, and reckless” students gather. For students described as hungry—at least in the abstract sense—it’s funny that we never see them actually eat there. Instead, the café is nearly bursting with students debating over drinks. Boys try to one-up each others’ arguments over coffees, and beers that look warm and flat sit in front of girls who are more captivated by the debates taking place around them. A cola rests by a teetotaler who sits quietly while taking in the scene. A carafe of white wine on a table gathers condensation. It’s these drinks that bring the students together and empower them to express their shared discontent (with Ennui's local government, their university, adults in general—the usual things that aggravate newly disillusioned youth the most).The amber Easter eggAn easily missed shot of the walls in the Cafe Sans Blague rewards eagle-eyed viewers with some insight on all the sips throughout the film: Posters advertise the yellow-orange aperitif from the opening office scene as “Ambre Aperitif”—amber aperitif, thanks, Anderson; a Chablis that’s shown on other posters all over Ennui; and absinthe that we see poured into the same kind of thimble-size etched crystal glass for different characters at different times. It’s sheer aesthetic delight for detail-oriented design obsessives. And the abundance of drinks feels like a cheeky nod to Parisian dietary tropes (our creatives quite literally live in Ennui, barely eat, and seem to subsist on coffee and wine).But as new characters, storylines, and settings appear and, at times, overwhelm, these drinks-as-signposts provide a comforting sense of connection to the material you may have forgotten or overlooked. Critics have noted that Anderson’s films mix references and symbolism in a way that re-creates the experience of reading a story. Discovering these Easter eggs feels a lot like the joy of resurfacing a seemingly unremarkable phrase from the first few chapters of a novel as disparate parts of the plot come together in its final pages. In the same way I reread my most beloved books, I look forward to revisiting The French Dispatch—aperitif in hand.Explore Bon AppétitCultureMoviesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-16", "author": ["Condé Nast", "Jenna Adrian-Diaz"]}