{"id": "f1a69539a9d93e3180b3b9432eb0c76e", "url": "https://www.bonappetit.com/story/wanda-otero", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Vaca Negra Founder Wanda Otero Is Making a New Kind of Puerto Rican Cheese | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWanda Otero Is Making a New Kind of Puerto Rican CheeseThe microbiologist-turned-cheesemonger is the founder of Vaca Negra.By Tia KeenanApril 26, 2018FacebookTwitterEmailIllustrations by Annalee SoskinFacebookTwitterEmailWhen dairy farmers suffering from Puerto Rico’s 2006 debt crisis offered to barter fresh milk in exchange for industry-mandated lab tests, microbiologist Wanda Otero decided to turn it into cheese.At the time, Otero owned a small microbiology laboratory in Carrizales, in the rural Hatillo province on the northern coast of the island. She had previously worked as a microbiologist for a large dairy company in the capital of San Juan, but after having children, she relocated to the island’s main dairying region, where she says “there are more cows than people,” to work directly with local farmers.Her clientele were primarily women: small-scale dairy farmers who relied on her lab for testing bacteria and antibiotic levels to qualify their milk for sale to a processing plant. If they couldn’t afford certification, they couldn’t sell milk, and without sales, there was no income. “The lady farmers owed us a lot of money. They couldn’t afford our services. I couldn’t say ‘no, I can’t help you.’ I had to think of something to do,” says Otero.So she set to work in her kitchen, pouring her passion for the people and land of Puerto Rico into cheese research and development. Otero modeled her experiments after European classics, like Gruyère, Manchego, and Cheddar. She eventually settled on five styles, named for the pastures, barrios, and landmarks where the cows who supply the milk graze: Capaez, Ausubal, Monserrate, Montebello, and Cabachuelas (after the “Cabachuelas de Morovis,” a vast network of caves vital to the indigenous people of Puerto Rico).Otero soon distinguished herself as the only cheesemaker on the island specializing in aged cheeses (traditionally Puerto Rico produces young cheeses like queso blanco, while aged cheeses are imported from Europe). She named her burgeoning brand Vaca Negra (Black Cow), after a hybrid breed common in the area: a mix of Holstein (those canonical black and white beasts of American dairying) and a local black bull bred mainly for beef. Otero says these uniquely Puerto Rican vacas negras “give less milk [than Holsteins] but are better for cheese making.”Almost from the start, her raw milk aged cheeses, with their clean, terroir-driven flavors, were enthusiastically received. Otero opened a facility where she could sell her products and educate visitors about cheesemaking through tours and tastings. Today, visitors can make their own wheels of cheese, customized with herbs and stamped with their names on the wheel. After two months, they can either return to retrieve their finished cheese or have it shipped to them at home.One of the biggest challenges for Vaca Negra is price: European imports, with their government subsidies and supportive infrastructure retail for less than Otero’s aged cheeses. “Making cheese in Puerto Rico is just more expensive,” says Otero, who cites the lower milk production of the island’s cows, who produce a little more than half of what the average dairy cow on the mainland produces due to the heat and humidity. “Cows are not for the tropics,” laments Otero.Vaca Negra’s cheeses are a natural fit for the moneyed consumers of San Juan, who have access to the cheeses in both retail and restaurants. But the rural locals struggle to afford the cheeses made in their own community. Otero now makes an affordable kefir-style drinkable yogurt, in flavors like piña colada, coconut, and sweet papaya. These have done well with locals and are sold in supermarkets throughout the island, providing an accessible, high-quality, reasonably priced product (about $6 a liter) while providing cash flow for the business.As Vaca Negra settled into its groove as a sustainable, diversified small company, Hurricane Maria struck in late 2017, leaving the facility without electricity for over a month. “We were spending our days looking for fuel to run the generators,” says Otero, who was able to save the more than 2,000 pounds of cheese she had aging at the time. But in the aftermath, yogurt production ceased immediately. “At the farm level, our suppliers kept production, but nobody could buy milk. The milk plant couldn’t reach the farms with their tankers. Most dairy farmers were just discarding it,” say Otero. “Some of them gave us milk and as soon as we could turn on machines and we made some cheese. Not as much as I wished, but we made some.”The physical structures of Vaca Negra were relatively unscathed, and in March 2018, Otero was finally able to reach pre-Maria production levels. Still, life for this cheesemaking pioneer means existing in recovery mode. Just a month later, in mid-April, the entire island once again lost all electrical power.The instability of critical infrastructure remains a challenge for travel and tourism on the island, which supports a vast number of jobs (nearly 7% of Puerto Ricans are directly or indirectly employed by the travel and tourism industry, according to the World Travel & Tourism Council). The industry is recovering post-Maria, but it’s still down nearly 8.5% from last year. “We need people to buy our cheese online, to visit Vaca Negra, and to talk about our products,” says Otero.  “Puerto Rico needs visitors so our economy can recover. Please, bring all your friends,” she offers, both as a hospitable invitation to learn more about her groundbreaking work, and as a plea for the people, places (and cheese) of the island.Want more cheese content? Yeah, you do.Explore Bon AppétitHealthyishPuerto RicoCheeseprofileCheese WeekPuerto RicanRead MoreLifestyleWhat IS Nut Cheese, Exactly, and Can't We Call It Something Else?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-26", "author": ["Condé Nast", "Tia Keenan"]}