{"id": "f1a72eb1856613e975820ae180d303ed", "url": "https://www.bonappetit.com/recipe/blistered-asparagus", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Blistered Asparagus with Peanut-Coconut Sprinkle Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueBlistered Asparagus with Peanut-Coconut SprinkleBy Claire SaffitzApril 17, 20185.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintCooking asparagus hot and fast in a skillet develops their delicate flavor without overcooking. Tossing them in a light soy dressing with crushed peanuts and shredded coconut adds a subtle but addictive crunch. If your asparagus has very thick stalks, peel the bottom third after snapping off the ends.Ingredients4 servings2Tbsp. vegetable oil12oz. asparagus, trimmed1Fresno chile, seeds removed, finely chopped2Tbsp. soy sauce1Tbsp. fresh lime juice1tsp. honey1tsp. toasted sesame oil1tsp. finely grated peeled ginger2Tbsp. crushed salted, dry-roasted peanuts2Tbsp. toasted unsweetened shredded coconutPreparationStep 1Heat oil in a large skillet over medium-high. Cook asparagus, tossing often, until stalks are bright green, blistered in spots, and tender, about 5 minutes. Season with salt and transfer to a platter.Step 2Stir chile, soy sauce, lime juice, honey, sesame oil, and ginger in a small bowl to combine. Mix in peanuts and coconut and spoon over asparagus.How would you rate Blistered Asparagus with Peanut-Coconut Sprinkle ?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleDelicious, quick to make, healthy too!  My family really enjoyed this dish.WesleyBethesda, MD4/7/2021Looks very inspiring. I am trying it for lunch.AudeRadnor , PA12/1/2020I made this as is except I added 1/2 tsp sriracha for the fresno chili- I haven't seen this chili at my local markets- and I topped it with 3 tbsp toasted macadamia nuts instead of peanuts and shredded coconut. I sautéd the asparagus in my cast iron with 1/4 tsp veggie bouillon. I really enjoyed the mix of ingredients in the sauce. The lime juice gave this a pleasant acidic punch and the honey rounded it out with a bit of sweetness. My husband said, \"let's do this again.\"J. OngAstoria, NY5/12/2018Explore Bon AppétitAsparagusVegetablePeanutNutCoconutFruitSpringQuickEasySideVegetarianDairy-FreeHealthyishFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Claire Saffitz"]}