{"id": "f1bf4fc645e1d4efe9b6ebd4840f2231", "url": "https://www.bonappetit.com/story/on-kobe-and-dinner", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "With Grief Comes Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWith Grief Comes FoodOn Kobe, and dinner.By Adam RapoportJanuary 28, 2020FacebookTwitterEmailPhoto by Alex Lau, Styling by Andy BaraghaniFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I had a whole other newsletter written and ready to go yesterday, but then I heard the Kobe Bryant news. I was poking around a bakery with my wife and son, and I got a text from Simone’s cousin, Tony.“Kobe…Can’t be trueF*#%F*#%”I googled what I feared and found the initial reports, prior to ESPN or The New York Times confirming the story. I then told my 12-year-old son the news. Even though Marlon’s not much of an NBA fan, he knew all about Kobe—of course he did. But he couldn’t wrap his head around the accident. He kept asking questions about what exactly happened. As if he was trying to find a way to poke holes in the story to make it un-happen.Later in the afternoon, when we learned that Kobe’s 13-year-old daughter Gianna was on the helicopter with him, things only got sadder. But when it was time for dinner, we were still going to cook. And we would sit down at the table, my wife, son, and I, and we would talk about what had happened.Want this letter before it hits the website? Sign up for our newsletter!Sweet, salty, and slightly spicy maple-roasted carrots.\nPhoto by Chelsie Craig, Food Styling by Dana BonaguraPart of me feels ridiculous writing a recipe newsletter hours after learning about the passing of such an iconic figure. But food is always what brings us together, especially in times like this.When my father passed away in 2012, my brother, sister, mom, and I met at the train station in Hudson, NY, and we immediately found our way to the corner bar for lunch. We weren’t about to sit in a room and talk about our father’s passing without a meal in front of us. We’re Rapoports—it’s what we do. And I imagine any number of families would have done the same thing.So last night, as I stood in our kitchen, I tried to process the death of an athlete who I struggled with as a fan—he was a relentlessly driven and talented player, but also often a selfish one who irked some basketball purists. (And, of course, there was an off-the-court issue that tainted his career.) But I rarely considered him as the proud, committed father of four girls, who was boldly exploring a post-NBA life with the same fearless drive he applied in his playing days. As I worked through all this in my head, I methodically got to cooking. Nothing fancy, but food that would comfort us on a bleak Sunday night. I made Andy Baraghani’s ginger-scallion ramen noodles and some maple-roasted carrots.Maybe I over-salted the ramen. Maybe I need to reconsider Kobe, the person and the athlete. Sometimes you don’t know you care until you do.Explore Bon AppétitAdam NewsletterRead MorecookingTofu That’s Crispy and Glazed All at the Same TimeBy Adam RapoportcultureIt’s Not Easy Being Green—But We’re TryingBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-28", "author": ["Condé Nast", "Adam Rapoport"]}