{"id": "f1c533d256e03540dad75471aa299a8b", "url": "https://www.bonappetit.com/story/braisey-chicken-legs-in-coconut-milk", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "These Braisey Chicken Legs in Coconut Milk Are Almost Too Easy to Make | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Braisey Chicken Legs in Coconut Milk Are Almost Too Easy to MakeThere's no searing or chopping. You barely need a knife!By Chris MoroccoDecember 14, 2018FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling Michelle GattonFacebookTwitterEmailLike Coco Chanel removing one element of her outfit before stepping outside, sometimes you need to simplify a recipe before sending it into the world. When you're developing, it’s easy to keep adding ingredients, but it's much harder to take away. This braised chicken legs recipe gets rid of as many ingredients and techniques as possible without compromising on flavor. The secret to the simplicity lies in one crucial variable: Time spent in the oven.An hour plus in the oven might sound like a long time for a weeknight but hear me out. Chicken legs are full of fat and connective tissue and benefit from long, slow cooking. In fact, I much prefer the braisey, shreddy texture they get when slowly cooked in liquid to the bouncy, cooked-but-still-not-fully-tender texture they have when part of a whole roasted chicken, where the cook time has to account for the danger of overcooking the breasts. So I took away as many barriers as I could and got this dish into the oven as quickly possible.There is no searing or chopping. You frankly barely need a knife. The key is to just combine the coconut milk and curry paste (Maesri is our favorite brand) before adding the lemongrass (which is totally optional by the way), ginger (less optional), garlic (not optional). Then lay the seasoned chicken legs in the pan, turning them to coat them in the coconut milk, and get them in the oven.As they roast, the luscious creaminess of the coconut milk and the chicken’s richness combine and reduce to create a dense, flavorful sauce that begs for rice or bread. Don’t be concerned if the coconut milk breaks and starts to look a bit oily; that may happen depending on the brand of milk you use, and honestly there is nothing more delicious in the world so well done, you.Aside from spooning some of the juices over the chicken a couple times during baking, you're free to go about your life while the chicken bakes. You will know it's done when the leg joint flexes somewhat easily and the skin is nicely browned. Top it with cilantro, maybe a squeeze of lime and some toasted coconut chips (have you tried Dang brand coconut chips? They have earned that name IMHO). The best thing about this dish is that it tastes way more complicated than it actually is. If you don’t have an ingredient or forgot to add something don’t worry, Coco would be proud.Easy, braisey, beautiful:Coconut Milk–Braised Chicken LegsNo searing! No chopping! One baking dish!View RecipeAll products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishChickenCoconutCurryLemongrassRead Morecooking54 Healthy Chicken Recipes That Make Us Fall in Love With Poultry AgainGallery54 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-14", "author": ["Condé Nast", "Chris Morocco"]}