{"id": "f1cd20e22b1323e99f2909bf9479165e", "url": "https://www.bonappetit.com/recipe/italian-chopped-salad", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "Italian Chopped Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesItalian Chopped SaladBy Chris MoroccoJanuary 15, 20204.2(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Yekaterina BoystovaEmailPinterestPrintEmailPinterestPrintThis winter salad with peak season chicories, salami, and crispy chickpeas is hearty enough to have on its own for dinner, but not so over-the-top that you can’t also enjoy it alongside a heftier main, like pizza or pasta. The bright, just-sweet-enough dressing tempers the bitterness of the greens and the richness of the salami for a balanced dish you just might not want to share.Ingredients4 servings1Tbsp. unsalted butter7Tbsp. extra-virgin olive oil, divided114.5-oz. can chickpeas, rinsed2small garlic cloves, dividedKosher salt3Tbsp. red wine vinegar1½tsp. honey1tsp. Dijon mustard½tsp. crushed red pepper flakesFreshly ground black pepper1head of radicchio, thinly sliced2endive, thinly sliced2½oz. sharp provolone cheese, thinly sliced, torn2oz. cured fennel salami, thinly sliced, cut into half-moonsPreparationStep 1Heat butter and 2 Tbsp. oil in a large nonstick skillet over medium-high until butter melts. Add chickpeas and 1 garlic clove; season with salt. Cook, tossing occasionally, until chickpeas are browned and crisp, 6–8 minutes.Step 2Meanwhile, whisk vinegar, honey, mustard, red pepper flakes, and remaining 5 Tbsp. oil in a large bowl to combine. Finely chop half of remaining garlic clove (discard the rest unless you really, really like garlic) and add to dressing; season with salt and black pepper.Step 3Add radicchio, endive, provolone, and salami to dressing and toss to coat; season with salt. Add chickpeas and toss again to combine.How would you rate Italian Chopped Salad?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThe dressing counters the bitterness of radicchio and it’s really just delicious. Also, sautéed chick peas are a great  who knew?! Gianna NBrooklyn NY12/8/2020Turned out great. I added fennel greens and some fried basil but otherwise left it as is. The provolone was a really good element. AnonymousBrooklyn4/26/2020I loved the idea of this recipe, but in practice I found it a little too bitter. Next time I make it (and I will) I'll add some iceberg lettuce in place of half of the radicchio. We really loved the dressing!AnonymousMontréal2/26/2020I veganized it by replacing cheese and salami with a bunch of chopped up sundried tomatos. Also added some of the tomato-oil to the dressing. It works really well together!AnonymousGermany2/26/2020I ended up eating three helpings I loved it so much.  Salami and the chickpea mix was perfection.  I will definitely add more salami next time.  I also used a soft italian monteo cheese as I couldn't find the provolone.  Will be making this again and again.AnonymousLong Beach, CA1/28/2020I had such high hopes for this recipe but it was a dud. I followed the recipe to a T. Maybe my radicchio was too large but the meal was extremely bitter and i wound up throwing it away :-( AnonymousColumbus, OH1/24/2020Whiiped it up in a jiffy to east some of my favorite foods! Added more meat took out dijon and used regular mustardHome Cook ChefUSA1/23/2020This was great! I loved the crisped chickpeas. I added some sliced black olives and 2 chopped Persian cucumbers, and I used a turkey salami from Trader Joe’s. My fiancé actually applauded after we finished eating, he liked it so much.AnonymousPortland, OR1/21/2020Made this tonight and it was fantastic. Followed the recipe exactly. Wasn’t sure if I should chop the garlic with the chickpeas or leave it whole (I left it whole). I’ll make this again!AnonymousBrooklyn, Ny1/17/2020Explore Bon AppétitSaladItalian AmericanAmericanRadicchioChicoryLeafy GreensVegetableEndiveSalamiCured MeatMeatChickpeaBeanWinterQuickEasyWeeknight MealsMainSideGluten-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-14", "author": ["Condé Nast", "Chris Morocco"]}