{"id": "f1d30076e55e271317c1ac53d162b97c", "url": "https://www.bonappetit.com/recipe/peanut-rice-noodles-with-pork-and-collard-greens", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Peanut Rice Noodles with Pork  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssuePeanut Rice Noodles with Pork and Collard GreensBy Chris MoroccoJuly 10, 20184.9(51)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThis one goes out to all the peanut sauce fans out there. And if you’re thinking, Peanut butter and pork? Sounds crazy! Trust us, it works. Also trust us on this: Putting sugar in your noodles for this recipe is crucial. It balances the salt, heat, fat, and tanginess going on here, and brings out the flavors of everything else (nope, it doesn’t make anything sweet).Ingredients4 servings Kosher salt12oz. regular-width rice stick noodles¼cup smooth natural peanut butter¼cup soy sauce2Tbsp. unseasoned rice vinegar1Tbsp. sugar2tsp. crushed red pepper flakes1Tbsp. vegetable oil1lb. ground pork11½\" piece ginger, peeled, cut into matchsticks4garlic cloves, thinly sliced1bunch collard greens, ribs and stems removed, leaves thinly slicedPreparationStep 1Bring a large saucepan of salted water to a boil. Remove from heat; add noodles. Let sit, stirring occasionally, until al dente, about 4 minutes (time may vary by brand). Drain and rinse under cold running water.Step 2Meanwhile, whisk peanut butter, soy sauce, vinegar, sugar, red pepper flakes, and 1 cup water in a medium bowl. (Sauce will look a little broken and lumpy.)Step 3Heat oil in a large skillet over medium. Cook pork, breaking up with 2 forks, until nearly cooked through, about 5 minutes. Add ginger and garlic; cook, stirring, until softened, about 3 minutes. Add collard greens and cook, stirring occasionally, just until wilted, about 2 minutes. Add sauce and noodles and bring to a simmer; cook, tossing occasionally, until sauce is reduced by half and coats noodles, about 3 minutes. Season with salt.How would you rate Peanut Rice Noodles with Pork and Collard Greens?Leave a ReviewTell us what you thinkReviews (31)Back to TopTriangleI rated this recipe three years ago and so much has happened in the interim and am still making it! It has become my “clean-out-the-frig before CSA pick-up “ recipe. Any and all crisp veggies work in it as do any of your favored proteins. I have a batch in the frig often - usually made with veggies only - great reheated or cold. Toss cold noodles with even more chopped fresh greens for a wonderful salad - that was dinner last night. I finally found a great brown rice rice noodle and that completes the recipe by adding whole grains. Make it today - the method is absolutely fool-proof. Used to make it for friends but now they are all making it too. AnonymousMidwest1/23/2022I have made this several times , once wit collard greens, another time with kale.  I use light soy sauce  last night used kale and shrimp instead of pork.   it was delicious.   I aded shrimp at the very end so not to get tough.   Anonymousstaten isand ny12/15/2021To Jane -\n\nWhile we're on the topic of ignorance, 1) too much sodium  does not CAUSE high blood pressure, excess sodium is only contraindicated in those with pre-existing hypertension. In normotensive individuals, our body's renal sodium-handling mechanisms are just fine, thank you; and 2) If you never bothered to try it, how do you know it's too salty? I used the recipe as stated, and it was by no means over-salted, meaning that 1/4 cup soy sauce is not excessive at all. Please try things, and get your science right, before virtue-signaling.AnonymousToronto, CA8/14/2021Did not bother to try. 1/4 C of soy sauce? How ignorant. Too much sodium causes high blood pressure, which can lead to stroke. Coming from Asia, I have taste buds that love Chinese cooking, but my head knows 1/4 C of soy sauce is just too much.JaneNashville TN5/4/2021made with ground turkey - easy & delicious! YasmineToronto, ON4/23/2021Tried this with ground turkey and it was delicious. Will definitely make it again.AnonymousToronto, ON2/18/2021This is a family favourite! I make it pretty frequently as it comes together quickly and is super delicious. I add Hoisin sauce at the end, as well as like juice. Cilantro and scallions are a nice finishing touch as well! I also don’t measure out the ingredients and just go by taste and consistency. It’s a hard one to mess up! Kale and Swiss chard sub in nicely as well. thisishailstormToronto10/10/2020It was good. I added extra soy sauce near the end because it was a bit bland following the original instructions. I use a Thai soy sauce. Also one review said \"use a higher quality Asian noodle like udon\", udon is not \"higher quality\" it is simply different.cplusplusSeattle10/5/2020Sooo good quick and easy weeknight meal. Second time I’ve made. This time used spaghetti instead of rice noodles and Tuscan kale instead of collards because it’s what I had. Added a teaspoon of Chinese five spice when cooking pork. Used 1 cup of hot pasta water in the sauce which helped break up peanut butter. Topped with scallions and cucumber. You don’t need to brown the pork in oil- it has enough fat to brown without sticking. Caitlin0Brooklyn9/11/2020Wonderful recipe I keep coming back to.\n\nI like to decrease the noodles and increase the veg, adding julienned red pepper and grated carrot. Garnishing with fresh lime juice, Bragg soy sauce, green onions and cilantro makes it extra delish. This time I used tofu instead of pork. Still a winner! YumlovePeterborough, Ontario 5/18/2020Great and easy recipe. Good flavor. It almost comes out creamy. cbruett5/14/2020Great recipe and super easy to follow. Get some higher quality Asian noodles like udon to take it to another level.  You can definitely leave out the sugar (there's enough in the peanut butter), and the dish can easily absorb twice the amount of greens if you so desire.  AnonymousBrooklyn4/16/2020Hello! I did this with jasmine brown rice and spinach instead of noodles and greens. I really liked it! I also used rooster sauce instead of pepper flakes and my pork was left over carnitas. It just turned out so well. I made enough for lunch too. It is savory and not sweet. I took the advice to add more peanut butter. hahahaha I barely made it as is, but it would be yummy as is too, this is just what I had during the quarantine. AlizabethSan Francisco4/2/2020Delicious weeknight meal. Have tried subbing tofu for pork as a veggie option and it was still quite tasty. Anonymousarlington, va 1/14/2020Amazing!  I used Udon noodles because it was all I had and tossed the cooked noodles with 1 tsp of sesame oil and kept them warm while finishing the dish.  I increased the peanut butter and soy sauce to 1/3 cup and the vinegar to 3 tbsp.  I reduced the chilies to 1 tsp because my husband doesn't like food too spicy, but I just added a little cholula to my serving.  I garnished with a little sliced green onion and sesame seeds.  Delish!  And so quick and easy... Only made enough for 2, 3 at most, though.AnonymousOttawa, Canada1/4/2020Explore Bon AppétitRice NoodleNoodlePasta & NoodlesPeanut ButterCondiments, Sauces & PastesCollard GreensLeafy GreensVegetableGround PorkPorkMeatEasyWeeknight MealsOne-Pot MealsMainDairy-FreeHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Chris Morocco"]}