{"id": "f1da1c4604358733c5d025cfdfa87986", "url": "https://www.bonappetit.com/story/top-10-beach-snacks-according-to-me", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "Top 10 Beach Snacks According to Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTop 10 Beach Snacks According to MeSex is cool, but have you had a BLT on the beach?By Carla Lalli MusicAugust 22, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The new thing this week is for everyone to start complaining that summer is almost over. I’m not here to disagree. I’m a pessimistic-realist, so summer started being over for me right after Memorial Day. It became an urgent concern when we were planning our 4th of July menu, and now that my mid-August birthday has passed, it’s a national emergency.The only thing left to do is cancel all of your commitments, cash in your remaining vacation days, go AWOL on adult responsibilities, and hightail it to the beach. Or the lake, or the riverbank, or a ding-dang swimming hole. I’d personally get to the beach a lot faster if I wasn’t so obsessed with packing the perfect things to eat while I’m there, but I take a lot of pride in my beach snacks. Here are my 10 favorites, ranked for your countdown pleasure.10.) Cold watermelon is amazing and perfect. The triangular wedge is classic, but I really love to remove the rind and cut the flesh into fat planks before packing them into a quart container. Pro tip: bring lime wedges and a tiny jar of salt for seasoning al fresco.9). Peanut butter and jelly sandwiches are compact, tidy, and get exquisitely squishy when packed ahead of time. I’m an untoasted whole-wheat pullman, crunchy peanut butter, mixed berry jam person, with a sprinkle of salt before closing them up, and a diagonal cut obviously.Want this letter before it hits the website? Sign up for our newsletter!8.) Cucumbers on ice are so nice. Thank our own Amiel Stanek for this one.7.) Ham and cheese on a baguette. Good butter, good ham, good bread—good choices.6.) Frozen grapes. Sorry not sorry. Put them in an insulated container so they stay icy for many hours and don’t you dare criticize me until you’ve tried it.5.) Ice coffee shakerato in a to-go cup. This recipe in this vessel. Lots of ice. Shakey shakey every time before you take a sip.Christopher Testani4.) BLTs with sriracha mayo, and a slab (not a shred!) of iceberg lettuce. Toasted white bread. Good tomatoes. Don’t sleep on this one—find your spot, set up the blanket and umbrella, go for a quick dip, and consume immediately.3.) Grain salad + spork. I like wheat berries with sliced jalapeños, slabs of feta, diced cucumber, lots of chopped herbs, coarsely chopped toasted almonds, and a super-lemony vinaigrette.2.) Chips. It’s a tie between Kettle Brand salt and vinegar and Cape Cod original.1.) A perfect peach. I know—painfully romantic. But there’s no better time than right now, and the water is right there for rinsing off when you’re done.Explore Bon AppétitCarla NewsletterRead MorerestaurantsRockaway Beach Bakery Is the Real Reason I Go to the BeachBy Chris MoroccocultureThis Is the Only Folding Chair I Want at the Beach This SummerBy Amiel StanekLifestyleThis Water Bottle Keeps EVERYTHING Icy ColdBy Aliza AbarbanelcultureThis Vintage Wine Cooler Is My Ultimate Summer AccessoryBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-22", "author": ["Condé Nast", "Carla Lalli Music"]}