{"id": "f1e93bdb4fc8361783757bacf9dbf764", "url": "https://www.bonappetit.com/recipe/date-night-pork-chop", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Date Night Pork Chop Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueDate Night Pork ChopBy Claire SaffitzJanuary 22, 20184.4(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's Bridge, styling by Molly BazEmailPinterestPrintEmailPinterestPrintRubbing a little honey across the surface of the pork before searing guarantees a shiny, caramelized crust. Pair that with a lemony endive and apple salad, and you've got the ultimate dinner for two.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketPaper Towels$13.45 At AmazonPlate$55 At Bon Appétit MarketTongs$13 At AmazonVegetable Peeler$10 At AmazonCast Iron Skillet$30 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonMedium Bowl$17 At AmazonInstant-Read Thermometer$35 At ThermoworksIngredients2 servings1lb. bone-in pork loin chop, 1–1½\" thickKosher saltFreshly ground black pepper1oz. Parmesan3Tbsp. raw unblanched hazelnuts1medium shallot1large or 2 small Belgian endive2½tsp. honey, divided4Tbsp. extra-virgin olive oil, divided1lemon1small Pink Lady applePreparationStep 1You want to season your 1 lb. pork loin chop (1–1½\" thick) in advance and let it sit out at room temperature (it cooks much more evenly that way). Pat chop dry with paper towels and place on a plate. Season generously on both sides with salt and pepper, turning with tongs; set aside while you do your prep (it can sit at room temperature up to 1 hour, but prep won’t take you that long).→  Leaving meat on the counter freak you out? Read this.Step 2Shave 1 oz. Parmesan cheese with a vegetable peeler, then use your fingers to break into small shards. Cover with a damp paper towel (to prevent it from drying out).Step 3Using the bottom of a medium skillet, preferably cast iron, smash 3 Tbsp. hazelnuts, a few at a time, on a cutting board, breaking into bits.Step 4Peel 1 shallot, then finely chop.Step 5Separate leaves from 1 large or 2 small endive, trimming from the bottom as you work your way to the core. Place in a medium bowl, cover with damp paper towel, and chill until ready to use.Step 6Preheat skillet you used to smash hazelnuts over medium heat. Drizzle ½ tsp. honey over one side of pork chop, then drizzle with 1 Tbsp. oil. Rub with clean hands all over surface of chop, then turn and rub second side with same honey-oil mixture to evenly coat (this will help the pork caramelize as you cook it).Step 7Lay pork in skillet and cook, leaving it be, until first side is dark brown and caramelized all over, about 3 minutes. Turn and cook second side until browned, about 3 minutes longer. Turn pork chop upright and hold on its side with tongs to sear fat cap; cook about 2 minutes.Step 8Turn heat to low and cook chop another minute on both sides. Transfer to cutting board and insert an instant-read thermometer into middle of chop, about ½\" from bone. It should register about 130°. If it’s under, cook another minute or two, then let rest on cutting board 5–10 minutes. Remove skillet from heat.Step 9Add hazelnuts and 2 Tbsp. oil to skillet. Cook over medium-low heat, stirring with tongs, until hazelnuts turn golden, about 3 minutes.Step 10Add shallots; season with salt and pepper. Cook, stirring often, until shallots are softened and browned and hazelnuts smell toasty, about 2 minutes.Step 11Stir in remaining 2 tsp. honey. Cut 1 lemon in half and squeeze juice from one half into skillet. Stir to combine, then remove from heat.Step 12Cut around core of 1 apple, removing flesh in 3 lobes. Thinly slice 2 of the 3 pieces, then snack on the remaining piece if you like.Step 13Remove bowl of endive from refrigerator and add apple and cheese; season with salt and pepper. Drizzle with remaining 1 Tbsp. oil, squeeze second lemon half over, and toss to coat.Step 14Cut bone away from chop and cut meat into ½\"-thick slices. Place pork and bone on one side of a large plate and pour juices over; season with salt.Step 15Gently arrange salad next to chop. Spoon shallot-hazelnut mixture over salad and pork and serve.How would you rate Date Night Pork Chop?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThis is one of my honest-to-god favourite dishes. Honestly it's mostly because of the salad. The first time I made it I used just lettuce because I couldn't find endives and it was really nice, but with the bitterness it just marries so well. Yes hazelnuts are a splurge, but come on, it's date night. If it's this or a steak, I'd say this is better bang for your buck. And it makes you look so damn sophisticated.Saul KurzmanDevon1/30/2022This recipe is AMAZING and I don't know why it doesn't get more love.  The hazelnuts are a bit of a splurge, but they're so worth it, and you can just keep the leftovers in the freezer for next time!  The parmesan is perfection.  The shallot topping is out of this world (make sure you salt it enough so it really pops).  The salad is wonderfully crisp.  Altogether amazing.  Make this for your next date night, people!AnonymousNorthern VA4/14/2021Loved the hazelnut topping, really delicious with the meat and the salad. I'd have liked some more guidance on how to properly use the thermometer. Even though I got a correct read on the display, there were pieces of the meat that weren't cooked through near the bone.AnonymousColumbia, SC10/17/2019This is a winner. I used thick boneless pork chops, totaling 1 lb, and cooked a couple of minutes longer. Also almonds in place of expensive hazelnuts. Otherwise, followed the recipe exactly. The only element I didn't like was the parmesan. It was grainy. I might substitute goat gouda or something smoother for texture. AnonymousNew York5/10/2019Why are you recycling recipes from January 2018 to the March 2019 issue of Bon Appetit......really...no new ideas?AnonymousPortland Oregon2/27/2019I have made this twice for my husband an he loves the sauceAnonymousCentral coast California3/23/2018Explore Bon AppétitPork ChopPorkMeatEndiveChicoryLeafy GreensVegetableHazelnutNutWinterQuickEasyOne-Pot MealsMainGluten-FreeSearDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-22", "author": ["Condé Nast", "Claire Saffitz"]}