{"id": "f1f1b0eb7049cdc2218fbc9bdaf7e0ef", "url": "https://www.bonappetit.com/story/best-vegan-cookbooks", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "The Best Vegan Cookbooks, According to BA Editors | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Vegan Cookbooks, According to BA EditorsWhether you follow a strict plant-based diet or are just looking to make your meals more climate-friendly, we’ve got the cookbook for you.By Tiffany HopkinsMarch 14, 2022FacebookTwitterEmailPhotograph by Isa Zapata. Prop Styling by Stephanie De LucaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.“At the root of it, vegan food is just food: Vibrant, flavorful, fresh—making you feel good inside and out,” writes the late Jean-Christian Jury in Vegan: The Cookbook. We agree, and also think the best vegan cookbooks are really just great cookbooks—there to teach you impressive new ways to prepare the produce and plant-based pantry items you always have on deck. Whether you’re a new vegan (or a lifelong vegan looking for new inspiration), a flexitarian looking to shake up your meal prep routine, or an omnivore seeking to incorporate more whole foods into your diet, there are so many reasons to pick up one of the cookbooks below. They’ll not only help you consume your daily serving of greens and make your kitchen a little more climate-friendly—they’ll also serve as cooking inspiration whenever you need it.Provecho by Edgar CastrejónProvecho is Edgar Castrejón’s plant-based take on the delicious, vibrant Mexican and Latin American food of his childhood. With recipes like adobo mushroom tacos and chiles rellenos with creamy cashew tomato sauce, you’ll get acquainted with new ways to employ an abundance of hearty veggies (shout out to yuca and jackfruit) and dabble in the world of plant-based meats (hellooo Impossible ground beef). You’ll also find tips for making the best corn and flour tortillas of your life and pick up flavorful methods to fix up a pot of frijoles. You should know this isn’t just a cookbook for vegans—as BA contributor Alex Beggs puts it, it's a cookbook for “all-around good time eaters” and people who never saw a taco they didn’t love. —T.H.Provecho$22 at AmazonAfro-Vegan by Bryant TerryIf you’re new to following a plant-based diet, this is a great place to start. When I challenged myself to give veganism a try this past January (highly recommend!), Afro-Vegan quickly became my holy grail. Having to restructure my entire diet felt daunting, but Terry's commitment to accessibility and Black culinary heritage made preparing vegan meals easy, fun, and unbelievably delicious. Both a reclamation and a reshaping of what Afro-diasporic cooking can look like, this is certainly one of the best cookbooks for plant-based eaters—but I believe that everyone, regardless of ethnicity or diet, should have it on their shelves. —Chala Tyson Tshitundu, assistant editorAfro-Vegan$20 at AmazonVegan by Jean-Christian JuryWith almost 500 recipes from 150 countries, this might be the most comprehensive plant-based cookbook you’ll come across. Vegan is for the home cook who lingers in the grain aisle at the grocery store—barley! farro! basmati!—and enjoys playing with different types of milks and flours. It’s also for the person who wants to make tasty plant-based meals that don’t try to mimic meat-based dishes. Jury draws inspiration from a number of cuisines from around the world with recipes like herby chickpea fritters from Syria, sweet and sour yellow curry from South Africa, and braised shiitake mushrooms from Taiwan. This book will also teach you a thing or two about vegan baking (specifically, how to make a delicious vegan cheesecake). —T.H.Vegan$27 at AmazonThe Korean Vegan by Joanne Lee MolinaroWhile leafing through The Korean Vegan, you might forget it’s a cookbook and feel as if you’re reading Joanne Lee Molinaro’s memoir. She masterfully intertwines delicious recipes with intimate moments from her life, sharing how her Asian American identity has been shaped by her family’s cooking. With this cookbook Molinaro takes you by the hand and teaches you the ins and outs of Korean cuisine; you’ll learn about vegan pantry essentials and the meanings behind the names of dishes with various levels of ease and difficulty. You'll get lost admiring family photographs juxtaposed with her rich food photography style that's instantly recognizable from her famous TikToks. To me, it’s one of the best vegan cookbooks to date. —Julia Duarte, art assistantThe Korean Vegan$28 at AmazonSweet Potato Soul by Jenné ClaiborneJenné Claiborne presents vegan twists on soul food classics made—as they were from the start—using fresh, local ingredients. In Sweet Potato Soul, you’ll find plant-based dishes like “Harlem caviar” black-eyed pea salad and Creole red bean sausages as well as a wonderful selection of vegan desserts, including a Georgia pecan pie and bourbon vanilla ice cream. This book makes it easy for beginners to practice a vegan diet—and we love that it’s a great excuse to start your day with fluffy sweet potato biscuits and end it with a sip of peach sangria. As the author reminds us, this book is proof that “no matter your background, you can be vegan and still enjoy the delicious flavors of your culture.” —T.H.Sweet Potato Soul$13 at AmazonVegetable Kingdom by Bryant TerryWhen I want to think, “I’ve never thought about using that vegetable that way!” I turn to this book, where I can pick from jerk tofu wrapped in collard leaves or tempura-fried squash blossoms with eggplant-almond stuffing. Even when I don’t feel like committing to the more involved recipes, which make good project cooking, I love pulling techniques and flavors from them for easier weeknight meals. Vegetable Kingdom’s audience should be anyone who wants to expand their vegan cooking repertoire and make their beans and greens more exciting—a few pages in, and I’m out the door to the farmers market, a tote on each arm. —Bettina Makalintal, associate editorVegetable Kingdom: The Abundant World of Vegan Recipes$17 at AmazonLa Vida Verde by Jocelyn RamirezFirst, Jocelyn Ramirez started the catering business and pop-up Todo Verde in Los Angeles, using her abuelita’s recipes. Then, she wrote La Vida Verde to share all those recipes with you. These recipes—including pozole rojo, green chile tostadas, and mayocoba bean sopes—draw from traditional techniques and precolonial Indigenous ingredients like squash and corn. With this cookbook, you’ll learn to spread love through food (and make everything from cashew queso fresco to vegan coconut flan). —T.H.La Vida Verde$16 at AmazonLooking for vegetarian cookbooks with lots of vegan options? Here are 3 of our faves:To Asia With Love by Hetty McKinnonThis book is often the one I turn to when I don’t know what to make for dinner, and it’s pretty much never more than an arm’s reach away from my desk or my kitchen counter. I’m writing this right now from, quite literally, a laptop perched on top of it. Hetty McKinnon’s approach to vegetable cooking is fun, weeknight-friendly, and often adaptable (see sheet pan chow mein). The book is vegetarian, but many of the non-vegan recipes have substitutions listed out on the page for folks who don’t eat dairy or eggs. Whether its a warming dish for dinner (like mapo or cumin-spiced tofu) or a quick and nutrient-packed lunch (miso oats or sweet potato with black-eyed peas and coconut vinaigrette), To Asia With Love has been there for me more times than I can count. —Sonia Chopra, executive editorTo Asia, With Love$43 at AmazonEast by Meera SodhaEggplant katsu curry, celery and peanut wontons, brussels sprout nasi goreng, and salted miso brownies? Yes please! Okay, so Meera Sodha’s East is technically a vegetarian cookbook, but Sodha offers options for turning many of her delicious, simple recipes into vegan dishes. It’s the cookbook I find myself recommending most, and I turn to it whenever I’m having a friend over for dinner or just need a little weeknight dinner inspo. My personal favorite? The soy-and-ginger-braised tofu. I’ve already passed the recipe on to two friends just this year. —Olivia Quintana, associate social media managerEast$21 at AmazonOne: Pot, Plan, Planet by Anna JonesIn One, London-based recipe developer Anna Jones leans into the idea that eating less meat is better for the planet. Her one-dish recipes are interspersed with advice for how to properly store ingredients and use up those on their way out (did you know scones made with slightly sour milk rise higher?) so that you waste less, as well as green-living tips like how to reduce plastic use and support biodiversity. Of course, the recipes—like sticky squash and pistachio flatbreads or crispy white beans with kale, lemon, and Parmesan—are delicious enough that you’ll want the book even if eating for the planet isn’t your primary goal. While the contents aren’t entirely vegan, Jones specifies when animal-based ingredients can be omitted or substituted, and in some cases, she even gives two sets of ingredient lists and directions. Such is the case with the plush, crackly-topped chocolate, olive oil, and rosemary cake. It can be without any dairy or eggs, and the secret ingredient is…drumroll please…sparkling water. (Speaking of cake, the chocolate and muscovado fudge cake had my whole family applauding, and it’s made with coconut oil and cider vinegar, no eggs required.) Like most Anna Jones books, I find that the more willing you are to trust your own intuition and taste as you go, the more success you’ll have—some recipes have great bones but need a little nudge to cross the finish line. Regardless, there are enough intriguing ideas and flavor combinations—like muhammara crossed with chickpea stew and dal baked with a lid of tamarind-glazed sweet potatoes—to keep me feeling inspired for years. —Sarah Jampel, senior cooking editorOne: Pot, Pan, Planet$25 at AmazonExplore Bon AppétitShoppingBooksCookbooksGift GuidesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-14", "author": ["Condé Nast", "Tiffany Hopkins"]}