{"id": "f1f58bce803bfc32e154f0a3878874ac", "url": "https://www.bonappetit.com/story/what-you-eat-matters-where-it-comes-from-matters-more", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "What You Eat Matters. Where It Comes From Matters More. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredWhat You Eat Matters. Where It Comes From Matters More.Food is only as healthy as the land it comes from and the people who grow it. Daily Harvest lets me practice what I preach without having to think twice.By Amanda ShapiroMay 20, 2020FacebookTwitterEmailTart Cherry + Raspberry SmoothieFacebookTwitterEmailSince Healthyish launched three years ago, our understanding of wellness has changed dramatically. We’ve gone from thinking about wellness as an individual pursuit to understanding that it’s a responsibility we have not just for ourselves but for our communities and for our planet. In an ideal world, all our wellness practices could benefit on all three levels—personal, community, and planetary—but in practice they can often seem at odds. This is especially true when it comes to the food we eat, which is why I’ve been a big fan of Daily Harvest’s from the start.Spinach + Artichoke Flatbread\nI know as well as anyone that certain ingredients, farming practices, supply chains, and personal eating habits aren’t good for the environment. And yet my lifestyle—and most people’s—makes it impossible to eat ethically and sustainably one-hundred-percent of the time. When I eat Daily Harvest, though, I can worry about it less. Instead of fretting over the ingredients, packaging, and sourcing of everything I eat, I know that Daily Harvest has done the work for me. Their foods are all plant-based and 95-percent organic. They find the best farms, develop relationships with the farmers who are committed to regenerative farming practices, and set rigorous standards to make sure every fruit, vegetable, leaf, and legume is grown well and picked at optimal freshness—unlike many industrial farms that pick their crops early (and add chemicals and preservatives) to increase their shelf life at grocery stores.Mulberry + Dragonfruit Oat Bowl\nOne of my favorite Daily Harvest options is their new Kale + Coriander Flatbread with a Sweet Potato Crust. The sweet potato comes from a 300-acre small family farm in New Jersey. In order to support a more sustainable food ecosystem, Daily Harvest helped the farm transition from conventional to organic and they are now USDA Organic certified. It’s farms like these that account for the 5-percent of ingredients in Daily Harvest’s products that are not yet organic. By investing in transitional organic, Daily Harvest helps make the three-year, cost-and labor-intensive process a little bit easier for the farmers in hopes of increasing the accessibility of organic for all. The sweet potatoes are frozen right on the farm so they’re never anything less than perfectly fresh. (And, on the subject of freezing, all of Daily Harvest’s ingredients are frozen this way, which not only allows produce to reach its full nutritional potential and maximum flavor by ripening on the vine, but also locks in nutrients and flavor at the source and cuts down on the amount of waste that happens in my kitchen).Kale + Coriander Flatbread\nLastly, unlike other companies that ship food to your door, Daily Harvest does a lot to mitigate their footprint. They don’t use any Styrofoam to ship (instead, they use recycled blue jeans as insulation!), and they’re working toward  100 percent compostable and recyclable packaging, made from plant-based renewable fiber that breaks down naturally instead of sitting in the landfill for generations. Bonus: that same packaging is soft, light, and oh so smooth...I almost forget that there’s breakfast (or lunch, dinner, or dessert) inside.Get $25 off your first Daily Harvest Box with code HEALTHYISH.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-20", "author": ["Condé Nast", "Amanda Shapiro"]}