{"id": "f1fdc4e95fcc9d1048726e5cd85dd0a3", "url": "https://www.bonappetit.com/story/the-problem-is-just-culture", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "The Problem Isn’t Drinking Culture, It’s Just Culture. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Problem Isn’t Drinking Culture, It’s Just Culture.Thoughts on where the wine industry should go from here, and more from Healthyish editor Amanda ShapiroBy Amanda ShapiroNovember 7, 2019FacebookTwitterEmailPhoto by Michael Graydon and Nikole HerriottFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Well, it’s been a week, and it’s only Wednesday. Last Friday, the New York Times published a story by Julia Moskin about an NYC sommelier who’d allegedly sexually abused at least four women—before landing on Wine & Spirits’ list of Best New Sommeliers this fall. I’d been following this story’s progress thanks to Healthyish columnist and Bon Appétit wine editor Marissa Ross, who played a key role in connecting Moskin with sources. Yesterday we published Ross’s companion piece about how the Times story came together and where the wine industry should go from here.There's been a lot of conversation about how to prevent sexual abuse in an industry that’s built on drinking. It’s not as easy as saying “don’t drink,” or even “drink less” when that’s literally part of the job, and, besides, blaming alcohol just excuses the people who acted wrongly. But even focusing too much on any one individual is besides the point. The problem isn’t drinking culture, it’s culture, period. As Ross and others have said, we need to change the environment that's allowed this kind of behavior to go unchecked. As a first step, people in leadership positions—bar and restaurant owners, winemakers, distributors—have to create systems built to protect the most vulnerable among us.Now for some lighter fare: Today we launched This Is Why We Travel, our extremely specific, highly curated trip guide. We worked on it alongside Condé Nast Traveler’s Women Who Travel, and it’s making me want to immediately start buying plane tickets (and this little bag). The guide is full of hyper-personal recommendations, from Katherine LaGrave’s snorkeling and soba expedition in Okinawa to Zan Romanoff’s dip in the mineral bath in Oaxaca to the app that makes it possible for Sandy Allen to find gender-neutral bathrooms while on the road. I hope you’ll use it to inspire your own trip planning in 2020...or whenever your budget allows.Sincerely,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleTo Make the Wine Industry Less Toxic, We Need to Get LoudBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Amanda Shapiro"]}