{"id": "f1ff799adb2d1427c166cded600c744b", "url": "https://www.bonappetit.com/story/dependent-on-weed-nl", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Can You Be Dependent on Weed? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCan You Be Dependent on Weed?Reflections on cannabis from Healthyish editor Amanda Shapiro.By Amanda ShapiroApril 11, 2019FacebookTwitterEmailIllustration by Lan TruongFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I’ve smoked weed intermittently for over a decade, and I’ve never really found my zone. I get sleepy. Or I get anxious. Or I get sleepy and then wake up a couple hours later...anxious. Last time I was in a legal state, I bought a bag of cannabis-laced granola clusters, ate half of one, and showed up an hour late to a lunch date because I became obsessed with the bed in my Airbnb. Even my CBD experiences have been mixed, and I don’t have the patience (or the supply) to experiment forever.Despite these failures—or we can call them non-successes—I’ve closely followed cannabis culture as it edges further into the mainstream. I’ve dug into the many reported health benefits, swooned over the ceramic pipes and other luxury accessories, and read up on the racist legal history. But I’ve heard less about the grayer areas of cannabis use, like what happens when smoking or consuming weed isn’t actually as healthy as the wellness world suggests.Earlier this week, we published T. Wise’s essay on what he describes as a weed dependency. “Weed is complicated for me,” he writes. “I know that I’m much more productive without it, that I’m too quick to curl up with it as a way to avoid others, my desires, and my fears.” Wise has tried different strategies—cutting it out, setting boundaries around when he can smoke—but he struggles with the very idea of moderation: “I am not a moderate person, and I have no desire to be. At best, being moderate feels like being average, not sure enough to go one way or another. At worst it feels like diluted truth.”Ultimately he lands in a place that will sound familiar to anyone who’s struggled with moderation in any area: “If smoking is my ritual, then I need other rituals. If smoking is my therapy, I need other therapy. Only then can I trust that what I do, what I smoke, is not an attempt to escape but a way to keep exploring.” T.'s piece has made me think about the things I rely on to escape, and how I can make my relationship with them a little more, well, healthyish.Is it time for breakfast yet?\nPhoto by Alex Lau, Food styling by Sue LiAlso New This WeekA healthyish breakfast sandwich recipe with a photo I can’t stop staring at. A laundromat where you’re gonna wanna stay for lunch (or at least a kimchi-infused baby babka). Someone please buy me this so I can live my best #steamlife. Kiernan Shipka cooked us cacio e pepe. Napping is a form of resistance for Black Americans.Healthyish Loves ItYou may have noticed a new email from us in your inbox. It’s called Healthyish Loves It, and every week it will feature a single, perfect item that we can’t live without. Check out the first four selections (there’s that donabe again), and let us know what you think: healthyish@condenast.com.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishCannabisHealthyish NewsletteressayRead MoreLifestyleLunch is the New DinnerBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-11", "author": ["Condé Nast", "Amanda Shapiro"]}