{"id": "f20abbdf495befde660f775b1ae512bb", "url": "https://www.bonappetit.com/story/honing-rod", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "Honing Rod: How and When to Use a Honing Rod and What to Consider Before Buying One | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Honing Rod Is Not Making Your Knife Any SharperHoning may not be sharpening, but it still is useful.By Ali FrancisNovember 13, 2020FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Want to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: knives.A familiar scenario: You’re about to make an obscenely large amount of Broccoli Cheddar Soup With Cheesy Croutons, because the world is strange and you need a hug on the inside. So you whip out your trusty chef’s knife to make light work of those florets—only your knife is blunter than 2020. What’s a soup-seeker to do?Your knife needs to be sharpened, and for the sake of convenience—soup waits for no one!—you might want to break out a honing rod. To be clear, honing is not the same thing as sharpening (more on that in a bit), but honing a dull knife is better than nothing and will get you back to the broc faster than you can say whetstone. Don’t let perfectly sharp get in the way of sharp enough! Don’t hack when you can hone! Here’s what you need to about honing rods—what they are, when to use them, and which one to buy:What in heck is a honing rod anyway?It’s a kitchen tool that looks a bit like a less-menacing sword. Mounted on the handle is a rounded stick-like rod—typically made from steel, ceramic, or diamond-coated steel. They’re commonly used to straighten the edge of a knife as it's gently dragged along the rod from heel to tip in a downward slicing motion. Swish, swish, swish!ContentThis content can also be viewed on the site it originates from.How does honing work?If you were to look at your knife blade under a very strong microscope, you’d notice the edge looks like a series of tiny teeth ( 😬)—which get knocked down and bent out of shape with regular use. Using a honing rod can realign that toothy edge, says test kitchen director Chris Morocco, which helps keep your knife feeling sharp, even as 232 Bleecker chef Suzanne Cupps reminds us, it “doesn’t take the place of sharpening it.”So what’s the difference between honing and sharpening?Sharpening your knife with the likes of a whetstone uses friction to remove some of the steel and create a new, sharper edge. A honing rod, on the other hand, maintains that sharpness—it offers a quick fix by realigning the existing edge. You can think of it like cutting your fingernails versus filing them. “Cutting (sharpening) reestablishes a new edge,” explains Hannah Cheng, one of the sisters behind Mimi Cheng’s in New York. “Whereas filing (honing) smooths out that edge.” In other words, if your knife edge is pretty sharp, honing can help keep it that way.When should I hone my knives?You’ll want to bust out the honing rod when you notice your knife isn’t slicing as smoothly, but you don’t have time to sharpen it. If you’re finding it hard to slice a soft-skinned piece of produce, like a tomato or plum, “then your knife will need honing,” says Joshua Lucio-Lasso, chef at Public Records and self-described “sharp freak” who hones his knives every day. If, after you’ve honed, it’s still tough to get through the tomato skin afterward, it’s time to sharpen!Because Cheng cooks a lot, her rule of thumb is simple: She sharpens her knives weekly and then hones them before each use.What kind of honing rod should I buy?The wand chooses the wizard, Harry. While you can hone most chef’s knives, “not every rod works with every steel,” Morocco says, adding that your honing rod must be harder than the knife steel to have an effect. For example, German-style knives are softer and can work with any rod, but Japanese blades are super hard and need the big guns: ceramic.Cupps and Morocco both recommend an all-rounder, like this MAC ceramic honing rod. It’s harder than steel and has a finer grit, which works faster and is less rough on your knife edge. (Remember the nail file analogy? Same idea.) Use it gently, especially on Japanese knives—remember: There’s no need to apply pressure. And whenever honing is ineffective, it’s time to break out the whetstone, okay?Photo by Laura MurrayMAC Ceramic Knife Sharpener$23 at AmazonExplore Bon AppétitKnifeKnivesToolsBasicallyRead MorecookingYou Don't Need a Knife SetBy Sarah Jampel and Alex DelanycookingHow to Shop For a Knife Like You Know What You're DoingBy Sarah JampelshoppingThe Best Knife Storage Solutions for Keeping Your Blades Sharper, LongerBy Carrie Honaker and Tiffany HopkinsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-13", "author": ["Condé Nast", "Ali Francis", "Alex Delany", "Tiffany Hopkins"]}