{"id": "f20c3fc972db5c89648dd29ecd2981b7", "url": "https://www.bonappetit.com/story/grilled-chicken-technique", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "The Grilled Chicken Technique Worth Fighting About | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Grilled Chicken Technique Worth Fighting AboutA weekly dispatch from Bon Appétit's editor in chief.By Adam RapoportAugust 7, 2018FacebookTwitterEmailFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Flip the script on grilled chickenSo I got into this whole thing with editors Claire Saffitz and Christina Chaey about grilled chicken.Not the boneless, skinless kind that you toss on your gas grill on a Tuesday night, but the real deal kind—bone-in, tender, juicy meat with crisp, browned skin that’s lacquered with sauce, drizzled with a chimichurri, or doused with a post-grill marinade.Want this letter before it hits the website? Sign up for our newsletter!It all started a few weeks back, while I was cooking dinner out by the beach. I got in my head that I wanted to make Andrew Knowlton’s grilled chicken wings with shishito peppers. Except, instead of wings, I asked my guy at 8 Hands Farm to take a whole chicken and cut it into parts. See, the recipe is flexible that way. And, well, it’s kind of genius. You throw together a simple, Asian-inspired marinade, and you reserve half of it, so when the chicken comes off the grill—all deep brown and glistening—you bathe it with the remaining marinade, which sings of sesame oil, soy and shallots.My only question was—and here’s where I got into it with Claire and Christina—was how do you get the chicken all crispy and golden brown without blackening the skin and undercooking the meat?Chimichurri sauce makes grilled chicken taste even better.\nPhoto by Alex Lau, food styling by Rebecca JurkevichClaire, while pitching a spatchcocked chicken recipe to me, is of the school that you start the chicken skin side down. “I go skin-side down over medium heat first to char the skin and start to render the fat, then I flip and cook the chicken through over indirect. The skin keeps rendering and bastes the meat as it cooks.”Sure, fair enough. But isn’t she worried about burning the skin when the fat drips into the fire, spurring flare-ups?I was! So I banked my coals to one side of my Weber (if I was using a gas grill, I would’ve lit two of the four burners), and I placed the marinated chicken parts bone-side down over indirect heat, and I put the cover on, top and bottom vents open, creating my own little outdoor oven.This allowed the skin to slowly render, without risk of burning, and the meat to the cook through. After about 15 minutes, I took a peek and, man, was it gorgeous—like mini pieces of Peking duck, all tawny and smoky brown.I then flipped the parts and inched them closer to the glowing orange coals, top removed, in order to bring the skin to its desired crispy state. Of course, being starving and the sun having long since gone down, I pushed a few pieces a bit too directly over the coals and those parts did get all blackened. But the other pieces—perfection.Now, as far technique goes, I’m not saying that Claire is wrong, but I am saying that I’m right.Miss Ollie’s jerk chicken is on my to-cook list this summer.\nAlex LauAnd I’m going to put my scientifically tested method to work now through Labor Day, grilling up Molly Baz’s tandoori chicken wings. And Alison Roman’s classic barbecued chicken. And I’ll give Miss Ollie’s jerk chicken a shot, even though I’ll be relying on plain-old charcoal instead of the fragrant pimento wood they’ve got down in Jamaica.And, oh yeah, back to Knowlton’s chicken. I plated the pieces, and poured the intoxicating marinade all over them, the hot chicken soaking up its flavors. My friend Roo even insisted that the two blackened pieces were his favorite. It’s nice to have nice friends.Get the recipes:Grilled Chicken Wings with Shishito PeppersChimichurri SauceButterflied Chicken with Herbs and Cracked OlivesGrilled Chicken with Board DressingTandoori Chicken WingsBarbecued ChickenMiss Ollie’s Jerk ChickenExplore Bon AppétitChickenGrill BarbecueAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-07", "author": ["Condé Nast", "Adam Rapoport"]}