{"id": "f211a8e8386fa443f6aee8905060f835", "url": "https://www.bonappetit.com/recipe/beef-sliders-with-provolone-and-balsamic-onions", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Beef Sliders with Provolone Cheese Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueBeef Sliders with Provolone and Balsamic OnionsBy Ignacio MattosApril 17, 2018EmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintMacerating red onions in balsamic vinegar with a big pinch of sugar helps soften the onions and sweetens them right up. Serve these sliders alongside a picnic menu of shrimp empanadas, grain salad with tomatoes, and Italian sundaes with Nutella.Ingredients8 servings2lb. ground beef (20% fat)Kosher salt, freshly ground pepper4slices provolone piccante or sharp provolone cheese, torn in half8potato slider buns1large red onion, very thinly sliced into rounds3Tbsp. balsamic vinegar1tsp. sugarAioli or store-bought mayonnaise (for serving)PreparationStep 1Divide meat into 8 portions (about 4 oz. each). Place 1 portion on a work surface. Cup your hands around the meat and shape it into a rounded mound. Gently flatten patty to about ¾\" thick. Season both sides with salt and pepper. Repeat with remaining portions of meat.Step 2Prepare a grill for medium-high heat. Grill patties until lightly charred on bottom, about 3 minutes. Flip and top with a piece of cheese. Grill to desired doneness (cheese should be melted), about 3 minutes for medium-rare. Transfer patties to a cutting board and let rest 5 minutes.Step 3While patties are resting, grill the buns, cut side down, until lightly charred around the edges, about 30 seconds.Step 4Toss onion with vinegar, sugar, and a pinch of salt in a medium bowl and let sit, squeezing onions occasionally to soften slightly, 5 minutes.Step 5Build sliders with patties, buns, onions, and aioli.Step 6Do Ahead: Patties can be formed 6 hours ahead. Cover and chill.How would you rate Beef Sliders with Provolone and Balsamic Onions?Leave a ReviewTell us what you thinkExplore Bon AppétitBurgerBeefMeatGround BeefProvoloneCheeseEasyQuickMainNut-FreeGrillingSuper BowlFourth Of JulyDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}