{"id": "f215750061a247c171322e1d42854b93", "url": "https://www.bonappetit.com/story/cook-beans-make-soup", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "If You're Cooking Dried Beans, You Might As Well Make Soup  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen You're Cooking Dried Beans, You're Already Halfway to SoupConsider it multitasking mastery.By Sarah JampelOctober 8, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailWe'll tell it to you straight: Cooking dried beans takes a heck of a lot longer than reaching for your can opener and rinsing the goop off a couple cans'-worth of white beans. So—in this age of ultra-efficiency and impatience, when we demand that everything we order from the internet come the next day and every show we watch be released all at once—why bother?Well, you probably already know that from-dry beans have a superior texture (creamy-not-mushy) and—since you season them from the get-go—a superior taste. But enough about that. What we don't talk about enough when we talk about cooking dried beans is that you're not just making beans: You're also making soup.By adding lots of vegetables, aromatics, and all sorts of other goodies (spices, Parmesan rinds, lemon peel, dried chiles, slab bacon) to the bean-cooking liquid, you're not only flavoring those beans. You're also multitasking, cooking beans and making broth at the same time. How's that for ultra-efficiency?This technique is the basis of Navy Bean and Escarole Stew, Pasta e Fagioli, and Carla Lalli Music's newest recipe, Hammy Chickpea Soup. You add carrots, garlic, onion, crushed red pepper flakes, smoked paprika, cumin seeds, and—the not-so-secret secret ingredient—a smoky, salty ham hock to the pot with the chickpeas. You let the whole thing simmer away until the beans are tender and the vegetables have given all they have to give to the greater soup cause. You could stop there—shred the meat from the ham hock, toss it back into the pot, call it dinner—but by puréeing the vegetables and a portion of the chickpeas, the soup goes from thin and brothy to silky and creamy.Let's say that you want beans but you don't want soup. Maybe it's \"still summer.\" Maybe you live in Southern California. Maybe you're making pasta or salad because maybe you're not yet a \"soup person.\" Fine. Fine! We'd still argue that you should make that cooking liquid taste so good that you'd want to slurp it. Because once you've strained those beans, you can save that liquid (freeze it, even) and use it whenever you'd use broth—braises, stuffing, gravy, or...soups. Hey, we said you weren't a soup person yet.Soup's on:Hammy Chickpea SoupName a better activity for an autumnal, sweater-weather Sunday than simmering a cozy soup. (Oh, and apple-picking doesn't count.)View RecipeExplore Bon AppétitSoupChickpeaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-08", "author": ["Condé Nast", "Sarah Jampel"]}