{"id": "f219ae9f96fc5938dd549ed27366d7e2", "url": "https://www.bonappetit.com/story/new-potatoes", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "You Can Keep Your Ramps, I’m Stampeding the Farmers’ Market for Potatoes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Can Keep Your Ramps, I’m Stampeding the Farmers’ Market for PotatoesAn ode to an underrated bonafide spring ingredient.By Carla Lalli MusicMay 23, 2019FacebookTwitterEmailEva KolenkoFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Ah, spring. A time of perky little peas, stampede-inducing ramps, and fat asparagus. While other people go crazy for all the pretty green things, I go crazy for potatoes. Yes, potatoes. Any minute now, the true and real, just-dug, new baby potatoes are going to show up at the market. That’s when I’ll treat them like pasta in this cacio e pepe riff from New York City’s own Rita Sodi and Jody Willilams of the beloved restaurant Via Carota.Want this letter before it hits the website? Sign up for our newsletter!Hold up a second, though. Just because there’s a potato at the market, doesn’t mean it’s new, so know before you go. “New potatoes are an abused and misunderstood category,” writes Elizabeth Schneider in Vegetables from Amaranth to Zucchini, a book you should definitely buy. (I love how mad she sounds about it!) New potatoes are not just small potatoes—they’re “first crop,” picked when their foliage is still green. A bonafide spring ingredient, not cold-storage staple! Ask your farmer/shopkeeper to be sure, because they’re special, and you’re worth it. They have thin skins and very creamy, sweet interiors; they’re young and dainty and you might be able to find very tiny ones, which are ridiculously adorable.To celebrate the new potato, don’t mess with it too much. I like them steamed and then tossed with butter and salt and a fistful of chopped chives, and I will eat those straight out of the bowl with my fingers, thankyouverymuch. But if you want to frill them up a little bit, do the Sodi-Williams thing. Boil them till tender, then toss them with olive oil and grated pecorino, salt and pepper. You don’t need to peel them, and in fact, you shouldn’t. Their skins will pop open when you bite them, exposing sweet fluffy-creamy insides. Stupid simple, but freaking delicious.Explore Bon AppétitCarla NewsletterPotatoSpringRead MorecookingFood Tastes Better When You Shop SmarterBy Carla Lalli MusiccookingYou Say Dinner, I Say SoccaBy Carla Lalli MusiccookingThe Easiest No-Cook Side You’ll Make All SeasonBy Carla Lalli MusiccookingWhite Pesto Is The Easiest Dinner You Will Make This WeekBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-23", "author": ["Condé Nast", "Carla Lalli Music"]}