{"id": "f21cd588f492bfdd4aefc8faf17a92fa", "url": "https://www.bonappetit.com/recipe/salted-chocolate-halva", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Salted Chocolate Halva Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueSalted Chocolate HalvaBy Andy BaraghaniNovember 20, 20184.6(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintSalt and bittersweet chocolate lend a savory, sophisticated edge to this typically saccharine-sweet dessert. Halva can be a little tricky to make at first, and a candy thermometer is key to nailing the right temperature, which creates the desired flaky, crystallized texture. For a holiday party, package each slice up real cute and put it in a basket by the door for guests to take home.Ingredients8 servingsNonstick vegetable oil spray1½cups tahini¼tsp. kosher salt4Tbsp. black and white sesame seeds, divided1½cups sugar4oz. bittersweet chocolate¼cup dried edible flowers (such as cornflowers and/or roses; optional)Flaky sea saltSpecial EquipmentA candy thermometerPreparationStep 1Lightly coat an 8½x4½\" loaf pan with nonstick spray and line with parchment paper, leaving a 2\" overhang on both of the long sides. Mix tahini, kosher salt, and 2 Tbsp. sesame seeds in a medium bowl to combine; set tahini mixture aside.Step 2Cook sugar and ½ cup water in a small saucepan over low heat, stirring with a heatproof rubber spatula, until sugar is dissolved, about 4 minutes. Increase heat to medium-high and fit pan with candy thermometer. Cook syrup, brushing down sides of saucepan with a wet pastry brush as needed to dissolve any crystals that form, until thermometer registers 250°, 7–10 minutes. Immediately remove syrup from heat and gradually stream into reserved tahini, mixing constantly with spatula. Continue to mix just until halva comes together in a smooth mass and starts to pull away from the sides of bowl (less than a minute). Be careful not to overmix or halva will be crumbly. Working quickly, scrape into prepared pan and let cool.Step 3Melt chocolate in a heatproof bowl set over a pan of simmering water (do not let bowl touch water), stirring often. Remove from heat. Invert halva onto a wire rack set inside a parchment-lined rimmed baking sheet; peel away and discard parchment. Pour chocolate over halva and sprinkle top with flowers (if using), sea salt, and remaining 2 Tbsp. sesame seeds. Let sit until chocolate is set before serving, about 30 minutes.Step 4Do Ahead: Halva can be made 3 days ahead. Store tightly wrapped at room temperature.How would you rate Salted Chocolate Halva?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI had some tahni that was about expire and this was the perfect recipe to help me finish my jar of tahni. It's a very simple and quick recipe, but I thought the sugar was a little too much. I think I will add less sugar next time. I didn't have any sesame seeds or any of the extra toppings so I used pistachios. I think the pistachios complemented this recipe well. I also chopped the pistachios to top the chocolate coating, which looked beautiful in the end. AnonymousNashville, TN6/5/2020I tried this recipe!  It was amazing!  I added roasted pecans and mini chocolate chips..loved!!Joconorblond@gmail.comCalifornia 8/24/2019I have always liked halva but have never gone crazy over it- but this recipe has most definitely changed that! The halva was out of this world! My family and I could not stop eating it. The burst of flavor that you get from sweet syrup, the distinct tahini flavor, and the saltiness from the sea salt is incredible all while being covered with chocolate! I personally added pistachios to the recipe to give it an extra crunchinesses and depth of flavor and it worked really well with it. Thank you for this amazing recipe Andy!sarahahdutNew York 7/5/2019Hi - For the sesame seeds, should they be raw or roasted?  I went to an Asian market to track down black sesame seeds and they sold both roasted and unfrosted...  Does it matter?  \n\nThanks so much!  I've made your recipe once with the white seeds only since I already had them on my shelf and my halva turned out YUMMY!Alibaba123NY, NY5/22/2019Excellent recipe - it truly makes authentic halva (if you leave off the chocolate).  My Dad is from Turkey and extremely picky about things like this and he asks me to make it for him every week he loves it so much.  Suzanne ANorwalk, CT4/20/2019Really easy and fun to make. Excited to try this out with different flavour combos!!goblineatsAustralia4/16/2019Explore Bon AppétitCandyDessertMiddle EasternTahiniCondiments, Sauces & PastesChocolateOther IngredientsDairy-FreeVeganGluten-FreeSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Andy Baraghani"]}