{"id": "f21d045b3ce08599e2d4f89bd471ed60", "url": "https://www.bonappetit.com/story/mark-zuckerberg-goat", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "How Do You Tell Mark Zuckerberg the Goat Is Cold? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Do You Tell Mark Zuckerberg the Goat Is Cold?The weirdest food story of the week gets weirder.By Alex BeggsJanuary 26, 2019FacebookTwitterEmailPhoto by Andrew Harrer/Bloomberg via Getty ImagesFacebookTwitterEmailIt’s usually okayTo make up your own dinner party rules. Shoes off! Bring me Settlers of Catan expansion packs instead of wine! No dogs allowed! Texas beers only! So when I asked about dietary restriction etiquette questions, answered a few, and then saw readers’ comments about how they deal with guests on certain diets...I was horrified at all of the people who blanket said: THEY’RE NOT INVITED. That’s sad, y’all. Ask your vegan pals to bring a dish, try it and hate it, but goodness gracious, it’s not that offensive. No one owes anyone anything but kindness and maybe some cold beer. I think we might all be overthinking this thing.ZuckergoatIn Rolling Stone’s interview with Jack “brings his own organic wine to restaurants” Dorsey, an anecdote about Mark Zuckerberg killing and cooking a goat for dinner has gone viral. I don’t know why people are so shocked. He literally turned his backyard into FARMVILLE! It makes sense to me. I can picture it. Zuck wakes up, sips bulletproof coffee on his back deck and points to a sweet, purring goat chomping on a first generation iPod. “That one,” he says to the empty air in his toneless voice, pointing like a kid at the Red Lobster tank. But Alexa hears, and shoots lasers at the goat before playing the French techno station Zuck is into right now, his Goat Phase.Remember the Facebook Live barbecue stream where he ran out of things to say and just listed all of the foods a person can smoke? Good thing Facebook Live has fizzled out, otherwise who knows what kind of backyard-to-table goat grilling would have come next.Photo by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Emily EisenMake this soupDon’t tell me lamb is too “gamey” for you, Jack. It’s delicious and rich in this lamb and squash soup Andy Baraghani developed last winter. I made it over the freezing weekend and realized what a unique recipe it is. You brown the lamb and cook it with warm spices, okay. But then, in a blender, you mix up this roasted chile and charred onion salsa/sauce. Once the soup is nearly done and you’ve added the squash, you stir the chile sauce in to give body and a heckton of flavor. Serve with feta on top (!) and a side of crusty baguette and some kind of funky red wine. (FYI my soup was definitely not as red as the photo. Not sure how they pulled that off. I also doubled the recipe, because I knew I’d want leftovers.)Get the recipe: Lamb and Winter Squash SoupPhoto by Chelsie Craig, Food Styling by Kate BuckensAnd for something sweetI also made this Basque-style cheesecake, a custardy, fluffy cheesecake you cook at high heat, causing this nearly-burnt exterior that Molly Baz described as “a worn leather wallet.” Read more about it here. Again, mine did NOT look like this perfectly browned one; it was patchy and mountainous. It still made me immensely happy. Bake it!Get the recipe: Basque Burnt CheesecakeUnnecessary food meme of the weekUnnecessary food feud of the weekRecently our corporate overlords blessed us with some random free office snacks. The tactic worked! We’re all walking around with crumbs on our faces and the oblivious smiles of stock photo office people. We’ve started measuring the stress of the workday in bags of Munchies snack mix. “It’s a two Munchie day,” sighed Christina Chaey when she saw me eyeballing her fresh bag. The magazine was on a strict deadline, I deducted. There are classic Lay’s, Doritos, those packets of peanut butter crackers, granola bars, a tray of possibly red delicious apples (the jury’s out, they’re mysteriously delicious “only when ice cold,” per Emily Schultz) and bananas, and shared glass jars of M&Ms, pretzels, trail mix, and peanuts. Kate Fenoglio mixes the pretzels and M&M’s “when I’m feeling fancy” and we’ve now deemed it “Kate Mix.” Emma Wartzman toggles between peanuts and peanut butter crackers, a real rule-breaker, that one. Sarah Jampel votes for the odd trail mix that includes raw (stale) dried coconut, “hard to come by” dried pineapple, and inexplicable sunflower seeds. In our poll, the green bananas won out. “The advanced move,” said Alex Delany, who speaks as if someone is about to scribe all of this onto a rock somewhere ancient, “is to take three green bananas and leave them on your desk, so they ripen over the next few days. Then you have three free perfectly ripe bananas. Patience is a virtue.” I prefer a green banana, following every sharp, grassy bite with a spoonful of peanut butter, a two-handed technique that completely debilitates you from working on anything else. Who’s the philosopher now? Alex the elder, I think.Amiel would like me to let you know he thought it said “germy shared PEANUTS.” So.Have a snacky weekend,Alex BeggsSenior Staff WriterExplore Bon AppétitBeggs NewsletterRead MorecultureIs It Ever Okay... To Cancel a Dinner Party If Too Many People Are Paleo?By Alex BeggscookingTurnips > Carrots: Prove Me WrongBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-26", "author": ["Condé Nast", "Alex Beggs"]}