{"id": "f22482076ab33307ef769db679096dd2", "url": "https://www.bonappetit.com/story/trader-joes-novemeber-2021", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Trader Joe's Reviews: Green Bean Casserole Bites and Other New Stuff | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTrader Joe’s Green Bean Casserole Bites and Other New Stuff, ReviewedLike “Everything but the Leftovers” seasoning, which tastes like dehydrated Thanksgiving. Yum!By Alex BeggsNovember 24, 2021FacebookTwitterEmailFacebookTwitterEmailLast time we met, I was moaning and groaning about those unkillable cinnamon brooms at Trader Joe’s, but this month I saw just the opposite at the entrance of the store: beautiful wood decorative flowers. They don’t reek of anything, and they’re pretty. So that’s just a heads-up. In the food department, there hasn’t been much major innovation. Perhaps Joe has experienced some supply chain issues that are keeping the fried mashed potato bites or hard cranberry sauce seltzer held up in customs. Dunno. But the few new Thanksgiving products I did encounter—and the snowman who melts to death in your coffee mug!—were great, and there are some other hidden gems this month, except the watery squash bisque. Not that.CoffeeEthiopia Small Lot Coffee Bale MountainThe truth is, if you’re adding milk or pumpkin spice oat milk to your coffee, how much will you taste the nuances of the bean? Get whatever you want, it’ll all work out in the end. I found this bag to be totally fine despite the hype about how “limited edition” it is and the cute leopard spots (yet no roast date—hmm). It’s not dark- or burnt-diner-coffee-tasting, and yet, nothing magical tingles the tongue. Maybe because it’s just coffee. It’s medium-roast and I feel medium about it.Italian Roast Ground EspressoStrong! Not medium!Seasonally AppropriatePumpkin Butternut Squash BisqueWatery with pebble- and fleck-size bits of squash and carrots that reminded me of sipping a toddler’s backwash. I added a few tablespoons of coconut milk and several shakes of smoky Aleppo pepper to improve upon this otherwise bummer bisque.Harvest Apple Salad KitJoke’s on me—I thought there were going to be brown, mealy apple slices in here like the ones in Happy Meals. Instead, there are brown, shriveled apple chips you add to the salad along with a sweet apple cider vinegar dressing. If you don’t like a dessert salad, a squeeze of lemon balances it out. Or, I dunno, stop buying these bags-within-bags altogether so I can stop having to taste them for my job. I’m the one who’s shriveled now!Oat Milk Egg NogI appreciate the food science that makes oat milk creations creamy and smooth, a bunch of emulsifiers and gums and distant dreams, but my carton of oat milk not-nog had lost its composure. When I poured it, visible chunks plopped out, and it was as unsettling as it sounds. Did that stop me from steaming it into a not-nog latte? No! It was a weak froth, but a tasty, mild drink. You’re not smacked over the elf hat with too much nutmeg—hate that. Just shake the container thoroughly before pouring. Or ask real egg nog: “What’d you ever do to hurt me?”Pumpkin Oat BeveragePumpkin, not pumpkin spice. The pumpkin is so subtle, it’s just a bit of pumpkin purée, so I can’t find any reason to complain. Just kidding! I always can. The drink is watery, and I assume most people are using it for coffee creamer, so why not just make it a thicker coffee creamer? GIMME THOSE GUMS! (Have you tried the Starbucks alt-milk pumpkin spice creamer? It’s fantastic.) Maybe next year. For now, you can have pumpkin-flavored Cheerios milk. Or...a pumpkin white Russian!Hot Cocoa SnowmanHaving grown up Catholic, I can see right through these Frosty the Snowman storylines. Oh, he comes back FROM THE DEAD every winter to spread good cheer? Don’t trust a man who accessorizes with a top hat and a scarf but passes on the pants, exposing himself to the whole neighborhood. (Coincidentally, we had a parish priest who did just that.) And like that priest, the hot cocoa snowman won’t be coming back next winter—and not because he was sent to Canada. This is the end of the line for hot cocoa snowman. Watch his mini marshmallow guts ooze into your scalding milk cauldron and then drink his bones, you sugar-starved monster. What a violent, delicious after-school snack. I wonder what fate awaits Rudolph.Turkey & Stuffing En CrouteThis isn’t new but I’d never made it before, and you know what? It’s great. I like the idea of replacing the entire Thanksgiving meal with a log. Important: Thaw it overnight. Also important: Bake the dough-wrapped thing on a wire rack inside your sheet pan so that it can get some heat underneath—I had soggy bottoms. The flaky crust and stuffing mush layers were my favorite. The rosemary turkey is fine! The gravy and cranberry packets are optional!Cat Treat Advent CalendarEach box is very challenging to punch open, then inside is a tiny plastic bag of treats. And I have to do this every day for a month? My sweet son Roger seemed to enjoy the seaweed and salmon treats. It’s not like his breath could smell any worse.Innovative SeasoningsEverything but the Leftovers Seasoning BlendTruly, it tastes like stuffing. It’s freaky. All the holiday herbs and alliums are here, and as I lick a small mound of seasoning from my palm, I wonder whether this is enough. Can I make a meal of this seasoning, huddled in my bunker, the only light the soft glow of my rechargeable headlamp? If inflation keeps pumping up at this rate, we might just have to. Makes ya think.Cheesy Seasoning BlendI’m 90% sure this is ranch seasoning. There’s buttermilk, onion, and garlic powder in there, and my ranch radar went off the second my tongue hit my palm, from whence I was tasting. And my ranch radar is very, very acute. It’s obviously awesome on popcorn; I’m going to go back to TJ’s to buy more as gifts, then put them in popcorn bags with little packets of heirloom blue corn kernels (!), which I bought at a local spice shop and tracked down on the obscure internet for you here.Pantry StaplesOrganic Stone Ground Blue Corn Taco ShellsFun! Blue corn, which originates right here in the US of A and is a staple of Native American cooking, is slightly sweeter and nuttier than yellow corn. If only TJ would reveal where they get the blue corn, because it would be cool to know which grower we’re supporting here, right? Too much to ask? Okay! I toasted these for five minutes (otherwise, they’ll taste stale, because in a way, they are). You can’t really taste the nuances of the blue corn here, but if you buy some Bow & Arrow blue cornmeal and make some scones (page 115 of Mother Grains) with it, you will.Spicy Jollof Seasoned Rice MixThis cooks up fast and easy, and the texture of the rice is buttery and distinct. It’s mostly flavored with dried tomato powder and flakes, with red chile flakes for some heat. Not quite one-note, but definitely not three. The homemade version of the Nigerian dish might have red bell peppers, fresh hot peppers, curry powder, onion—a lot more ways to layer on flavor.Wine Infused Sea Salt Seasoning GrinderI figured this was the salt equivalent of a “wine o’clock” kitchen sign, but it surprised me, mostly for not tasting like wine at all (phewph, honestly, I’m trying to drink less and I don’t need enabling from my salt). It’s a sparkly mixture of sea salt and dried rosemary and pink peppercorns that’s apparently infused with rosé. What I’d do is grind this into cute salt cellars and set those around the table for people to pinch from, all classy-like. Or sprinkle on popcorn.Organic Taralli and Friends CrackersI’ll go ahead and rank the so-called friends.Seedy squares: These are dense and sesame seedy with a crackly, crunchy texture. Fave.Ruddy nubbins: These little lumps crumble in your mouth with a burst of onion powder.Thick twists: Most of these are broken, but the few that remain will dissolve into sand in your mouth, turn to cement when mixed with saliva, and taste of wheat. Wash down with some sparkling pomegranate punch (see below).Circles: Break too easily, bland. Shamelessly prioritizing aesthetics.Chili Sesame OilReally spicy! As always with sesame oil, a little goes a long way.Organic Dried & Pitted Degelt Noor DatesI prefer the Medjool dates in the refrigerated section of TJ’s, which are juicier. That said: Pits are the pits. If you can’t be bothered to spit out a torpedo-size pit or slice around it, these will do! The longer they lurk in your cabinet, the likelier they’ll dry out. I’d buy them to make these sticky buns.Thai Wheat NoodlesThese flew under the radar—they came out in the spring—but they cook incredibly fast (toss them in a frying pan with whatever else you’re cooking), saving you those pesky 20 minutes waiting for water to boil. They’re chewy and tender and satisfying. I used them to make Hetty McKinnon’s wonderful peanut butter noodles. My only complaint is that there are three servings per box, not four. If you live in a two-person household, you have to duel to the death for the final bag.Sour Jelly BeansActually! Sour!Criollo ChocolateSmooth, intense, almost sticky. It clings to my molars. This is for dark chocolate lovers and people who prefer to nibble on chocolate, which is not me. Not a nibbler.Aceto Balsamico Di ModenaDrizzled this on yellow split pea soup from Abra Berens’s Grist, and I’m not mad about it. A nice gift too!Vanilla Buttercream Frosting MixEverybody knows cream cheese frosting is better! Why even bother? (I didn’t bother.)DrinkablesSparkling Honeycrisp Apple JuiceSooo, fancy Martinelli’s? Amazing with bourbon.Sparkling Pomegranate PunchNot quite soda, not quite flavored seltzer, this sparkling fruit juice punch reminds me of Big Red, a fantastic cream soda and arguably one of Texas’s greatest exports, after Willie Nelson and H-E-B and maybe 27 other things, including belt buckles. Anyway, the pomegranate flavor is tampered with pineapple, orange, and apple juice. Sweet, fruity! Just add vodka!Sparkling Cranberry Flavored Juice BlendTell you what we’re gonna do with this. Don’t even taste it plain, it’s syrupy and cloying. We’re making FIZZY COSMOS: 2 oz. vodka + 1 oz. lime juice + ¾  oz. triple sec. Shake over ice, then pour over fresh ice and top with 1 oz. of this juice.A Single Lump of CheeseParmigiano Reggiano Aged 40 MonthsCheese, but old!Frozen Stuff12 Cranberry Orange BarsCreamy and cute, though the cookie crust is uneven. Not as tart as I want it to be (this one is). But bite-size and sweet. Make a sugar-coated cranberry garnish and snap! That! Pic!Green Bean Casserole BitesI air-fried these puppies in seven minutes and nearly burned them. Inside the flaky tart shell, there’s one eighth of a green bean and some cream of mushroom gravy, and I’m guessing 37 other things. Pop the whole bite in your mouth and Thanksgiving just explodes in there. A wonderful new snack. And clever! The problem is, when you take a Thanksgiving dish I want A LOT of and force me to eat just a small amount of it, I start to crave the original thing even more. So if you serve these as a Thanksgiving app, know that they are no substitute for the full-size casserole.Tofu Scramble with Soy ChorizoIn the four microwaved minutes + one for cooldown that this takes to prepare, you could fry up some soy chorizo (which I think is TJ’s best fake meat) and eggs, or tofu crumbles, and douse it with hot sauce and have a much more satisfying, flavorful breakfast. Especially if you have some TJ’s homemade flour tortillas lying around. The alternative cheddar cheese in this scramble is more of a textural goo than a flavor. Sometimes the body needs goo. If so, goo for it.Kimchi and Tofu StewUnfortunately, this is mush. Not a lot of flavors happening, when in fact, there should be several flavors. Dress it up with chopped scallions, do whatever you have to do, or avoid the problem by simply not buying it.Explore Bon AppétitTrader Joe'sCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-24", "author": ["Condé Nast", "Alex Beggs"]}