{"id": "f227d0e8db41727805cc4656c2a0a77a", "url": "https://www.bonappetit.com/city-guides/portland/venue/bakeshop", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "Bakeshop Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginportlandBakeshopNortheast Portland’s haven for whole-grain pastries that are actually goodFacebookPinterestTwitterEmailLeela CydGO HERE: for pastry chef Kim Boyce’s always awesome array of carby delights (Scones! Cookies! Hand pies!) at Bakeshop.ORDER : whatever you’re craving once all the aromas of butter, chocolate, and more butter hit you. There are stellar salt-topped chocolate chip cookies, super-moist lemon pound cake, and crowd favorite fig-laced buckwheat scones, if you need help narrowing your order down.THE VIBE IS: cheerful, with a big glass display of sweets greeting you as soon as you enter. Sure, it’s smart to avoid the morning rush, but make sure you double check the close time before you come in (2 p.m.!).PRACTICAL STUFF: Open Wednesday through Sunday, 7 a.m. to 2 p.m. Closed Monday and Tuesday.—Elyse InamineLeela CydWE ALSO LOVEHeartDon’t leave Portland without a bag of the city’s best beansSalt & StrawWilly Wonka + locavore + artisanal ice cream CanoeThe downtown destination design store for your kitchen, bath, and living roomExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-16", "author": ["Elyse Inamine"]}