{"id": "f22a35cd0fe91e029d53209e580a09ef", "url": "https://www.bonappetit.com/recipe/spicy-mushroom-larb", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Spicy Mushroom Larb Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpicy Mushroom LarbBy Andy BaraghaniDecember 26, 20184.6(43)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintDon’t even think about tossing, stirring, or shaking that pan until the mushrooms are golden brown and crisp. You want to achieve that flavorful texture before incorporating the additional aromatics. This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right. To keep it entirely vegan, sub the fish sauce with tamari.Ingredients2 servings¼cup roasted, skinless peanuts4Tbsp. vegetable oil, divided12oz. shiitake mushrooms, stems removed, quartered3scallions, thinly sliced2garlic cloves, finely grated11\" piece ginger, peeled, finely gratedKosher salt1medium shallot, thinly sliced into rings, rinsed, drained1red chile, such as Holland, Fresno, or Thai, thinly sliced1cup mint leaves, torn if large1Tbsp. fish sauce or tamari¼head of green cabbage, halved crosswise, leaves separatedLime wedges (for serving)PreparationStep 1Coarsely chop or crush peanuts into small pieces; set aside.Step 2Heat 3 Tbsp. oil in a large nonstick skillet over medium-high until shimmering. Add mushrooms and cook, undisturbed, until bottom sides are golden brown, about 5 minutes. Toss and continue to cook, tossing occasionally and reducing heat as needed to avoid scorching, until golden brown all over, about 4 minutes more. Add scallions, garlic, and ginger, followed by remaining 1 Tbsp. oil, and cook, stirring often, until softened and fragrant, about 2 minutes. Remove from heat; season lightly with salt. Mix in shallot, chile, mint, fish sauce, and half of peanuts. Taste and season with more salt if needed.Step 3Transfer larb to a large bowl. Serve with cabbage, lime wedges, and remaining peanuts alongside.How would you rate Spicy Mushroom Larb?Leave a ReviewTell us what you thinkReviews (30)Back to TopTrianglePretty good recipe, but it is missing a crucial ingredient - khao-khua or toasted sticky rice powder. Without it, the aroma and taste is not really that of traditional larb. Still a good tasting and easy recipe!\nGeorge Providence, RI10/6/2021Delish. Strongly agree with doubling to recipe and adding rice for more sustenance.WGBozeman, MT6/10/2021Loved this! I could tell from the amount of mushrooms that this would in no way be enough for me, and I don't do no-carb dinners, so I used an 800g mix of chestnut and oyster mushrooms (working with what the grocery store had) and served with coconut rice and a crispy egg. I doubled the scallions and peanuts and tripled the ginger, garlic, pepper (I used rawit/bird's eye(?)) and fish sauce, since the rice reduces the flavour intensity. Instead of adding the mint to cook I took examples from earlier comments and julienned it together with the cabbage as a sort of slaw topping. Delicious. I froze some of it and I hope it will thaw well.AnonymousAmsterdam4/30/2021I didn’t add any salt and I think a tablespoon fish sauce was a little too salty. Next time, I’ll only add 1.5 teaspoon fish sauce. Served with sticky rice and a cucumber salad. So tasty! JosieChicago4/1/2021Loved it the first time.  It is a little work, so I doubled it the second time planning for leftovers.  Second time I understood the contrast better - an umami sautee base with a little fresh herb salad on top.  Now it's one of my favorite recipes for shiitake.  Jersey LocavoreUS/NJ9/8/2020Delicious and flavorful! I doubled the recipe, served rice on the side, and added a fried egg on top, which was plenty for two people. I also used a mix of shiitake and crimini to save some money. The aromatics in combo with the fish sauce really adds so much flavor so don't skimp.AnonymousAmsterdam6/14/2020This is not larb, but it's tasty whatever it is. I think it needed some cilantro AnonymousCanada1/1/2020This was a really fantastic dish! The sour and savory flavors make it easy to forget that it's actually quite healthy. The cabbage cups really do a lot of work: they balanced out the sourness of the larb, made the meal a lot more filling, and, of course, added great crunch! I added cilantro in addition to the mint; it would have still been great without it, but I think it really added some additional kick and complexity.jmajicBrooklyn6/4/2019I am Team Mushroom Larb 100%!  But I agree - definitely double for 2-3 people, I inhaled it on my own. Did one container of shiitake and one of baby Bella (cheaper). Also, I agree with increasing aromatics, I used more ginger and an extra clove of garlic, *but* I did not have any scallions on hand. Subbed in thin sliced red onion and jalapeño since I didn’t have named chili or shallot, basil for the mint, and used baby romaine rafts cuz that’s what I had. Vehicle doesn’t matter, was a mid-week killer!Ypsilanti, Mi5/9/2019Agreed that this is simply not worth the effort, especially given the absurdly small amount of food this recipe makes. But the concept is interesting - perhaps I'll try again sometime with tripling the amount of ingredients (which may just barely end up serving four people) and using the food processor instead of chopping everything by hand.AnonymousNYC4/17/2019Not a success.  Nothing really wrong with the dish, just uninspiring.  But definitely not worth the effort.  There are too many good things you can do with mushrooms and too many great variations on lettuce wraps to repeat this recipe.AnonymousSeattle4/7/2019Absolutely make sure you taste while adding the chiles! Our grocery didn't have fresno chiles so I had to substitute, and half of the chile I used was a little too spicy for me, but not in a bad way. This  is oh-so-delicious and quick to come together! Was great served with white rice in lieu of the husband-hated cabbage (which also helped it feel more like a full meal). Absolutely will make again. If I had to make any other changes, I agree with posters below that the mint should be added last. I wanted that herby, green crunch that we weren't getting since we subbed the cabbage. malpalIllinois3/27/2019Absolutely delicious. I subbed half of the mushrooms with a pound of extra firm, high protein tofu to get a little protein into my dinner and spend a little extra time on the stove to brown the tofu really well and get a fine crunch. digimikeyHouston, TX3/10/2019I use crimini, shiitake, maitake and some portobella mushrooms. These mushrooms are so hearty for this dish.Anonymous2/10/2019This mushroom larb is amazing, although I adjusted the aromatics a little bit less, and I would add more mushrooms like probably 2 pounds. I would also adjust on thai chilies that I use. Originally, it was way too spicy. I didn't want to burn customers' tongues. But this recipe is a hit and great.ChefJadeMCalifornia2/10/2019Explore Bon AppétitSaladLarbLaotianSoutheast AsianAsianThaiShiitake MushroomMushroomVegetableChileGreen CabbageCabbageLeafy GreensFresno ChileThai ChileMainDairy-FreeGluten-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "Andy Baraghani"]}