{"id": "f22b2cbf02744a1f2acdea5b07f5cc70", "url": "https://www.bonappetit.com/story/masami-hosono-cooking", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Hairstylist Masami Hosono Just Wants to Be a Chef | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCult Hairstylist Masami Hosono Just Wants to Be a ChefShe has an Instagram account devoted to home cooking, and we're so tuning in.By Jasmine LeeJuly 17, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIt’s Monday morning after Pride weekend in NYC, and I’m following a disembodied voice emanating from the end of a gray hallway. I turn a corner to find the door to a garden-level apartment open. Dressed in a loose, white t-shirt and white skinny jeans, the hairstylist Masami Hosono is standing over a pan of sliced lotus root. Her black hair is closely cropped around her head, and with her lanky, tattoo-covered frame, she reminds me of legendary lesbian icon Jenny Shimizu circa her Calvin Klein days. Disco is playing from two computer speakers on the floor, and a giant bag of laundry sits in the opposite corner. Her cramped apartment is washed in the same soft light as the images on @cashonly.jp, the Instagram account she’s dedicated to documenting her quick home-cooked meals and casual dinner parties.Unless you booked an appointment two months ago, your chances at a haircut with Hosono are pretty much non-existent. Since her Factory-inspired, gender-neutral salon Vacancy Project opened in the East Village in 2016, she’s attracted a mass of clients from all walks of New York’s creative scene. And that advanced appointment will likely be even harder to come by now that she wants to add another title to her name: chef.Today, Hosono is preparing her take on an ichiju-sansai-inspired meal (literally one soup, three dishes): seared salmon marinated in miso-yogurt, seasoned brown rice with hijiki and snow peas stuffed in sweet inari, kinpira renkon (simmered lotus root), and miso soup with slippery nameko mushrooms. She’s using a hot plate—the whole city block has no gas because of a leak. She squeezes a big glob of honey into the pan of lotus root to join the soy sauce, sake, and slivers of dried red pepper, and hits the record button on her phone right as the sauce bubbles into a sticky reduction.Hosono cooking in her East Village home.\nPhoto by Emma FishmanMasami, who just turned 30 last month, identifies as gay or, more playfully, “gaysian.” She recalls the difficulties she faced when she came out at her first hair styling job, where she suffered what she says was months of harassment and hostility. After quitting, she found herself in a desperate position without a sponsor for her visa. After sending out scores of job applications, Ken Kobayashi, owner of Assort International Hair Salons (headquartered in Tokyo, and which Vacancy Project is now a part of), responded within two hours. “He was so confident in my talent and skill. I remember asking him if he was sure he was okay with me being gay, and he said, ‘It’s 2015, everyone is gay.’”Vacancy Project has since become a haven for those seeking a hair-styling experience free of the binary hang-ups common at most salons, even down to the way services are priced. Masami, who is now the salon’s creative director, has given hundreds of her signature grungy, roll-out-of-bed haircuts since arriving in New York. When she’s not styling, she’s modeling in campaigns for fashion labels like Helmut Lang, Rachel Comey, and Sandy Liang, or hosting a monthly queer dance party called Ladylike.Of course, her on-the-go lifestyle has taken a toll on her health. She’s prone to breaking out in hives when stressed, which she attributes to harsh dyeing and perming chemicals, and the lack of access to healthy and affordable food options in the city, which stands in huge contrast to her native Japan. So now, after six tireless years, she’s finally carving out the time to take care of herself, which means no more hair-coloring appointments, plenty of long bike rides to the beach, loads of water, plenty of time with her closest friends, Facetiming with mom, and, most importantly, cooking.For Hosono, cooking at home has been a lifelong lesson in improvisation, resourcefulness, and self-reliance—something she wants to pass on to others. Raised by her single mom, who was often away in Paris working as a pattern-maker for Yohji Yamamoto, it was her grandmother who instilled in her the principles of ishokuju—clothing, food, shelter, or the necessities of life. She taught her recipes for classic nimono, or lightly simmered vegetables and meat, which she still draws from today. Growing up just outside Kyoto, the surrounding Buddhist temples, sensible landscaping, and seasonal cuisine had lasting effects. They come through the most when she softly proclaims, “Mottainai!” or “What a waste!” with a turn of the head while cooking. I guess when you’re a minimalist, everything can be maximized: Scraps of veggies can be used in homemade dashi for miso soup; tofu steaks can be seared off in a sweet chili soy sauce reduction left over from simmering lotus roots for tomorrow’s lunch.Kinpira renkon (simmered lotus root).\nPhoto by Emma FishmanLike her 20-minute haircuts, Masami’s approach to cooking is holistic and unfussy. What started out as a daily ritual in self-care has now become a made-for-Instagram cooking show of sorts. Masami wants everyone to know that the food she grew up with is affordable, delicious, accessible, and looks nothing like sushi. Instead, the new classics she shares on her feed often resemble something out of a Muji café menu, which are like ishokuju snapshots. Through her casual hand-held broadcasts, often accompanied by a colorful soundtrack, she demonstrates the pleasure and simplicity in cooking for one. My personal favorites include a teriyaki salmon rice burger with a drippy egg, a fluffy pancake with savory toppings, and anything that involves natto.“This is like grandma’s food,” she explains as she begins to arrange our meal on the dining table, where an ethereal cloud of pink, yellow, and blue flowers sit in a vintage vase (a gift from her friend, a manager at Dimes). She confidently places a sliver of bright green snow pea on the brown rice inari. “What would you do if you weren’t a hair stylist?” I ask. “I would be a chef,” she replies without hesitation. As the disco continues to play, she reaches her arm high above the table with phone in hand for one last shot before we eat.Explore Bon AppétitHealthyishNew YorkprofileRead MorecultureThis Designer's the Reason You're Seeing Mangosteens on the RunwayBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-17", "author": ["Condé Nast", "Jasmine Lee"]}