{"id": "f2398cd58479b5c12f025a5136775e43", "url": "https://www.bonappetit.com/story/writing-a-novel-body-issues", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Writing YA Novels Made Me Confront My Own Body Issues | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Writing a Y.A. Novel Made Me Confront My Own Body IssuesI had to find a way to tell myself, my protagonist, and hopefully my readers a new story about living in our bodies.By Zan RomanoffApril 1, 2020FacebookTwitterEmailIllustration by Paola SalibyFacebookTwitterEmailWriting for teenagers is tricky. You have to figure out how to talk about the world as it is without reinforcing certain behaviors as interesting or aspirational. This is particularly difficult because writing is almost always a half-subconscious activity. Every time I confront a finished draft, I find my own least-considered self staring back at me. Decades of impacted verbal habits and repressed emotional material—stuff I’d never want to admit to thinking or feeling—surfaces like a whale from deep water.So maybe it shouldn’t have surprised me when I sat down to write my third book, Look, and found its heroine, Lulu, sitting in a small room in her Jewish temple—which looked, hmmm, just like the one I’d grown up going to. She was hungover and miserable and trying to avoid a question from another girl, Kiley, about whether she ever eats carbs.“Do you watch me eat?” Lulu shoots back at her.“You know how it is,” Kiley says. “I mean, you’d be lying if you said you weren’t watching too, right?”I wrote:Lulu doesn’t know what to say to that. Of course she’s watching: what she eats and what everyone else eats. She does it so instinctually that she doesn’t even think of it as a thing she does, any more than she would think of breathing as, like, a hobby, or a pursuit.Even then I knew that it was among the most revealing series of sentences I had ever composed. Writing about Lulu’s relationship to food and her body, which she knows is not fat and still cannot grasp as thin, exposed me to myself––and would eventually, in turn, expose that self to the world.I wanted to write a girl who was not always good.I usually think of my relationship to food as lucky. My experiences of disordered eating were, relatively speaking, brief and mild. My body dysmorphia probably isn’t any worse than any other American woman’s. I discovered body positivity and intuitive eating in college, in time to create a set of mostly-healthy habits that have carried me through my adult life so far. And the world around me has blessedly few opinions about what I look like: I am white, cis, straight, abled, and still small enough that I can eat whatever I want in public without scrutiny or censure.And, for most of my life I was lucky to have a body that did what I told it to. Without a ton of work on my part, it stayed roughly the same size from my late teens through my late twenties.Then a handful of things happened at the same time. I started taking Lexapro to deal with what had become an unmanageable anxiety disorder. I started boxing and lifting weights, which added bulk. And I hit my early thirties, when metabolism tends to start slowing down anyway.And so, just as I was writing Look, I was also doing something that would probably scandalize Lulu—that would have scandalized many iterations of my younger self. I gained some weight.What felt like all of a sudden, dresses I’d been wearing since high school wouldn’t fit over my ribcage, much less my boobs; I had to give up expensive pairs of jeans and a beloved leather jacket that I’d bought with the blithe certainty that they were good investments because I’d wear them forever. And after so many years of paranoid uncertainty about what my body might or might not look like, finally there was incontrovertible proof: my clothes told me plainly that I was larger than I had been before.In 2015, mega-bestselling YA author John Green apologized for having a character use the slur “retarded” in one of his early books, tweeting, “At the time, I thought an author's responsibility was to reflect language as I found it, but now... eight years later, I don't feel like a book about humanizing the other benefited from dehumanizing language.”I had those words on my mind as I wrote Look. Part of the project of the book had been to talk honestly about what it’s like to grow up among the rich and privileged in LA, which meant that the topics of weight and body image couldn’t be avoided.On the one hand, I wanted to authentically describe what it’s like to be socialized as female in this country; I wanted readers to be shocked and upset and maybe a little relieved to see that shameful, obsessive part of their brains rendered articulate on the page. I wanted to write a girl who was not always good. Not a strong female character, but a person who’d been put under pressure by her world, and who had cracked, just a little bit, from the strain.But on the other hand, I didn’t want to suggest that Lulu’s obsession with food and weight was useful, or normal, or, god forbid, cool. And I desperately didn’t want to alienate readers whose bodies didn’t look like hers, who might feel judged the way she judged herself.My own attitude toward food and weight had been formed by beauty magazines and diet culture and the idea that, if I yelled at myself all the time, it would “keep me in line,” whatever that’s supposed to mean. Even when I found out about body positivity, I couldn’t seem to actually uproot all of this bad thinking, so for years I ignored it instead. Now I had to confront it. I had to find a way to tell myself and Lulu and hopefully my readers a new story about living in a body that has never done you any harm but that you still have to try very hard to like, let alone love.Even when I found out about body positivity, I couldn’t seem to actually uproot all of this bad thinking, so for years I ignored it instead.It helps enormously that my personal weight gain is basically a cosmetic issue; doctors will still treat my symptoms rather than my size. And so getting bigger was and is, of course, uncomfortable, but also weirdly liberating. When I considered it—when I allowed myself to look at my life head-on—I realized that the thing that was supposed to be the worst thing had happened to me, and almost nothing in my life had actually changed, aside from the number on the tag in my clothes.In fact, actually, I am much happier now than I ever was when I was thinner. When my body changed, it was because my life was changing for the better. Before Lexapro, I was having panic attacks almost every time I left the house; since I started taking it, not one. I love boxing, and it’s been the best exposure therapy for my type-A self to have to submit to the coaches’ critiques of my form every week.When I ask myself the question, would I go back to my old size if it also meant having to go back to my old life? I find that, ultimately, it isn’t even tempting. Because weight gain is not, as I had been led to believe, something that just happens to you if you aren’t vigilant enough. It is not a sign of sloth or failure or moral or physical turpitude.Instead, for me, it is part of my story; something I participated in, made choices to create. My body as it currently exists is not a curse or a punishment. It is the result of my own hard and conscious work to survive my life and enjoy it as much as I am able.Towards the end of Look, Lulu asks the girl she’s hooking up with, Cass, a question: “Do you like my body? You know. The way it is now.”I wrote:She knows that Cass will say yes no matter what she actually believes, and that even when she says it, it won’t make Lulu feel any better. People have been telling her that she’s thin her whole life and it’s never made her feel like what she imagines a thin person feels like. Which is mostly: someone who doesn’t have to ask this question.That felt like the most peace I could offer Lulu at seventeen: the revelation that how she feels about her body has almost nothing to do with how it looks, much less what it is capable of. The seed of the idea that other people’s opinions, positive or negative, will never do for her what actual, radical, deep-rooted self-acceptance might.There’s more and better coming for her later, I’d like to believe. But your own relationship to your body is a life’s work, and it didn’t feel right to solve her problems completely, to suggest that she was going to walk off the book’s last page and into some kind of eternal zen.I don’t know that I succeeded with the book. You never know what readers will find there until they start telling you. But what I do know is that writing Lulu’s food-obsessed inner monologue, in all of its unvarnished shittiness, helped me come to terms with my own.Writing Lulu reminded me, viscerally and intimately, of how hard we have to work to unlearn stories that tie up our weight and our worth; it helped me see work I have done and work I have yet to do. And it helped me hear myself a little more clearly. Which means that hopefully I can continue to deal with those parts as they come up, quieting them as best I can, instead of spending the rest of my life valiantly, uselessly pretending they don’t exist.Explore Bon AppétitHealthyishessayRead MoreLifestyleI Thought Taking Pictures on Vacation Was a Waste of Time Until I Saw This Photo of MeBy Zan RomanoffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-01", "author": ["Condé Nast", "Zan Romanoff"]}