{"id": "f240b61f1da09dac54d6d8ca2631216f", "url": "https://www.bonappetit.com/recipe/coconut-strawberry-ice-cream-pie", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Coconut-Strawberry Ice Cream Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueCoconut-Strawberry Ice Cream PieBy Kat BoytsovaJuly 10, 20183.8(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Alison Attenborough, prop styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintSure, the ice cream is store-bought and the no-bake crust uses graham crackers, but this stunning frozen pie is anything but humble. When a crunchy salted press-in crust and swirly fruity ice cream team up, everyone wins. This recipe is pie without baking and an ice cream sundae without the fuss. Success can be yours—just keep everything cold as you go.Ingredients8–10 servings Crust1cup unsweetened shredded coconut6oz. graham crackers½cup virgin coconut oil¾tsp. kosher saltNonstick vegetable oil sprayFilling and Assembly2pints coconut ice cream or gelato (not dairy-free)2pints strawberry ice cream or gelato6oz. strawberries, hulled, halved, quartered if large1Tbsp. fresh lemon juice1Tbsp. sugarPreparationCrustStep 1Place a rack in middle of oven; preheat to 350°. Toast coconut on a rimmed baking sheet until golden brown, 3–5 minutes. Let cool 5 minutes.Step 2Place graham crackers in a large resealable plastic bag, seal, and crush to fine crumbs with a rolling pin or heavy pot. Transfer to a medium bowl. Add toasted coconut, coconut oil, and salt and mix well. Mixture will look quite crumbly and dry at this point, but it will come together as it chills.Step 3Lightly coat a 9\" pie dish with nonstick spray. Transfer graham cracker mixture to pie dish and press evenly and very firmly across bottom and up sides of dish with a flat-bottomed measuring cup (make sure crust extends all the way up to the lip of the dish). Chill until ready to fill (at least 20 minutes).Filling and AssemblyStep 4While the crust is chilling, remove coconut ice cream from containers (just peel away container if it’s paper, or use a rubber spatula to help slide ice cream out intact if container is plastic). Cut ice cream into 2\" pieces and place in a medium bowl. Repeat with strawberry ice cream, placing in a separate medium bowl. Let sit until slightly softened, about 5 minutes, then stir each, separately, with a large rubber spatula or wooden spoon until the consistency of thick cake batter. Transfer bowls to freezer and chill ice cream 10 minutes.Step 5Remove ice cream from freezer. Scrape strawberry ice cream into bowl with coconut ice cream. Fold together a couple of times with spatula until swirled. Don’t overmix; you want thick marbled ribbons. Chill in freezer 10 minutes.Step 6Scrape marbled ice cream into crust. Using a large spoon, create deep decorative swirls in ice cream (the strawberries will be poured into these divots later). Freeze until ice cream is very firm, at least 6 hours.Step 7Toss strawberries, lemon juice, and sugar in a medium bowl. Let sit at least 35 minutes and up to 1 hour.Step 8Remove pie from freezer and lower the bottom of the pie dish into a shallow bowl of warm water; hold it there 5 minutes (this will help slices release more easily). Spoon strawberries into divots; if you run out of places to contain them, reserve extras for serving.Step 9Running the blade of a chef’s knife under hot water and wiping dry before first cut and repeating as needed between cuts (this will give you neat sides), slice pie into wedges. Serve with any remaining strawberries alongside.Step 10Do Ahead: Pie (without berries) can be made 1 week ahead. Cover with plastic wrap once hardened and keep frozen.How would you rate Coconut-Strawberry Ice Cream Pie?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis was excellent! Like another reviewer, I also could not find straight coconut ice cream/gelato and went with a pineapple coconut variety. Everyone loved it. Will definitely make it again.surfbirdChicago10/22/2018This pie was a huge hit at a recent dinner party.  I whacked it up into 8 big pieces and initially, my friends said, \"There's no way I can eat all that!\"  Don't you know, every plate was clean.  So easy to make too, and the salty crust perfectly sets it off.  I couldn't find coconut ice cream so I went with pineapple coconut -- fabulous with the strawberry!aerieBainbridge Island, Washington8/23/2018What on earth has happened to Bon Appetit that a recipe can be posted with the advice to decorate the sh*t out of it!  Where has propriety gone?  Before our house fire of 1998, I believe I had nearly every issue of Bon Appetit ever published.  My magazines filled huge shelves. My favorite recipes were always from Bon Appetit. I have recently (sadly) decided not to continue my subscription. I am 75 years old and my 7 children and 26 grand children will not know what to do with all your magazines I have collected since our 1998 devastating fire. I am sick of the  talk I hear too frequently by your writers,  do you realize your most loyal longtime readers do not swear nor do they  feel they need to in order to make a fabulous meal for family and friends. Please clean up your act!  Geri in Spokaneggrstampsspokane8/13/2018Explore Bon AppétitPieDessertFrozen DessertAmericanGraham CrackerOther IngredientsStrawberryBerryFruitSummerSpringEasyJuneteenthFourth Of JulyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Kat Boytsova"]}