{"id": "f244bbf63a7bf89d4fb6541e582a196e", "url": "https://www.bonappetit.com/story/instant-pot-chicken-stock-recipe", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Instant Pot Chicken Stock That’s Just As Flavorful As the Slow-Cooked Stuff | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingInstant Pot Chicken Stock That’s Just As Flavorful As the Slow-Cooked Stuff40 minutes instead of 3 hours babysitting the stovetop? Sign us up.By Alex BeggsDecember 3, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailHey, don’t just throw some stuff in there. I know you want to; I see that bag of leftover carrots in your hand. The Instant Pot has that appeal. And one of the best uses of the popular pressure cooker is making homemade stock in a fraction of the time as the stovetop stuff. Think 40 minutes instead of three hours, totally hands-off so you don’t have to keep an eye on how much it’s reducing. But getting the balance of flavors right is key, otherwise you end up with sweet carrot water, or cloudy celery juice. (If either of those sound good to you, though, just toss carrots and water into pot and press go!) So Carla Lalli Music developed two recipes, for Instant Pot chicken stock and vegetable stock, that make deeply flavored results. Here are some Instant Pot stock tips (low risk, big reward!) we picked up along the way:For Vegetable Stock, Brown Those Vegetables FirstTaking 6 minutes to brown the onions, celery, carrots, mushrooms, and garlic makes SUCH a tastier vegetable stock. And you can do it right in the Instant Pot using the sauté function. We sipped it straight, it was so good. The mushrooms add a hearty deep woodsy flavor, plus umami, and we consider them non-negotiable. Without them, the carrots and celery really take over. Speaking of...Watch Your Carrot and Celery InputTwo of each, please. We tested with different ratios, and found that too many carrots can make a veg stock super sweet and overpowering. You need the celery to balance that sweetness and round everything out. These aromatics disappear into the stock and end up complementing what you’re cooking later, whether it’s risotto or soup or grains. That’s why we skipped stronger veg like fennel or celery root. Too rowdy!Chicken stock, so nice and clear!\nPhoto by Chelsie Craig, Food Styling by Kate BuckensFor Chicken Stock, Simmer FirstAnother little step that makes a huge difference. Add all the ingredients, and then use the Instant Pot’s sauté function to simmer everything for a few minutes. A foam will form at the surface, and then you skim it off before going on your merry pressurizing way. Impurities (nice word for gross stuff, blood, protein deposits in bones) float to the surface when you simmer the stock, and skimming it all ensures a nice clear, non-cloudy stock.For Both Stocks, 40 Minutes Is the Magic NumberCarla, a famous cat lady, told me that pressure cooker time is like cat years—it moves fast. We first tested the stock at 30 minutes and it was a little thin, while 40 minutes made a world of difference. The flavor deepened, the consistency was brothy but not thick, and the color was deep amber (veg) and a nice light brown (chicken). These are stocks that usually take two to three hours on stovetop, so any recipe around that time can be converted to Instant Pot stock in 40 minutes (like this turkey stock). Stocks that we wouldn’t do in the IP: garlic broth (it’s already only 40 min!), dashi (kombu gets bitter), and any other stock that’s ready in under an hour.Get the recipes:Instant Pot Chicken StockYou will get as much richness and depth from this stock after 40 minutes under pressure as you would from 3 hours of simmering on the stovetop.View RecipeInstant Pot Vegetable StockBrowning the onions and using mushrooms gives this stock a deep golden brown color and plenty of structure and savory flavors.View RecipeExplore Bon AppétitInstant PotBrothStockSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-03", "author": ["Condé Nast", "Alex Beggs"]}