{"id": "f25be44dcdfc580e198eed7aa180fcef", "url": "https://www.bonappetit.com/story/childhood-food-insecurity", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "I Grew Up With the Shame of Food Insecurity. Decades Later, I Still Obsess Over What I Eat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Grew Up With the Shame of Food Insecurity. Decades Later, I Still Obsess Over What I EatJust looking at a can of green peas can bring the old feelings flooding back.By Kimi CeridonJune 23, 2021FacebookTwitterEmailIllustration by Patricia DoriaFacebookTwitterEmailI remember watching my mother stand at the supermarket register, anxiously tugging at her shaggy dark blonde hair, repeatedly tucking it behind an ear. Her green eyes, amplified by thick glasses with rose-tinted plastic frames, scanned the running total. She’d hold an envelope open with one hand and whip out coupons like a blackjack dealer, placing them on each corresponding item to make sure the cashier scanned them together.She knew the total before we got to the checkout. She used a ballpoint pen to calculate it on a palm-size notepad while she shopped. To be safe, though, she always loaded the conveyor belt with the most essential food items first—sandwich fixings, eggs, milk, log-shaped rolls of fatty ground beef, canned tuna, canned and frozen vegetables, soups, and pasta. If budget allowed, she’d add chicken, fresh fruit, snacks, or a bag of chips last.My mom was a full-time airline reservation agent and my dad ran a small janitorial franchise in a suburb of Denver, but their bank account always teetered near zero. Before instant bank transactions, my mom knew she could write a check Friday evening to buy groceries for the whole week. She incurred overdraft fees, but three meals materialized every day. She made the cheapest ingredients stretch, carefully portioned to make sure we ate. But we were all too aware that money was in short supply.A study published in 2018 found that children who grow up with food insecurity more frequently emotionally overeat and disregard satiety. Even when they no longer experience scarcity, they worry they could again.“We know when people don’t have regular access to food, they tend to hoard it,” explains Alexis Conason, a clinical psychologist in New York City and author of the forthcoming book, The Diet Free Revolution. She emphasizes that hoarding in the face of scarcity “is a very healthy and natural way of thinking. It’s part of survival.”At meals, mom preferred to divvy our food among plates rather than watch my brother, my sister, and I argue over who got more. Mom got what was left, and in hindsight, I wonder if her never-ending diet was an excuse to give herself the smallest portion. Dinnertime was a competition for who could shovel food into their mouth the fastest. Sometimes, if the grocery budget was slim, hunger pangs lingered after we were done. My stomach seemed to always volley between growling for more and overflowing.My mom cooked as healthfully as she could, with vegetables at every meal (even though they usually came from a can). We never drank soda. Sugary snacks were special treats at holidays. When they did come, I’d be sure to eat mine before anyone else could ask to share. The rare candy bar would go down with little chance of tasting it—chomp, chomp, chomp.But despite it all, I was a chubby kid. I took comfort in food. If I had a difficult day at school, I would peel slices of bologna out of the package, arrange them on a paper towel, then pop them in the microwave for 20 seconds. When they came out steaming and dripping with fat, I’d tear out the center of each slice to eat first. That part stayed cool and supple. I’d suck on the crispy edges, letting the salty oil spread over my tongue. Although my mom probably noticed the missing food, I felt like this was my own little secret indulgence, eaten locked in the bathroom, sitting on the toilet.It wasn’t just bologna. I’d sneak off with cellophane-wrapped pieces of American cheese, hot dogs swiped from an open package, handfuls of cereal stuffed into my pocket, or a stealthy scoop of leftovers, my intrusion concealed with a stir. All were consumed behind closed doors. Embarrassment drove me to binge alone. I hated my changing body, but I also craved the soothing comfort of filling my belly. According to Conason, feeling this kind of stigmatization is not unusual when “the urge to feed ourselves is part of a culture of shame.”Last July, at the height of the second wave of COVID-19 infections, the Brookings Institute estimated nearly 14 million children in the United States lived in households facing food insecurity. Just as my mom did, many parents make sure their kids get fed even if they can’t provide for themselves. However, just like my siblings and I, these kids probably know their food is scarce. Not only that, but they’re put at risk of developing disordered eating habits as they grow up.Clancy Harrison—a Registered Dietitian, founder of the Food Dignity Movement, and a Fellow of the Pennsylvania Academy of Nutrition and Dietetics—runs the Al Beech West Side Food Pantry in northeastern Pennsylvania. Harrison pivoted her food pantry from an in-store market to a curbside distribution center during COVID. “Food pantries no longer just fulfill emergency needs,” she explains. “Most of the people who come to our pantry are repeat customers.” Like Conason, Harrison believes food elitism and the culture of shame around food insecurity leads to stigmatization and, ultimately, a fraught relationship with food.In eighth grade, a group of boys taunted me about my weight by making cow noises when I walked by. First, there would be one throaty “Moo.” Then the hallway would echo with mooing all around me. I think some people joined in unwittingly, thinking it was just a funny chorus.Determined to stop the teasing and start high school skinny, I began severely limiting calories. I avoided my mother’s ground beef concoctions from her weekly shopping trips, opting instead for dry wheat toast topped with half a can of water-packed tuna and a sliced hard-boiled egg for lunch and dinner. I’d exercise until I was trembling, and shoplift diet pills. I tried to curb my secret bathroom binges, but shame over my body only compelled me to seek the comfort binging offered.In high school, I quit taking my mom’s bagged lunches. Instead, my meager allowances went to packs of Marlboro Reds and Diet Cokes. I usually could afford only one item from the 59-cent menu at Taco Bell. Although I’d come home famished, I’d lie about where the day’s money went.Binge and deprivation cycles continued into college. I worked at two fast-food joints, which meant I could avoid paying for food. So, I either gorged on free burgers and pizza or ate virtually nothing, smoked cigarettes, and drank beers.At the time, it seemed like normal young adult behavior—everyone dieted, everyone smoked and ate junk food, and everyone went on eating and drinking benders. Now, I know my eating cycles were a reflection of my self-worth. When I hated my body, I deprived it of nutrition. When I needed comfort, I filled my emptiness.“Whenever there is a history of food insecurity, whether access is limited because of financial reasons or because of diet culture reasons, it encourages a distorted and disconnected relationship with food,” Conason says. “Not knowing how to view food in relation to health can create a conflicted relationship.”I’m in my 40s now. I managed to escape the cycle of poverty after I got a master’s degree in mechanical engineering and spent years working in the tech sector. I don’t have trouble putting food on the table anymore. I’ve given up cigarettes, soda, diet pills, and pasty bean burritos. But I still obsess over food. I am still learning to recognize my own fullness. I’m still trying to stop devouring meals like I did as a kid. I don’t buy snack foods because I know I can’t stop eating them all in one sitting. I don’t sit in a locked bathroom binging, but I have an unconscious perception that food is scarce. My appetite is insatiable in the presence of finger foods. Shared appetizer platters beckon me like a siren: “Eat me before someone else does.” I go bonkers over food waste, wanting to save it from the trash by eating it. I still haven’t figured out how to quit cycling between eating my feelings and eating as little as possible.I also get ferocious if I think my husband didn’t equally portion a meal. Harrison explains that this is an example of a learned habit called food negotiation. “If a five-person household has five hot dogs, there is no negotiation; everyone gets a hot dog,” she explains. In wealthier families, rather than focusing on equal shares, food negotiation centers on picking between the healthiest hot dog, the best-tasting hot dog, the organic hot dog, the hot dog made most humanely, or the most Instagrammable hot dog. Someone with a history of food insecurity may choose the organic hot dogs, but an obsessive need for equality may still dominate the way they negotiate food sharing, regardless of appetite.Take, for example, the other night, when I told my husband, “I’m not that hungry.” In response, he took a larger portion of the meal—and I felt a strong flash of anger seeing the unequal division, even though I myself had requested it. It’s taken decades for me to realize that this sensation isn’t about hunger. It’s about the way I learned food negotiation, out of scarcity, at a young age.During the pandemic, I spent several days a week volunteering at the Mystic Community Market in Medford, Massachusetts. Launched in February 2020 to provide free groceries for families in need, the market quickly went from “Grand Opening” infancy to serving nearly 300 families per day as national rates of food insecurity skyrocketed, spurred by widespread unemployment caused by COVID-19. Researchers at Northwestern University estimate that rates of hunger, at a historic low in 2019, more than doubled in 2020, hitting nearly one in four U.S. households.At the market, I filled bags with food and helped staff the curbside distribution tent as the line of cars zigzagged out of the parking lot and snaked down Mystic Avenue toward Interstate 93. The repetitive work and ample heavy lifting offered a much-needed physical outlet. Chatting with other volunteers was my only outside social activity. Besides, the Tetris-like skills it took to fit a week’s worth of food into one bag was meditative.Then one afternoon, I grabbed a can that pulled me out of my zen. Green peas. “I hate green peas,” I couldn’t help but mutter aloud, instantly transported back to my childhood kitchen table, picking through clumps of deflated, anemic globs. My visceral reaction was a reminder of how these memories, and the shame attached to them, still affect me today. How the widespread food insecurity of this past year will continue to affect and distort 14 million hungry kids’ perception of food, even decades later.The solution is not to treat eating disorders later, when these kids grow up. The solution is to eliminate food insecurity now, and to recognize it for the long-term problem it can become. In Pennsylvania, Harrison is working with the state’s chapter of the American Academy of Pediatrics to create a multidisciplinary approach, where physicians work with food pantries to screen for food insecurity. These kinds of partnerships give doctors a tool for combating hunger and, in the process, reduce the illnesses, both mental and physical, to which food insecurity so often leads. For Harrison, the solution is to move hunger relief out of the world of charity and donations and into that of health care and disease prevention.As a kid, I felt ashamed because my family couldn’t afford good food. In the years since, I’ve felt ashamed because I grew and gained weight, ashamed because I was sad and hungry, ashamed because I couldn’t stop thinking about food, and ashamed because I so rabidly negotiated food around equal portions. But by acknowledging that being able to feed ourselves is a form of health care—and treating it as such—perhaps we can eliminate the culture of shame around food, eating, and food insecurity, so that no kid has to go through what I did.Explore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-23", "author": ["Condé Nast", "Kimi Ceridon"]}