{"id": "f25f2f688b1ce6be9ad81af27bb241c5", "url": "https://www.bonappetit.com/recipe/basically-fried-chicken-sandwich", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Crispy Chicken Cutlet Sandwich Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesThe Basically Fried Chicken SandwichBy Claire SaffitzMay 22, 20184.7(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintOur incredibly simple method for breading chicken thighs (no brine! no seasoned flour! no dipping!) is based on karaage, a type of Japanese fried chicken. Using a high-sided vessel like a Dutch oven for frying—instead of a shallow skillet—helps to cut down on any obnoxious splatter.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketPaper Towels$13.45 At AmazonPlastic Bag$11.70 At AmazonDutch Oven$80 At AmazonInstant-Read Thermometer$35 At ThermoworksSmall Bowl$13 At AmazonSpoon$24.69 At AmazonTongs$13 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonWire Rack$23 At BA MarketIngredientsMakes 44skinless, boneless chicken thighs (about 4 oz. each, 1 lb. total)4Tbsp. seasoned rice vinegar, divided2Tbsp. soy sauce, dividedKosher saltFreshly ground black pepperNeutral oil, such as vegetable or peanut (for frying; 4–6 cups)½cup mayonnaise2Tbsp. Sriracha4soft seeded hamburger buns¼small head green cabbage2scallions⅓cup cornstarchPreparationStep 1Pat 4 chicken thighs dry with paper towels, then transfer to a large resealable plastic bag. Add 2 Tbsp. rice vinegar and 1 Tbsp. soy sauce to bag. Sprinkle in a pinch of salt; season with pepper. Seal bag, pressing out air, and work chicken around inside bag to coat. Let sit while you prepare the other components.Step 2Pour oil into a Dutch oven to come 1\"–1½\" up the sides and heat over medium-high (the high sides make for less splatter during frying). Every few minutes check oil temperature with an instant-read thermometer. You want it right around 350° (this will take about 10 minutes total). As it surpasses the 300° mark, reduce heat to low to maintain.Step 3Stir ½ cup mayonnaise and 2 Tbsp. Sriracha in a small bowl with a spoon until smooth.Step 4Preheat boiler. If broiler element is at the top of your oven, move rack to highest position. Broil 4 buns (you can place them directly on the rack), cut sides up, just until surfaces are golden, less than a minute. Use tongs to remove and set aside.Step 5Very thinly slice ¼ head of cabbage and transfer to a medium bowl. Thinly slice 2 scallions; set aside for assembly.Step 6Remove chicken from bag with tongs, letting excess marinade drip back into bag, and transfer to another medium bowl. Add ⅓ cup cornstarch to bowl and toss with tongs until chicken is completely coated in cornstarch.Step 7Check oil and adjust temperature so thermometer registers around 350°. Carefully lay chicken into hot oil and cook, turning occasionally to prevent one side from browning too quickly, until crust is crispy and dark brown, 5–8 minutes. Keep an eye on your oil temperature, which will drop when you add the chicken; increase heat if needed to maintain 350°. Transfer chicken to a wire rack and let cool about 5 minutes.Step 8Meanwhile, toss cabbage with remaining 2 Tbsp. rice vinegar and 1 Tbsp. soy sauce.Step 9Spread about 1 Tbsp. Sriracha-mayonnaise across toasted sides of buns with the back of a spoon. Sprinkle reserved scallions over bottoms of buns, then arrange chicken over. Divide slaw evenly over chicken, then close with tops of buns.How would you rate The Basically Fried Chicken Sandwich?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleExcellent! Air Fryer: after cornstarch spray each side with non-stick cooking spray. Cook at 390 for 20 minutes! So easy and delicious!JeffChicago 1/10/2022This is by far the best sandwich I've ever made.  I added a little garlic and lemon juice to the mayo as well to give it more of a kick.  It's great on its own, but this recipe is such a great base to change based on what you have in your pantry.  The soy sauce/rice vinegar marinade is surprisingly flavorful, even after only sitting in it for about 15 minutes.  This is definitely worth a spot in the regular rotation.Anonymous7/12/2021Doesn’t get much easier than this! I have this as one of my back-pocket weeknight meals with some french fries and it always hits the spot. AnonymousKansas City, MO8/7/2020Best sandwich ever! \n\nEven better left over the next day. I make these all the time. Don’t skip anything, just make it exactly as stated. Soooo good! NancyMS7Milwaukee, WI8/1/2020Delete my last review....wrong chicken sandwich!Jessica BoyleVirginia Beach, Virginia5/23/2020I made this a few weeks ago, even using the Crystal hot sauce which I never used before.  Really good, but even better the next day - I didn't really taste much the night I made it, but the next day I could definitely taste the hot sauce. Really easy to make too.Jessica BoyleVirginia Beach, Virginia5/23/2020I made this and it was so tasty. I didn't make the slaw however b/c my family voted against it. I would have to say my favorite part was the Sriracha mayo. I dipped my fries in it too. AnonymousNorth Carolina 4/25/2020I loved this, what a great combo of flavors! The only thing I would change is because I substituted with chicken breast, and didn’t pound it flat enough, the sandwich was very tall and hard to eat. Didn’t stop me from just unhinging my jaw and going for it though! JuliakWashington DC4/23/2020This recipe is GENIUS! It has done the heavy lifting for you—it’s brilliant. I couldn’t believe we could make such a fantastic sandwich at home. Thank you, Claire Saffitz, for a new house favorite! kim_herrmNashville, TN4/19/2020So easy to make, and one of those recipes where you probably have everything you need in the houseAnonymousAustralia3/31/2020i skipped the ziploc bag and it turned out greatPaul Bushreno11/14/2019Such an easy, and DELICIOUS sandwich! Don't skip the cabbage. Seriously...DON'T SKIP THE CABBAGEAnonymousCALIFORNIA10/25/2019HELL YES. I spent the long weekend visiting my boyfriend in Denver, and we made this recipe three times over the course of 4 days, that's how much we liked it. Easy to follow instructions, and incredible flavor. The chicken stays so moist on the inside and the cornstarch gives a great crunch and browning. Highly recommend.AnonymousColumbia, SC10/17/2019Great recipe! I used chicken breast that I pounded lightly, since that's what I had on hand, and it was delicious. Can't believe the chicken turned out so nice and crispy without having to go through the whole flour/egg/breadcrumb routine. Also, don't skip the slaw! It provided some acid and crunch that worked really nicely with the sandwich. I did add thin slices of jalapeños for heat and loved it.AnonymousFigaro2159/5/2019Simple to make and super delicious. Everything is perfectly balanced in this recipe. Have already made multiple times. AnonymousDallas6/16/2019Explore Bon AppétitSandwichChicken ThighChickenPoultryEasyWeeknight MealsMainFryLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Claire Saffitz"]}