{"id": "f26fe302fbe2ef1cddabd72a2fbf62c2", "url": "https://www.bonappetit.com/story/juneteenth-2020", "year": 2020.0, "month": 6.0, "day": 3.0, "content": "For Three Philly-Born Chefs, Juneteenth 2020 Is About Looking Back—and Pushing Forward | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFor Three Philly-Born Chefs, This Juneteenth Is About Looking Back—and Pushing Forward“As long as there’s Black joy, it’s already a legit celebration.”By Michael W. TwittyJune 18, 2020FacebookTwitterEmailPhotos by MAMADI DOUMBOUYA, FOOD STYLING BY PEARL JONES, PROP STYLING BY SHANNON MALDONADOFacebookTwitterEmailI remember it well. Chef Omar Tate, looking up amid the whiffs of smoke and sound of hot links sputtering on the grill, wiping his brow, mouth pushing toward a smile of satisfaction as he surveyed the scene. People dancing, playing dominoes, talking about music and politics. Ben Bynum, the local legend behind several Philly restaurants and jazz clubs, sprinkling paprika atop his famous potato salad. Kurt Evans, then the chef and culinary director at Drive Change, checking his barbecued chicken for doneness. DJ Jazzy Jeff & The Fresh Prince’s “Summertime” playing on the radio, punctuated by the call of the muezzin at the local mosque beckoning people to prayer.But as my South Carolina grandfather used to say, “Time go, time go.” It now seems like decades have passed since that backyard Juneteenth cookout in Philadelphia, though it was only last year. In the intervening months, COVID-19 has made large gatherings impossible; it has exposed long-standing socioeconomic and health disparities in the immutable terms of a body count proportionally higher in Black and Brown communities. A trio of high-profile racially motivated murders of African Americans, followed by others, has forced the entire nation (and many other parts of the globe) into acknowledging the twin sins of anti-Blackness and the overreach of law enforcement—a crisis of violence against people of color. And so, as America collects itself and corrects its memory in preparation for yet another Juneteenth, everything is the same, and yet, everything is new.Chef Omar Tate\nPhoto by MAMADI DOUMBOUYATate makes his shrimp salad extra creamy with a blend of cream cheese and sour cream.\nPhoto by MAMADI DOUMBOUYA, FOOD STYLING BY PEARL JONES, PROP STYLING BY SHANNON MALDONADOJuneteenth is one of the nation’s only deliberate observances of the formal ending of racial chattel slavery. Though President Lincoln issued the Emancipation Proclamation in late 1863, it wasn’t until June 19, 1865, just after the Civil War ended, that the U.S. Army forced Texas slaveholders to comply. Until then most had continued to rely on enslaved labor, using their relative geographic isolation to withhold the knowledge that freedom had come.The liberation celebration, often centered on food, spread among African American communities in the South through the early 1900s, and during the Great Migration, across the country. Today millions celebrate some version of the holiday, though how they do it varies widely by region.At last year’s Philadelphia Juneteenth cookout, the South was present but not dominant. Tate, Bynum, and Evans were all born in Philly, but their roots span Virginia, the Carolinas, Georgia, Louisiana, and beyond. The stoops and tighter quarters of the urban North meant the barbecue came from a grill instead of a traditional pit; the music from a radio instead of a gospel choir. The chefs’ shared Islamic faith, common in Philadelphia, also played a part: Beef, chicken, and shellfish were favored over pork. But still, African-based folk tradition was observed in the serving of symbolically red foods—punch, bell peppers, paprika—which Tate said were meant to show reverence for their ancestors’ perseverance. Large-scale desserts like Bynum's brown butter peach cobbler were made with the kind of loving care that turns a block into a village.Bynum's famous peach cobbler is swirled with crunchy ripples of brown butter.\nPhoto by MAMADI DOUMBOUYA, FOOD STYLING BY PEARL JONES, PROP STYLING BY SHANNON MALDONADOChef Ben Bynum\nPhoto by MAMADI DOUMBOUYATate has been connecting food and history since 2018 through his successful pop-up, Honeysuckle, where he explores the ongoing narrative of Black existence through highly personal dishes and stories. Cooking on Juneteenth with Bynum and Evans last year was a family reunion of sorts; the chefs mixing and matching recipes from their mothers while drawing upon the historic legacies of more distant ancestors.“I want my son to know how important it is to preserve our culture,” Tate told me then as he passed a plate to 12-year-old Bashir. “We don’t need to assimilate or upgrade to be as good as anyone else. As long as there’s Black joy, it’s already a legit celebration.”Since last year, all of our chefs have experienced drastic changes in their professional and personal routines to survive in an anxiety-ridden new world. Immediately after COVID-19 decimated the restaurant industry, Tate moved from New York City back home to Philly, where he now trades off kitchen space at South Philly Barbacoa with Evans. The two chefs take turns providing affordable take-out meals to the community through both Tate’s Honeysuckle pop-ups and Evans’ new program, Everybody Eats. Evans is currently rebooting his Down North pizza shop for soft openings while keeping alive his mission to recruit and hire the formerly incarcerated, who are being hit particularly hard by COVID-19. “We need to let people out accordingly,” he says, “people with minor offenses, elders—otherwise we will have a bigger crisis on our hands inside and outside of the prisons.”Chef Kurt Evans\nPhoto by JONATHAN COOPERA grill full of hot links and Evans' Sticky Barbecue Chicken\nPhoto by MAMADI DOUMBOUYA, FOOD STYLING BY PEARL JONESAs Tate wrote recently in an essay for Esquire, federal bailouts won’t save pop-ups like his, just as the government won’t save Black America. In a rush to save the restaurant business, many Black culinarians have found themselves left behind while corporations sop up much of the funds. Yet despite serious tragedies and setbacks, including Tate losing a beloved uncle to the virus, our three chefs have used the power of community to keep moving ahead, creating new paradigms based on old practices. As Juneteenth returns once again, this intersection of revolution and evolution means the recipes and culture expressed here will endure even as their creators morph to meet the demand for tastes of a pre-COVID-19 world.And so, Tate turns once again to his son, who is now coming to grips with the enormity of racial strife in American life. “You don’t know how much power you have,” he tells Bashir. Then he turns to me: “It’s challenging, but this is a living teachable moment. It’s an opportunity to educate my son on where we’ve been and where we’re going. And through all this, the Black joy must not stop.”Michael W. Twitty is a culinary historian, scholar, historical interpreter, and James Beard Award–winning author of The Cooking Gene: A Journey Through African American Culinary History in the Old South. He is currently at work on a second book. Find him on his blog, Afroculinaria.Get the chefs’ Juneteenth recipes:1 / 8ChevronChevronPicnic TomatoesView RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-18", "author": ["Condé Nast", "Michael W. Twitty"]}