{"id": "f27e75eea0d66d83cf4b605d1dd91708", "url": "https://www.bonappetit.com/story/freeze-peach", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Can’t Find Perfect Summer Peaches? Don’t Sweat: Frozen Are Great, Too | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCan’t Find Perfect Summer Peaches? Don’t Sweat: Frozen Are Great TooWe love a ripe, juicy peach bursting with flavor. But when the only fresh ones you can find are just so-so, frozen is the move.By Alex BeggsAugust 9, 2021FacebookTwitterEmailFacebookTwitterEmailWhen associate food editor Rachel Gurjar Otuama was assigned a peach summer cocktail recipe, she had visions of perfect peak season stone fruit dancing in her head. She pictured a drink made with the kind of August peaches that are so ripe they seem like they’ll bruise if you look at them the wrong way. And while that may have been the dream, the reality was that she had to develop the recipe in...May. In New York. Which meant there were no decent peaches in sight—except in the freezer aisle.So she picked up a bag of frozen peaches at Wegmans and developed this simple sparkling rosé, amaro, and Aperol spritz with them. And you know what? They were actually pretty tasty! Sure, they don’t dazzle quite like the platonic ideal of the season’s finest fresh fruit, but frozen peaches are harvested and preserved at their peak, so they’re packed with flavor. (Plus, there’s no risk of smushed skin or bruising, which seems to always happen to the fresh ones whenever I buy them. I use the smushed ones in this shrub recipe though, which is now my go-to for all mushy or disappointing fruit).As an added bonus, the frozen peaches pull double duty in a spritz, bringing ripe peachy flavor while also serving as cute ice cubes. By the time you get to the end of the glass (too soon), the frozen peaches will have defrosted and soaked up the rosé, leaving you with a crisp bite of boozy fruit. A prize! Love those.This is all to say, if you can’t get killer fresh peaches, frozen is the move. Wanna buy some frozen peaches online? I’m a huge fan of Detroit-based Farm to Freezer’s peaches, which you get a two-pound bag of in this $40 frozen fruit box assortment of all their summer fruits. They freeze local produce with a small blast chiller within a few hours of harvesting, Brandon Seng, the company’s founder, told me. (Blast chilling means they’re frozen with gusts of cold air rather than liquid nitrogen.) I love their frozen sour cherries for making lazy clafoutis, but the frozen peaches are great for baking too, despite our inclination to think of frozen fruit as smoothie-only material.When fruits are frozen, their cell wall ruptures, Seng explained, and they can lose some of their structure. So a defrosted blueberry won’t be as bouncy as a fresh one, which is fine in smoothies. Farm to Freezer’s frozen apples and peaches, though, have a sturdier flesh and hold up pretty well to freezing compared to delicate berries; his kids defrost the peaches and eat them out of hand.So the next time you’re craving a cocktail or dessert made with peaches in November, or all the prospects at the August farmers market are mealy and wan, don’t despair. Frozen peaches are here for you all year long.Just Peachy:Peach-Aperol SpritzFizzy peach sangria made with sparkling rose, ripe fruit, and a touch of aperol = the perfect summer party drink.View RecipeExplore Bon AppétitHealthyishFarmers Market ChallengeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-09", "author": ["Condé Nast", "Alex Beggs"]}