{"id": "f285a64d1ac7ba1e99ce7b85d5a16cd2", "url": "https://www.bonappetit.com/story/jarred-sour-cherries", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "These Jarred Sour Cherries Should Live In Your Pantry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Jarred Sour Cherries Should Live In Your PantryAll other canned fruit needs to go.By Emma WartzmanMay 9, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailMost canned fruit should be ignored on the grocery store shelf, left to sit in its thick, sugary, gloppy syrup. The one exception? Sour cherries. (Okay, so they usually come in a glass jar, but it’s the same idea.)Sour cherries are a variety of cherry that are, as their name suggests, tart and sour. Like their sweeter counterparts, sour cherries are only around for a couple of months in May and June, when we fill our tote bags with them. But unlike their sweeter counterparts, they’re too acidic to eat fresh out of hand, unless you like to pucker up. We like to pit them and bake them in pies and other summer desserts (even this pizza!). When you don’t have time (or patience) to pit pounds of cherries, or get caught out of season and can’t find them—go to the jar. Jarred cherries are available all year round and will impart the same flavor to whatever you’re cooking.Who needs sprinkles when you have beautifully tart sour cherries?\nPhoto by Chelsie CraigThere are several brands out there, but senior food editor Chris Morocco is partial to Trader Joe’s Dark Morello Cherries in Light Syrup (Morello is a variety of sour cherries), which, you can find online.“No matter the brand, the most important thing is that they must come in a light syrup,” Morocco says. “If it’s a heavy syrup, that means they’ll be coated in an ultra-thick, ultra-sweet liquid. Light syrup is just mildly sweetened water, perfect for containing the cherries but not turning the whole jar into a viscous, tooth-ache-inducing mess. The cherries retain their shape and biting flavor, and you can easily drain them before you use them.”Drained, they’re still quite sour, though toned down from being packed in sugar syrup, which is why we like to use them for baking. They’re a great sub for rhubarb in this Buckwheat Rhubarb and Strawberry Galette, since rhubarb isn’t the most readily available produce. You can toss them in sugar and throw them in a cake, like this Easy One Bowl Upside Down Cake. They’re fantastic in pies, or mixed into yogurt for breakfast. Try cooking them down with some sugar and water, giving them a compote-like consistency to spoon over ice cream. They’re truly the cherry on top.Now get baking:Explore Bon AppétitCherryFruitShoppingRead MoreshoppingCanned Cherry Tomatoes Exist and Our Food Editors Love ThemBy Elaheh NozariRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-09", "author": ["Condé Nast", "Emma Wartzman"]}