{"id": "f28b1d3cb3a55faa498a1d63bce464fb", "url": "https://www.bonappetit.com/story/big-alcohol", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Non-Alcoholic Drinks Show That Big Alcohol Is Bracing for a Sober Future | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBig Alcohol Is Bracing for a More Sober FuturePeople are drinking less and less as non-alcoholic beverages flood the market. Now the alcohol industry wants in.By Julia BainbridgeMarch 20, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI grab a menu at the bar. I see a list of twelve cocktails. I see two types of tea. I see sparkling water. I see Coca-Cola.“What drinks do you serve without alcohol?”The bartender points me back to the list, which I review as a formality before asking if there's anything else. \"Maybe a mixed drink?\"\"We could make an Arnold Palmer. Do you know what an Arnold Palmer is? Or a Shirley Temple?\"I've engaged in this kind of negotiation many times, as have many others who want something more adult than a mixture of ginger ale, grenadine, and a Twizzler-colored cherry. But the good news for us is that the drinking landscape is changing.The roughly four trillion-dollar wellness industry has flooded the market with non-alcoholic (n/a) drink options, from CBD-infused lattes to mushroom elixirs to cactus water. Bottled low- and no-alcohol beverages in the U.S. will grow by about 32 percent between 2018 and 2022—triple the category’s growth over the previous five years—and now Big Alcohol wants in.The wellness industry has flooded the market with non-alcoholic drink options, from CBD-infused lattes to cactus water.AB InBev, which owns a deep roster of beers including Budweiser and Corona, has pledged to increase no- or low-alcohol to 20 percent of its global beer volumes by the end of 2025. Alcohol-free \"Heineken 0.0\" launched in Europe last year and recently launched in the U.S. Beer company Molson Coors acquired California-based Clearly Kombucha in June 2018, marking the company’s first purchase of an n/a beverage brand. Distill Ventures, the venture-capital arm of Diageo—which owns brands like Johnnie Walker, Smirnoff, Tanqueray, and Guinness—invested in the n/a “spirit” Seedlip, and about a quarter of Distill’s portfolio is now devoted to n/a beverages. Even Coca-Cola recognizes that non-drinkers want to sip on something more sophisticated than soda sometimes: It announced its Bar Nøne line of bottled n/a drinks in January.Brandy Rand, CMO of industry tracker IWSR, says that 25 to 44 year olds are “significantly trying to reduce their alcohol intake.\" Whether this has to do with an increasing focus on wellbeing, a decreasing taboo around acknowledging substance abuse issues, or both, people are drinking less or cutting out alcohol entirely.Som's sleek new bottles are designed to fit in a bartender's speed rack.\nPhoto courtesy of Som“I think we all collectively feel like we're at the start of a big revolution, which is happening fast but needs to pick up the pace and happen faster,” says Distill CEO Frank Lampen. “As of right now, I would say the majority of bars and restaurants I go to still do not have a good selection if I'm choosing to have a non-drinking day.”This is part of the reason Distill invested in chef Andy Ricker and his line of drinking vinegars, Som, which just rebranded thanks to Distill. “Sipping rather than gulping,” says Lampen. “That’s something that we talk a lot about.” Soda, juices, and water are geared towards refreshment; Som is for savoring.The recipes stayed the same—white vinegar concentrate, citric acid, sugar, water, salt, and natural flavors like Thai basil or cranberry—but the bottle grew from a cute, tubby shape with a lemon-and-lime-colored label into a slim, 500-milliliter version that fits easily into a bartender’s speed rack. Should that bartender prefer Som to take up residence in the back bar, its elegant new cream and gold label makes it a proper neighbor to nearby bourbons and mezcals. Ricker also scrubbed the words “drinking vinegar” from Som’s label, opting instead for “cane vinegar cordial.” He says he has no interest in competing with Bragg: Som is not meant to be a health drink. It will remain in stores, but Ricker will focus on “blanketing the industry,” starting with the Pacific Northwest.Most people credit Seedlip for jump-starting the n/a drink movement when it debuted in the U.S. two years ago. (It launched in the U.K. in 2015.). Balanced n/a cocktails are difficult to construct without the backbone or texture that comes with, say, gin, and Seedlip, made by blending individually distilled botanicals, seeks to replicate some of those qualities.Seedlip's Spice 94 blends aromatic Jamaican allspice berry and cardamom distillates.\nPhoto courtesy of SeedlipSom is a mixer, not a spirit, but it solves a similar problem. “You get something sweet, tart, in some cases savory, and in some cases tannic, all in one pour,” says Ricker. “You don’t have to make a simple syrup or add a botanical to it or muddle anything.” As more open-and-pour products come onto the market—including a line of alcohol-free botanical aperitifs from former Momofuku bar director John deBary—bartenders will be saved from having to steep 23 different ingredients before service to try to level up their n/a drink selections.Bartenders and beverage directors are having an easier time in Europe, where some dozens of n/a products have hit the market in the past few years. London-based entrepreneur Ellie Webb started selling her Inca berry- and juniper-infused n/a spirit Caleño at local supermarkets a few months ago. “I love the craftsmanship that goes into making a really nice drink, but I wanted to get away from that habit of reaching for alcohol.” Webb, who is half Colombian, says that “whether they're drinking or not, Colombians dance and have a good time.” She wanted to bottle that energy.Alcohol isn’t going anywhere. If anything, drinking standards are being raised across the board.Other new n/a brands in the U.K. include Three Spirit, a liquid mixture of plants and herbs meant to mimic the euphoric effects of alcohol on the brain; the saffron-tinted n/a aperitif Everleaf, developed by London bartender Paul Mathew; and Seedlip’s sister brand, Aecorn, a line of three aperitif-style drinks made with grapes, herbs, roots, and bitter botanicals that will debut in the U.K. this spring.And New York-based Brooklyn Brewery launched its first n/a beer, a hoppy lager called Brooklyn Special Effects, in Sweden last December. \"You know well the low reputation of n/a beers here [in the U.S.],\" says brewmaster Garrett Oliver. But, in Europe, it’s not uncommon for drinkers to switch between regular and n/a beer over the course of the night. There might be opportunity, though, as beer sales in the U.S. were hit the worst out of any alcoholic beverage category last year, dropping by 1.5 percent. Oliver plans to take it: Brooklyn Brewery will roll out a few n/a brews in the U.S. by the end of the year.Drinkers have no reason to worry: Alcohol isn’t going anywhere. If anything, drinking standards are being raised across the board. In the last few decades, cocktails went from vodka tonics to, well, actual cocktails; the quality of American spirits, beers, and wines has continued to rise; and people are, overall, drinking better booze. So it’s only natural that n/a drinkers are getting better options, too.I love an Arnold Palmer. Who doesn’t love an Arnold Palmer?! And I love a tight-bubbled seltzer that wakes up my tongue. But I'm looking forward to all the fresh answers I'm going to get in the coming years and even months when I ask American bartenders my question: “What drinks do you serve without alcohol?”Explore Bon AppétitHealthyishTrendsNonalcoholicessayRead MoreLifestyleWhat Happens When Five Sober Chefs Share a Kitchen?By Julia BainbridgeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-20", "author": ["Condé Nast", "Julia Bainbridge"]}