{"id": "f28bcd28bccd83e2c846386f721f123b", "url": "https://www.bonappetit.com/recipe/pastitsio", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "Pastitsio Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPastitsioBy Kendra VaculinDecember 14, 20214.7(32)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintMoussaka might be the most famous Greek casserole, but it certainly isn’t the only one. Similar to Greek moussaka, pastitsio starts out with layers of spiced meat and gets finished with creamy, cheesy béchamel sauce before getting baked. Pastitsio, however, uses pasta, specifically the titular extra-large hollow noodles sometimes referred to as Greek macaroni (we love Loi brand). Bucatini will work in a pinch, as will Romano cheese subbed in for the salty, fragrant Greek cheese kasseri, which you can find at specialty markets.While you can make your pastitsio from start to finish all in one day, we highly recommend cooking the sauce the day before you want to serve the casserole for the cleanest slices and most flavorful finished product. Chilling the meat sauce overnight thickens it up so you can spread it on top of the pasta in a defined layer (which will result in the most impressive-looking slices).All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At Amazon13x9\" Baking Dish$20 At AmazonBox Grater$13 At AmazonColander$11 At AmazonCan Opener$14 At AmazonWooden Spoon$6 At AmazonIngredients8 servingssauce2Tbsp. extra-virgin olive oil2large red onions, finely chopped4garlic cloves, thinly sliced2lb. ground beef2bay leaves3Tbsp. double-concentrated tomato paste2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, plus more¾tsp. ground cumin¾tsp. ground cinnamon¼tsp. ground clovesFreshly ground black pepper¾cup red wine128-oz. can crushed tomatoes2cups low-sodium beef brothBÉchamel and assembly1lb. pastitsio noodles (such as Loi macaroni) or 12 oz. bucatiniKosher salt2large eggs, room temperature5Tbsp. unsalted butter5Tbsp. all-purpose flour3cups milk, room temperature7oz. kasseri or Romano cheese, finely grated, dividedFreshly ground black pepperPreparationsauceStep 1Heat 2 Tbsp. extra-virgin olive oil in a large Dutch oven or other heavy pot over medium-high. Cook 2 finely chopped large red onions, 4 thinly sliced garlic cloves, and 2 lb. ground beef, breaking up meat with a wooden spoon and stirring occasionally, until onions are softened and beef is browned, 10–15 minutes.Step 2Add 2 bay leaves, 3 Tbsp. double-concentrated tomato paste, 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, ¾ tsp. ground cumin, ¾ tsp. ground cinnamon, and ¼ tsp. ground cloves to pot; season with freshly ground black pepper. Cook, stirring often, until tomato paste and spices are evenly distributed, about 4 minutes. Add ¾ cup red wine, scraping up any browned bits, and cook, stirring occasionally, until almost completely evaporated, about 3 minutes. Add one 28-oz. can crushed tomatoes and 2 cups low-sodium beef broth and stir to combine. Bring to a boil, then reduce heat and simmer, stirring occasionally, until sauce is thick and meaty (most of the liquid should have cooked off), 45–60 minutes. Taste and season with salt. Let cool until almost room temperature, about 30 minutes.Do ahead: Sauce can be made 3 days ahead. Transfer to an airtight container; cover and chill. Reheat slightly (it will heat through when baked), adding a little broth or water to loosen just enough to make it spreadable.BÉchamel and assemblyStep 3Preheat oven to 350°. Cook 1 lb. pastitsio noodles or 12 oz. bucatini in a large pot of boiling salted water until very al dente, about 2 minutes less than package directions. Drain and rinse under cold running water to cool. Transfer to a 13x9\" baking dish.Step 4Working one at a time, separate yolks from 2 room-temperature large eggs over a small bowl to catch egg whites. Place yolks in another small bowl; set aside. Beat egg whites to blend well. Add egg whites to noodles and toss to coat (this will help the noodles form a sliceable layer in the final dish). Arrange noodles in straight lines, all facing the same direction, as best you can.Step 5Melt 5 Tbsp. unsalted butter in a medium saucepan over medium heat. Add 5 Tbsp. all-purpose flour and whisk until flour is combined and mixture is light and frothy, about 3 minutes. Add 3 cups room-temperature milk in a slow, steady stream, whisking constantly to combine. Cook, whisking constantly, until thick enough to coat a spoon, 6–8 minutes. Remove from heat and whisk in 5 oz. finely grated kasseri or Romano cheese. Taste and season with salt and freshly ground black pepper (be sure to taste after whisking in the cheese; depending on the kind of cheese you use, you may not need to add any salt). Beat reserved egg yolks to blend, then whisk into béchamel.Step 6Spoon meat sauce over noodles in baking dish, then top with béchamel, smoothing into an even layer. Sprinkle remaining 2 oz. finely grated kasseri or Romano cheese on top. Bake pastitsio until starting to brown around the edges and top is set (it will still be a little jiggly, but will continue to firm up as it cools), 35–40 minutes.Step 7Heat broiler. Broil until top of pastitsio is browned in spots, about 4 minutes. Let sit at least 30 minutes before slicing.Do ahead: Pastitsio can be assembled 1 day ahead. Cover and chill.How would you rate Pastitsio?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleCumin? Garlic? Beef broth? Bay leaves?Crushed tomato? Cloves?What part of Greece is this from? Italy? I will try Loi pasta but in Chicago Miskos No2 is readily available. Also if you don’t want a cinnamon bomb, try using sticks and remove when done cooking meat or else the cinnamon keeps on giving . The assembly is traditional but usually half pasta, then meat then rest of pasta then bechamel. Normally I love your recipes but not so much this timePeter LChicago,IL2/27/2022I love to cook but my sister is very sensitive to eggs and can't eat them and I would love to try this recipe With an egg alternative to share withbluzg1rl her and her family. Do you think it's possible to make the bechamel sauce with egg replacement? As well as egg free pasta?Bluzg1rlColorado2/4/2022Making this with 1 lb ground lamb and 1 lb ground beef is more delicious. And more Greek!Cathy DNRI2/4/2022I made this for Christmas dinner. Fabulous! Easy one pan meal. I made it with GF penne. And used sheep’s milk cheese and substituted chicken stock for milk in the white sauce. Also added fresh rosemary in the beef. Delicious! ewy00Norcal 12/26/2021Two layers of #2 makaronia for pastitsio with sauce between the layers and the bechamel on top of the final layer.  I’ve been following my grandmother’s method for 62 years.  More bechamel in final layer.AnonymousDarnestown, Maryland 12/18/2021To Anonymous in Cincinnati:  Kroger carries double tomato paste.  It isn't in a can but in a tube - works well and  is great especially for small quantities of tomato paste.  You should be able to make this for Christmas!  PepitaCincinnati, OH12/18/2021It's not hard to find double tomato paste. You're in Cincinnati. I'm in Wisconsin, and I can make this right now.JeffMadison, WI12/18/2021What is double tomato paste?????  No mention of a sun so I won’t be making this over Christmas as planned till I read the entire recipe.  😠AnonymousCincinnati12/18/2021testAnonymousmiami12/16/2021Haven't tried this recipe, but I've been making pastitsio for years. This recipe looks great, BUT if you can't find the right type of noodles, I really recommend using penne instead of bucatini! The shape is a lot closer to the classic pasta than bucatini is. I've done this many times and it isn't even noticeable in the assembled pastitsio. AnonymousMontreal12/14/2021Explore Bon AppétitDinnerMainCasseroleNut-FreeGreekEuropeanPastaGround BeefBeefMeatBucatiniPasta & NoodlesCanned TomatoTomatoVegetableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-14", "author": ["Condé Nast", "Kendra Vaculin"]}