{"id": "f294a79391336e770afd0fbf88033bf9", "url": "https://www.bonappetit.com/story/chicken-thigh-recipe-cold-pan-method", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "This Chicken Thigh Recipe Changed the Way I Think About Cooking Chicken Thighs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Chicken Thigh Recipe Changed the Way I Think About Cooking Chicken ThighsSeriously. One small recipe hack set me on a path toward a lifetime of golden, crackly-skinned chicken thighs.By Julia KramerJuly 24, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailA lot of crazy shit has happened in 2018, and somehow, in the midst of it all, the Bon Appétit Test Kitchen has once again managed to bless us with new chicken thigh recipes—this time based on a novel, ingenious technique. The secret, after all these years, is this: For maximally crispy skin, start cooking chicken thighs in a cold skillet.I first heard rumblings of this concept while I was cooking through Healthyish’s Feel Good Food Plan, which featured the very excellent One-Skillet Crispy Chicken Thighs with Harissa. “Starting the chicken skin side down in a cold skillet lets the fat render slowly and results in the crispiest skin imaginable,” explained senior food editor Chris Morocco. Like most things Chris says, you just have to accept it as fact. No chicken thigh will ever be started in a hot pan again in my kitchen for as long as I live.So, I was not surprised to see that in Basically's newest recipe—One-Skillet Lemony Chicken With Fennel and Tomatoes—this strategy lives on as gospel. Cold pan, in go the thighs, turn, turn, turn so there are no weird flabby bits, very bella crispy chicken emerges. Winner, winner, etc, etc.What I was surprised to see was that this recipe asked me to place fennel, shallots, lemon (sliced into rounds), and tomato—four things I typically eat raw—into the now-hot pan that I had cooked the chicken in, place the golden-skinned thighs on top, and to roast it all in the oven until caramelized. Now things were getting a liiiiiiiiiittle bit weird! I wasn’t totally sure how this was all going to play out. Would everything be done at the same time? Or would I be left with crunchy fennel and tomato mush? But, lo and behold, it yielded a plate of perfectly crisp-tender veg seasoned gloriously by all of those rich, chicken-y juices. I admit, it all looked a little beige and muted and almost sad, but the thin slices of lemon really brought it all together, sending jolts of sunny tartness through the sweet fennel and shallots. The takeaway here: Always roast your lemons.Toasted bread for sopping up all those chicken-y juices? Non-negotiable.\nWhile all that was happening, I made a fancy-sounding “fennel oil.” (Spoiler alert: It’s just the chopped up fronds from the fennel whisked into olive oil.) And then I noticed that the recipe recommended I eat this meal, and all the blessed juices that collect in the bottom of the pan, with bread. So I decided to go rogue and brush the greenish oil onto some thick slices of sourdough, then crisped those up in another skillet, which definitely defeats the “One-Skillet” concept of this dish, but in life, you make sacrifices.Two skillets, a small bag of inexpensive groceries, and one life-changing realization about pan temperature later, I very much enjoyed my dinner. And I have no doubt that you will too.Get the Recipe:One-Skillet Lemony Chicken with Fennel and TomatoesThis simple, satisfying one-skillet chicken recipe leaves you with a ton of sweet, sweet pan juices—plenty of crusty bread for sopping it all up is non-negotiable.View RecipeExplore Bon AppétitBasicallyChickenFennelTomatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-24", "author": ["Condé Nast", "Julia Kramer"]}