{"id": "f299e7705e2d265b7078b66b82395b55", "url": "https://www.bonappetit.com/story/larrys-montreal", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Larrys in Montreal Serves My Perfect Breakfast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIf Breakfast Is The Most Important Meal of the Day, I’m Going to Larrys in MontrealFeed me the mix-and-match small plates!By Molly BazApril 3, 2019FacebookTwitterEmailPhoto by Dominique LafondFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Rare are the days that I don’t wake up thinking about food, it’s my job after all. But before I can even consider what I’ll be cooking in the Test Kitchen all day, I’m figuring out how to get exactly what I’m craving for breakfast. That’s why if I had it my way, I’d start every morning at Larrys—a small but mighty all-day cafe in Montreal that makes breakfast a choose-your-own-adventure experience. Rather than a series of elaborately composed dishes, the menu at Larrys is one long list of small, mix-and-match plates, meaning I can order exactly what it is I need that day, and cut out everything else. If I’m feeling like I need some protein, I’ll grab a single scrambled egg, a housemade sausage link, and a side of house-smoked salmon. Or maybe it’s the marinated lentils and a plate of crispy brown-buttered oyster mushrooms that call my name. Or perhaps it’s a morning like this morning, and a soul-warming Bolognese Toast (i.e. a study in how to eat pasta for breakfast) and a side of crispy potatoes is just the thing I need. Don’t judge me, it’s my breakfast. You can order whatever you want.Go There: LarrysExplore Bon AppétitRestaurantsHighly RecommendMontrealBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-03", "author": ["Condé Nast", "Molly Baz"]}