{"id": "f2a7890a710082ccaed4da8ca0cdd0b9", "url": "https://www.bonappetit.com/story/red-wine-temperature-cooler-than-you-think", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "The Right Red Wine Temperature Is Cooler Than You Think | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Right Red Wine Temperature Is Cooler Than You ThinkIf you think the proper red wine temperature is \"whatever your thermostat says\"...well, it just isn't.By Emily SchultzMarch 14, 2019FacebookTwitterEmailFacebookTwitterEmailVisualize your refrigerator. (No, this isn’t a breathwork exercise, we promise.) Now visualize your bar cart. Where in all of this does your red wine sit? We won’t judge: We’re here to help. If the red wine in your mind is sitting on your bar cart, channel your inner Matilda—you know, when she moves the pencil with her mind—but instead of moving a pencil, you’re moving those bottles to your refrigerator. Why? Because you’re probably serving your red wine way too warm. And, to be honest, you're probably way better off just keeping it in the fridge.For whatever reason, a lot of people seem to think that the ideal red wine temperature is room temperature—white wine belongs in the fridge, sure, but red wine belongs in...the room. But room temperature is typically around 70 degrees, and the ideal serving temperature for red wine is anywhere between 60 and 68 degrees. So, yeah: room temp is no bueno. But don't let those numbers throw you off. We’re not asking you to get an instant-read thermometer out and stick it into your wine bottle—that would be weird. This should be pretty intuitive stuff. You know what room temperature feels like because, chances are, you’re currently in...a room. And your red wine should taste and feel at least a little bit cooler than that. That's not so hard, is it?Why worry about temperature so much? Well, when red wine is right below room temperature, you’ll be exposed to the best possible version of the fruits and aromatics that wine presents. Too-warm wine will often present sweeter and spicier, which can be overpowering, especially when served with food. But, also, red wine with a slight chill on it is just...more fun to drink. It's more refreshing and drinkable. And we're all for that.At this point you’re probably saying, “Okay, so how do I get my red wine to this magical just-below-room-temperature spot?? Sounds complicated!” To which I will respond: Just put it in the fridge, bud!You shouldn’t be afraid to throw your wine in the fridge. If you sling a room temp bottle in there for about an hour, it'll probably be close to where you want it to be on the other side. But honestly, we're big fans of just storing our red wine in the fridge all of the time—that way we can just take a bottle out about a half hour before we want to drink it to let it come up to the ideal temperature. It's just easier! I mean, if you're the kind of fancy person who keeps dozens of bottles around that you're planning on aging patiently for many years, the fridge is not the place to do it. But chances are you're buying wine that you're going to drink in the next week or so, and if you keep it in the fridge it'll be ready whenever you are.It’s really that simple! So move over that bottle of Dijon mustard and make way for a bottle or two of beaujolais. You'll thank us later.A croque monsieur would go great with that cool glass of red, actually...Basically Croque MonsieurLike a hot ham and cheese sandwich, but slathered with cream sauce and baked to bubbly perfection. (Yeah, it's as good as it sounds.)View RecipeExplore Bon AppétitBasicallyWineRed WineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-14", "author": ["Condé Nast", "Emily Schultz"]}