{"id": "f2ae736caccea23ae68a3a0bf5ab8919", "url": "https://www.bonappetit.com/story/cashew-anxiety", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "How Many Cashews Does It Take to Cure My Anxiety? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Many Cashews Does It Take to Cure My Anxiety?This is what happens when you go looking for life’s answers on Google.By Sophie Lucido JohnsonMay 2, 2018FacebookTwitterEmailIllustration by Sophie Lucido JohnsonFacebookTwitterEmailLast February, I had terrible anxiety. This was warranted: I was in the midst of teaching four classes, putting out a book, and buying a house. At the time, I also hated cashews.That’s relevant because ultimately, cashews were my savior. I’ll tell you more about that in a minute. First, you have to know about the night I bottomed out.Illustration by Sophie Lucido JohnsonAnd I lost it. Usually, I’m your textbook manic depressive, with fun highs and lows that keep my life interesting. I’m not a hugely anxious individual. But there was too much input. My body couldn’t hold on to everything it had to do.I cried uncontrollably in the dark of our living room; my skin crawled. My thoughts ran away from me, and I desperately wanted to fix everything, but I was physically exhausted.Illustration by Sophie Lucido JohnsonUltimately, I Googled “natural ways to fix anxiety,” because I wanted more than anything to be able to sleep for a whole night, and I thought something in our fridge may help.Down the rabbit hole I went. I’m vegan, so salmon and yogurt—the two most widely recommended dietary anxiety quellers—were out. At some point, I became fixated on the idea that my body lacked zinc, and that if I could just get some more zinc in my life, all my problems would go away.Besides oysters, the big superstar in the zinc world is cashews.Illustration by Sophie Lucido JohnsonAs a vegan, I’ve known for a while that I’m supposed to love cashews. They’re in everything that vegans make to substitute actually good foods like cheese and heavy cream. But I don’t. My former roommates used to keep these chalky wasabi snacking cashews around the house, and they’d munch on them all day long.Illustration by Sophie Lucido JohnsonBut on my rough Wednesday night, I got it in my head that cashews were going to solve a lot of my emotional issues. I’d read a recipe for cashew milk in The Homemade Vegan Pantry that seemed too simple to possibly be true. You know how on Pinterest they’re always telling you that you should make your own almond milk because it’s “so much better” than store-bought? And then you try it and it’s just, like, hunks of almonds in some water? Even after you strain it? I figured this would be that.Illustration by Sophie Lucido JohnsonIt turns out that cashews are very different from almonds. This milk was creamy, rich, and not remotely grainy. I added a little maple syrup and some cinnamon, and I was over the moon. I had coffee creamer for the rest of my life!The result was so good that I felt re-invigorated about trying other cashew recipes. Most of what I found were recipes for different kinds of “cheese.” Zinc-filled, vegan cheese.Illustration by Sophie Lucido JohnsonI became an evangelist for cashews, and then I started making up my own recipes. I brought my cashew creations to work.Illustration by Sophie Lucido JohnsonLet me get this out of the way right now: Cashews don’t taste like cheese. If you’re looking for a substitute for cheese, you’re really going to have to go with other cheese. But there’s something about creamed cashews that's revolutionary. They’re smooth and barely sweet, and they’ll inoffensively pick up any flavor you add to them.Discovering pulverized cashews was sort of like discovering riding the city bus when I was in high school. New possibilities opened up that I never could have imagined. One day, I snuck away from work early to try out a pizza recipe I couldn’t stop daydreaming about. I didn’t tell anyone that I was leaving.And do you know who noticed that I was ditching work to play with food?Illustration by Sophie Lucido JohnsonHere’s the thing: People are mostly so wrapped up in their own lives that they spend very little time worrying about you or the tiny missteps you might make throughout the day.And suddenly, I released the idea that I had to do everything exactly right all of the time. Maybe the roof wouldn’t get fixed as quickly as I wanted it to, or I’d give my students their papers back a week late. Somehow, everything would be okay.A lot of cashew recipes take time because you are supposed to soak the cashews in water for at least an hour, to get them soft enough to blend totally smoothly. I got into the habit of secretly catching up on The New Yorker while I waited for my cashews to be soggy enough, under the guise of cooking. It had been so long since I’d taken the time to read anything that wasn’t an urgent email or a text from a contractor.Illustration by Sophie Lucido JohnsonLook. I don’t know if holistic food-based approaches to mental health really do all that much. Zinc is probably not the catch-all solution to anxiety. Mental health issues are no joke, and experts’ opinions vary as to how much diet is an effective way to treat them.But taking the time to make a recipe that takes hours of soaking, setting, and fermenting is fabulous for anxiety. You have to ask yourself to be patient. You have to force yourself to let go. And in the end, when you’re taking a bite out of a nut-based cheesecake that has NO REFINED SUGAR (!!!!?!?!) and seems too good to be true, you are reminded, briefly, of the meaning of life.Illustration by Sophie Lucido JohnsonSophie Lucido Johnson is a writer and artist in Chicago; her illustrated memoir, Many Love, will be out in June 2018.Related: Love Is Like a Sourdough Starter—It Can Last Forever, or Get Super Smelly and WeirdExplore Bon AppétitCashewRead MorecultureLove Is Like a Sourdough Starter—It Can Last Forever, or Get Super Smelly and WeirdBy Sophie Lucido JohnsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-02", "author": ["Condé Nast", "Sophie Lucido Johnson"]}