{"id": "f2b0c82ff861dc4a07986a86abc20614", "url": "https://www.bonappetit.com/story/how-to-add-spices-to-coffee", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "You Should Add Spices to Your Coffee Grounds—Here's How to Do It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Should Add Spices to Your Coffee GroundsThis simple trick almost made me a morning person.By Ali FrancisFebruary 21, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat BoytsovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.After years spent lapping at flat whites spiked with sickly “nonfat” flavor syrups—one pump or two?—I graduated from university, landed my first Serious Journalism Job, and switched to Serious Brews Only. But now, in my tiny apartment kitchen, flavored coffee is undergoing a renaissance. I’m not talking about the bags of “caramel” grinds that leave a sort of soapy residue on the roof of your mouth. No, I’m talking about—endorsing, even—the simple act of adding spices to your coffee grounds.While adding spices to coffee has been a common practice for decades, if not centuries, in many parts of the world, including Morocco and Mexico, I first learned about it from my friend Maddie. One morning late last year, I woke up on the lofted bed in her living room to the unmistakable sound of whole beans jostling around in a bag. From my perch I watched her add them to a grinder followed by a few shakes of cinnamon and a pinch of salt (!). I thought I must be dreaming, until the guttural roar of shattering coffee beans woke me. I took a sip from the ceramic mug she handed over, and I’m telling you it was transcendent—like walking into a sunny clearing after a long hike through thick woods.Photo by Emma FishmanBurlap & Barrel Cinnamon$8 at Burlap & Barrel$9 at HiveI’ve obviously dumped as much stale cinnamon into my Starbucks orders as the next guy, but unlike those times, there were no weird, grainy floaties in my brew. And the addition of salt cut the perceived bitterness and acidity of the coffee and, much like it does in baked goods, amped up the sweet, floral flavor. Spicy coffee, as I’ve come to call it, is now the only way I’ll take my cuppa joe.Here’s how to add spices to your coffee:If you are decidedly not a morning person ( ✋), just add a sprinkle of preground spices directly into your French press, Chemex, Mr. Coffee—choose your own adventure—along with the ground beans. For the naturally peppy among us, you might prefer adding whole (as in, not ground) spices in with your whole beans and grinding them together. This will result in a more fragrant, aromatic brew, but be warned: Your bean grinder will likely hold on to those flavors and potentially infuse them into your next batch. Whichever route you choose, once the coffee and spices are combined, add a pinch of salt (though you might want to skip it if you love coffee’s bitterness), and continue to brew as normal.Warmer spices—the ones you’d reach for when baking—like cardamom, allspice, cloves, ginger, nutmeg, star anise, and cinnamon pair particularly well with coffee. Senior cooking editor Sarah Jampel loves New York Shuk’s Kafe Hawaij, a spice blend that was brought to Israel from Yemen and is traditionally used in fresh coffee. I’ll grind a tablespoon of cacao nibs with my coffee beans for a darker take on a mocha. And though it sounds a pinch deranged to me personally, people I don’t know on the internet have reportedly enjoyed adding dried culinary lavender to their grinds. (You do you.)DIOGRAFICKafe Hawaij$9.95 at New York ShukWhatever you choose, know that a little spice goes a long way; my rule of thumb is ½ teaspoon ground spice per six cups of coffee. The best way to find what you like is to experiment with intensity and try to emulate your favorite baked goods (lookin’ at you pumpkin bread) in coffee form.While I’ve admittedly left the choppy mullet cut (moo-lay, as we used to pronounce it) back in my university days alongside literally everything I learned at journalism school, I’m delighted that fun, flavorful beverages are back in my life. Like a spicy coffee, I should have enjoyed those years while they lasted.More highly caffeinated content from BA’s Coffee Week:The Best Ways to Make Coffee, According to BaristasThis Reusable Coffee Filter Means I Never Worry About Running OutThe Coffee to Water Ratio That Makes a Perfect BrewThis Flash-Frozen Concentrate Is Revolutionizing the Way I Drink CoffeeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-21", "author": ["Condé Nast", "Ali Francis"]}