{"id": "f2e0d78307c89947e83290de3741f93a", "url": "https://www.bonappetit.com/story/cage-free-meaning-best-eggs", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "How to Buy the Best Eggs Possible | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Buy the Best Eggs PossibleWhat words should you look for to find the best eggs? \"Natural\" means nothing, and \"cage-free\" might as well, too.By Adrienne Rose JohnsonJanuary 11, 2018FacebookTwitterEmailPhoto by Jeff Haynes/AFP/Getty ImagesFacebookTwitterEmailBrown, white, jumbo, organic, free-range, vegetarian-fed, humane, farm-fresh: My grocery store literally has 15 types of eggs. The cheapest dozen cost $3.56 and the most expensive are $9.99. But which are the best eggs? Some cartons look like advertisements for down-on-the-farm hoedowns, a fantasy of cheery chickens and farm folk in a quilting bee or at a barn-raising. There’s Meadow Creek Farm, Happy Egg Co., Scenic Vista Farm: Would I rather my eggs come from a meadow or a scenic vista? Do happy chickens with a view lay better eggs?And they all pretty much look the same. Even the giant flat shrink-wrapped pallets of eggs seem okay: they’re jumbo, “farm-fresh,” and “natural” just like cute little organic 6-packs. But are they the same?We pinned down what those labels mean. Turns out, “vegetarian-fed” might be a bad idea. “Hormone-free” means nothing. And we can thank the USDA grading for keeping “black rot” and “meat spots” out of our scrambles. Here’s how to decode egg cartons and start shopping smarter.Vegetarian-Fed HensVegetarian-fed hens don’t make a lot of sense because chickens are bloodthirsty scavengers. Sure they eat grains and seeds, but chickens are omnivores and eat just about everything: earthworms, crickets, little specks of insects and fly larvae harvested in cow patties. All sorts of tiny buggy living things we can’t see and would probably rather not think about.One chicken farmer at Polyface Farms in Virginia reported a nasty case of cannibalism after feeding his chickens a vegetarian diet. Apparently so deprived of protein, the chicks began eating each other (actually, to use the farmer’s words, “the more aggressive chicks were tearing at the weaker ones from the outside in”). They only stopped cannibalizing when fed small pieces of a deer carcass, freshly skinned and harvested from the roadside.“Problem solved,” the farmer reported.KosherAs long as they’re not cracked, almost all chicken eggs are kosher. Only broken eggs or eggs with blood spots aren’t kosher, and you’d probably notice that anyway.Photo by Chip Somodevilla/Getty ImagesFree-Range, Cage-Free, PasturedConventional egg-laying hens live in battery cages: cramped mesh cells that prevent hens from ever stretching their wings, nesting, or doing much at all beside produce eggs. “Battery” might sound like the cages are electrified or the chickens are battered. But the term actually comes from how hundreds (sometimes thousands) of the wire cells neighbor one another and share wire dividers—like the cells in a battery.On average, each hen has about 70 square inches of space, which is less than a regular sheet of paper. Seven or eight birds sometimes share a single cage. One reporter explained the system as “spending the rest of your entire life in a wire cage the size of your bathtub with four other people.”Activists have successfully fought against battery cages. California outlawed the wire cells in 2008 and major companies like Safeway and McDonald’s have voiced their commitment to sourcing “cage-free” eggs. In Quebec, free-range eggs are translated to Oeufs en Liberte which sounds appropriately revolutionary.But cage-free doesn’t always mean cruelty-free. Cage-free only means that chickens aren’t kept in cages. They might still live on top of one another in cramped facilities and never see daylight. Some studies suggest cage-free chickens have a higher mortality rate because, without cages, chickens peck each other to death, and disease spreads more easily.Free-range is better because chickens must have access to the outdoors. “Access” doesn’t mean chickens go outside any more than a gym membership means you go to the gym. Some free-range chickens roam freely on picturesque fields, but other chickens can only access a screened-in porch. Depends on the farm.Photo by Justin Sullivan/Getty ImagesPastured is your safest bet. Usually pasture-raised hens actually live outdoors and eat a diet of seeds and insects that could improve the taste and nutrition of the eggs.Individual companies sometimes clarify these claims. That $6.49 dozen I mentioned earlier? Happy Egg Co. explains “our girls have plenty of room to roam freely, about eight acres” and “have lush green pasture.” Other than the goofy “our girls” stuff, the explanation holds up.Photo by Robyn Beck/AFP/Getty ImagesNo Added HormonesThe FDA already outlaws hormones in poultry production. Check the asterisk on the carton. Any claim of hormone-free should be qualified by the statement: \"Federal regulations prohibit the use of hormones.”So \"hormone-free\" is like saying you took Japanese for three years when you flunked the first two rounds. Or that you read War and Peace when you only read the three-word title.Antibiotic-freePretty much the same goes for this one. Even though antibiotics are common in chicken feed, egg-laying hens rarely get medicated with antibiotics.The FDA only approves three types of antibiotics for egg-laying flocks and even if hens are treated with antibiotics, their eggs shouldn’t be affected. Actually, antibiotics can cure sick chickens from deadly respiratory infections or E. coli. People mainly worry that preemptive antibiotics (feeding animals before they get sick) can create antibiotic-resistant disease strands. E. coli has mutated over the years and some antibiotics no longer work—in chickens or in humans—to treat the disease.Courtesy of Pete and Gerry'sHumanely-Raised\"Humane\" is a subjective term. The Certified Humane seal (figure ZY) or Animal Welfare Approved (ZY) spell it all out. To be Certified Humane, egg producers must abide by a host of rules that ensure chickens live in decent conditions, following wonky stuff about monitoring for rodent activity, ventilation, and floor covering in nest boxes. Basically, there can’t be too many rats, and there needs to be some air flow, with a nice, cushy litter material to build nests.Hens are also given boxes of dirt to roll around in. Chickens naturally do something called “dust-bathing” to prevent lice and other parasites. They look like feathery hippos in a sandbox, but chickens need dust-baths to keep healthy.Animal Welfare Approved goes a few steps further with pasturing (hens are raised almost entirely outdoors) and slaughtering and is considered the most rigorous animal welfare certification.FertileHens don’t need roosters to lay eggs just like women don’t need men to ovulate. But the “fertile” label means that roosters had access to the hens and if they mated, the eggs could possibly turn into chicks.Nutritionally, fertilized and non-fertilized eggs are basically the same. Taste-wise, barely noticeable. Fertilized eggs might mean sexually-satisfied roosters, but doubtful that’s a top concern.NaturalEverything is natural because everything—even diesel fuel and Velveeta—comes from nature. The USDA clarifies that egg products are natural when they contain no artificial ingredients, added color, and are only minimally processed. Anything other than an Easter egg would probably qualify as natural.Photo by Tim Boyle/Getty ImagesEgg Grades: A, AA, or BThe USDA grades eggs AA, A, or B, with AA being the best, most uniform egg and B the most unsightly or somehow defective.Critics argue that the grades are cosmetic because they don’t promise protection from salmonella, the most dangerous and common pathogen carried by eggs. Consumers confuse egg grades—only an assurance that the eggs aren’t cracked or misshapen—for a safety standards. At best, egg grading tries to make sure the white eggs aren’t mixed with the brown. At worst, the seals allow companies to pump up prices.Well, maybe the critics should take a look at the USDA grading sheet. There might be a reason we never see the eggs that don’t make it into the supermarket.USDA describes sour eggs like a bad movie monster, the eggs cast a “weak white and murky shadow around an off-center swollen yolk.” Under UV light, the sour eggs fluoresce and give off a green sheen. Other defects include blood spots, meat spots, bloody whites, mixed rot, blood rings, stuck yolks, embryo chicks, and problems with bubbly, ruptured air cells.There are also green whites and something called black rots—and I’m relieved that the USDA is keeping me from ever knowing what that looks like.OrganicThe USDA regulates “organic” and organic eggs must come from free-range chickens fed with 100% organic feed, meaning no administered antibiotics, no hormones, no arsenic, no poultry-slaughter byproducts. It’s a reliable standard, and usually a good indication that free-range requirements are enforced.So what can we trust? First, find an egg company certified by outside boards: Vital Farms, Family Homestead, and Oliver's Organic all have good reputations according to the Cornucopia Institute and Shop Ethical!, two respected consumer guides. Walmart, Target, and other big box stores carry Happy Egg Co. and Pete and Gerry’s, the largest of the free-range egg producers that has generally good ratings.Outside watchdog groups often rank egg companies based on their own criteria of sustainability, nutrition, and humane treatment. Some, like the Cornucopia Institute, investigate unethical practices themselves while others like the Shop Ethical! consumer guide will include egg producers among other consumer products.So forget hormone-free, antibiotic-free, natural, fertile, or any other nonsense. Ideally the best egg is organic, pastured (or free-range), USDA A or AA, stamped with the Certified Humane or Animal Welfare Approved seal. If you have to pay a dollar or two more than usual, you’ll know you spent money on the things that matter.Now that you've got the good stuff, make a frittata:Use-It-Up FrittataYou can put whatever you want in it, and you don't even need to turn on your oven.View RecipeExplore Bon AppétitEggBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-03-27", "author": ["Condé Nast", "Adrienne Rose Johnson"]}