{"id": "f2e1cca6ce5ca47caaa4b72d2201d610", "url": "https://www.bonappetit.com/recipe/brown-butter-basted-steak", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Butter-Basted Steak Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueBrown Butter–Basted SteakBy Kat BoytsovaMarch 20, 20184.3(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintHow to make steakhouse-quality steak at home. Step 1: Buy a great steak from a great butcher. Step 2: Salt it liberally. Step 3: Gradually build up a crusty sear. Step 4: Butter. Butter?! Yep—butter. Browned, nutty butter will deliver toasty flavor to every bite. It’s the secret to pretty much all the great steakhouse dinners you’ve ever had.Ingredients2 servings11¾\"-thick bone-in rib eye (about 1½ lb.)Kosher salt, freshly ground pepper2tsp. vegetable oil3Tbsp. unsalted butter2sprigs rosemary2garlic cloves, crushedFlaky sea saltPreparationStep 1Season steak generously with kosher salt and pepper and let sit at room temperature 1 hour.Step 2Heat a dry large skillet, preferably cast iron, over medium-high, then add oil. As soon as oil is smoking, cook steak, turning every 2 minutes or so, until a deep brown crust forms and the internal temperature is a few degrees below your favored doneness (120°–125° for medium-rare), 8–10 minutes.Step 3Add butter, rosemary, and garlic to skillet, tilt pan toward you so that butter pools on one side, and use a large spoon to continually baste steak with butter. Continue until butter is no longer bubbling and it smells nutty and is beginning to brown, about 1 minute. Transfer meat to a cutting board and let rest 10 minutes. (For medium-rare, your steak should reach an internal temperature of 125°–130°.)Step 4Cut meat from bone and slice against the grain 1\" thick. Spoon some infused brown butter over steak and sprinkle with sea salt.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Brown Butter–Basted Steak?Leave a ReviewTell us what you thinkReviews (5)Back to TopTrianglePerfect way to get restaurant-quality steak! I could never figure out how to get the amazing crust and I think it comes down to the seasoning and letting it come to room temp before cooking. Really delicious and the brown butter basting adds beautiful colour tooAnonymousAustralia7/6/2020Delicious!  My family rated it the BEST pan fried recipe we've made.  I was sparing with the rosemary just to add a hint of flavor and it tasted great!AnonymousSan Diego, Calif 4/13/2020Wow. Yum. I impressed myself with how well this recipe turned out. I followed the instructions to a tee and my steaks turned out fabulous. A perfect Medium rare+. Found some NZ grass-fed Wagyu ribeyes on sale at the store and this simple recipe really did them justice. Loved it!  AnonymousDallas1/2/2020Amazing recipe!!!AnonymousNew York2/5/2019Amazing recipe!AnonymousNew York2/5/2019Explore Bon AppétitBeefMeatRib Eye SteakSteakEasy5 Ingredients or FewerMainGluten-FreeNut-FreeKetoFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Kat Boytsova"]}