{"id": "f2e3aa1ec81da72e23c73a1bfa05fc66", "url": "https://www.bonappetit.com/story/olafur-eliasson-climate-change-tasting-menu", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "The Best Part of This Tate Modern Exhibition Was...Lunch | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Part of This Tate Modern Exhibition Was...LunchIt’s part of artist Olafur Eliasson’s climate-focused work, and it’s delicious.By Allie WistDecember 6, 2019FacebookTwitterEmailPhoto by Allie WistFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Most visitors to artist Olafur Eliasson’s blockbuster retrospective at the Tate Modern in London are there for, well, the art. I too bought tickets weeks ahead of my trip to witness the experiential installations by an artist who famously dragged 12 icebergs from Greenland to Paris as a statement about climate change. While there, I waded through a room thick with fog that rendered me color-blind and a kaleidoscope-like tunnel that seemed to compress and contour the space around me. At the very end of the show, however, I noticed a sign pointing to what turned out to be my favorite moment in the whole exhibition: lunch.The fog! (Possible inspo for carrot soup?)\nPHOTO BY ALLIE WISTDownstairs, at the Tate Modern’s terrace bar, was a five-course tasting menu featuring funky local cider, rich and salty focaccia, a cumin-forward hummus, and more. Jon Atashroo, the head chef at Tate Modern, spent a week at Studio Olafur Eliasson (SOE) Kitchen in Berlin to develop a menu in response to Eliasson’s research. (It’s available until the exhibition closes on January 5, 2020.)Artist Olafur Eliasson turns his climate-focused art into a tasting menu.\nPhoto by Allie WistThe dishes highlight organic and sustainably sourced vegetables and fermented and cured ingredients, which theoretically help reduce reliance on shipping and minimize the lunch’s CO2 emissions. Butter, for example, is replaced by homemade labneh, and local rapeseed oil is used in place of imported olive oil. Each dish is annotated with its carbon footprint. A velvety carrot soup topped with a preserved-lemon-and-almond crunch: 257 g CO2e. A smoky, sweet red pepper dip: 45 g CO2e. A courgette (a.k.a. zucchini) salad with sour grapefruit, mint leaves, and nuts: 38 g CO2e. The dishes were sustainable, and yet still indulgent, bright and unexpected—not unlike some of the artist’s installations themselves.Talking about climate change can be bleak and, at its worse, preachy. But at the Tate Modern, that conversation is neither of those things. Instead, it’s delicious.Go there: Studio Olafur Eliasson Kitchen at the Tate ModernExplore Bon AppétitLondonHighly RecommendRead MorecookingWe Went on a Field TripBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-06", "author": ["Condé Nast", "Allie Wist"]}