{"id": "f2f072224e1393d9a089b9a1debe7d74", "url": "https://www.bonappetit.com/story/best-spring-cookbooks-2018", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "17 New Spring Cookbooks We Can’t Wait to Stain | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture17 New Spring Cookbooks We Can’t Wait to StainA re-release of the essential River Cafe cookbook, a beautiful compendium of vegetarian Indian cooking, and more.By Christine MuhlkeApril 2, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIt’s no coincidence that spring is one of the greatest times of the year to cook—and one of the greatest seasons for cookbook releases. These are the 17 new cookbooks we can’t wait to stain.River Café 30 by Ruth RogersWhen Rogers Gray Italian Country Cook Book was published in 1995, it launched a food moment, the ripples of which are being felt to this day. The seductively elemental Italian recipes from Ruth Rogers and Rose Gray—untrained chefs who had started London’s River Cafe as a commissary for the architects in Richard Rogers’s practice on Thames Wharf—sent me and countless others scrambling for ingredients like lacinato kale and salt-packed anchovies. Many a dinner party was built around their pumpkin risotto, and many was foiled by a failed Chocolate Nemesis cake. While the dishes at the fabled restaurant—home to such young cooks as April Bloomfield, Jamie Oliver, and Clare Deboer and Jess Shadbolt of NYC’s King—were flawless, the published recipes were rather loosey-goosey. The stunningly designed 30th-anniversary edition of the beloved blue book corrects that, as the recipes have been tested and updated. Like the restaurant, the dishes in River Cafe 30 feel as vital and vibrant as ever.Cake by Maira Kalman and Barbara Scott-GoodmanSweets have always figured in Maira Kalman’s jaunty paintings. Now she has created Cake, a cookbook that delights the palate and stirs the heart, with narrative, nostalgic illustrations followed by recipes, created by her friend Barbara Scott-Goodman, for favorites like coconut layer cake, plum torte, and the honey cake that her cousin Tali always puts into her suitcase before she returns home to NYC. Especially poignant is the image of the pink “philosophical cake” that her family made while living in Rome in the ‘80s, iced with the words, “A day without dancing is a wasted day.” It’s Love, Loss, and What I Baked.A Baker’s Year: Twelve Months of Baking and Living the Simple Life at the Smoke Signals Bakery by Tara Jensen“Elbow deep in dough, I surrendered.” North Carolina baker Tara Jensen achieved Instagram fame first for her artful, post-latticed pie crusts and masterful bread, then for her raw breakup posts and Deep Observations from the remote countryside. Her fearlessly honest—some might say way oversharing—book, A Baker’s Year, is part diary, part artisanal baking manual, with recipes for New Moon Cake, Broken Down Berry Pie, and Bloody Butcher Pancakes. In short, millennial gold. The instructions lean toward the minimalist and intuitive, meaning you might need to watch a YouTube video to master that crust or know if your starter—excuse me, (A) Culture (of Resistance)—is really kicking. While you’re online, check out Julia Kramer’s excellent profile of Jensen for BA.Variations on the Full Moon Cake from A Baker’s Year.\nA BAKER'S YEAR. Text and illustration credits (c) 2018 by Tara Jensen and reprinted by permission of St. Martin's Press.Fresh India by Meera SodhaBritish blogger Meera Sodha’s debut cookbook, Made in India, was an instant classic, creating authentic Indian flavors by using what most people have in the fridge. (In fact, I have some of her cilantro-coconut chutney in the freezer right now, waiting to be added to chicken.) Her vegetarian sequel, Fresh India, is just as dog-earrable, with recipes like Sri Lankan dal with coconut and lime kale and the addictive shredded Brussels sprout thoran, or stir fry, which prompts you to shred them in the food processor. (Light bulb/forehead-slapping moment.) Like Sodha, with her bangs and red lipstick, these recipes feel both relaxed and spontaneous, taking much of the intimidation out of Indian cooking.(Right) Photo by Jennifer MayJapan: The Cookbook by Nancy Singleton HachisuJapan: The Cookbook is an essential, authoritative, approachable guide to the country’s cooking by expat Nancy Singleton Hachisu, author of the cult favorite Japanese Farm Food. The condensed history of Japanese food alone is both humbling and endearing. (We Americans can surely learn something from a cuisine that began around 12,000 B.C., when the creation of earthenware pots and the use of ash to remove toxins or bitterness from mountain vegetables first began—both still used today.) The recipes are brief and simple, with big payoff once you’ve stocked your pantry. Get ready to make fried chicken meatballs with nori; flowering greens with sake-soy; and crispy greens with sesame part of your repertoire.Feast: Food of the Islamic World by Anissa HelouAnissa Helou’s Feast: Food of the Islamic World provides an insightful, lushly depicted journey into millennia-old cuisines many of us know relatively bupkus about. Helou’s chapter on bread alone is a travelogue, seducing with recipes for flat and filled breads from Yemen, Somalia, India, Morroco, Iran, Turkey, and more. (The Zanzibari savory doughnuts and Arabian date bread are particularly appealing). This being a celebratory book, recipes for whole beasts—or just their humps, legs, and breasts—elaborate rice dishes, and spice mixes combine with more makeable pleasures like meatballs in sour cherry sauce, baked rice cakes with lamb, and Ramadan date cookies. Helou is both scholar and hedonist, which makes for the best kind of guide in the kitchen.Superiority Burger: The Vegetarian Hamburger Is Now Delicious by Brooks HeadleyBA contributor Brooks Headley not only runs Superiority Burger, the best vegan-leaning burger joint in NYC, his punk ethos and deadpan humor make for some of the best cookbook reading ever. Now he brings his “modest, non-fancy” ethos, as well as recipes for hippy wraps, tofu-fried tofu, burnt broccoli salad and, dear lord, that gelato, home with Superiority Burger: The Vegetarian Hamburger Is Now Delicious. Even if you don’t make his signature burger, you’ll enjoy reading the recipe, in which he proclaims, “The un-likeness to the real thing is uncanny… They are absolutely recognizable as food, and are meant to be a Luddite response to the modern gaggle of vegetable patties that bleed and squirt and ape.” Vegans—no, humans—rejoice.The oh-so-famous veggie burger at Superiority, coming to a kitchen near you.\nSam HodgsonSomething Old, Something New: Classic Recipes Reinvented by Tamar AdlerFood writing—that is, good writing about food—ain’t what it used to be. Posts and feeds can’t compare to the confident, informed words of M.F.K. Fisher, Elizabeth David, or Patience Gray. They were actively cooking and researching (and living), then weighing each phrase, producing lasting works that no emoji can summarize. Editor and Chez Panisse cook turned author Tamar Adler has set herself in their footsteps, producing books with cooking in them rather than straight-up cookbooks. Her debut, An Everlasting Meal, made leftovers seem quite lovely, a dinner of toast and beans a quiet moral victory. With Something Old, Something New: Classic Recipes Reinvented, she strives to revitalize fusty classics and long-forgotten dishes, bringing them into this century with verve and ease. And so this spring might find you serving—without air quotes—Waldorf salad and Charlotte Russe; A Respectful Omelet and braised lettuce on toast. To get to the recipes, you will clamber past tightly crafted sentences like “This [shrimp] bisque is for fishermen and boat builders, for falconers, toll collectors, bricklayers, cooks, floor cleaners, window washers, bakers, bookbinders, gas pump attendants, metalworkers, and teachers, a most noble if not royal collection of humanity indeed.” It’s bookery meets cookery.Other books of note:Aska by Fredrik BerseliusThis season’s prettiest entry in the “collectible, not cookable” category is from the excellent Brooklyn restaurant Aska.Jam Session: A Fruit-Preserving Handbook by Joyce GoldsteinThe former Chez Panisse chef has just the right touch.Repertoire: All the Recipes You Need by Jessica BattilanaThe title says it all: The perfect one-stop cookbook that builds kitchen confidence to boot.Food52 Any Night Grilling by Paula DisbroweFinally, a grilling book that’s not bro-y. Pass the grilled cauliflower with green harissa!How to Eat a Peach by Diana HenryThe unstoppable Ms. Henry does it again.The Flavor Matrix: The Art and Science of Pairing Common Ingredients to Create Extraordinary Dishes by James BriscioneRemember that IBM Watson computer? Well, it helped form the basis of this book, which scientifically determines foods with complementary flavor compounds. Strawberries with mushrooms? You betcha.Sweet Laurel: Recipes for Whole Food, Grain-Free Desserts by Laurel Gallucci and Claire ThomasThe women behind the popular L.A. bakery have mastered delicious GF treats that require fewer than 10 ingredients—none hard to find.Session Cocktails: Low Alcohol Drinks for Any Occasion by Drew Lazor and the editors of PUNCHGreat recipes for when you need to ease into your evening (or day).Eat a Little Better: Great Flavor, Good Health, Better World by Sam KassFormer food policy advisor and, hey, Obama chef Sam Kass brings you simple, doable ways to eat (and feel) healthier and shop more sustainably without driving yourself nuts.Explore Bon AppétitCookbooksRead Morecooking8 Reasons Why Molly Yeh Loves Yogurt More Than LIFEBy Molly YehLifestyle5 New Vegetarian Cookbooks We're All About This SpringGallery5 SlidesBy Aliza AbarbanelLifestyle13 Healthy Cookbooks That Changed the Way We EatGallery13 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-02", "author": ["Condé Nast", "Christine Muhlke"]}