{"id": "f316a0e6f01590f5eb60fc7fd0bc5f01", "url": "https://www.bonappetit.com/story/the-raita-formula", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "The Raita Formula I’ve Memorized for Yogurt Sauce Success | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Raita Formula I’ve Memorized for Yogurt Sauce SuccessI firmly believe that yogurt should be savory.By Priya KrishnaApril 11, 2018FacebookTwitterEmailPeden + MunkFacebookTwitterEmailIn the U.S., we’re used to eating yogurt for breakfast like it’s an ice cream sundae. We toss on some fruit, granola, a drizzle of honey, an assortment of powders and pollens or whatever. Sometimes the yogurt itself is flavored like ice cream or strawberry cheesecake or Boston cream pie. A lot of it: Blech!By contrast, in Indian cuisine yogurt is, more often than not, savory. It’s eaten with every meal, and it’s flavored not with fake strawberry powder but with freshly roasted cumin or crisped-up curry leaves. What I’m trying to say is: Our yogurt is better.Yogurt is essential to Indian cuisine. In a category of food filled with hearty, spicy stews, yogurt is a necessary refresher for tempering all that heat—and it does a far better job at that than water or beer. In our house, we, like many Indian families, make our own yogurt regularly, and have a culture that’s been hanging around in our freezer for decades. And out of all the yogurt-filled dishes in Indian cuisine—lassi (like a smoothie), dahi vada (yogurt dumplings), kadhi (a yogurt-based stew)—the most wonderful and accessible is raita.Kheera (cucumber) raita at Babu Ji in New York.\nLaura MurrayRaita is a condiment/side dish typically made of yogurt plus some combination of vegetables, spices, and if it’s a fancy occasion, teeny fritters made of chickpea flour called boondi. I can’t imagine an Indian meal without raita. It’s what I eat when I need to come up for air  in the midst of all those sabzis and dals. It’s how I survive my mom’s delicious but somewhat cruel addition of hidden whole dried red chiles to most of her food.The other thing I like about raita is that it’s not a throwaway part of a meal like a basket of stale bread or an awkward mid-dinner cup of sorbet. It’s seasoned in the same layered way as other Indian dishes—usually with small amounts of sugar, salt, and some spice combo. And there’s texture, too, whether from grated cucumber or diced potatoes. It has the nuance of Indian cooking but also plays that much-needed role of the refresher.We love raita in our family so much that we even have raita-related inside jokes. Like when my uncle and aunt ended up at dinner with my uncle’s ex-girlfriend in Delhi, and she tried to serve them raita made with cauliflower (which is blasphemous, I found out, because cauliflower ends up soggy and gross when mixed with yogurt). The phrase cauliflower raita is enough to make any member in our family burst into laughter. Weird, I know.So as long as there’s no cauliflower involved, my mom’s sweet-with-a-bit-o’-heat raita formula is very simple. Here’s how it breaks down:Start with plain (not Greek, as you want the liquid) yogurt+Mix in a pinch of sugar, salt, and red chili powder+Add spices (cumin works wonderfully as does a combination of pan-fried curry leaves and mustard seeds)+Add grated/cubed/raw/cooked vegetable of your choice. Go with a robust vegetable that won’t turn to mush when mixed with yogurt—cucumber, squash, potato, and the like. (No cauliflower!)And you’re done.Raita can also be deployed beyond Indian cuisine. You can eat it by itself as a savory yogurt snack; you can use it as a marinade for chicken; you can serve it as a side or topping to any hearty dish in need of a light accompaniment—lamb chops, fried things, stuffed breads, roasted vegetables.Savory yogurt is by no means unique to Indian cuisine—countless countries from Iran to Lebanon dress their yogurt in spices and salt. And yet, my Brooklyn bodega is still stocking five varieties of the saccharine fruit-on-the-bottom stuff that the kids from the middle school across the street can’t seem to get enough of.We deserve better from our yogurt. We deserve raita! With that, here’s a handy chart my mom helped me whip up for turning any bowl of plain yogurt into a multi-purpose raita of your choosing.Click here to open full-size chart.\nPriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.Read more: The Instant Pot Dal Formula That Makes Dinner In MinutesExplore Bon AppétitIndianishYogurtRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-11", "author": ["Condé Nast", "Priya Krishna"]}