{"id": "f31b07a47f969f7cdcada88473cf6b00", "url": "https://www.bonappetit.com/recipe/tortellini-with-brown-butter-and-sage", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "Tortellini with Brown Butter and Sage Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTortellini with Brown Butter and SageBy Molly BazApril 28, 20194.3(50)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintStore-bought tortellini are the kind of weeknight hack we can get behind—especially when they're tossed with plenty of garlicky brown butter and toasty walnuts. Any variety of stuffed pasta will work here (ravioli, agnolotti, etc.), though we're partial to a classic cheese filling regardless of shape; it'll really let that sage-y sauce shine. Just make sure to buy the fresh stuff from the refrigerated (or frozen!) section of the store, and avoid weird shelf-stable versions at all costs.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketLarge Pot$55 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Skillet$84 At AmazonSpatula$12.99 At AmazonColander$11 At AmazonIngredients4 servingsKosher salt¾cup walnuts5garlic cloves½cup (1 stick) unsalted butter16sage leavesFreshly ground black pepper1lb. store-bought cheese tortellini or tortelloni2tsp. apple cider vinegar2oz. Parmesan, finely grated (about ½ cup)PreparationStep 1Bring a large pot of well-salted water to a boil. Meanwhile, do some prep. First, chop ¾ cup walnuts so they’re roughly the size of peas.Step 2Smash 5 garlic cloves, peel, and discard skins. (You don’t want the cloves to be obliterated, but smashed enough create plenty of surface area.)Step 3Cut ½ cup (1 stick) unsalted butter into 8 pieces and transfer to a large skillet. Heat skillet over medium-low and cook butter, swirling often, until just melted, 2–3 minutes.Step 4Add walnuts and garlic and continue to cook, stirring often with a heatproof spatula, until nuts and garlic are light golden brown and butter solids are browned as well, 3–4 minutes longer. It will get very foamy and hard to see the bottom of the skillet, so use spatula to drag through butter—you should leave a trail of little brown specks in your wake (a.k.a. toasty, delicious milk solids).Step 5Add 16 sage leaves and cook (still over medium-low heat), stirring constantly, until sage crackles and is dark green and crisp, about 1 minute longer. Remove skillet from heat. Hot tip: If you think things are getting too dark, add a splash or two of pasta cooking liquid to the hot pan; this will halt the browning process. Season with 1½ tsp. salt and ½ tsp. pepper.Step 6Cook 1 lb. store-bought cheese tortellini (or other stuffed pasta) in boiling salted water and set a timer according to package directions, but start checking doneness a minute early. Fresh pasta packages are often a little generous with their cook times, so it pays to check sooner rather than later—you don't want falling-apart pasta! Stir pasta once or twice as it cooks to ensure it cooks evenly.Step 7When pasta is cooked, drain and transfer to butter sauce. Return skillet to medium heat and cook, stirring and tossing, until pasta is well coated in sauce, about 30 seconds. Remove from heat and stir in 2 tsp. apple cider vinegar. Taste sauce and add more salt if needed.Step 8Divide tortellini among plates. Sprinkle with 2 oz. Parmesan and a few good cranks of pepper.How would you rate Tortellini with Brown Butter and Sage?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleTry it with a Belgium beer.  We opened a Trappistes Rochefort 6.  It was a fantastic flavor combo. AnonymousSpringfield Mo11/19/2021The recipe is good but too much Salt on this recipe, I guess half amount is enough. If you do not have apple vinegar you can use balsamic vinegar.  Anonymous10/26/2021Made this with Anagolli cheese pasta excellent dish\n I made ot a few times already.AnonymousOntario Canada 9/7/2021I make this with butternut squash ravioli, as I had it in Italy. I usually serve it over a bed of steamed spinach, and  use pignoli. I never would think to add vinegar (I don't like it much), but I now I will have to try it, and with the walnuts instead of pignoli. Sounds like a good version.AnonymousWoodstock NY6/13/2021Made this is half the butter and it turned out very nice. Might work if people find the recipe heavy. Just be sure to splash in pasta water until it's saucy enough.Anonymous8/26/2020This recipe was very easy to make and also very quick from start to finish, with little dishwashing involved. I smashed the garlic more thoroughly, which allowed it to caramelize and have a very soft almost melt-y texture. I also added lots black pepper and some chili flakes in the butter while it was browning, which gave a nice mildly spicy taste. \nI wasn't mindblown by the result, but overall it was a very yummy, quick weeknight family meal. AnonymousOttawa4/8/2020Tasted great - but a little heavy for a main, I agree that this would be a great appetizer for a multi-course meal. The only thing I'd change is that I'd dice the garlic and add more. kartik.dasSingapore4/6/2020Woo! This looks insanely delicious. Thanks to the reviewer who added pumpkin seeds rather than walnuts (fellow nut allergy sufferer here, boo hiss). I just might try this!AnonymousCalifornia USA3/31/2020The sage flavor really comes through in the butter sauce, loved it. Super easy and would make again for a quick meal. Thanks Molly and the whole bon appetit crew for cooking inspo during isolation. Kara_SamadhiMelbourne 3/26/2020I made it with pumpkin ravioli and it was delish.ir2New York City10/11/2019Turned out great! I have a nut allergy, so I substituted pumpkin seeds for the walnuts and they worked really well. I wouldn't say it makes 4 servings though.... but maybe it was just so good I was greedy with how much I filled my bowl. :)whitneyarnerBrooklyn9/8/2019Everyone loved the first 4 or 5 bites and the it was just to rich to finish. Maybe, as an appietizer...?cook to relaxCincinnati6/15/2019This was my first Basically recipe and it did not disappoint. Delish! The first recipe I've made with sage and walnuts, in addition to the first recipe where I felt like a legit home cook. I made this twice in 1 week and bragged to anyone who would listen: \"I used sage AND walnuts in a freakin' brown butter pasta dish!\" \nSo easy and really satisfying. Yum!!heather eatsMontreal6/11/2019I think this came out really well. I did up the count on sage leaves to about 20. Next time I’d do again with my homemade pasta, maybe over some large ravioli as an app. Added the few splashes of pasta water to loosen it up a bit. Recipe was well written with the instructions. Milwaukee, Wisconsin 6/9/2019My boyfriend and I thought it was delicious! But, it's definitely not very healthy... not that that's always bad though - everything in balance :) - however it's not really filling enough to be a main/splurge meal of the day. If I remade it I'd like to modify it to make it more forgiving or filling... perhaps adding vegetables, or swapping the tortellini for a chicken-filled ravioli. Anonymous5/22/2019Explore Bon AppétitPastaSageHerbs & SpicesWalnutNutTortelliniPasta & NoodlesWeeknight MealsQuickEasyMainVegetarianSautéLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-28", "author": ["Condé Nast", "Molly Baz"]}