{"id": "f3298692918746d0ffa73beef28e6f48", "url": "https://www.bonappetit.com/recipe/ricotta-cornmeal-pound-cake", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Ricotta Cornmeal Pound Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueRicotta Cornmeal Pound CakeBy Roxana JullapatJanuary 12, 20214.4(46)Read ReviewsTriangleEmailPinterestPrintPhotographs by Jenny Huang, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“This pound cake hits all the marks: easy to make, ideal for multiple occasions, keeps for a few days, can be made in advance, indulgent without feeling excessive, incredible baking smells, readily accessible ingredients, and kids love it,” writes Roxana Jullapat in her cookbook Mother Grains (out April 2021). “In Spanish, this cake is called queque seco, or ‘dried cake,’ because it isn’t iced, glazed, or frosted. As a trained pastry chef I couldn’t help incorporating ricotta, which adds a buttery richness and a bit of tang to the batter.” If you can’t find it, substitute full-fat cottage cheese. Jullapat prefers the subtlety of white cornmeal in this recipe, but you can use yellow too, which has a more prominent flavor. The goal is to find the most local cornmeal you can, to taste what the country has to offer (we’d also recommend ordering the phenomenal cornmeal from Anson Mills.) Serve it for breakfast with lemon curd or jam, for dessert alongside lightly whipped cream and fresh fruit, or as is, to accompany afternoon coffee.Ingredients8 ServingsNonstick cooking oil spray1cup (125 g) all-purpose flour1cup (160 g) fine-ground white or yellow cornmeal1¾tsp. baking powder¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt10Tbsp. unsalted butter, room temperature1cup (200 g) granulated sugar2large eggs1large egg yolk¼cup sour cream1cup whole-milk ricotta2tsp. vanilla extractLightly whipped cream and/or lemon curd (for serving)PreparationStep 1Place a rack in middle of oven; preheat to 325°. Lightly coat an 8½x4½\" loaf pan with nonstick spray, then line with parchment paper, leaving overhang on long sides.Step 2Whisk flour, cornmeal, baking powder, and salt into a small bowl. Using an electric mixer, beat butter and sugar in a large bowl on medium speed until light and fluffy, about 5 minutes. Add eggs and egg yolk one at a time, mixing to fully incorporate before adding the next. Scrape down sides of bowl, add half of dry ingredients, and beat on low speed just to combine. Add sour cream and remaining dry ingredients and mix 1 minute. Scrape down sides of bowl, add ricotta and vanilla, and mix until well combined. Scrape batter into prepared pan; smooth surface.Step 3Bake cake 40 minutes. Rotate pan and continue to bake cake until golden brown all over and a tester inserted into the center comes out clean, 20–30 minutes more. (Baking the cake slowly at a lower temperature yields a tender and creamy crumb and will prevent it from drying out.) Let cake cool in pan on a wire rack, at least 1 hour.Step 4Carefully run an offset spatula or paring knife around sides of cake and use parchment paper to lift cake from pan; remove parchment. Cut cake into slices and serve topped with whipped cream and/or lemon curd if desired.Do ahead: Cake can be baked 2 days ahead. Store tightly wrapped at room temperature, or freeze up to 2 weeks.Reprinted from Mother Grains: Recipes for the Grain Revolution. Copyright © 2021 by Roxana Jullapat. With permission of the publisher, W.W. Norton & Company, Inc. All rights reserved.\n\nBuy the full book from Amazon.How would you rate Ricotta Cornmeal Pound Cake?Leave a ReviewTell us what you thinkReviews (20)Back to TopTrianglePerfect.  Reminds me of a corn muffin (with blueberries) that a southwest theme place, Red Sage, used to make in DC.  Wonder if I could add blueberries, and perhaps a bit of baking soda, to lighten the crumb, for muffins?  AnonymousWashington, DC2/27/2022If I was looking for a more savory option… can I reduce the sugar? Or will it mess up the whole recipe/different ingredient ratios?Steph PetersonChattanooga, TN12/31/2021Any suggestions for high altitude adjustments?AnonymousRio Rancho, New Mexico12/31/2021Made per recipe choosing fine yellow cornmeal at the 'white or yellow' option.  Baked in 60 minute total time.  Fine crumb with just a little texture due to the cornmeal.  A bit different in density from a usual pound cake given the ricotta and cornmeal included in ingredients.  Sweet enough but not too much.  All as expected and very good.  \"Handsome\" on platter in whole form. Slices easily when cooled.  dimmerswitchBoise ID12/10/2021This is so good that I’m at risk of eating the whole cake. I love the extra flavor and bit of crunch from the cornmeal. Definitely not a cornbread as some others said. Great way to use up that little bit of extra ricotta. I added orange zest as others recommended..Tia Malkin-FontecchioDowningtown 12/6/2021I prepared this exactly as written. The pound cake had a fine, tender texture that was crunchy at the same time. Just perfect. It took longer to bake to test done but it is buttery and moist. If you have ever had corn muffins at an east coast diner, this is a slightly cakier  version. I’ll be making this again and again. AudreyCharleston, SC11/14/2021This was delicious. I made the recipe as written but I added the grated rind of one orange. I baked it 75 minutes. I didn’t have any white cornmeal so I used yellow. It gave it a lovely texture but this did not taste like cornbread to me. I’ll be making this again and again. Lynne Goffstown NH10/10/2021this is so delicious and so simple that if your butter is at room temp you you can have it in the oven 30 min after getting up.  as for boring I second another reviewer ITS POUNDCAKE.  use fine cornmeal for more cake like and less cornbread.  If all you have is medium or course try 1 1/4 cup flour 3/4 cornmeal.   will try the orange zest next.    TGmoser New York, NY 4/22/2021I made the cake as directed using fine yellow corn meal.  At first I thought the batter wouldn't fit in the 8 1/2 by 4 1/2\" loaf pan. It did but was very full. It took longer to bake than the recipe stated. We loved the cake - the texture, sweetness, moistness and everything else. A definite keeper. Peggy. Little Rock, Arkansas . 3/13/21Little Rock, Arkansas3/14/2021I made this as written with the only addition of some caracara orange zest.  It is not a sweet cake but a nice cake to eat with a cup of coffee.  The cake has a surprisingly tender crumb knowing that cornmeal is an ingredient but that must be due to the ricotta.  Next time I make this, I will add a glaze to make it just a bit sweeter.Deb F Philadelphia suburbs2/19/2021I really really really wanted to like this. It smelled amazing while it baked and the ingredients all speak to me (sour cream! Ricotta! Butter!) but it came out so incredibly dry, I had to absolutely smother it in yogurt and honey to make it edible. I used masa harina, as another user mentioned, because I had it on hand so maybe that contributed to it. I also reduced the sugar by 1/4, but that really shouldn’t have made a huge difference. Kam Los Angeles2/11/2021I loved this! Easy to put together. Definitely moist, not sweet. Perfect for breakfast or an afternoon snack. I even loved the end pieces, which I don't normally enjoy!JennySt. Louis2/4/2021In our little family of two, plus those who I share with, this recipe was a home run!  I followed the recipe by the gram weights provided, and my only deviation was to use my U.S.A. \"Cakelette\" pan.  I crafted 6 cakelettes for an indulgent Sunday breakfast, and total baking time was 27 minutes.  One reviewer mentioned the word \"boring\", but this is a poundcake after all.  Time to concentrate on moisture and texture, which this recipe excelled in.  The cornmeal sure added to this recipe.  Should I ever gild the Lilly, when making this luxury \"breakfast\" again, I may add a teaspoon of rasped lemon zest.Jeff WinettSherman Oaks, California1/31/2021It's a nice texture - very creamy on the inside. But the flavor is super boring. I tried adding orange zest, but it didn't do much. Maybe maple syrup would be good with it, replacing the sugar and adding more flavor? Rik1/20/2021I made this yesterday. This is definitely on the cake side of a corn bread which is what i expected. I really like it. It's a great snack on it's own. Super moist the following day. I can't stop eating it. Wish I would have made some lemon curd to try with it out of curiosity. A tomato jam would be fun. I'm smothering it with Isigny Ste. Mere unsalted butter and might eat the whole thing just like this. My suggestion is to toast it up and cover it in butter! JoeChicago1/19/2021Explore Bon AppétitCakeDessertRicottaCheeseCornmealFlourEasyNut-FreeBakingEasterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Roxana Jullapat"]}