{"id": "f33e386e83f535892d5f1f7f54800799", "url": "https://www.bonappetit.com/recipe/instant-pot-vegetable-stock", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Instant Pot Vegetable Stock Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueInstant Pot Vegetable StockBy Carla Lalli MusicDecember 3, 20184.7(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintBrowning the onions and using mushrooms gives this stock a deep golden brown color and plenty of structure and savory flavors. If you plan to use the stock in a dish where it will cook down dramatically (such as a braise, risotto, or pan sauce), omit the salt.IngredientsMakes about 2½ quarts1Tbsp. vegetable oil2medium onions, unpeeled, halved2celery stalks, halved crosswise2large carrots (6–8 oz. each), scrubbed, halved crosswise8oz. white button or crimini mushrooms, torn in half if large1head of garlic, halved crosswiseHandful of parsley2bay leaves1tsp. whole black peppercorns2tsp. kosher salt (optional)Special EquipmentAn Instant Pot or other pressure cookerPreparationStep 1Heat oil in Instant Pot on Sauté setting (if using a manual pressure cooker, heat over medium-high). Add onions, cut sides down, and cook, undisturbed, until golden brown, about 3 minutes. Add celery, carrots, mushrooms, and garlic and toss to combine and coat with oil. Reduce heat to medium and cook with lid askew, stirring occasionally, until onions and mushrooms start to release some liquid and vegetables are browned in spots, 5–6 minutes. Stir in parsley, bay leaves, and peppercorns, then pour in 3 quarts water.Step 2Lock lid and cook stock on high pressure 40 minutes, then release pressure manually.Step 3Strain stock through a fine-mesh sieve into a large bowl; discard solids. Add salt (if using), stirring to dissolve. Let cool.Step 4Do Ahead: Stock can be made 4 days ahead. Cover and chill, or freeze up to 6 months.Photo by Chelsie Craig, Food Styling by Kate BuckensHow would you rate Instant Pot Vegetable Stock?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI have a 6 qt Instant Pot and am just starting to use it--I'm very excited to make home made veggie stock. I wasn't able to add the full 3 quarts of water and stay at the 2/3 full line inside the pot. Was the recipe written for the 8 quart model? AnonymousIowa City, IA11/15/2021This recipe is a total game-changer. I'd had my eye on a risotto recipe (also for the pressure cooker) but didn't have any stock to make it with. The other only time I'd made homemade stock had involved tons of very specific vegetables getting chopped up, roasted in the oven, and then simmered for hours, yielding a fairly unimpressive amount of liquid for all that work. Enter the eminent Ms Music! This being the middle of a pandemic, I adapted this recipe to what I had at home: half an onion, half a head of garlic, a couple of wilty carrots, some dried shiitakes, some woody dill stems and two green onions. I cut the onion in thick slabs and lightly crushed the garlic cloves in their skins to create a bit more surface area for flavor extraction. I reconstituted the shiitakes in some cold water for 5 minutes before the browning step. And I threw a bit of kombu in there for umami, along with the bay leaves and the peppercorns. Filled my little pressure cooker with water to the 2/3 mark, cranked up the heat and within an hour I had 8 cups of savory, tea-colored broth. This is the only way I'll make vegetable stock from now on. Looking forward to trying other variations following this same formula - fennel broth, Parmesan rind broth... Anyway, next stop risotto!AnonymousMontreal4/16/2020Such a great stock. I refuse to make a different one now. You know how sometimes there’s a funk flavor hanging around at the end of your stock when you taste it? This one has none of that. It’s flavorful in all the right ways. AnonymousSome mountains in Utah4/5/2020Very tasty, no need to release the pressure though and lose that extra couple of cups of stock. Just let it come down on its own and reap the benefits.Anonymous3/1/2020This is great broth!  I used a pan to brown and then slow cooked the broth.  The final product is so rich and delicious.  It tastes a lot like a good French onion soup broth to me - yummmmm.AnonymousSW Florida2/1/2019Just an incredible, and delicious, simple recipe.  Comes out dark & rich.  Freeze what you don't use right away & use it during the week.  And if you're using the frozen stock in an instapot, you don't even have to thaw it.AnonymousMontclair, NJ1/21/2019This is a great base recipe. An even better solution than buying mushrooms is simply to save the stalks of any portobellos or shiitakes you use in other recipes. I keep them -- and the end pieces of other veg I've been cooking with -- in a ziplock in the freezer. Bits of fennel and tomato add sweetness and complexity as well. Anonymous12/5/2018Explore Bon AppétitStockCarrotVegetableOnionMushroomDairy-FreeGluten-FreeNut-FreeVeganVegetarianKetoInstant PotRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-03", "author": ["Condé Nast", "Carla Lalli Music"]}