{"id": "f345a7ce8e82d74a9ec0ececa9dd2839", "url": "https://www.bonappetit.com/story/why-is-cheddar-cheese-orange", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Why Is Cheddar Cheese Orange Sometimes? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy Is Cheddar Cheese Orange Sometimes? One of life's great mysteries, solved!By Sarah JampelDecember 17, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Yekaterina Boytsova FacebookTwitterEmailThere are some questions that we go through life never even asking: How do candles burn? What is freezing rain? Is it “daylight saving time” or “daylight savings time”? When is Mercury not in retrograde? And since when is it normal for cheese to be orange?Picture a cheeseburger, a grilled cheese, a bowl of macaroni and cheese, or a box of Cheez-Its. The cheese is orange, but why? It’s not as if cheddar cheese is made from orange milk, right?Well, back in seventeenth century England, it sort of was. Cheddar cheese was produced from cows whose grass diet was high in beta-carotene, which lent an orange pigment to their milk. That hue came to be a marker of high-quality cheese, which meant that producers of lower-quality, lower-fat cheese learned to game the system by adding pigment from saffron, marigold, and carrot juice.The technique moved to the U.S. with cheesemakers in Wisconsin, Ohio, Indiana, who wanted to ensure a uniform color throughout the year (since the color of cheese changes depending on whether the cows are eating beta-carotene-rich grass in the spring or hay in the winter) and to distinguish their product from the typically white cheese made in New England and New York. Over time, the color orange became associated with cheese itself, which explains why American cheese—and also cheese snacks like Cheetos—are orange, too.Today, the color most often comes from annatto, a food coloring and condiment made from the seeds of the achiote tree, and/or paprika. Since the color doesn’t noticeably affect the flavor or texture of the cheese, pick whichever cheddar you prefer. What’s far more important is how long the cheese has aged: Younger cheese is sweeter, milder, and softer—it will melt more readily. The longer the cheddar is aged the harder, more acidic, and more piquant it becomes.But whether you’re buying orange or white, pre-shredded cheese is a no-no: Not only is it more expensive, but it contains additives to stop the cheese strands from clumping that inhibit smooth melting. And your gratin can’t have that.Get the recipe:Greens Gratin With All the CheeseHere's a fun party trick: Ask your friends to guess how many pounds of greens went into this supremely cheesy gratin. Three huge bunches of kale (and/or chard) get drowned in garlic- and rosemary-infused cream, then blanketed in cheddar cheese and panko and sent into a hot oven, where they sizzle and shrink. View RecipeExplore Bon AppétitCheddarCheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-17", "author": ["Condé Nast", "Sarah Jampel"]}