{"id": "f34f4b64614cb873f86009e1cfc7989e", "url": "https://www.bonappetit.com/story/how-to-make-braised-brisket", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "Follow These Rules for Perfect Braised Brisket, Every Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFollow These Rules for Perfect Braised Brisket, Every TimeEditor in chief Adam Rapoport says brisket should be kind of sweet, a little bit spicy, and really meaty. Here are his tricks for mastering it.By Adam RapoportDecember 18, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The Rapoport guide to brisketIf it’s Hanukkah in the Rapoport household, it smells like brisket—kind of sweet, a little bit spicy, really meaty, pass the latkes, and can I get a bit more of that gravy?We celebrated last night (a week late—I know, I know) because, well, the Rapoport siblings live here and there, and we get together at my mom’s when we can.I picked up a five-pound beef brisket from the butcher, comprising the “point” cut, which means the more marbled portion of a brisket. The flat, or first cut, is more common, and larger. But the point yields a richer, more luscious final product. (As Carla Music likes to say, “the point is the point.” Remember that when you head to the butcher.)Want this letter before it hits the website? Sign up for our newsletter!Pretty much every year, I make my mom’s recipe, which she got from her friend Doris Feinsilber back in the early ‘70s. It leans more, how should I say...Midwest, down-home than what you might consider “Jewish.”The key ingredients to Maxine’s brisket recipe: a 14-ounce bottle of Heinz ketchup, some Worcestershire sauce, a bit of brown sugar, a couple of onions and bunch of dried spices.Which, if you think about it, is not dissimilar to the brisket recipe we ran last year from Cambridge, Massachusetts’ excellent new-school deli, Mamaleh’s (pictured up top). Whereas Maxine’s version relies on ketchup for sweetness, Mamaleh’s turns to Manischewitz concord grape wine.In either a case, the blend of sweet and spicy elements produce a tangy sauce, not unlike what you find with Texas barbecued brisket. It proves the perfect complement to the rich, fall-apart-tender meat.Photo by Adam RapoportWhichever brisket recipe you opt for, just remember a couple of things:Salt it well all over. It’s hefty cut of meat; it can take it.Brown it well all over before you braise it.Better to cook it a bit too long than too short. No one wants tough meat.When the brisket is done cooking (pierce it with a knife; it should give easily), I like to remove the meat from the sauce to let it cool. You can do this a few days ahead, even. I then strain the solids from the sauce, and after the gravy cools in the fridge, I skim the solidified fat cap.Now, the important part: Slice the cooled meat against the grain, and layer it into a baking dish and then pour the sauce all over it. (Pictured above on my mom’s rug, because you gotta do what it takes to get the ‘gram, right?)Cover and slowly reheat at, like, 300°. Do this, and each slice will absorb the sweet, silky sauce—and become that much more tender—while doing so.Brisket does the trick for pretty much any big holiday meal. Even when it’s a week late.Get some brisket recipes:Maxine’s Brisket (my mom’s recipe)Mamaleh’s BrisketBraised Brisket with Hot Sauce and Mixed ChilesBraised Brisket with Bourbon-Peach GlazeExplore Bon AppétitBrisketAdam NewsletterRead MorecookingMy Mom’s Brisket Recipe Uses an Entire Bottle of Heinz KetchupBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-18", "author": ["Condé Nast", "Adam Rapoport"]}