{"id": "f35242b1e263faac7484bd55a08fad54", "url": "https://www.bonappetit.com/recipe/coconut-apple-ginger-dal", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Coconut-Apple-Ginger Dal Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueCoconut-Apple-Ginger DalBy Anna StockwellOctober 16, 20184.6(66)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Anna StockwellEmailPinterestPrintEmailPinterestPrintThis velvety lentil soup is the antidote to holiday excess; skip the yogurt to make it vegan. We love using red lentils because they finish cooking in 20 minutes and break down quickly.Ingredients4 servings 2Tbsp. virgin coconut oil¼tsp. cayenne pepper¼tsp. ground cumin¼tsp. ground turmeric½large onion, finely chopped2garlic cloves, finely chopped13\" piece ginger, peeled, finely chopped1large apple (unpeeled), grated on the large holes of a box grater1½cups red lentils113.5-oz. can coconut milk2Tbsp. fresh lime juiceKosher salt, freshly ground pepperPlain yogurt, cilantro leaves, and toasted unsweetened coconut flakes (for serving)PreparationStep 1Heat oil in a large pot over medium-high. Cook cayenne, cumin, and turmeric, stirring, until fragrant, about 1 minute. Add onion, garlic, and ginger and cook, stirring, until softened, about 3 minutes. Add apple and lentils and stir to coat. Stir in coconut milk and 2½ cups water and bring to a boil. Reduce heat and simmer, stirring occasionally, until lentils are completely soft and dal is thick, 20–25 minutes. Add lime juice and season with salt and pepper.Step 2Divide dal among bowls and top with yogurt, cilantro, and coconut flakes; season with more pepper.How would you rate Coconut-Apple-Ginger Dal?Leave a ReviewTell us what you thinkReviews (37)Back to TopTriangleSO good. I added a chunk of butter at the end served with Bon Appetit's flatbread recipe. Phenomenal. AnonymousPortland, OR3/9/2022I agree with the other reviewers that this recipe could have used a touch more flavor, but nothing a little extra salt couldn't help solve. I think the lime juice and red pepper flakes i sprinkled on top helped give it that acidic balance. I also decided to puree the soup with an emulsion blender to give it a smoother, silkier consistency.CandiceWestchester County, NY1/25/2022SO good. Definitely a recipe you can tweak based on what you have lying around. I used two honeycrisp apples, slightly less ginger, doubled the cumin and added ground coriander and a bit of garam masala. Served over cilantro lime rice and chopped spinach but would also be great with chickpeas or sweet potatoes. Will absolutely make again!!! JaydeChicago, IL 12/29/2021This is such an comforting and healthy go-to dinner for my family. I love adding a whole onion, one extra apple and shredded carrots or chopped greens for more veggies. Tonight I was in a rush and just pulsed everything in the food processor and I love the texture even more!Jacqui B.San Rafael, CA11/16/2021I tried the original recipe and found it a bit bland. I used one onion and I added 1/2 tsp of each spice and added curry powder also. Grated but then drained the apple to remove excess moisture. Turned out a lot better. ChloeEngland6/25/2021So tasty! Followed other reviewers and used a green apple, doubled the spices and garlic, used vegetable broth instead of water, finished with fish sauce and soy sauce. Josie BHChicago3/31/2021Love Indian food and this recipe is delicious.GZ1/31/2021I'm new to cooking with lentils.  This recipe seems like a great first dish to try.  However, I have green lentils, not red.  Anyone know if it'll still work?AnonymousCT1/28/2021We made this recipe tonight both of us think it's really good. Giving it three stars. My husband thinks that you could add green apple if you want to make it a little brighter. ... Or add more coconut flavoring. ....seems like it might need a little bit more of something but you can play around with it. MarieKansas City, Missouri11/24/2020This turned out really great for me. I used a Gala apple and tripled the spices. I also added curry powder like other people said!  I served over rice which also felt like a great touch, and the end result was silky and comforting with only a bit of sweetness. Really simple, delicious vegan meal I'll definitely revisit. AlexKansas City, MO11/10/2020Yummy, easy, but needs a few tweaks. I doubled the spices and added curry powder. The apple flavor did not come through for me, so I'm going to experiment with different kinds of apples and maybe sub a tiny bit of the water in the recipe for apple cider. I made rice to accompany this, and was kicking myself for not throwing broccoli in; I think it would be the perfect veggie addition to the meal. \nOverall, great, easy recipe that is easy to tweak to your liking.AnonymousUS10/22/2020Great recipe; well the bones are good. I suggest following my edits for a more flavorful result!\n\nI doubled the spices right off the bat, I also added 1/2 a teaspoon of curry powder. Instead of half of an onion I used a whole onion. Instead of using water I used vegetable stock to add additional flavor. Since most people said this was too sweet I decided to add 1-2 TBS of soy sauce and 1-2 tsp of fish sauce. Lastly you should season this generously with salt when you add the lime juice. I also used sour cream instead of yogurt but that’s just a personal preference. \n\nOther than that this was a total hit! I will double next time since this is only about 3 generous portions and I wanted leftovers.Denver9/25/2020Oh yea and I only added one can of coconut milk when I doubled the recipe.AnonymousSouthern Maine6/29/2020So good! I doubled the recipe and increased the cumin and turmeric and added veggie stock as mentioned in some of the reviews. I felt like like something else was missing,so I grounded some coriander seeds and boy did that add a ton of flavor. I topped it off with some sprigs of cilantro and coconut yogurt. Yummy!\nAnonymousSouthern Maine6/29/2020Love this recipe, but I need calorie count and macros.  I make this often and am just guessing. It is important that I track. For sure hose of you who don’t have this issue, the recipe is super easy to put together, quick to cook and delicious all rolled into one. AnonymousAjijic, Mexico6/27/2020Explore Bon AppétitDalIndianSouth AsianAsianAppleFruitCoconut MilkOther IngredientsLimeCitrusTurmericHerbs & SpicesRed LentilLentilVegetableOne-Pot MealsMainVegetarianGluten-FreeHealthyishSimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Anna Stockwell"]}