{"id": "f356356c2ecd51245d8e59ad1a448345", "url": "https://www.bonappetit.com/recipe/fresh-tomato-eggs-in-purgatory-with-chickpeas", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Tomato Eggs in Purgatory Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueFresh Tomato Eggs in Purgatory with ChickpeasBy Heidi SwansonAugust 13, 20194.8(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintThis is the perfect summertime breakfast/brunch recipe from Heidi Swanson, the vegetarian cookbook author and blogger behind 101 Cookbooks. Peak-season tomatoes along with chickpeas, toasted almonds, and harissa make for a complete flavor bomb in just one skillet. Keep in mind that harissa brands vary in spiciness. Start off with a smaller amount and build up to your preferred level of heat.Ingredients2 servings¼cup skin-on almonds1½lb. ripe tomatoes½tsp. kosher salt, plus more¼cup extra-virgin olive oil, plus extra for drizzling1tsp. coriander seeds, crushed3Tbsp. harissa paste115-oz. can chickpeas, rinsed4large eggs41\"-thick slices whole grain sourdough bread, toasted1garlic clove, halved lengthwise½bunch of chives, finely choppedPreparationStep 1Chop tomatoes into small pieces and transfer to a small bowl along with all the juices. Mix in ½ tsp. salt.Step 2Heat ¼ cup oil in a large skillet with a lid over medium-high. Add coriander seeds and cook, stirring, until fragrant and starting to pop, about 1 minute. Add harissa and cook, stirring, until fragrant and darkened in color, about 30 seconds. Add chickpeas and tomatoes and bring to a simmer. Cook, mashing up about half of the chickpeas with a wooden spoon, until sauce is reduced and you’re able to make a divot in the mixture, 8–10 minutes. Season with salt, then use a spoon to make little pockets for the eggs near the sides of the skillet.Step 3Reduce heat to low and gently break eggs into pockets. Cover skillet and cook, rotating pan a few times for even heating, until eggs are set, 7–9 minutes.Step 4Meanwhile, drizzle toasts with oil and rub with garlic halves.Step 5Remove eggs from heat and shower with chives and almonds. Serve with garlic toast.How would you rate Fresh Tomato Eggs in Purgatory with Chickpeas?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleLoved this! But be sure to use *ripe* tomatoes as the recipe states otherwise the sauce gets a little too dry. Would highly recommend. vanillafrances7/19/2020omg fabulous.  i soaked and boiled my own chickpeas and made my own harissa.  also made my own pumpernickel bread.  the sum was definitely greater than the parts.brushjlsolon, ohio10/14/2019Really enjoyed the flavors of this version. Will make again when my garden is bursting at the seams.slattrezMN9/26/2019super simple and tasty! didn't have chives so subbed in parsley - refreshing. needed a bit more salt, but otherwise flawless recipe! woo.\nAnonymous9/14/2019Explore Bon AppétitNorth AfricanAfricanMiddle EasternEggChickpeaBeanVegetableTomatoSummerQuickEasyWeeknight MealsOne-Pot MealsMainDairy-FreeVegetarianHealthyishRamadanBreakfastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Heidi Swanson"]}