{"id": "f369cec90a213647726ca2e9740c54da", "url": "https://www.bonappetit.com/story/kyla-peal-restaurant-diary-2", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "How I'm Making the Wine World More Inclusive of Black Women Like Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow I'm Making the Wine World More Inclusive of Black Women Like MeIn her latest Restaurant Diary entry, wine educator Kyla Peal explains how she is creating space in her virtual tastings for diversity, openness, and change.By Kyla Peal, as told to Angela BurkeMarch 3, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week, you’ll hear from one of them: bartender-turned-brand-ambassador Jenny Feldt, farmer Kristyn Leach, line cook Peter Steckler, and wine educator Kyla Peal. Here, Peal, one of the cofounders of Slik Wines, an experiential wine education platform, talks about why diversity, equity, and inclusion need to be part of wine education. Read her first diary entry here.We’ve been pretty busy with hosting virtual events—a wine-pairing dinner, a few tastings, and private client events—at Slik Wines. They all went really well. I led a Valentine’s Day dessert and wine pairing for industry folks who are members of CHADD (Chicago Hospitality Accountable Actions Database), and it ended with a talk on diversity and inclusion in hospitality. The group wanted to discuss the lack of those things in the wine community and fine dining as well as in winemaking labor practices. I shared my experience working in the industry, and it reminded me of areas in my life where I’m having these same conversations.There’s urgency in building a more equitable wine industry. During a recent chat I had with Krista Scruggs of ZAFA Wines and Danielle [one of Slik’s cofounders], Danielle said something interesting about the similarities in what we’re doing at Slik and ZAFA. She said it’s like we’re reclaiming something that’s been gatekept. The wine world hasn’t been easily approachable for Black women. And because it wasn’t made to be inclusive of Black women, people often assume that I know less about wine. I experienced this pretty regularly when I was a server. Diners assumed that I liked these wines—Moscato and white Zinfandel, wines that have historically been marketed toward Black women—and that I didn’t know much about other wines and wine regions. So now I’m like, “No. I’m going to reclaim all of that.” Change always starts with open and honest conversations, and I don’t expect it to happen overnight. But the more we talk about a lack of inclusivity and diversity, the more it’ll stick in the minds of people who are in positions of power and can hire beverage directors, sommeliers, and wine representatives.Photo by Alex J. RiveraBut like many entrepreneurs, I need to work a full-time job in order to support myself because Slik is still a very young business. So when I’m not at home working on Slik, I’m at Verve Wine. It’s difficult and exhausting sometimes, but working there helps me do my job better as a wine educator, cofounder, and business partner. I love when people come into the shop and tell me what they’re making for dinner because I get to present them with wines that they may not have ever considered. Two ladies came in the other day and said they wanted a red wine to go with the ramen they were making. I pulled some bottles of red for them, but I was like, “The acidity of this Riesling would be nuts with your ramen. Trust me.” Pairing wine with non-Eurocentric foods is also an important part of our work at Slik as we help push wine culture forward.Part of my job as a wine educator includes discussing the ways in which our industry can become more fair. I think about that as I walk past restaurants in Chicago, where dining has recently reopened at a limited capacity. The other day, on my way home, I passed a restaurant and it was packed. Absolutely packed! So many questions ran through my mind for the diners in there. Are you doing it for yourself? Are you doing it to support the restaurant? Who is at risk when you are going out? You can support the restaurant by ordering takeout and tipping well and making sure that the staff is taken care of. Think of the folks who are cleaning the dishes and the cooks in the kitchen who are all likely Black and brown folks. Be mindful when you’re going out to eat.I would love to see a great example of a restaurant managing the expectations of everyone well, but that’s a big feat. Personally, I don’t see myself running around a restaurant like I used to, talking to hundreds of people in a week, interacting with all of these folks who are visiting the city. I miss that and I always will. I loved doing it, but I don’t see that as a safe option for me.My transition from furloughed restaurant worker to figuring out what’s next to where I am now—I mean, I never would have thought that we would be here, owning our own business. I know we’ll face more challenges as Slik continues to expand, and that’s okay because I can feel myself growing, too, as a person, as a friend, as a partner, and that is really rewarding.Explore Bon AppétitRestaurant DiariesRestaurantsWineFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-03", "author": ["Condé Nast", "Kyla Peal", "As Told To Angela Burke"]}