{"id": "f3737fea329448d2b4235e15050ed5cf", "url": "https://www.bonappetit.com/story/national-wine-day-ugh", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Ugh, It’s National Wine Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureUgh, It’s National Wine DayThis month alone, we had National Sauvignon Blanc Day on the 4th, Moscato Day on the 9th, and International Chardonnay Day on the 24th, AKA YESTERDAY. THE DAY BEFORE NATIONAL WINE DAY.By Marissa A. RossMay 25, 2018FacebookTwitterEmailPhoto by Alexandra GavilletFacebookTwitterEmailHello, and welcome to The Ross Report, a thing I made up and didn’t ask for permission for, because like my father always said, “It’s easier to ask for forgiveness than permission,” which is a terrible thing to tell your kid and he’s lucky that I’m only now putting it to use, to write rants about wine that no one asked for.Today is National Wine Day. I only know this because I have gotten at least a dozen emails about it nonstop for the last two weeks, and that is a low estimate considering how many emails I knee-jerk-delete with “____ Day is Coming Up!” in the subject line. As you may have guessed from my tone, I do not celebrate National Wine Day. Like a billion Instagram captions, I too believe that every day is National Wine Day [flips hair, adds too many emojis]. It’s mostly because I believe these “National Days” are a marketing epidemic used to mindlessly promote products and harness the power of hashtags, but also, because there are too many damn Inter/National Wine Days.This month alone, we had National Sauvignon Blanc Day on the 4th, Moscato Day on the 9th, and International Chardonnay Day on the 24th, AKA YESTERDAY. THE DAY BEFORE NATIONAL WINE DAY. That’s like having dive bar birthday parties back to back—zero recovery!Although, some argue that Chardonnay Day is actually on the 21st. This is another problem with Wine Days: Apparently no one knows how to share a Google Calendar (even though Wine Folly made one). Is National Rosé Day June 9th, June 11th or August 14th? Considering July has zero Wine Days, maybe we should go ahead and give rosé that whole month, so we can stop giving it a full season. Some say it’s International Albariño Day on August 1st, others say nah nah, it’s actually International Albariño Days August 2nd-7th, which should just be called International Albariño Bender. Good thing it falls over National White Wine Day on August 4th so that’s covered, and gives us enough time to prep for Pinot Noir Day on August 18th. Oh, but don’t forget about National Cabernet Day on August 30th, a traditionally hot day of the year everyone is reeeally clamoring for a highly tannic red.Get into Chardonnay, even on days that aren’t National Chardonnay Day!\nMarissa A. RossHow is National Wine Day supposed to mean anything when there are more than 30 other national wine days a year? Hell, how do any of these wine days mean anything? I mean, they don’t because they are legitimately made up by marketing teams and I know this because my husband is a creative director at an advertising agency and is sitting on the couch agreeing with me. But on the other hand, they can totally mean something. You can make them mean something.If you want to celebrate every Inter/National Wine Day on the calendar, you should. But do it by visiting your local wine shops, buying bottles you love, exploring bottles you’ve never had; by asking questions, having conversations, reading up on a winemaking technique you’d never heard of.Celebrate wine by supporting wine and its community, which yes, means drinking it, no matter what day it is.Marissa Ross is the author of Wine. All the Time. Pick it up on Amazon for $14.1 / 43ChevronChevronDaiquiri, Up-RocksView RecipeExplore Bon AppétitWineRead Moreculture5 Spring Cleaning Wines to Drink While You KonMari Your ClosetsBy Marissa A. Rossculture“Orange Wine” Needs to Go Away—Hear Me OutBy Marissa A. RosscultureA Beginner’s Guide to Wine Faults and FlawsBy Marissa A. RosscultureThere's No Place Like Lou Wine ShopBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-25", "author": ["Condé Nast", "Marissa A. Ross"]}