{"id": "f382243ab21c695c20386f2544858cc2", "url": "https://www.bonappetit.com/recipe/chicken-under-a-brick-in-a-hurry", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Chicken Under a Brick  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken Under a Brick in a HurryBy Carla Lalli MusicNovember 6, 20184.8(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Dana BonaguraEmailPinterestPrintEmailPinterestPrintGetting your chicken super juicy on the inside and extra crispy on the outside requires one simple tool (that’s the brick part) and a few helpful techniques. The trickiest part of this recipe is removing the chicken bones, but you can watch the process in this video. If you don’t want to get your hands messy (we get it), ask your butcher to remove the bones from four chicken thighs, leaving the skin intact. Position the skin-on, boneless thighs close to each other in the pan so that each brick sits on top of two pieces while they cook.Ingredients2 servingsChicken2skin-on, bone-in legs (thigh and drumstick; about 1½ lb. total)Kosher salt, freshly ground pepper1Tbsp. extra-virgin olive oilPesto Verde and Assembly1oil-packed anchovy fillet1garlic clove, smashed1tsp. kosher salt, plus more½cup parsley leaves with tender stems¼cup extra-virgin olive oil1Tbsp. sherry vinegar or red wine vinegar1tsp. Dijon mustard½tsp. crushed red pepper flakes3scallions, white and pale green parts only, thinly slicedPreparationChickenStep 1Wrap 2 bricks with foil (if you don’t have any bricks lying around, use a heavy skillet). Working with 1 leg at a time, place chicken skin side down on a cutting board. Using your fingers, feel for the thigh bone, which runs from one end of the thigh to the other. Using a boning knife or another thin sharp knife, cut straight down into flesh until the tip of the knife hits the bone, then slice from one end of bone to the other to expose its entire length. Using short strokes and trying to stay as close to the bone as possible, cut meat away from bone on both sides, working your way around until you can wiggle the tip of your knife underneath it (take care not to cut through the skin). With the front end of your blade underneath the bone, slice upward toward free end of bone to release flesh. At this point, the bone should only be attached at the joint that connects it to the drumstick.Step 2Repeat this process, this time making a cut from the top of the drumstick bone (at the joint) down to foot end. Cut along either side of drumstick bone (same as you did with the thigh bone) until you can wiggle your knife underneath. With the blade angled toward the cutting board this time, cut meat away from bone. By now, the drumstick and thigh bones should be attached only where they meet at the joint. Make small cuts all around and underneath joint until you can cut out bones completely. Cut away any pieces of cartilage that remain. Turn deboned chicken over and smooth skin over meat.  (Freeze bones and use at a later date for stock.)Step 3Season chicken on both sides with salt and pepper. Pour oil into a medium cast-iron skillet. Place chicken in pan skin side down (it’s okay if the pieces touch, but make sure they don’t overlap). Heat pan over medium-high and place a prepared brick on top of each piece (or, place a sheet of foil over chicken, then set a second cast-iron skillet on top). Cook chicken, checking halfway through to make sure skin isn’t taking on color too quickly and reducing heat to medium if needed, until skin is deep golden brown and crisp and flesh is almost completely cooked through, about 10 minutes.Pesto Verde and AssemblyStep 4While chicken is cooking, place anchovy, garlic, and 1 tsp. salt in a mortar and use pestle to pound to a paste, about 1 minute. Add parsley and continue to pound until completely pulverized, about 2 minutes. (Alternately, grate garlic and finely chop anchovy and parsley, then mix together in a medium bowl.) Mix in oil, vinegar, mustard, and red pepper flakes with pestle, then add scallions. Taste and season with more salt, if needed.Step 5Carefully remove bricks (foil will be greasy) and check chicken. There should be only a hint of medium-rare flesh on the thickest part of the thigh. Using a thin spatula, release chicken skin from pan and turn onto flesh side. Remove from heat and let sit to finish cooking through, about 1 minute.Step 6Spoon some pesto verde onto a platter. Top with chicken, skin side up, and spoon more pesto over (but don’t cover up all that beautiful crisp skin you just created!).How would you rate Chicken Under a Brick in a Hurry?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleWhy doesn’t this have more reviews?! DELICIOUS! Definitely not a diet item, as my play swam in oil, but it’s Saturday :) I did the chicken deboning last night and cooked today- I did 5 chicken quarters in a large pan under a small pan and it worked great! I now know why they don’t sell boneless skin on chicken thighs in the store lol, that was a lot of work, but I honestly think it was worth it. Slicing the thigh up with a knife and getting skin in each bite? Brilliant. AlohalifeAustin tx2/6/2022Always love a juicy crispy chicken thigh but the pesto verde is the star here!!! It pairs beautifully with the chicken, as well as the corn on the cob I served as a side, but I can see myself using it in any dish that needs brightening up. Add some whole milk yogurt to the pesto and voila you have a dip.caro1/26/2022Honestly. I love this product so much. I made it for my unborn foetus like 12 monthes ago and it was amazing, not sure how she ate it though. 5 stars would brick again.Thomas PortwagSaudi Arabia3/16/2021This was delicious! I've made various salsa verde's and this one was really good!AnonymousSacramento, CA7/24/2019What a bloody ripper!  This dish is absolutely swoon-worthy and has shot straight to #1on the family chicken hit list.  Have been looking for ages for a great use for the whole legs stashed in the freezer.  Thanks to Carla, 2 have now been successfully liberated, and another 4 are waiting in the wings (ha!)pjredit9564Sydney, Australia3/1/2019This recipe is great! Would definitely recommend getting a butcher to take the bones out of the chicken, because then it truly is the quickest, most satisfying dinner. The pesto verde is the perfect amount of brightness in comparison to the dark meat chicken (which stays super juicy btw). I make this all the time!AnonymousBoston1/28/2019The Pesto Verde sauce is out of this world! Really gives a savory taste to the chicken. Deboning the thigh and leg quarters was a bit difficult but the end result is well worth it. Plus, the bones are currently being turned into stock for Matzo Ball soup later this week :) AnonymousNew Jersey12/3/2018Explore Bon AppétitParsleyHerbs & SpicesChicken LegChickenPoultryQuickWeeknight MealsMainDairy-FreeGluten-FreeKetoHealthyishFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-06", "author": ["Condé Nast", "Carla Lalli Music"]}