{"id": "f3a07d294390c8e33fca0069905a2c3a", "url": "https://www.bonappetit.com/story/tricks-for-making-sure-cheese-never-clumps-in-pasta", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "3 Tricks for Making Sure Cheese Never Clumps in Pasta | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking3 Tricks for Making Sure Cheese Never Clumps in PastaPlease tell us you're not dumping your cheese in all at once.By Alex DelanySeptember 8, 2018FacebookTwitterEmailFacebookTwitterEmailClumpy isn’t a word you’d use to describe a perfect, cheesy pasta sauce. Smooth or velvety or sublime? Yes, those sound right. But clumpy? No. If your pasta sauce is clumpy, something’s wrong. And we’d be willing to bet it’s the cheese.Maybe not the actual cheese you’re using. If it’s something hard and crumbly like Parmesan or Pecorino or Grana Padano, you’re probably fine in that regard. But there are some things you need to keep in mind when adding cheese to your pasta sauce to avoid unwanted textures. Here are the three things to ask yourself when adding cheese to pasta:Photo by Alex LauIs Your Cheese the Right Size?When we call for cheese to be added to a pasta sauce, we’re usually talking about finely grated Parmesan. You know, the stuff that looks like what comes in those shelf-stable cheese shakers. Except we buy blocks of Parm and use the small, prickly side of our box grater to finely grate the cheese. Or, yes, we have bought pre-grated cheese from the store in a pinch.Cheese that’s grated in large sheets or thick shreds will clump, because a larger amount of surface area allows for more cling potential. A larger piece of cheese also increases the chance that it will melt unevenly and onto other cheese surrounding it. Keep your cheese small and consistent in size for the highest quality melting.Nikole HerriottIs There Liquid in Your Pot?Throwing grated cheese, regardless of size, onto dry pasta will give you a lumpy sauce. Well, not even a sauce. It will just give you globs of cheese. Hot liquids, like pasta water, heavy cream, melted butter, or beaten eggs, help distribute melted cheese evenly by surrounding it with heat. Since every bit of surface area is in contact with hot liquid, the cheese melts at the same rate. No clumps to be found, just a glossy, luscious sauce.Nikole HerriottAre You Adding Your Cheese All at Once?If you are, stop. Don’t do it! Adding the sauce slowly, bit-by-bit, as you stir the liquid and pasta in your pot will make the cheese melt evenly and avoid clumping. Think of it like this: Would you have more success carrying 500 pounds of pasta up the stairs at once, or making multiple trips with a fraction of that 500 pounds at a time? Unless you’re some kind of superhero or power lifting champion, I’d assume you’d prefer the latter. So does your sauce. Letting the cheese incorporate into the sauce little-by-little will guarantee that it stays smooth. Lighten the load. It will make everyone, including your sauce, happier.Now, go make some spaghetti pomodoro, and don't forget to add that Parm bit-by-bit:Basically Spaghetti PomodoroAlmost as easy as opening a can of the store-bought stuff, and one hundred times more delicious.View RecipeExplore Bon AppétitBasicallyPastaCheeseParmesanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-08", "author": ["Condé Nast", "Alex Delany"]}