{"id": "f3b1b61aa5fc79cd618e02ddb68576aa", "url": "https://www.bonappetit.com/story/how-i-came-to-love-korean-food", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "How I Came to Love the Korean Food I Grew Up Resenting | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow I Came to Love the Korean Food I Grew Up ResentingTo really understand what jjigae meant to me, first I had to reject it.By Christina ChaeyMarch 18, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelFacebookTwitterEmailFor the majority of my life, my Koreanness has existed on the fringe of my identity in almost every way. I can make basic conversation or finagle directions to the nearest train or bathroom, but I also basically flunked out of Korean language school. The last K-drama I watched was Stairway to Heaven (it came out in 2003), and for all I know, BTS may as well be One Direction.Growing up, my appetite mirrored this too. It took decades for me to take an interest in actually learning how to cook Korean food; as a kid, I was far more interested in watching Ina Garten make “engagement chicken” than I was in watching my mom make kimchi jjigae. I reluctantly ate her fermented soybean paste stew and seaweed soup for dinner, all the while pining for pasta night, hard-shell taco night, frozen French bread pizza night—anything but Korean, because that was boring. I figured the jjigaes, banchan, and kimchi would always be there, waiting for me until the rare occasion that a true craving for them struck.What sane human could resist this deliciousness?\nPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelIt wasn’t until I started cooking for myself that, surprisingly, I found myself missing the earthy nuttiness of the soybean paste stew called doenjang jjigae, and the funky heat of a pot of kimchi jjigae brimming with soft slices of tofu. As an adult, I constantly crave the flavors of the food I so unwittingly took for granted. I’ve since gone on to cook, both professionally and at home, but I've also realized I know relatively little about the core techniques behind the warming, incredibly flavorful Korean soups and stews I want to eat all the time, particularly in the dead of winter.My desire to immerse myself in Korean cooking is what led me to call up chef Sohui Kim, who owns two wonderful restaurants in Brooklyn (Insa and Good Fork) and who has had a similar journey of first pushing aside, and then eventually embracing, the food of our culture. She even ended up writing an entire cookbook about it, called Korean Home Cooking, which came out this past fall.Chef Sohui Kim, in the lounge at Insa.\nPhoto by Emma FishmanI proposed we spend a day cooking our way through her versions of my all-time favorite childhood dishes; you can find all of those recipes in the March issue of Bon Appétit, as well as right here. She showed me how to bump up the flavor of a classic kimchi stew with a spoonful of gochujang, the fermented red pepper paste. She taught me how to make her take on kalbi jjim, the soy-braised short ribs I only get to eat once a year on my birthday when my grandma makes them for me, and which Sohui makes with the very nontraditional (and very delicious addition) of red wine. I had always assumed this style of cooking was too fussy or time-intensive but, as Sohui showed me, it’s neither. With the exception of those short ribs, which take the time and effort any special-occasion dish deserves, all of the recipes are quick and simple to prepare, full of flavor, and exactly the kind of bone-warming food I want in the last frigid days of winter.It’s taken some time—years, actually—but I’ve finally begun to amass the kind of pantry I think my grandmother would be proud of. There’s a giant bag of gochugaru (Korean chile flakes) in my freezer, as well as giant dehydrated anchovies for making Korean dashi. I can’t rest without knowing I have dried shiitake mushrooms and at least three types of seaweed in my cupboard. I’ve even taken a few stabs at making my own kimchi. There’s still so much I don’t know about this food—I am constantly calling my parents asking them what brand of rice is the best, or what the little cartoon woman on the container of gochujang they buy looks like—but I’m finally ready to take it all in with an open mind, and mouth.Get the recipes:1 / 7ChevronChevronKimchi JjigaeView RecipeExplore Bon AppétitKoreanComfort FoodStewRead MorerecipesThese 7 Recipes Are the Definition of Korean Comfort FoodGallery7 SlidesBy The Bon Appétit StaffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-18", "author": ["Condé Nast", "Christina Chaey"]}