{"id": "f3cedc51078d0f4f42e10357b3d377a6", "url": "https://www.bonappetit.com/story/comal-heritage-food-incubator-denver", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Eating at This Denver Food Incubator Is Like Winning the Lunch Lottery | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsEating at This Denver Food Incubator Is Like Winning the Lunch LotteryComal Heritage Food Incubator changes up its menu nearly every day, but you must go on Fridays for its Middle Eastern menu.By Elyse InamineNovember 8, 2019FacebookTwitterEmailPhoto by Brittany WergesFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m going to be honest: I was craving something very specific when I got to Comal Heritage Food Incubator in Denver one Friday a couple months ago. Crispy tostadas topped with stewed lamb and crunchy lettuce, oozy enchiladas with the requisite rice and beans, and all the other delicious-looking Mexican dishes on the lunch counter’s Instagram feed. But I failed to check the schedule, and the menu that day was Middle Eastern, as is normal for a Friday at the incubator (the Mexican lunch menu is served Monday through Thursday). It’s hard for me to shake a craving once I get one—especially when I’m borderline hangry. But once I ordered half the menu and each dish hit the long, wood picnic table I shared with my friends, I couldn’t complain.We dug into the textural masterpiece that is the fattoush, with pita chips, romaine, cucumber, and the punchiest dressing made up of balsamic vinegar and pomegranate molasses. We dipped the housemade pita, pillowy and charred in all the right places, into tangy tzatziki, creamy baba ghanoush, and the smoothest hummus, made simply (and sort of amazingly) with just soaked chickpeas, garlic, and lemon—olive oil is only used to drizzle on top. We inhaled the salatit petit, a Syrian potato and egg salad, and the kisir bulgur salad, a Turkish grain bowl tossed in a spicy, pickle-y sauce. We tore apart the lahme meshwi, hunks of lamb tenderized in vinegar then spiced with ginger, cumin, cinnamon, and black pepper before grilled until juicy. I completely forgot my initial desire. I just wanted whatever Vian Alnidawi was cooking that day.For the last three years, Comal Heritage Food Incubator has been teaching women who came to Denver as immigrants and refugees from Mexico, El Salvador, Syria, Iraq, and Ethiopia—women like Alnidawi—how to work in the restaurant industry. The program, taught by chef Arden Lewis, a former catering chef from Brooklyn, tackles everything from the physical work of performing all the kitchen jobs in the brigade system to the business side of ordering ingredients and budgeting. On this particular day, Lewis helped Alnidawi figure out how to scale the recipes she grew up with in Iraq and others she picked up along the way during her time as a refugee in Syria and Turkey. Those tweaks meant the creaminess of her hummus and the tenderness of her lamb kebabs were as on point as when she makes them at home. It’s good food for a good cause, but all I’m thinking now, back at my desk in New York City, is that I’ve got a whole new lunch craving.Go there: Comal Heritage Food IncubatorExplore Bon AppétitRestaurantsMiddle EasternHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-08", "author": ["Condé Nast", "Elyse Inamine"]}