{"id": "f3cf92592f26901da9c52abb593c9e72", "url": "https://www.bonappetit.com/recipe/amaro-cocktail", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Amaro Cocktail Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueAmaro CocktailBy Joseph StinchcombDecember 1, 20204.0(31)Read ReviewsTriangleEmailPinterestPrintPhotographs by Yudi Ela, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintTraditionally, orgeat is almond syrup, but Joseph Stinchcomb, beverage director at Saint Leo in Oxford, MS, has made it with everything from walnuts to pistachios. “It gives a beautiful toasted nut flavor to a cocktail,” he says. “Here I used pecans because they remind me of the family pecan tree at my grandparents’ house in Fayetteville, GA. Roasted pecans. Warm baking spices. Citrusy, caramelly Amaro Montenegro. A bit of spicy rye whiskey. They all work well together to create a cocktail that feels toasty. That’s what I love in a winter drink.” A second shake with an egg white creates a velvety texture and foamy top.IngredientsMakes 1Orgeat2cups raw pecans2tsp. black peppercorns1½tsp. coriander seeds1tsp. whole allspice2cups sugarCocktail1½oz. Amaro Montenegro½oz. Rittenhouse Rye¾oz. fresh lemon juice1large egg white*Pecan half (for serving)PreparationOrgeatStep 1Toast pecans, peppercorns, coriander seeds, and allspice in a small saucepan over medium heat until slightly darkened in color and fragrant, about 5 minutes. Add sugar and 1⅓ cups water and bring to a boil, stirring to dissolve sugar. Let cool and strain through a fine-mesh sieve into a heatproof measuring glass; discard solids.CocktailStep 2Combine amaro, rye, lemon juice, and ¾ oz. orgeat in a shaker filled with ice. Shake until outside of shaker is frosty, about 30 seconds. Double-strain into a glass, then return to shaker. Add egg white, cover, and shake again until frothy, about 1 minute. Pour into a chilled coupe glass and top with a pecan.* Raw egg is not recommended for the elderly, pregnant women, people with weakened immune systems…or people who don’t like raw egg.How would you rate Amaro Cocktail?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangledon't throw out the solid when making the orgeat! take out the spices and roast the sugar spice flavored nuts in the oven until caramelized! MCBCT8/22/2021Could you please tell us where you bought that cup from? Thanks!Rucha Moharir6/22/2021Such a great cocktail... for left over orgeat cooked down and used in a creme caramel spiked with a bit of amaro... easy way to relive the cocktail and use up egg yolks!JcSydney1/1/2021Roy, it says 3/4 oz. orgeat.Crazy Jerry Ireland 12/31/2020I see that the orgeat syrup is left out of the recipe.  What is the proportion to use??RoyCornelius, NC12/30/2020I love love love this winter cocktail!Amy CarderDenver12/27/2020Great recipe, definitely a keeper! I don’t have Montenegro, so I split the amari 50/50 with Braulio and Ramazzoti and it worked beautifully. I’ve made similar takes on a sour with a rye base, alchermes as a modifier and oleo saccharum for a sweetener, but reversing the base is a nice touch. \nThe commenter suggested replacing amaro with amaretto made me vomit in my mouth, shame on you! algomalo 12/25/2020I apologize in advance for taking such liberties with this cocktail recipe.  Here is what I did and the result was really nice.  Subbed Amaretto for Amaro (I know that they are not the same thing but I am always looking for ways to use up that bottle of Amaretto in the back of the liquor cabinet) and changed it to a 1:1 rye to Amaretto (1oz to1oz heavy on the rye).  The rest of the cocktail used same  lemon juice and orjeat syrup amounts, with addition of the egg white.  Worth a try.Lizzie TDuluth, MN12/20/2020Delicious, but I halved the lemon as I like drinks a little bitter.dcVancouver, BC12/13/2020A delicious and well-balanced cocktail!  Made once with the Rittenhouse, then again with a smoky peaty scotch for more of a \"fireside\" feel.  It went over well both ways.  \nMake the Pecan Orgeat from scratch  (with the addition of a touch of orange blossom water and vodka for a preservative) and was surprised at how tasty it was.   Now I can't wait to find more recipes to use it in!Spatula City 123Los Angeles, CA12/7/2020Good drink. Much easier to purchase orgeat than make your own. Justin MWashington DC12/7/2020Explore Bon AppétitCocktailDrinks AllPecanNutAmaroAlcohol & Other DrinksRye WhiskeyWhiskeyEasyDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Joseph Stinchcomb"]}