{"id": "f3d1c80cb0263594aadf4903d4ff448b", "url": "https://www.bonappetit.com/story/five-two-bamboo-cutting-board", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "This Bamboo Cutting Board Has Made My Cooking Life So Much Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Cutting Board Has Made My Cooking Life So Much BetterThe Five Two Bamboo Cutting Board is large, lightweight, and perfect for FaceTiming.By Emma WartzmanMay 18, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Several years ago, I threw out all of my old, warped, mostly plastic cutting boards to make way for a big Boos block—the king of all cutting boards, from what I had heard. I was on the up and up! Then I actually started using it. Turns out it was an arm workout just bringing that thing out, and I found myself reaching for it less and less.Just when I lost hope in finding the right cutting board for me, I stumbled upon the Five Two Bamboo Cutting Board. It’s the perfect size—large enough for cutting big pieces of meat or chopping two things at once, fitting diced onions on one side and minced garlic on the other. But it’s not so huge that it’s a pain to handle. The board is relatively lightweight—only five pounds—and therefore easy to move around and clean. Plus, the edges are slightly tapered, so you can get a good grip underneath to pick it up, a thing I never knew my boards were missing until now.But that's just the tip of the iceberg when it comes to this cutting board’s versatility. One side is entirely flat and smooth for all your chopping needs, save for a carved-out slot on the far right corner meant to prop up your iPhone. I honestly never thought I would use it, but now I can’t imagine cooking without it. When I’m watching The Good Fight on my laptop—my show of choice at the moment—I can slip my phone into the slot and pull the recipe without missing a beat. I can FaceTime my mom as I prep my ingredients, without forcing her to look at the kitchen ceiling instead of my adorable face (I unfortunately still have to watch her ceiling).The other side of the cutting board has a deep moat around its entire perimeter to catch any juices if you’re, say, carving a chicken, cutting watermelon, or slicing rounds of citrus. There’s even a little spout at one corner to pour said juices off.It’s also pretty, which means I’ve used it to serve appetizers and have even set it out with sliced-up steak in the middle of the dinner table. I still love my Boos for holding bottles of oil and vinegar on the counter or scenarios where I can wipe down a mess easily like slicing bread. But these days, I find myself pulling out my Five Two board day in and day out.Five Two Bamboo Cutting Board$59 $41 at NordstromExplore Bon AppétitShoppingRead MorecultureIf Your Oven Is the WORST, Consider This Precise Multifunctional Countertop MiracleBy Yossy ArefiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-18", "author": ["Condé Nast", "Emma Wartzman"]}