{"id": "f3dba6107cf3730f6583df319d55ca3a", "url": "https://www.bonappetit.com/recipe/scratchy-throat-soother", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Homemade Cough Syrup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueScratchy Throat SootherBy Felicia Cocotzin RuizJanuary 12, 20214.8(11)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura MurrayEmailPinterestPrintEmailPinterestPrintThe medicinal properties of onions have been employed around the world for countless generations—they’re warming, rich in phytonutrients, and help get phlegm moving. Felicia Cocotzin Ruiz, a folk healer who educates on using food as medicine through her brand Kitchen Curandera, pairs alliums with ginger and honey for a soothing, savory-sweet syrup. “This has the same soothing feeling as chicken soup,\" she says, though she adds that “people dealing with a bad cough should go see a healthcare provider.” Cocotzin Ruiz makes this cough syrup with small, sweet I’itoi onions, which grow in the Sonoran Desert where she lives, but shallots can be substituted without compromise.Ingredientsmakes about ½ cup1small bunch I’itoi onions, white parts only, or 2 large or 3 medium shallots, coarsely chopped12\" piece ginger, peeled, sliced ¼\" thick¾cup runny honeyPreparationStep 1Place onions and ginger in a small saucepan (1–2 qt. works well) so they cover bottom. Pour honey over to submerge. Bring to a boil over medium-high, then immediately reduce heat to low. Simmer gently, running a heatproof rubber spatula across the bottom from time to time, 30 minutes (this will give the onions and ginger time to infuse the honey). Let cool slightly.Step 2Strain honey through a fine-mesh sieve into a small heatproof jar. Let cool and cover. Save onions and ginger separately to eat, if you’d like.Step 3To use, mix 1 Tbsp. throat soother into tea or hot water, or eat directly off the spoon. (Use 1 tsp. for children.)Step 4Do ahead: Throat soother can be made 1 month ahead. Keep at room temperature.How would you rate Scratchy Throat Soother?Leave a ReviewTell us what you thinkReviews (6)Back to TopTrianglesip-on-this\npotent:soothing:powerfulDawn AugustaPhoenix, AZ1/31/2021Thank you for this simple recipe. It was a nice warm treat. LKLPhoenix, AZ1/30/2021Great simple recipe. Very easy and I had all the ingredients at home. With the cooler temps it was a nice warm treat. I'll definitely make this again. Thank you for sharing.LynziePhoenix, AZ1/30/2021Who knew onions could be used this way? Cheers to staying healthy using nature’s bounty.SunshineScottsdale, AZ1/25/2021This is a perfect recipe for winter flu and cold season. Thanks so much for sharing it. I’m saving it for when I really need it Linda in Albuquerque Albuquerque NM1/25/2021Wouldn't you know, I was scrolling the new bon appetit recipes and happened to come across this with a sore throat. Delicious on it's own by the spoonful, and nice stirred into tea as well (I did yerba mate). For having onions in it it's really quite pleasant. Can't say it's a magical cure but it does feel soothing, as advertised. CJSan Diego1/14/2021Explore Bon AppétitHot DrinkDrinks AllOnionVegetableGingerHerbs & SpicesWinterEasyDrinksVegetarianNut-FreeDairy-FreeGluten-FreeNonalcoholicHealthyishSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Felicia Cocotzin Ruiz"]}