{"id": "f3dda5186b295328d9d8e109eb0aa998", "url": "https://www.bonappetit.com/story/brothy-butter-beans", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Brothy Butter Bean Recipe from Marlow and Sons | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf Loving Beans Is a Crime, I’m Officially ScrewedSeveral months ago, Carla Lalli Music ate a bowl of magic brothy butter beans. Now she has the recipe, and she's ready to evangelize.By Carla Lalli MusicOctober 16, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailSeveral months ago, I ate a bowl of magic beans, and my life has been forever improved.I was having dinner with my family at Brooklyn’s Marlow & Sons restaurant, not long after my younger son, the picky one, had decided for no reason that he was now a vegetarian. “You know,” I told him, “I totally support this impulsive decision, but if you’re going to eliminate animal protein, you’re going to have to open up to other protein sources, so we’re ordering the beans.”Shortly thereafter, the beans were delivered to the table: big creamy white butter beans in a shallow wide bowl, with enough broth to merit eating them with a spoon but not so much liquid that they felt like soup. There were rusty-colored breadcrumbs scattered about, and a dollop of aioli tucked over to one side. I took one look and immediately asked our server to add a second bowl of beans to our order.Picky vegetarian dipped his spoon into the broth, licked it, nodded approvingly. He ate one bean. I tried not to pay much attention, but I was analyzing every click of his jaw. He uttered an approving “Hmmm!”“You like those?” I asked, super nonchalant.“Pretty good,” he replied.“Oh, that’s cool. Well, enjoy—we got a second order, so those are all yours.”Then he ate the entire bowl, which I tried not to notice but actually I was elbowing my husband in the arm and kicking my other child under the table and trying not to fall off my stool the entire time he was eating. The second order of beans arrived, and then I had a legume experience that most vegetarians only dream about. Supreme bean cookery: Silky insides; intact skins. Sweet, earthy flavor. Plenty of salt. Rich, long-cooked aromas in the broth, and little bits of crunchy crumbs to break up the texture. When stirred, the garlicky aioli dispersed into the broth and slid over the beans, like a last, fine layer of comfort over the whole bowl. It was honestly pretty annoying that the kid got a whole bowl to himself and the rest of us had to split it three ways.The next day, I emailed Marlow’s chef, Patch Troffer, and begged for the recipe. I’ve made a lot of beans in my life, I told him, but these beans… there weren’t words. What were his secrets? How did he get them that texture? What the f*ck was in that broth?Luckily for all of us, Patch wrote back, and now, with practice and allegiance to his instructions, we can all make The Beans. Step one, of course, is to buy a good bean. Patch uses a butter bean from Iacopi Farms in Half Moon Bay, California, that you can only get at specific farmers markets in Northern California, which crushed me to learn. If you’re an ordinary human, buy the best butter bean, corona, or baby lima you can find (I like Rancho Gordo and Zürsun, which you can order online, or buy dried beans at your local farmers market.) If you do everything else Patch says, you’re going to make a great pot of beans.Here’s his email, with a few comments from me along the way. My advice: Do what the man says. The next time you’re in Brooklyn, head over to Marlow & Sons and bask in the ideal bean (get the oysters, too).Hi Carla,Hope this note finds you well.I’m glad to hear you enjoyed the beans and were curious about what's in them. They're truly quite simple, and I have to give most of their credit to a perfect dried bean. I've been buying from Iacopi Farms in Half Moon Bay, CA for a long time now; Chez Panisse bought from them a lot, and their alum in turn continued to use their beans. I was thusly introduced to them. We've got a guy who ships the butterbeans to us weekly. I am unaware of anywhere here that sells them. They're truly perfect beans and worth the hunt.I do a normal soak, just water, overnight in the walk-in. I bring to a boil, skim the scum, and I add salt. I like to add salt throughout the cooking process. I don't wait. Then lower to a simmer.Carla’s Note: At home, put the beans in a big bowl, cover them with water and refrigerate them overnight, then transfer them to a big pot for cooking.I confit a bunch of garlic and throw it all in with the confit oil. I like to have an inch or so fat cap on the top to keep the beans submerged. I'll add more salt here.Carla’s Note: Don’t gloss over that part. “An inch or so” of fat should be sitting on the surface of your bean liquid. If you don’t have confit garlic, add whole peeled garlic cloves and lots of good olive oil. I keep random rendered fats in jars in my fridge, because I’m weird like that, and believe you could use schmaltz or ham fat if you wanted to make these not vegetarian.I sometimes add an overripe tomato in the summer. I like savory with beans; I like mint with beans; oregano too. Salt. If I add herbs I do it repeatedly, so there are long-cooked herbs and freshly dropped herbs at the end. Salt.Carla’s Note: The salt seems important, dig?I like burnt lemon halves, salt.Carla’s Note: No, I don’t generally have burned lemon halves on hand, either. If you want to emulate this, heat up a dry small skillet over medium-high heat, and cook two lemon halves, cut side down, until the surface is charred, 3–4 minutes, then add to the pot.Sometimes I'll add a spice. The recent week you had them, I believe I was using coriander seed (along with mostly oregano, some mint; burnt lemons). Salt!Carla’s Note: He is not playing around with the salt, people.I cook the beans not even at a simmer and stir obsessively, gently. They'll be under-cooked and under-flavored for what seems like forever, until they're suddenly perfect.Add more herb here, and final round of salt. A good glug of good vinegar too. I've been using sherry.To serve, I am a firm believer of garlicky lemony loose aioli to stir in, and breadcrumbs too. Or at the very least some really great olive oil.I'm not sure any of these are necessarily secrets, or none that you likely already know—I really think the magic is in the bean. But I hope that this was still somehow helpful?Carla’s Note: The Magic is in the Bean would be a great title for Patch’s memoir, don’t you think?Feel free to ask any further questions you may have!Best,PatchExplore Bon AppétitWhite BeanVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Carla Lalli Music"]}