{"id": "f3e04cdb36b3965add7079bafa794de0", "url": "https://www.bonappetit.com/story/wellness-influencers-indian-food", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "How Indian Food Became a Trend Thanks to Wellness Influencers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Wellness Influencers Made Indian Food a TrendThe West's perception of Indian food has swung from gut-busting takeout to detox darling. But how did we get here?By  Khushbu ShahNovember 29, 2018FacebookTwitterEmailPhoto by Bryan FountainFacebookTwitterEmailIndia is home to 1.3 billion people, and lately, it seems, 1.3 billion wellness trends. In the past year and a half, even people disinterested in health crazes are unable to avoid the golden tsunami of turmeric drinks, the proliferation of ghee and coconut oil in grocery stores, and headlines about how khichdi is the magically detoxing concoction you need right now. Everyone can spell ashwagandha, and Ayurveda, India’s thousands-of-years-old holistic healing system, is now an Instagram hashtag with over a million posts (many of them featuring white women). To put it simply, Indian food has become the darling of the health world.It’s a radical shift from Indian food’s long-standing reputation in the West of being the spicy, cream-laden, junky takeout that would stain your nails, make your clothes smell, and give you inevitable stomach issues. So how did the perception of Indian food swing from diarrhea to detox?Basu Ratnam in Inday, the fast-casual mini-chain he founded in NYC.\nPhoto by Chelsie Craig“Gwyneth Paltrow,” says Basu Ratnam with a laugh when I posed this question. Ratnam is the owner of Inday, a restaurant with multiple locations in New York City that melds his passion for health with his Indian upbringing. While Paltrow—who was an avid yoga enthusiast before she became the Goop queen—can’t take full credit for the rise of turmeric tonics and khichdi cleanses, Ratnam is correct to point to a certain, ahem, limber set of people as the catalysts of change.“The same philosophy that gave us yoga also talked about mindfulness, meditation, and Ayurvedic eating,” he says. “I think the interest in it is a natural evolution.”Yoga, which originated in India, became a phenomenon in the West more than a decade ago. The practice is deeply connected to meditation, which has made its way into our everyday lives via mobile apps, airline entertainment, and seemingly every TED talk about how to be a successful entrepreneur. Hygiene routines like oil pulling, using a tongue scraper, and dry brushing were touted by (mostly white) wellness influencers, and retailers like CAP Beauty and Goop started capitalizing on the trend.When health is a multitrillion-dollar industry, turmeric becomes much more than a sickness remedy.Sana Javeri Kadri, the founder of spice company Diaspora Co., sees the rise of Ayurveda, a term that wouldn’t so easily roll off tongues in the West just a few years ago, as connected to the popularity of yoga. “I think people who have access to seeing Indian food through the lens of Ayurveda are people who are into yoga, or some form of appropriated Indian culture,” she says.True Ayurveda is a labyrinthine set of rules and guidelines, but there are aspects that are extremely approachable, like not eating late at night, avoiding combinations of certain foods, or using spices such as turmeric to treat ailments. These principles are so woven into the fabric of everyday routines in South Asian culture, both on the subcontinent and in the diaspora, that many don’t realize they are actively participating in it. “I always thought I was someone who grew up without Ayurveda,” says Kadri. “But it was more that it was so a part of our daily lives that we never considered it a health thing.”But when health is a multitrillion-dollar industry, turmeric becomes much more than a sickness remedy. It’s in skin care and on clothes, in chocolate, eggs, drink mixes, and snacks, and, seeing this success, the industry has begun to fetishize other common Ayurvedic ingredients. Ghee, coconut oil, ashwagandha, and moringa have all ridden in on turmeric’s gold coattails. It’s only helped that today’s fad diets like paleo, keto, and Whole30 demonize dairy and gluten, which are easily avoided in Indian cooking, and valorize fats like ghee and coconut.We’re more skeptical than ever before about Western medicine, and so we look to other resources and cultures for the remedies we need.The West also has a new obsession with “plant-based” eating, essentially a term for veganism but without the militant connotation, which has buttressed this interest in Indian food and Ayurveda, says Vandana Sheth, a registered dietitian and a spokesperson for the Academy of Nutrition and Dietetics. While neither Indian cuisine nor Ayurveda are completely meatless approaches to eating, it’s extremely simple to find vegetarian and non-dairy options that are “flavorful and healthy,” adds Sheth.One thing that all these diets, Ayurveda, and the wellness movement as a whole have in common is that they all understand food to be medicine. We’re more skeptical than ever before about Western medicine—our ability to access it and its ability to heal us—and so we look to other resources and cultures for the remedies we need. Traditional Chinese medicine, which has long had a foothold in the Western world via techniques like acupuncture and massage, has seen its popularity expand along with the wellness trend.But, as Kadri points out, Ayurveda is perhaps less intimidating to Westerners because it centers around more recognizable foods, while navigating the complex series of herbs and supplements that make up the framework of Chinese medicine is more challenging. “Most Ayurveda websites are also in English,” she adds.Some Indians in America, like Ratnam, are excited to see the West embrace Indian traditions. “I think it is validating,” he says. He was once told that opening an Indian restaurant, especially a healthy one, was a terrible idea. “I think it means that there is some integrity to the belief, and I think that it is really exciting.  There’s a consensus that these Indian philosophies are good.” Others, like Nik Sharma, author of the cookbook Season, are more cautious. “It’s important that Indian food and culture doesn’t get pigeonholed into wellness,” he says. “There is so much more to it, but learning about Indian food from wellness is such a niche perspective.”Kadri agrees that she may have never started her company, which currently sells turmeric sourced directly from one farm in India, had it not been for the golden latte trend. While most of her customers are home cooks, she also sells to wellness brands like Golde, the turmeric latte blend that Paltrow drinks. But she’s more ambivalent than Ratnam. She struggles with people like Amanda Chantal Bacon, the controversial and oft-profiled white founder of L.A.-based Moon Juice, a smoothie shop that has spun out into an empire of products using ingredients popular in both Chinese medicine and Ayurveda.A khichdi from chef Divya Alter of Divya's Kitchen in NYC.\nPhoto by Alex Lau, Styling by Sue LiTopics of ownership and appropriation are unavoidable when talking about the wellness world’s fondness for Indian food and practices. “Ayurveda has become so deeply co-opted,” says Kadri. She finds the conversation around khichdi, a rice-and-lentil based dish popular across India, particularly taxing. Over the past year or so, several publications have run articles by slender white women proselytizing the “kitchari cleanses” they have embarked on—frequently misspelling the dish (no one from India would ever pronounce it “kitchari”), offering up recipes that no Indian would consider to be khichdi, and, most importantly, failing to acknowledge the dish’s Indian origins.It’s not that Kadri isn’t happy to see people from around the world eating khichdi. “I think that everybody should eat khichdi if it makes them feel better,” says Kadri. “I just have a huge issue with someone taking credit for a khichdi recipe.” It’s a frustration many South Asians have felt as these ingredients have been usurped by the West. In many ways, it’s food colonization.The cherry-picking of Ayurvedic tenants is worrying to Kadri. “This is just normal food for a lot of people, so suddenly wrapping it up as a superfood with magical properties is just gimmicky,” she says. Ratnam is also concerned about what this selectiveness means from a health perspective. “People in America are always looking for quick-fix solutions, and I think this is contrary to what the true philosophy of Ayurveda is about,” he says. To him, Ayurveda means creating balance and intention. Plates of ghee-roasted meat with tall glasses of “golden milk” for every meal isn’t that.Sheth also warns against viewing Indian wellness trends as miracle fixes. “When it comes to fat, I encourage my clients to still be mindful of portions,” she says. And on the subject of khichdi, Sheth says there’s nothing detoxing about it. “It can be a healthy meal as it provides carbs, protein, and some fat, but our body has wonderful organs that are designed to help with getting rid of toxins,” she says.But Ratnam continues to be optimistic about the role of Indian food stateside. “America is definitely getting browner, and I think people are embracing spicier food more,” he says. He just hopes that Indians can own and lead this moment in the health space. After all, he says, “India was 5,000 years early to the wellness movement.”Explore Bon AppétitIndianHealthyishTrendsRead MoreLifestyleI Grew Up Eating This Common Indian Vegetable. Now It's a Wellness 'Superfood.'By Nikhita VenugopalRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-29", "author": ["Condé Nast", "Khushbu Shah"]}