{"id": "f3e2f8618f32346a8395aab2a8c1e310", "url": "https://www.bonappetit.com/recipe/sweet-and-spicy-slaw", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Sweet-and-Spicy Coleslaw Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueSweet-and-Spicy SlawBy Bryan FurmanMay 22, 20185.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintAn oil-and-vinegar dressing keeps this slaw from feeling heavy and greasy, and the spiciness is a good counterpart to sweet notes in barbecue sauces and glazes. This recipe is from B’s Cracklin’ BBQ in Savannah, GA.Ingredients8 servings½cup apple cider vinegar6Tbsp. peach nectar or juice¼cup extra-virgin olive oil2Tbsp. vinegar-based hot sauce½tsp. crushed red pepper flakes½tsp. garlic powder½tsp. kosher salt¼tsp. cayenne pepper⅛tsp. freshly ground black pepper1large head of cabbage, thinly slicedPreparationStep 1Whisk vinegar, peach nectar, oil, hot sauce, red pepper flakes, garlic powder, salt, cayenne, and black pepper in a large bowl to combine. Add cabbage and toss until completely coated in dressing. Cover and chill 30 minutes to allow cabbage to soften and flavors to meld together.Step 2Do Ahead: Dressing can be made 1 day ahead. Cover and chill.How would you rate Sweet-and-Spicy Slaw?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis is my go to coleslaw recipe. Balanced, understated, and a great use of the juice leftover from cutting peaches for dessert.AnonymousLas Vegas, NV6/12/2021Not a review, rather a question - is there a way that we can save or bookmark the recipe?AnonymousSan Francisco7/22/2020Explore Bon AppétitSlawSaladSouthernAmericanGreen CabbageCabbageLeafy GreensVegetableEasySideDairy-FreeGluten-FreeNut-FreeVeganVegetarianRawJuneteenthLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Bryan Furman"]}