{"id": "f3f5f2951d6d3dee004fb72d75b5f6d6", "url": "https://www.bonappetit.com/story/masters-club-dinner-menu-2019", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "The Masters Club Dinner 2019 Was Not Built for the Lactose Intolerant  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Really Hope There Are No Lactose Intolerant People at The Masters Club DinnerThis year’s menu curator, 2018 champion Patrick Reed, doesn’t care if you can’t eat dairy.By Emily SchultzApril 9, 2019FacebookTwitterEmailPhoto by Aladdin Color Inc./Getty ImagesFacebookTwitterEmailWelcome to Food on the Internet! A column from Rachel Karten and Emily Schultz, BA’s social media team, dedicated to all the weird things we see while scrolling, double-tapping, and retweeting.There are a lot of things you’ll learn about editor in chief Adam Rapoport from spending five minutes with him. He’s very particular about his vodka soda, he* will *critique your scrambled eggs, and he’s obsessed with golf. Whether Adam is swinging a club through our office (and yes he did almost break a glass door today, thanks for checking in) or gabbing about Jack Nicklaus like they go waaaaay back, he’s basically always trying to insert golf into this food magazine. Well today is his lucky day, because the Masters Club Dinner menu was announced. For the uninitiated (uninterested?), the dinner kicks off the first tournament of the year, and officially jump-starts golf season. All living winners of The Masters are invited to the event (”It’s kind of like the Supreme Court—once you’re in, you’re in; but instead of black robes, it’s green blazers,” Adam says), and the previous year’s tournament winner gets to curate the menu. Last year, 28-year-old Texas native Patrick Reed (“a very controversial player,” Adam notes) got the honor, and with his dinner, decided to take vengeance on the league’s lactose intolerant. These are Adam’s reflections on this dairy-filled dinner.Instagram contentThis content can also be viewed on the site it originates from.The Salad Course: Can you call it a salad course when both options are doused in rich, creamy dressing? One option is a classic caesar: romaine, croutons, Parmesan cheese, and a traditional caesar dressing. Okay!? The other option is a wedge salad, with iceberg, red and green onions, tomatoes, bacon, and a buttermilk vinaigrette. Based on the rest of the menu it’s safe to assume there will be a hefty pour of vinaigrette.The Centerpiece: Or as I’ll call it, “The Texan Powermove.” Of course it’s a ribeye, and of course it’s a cowboy ribeye, which just means there’s a huge, tough bone that runs down the entire piece of juicy meat thrown on an XL plate. It’s slathered with herb butter, so that’s the second course with lots of lactose in it—in case you’re keeping score. For the people who want lighter fare, may Patrick suggest the mountain trout? A lot of golf players are fly fishers in their downtime; maybe Patrick has a sweet side to him after all? I predict Mark O’Meara and Fred Couples will go with this heart-healthy option.The Sides: So sorry for vegans and the dairy sensitive, but I can no longer save you. Here’s what The Masters Dinner can offer you instead: Macaroni and Cheese with white cheddar and smoked gouda. (What are the chances that elbow macaroni is the noodle of choice here?) Creamed spinach with smoked garlic, artichoke hearts, and sweet cream. Corn crème brûlée with turbinado sugar on top. (I’m baffled that this is not a dessert.) And finally, steamed broccoli. Oh sweet relief! A healthyish vegetable! I’ll go with that one, please. Oh wait, the fine print: It’s covered in sea salt and shaved Parmesan.The face of a man who absolutely loves dairy.\nPhoto by Andrew Redington/Getty ImagesThe Dessert: You’re drowning and I get that. Good luck. Here are your choices. 1) Tiramisu, which has mascarpone and whipped cream. 2) Vanilla bean crème brûlée. Does this man just enjoy a blow torch? Or does he just like inflicting pain on those who cannot consume dairy products? 3) Chocolate crunch and praline cheesecake. Maybe that praline is an ode to his home state of Texas, which would be cool. But couldn’t you have gone with a pecan pie or a chocolate praline cookie? Did it have to be a cheesecake?The Wine: 2016 Chateau Montelena, Napa Valley, Chardonnay. The least shocking thing on this menu? A California Chardonnay. There’s also a 2013 Caymus Vineyards, 41st Anniversary, Napa Valley, Cabernet Sauvignon. Are you even at The Masters if there’s no cab sauv?Not Offered: Why are there no potatoes on this menu? Although if you think about it, they would probably be scalloped or in the form of a cheesy gratin.As much as I love creamy things, I also love balance. I would absolutely be out of commission for the next two days.For the par-3 tournament, don’t bet on Patrick Reed. Or at least slip a few Lactaids in his pocket.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-09", "author": ["Condé Nast", "Emily Schultz"]}