{"id": "f3ff6205b0e6aeaf1447b14623becefe", "url": "https://www.bonappetit.com/story/sarah-thomas-drawbaugh", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Sarah Thomas-Drawbaugh on Starting a Certified Organic Business and the Hike That Clears Her Head | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleSarah Thomas-Drawbaugh on Launching an Organic Baking Business and the Breakfast That Fuels Her DayHer organic baking company, Healthyish Foods, tackles single serving desserts and has a name we can get behind.By Aliza AbarbanelOctober 11, 2018FacebookTwitterEmailFacebookTwitterEmailIn Entrepreneurs Run the World, we get advice and insight from game-changing entrepreneurs with big ideas. This week we talked to Sarah Thomas-Drawbaugh, founder of Healthyish Foods, an organic baking kit company that clearly shares our perspective on how to eat right.There’s no such thing as too much dessert—at least on paper. In practice, however, my stomach would disagree. As someone who loves to bake and is admittedly terrible at self-control, I’m all too familiar with the pangs of brownie batter-induced stomach aches. It’s a sensation Sarah Thomas-Drawbaugh hopes to eliminate with her organic baking kit company Healthyish Foods.While most baking kits rely on artificial food dyes and preservatives, Healthyish Foods creates all the classic flavors using whole-food ingredients like beet powder, turmeric, and essential oils. Plus the single-serving baking cups you bake these treats in are unbleached and biodegradable. Thomas-Drawbaugh's goal is to offer an accessible, thoughtful baking kit that makes you feel as good as it tastes, and reduces food waste in the process.We talked with Thomas-Drawbaugh about the challenges of creating a certified-organic business, the notepad that keeps her on track, and the pre-hike breakfast that fuels her.What’s your approach to baking?I love dessert but it’s really hard to make a cake or tray of brownies for just one or two people. You always have a huge copious amounts of leftovers that you overindulge in and feel terrible about or food waste, which is a huge issue. I thought, ‘there’s got to be a better way of doing this!’ I started by thinking about what would be an ideal product to have in my own household: single servings, high quality ingredients, organic. I wanted to create a company that gets people to think differently about desserts in general.What was the journey like starting an all-organic business? I’m sure there’s a lot of paperwork to contend with.I feel like every day is surprising and there’s always something you’re not anticipating. There are a lot of regulations and policy that go into running an organic business!  You have to establish a number of programs that meet strict criteria from a traceability, quality, and auditing perspective, plus things like pest management. You have to have a lot of process in place, and, like anything, it just takes time to identify what’s going to work best for your business. It has been a journey, and I have a whole new respect for the organics process!What has been your biggest, most unexpected challenge since starting the business?Definitely educating people on what you’re doing and why it’s important. I think it’s hard to grab people’s attention in a world where we’re constantly inundated with media. It’s hard to stand out from the crowd, which is one of the things that was so important to me.Do you have any habits that keep you grounded and on track?I’m huge on accountability and one of the things I do to hold myself accountable and make sure I’m on track is document everything. I take lots of notes and keep a list of my needs so I’m on top of everything—if I tell someone I’m going to do it, I write a note to myself and make sure I do it. I use my Erin Condren notepad, I feel like in such a digital world it’s nice to have a physical touch. Their products are so fun—they have inspirational quotes which I appreciate.Can you share any memorable advice you’ve received as an entrepreneur?For me, one of the biggest keys has been finding mentors because I didn’t have a background in this space. I’m not an expert in every aspect of this business, and every day I’m figuring things out. I’m actually part of a female founders food forum in Boulder, and having that support makes all the difference in the world—even having someone to chat with about things that aren’t just food related. I feel like that’s what \"healthyish\" is all about, not forcing yourself to be perfect all the time, just doing the best that you can and knowing that’s okay.If you could pick one person's brain about Healthyish Foods over lunch, who would that be?I would have to say Jaclyn Johnson. She is the founder of Create and Cultivate and I really enjoy her new podcast WorkParty. I’d love to hear her perspective on building brand recognition when you’re still in startup mode, and to discuss strategies for capturing and maintaining loyal customers.What are the three things you always have stashed in your fridge or pantry?I love veggies, and I incorporate them into every meal of my day. Whether they’re grilled, sauteed or roasted, I always try to keep it colorful. And this might be cliche, but I always have my Healthyish baking kits handy, and probably coffee. It’s my kryptonite. I take it with a little bit of sugar and a little bit of milk, piping hot, and just a regular cup of Folgers, nothing fancy. That’s my go-to every morning.What constitutes a perfect day off for you?I’ve always been an early riser, so I like to get up, go outside, walk my dog a little bit, and make a really big breakfast. I’m a carb lover so I load up on pancakes or French toast and go on a really long hike. I live in Vail, and I love how scenic it is. I love to do a hike called Berry Picker, which is probably one of the most challenging hikes, but you feel the most accomplished when you do it. It starts at the base of Lions Head and you literally climb up Vail mountain. There’s a little restaurant at the top and you can get lunch, some wine, and ride the gondola down for free.How do you get a moment of clarity on a super stressful day?When you’re really stressed out it’s nice to go outside, get some fresh air and hit the reset button. I’m a huge advocate of taking five—there are times when I feel like I’m down the rabbit hole and being pulled in 100 directions and it’s so helpful to take five minutes for breathing exercises, a glass of water, or a walk. When you step away for a few moments, you can think things through with a more logical and rational approach.Explore Bon AppétitEntrepreneurs Run the WorldHealthyishBakeRead MoreLifestyleHow Moving to Jamaica Helped This Entrepreneur Launch Her Travel BrandBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-11", "author": ["Condé Nast", "Aliza Abarbanel"]}