{"id": "f41deb565217139339725cc47e7009e4", "url": "https://www.bonappetit.com/story/fridge-white-board", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "A Fridge Whiteboard Will Help You Cut Down on Personal Food Waste | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTo Cut Back on Food Waste, Stick a Whiteboard on Your FridgeThe fate of your sugar snap peas depends on it.By Aliza AbarbanelMay 27, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.There are many good ways to preserve precious herbs—bundle them in damp paper towels! stash ‘em in a fancy herb keeper! make a dressing that uses all of your bunches at once!—but for me, the most important part is remembering that they exist at all. So, armed with a magnetic whiteboard and a few Expo markers, I write an inventory on the fridge door.I’ve had a whiteboard on my fridge for years, but most of its real estate was devoted to reminders to water the plants or buy more toilet paper. Then the pandemic hit, and my shopping and cooking went into hyperspeed. You probably know what happened next: I was making fewer trips, filling my grocery cart higher than ever, and creating more leftovers. Even the best-laid dinner plans were forgotten in the chaos of 2020. I’ve never been a big meal planner, but I did need a system to ensure that chard wouldn’t disappear into the back of my fridge for weeks. One year later, it’s become an essential part of my low-waste cooking routine.Here’s how it works: As soon as I get home from the store, I write a produce list on the corner of my small magnetic fridge whiteboard. I try to order it by priority level: Delicate items like herbs and tomatoes go at the top so they're right at eye level, sturdier potatoes and cabbage go at the bottom. I’ve even developed an admittedly loose annotation system of asterisks and exclamation points to mark when I have a lot of something to use up.Once I’ve mapped out every potential ingredient in my lineup, I write up a loose meal plan for the week. After all, the best defense is a good offense. I start with any recipes I had in mind when I went to the store, then brainstorm meals to make the most of everything left over. If I have an abundance of tender greens that are here for a good time, not a long time (looking at you, basil and Little Gem lettuce), I literally write them into as many meals as I can. This technique is great for fruits and veggies, but I also use it to track leftovers and proteins, noting if they need to be thawed from the freezer or otherwise prepped. Once the list is as extensive as possible, I rewrite the order to prioritize the meals starring ingredients that have to be used first. Then the cooking begins. As the contents of my fridge slowly deplete, I employ the true magic of a whiteboard, wiping mushrooms and cucumbers off the list until I’m back to a blank slate.I know what you’re thinking: Can’t you just open the fridge and see what’s left? Yes, I guess I could. But the glorious approach of spring and summer produce means I won’t be slowing down on buying vegetables anytime soon, and that translates into seriously crowded fridge shelves. Inevitably, I’ll buy too many precious sugar snap peas, and I’m not leaving their fate up to my memory alone.Photo by Isa ZapataMagnetic Fridge Whiteboard$15 at AmazonMore ways to cut back on waste:1 / 14ChevronChevronCilantro ChutneyView RecipeExplore Bon AppétitShoppingGet OrganizedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-27", "author": ["Condé Nast", "Aliza Abarbanel"]}