{"id": "f41d7e1edb3a52a01bae913340c7e8b8", "url": "https://www.bonappetit.com/recipe/charred-cabbage-and-carrots", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Charred Cabbage and Carrots Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueCharred Cabbage and CarrotsBy Ayesha CurryNovember 23, 20214.8(20)Read ReviewsTriangleEmailPinterestPrintPhotograph by Eva Kolenko. Food styling by Susie Theodorou. Set design by Kira Corbin. On set producer: Jennifer Thomas.EmailPinterestPrintEmailPinterestPrintActor and cookbook author Ayesha Curry is on a mission to get cabbage the credit it deserves, starting by braising it in a sweet-tangy-hot mixture of allspice, lime juice, maple syrup, and crushed red pepper flakes.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCitrus Juicer$7 At AmazonDutch Oven$80 At AmazonVegetable Peeler$10 At AmazonTongs$13 At AmazonIngredients8 Servings⅓cup fresh lime juice2Tbsp. pure maple syrup2sprigs thyme, leaves picked1tsp. crushed red pepper flakes2Tbsp. plus ⅓ cup extra-virgin olive oil2Tbsp. Diamond Crystal or 3½ tsp. Morton kosher salt, divided, plus more1medium head of green cabbage (about 3 lb.), outer leaves removed, cored, remaining leaves torn into 3\" pieces2large carrots, peeled, thinly sliced into rounds1shallot, thinly sliced4garlic cloves, thinly sliced6whole allspice¼cup low-sodium vegetable broth4scallions, dark and pale green parts only, sliced on a diagonalPreparationStep 1Whisk lime juice, maple syrup, thyme leaves, red pepper flakes, and 2 Tbsp. oil in a small bowl to combine; season dressing with salt. Set aside.Step 2Heat remaining ⅓ cup oil in a large heavy pot over high. Add half of cabbage, sprinkle in 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, and cook, turning over once, until tender and charred in spots, 8–10 minutes. Transfer to a plate. Repeat with remaining cabbage and salt.Step 3Return cabbage to pot. Add carrots, shallot, garlic, and allspice, then pour in broth. Cover; cook until cabbage and carrots are tender, 6–8 minutes. Remove from heat. Drizzle in reserved dressing and stir to combine. Transfer to a large shallow bowl and top with scallions.How would you rate Charred Cabbage and Carrots?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleSuper good. It's all about the dessing! I didn't know what to serve it with so I eat it with quinoa wich was good. MagQuébec1/31/2022This was really delicious! Definitely a more than the sum of its parts recipe. I didn't have whole allspice, so used ground, and turned out fine.DaniSan Diego, CA1/15/2022Really delicious. Loved tearing the cabbage leaves and eating torn leaves. Then the flavor was really delicious. Had red cabbage so used that. The dressing  could probably be used on other vegetables.  Best easy veg prep in a long time.  Many thanks!LynnNYC1/5/2022delish, comes together easy w/ cheap ingredients and ends up being interesting flavours! loved it. Agree w/ comment below, cut the initial char time to a little shorter. Claire Asheville NC1/4/2022The dressing and flavors were delicious. However, the cooking time is too long for the cabbage, and finishing everything together in a covered pot with vegetable broth made this into a soggy cabbage soup. Next time I'll try charring on the BBQ and roasting the other veggies separetely.AnonymousLos Angeles1/3/2022This was delicious. I kept the cabbage ( I only red a red cabbage) in wedges and we ate it with grilled salmon.AnonymousOakland, CA1/3/2022This was so delicious we couldn’t get enough. The flavor combinations lime juice, syrup and red pepper flakes was amazing!!! I made without the carrots. This is now my go to recipe for cabbage. AnonymousSummerfield NC1/2/2022I prefer eating vegetarian for most meals and love cabbage. I had most of the ingredients and picked up a carrot and some scallions at the store. Several days later I am hungry after work and decide to whip this together. \n\nIt's good! But it was only as I started putting together the dressing (lime juice and maple syrup??) that I was realizing this is an odd recipe. It hit the spot though, has a nice sweet, salty, savory combination, and was fast to make. \n\nEnjoy!KonstantinDurham, NC12/1/2021Explore Bon AppétitCabbageLeafy GreensVegetableCarrotDinnerVegetarianSideVeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Ayesha Curry"]}