{"id": "f4249f71303f0bf67cfbabe2153c6783", "url": "https://www.bonappetit.com/story/tamar-adler-best-drink-in-the-world", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Author Tamar Adler Shares Her ‘Best Drink in the World’ | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAuthor Tamar Adler Shares Her ‘Best Drink in the World’And with a few variations, you can also make the second best drink in the world, and the third...By Tamar AdlerApril 20, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Styling by Molly BazFacebookTwitterEmailIn a round-up of this spring’s best new cookbooks, editor-at-large Christine Muhlke wrote: “Food writing—that is, good writing about food—ain’t what it used to be. Posts and feeds can’t compare to the confident, informed words of M.F.K. Fisher, Elizabeth David, or Patience Gray. They were actively cooking and researching (and living), then weighing each phrase, producing lasting works that no emoji can summarize. Editor and Chez Panisse cook turned author Tamar Adler has set herself in their footsteps, producing books with cooking in them rather than straight-up cookbooks. In her latest book, Something Old, Something New: Classic Recipes Reinvented, she strives to revitalize fusty classics and long-forgotten dishes, bringing them into this century with verve and ease.”Below, read an excerpt from Something Old, Something New and a recipe for a cocktail Adler calls the best in the world. First it requires a month-long creation of fragrant vin d’orange (photographed above), and then a simple mix with mezcal, ice, and Amarena cherries.This is the liqueur I believe is the most delicious in the world.This is still made, as I understand it, in Provence today. I began making mine a decade ago in California, where citrus grows as prolifically as rose hips. It became an annual custom, and each winter I find someone willing to send me a case of bitter Seville oranges, or make do with a combination of regular oranges and regular lemons, and set a batch to rest in a cool place. It is an elixir for the ages.House Vin D’Orange2 bottles dry white wine, like Muscadet or Pinot Grigio1 cup vodka½  to ¾ cup sugar½  to 1 vanilla bean, split lengthwise (this depends on how much you like vanilla)1 cinnamon stick6 Seville oranges, or 4 large navel oranges and 2 lemons, scrubbed and quarteredCombine everything in a big glass jar with an airtight lid. Weigh the fruit down with a bowl or glass that fits snugly inside the jar. Seal, and put somewhere cool and dark, rotating occasionally, for 4 or 5 weeks—you can always taste and decide. Taste and adjust the sugar if you like.Strain the vin d’orange through a fine-mesh sieve or cheesecloth and pour into wine or liqueur bottles or mason jars and refrigerate for up to a year.And here is a recipe for a cocktail my husband has named “The Best Drink in the World.” He chose the name because it is accurate, and because it motivates sharing its method. All one has to do is utter the sentence, “I just had the best drink in the world,” to inspire the question, “What was it?” And so the formula is passed along.Best Drink in the World1 part mezcal3 parts vin d’orange\nIceAmarena cherries or homemade sour cocktail cherriesMix the mezcal and vin d’orange well over ice. Pour over ice into a small tumbler. Top with 2 or 3 Amarena cherries, and a few spoonfuls of their liquid, to taste.The second-best drink in the world is made by substituting scotch for mezcal; the third, by substituting rye. Bourbon can be substituted as well, but that is not the fourth best drink in the world—that is a very dry martini.On what occasion does one drink such a concoction? We drink it in early evening, but Henry Aldrich may be helpful in providing more ideas:If all be true that I do thinkThere are five reasons we should drink;Good wine—a friend—or being dry,Or lest we should be by and by,\nOr any other reason why.The mezcal (or scotch, etc.) can also be replaced, in the same ratio, with Champagne, or another sparkling wine. In this form, it is a good morning drink, especially by the following reasoning, reasoned very long ago by Athenaeus in The Deipnosophists:“If with water you fill up your glasses, You’ll never write anything wiseBut wine is the horse of Parnassus, That carries a bard to the skies.”In my experience, once saddled and mounted, the steed will dutifully deliver a rider to his aim, whether it is poetry, or prose, or some less canonical but equally laudable ambition. That is to say: The wine version of this drink, or any other early-day tipple, is as useful to the street cleaner as the scribbler.The writer Vicomte de Mauduit, who has lent so many opinions and wisdoms to the pages of my book they are scented with his own fiery philosophy, wrote: “Good food, good wines, and good alcohol do not bring about the joie de vivre, they stimulate it, but it must be there first in a genuine natural form.” I agree. If such a natural satisfaction as he demands is hidden at dinner hour, I hope that it wakes from slumber at the sound of ice in a cocktail shaker, or the first fine taps of knife and fork against the plate, or of cool water being poured into a glass. Indeed, it matters not the flavor of the spirit’s summons, only that it arrives. And that eventually, in time, it arises, renewed.Excerpted from Something Old, Something New by Tamar Adler. Copyright © 2018 by Tamar Adler. Reprinted with permission of Scribner, a Division of Simon & Schuster, Inc.Explore Bon AppétitMezcalCookbooksSummer DrinksCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-20", "author": ["Condé Nast", "Tamar Adler"]}