{"id": "f4244ba78f9d0a4dd9b9b9a33dc0554c", "url": "https://www.bonappetit.com/story/jono-pandolfi-ceramics", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Jono Pandolfi Plates Make My Most Tired Lunches Look Exceptional | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Plates Make My Most Tired Lunches Look ExceptionalUnderstated? Yes. Photo shoot–ready? Always. By Chris MoroccoFebruary 10, 2021FacebookTwitterEmailPhoto and styling by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.My neighbors probably think I’m weird. I seem to be the only person on my block who hangs halfway out of their front door (masked, of course) to shoot food photos in natural light. I may never be able to re-create the bright light and distinctive marble surfaces we use when shooting recipe photos in the BA Test Kitchen, but I don’t worry because there’s one thing that makes my photos look amazing, even at home: Jono Pandolfi ceramics.On my only visit to the test kitchen since March, I snagged a couple of Jono Pandolfi’s Alaska coupe bowls that we used to use for food shoots. Having some beautiful ceramics at home transforms my (often) half-assed lunches into food that looks like it might actually belong on Instagram. Some old lentils with an avocado? Put them in Jono’s turquoise-glazed bowl and top with some herbs and olive oil, and, suddenly, lunch looks like it took longer than 3 minutes to throw together. Forgot some rice on the stovetop while trying to explain the difference between addition and subtraction to your kid? Dump it on an understated brown clay-rimmed plate and put an egg and some chile crisp on it, and that singed rice starts looking pleasantly crunchy. That’s the Pandolfi magic.Jono’s plates and bowls hit that sweet spot of making anything you put on them look great by embracing organic shapes and textures and restraining the use of color to those hues that don’t take away from the food sitting on top of them. Yes, they make your food look better. But more important, they make it look like you really tried, even when that just isn’t true.Don’t get me wrong. I’m not the kind of person who has tall stacks of beautiful ceramics in every corner of my cabinets. If, post-pandemic, more than two friends come over for dinner, we are going to be eating off the uninspired old beige dinner plates I panic-bought before my first big dinner party 17 years ago. But you won’t catch me photographing anything on them. I’ve got my precious Jono Pandolfi ceramics for the photo shoot.Photo by Emma Fishman8\" Coupe Alaska Bowl$45 at Jono PandolfiExplore Bon AppétitHighly RecommendproductShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-10", "author": ["Condé Nast", "Chris Morocco"]}