{"id": "f438ba6ae85a17a945153b9b8700fced", "url": "https://www.bonappetit.com/recipe/napa-cabbage-wedge-with-sesame-ranch", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Napa Cabbage Wedge With Sesame Ranch Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNapa Cabbage Wedge With Sesame RanchBy Chris MoroccoJanuary 4, 20224.3(15)Read ReviewsTriangleEmailPinterestPrintPhotograph by Paola + Murray, food styling by Pearl Jones, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrintThis isn't your classic wedge in shape or substance, but hear us out: A thick round of Napa cabbage is an ideal vessel for the rich miso-tahini dressing that works its way into every layer. As for that tahini, find out why Soom is our favorite brand to use in this recipe—and everywhere else.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonSoom Tahini$9 At BA MarketLarge Skillet$84 At AmazonTongs$13 At AmazonLarge Basting Spoon$16.37 At AmazonIngredients4 servings6oz. bacon slices⅓cup extra-virgin olive oil3Tbsp. unseasoned rice vinegar2Tbsp. white or yellow miso1Tbsp. tahini (such as Soom)1tsp. onion powder1tsp. soy sauce½tsp. toasted sesame oilKosher salt, freshly ground pepper1small head of Napa cabbageThinly sliced chives, mild red pepper flakes (such as Urfa biber or Aleppo-style; optional), and toasted sesame seeds (for serving)PreparationStep 1Cook bacon in a single layer in a large skillet over medium heat, turning occasionally, until browned and crisp, 10–12 minutes. Transfer to paper towels and let cool.Step 2Meanwhile, purée olive oil, vinegar, miso, tahini, onion powder, soy sauce, sesame oil, and 2 Tbsp. water in a blender until smooth; season with salt and pepper.Step 3Trim top and bottom from cabbage and slice center portion into 1½\"-thick rounds. Spoon 1–2 Tbsp. dressing onto each plate and top each with a cabbage round. Season cabbage lightly with salt. Drizzle 1–2 Tbsp. dressing over each and work it into the layers with the spoon. Drizzle any remaining dressing over.Step 4Tear bacon into large pieces and scatter over cabbage. Top with chives, mild red pepper flakes, and sesame seeds as desired.How would you rate Napa Cabbage Wedge With Sesame Ranch?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleLove this dressing!  I used it for a wedge salad.  PamIllinios2/4/2022Delicious! I didn’t have any tahini on hand so I substituted some hummus instead. Anonymous2/4/2022The dressing is to die for - I keep some in my fridge at all times. I prefer to chop the cabbage to make more of a chopped salad and I added crispy shallots cooked in the bacon fat.Casey BAtlanta, GA2/1/2022This salad was excellent! Restaurant quality flavor in about 15 minutes. I used reduced-sodium soy sauce and the dressing came out perfect (to my taste). I didn’t have Napa cabbage but found standard green cabbage to be just as tasty and still worked for the flat disk presentation. And a big gold star to Chris for giving us lazy cooks a dressing where everything is just poured into a blender and whirred to magic perfection. I didn’t miss mincing herbs, shallot and garlic, reaming citrus, whisking this into that, and slowly drizzling oil into this here bowl. Phew. Just blend it up, baby!  Thank you very much. Spatulacity Los Angeles 1/26/2022Who knew raw napa cabbage could taste so good!!! The dressing is on the saltier side (miso, soy sauce, etc.) so if you are not a big fan of salt, you should opt to not salt or very lightly your cabbage prior to dressing. \n\nIf you loved this, you will also love Chris' Corn & Chickpea Bowl with Miso-Jalapeño Tahini - so much flavor!\n\nP.S. @Chris, keep the Miso & Tahini combos coming!SKBrooklyn, NY1/21/2022all the best flavors of a complicated cobb with none of the work! i kept the cabbage in raw discs (as opposed to searing) and replaced chives with green onion as it's what i had on hand. my finished plate looked just like the picture and i happily scarfed it down.moonbeamsanta cruz, ca1/9/2022I would like to give much appreciation to my boy Chris Morocco for another great recipe. This recipe flavor wise was off the hook. This recipe comes together very quick making it an ideal weeknight dinner. I cut my Napa cabbage into actual wedges and seared them Carla Music. Just wanted to say thank you to Chris and Carla for the awesome techniques.TheJBT88Escondido, Ca1/7/2022Explore Bon AppétitDinnerSaladEasyWeeknightNapa CabbageCabbageLeafy GreensVegetableTahiniCondiments, Sauces & PastesBaconCured MeatMeatMisoDairy-FreeWinterSideRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Chris Morocco"]}