{"id": "f43ab678ba791f871ee176e350b86fdb", "url": "https://www.bonappetit.com/recipe/spiced-roast-pork-with-fennel-and-apple-salad", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Roast Pork With Fennel and Apple Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueSpiced Roast Pork With Fennel and Apple SaladBy Vivek SurtiSeptember 17, 20195.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus NilssonEmailPinterestPrintEmailPinterestPrintThis recipe is from chef Vivek Surti of Tailor in Nashville, No. 7 on our 2019 Hot Ten list. “In India you’ll find pork dishes in Roman Catholic areas, like Goa. When I think of pork in America, my mind goes to barbecue: rubbed with spices, cooked low and slow, and served with slaw,” he says. “I give this pork the Goa spice treatment, roast it, and reinforce the flavors of the marinade (it’s got both fennel and coriander seeds) with our version of slaw, which has fennel and cilantro.” A note from the BA Test Kitchen: The chile paste for this pork is added in two stages. Initially it acts as a marinade and permeates the interior of the roast. After a second addition is applied, it’s roasted over high heat to create a spicy, toasty bark.Ingredients8 servingsPork15dried Kashmiri, guajillo, or New Mexico chiles, seeds removed5pieces star anise3Tbsp. fennel seeds2Tbsp. coriander seeds2Tbsp. cumin seeds1Tbsp. peppercorns, preferably Tellicherry2tsp. whole cloves6garlic cloves, smashed½cup apple cider vinegar½cup vegetable oil, divided14–5-lb. boneless pork shoulder (Boston butt), tied4–5tsp. kosher salt, plus moreFlaky sea saltSalad and Assembly1fennel bulb, fronds reserved, bulb cored, very thinly sliced1Honeycrisp or other crunchy not-too-sour apple, very thinly slicedZest and juice of 2 limes2serrano or red Thai chiles, thinly sliced into roundsSmall handful of cilantro, finely choppedKosher salt3Tbsp. extra-virgin olive oilSpecial EquipmentA spice mill or mortar and pestlePreparationPorkStep 1Cook chiles, star anise, fennel seeds, coriander seeds, cumin seeds, peppercorns, and cloves in a dry small skillet over medium heat, stirring often, until slightly darkened and fragrant, about 2 minutes. Let cool. Set one-fourth of spice mixture aside.Step 2Blend garlic, vinegar, ¼ cup oil, and ¼ cup water in a blender until smooth. Add remaining toasted spices and blend, adding splashes of water if needed to help turn the blades, until chile paste is mostly smooth; some texture is okay.Step 3Season pork with 1 tsp. kosher salt per pound (check the butcher’s sticker on the package to see the weight of what you purchased). Smear half of chile paste all over pork; transfer to a wire rack set inside a rimmed baking sheet or a roasting pan and let sit at room temperature at least 2 hours, or cover and chill up to 12 hours.Step 4Finely grind reserved spice mixture in a spice mill or with mortar and pestle. Transfer to a small skillet; stir in remaining ¼ cup oil. Set over medium heat and cook, stirring, until spices have darkened slightly and are fragrant, about 1 minute. Let spice oil cool, then transfer to an airtight container. Cover and set aside.Step 5Preheat oven to 275°. Roast pork until paste is darkened and looks dried out and an instant-read thermometer inserted into the center registers 120°, 1½–2 hours, depending on the size. Make sure to take the temperature in more than one spot as there will be thick and thin parts of the roast. Let rest 2 hours.Step 6Preheat oven to 500°. Rub pork with reserved chile paste and roast until marinade has formed a fragrant crust and an instant-read thermometer inserted into the thickest part registers 130°, 8–12 minutes. Transfer pork to a cutting board and let rest 15 minutes. Thinly slice and transfer to a platter. Spoon reserved spice oil over pork; sprinkle with sea salt.Salad and AssemblyStep 7Toss fennel bulb and fronds, apple, lime zest and juice, chiles, and cilantro in a large bowl; season salad with salt. Drizzle oil over and toss to coat. Serve pork with salad.How would you rate Spiced Roast Pork With Fennel and Apple Salad?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleIn step 4 we grind, toast and set aside the dry spice mixture. But it is never mentioned again. What is it for?Casey2/13/2021An amazing recipe, pork was super flavourful. I added toasted hazelnuts to my salad it was an excellent addition. Hans153Oxfordshire, UK 4/14/2020Definitely an all day commitment, so I made this for a Saturday dinner with friends. I followed the temperature guidance and it came out medium/medium rare which mostly worked, but a half of the pork felt a little *too* rare. We used about half for dinner as is, and it was a hit! The spice combination is incredible. I nervously put the other half in a crock pot on Sunday... and turned it into pulled pork. Second round as was also a hit! I put the pulled pork on top of long grain rice, then made up the slaw to put on top, and we turned on the premiere of Watchmen. Delicious!rebekah.campbell4657Tulsa, OK10/23/2019Made this for dinner today. So good! The fennel salad was a surprise hit! I used jalapenos instead and minced it as we didn't like full bites of chiles in our salad. We also skipped the oil as we felt it taste good enough as it is, especially with rich tasting pork on the side.sumi-eaustralia10/21/2019I made this tonight. I used a tenderloin instead of a shoulder because that’s what they had at the store. The pork came out perfectly- tender and juicy and very flavorful. But the salad is the star. It was bright and crisp and juicy. A perfect complement to the spicy pork. The recipe came together very easily, especially with the use of a mandolin for the apples and fennel. AnonymousGreenwich, CT9/23/2019Explore Bon AppétitPork ShoulderPorkMeatChileVegetableFennelAppleFruitGuajillo ChileNew Mexico ChileMainDairy-FreeNut-FreeGluten-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Vivek Surti"]}