{"id": "f4533fdd5e8096337feff4f30a1c14d1", "url": "https://www.bonappetit.com/story/sana-javeri-kadri-woman-businesses-to-watch", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "For Diaspora Co.'s Sana Javeri Kadri, a Community Is More Powerful Than a Marketing Team | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFor Diaspora Co.’s Sana Javeri Kadri, a Community Is More Powerful Than a Marketing TeamThe spice company’s founder harnessed the power of people all over the U.S. to build her brand—and now she’s doing the same for other entrepreneurs.By Sarah JampelFebruary 22, 2021FacebookTwitterEmailIllustration by Cynthia KittlerFacebookTwitterEmailThis story is from 13 Ways to Launch the Food Business of Your Dreams, where women entrepreneurs share their experiences and best advice on turning a passion for food into a career.Sana Javeri Kadri knows that small shout-outs can make a big difference. “We’ve never had a marketing budget—we were a tiny bootstrap company hyped by women all over the U.S.,” says the founder of Diaspora Co., a direct-to-consumer single-origin spice company on a mission to decolonize and decommoditize the traditional supply chain. “I’m keenly aware that Diaspora wouldn’t have grown to what it is today—and we’re still a pretty small company—without those prop-ups.” Now, Javeri Kadri is doing the same for other women entrepreneurs on her own platform, making a point to highlight businesses whose values align with her own. “So much of my job, and the privilege that I have, is that I’m able to translate that world of sourcing in India to the American market. If I can translate it for my brand, I can translate it for other people too, and give them the leg up that I’ve been given.”We asked Javeri Kadri to tell us about six women whose businesses she’s hyping right now. These were her answers:Spandana Gopal, Tiipoi Design Studio: “She collaborates with craftspeople to create manufactured products, and her Karipot, made with Longi black pottery by an artisan from Manipur, is a beautiful example. Cooking with it has been my favorite part of the pandemic.”Ekom Kaur Mamik, Moringa What: “Especially in the U.S., Moringa has been co-opted so that it’s divorced from its origins. Ekom works with smallholder producers across south India [and West Bengal], highlighting different varieties of Moringa and how they’re traditionally used in India. She sells a Moringa face mask as well as pure Moringa for consumption.”Zeinorin Stephen, Hill Wild: “What she’s able to do for the farming community of Manipur amazes me. Not only does she run Hill Wild, her chocolate business that uses ingredients indigenous to the hills of Ukhrul, like perilla seeds and ghost peppers, but she also manages sourcing for Diaspora and is constantly acting as a food hub for producers in the region. Recently there was a surplus of kiwi, so she turned it into kiwi candy.”Sonoko Sakai, Sonoko Curry Powder: “A lot of people use the term curry powder without questioning whether it’s Japanese curry powder or Madras curry powder, for example. Sonoko is really bringing the Japanese history of curry powder into her product and making it specific.”Evangelia Koutsovoulou, Daphnis and Chloe: “When I was starting Diaspora, she was a real inspiration to me. She’s doing for Greek and Mediterranean herbs and spices what we’re doing for Indian spices. And I’m obsessed with her products. I buy them constantly. Her smoked chile flakes are unreasonably delicious. Same with her fennel. I don’t think Diaspora will ever be able to source more delicious fennel than that.”Jing Gao, Fly by Jing: “I really relate to Jing’s story of returning to her roots, diving deep into Sichuan flavors, and sticking to her guns. It’s something I’ve struggled with so much—I’ve been tempted to water down the mission, the flavors, and the point of Diaspora at many turns if it meant we would sell better or be more popular. Jing has only dug her feet in deeper, and I admire that so much.”Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-18", "author": ["Condé Nast", "Sarah Jampel"]}