{"id": "f455ffce9b0c0e9f597dd34c81a767bd", "url": "https://www.bonappetit.com/story/plum-crumble-recipe", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "This Fruit Crumble Recipe Is the Underdog Dessert of the Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Plum Crumble (Prumble???) Is the Underdog Dessert of the SummerIt’s time for pie to take a backseat.By Emma WartzmanJuly 21, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIf summer fruit pie is the hare, then summer fruit crumble is the tortoise. Stay with me. Pie is the dessert that looks supremely impressive, the one that when you pull it out of the oven, people swoon and say, “Wow! Did that take you all day?! You’re amazing!”Now, I’m not trying to hate on pie. But what I am trying to say is that crumble is the underdog—the dessert that sneaks up on you and proves itself the ultimate winner. And this Plum-Cardamom Crumble with Pistachios is the best version of the underdog I’ve had in awhile.Here’s my take: Buttery, sugary, nutty clumps are better than flaky pie dough. I’m aware that this is an opinion, specifically my opinion, but I will maintain that opinion for as long as I live. The crumble clumps taste like broken-up sandy cookies, softening as they soak up the bubbling plum juices beneath and, if you’re smart, melting vanilla ice cream scooped on top. And yet, in this case, they still maintain crunch from the pistachios that are sprinkled on right before baking, a trait that pie dough, alas, does not possess.Just look at how pretty.\nPhoto by Ted Cavanaugh, Styling by Sue LiThe crumb part is also far easier to make than pie dough. There is no fear of overworking, no rolling it out into a crack-filled blob shape that is hopefully reminiscent of a circle, no oh-my-god-how-did-flour-end-up-on-every-surface-of-my-kitchen moment. All you do is pulse together flour, brown sugar, salt, and cardamom in a food processor (and honestly, you can do it by hand, too) until combined, and then add pieces of cold butter until it all clumps up.Now onto the plums. They are the best fruit. And yes, this is also my opinion, but it is the correct opinion, and another I will maintain for as long as I live. In this recipe, plums (I made it with a mixture of all the varieties I found at the store), get cut up and tossed with lemon juice, cornstarch, brown sugar, salt, and cardamom. That mixture sits until the bright-pink juices are running wild and free. And now all that’s left to do is chop up some whole, raw pistachios for the top; they toast beautifully as the whole crumble bakes.You can also play with a lot here. “The plums and cardamom go beautifully together, but I intended for this to be a template for whatever fruit is looking best at the farmers market, or whatever spices you have in your pantry,” says senior associate food editor Molly Baz, who developed the recipe. You can swap, say, peaches or nectarines for the plums, almonds for the pistachios, or cinnamon, or even nutmeg or ginger, for the cardamom. But one word to the wise. The recipe calls for a deep pie dish or an 8x8x2” baking dish so that you don’t end up with burnt juices all over your oven floor, which will definitely happen if you use a standard pie dish.The assembly goes like this: fruit on the bottom, then the crumb you scatter haphazardly, so that some of the fruit still peaks out. “Make sure to squeeze handfuls together as you go so that you get bigger chunks and not just a fully sandy sprinkling,” says Baz. And then the nuts on the very top. Forty-five minutes later, plus however long you can wait to let it cool and set up (in my case, about an hour), and you’ll vote crumble over pie. And so will all your friends. The underdog wins again.Get the recipe:Plum-Cardamom Crumble with PistachiosOn the rare occasion you need an “excuse” to use up fruit before it goes bad, well, that’s what crumbles are for.View RecipeExplore Bon AppétitSummer DessertsCrumblePlumRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-21", "author": ["Condé Nast", "Emma Wartzman"]}