{"id": "f45aedc2518561f9058ace248fd8e011", "url": "https://www.bonappetit.com/recipe/cranberry-and-golden-raisin-relish", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Cranberry and Golden Raisin Relish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueCranberry and Golden Raisin RelishBy Kendra VaculinOctober 19, 20214.6(9)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food styling by Susie Theodorou, Prop styling by Sophie LengEmailPinterestPrintEmailPinterestPrintIn this no-fuss sauce, tart cranberries meet their match in bright ginger and fruity golden raisins. But this cranberry relish isn’t meant only for the Thanksgiving table: Try it as part of a festive breakfast on pancakes or French toast, as a holiday cheeseboard condiment, or as a sweet spread on grilled cheese sandwiches (it’s great with brie!).All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSmall Saucepan$155 At AmazonMicroplane Grater$16 At AmazonSilicone Spatula$13 At BA MarketIngredients1lb. fresh (or frozen, thawed) cranberries12\" piece ginger, peeled, finely grated1¼cups golden raisins (about 8 oz.)¾cup sugar3Tbsp. fresh orange juice2Tbsp. unsalted butter½tsp. ground allspiceKosher saltPreparationCook cranberries, ginger, raisins, sugar, orange juice, butter, allspice, and a big pinch of salt in a medium saucepan over medium heat, stirring occasionally and reducing heat as needed to keep from scorching, until cranberries have burst and relish is thick and jammy, 10–12 minutes. Let cool before serving.Do ahead: Relish can be made 3 days ahead. Cover and chill.How would you rate Cranberry and Golden Raisin Relish?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI made this as directed, but it turned out a little on the dry side.  Maybe I overcooked it a little?  It was still very delicious and every bit of it was eaten.Lazlo HollyfeldByram, NJ11/29/2021Just made this in preparation  for a family meal. Absolutely delicious! The ingredients are simple and delicious and the raisins are to die for as they had not only a bitter sweet element but also some nice texture. It is quite jammy and has a nice flavor to it. Rai M.Indianapolis, IN11/13/2021Explore Bon AppétitCranberryBerryFruitRaisinDried FruitSideThanksgivingSauceDinnerCondiment/SpreadEasyQuickRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Kendra Vaculin"]}