{"id": "f465048aed0b84272400cef0550c886c", "url": "https://www.bonappetit.com/story/hummus-weeknight-entertaining", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Hummus Is the Secret to My Weeknight Entertaining | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHummus Is the Secret to My Weeknight EntertainingA weekly dispatch from Bon Appétit's editor in chief.By Adam RapoportJune 26, 2018FacebookTwitterEmailMichael Graydon + Nikole HerriottFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Zhuzh up hummus (and pretend it's homemade).Last Thursday, my wife and I had a couple of friends over after work. Do you ever do the weeknight dinner-party thing?More than cooking, it’s a scramble. Can one of you cut out early from the office, who’s going to do what, what kind of dishes can you manage to pull off in a short amount of time?I had gotten inspired to riff on some sort of Mediterranean-slash-Middle Eastern menu. There would be quickly marinated, grilled lamb chops (a fast-cooking protein is always a good move). I stopped by the market and picked up some Japanese eggplant (you know, the long, skinny ones), that I would throw on the grill before the chops. And Simone tossed together a basic green salad with her famous (at least in our household) shallot vinaigrette.Peden & MunkWant this letter before it hits the website? Sign up for our newsletter!But it was what I didn’t prepare that drew the most raves. To round out the meal, I set my sights on a spread of hummus, warm pita and some Persian cucumber spears. Now, if you want, you could log on to bonappetit.com and find two no-fail homemade hummus recipes, one from celebrated Philadelphia chef Michael Solomonov, and one from Sam Smith, chef at the always-packed Tusk in Portland, Oregon.But you know what I’m not making on a weeknight? Hummus—no matter how defyingly airy and creamy it may be.Alex LauAnd that’s the thing about entertaining: you don’t need to make everything from scratch. But you should do something to zhuzh up whatever store-bought items you’re setting out.I picked up a tub of hummus from Dizengoff, Solomonov’s hummus in nearby Chelsea Market. And then I did like the pros—I spooned a blob of the chickpea-and-tahini spread into a shallow bowl, and I took the back of a soup spoon, set it into the hummus, and began to rotate the bowl like a spinning LP. Gradually, grooves started to form, along with a ridged border.Can’t exactly picture what I mean? Check out the minute-long technique video on the hummus swoosh for a tutorial below, just like I did before our friends came over.Once I had formed my hummus sculpture, I filled the wells with extra virgin olive oil, and hit it with a few pinches of Aleppo pepper. Had I thought about it, I could’ve topped it with a chiffonade of crisp sugar snap peas, or maybe some sweet, wilted, oven-roasted cherry tomatoes, or pretty much anything.I threw some pita on the grill ‘til it was warm and puffy, and cut it into little triangles. And there we were, hanging out at our backyard picnic table, scooping up hummus with warm pita and the occasional cucumber spear, and refilling our tumblers with icy cold rosé.It was kinda perfect. Who cares if we didn’t actually make it?Get the recipes:Grilled Lamb Chops Scottadito with Charred Cherry TomatoesSimone’s Shallot VinaigretteDizengoff’s HummusTusk’s HummusGrilled Eggplant and Lemons with Garlic LabnehExplore Bon AppétitAdam NewsletterHummusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-26", "author": ["Condé Nast", "Adam Rapoport"]}