{"id": "f471e13682cd53c7c6e522d0ff6db1b8", "url": "https://www.bonappetit.com/story/hoang-gia-new-orleans", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Hoang Gia Karaoke Bar Is the Place for ABBA Hits and Stellar Vietnamese Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsGo to This Karaoke Bar for ABBA Hits and Stellar Vietnamese FoodHoang Gia has everything I need for a good time in New Orleans.By Allie WistNovember 14, 2019FacebookTwitterEmailFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I'm never one to say no to karaoke. So when a Vietnamese friend insisted we go to Hoang Gia when I was visiting New Orleans last year, I absolutely did not argue. But as much as I was into the renditions of “House of the Rising Sun” and the divey decor (heavy ruched curtains, giant rubber plants, green dance floor strobe lights), I couldn’t stop thinking about all the delicious  food we ordered.Elbowed into a strip mall in New Orleans East, this karaoke bar doubles as a destination for Big Easy adaptations of Vietnamese dishes. There’s fried gulf shrimp with a tamarind-lime dipping sauce that’s pungent and sweet. There’s a giant hot pot made with local Pompano fish, elephant taro, tomato, and okra, and served with vermicelli noodles. I wanted to swim in it! And there are the platters of “Rock n’ Roll” beef with chiles, a rich, velvety version of shaking beef—best enjoyed under flashing LED stage lights. I never spent more time snacking than singing at karaoke.The chef responsible for this delightful bar food is Buc Sau, a 72-year-old woman who immigrated to the United States in the ’80s after the fall of Saigon. She worked in kitchens around New Orleans and ended up at Hoang Gia, a sit-down family restaurant at the time. Eventually, she decided that she wanted to take over the restaurant herself, so she and her son bought out the owner and turned the restaurant into a community mainstay for local fisherman.Swing by any Saturday and you’ll find folks sharing fried shrimp, ordering a bucket of cold beer, and signing up to sing Vietnamese hits. And ABBA. No karaoke session is complete without an ABBA deep cut.Go there: Hoang GiaExplore Bon AppétitRestaurantsHighly RecommendNew OrleansVietnameseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-14", "author": ["Condé Nast", "Allie Wist"]}