{"id": "f4724c67467894658ea94f7ce73a5f4a", "url": "https://www.bonappetit.com/recipe/shrimp-dumplings-har-gow", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Shrimp Dumplings Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueShrimp DumplingsBy Simone Tong February 12, 20183.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Anna Billingskog, Prop Styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintChef Simone Tong of Little Tong Noodle Shop in New York, who developed this recipe, says: “During Chinese New Year, eating dumplings symbolizes unity, togetherness, and harmony. One family, regardless of circumstances, sitting under one roof eating dumplings, is happiness from within.” Read more about Chinese New Year and find the full menu here.IngredientsMakes 30Dipping Sauce¼cup black vinegar2Tbsp. low-sodium soy sauce11\" piece ginger, peeled, cut into matchsticks1red chile, seeds removed, finely chopped, or 1 tsp. chili oilDumplings½lb. large shell-on shrimp, peeled, deveined, coarsely chopped¼cup thinly sliced scallion greens (from about 4 scallions)12\" piece ginger, peeled, finely grated2Tbsp. low-sodium soy sauce1tsp. potato starch1tsp. sugar1tsp. toasted sesame oil½tsp. kosher saltPinch of ground white pepper30round dumpling wrappersPreparationDipping SauceStep 1Mix vinegar, soy sauce, ginger, and chile in a small bowl.Step 2Do Ahead: Sauce can be made 3 days ahead. Cover and chill.DumplingsStep 3Pulse shrimp in a food processor until there aren’t any pieces bigger than ¼\"; transfer to a large bowl. Stir in scallions, ginger, soy sauce, potato starch, sugar, sesame oil, salt, and pepper.Step 4Working with 1 wrapper at a time and keeping remaining wrappers covered with a damp paper towel so they don’t dry out, place 1 heaping tsp. filling in the center. Using your fingers, spread a little water on edge of one-half of wrapper. Fold wrapper over to make a half-moon shape and press edges together. Using your thumb and index finger, make small pleats along sealed edge, pressing pleats tightly to make sure dumpling is sealed.Step 5Bring a large pot of water to a boil. Working in 4 batches (do not overcrowd pot), cook dumplings until they begin to float, about 4 minutes.Step 6Transfer dumplings to a platter. Serve with dipping sauce alongside.How would you rate Shrimp Dumplings?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleWhy can't I access the recipe?ChristineNew York2/2/2022Tasty lil recipe! I added a clove of garlic. When I took them out of the boiling water, I plopped em in a strainer and sprayed with a little warm water to keep them from sticking. Topped with fried onions and garlic alongside a crunchy salad. JosieChicago2/16/2021There's quite a bit of ginger in these! The next time I make it (which I will definitely be doing) I'll probably halve the ginger and keep the shrimp out of the food processor for more texture. I might also add some garlic in the filling to cut the strength of the ginger and provide more depth to the mix.abigailbarr12/7/2019Explore Bon AppétitDumplingChineseEast AsianAsianShrimpShellfishSeafoodStarterSimmerLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Simone Tong"]}