{"id": "f4895fc4c1f2b610cdf9a8832e3aabd4", "url": "https://www.bonappetit.com/story/maison-de-la-luz-new-orleans", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "This New Orleans Hotel Is My Design Dream | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis New Orleans Hotel Is My Design DreamDo not even get me started on the bedside cabinet at Maison de la Luz.By Michele OutlandNovember 15, 2019FacebookTwitterEmailPhoto by Stephen Kent JohnsonFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.My friend (and photographer) Stephen Kent Johnson was shooting in New Orleans not too long ago, so when I was planning a trip there for a recent BA shoot,  I asked him where he stayed. He was like, “Oh, I know just the place.”Maison de la Luz is in the Warehouse District, right by the Ace Hotel (they’re sister properties and share gym and pool amenities). Once I stepped inside the lobby, I noticed all the weird but fun safari vibes, courtesy of design firm Studio Shamshiri. There was the very Wes Anderson check-in desk, art on the wall with hieroglyphics, plush ochre- and mustard-hued suede couches, white marble coffee tables with funky feet, and cute mushroom-shaped lamps. It was a design dream. Plus, it was super peaceful inside, a real respite after shooting all day with senior staff photographer Alex Lau.Given that, Lau and I needed a drink. So we wandered into what the hotel calls a “speakeasy,” which is essentially a very well-appointed sitting room with a bookshelf that you push to get into another space, Bar Marilou. The bar had vibrant red walls and groovy leopard skin stools and, that night, was totally packed. We wanted a more chilled-out experience, so we slipped back into the speakeasy, then headed back up to our rooms and almost didn’t leave.If only all bedside tables were so chic.\nPhoto by Stephen Kent JohnsonAfter I ordered a very balanced room service meal (salad with a poached egg and a Negroni), I got into my fluffy bathrobe and slippers and settled in. The rooms (around $220 a night) are eclectic in the best way possible. I loved the arched doorway. I died over the bathroom floor with its muted jewel-toned tiles. I adored the séance wooden table, with astrological signs carved into the copper top, and the amazing bedside cabinet with its sacred geometry look and tan half-moon patterns. I was kind of obsessed with it, because it’s also doubles as a bar cart with its luxe leather top underneath cool Japanese whiskeys and a cloche filled with Turkish delights. Every detail was kind of perfect.I travel so much, and at Maison de la Luz it felt more like you were in someone’s home than a hotel. Each room had such a good mix of stuff, like someone picked out every little thing to put on display. It wasn’t a cookie cutter business person hotel. Rather it was an elegant sanctuary in the middle of crazy town New Orleans, and writing this makes me want to go right back—just to stay at this hotel.Go there: Maison de la LuzExplore Bon AppétitHighly RecommendHotelsNew OrleansRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-15", "author": ["Condé Nast", "Michele Outland"]}