{"id": "f490a2962bbddb5461999dc30b0b7a9a", "url": "https://www.bonappetit.com/story/breakfast-should-involve-caprese", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Breakfast Should Involve Egg-in-a-Hole and Caprese | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBreakfast Should Involve Egg-in-a-Hole and CapreseA weekly dispatch from Bon Appétit’s editor-in-chief.By Adam RapoportJuly 18, 2018FacebookTwitterEmailNicole FranzenFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.You’re on vacation, so live your best breakfast life.By the time I wandered into the kitchen, just before halftime of the World Cup final, my friend Alex was already in the zone.She had four eggs in a hole sizzling away in a pair of cast-iron skillets. A platter of just-sliced heirloom tomatoes sat on the kitchen island, awaiting the makings of perfect caprese. She was grating some ginger onto a quickly-assembled fruit salad. She had sliced up a couple of buttery soft avocados and flanked then with wedges of limes and lemons. And because she had some leftover dressing from the other night, she tossed together an arugula salad.“Do you think we need bacon?” Alex asked me.“Um, yeah, I’m pretty sure we’re good.”Want this letter before it hits the website? Sign up for our newsletter!Maybe you know someone like Alex. She’ll insist she’s not a great cook, but she always manages to pull together a meal for a houseful of guests, without the slightest hesitation or trepidation.She just gets the job done.And in the summer, if you’re lucky enough to be spending the weekend at a lake/beach/country house with a bunch of friends, you need an Alex.On this particular late Sunday morning, in rural Connecticut, I was thrilled she had seized the wheel. I was couch bound, on mug of coffee No. 2, struggling to rouse myself from a friend’s 50th birthday party the night prior.Mozz should always be torn, never sliced.\nLaura MurrayI did what I could. I knew that the key to top-notch caprese is an ample amount of flaky sea salt, more olive oil than you think need, and hand-torn—not sliced mozzarella. And then make sure to let it sit at room temperature for at least 10 minutes for all the flavors to marry.As Alex was serving up the eggs, I doused the avocados with plenty of lime and lemon juice, because avocados can’t have too much acid.As for the fruit salad, I love the addition of hand-grated ginger, whether a recipe calls for it or not.And then, like any good, appreciative house guest, I filled my plate. And then filled it again with seconds and thirds. Finally, and perhaps most importantly—after France rolled over Croatia—I got started on the dishes.Get the recipes:Egg-in-a-Hole Sandwich with Bacon and CheddarBacon in the OvenUltimate Caprese SaladExplore Bon AppétitBreakfastcapreseVacationsRead MorecookingClaire Saffitz Makes All Your Favorite Baked GoodsBy Adam RapoportcookingHummus Is the Secret to My Weeknight EntertainingBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-18", "author": ["Condé Nast", "Adam Rapoport"]}