{"id": "f497dcbe81cf21da55f5422659ecee51", "url": "https://www.bonappetit.com/story/home-red-sauce-restaurant", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "A Home Is More Than a House. Sometimes It’s Also a Red Sauce Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsA Home Is More Than a House. Sometimes It’s Also a Red Sauce RestaurantThe longer I live in Los Angeles, the more I try to find places where I feel like a thread in the fabric of something bigger than myself. Enter: Little Dom's.By Roxane GayApril 16, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.What you need to know about the meal I had at Little Dom’s is that I had the chicken Parmesan. The breast was juicy; the mozzarella browned and oozing into the curves of the meat; the marinara complex, its pliant chunks of tomato neither too thick nor too thin. It was practically pornographic, the exemplum perfectum of chicken Parmesan. There was arancini, fried to golden perfection, and an arugula salad. Little Dom’s is a red sauce restaurant with a slight edge, reminding us that we’re in L.A., not New York. There was cauliflower “risotto” on the menu, is what I’m telling you.I was on a double date in a round banquette tucked against a wall. On the table, beneath our food, there was brown butcher paper, with slowly spreading grease stains. It felt like we were in a postcard, the kind you send from a lovely vacation in a magical place with a brief note where you try to capture the wonderful time you’re having.I love Italian-American restaurants because I know what to expect—the menus are scrutable, offering the standards Americans consider authentic Italian even though these dishes are likely nothing of the sort. There is lots of red sauce and pasta and cheese in various combinations, garlic bread, and cheap wine. The waiters work at the joint for the whole of their adult lives. There isn’t much pretense—or, I suppose, the pretense of a hearty meal cooked like that of the Italian grandmother you never had is a pretense you can live with. These restaurants are firmly ensconced in a neighborhood. When you eat at one, you are, for an hour or two, a necessary thread in that community’s fabric.  You are part of an authentic experience.Little Dom's opened in 2008 but masters the art of old-school vibes.\nPhoto by Alex LauRestaurants love to toss around the word authentic. As a culture, we are rather preoccupied with this idea that there’s an essential truth to any given experience, accessible to us if we just try hard enough, with the right intentions. An authentic dining experience is so coveted because we put the responsibility of achieving authenticity in the hands of the restaurateur. They do all the hard work, and we reap the rewards of their efforts. We get an experience we so very much want, one that is genuine and true or, at least, the approximation of such.I had long wanted to visit Little Dom’s, but I live on the west side of Los Angeles, and the restaurant is closer to the east side, in Los Feliz. As a Midwesterner, this should not be a deterrent—the distance is only ten or so miles—but in Los Angeles, that could mean days, or weeks even. Still, we persisted, despite Friday night rush hour and rain. We were, in turn, amply rewarded by not only a wonderful meal but also a visit to one of my favorite L.A. neighborhoods, a place that feels like the people who live there are enthusiastically part of a community. Everything is walkable and charming and slightly rundown in an interesting way. At my favorite bookstore, a tree grows in the middle, breathing life into everything.Lest you forget, we're in L.A., not New York.\nPhoto by Alex LauWhat you need to know is that I’ve moved more times than I care to count. As a child, my family relocated constantly for my father’s job. As an adult, I moved to Michigan’s Upper Peninsula for graduate school and then rural Illinois for my first teaching job and then rural Indiana for my next teaching job. When I came to Los Angeles five years ago, it was the first time in my life I chose where I lived. I still had my teaching job at Purdue, but I commuted (yes, to Indiana) and made it work.Determined to make L.A. my home, I rented an apartment downtown. It was a few blocks from a fire station, in one of those new buildings that reeks of gentrification, only this one was in a previously desolate neighborhood a few blocks from Skid Row. The apartment was nice in that antiseptic, corporate way where if you look too closely you realize the supposedly wood floors are laminate.I didn’t decorate beyond the basics. I didn’t have a neighborhood restaurant or any cute stories about my quirky neighbors. I had a place to store my belongings and watch television and listen to people drunkenly ambling on the street below, late at night. It wasn’t home. There was nothing of me in that place but my body, and that was fine until it wasn’t, until I couldn’t stand the overwhelming feeling that I wasn’t connected to anything or anyone. My life didn’t feel real—or, if you will, authentic.Little Dom's sits in the middle of L.A.'s Los Feliz neighborhood.\nPHOTO BY ALEX LAUWhat you need to know is that last summer I bought a house, my first house. I did it on my own, and it was a terrifying experience, particularly in a city where housing costs are spiraling out of control for all but the wealthy. I bought a house, and as I contemplated all those empty rooms, I wanted to make it a home—my first real home as an adult—one where I put thought into the various living spaces and how I filled them. I had the kitchen cabinets painted a dark blue-gray and bought a nice couch and started putting some art on the walls. There are built-in bookcases for my library and a nearly dead ficus tree my real estate agent gave me that I keep forgetting to water. Every morning I stare at that dying ficus, and it stares back at me, and we remain at this impasse.In my backyard, there is a large tree, the genus of which I do not know. This tree is alive and thriving, sheltering the property with a thick canopy of green. Before I moved in, I covered that tree in lights, and at night, when I turn it on, I look at it and think, “This is my home.”The longer I live in Los Angeles, the more I try to find places where I feel like a thread in the fabric of something bigger than myself. I want to experience authenticity not in the smarmy ways we say things are authentic, but in a way that makes me feel grounded, connected. Eating at Little Dom’s, pleasantly buzzed from good wine and good food, having an authentic-ish meal, I felt that for a couple hours. Like I was a necessary thread among other necessary threads. Like I had found that essential truth. Like I was in a place that could become part of what I need home to be.Roxane Gay writes a lot and travels too much. She is the author of several books including New York Times bestsellers Bad Feminist and Hunger, as well as the Marvel comic book series World of Wakanda.Explore Bon AppétitRestaurantsItalian AmericanRed SauceLos AngelesRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Roxane Gay"]}