{"id": "f498235b5510e917192b7fc7cce2f459", "url": "https://www.bonappetit.com/story/diet-culture-and-pregnancy", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "Learning to Reject Diet Culture, One Pregnancy at a Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLearning to Reject Diet Culture, One Pregnancy at a TimeMy recovery from my eating disorder was going so well. Then I got pregnant.By Hannah HowardFebruary 17, 2022FacebookTwitterEmailIllustration by Marine BuffardFacebookTwitterEmailI’ve always loved food. I grew up eating well; my mom is a fantastic cook, and the kitchen felt like the heart of connection, fun, and possibility. But from a young age, that love of food was complicated by darker, more difficult layers. I didn’t know the term “diet culture” then, but I internalized its notion of valuing thinness above nearly all else from a frighteningly young age. I was the tallest girl in my class and the first to need a bra. I don’t remember anyone explicitly telling me my body was wrong, but I never doubted that as a hard and fast truth.So I turned to dieting to “fix” myself. Diets popped in and out of fashion, and I thought one of them might hold the secret to exorcizing my self-loathing. Instead, I’d find myself in bed with a box of granola bars in the middle of the night because—shocker—I was hungry. Our bodies are pretty brilliant, and we’re biologically wired to do everything we can not to starve. But when I did eventually eat, I felt like a failure. I promised myself to restrict even harder the next day.Rinse and repeat, with boring variations, for many years.For a decade now I’ve been lucky enough to be in recovery from an eating disorder. My struggles with food took all sorts of different forms, from anorexia to binge-eating to the frustratingly vague diagnosis of EDNOS—Eating Disorder Not Otherwise Specified. Recovery has meant slowly untangling my joy around food from far less pleasant feelings of obsession, fear, and shame.Recovery has been a long road, and one I wouldn’t trade for anything. It started with asking for help, which was terrifying. My eating disorder was my deepest, darkest secret, and I spent an enormous amount of energy pretending everything was fine. Hearing people speak out loud the things I could barely admit to myself—the things they did with food in the middle of the night, the sneaking around, the complicated calculations—was fascinating. I thought lightning would strike them from above and they would disappear in a clap. After all, these people were admitting the things I hadn’t shared with my therapist, my best friend, or my mom—the source of my most profound shame—to a room full of strangers. They laughed and they hugged. It was profoundly reassuring. Something rearranged itself inside of me; I was no longer alone with this enormous burden.I was 24 then, and I’m 34 now. Since then I’ve had and left boyfriends, jobs, and apartments. I slowly built my life on a foundation of recovery, which is not to say I haven’t made a million mistakes along the way. But for the most part, things have gotten bigger and better.In 2018 I married the most amazing man, and not too long after, I got pregnant. We were elated, but I also felt sort of shocked. It happened so fast! I had spent my whole life trying not to get pregnant, and here we were upending our lives on purpose. I ordered every single not-totally-silly pregnancy book I could get my hands on, and I couldn’t wait to approach pregnancy with earnest nerdiness. Having a baby was such a colossal life change, and books seemed a way into a huge unknown.I began with classics like What to Expect When You’re Expecting and Ina May’s Guide to Childbirth. I had so much to learn. I was embarrassed that I didn’t know much of anything about, say, the placenta. I found plenty of interesting information—growing a baby in your body is wild stuff—but I also noticed a familiar message and tone I hadn’t encountered since my dieting days.There was an illustration of a mama saying “no thank you” to excessive sugar, and enthusiastic affirmations to eat “wholesome foods.” The message was loud and clear: If you cared about your baby, you would forgo sprouts (that’s on the list! sprouts!), tuna fish, coffee, sunny-side up eggs, hot dogs, turkey sandwiches, organ meat, raw milk cheese, anything not organic, anything processed. These books that were purportedly trying to be helpful offered a lot of advice, a lot of rules, and a lot of judgment. They had plenty to say about what to eat, and when, and what not to eat.I started off trying to do everything right. I took my prenatal vitamins religiously (I read that folic acid helps form the baby’s neural tube) and ate plenty of protein (protein is crucial for baby's growth throughout pregnancy). I went to yoga class (movement decreases the chance of preterm labor), but avoided twisting (twists can cause uterine contractions). I eschewed potentially risky foods, from charcuterie to runny eggs to raw sprouts. Who likes sprouts that much anyway? While the tone of the books had me on high alert, the stakes of growing a baby inside of my body were so much higher than trying to lose weight so that I could finally like myself. (Spoiler alert: It doesn’t work that way. No amount of dieting can transform self-loathing into self-love.)But there were some days I was so nauseous that everything bagels toasted with butter were the only things I could stomach. After a day of multiple bagels, I felt that old small-minded voice creep up, admonishing my choices. Would my child develop some sort of unhealthy bagel dependency? Over a decade of recovery, I had spent a whole lot of time and energy understanding my own rules of food (basically, eat what I like and what my body, stomach, and heart want), and rejecting fear-based, wellness-coached rules like “don’t eat after 8 p.m.,” or “carbs are evil.” Most people might be able to take such advice with a healthy grain of salt, but my eating disorder reared up again during pregnancy, clinging to maxims like “no processed foods during pregnancy” until I felt like a miserable failure.Science is real, and it's good to know the significant risks, say, of drinking while pregnant. But I was shocked that a fear-based, diet-heavy mentality (thinness = goodness; food = a moral issue), was at the heart of much of the pregnancy-related literature. Like diet books, they felt wrapped up in the policing of women's bodies, and this incorrect story that we can somehow exert a control over our own lives and bodies that doesn’t quite exist. After all, diets resoundingly don’t work. Ultimately, I decided I had to figure out what was right for my own body and proto-baby and life. Wasn’t that part of being an adult person in the world—and soon, a mom?I chose decaf. I didn’t even try the sweetbreads my husband ordered. Maybe I didn’t eat veggies at each and every meal, but I tried. I thought about the words of the pregnancy books, which I heard in a chirpy but scolding voice, and tried to relegate them to the back of my brain.And then, less than 48 hours after hearing the drum of a heartbeat at our first ultrasound, in the very small hours of the morning at a wedding in the green British countryside, I started to bleed. A whole lot. The cab that was meant to take us home for the night rushed me and my husband to the ER instead. I was disgusted at the blood I dripped on the leather taxi seat and onto the clean white floors of the exam room. I shivered even though it wasn’t close to cold. I couldn’t stop shaking.We lost the pregnancy.I knew pregnancy loss was common, but I wasn’t prepared for my own devastating sadness.I think of the proto-baby we lost every day. I wonder what we would have named her. I wonder if her eyes would have crinkled up in the corners as she began to smile at the world.The doctor, my therapist, and friends have reassured me a million times, but there it is, still: I can't help but wonder if I could have done something, anything different. But even if I had eaten all the sweetbreads and downed serial cans of Red Bull, I wouldn’t be to blame for our loss. It doesn’t work that way. Most early-term pregnancy loss occurs because of chromosomal abnormalities that are totally unrelated to, say, eating organ meats.Policing what we eat sows seeds of deep destruction; it certainly has done for me. It teaches us that when something goes \"wrong,\" from miscarriage to weight gain, it's because we somehow weren’t “good” enough. It’s a very shiny lie because it comes with the false promise of control. Just like dieting, this goal of doing all the pregnancy foods and behaviors perfectly is not only impossible but destructive. One \"right\" doesn't exist at all. The attempt robs me of the food, the joy, and the wonderful, messy life I have right now.Soon after my miscarriage, we got pregnant again with my amazing, intense now-almost-two-year-old daughter. In November 2021, we had a baby boy who has just started smiling and cooing, even when his sister sticks her fingers in his face. Today I had leftovers of the gorgeous veggie-packed soup I made for dinner, and I ate some stale Twizzlers out of my laptop bag. Both were delicious. They gave my body energy to chase my toddler through the playground as she screamed “yeah, yeah, yeah,” and to make breastmilk to feed my seemingly always hungry baby.Their futures are full of bowls of soup, Twizzlers, and I hope more adventures and deliciousness than I can even begin to imagine for them. I pray they won’t worry when they eat more than one bagel and that they will regard their appetites with a love, joy, and awe that feels blessedly simple.Explore Bon AppétitCultureessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-17", "author": ["Condé Nast", "Hannah Howard"]}