{"id": "f4b3b454633c150ba110dcd9c02a8b65", "url": "https://www.bonappetit.com/story/daily-harvest-dessert-bites", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "These Daily Harvest Dessert Bites Are Like Healthyish Cookie Dough | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Dessert Bites Are Like Healthyish Cookie DoughIf you squint juuust a little.By Amanda ShapiroOctober 25, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!I'm not much of a dessert person, but eat sweets all the time: breakfast pastries, post-lunch chocolate, handfuls of candy corn when the season is right. But when I'm not trying to shoot my blood sugar through the roof, I've been eating Daily Harvest bites.Call me basic, but I love a ball-shaped snack. (Cake pops need not apply.) They're the perfect size for satisfying my sugar craving, and Daily Harvest's bites do so using only naturally sweet ingredients like dates and pumpkin. My favorite flavor is the cacao nib and vanilla, which is sort of like a chocolate chip cookie if you squint, but I prefer to think of it as its own thing. Yes, there are chickpeas. No, it doesn't taste like beans. The hazelnut and chocolate bites are silky smooth thanks to the addition of avocado, and the coconut and lemon version gets some zip from ginger and galangal.All the flavors come in recyclable cups and are meant to be eaten straight from the freezer, though if I can wait, I save mine until it's a little less frozen and a little closer to the texture of cookie dough. It's a two-bite dessert I can get behind, any time of day.—Amanda Shapiro, Healthyish editorBuy it: Daily Harvest Cacao Nib + Vanilla Energy Bites, $7.75All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItShoppingHealthy SnacksRead MoreLifestyleThis Is the Only Jam I Keep on My Condiment ShelfBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-25", "author": ["Condé Nast", "Amanda Shapiro"]}