{"id": "f4b7c8c43cfb68fe9a449ea2181f1b2b", "url": "https://www.bonappetit.com/recipe/garlic-ginger-chicken-with-cilantro-and-mint", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Garlic-Ginger Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueGarlic-Ginger Chicken With Cilantro and MintBy Priya KrishnaNovember 11, 20194.7(75)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintBoth the marinade and the cooking method (low and sort of slow) have a huge payoff: Charred, spicy, juicy chicken that is equally wonderful by itself or rolled up in a roti, taco-style, and served with various salads and chutneys.Excerpted from Indian-ish© 2019 by Priya Krishna with Ritu Krishna. Photography © 2019 by Mackenzie Kelley. Reproduced by permission of Houghton Mifflin Harcourt. All rights reserved.Ingredients4 servings8garlic cloves, finely chopped3Tbsp. fresh lemon juice (from about 1 lemon)2Tbsp. finely chopped fresh ginger3Tbsp. plus 1 tsp. extra-virgin olive oil1Tbsp. finely chopped cilantro leaves, plus more for garnish1Tbsp. finely chopped mint leaves, plus more for garnish1Tbsp. ground coriander (freshly ground is best)1tsp. amchur (dry mango powder)1tsp. ground turmeric¾tsp. kosher salt½tsp. red chili powder4skinless, boneless chicken breasts (½–¾ lb. each)PreparationStep 1Mix garlic, lemon juice, ginger, 3 Tbsp. oil, 1 Tbsp. cilantro, and 1 Tbsp. mint in a medium bowl to form a paste.Step 2Mix coriander, amchur, turmeric, salt, and chili powder in a small bowl. Add spice mixture to garlic-ginger paste and stir well to combine. Transfer marinade to a large resealable bag.Step 3Place chicken breasts in marinade and seal bag tightly. Using your hands, gently massage marinade onto chicken, making sure to evenly coat each breast. Chill 2 hours.Step 4Heat a large skillet over medium-high. Once pan is quite hot, add remaining 1 tsp. oil, swirling pan to coat the entire surface. Reduce heat to medium. Remove chicken from marinade and cook, undisturbed, until lightly golden on one side, 1–2 minutes. Flip chicken and continue to cook until golden brown on the other side, 1–2 more minutes. Reduce heat to low, cover, and cook (without peeking!) 10 minutes. Remove pan from heat and let chicken sit, covered, 10–15 minutes, depending on thickness of the breasts. Don’t uncover, or you’ll release the hot steam that cooks the chicken.Step 5Check to make sure the breasts are cooked through—there shouldn't be any pink in the middle, and if you have an instant-read thermometer, the chicken should register 165°. Transfer chicken to a cutting board and slice into strips. Transfer to a platter. Garnish with cilantro and mint.How would you rate Garlic-Ginger Chicken With Cilantro and Mint?Leave a ReviewTell us what you thinkReviews (41)Back to TopTriangleI love this recipe.  I had to grab a bag of freeze dried mango and crush it for the Anchu.  I used skinless breasts and crushed my spices.  The flavors were perfect and the chicken was flavorful and tender.  I decided to mix it up a little with stir fried veggies with a touch of pad tai sauce and rice noodles   Almost licked the plate..BruceWashington, DC11/21/2021This is a great recipe.  Very easy to make.  I don't ever cook with salt and this recipe's taste is so delicious without it.  I will make this again and again.  I love this.Maggie KingsfordNorthern Ontario, Canada8/14/2021Made this for my family including two 8 year olds.  I had to skip the pepper bc kiddos and could not find amchur powder at my local asian grocer.  That said this is my first attempt at making anything Indian and was feeling intimidated haha.  But easy recipe and well written.  My Indian friend told me not to worry about that amchur that the lemon juice was plenty for acidity as the amchur imparts even more sour taste and this chicken did not need it and I see now that the comments talk a lot about high acidity. So consider leaving out the amchur. It's made from green mangoes not ripe mangoes.  Also my son says it was 'bland' so I will maybe up the salt and consider ways to add some depth to the flavors here. Maybe marinade longer than 2 hours. Will be nice for a summer meal though and I enjoyed it! Sauce is lovely!Natalie M.Silver Spring, Md5/21/2021Absolutely delicious! Added some lemongrass to the marinade too. Definitely acidic, but we paired it with some curried lentils and the flavors mixed wonderfully. A great technique for chicken breast!DarbyMonaco4/18/2021I used boneless skinless thighs as well and it kind of left it with a dry texture but looked moist; hard to describe. I also think I didn’t add enough salt because it had all the flavor elements but was not flavorful somehow? \n\nI’ll try again with breasts next time BobberCalgary3/24/2021This is pretty much the same as Hariyali chicken, no? Except that it's lacking the dried fenugreek (methi) leaves.DonaldNice, France2/20/2021Made as written and served with coconut rice and pineapple salsa -incredible! Thanks Priya. Anonymous1/7/2021I was really hoping this would be as good as described. The marinade has way too much acid in it. I did marinate overnight, so maybe that was it, and I used thighs instead of breasts, so maybe that was it too, but maybe was it acidic. I paired it with a nice South Indian Dahl, but man was the chicken acidic. Eri Lansing, MI1/7/2021Fantastic!  That's ALL That I Need to Say! Yummy!!!        LGT. Lisa Giordano-ThomasPalm Coast, Florida *USA. 11/23/2020I used a different marinade that included lemon, coriander, cumin, ginger, garlic, honey, evoo, s&p. Followed cooking directions as written. The chicken was done to a perfect 160 but had an odd texture - and wasn't dry but not moist either. I will try it with the recipe as written - I like the cooking technique.JoeRockville, MD11/16/2020Hi, can the chicken marinade longer than the two hours?Anonymous10/30/2020Where is the nutritional information?Anonymous10/1/2020Delicious! I made the marinade per the instructions (plus a pulse in the blender because my chopping was a bit too casual) but I used it on skinless thighs, which I then baked. A marinade recipe I will certainly keep!AnonymousNew York9/22/2020I used powdered coriander and found that a tablespoon of it was totally overwhelming- I threw out half the marinade put the rest in a blender with a ripe mango. AnonymousNYC6/22/2020This is an amazing recipe, Priya is right, very juicy and VERY flavorful and I really dislike chicken breasts (I love legs). I am guessing you did not do the recipe right if you think it is not flavorful. \nBut one tip is that it is immensely better with rice or quinoa, it just soaks up some of that flavor and is a perfect balance. If you like Indian food it is addictive. AnonymousSF, CA6/10/2020Explore Bon AppétitIndianSouth AsianAsianChicken BreastChickenPoultryCilantroHerbs & SpicesMintGingerMainGluten-FreeNut-FreeDairy-FreeKetoSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-11", "author": ["Condé Nast", "Priya Krishna"]}