{"id": "f4bc38e7cb258c2e2e7f7700e52260e4", "url": "https://www.bonappetit.com/story/cheesy-cabbage-gratin", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Just Try Not Going Back for Seconds of This Over-the-Top Cheesy Cabbage Gratin | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingJust Try Not Going Back for Seconds of This Over-the-Top Cabbage GratinMelty cheese. Roasty, toasty veg. Shallot-garlic cream…what’s not to love?By Jill BaughmanNovember 12, 2019FacebookTwitterEmailPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailI’m gonna go ahead and put it out there: I really, really love cabbage. Whether in soups and stews or sandwiches and salads, it’s one of my favorite, versatile leafy greens. But for serving a crowd at a holiday dinner as important as, say, Thanksgiving, cabbage is never exactly a contender in the veggie side department. Spinach, sure, a natural go-to. Roasted brussels, yes, obvs. Green beans, very classic. But plain ol’ cabbage? It’s never made the cut at any of my family’s holiday gatherings, other than St. Patrick’s Day. That is, until now...When fellow recipe editor Liesel Davis and I heard Andy Baraghani musing about his recipe ideas for Thanksgiving sides, I immediately perked up when he mentioned cabbage (LD, for the record, is also a big fan). Then I nearly fell out of my chair when he described how he’d prepare it: smothered in a sauce that featured sweet shallots, softened garlic, and lots of heavy cream, topped with not one but two types of cheese (Gruyere and Parmesan), and then bake it all together in one pan to create the richest, most savory gratin ever.When I tested it out at home, I was delighted to find how hands-off it was. First you roast the cabbage in the oven for about 40 minutes, which means the sauce won’t get sogged out by any excess water from the cabbage (which holds a lot of water). While that was happening, I softened the shallots and garlic with the heavy cream, plus some fresh thyme and a little salt and pepper, which took about 20 minutes. And then I puréed the mixture in a blender until it was silky and smooth. All that gets poured over the roasted cabbage wedges, and baked in the oven for about 35 minutes, then cools for another 30 minutes—that’s a full hour of hands-off cooking. I could have stopped at this point and kept it in the fridge for up to a day, or keep going to the final step: Sprinkle the cabbage with grated Gruyere and Parmesan, then broil until the cheese is bubbly and melted and the edges of the cabbage are nicely browned, which took about three minutes in my oven. After garnishing with some fresh thyme leaves, my gorgeous-looking gratin was ready to go.As I watched my friends take their first bites, I recognized the look of surprise, and then utter appreciation of the humble cabbage, taken to new heights. Melty cheese. Roasty, toasty, charred veg. The tasty, thickened sauce coating each crevice. Sure it may sound over the top, but it’s really just perfection. I mean, come on, it’s cabbage! What’s not to love?Get the recipe:Cheesy Cabbage GratinEvery editor who claimed this cheesy gratin would be “too much!” ended up going back for seconds and thirds. We think you’ll do the same.View RecipeExplore Bon AppétitFallWinterThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-12", "author": ["Condé Nast", "Jill Baughman"]}