{"id": "f4cc5e18a3f1db3e33266c69603021f2", "url": "https://www.bonappetit.com/story/toto-toilet", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "How the Toto Toilet Took America by a Quiet Storm | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow the Toto Toilet Took America by a Quiet StormAnd became the ultimate restaurant status symbol.By Priya KrishnaSeptember 19, 2019FacebookTwitterEmailPhoto by ODOFacebookTwitterEmailYou can tell a lot about a restaurant by the state of its bathroom. Wait, have you heard that one before? Or maybe you’ve even thought that as you scanned the room wondering: Is there enough toilet paper? Is the seat clean? Is the soap dispenser full?But the ante has been upped. Restaurants are not only are offering cleaner and well stocked bathrooms, but ones that are also experiences unto themselves, separate from the meal. There might be colorful wallpaper to snap a selfie in front of, Aesop soap you can lather with two greedy pumps, and a playlist loaded with LCD Soundsystem. A probable feature in this new-wave bathroom: a Toto toilet.The Toto has a range of features you never thought your toilet needed: heated seats, a remote control bidet (with adjustments for water pressure), a lid that automatically raises when you enter the bathroom, and a deodorizer that neutralizes any unpleasant scents after your visit. In Japan, where Toto was founded, the Toto brand is the norm in many houses and businesses. In the U.S. it’s lately become an obsession of high-end restaurants both Japanese and non-Japanese. We’ve seen it at N/Naka in Los Angeles, Odo in New York, the Green Pheasant in Nashville, SingleThread Farms in Healdsburg, CA, and Maison Yaki in Brooklyn. In these restaurants, it has become an integral part of providing high-level hospitality, born from a desire to indulge in the bathroom experience rather than treat it as a reluctant, practical necessity.In 1917, Kazuchika Okura founded the Toto company, though its fancy technology didn’t come until 1980, when the brand introduced the “washlet,” a toilet that offered an electronic bidet and a heated seat. By the late ’80s these mechanized toilets had become a cultural phenomenon in Japan, a perfect fit for the country’s hyper-organized, technology-obsessed society, in which a long bath is a nightly activity. Toto toilets became commonplace, even in shopping centers and schools.In 1990, Toto toilets made it to the U.S. The company thought they would be an intriguing novelty to American consumers, explains Bill Strang, the president of operations at Toto USA. These days the U.S. makes up 8 to 9 percent of Toto’s global business. The majority of sales are to homes and hotels, Strang says, but restaurants are one of the most important markets: That’s where most customers first encounter the warm embrace of a Toto toilet seat.The earliest adopters in the U.S., as you might guess, were Japanese restaurants. Sakagura, a restaurant in New York, has been using Toto toilets since it opened in 1996. With a company motto that states, “Enjoy Japan without the airfare,” owner Bon Yagi says he felt a Toto toilet was essential. “It was only natural for our restaurant group to extend our ‘Japan experience’ in the bathroom as well.”It’s worth mentioning that these toilets aren’t cheap. The higher-end models can run you $13,000 (they include “bacteria-neutralizing ultraviolet light” and a “titanium dioxide–fired toilet bowl”). In a business where owners are operating on razor-thin margins, a Toto is an investment. But its restaurateur adherents say it is worth the cost.“We have a small restaurant with no crazy artwork on the wall or ten-thousand-dollar chairs,” says Will Aghajanian, an owner of the tasting menu restaurant, the Catbird Seat, in Nashville. He thought the Toto would leave a more personal impression in a city where every restaurant seems to have “the same bathroom with the Aesop soap stuck on the wall,” he says. “It is weird to talk about toilets, but these are just luxurious.”Satoru Yasumatsu, a partner at Japanese restaurant Odo, says he and many Japanese people “cannot live without a Toto toilet.”“In Japan everywhere is clean, like the streets and inside buildings,” he says. “This is especially true for restaurants. If the bathroom is dirty, the entire dining experience is ruined.”“Japanese people are always trying to consider an overall feeling,” says Niki Nakayama, the chef and owner of N/Naka. Her restaurant has two Toto toilets, the model with the seat that automatically opens and closes as if by premonition, and Nakayama also has them installed in her home. “When Toto toilets were introduced, it felt like a discreet way to show a sign of respect and comfort.”Every chef and restaurateur I talked to said guests go out of their way to comment on the toilet during or after their meal. Most are positive. Some get confused with all the buttons and options. Aghajanian and Nakayama have had instances where people forget to turn off the bidet, causing a miniature water show. But the general feedback harkens back to the reason this toilet became such a sensation in the first place: After using a Toto, why would I conduct my business anywhere else?“I am always a little bit thrilled by a Toto,” says Hannah Goldfield, the food critic for the New Yorker, “especially if the seat is heated and it is cold outside.”She almost never mentions the bathroom in a review, but she made an exception in a devastating write-up of the restaurant Zauo, where diners fish for their dinner: “If Zauo has one redeeming quality, besides a cheerful and accommodating staff, it’s the bathrooms. There are water tanks here, too—atop beautiful Toto toilets, with blissfully heated seats.”A Toto may never become the norm for American restaurants in the way that it is in Japan. It’s harder for restaurateurs here to justify spending their limited capital on an expensive single product that’s not directly related to the food.But for those who are lucky enough to encounter one: welcome to your new life, where the toilet seats are always warm and the bidet is perfectly pressured. Just be prepared for an extra long wait in line for the bathroom.Explore Bon AppétitHot 10 2019RestaurantsTrendsRead MorerestaurantsThis Restaurant Stocks Their Bathroom with Homemade Altoids (And They're Amazing)By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-19", "author": ["Condé Nast", "Priya Krishna"]}