{"id": "f4ce1efb447bc1b93d8d9a6b67058747", "url": "https://www.bonappetit.com/story/virtual-doula", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "A Virtual Doula Shares What It's Like to Facilitate a Birth During COVID-19 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureWhat It's Like to Be a Doula Helping People Give Birth Over FaceTimeAs hospitals limit visitors, doulas like Erica Chidi Cohen are FaceTiming into delivery rooms.By Erica Chidi CohenMay 6, 2020FacebookTwitterEmailPhoto by Julia CheskyFacebookTwitterEmailIn recent weeks, hospitals have limited delivery room visitors to prevent the spread of COVID-19, prompting pregnant people and their support systems to find creative solutions. Here Erica Chidi Cohen, a doula and the co-founder of wellbeing brand LOOM, talks about what it’s like to facilitate a socially distanced birth.I started working with Diana and Jason last summer—they were the last clients I took on as a doula before moving on to focus on LOOM in its entirety. When we started working together, I had no idea that Diana’s delivery would end up happening in the middle of a pandemic. I thought I was going to be doing my usual thing, laboring with them at home in the early stages then going to the hospital with them. Obviously, that didn’t happen.My mom is a nurse and my dad is an infectious disease specialist—I grew up in South Africa while my dad was doing HIV/AIDS research there— so I’m very acquainted with herd immunity, viruses, and disease. I think having that exposure to pandemic at an early point in my life made me very open to making the transition to virtual services. As a doula and as a CEO, I’m always thinking about the action plan.A pregnant person might see a couple of different providers depending where they get care, so a doula is supposed to be a source of support that doesn’t change. We also help educate our clients on what to expect during labor and help them self-advocate. When the pandemic began, I had to ask myself, How do I continue to be continuously there? How can I continue to educate and help them prepare to advocate for themselves?I knew I couldn't help with massage or physically motivating her to get up and move around to better manage the contractions, but I thought if they’re open to having me on FaceTime and in constant communication over text, I’ll still be there.Instagram contentThis content can also be viewed on the site it originates from.They knew they could call me at any time, and we were in touch from the time their delivery took off until the baby was delivered. Of course it felt hard to not be there for them physically, but I loved being able to answer their call any time they had a question and give them my energy. Unfortunately, the hospital had rules that meant Jason wasn't able to be with Diana for her postpartum recovery, so I FaceTimed with Diana then too. Although I wasn’t in the room, I definitely felt a similar energy, and I think they both felt really supported as well.When they got home from the hospital, I went over to see them and the baby. They have an old craftsman home with a big window in the front, so I stood there and looked through it. I put on my Airpods and they put their phone on speaker and we made an intercom to connect.I’m always a pragmatist or an optimist, so when I could see them through the window I was like, This is so great. At least I can see you. We touch base at least twice a week to see how she’s doing, how the feeding is going, and how they’re all acclimating.There’s a lot of uncertainty when it comes to what’s going to happen next and where we are going in this pandemic, but our ability to be of service and help people can have so much ingenuity. Digital health and wellbeing is going to be so important as we navigate the rest of this pandemic for the next few years, whether you’re taking a Zoom yoga class or talking to your therapist through a phone call. I truly believe human behavior is irrevocably changed and the threshold for what we are comfortable doing in person is going to be very low, so we will all be doing more things virtually.In the end, I think this experience was a reminder that support can continue in different ways. The first birth I ever did was with a woman who had this incredible unmedicated birth experience where she mostly birthed in silence; my last birth was in a pandemic. It was a bizarre, tender, and fortifying way to end my decade-long doula career.As told to Aliza AbarbanelExplore Bon AppétitHealthyishSelf CareessayRead MorecultureWhat It's Like to Be Single and 8 Months Pregnant in IsolationBy Alexandra Marzella, as told to Emily Sundberg Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-06", "author": ["Condé Nast", "Erica Chidi Cohen"]}