{"id": "f4dfdce158512d9c76cc7c56a1ad7198", "url": "https://www.bonappetit.com/story/happy-hour-with-al-campari-cocktails", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "3 Campari Cocktails You Don't Need a Gazillion Ingredients to Make | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking3 Campari Cocktails You Don't Need a Gazillion Ingredients to MakeHope you’re thirsty! Introducing Happy Hour with Al, Basically’s new no-nonsense cocktail column.By Al CullitonMarch 7, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically's resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.Have we met? Because I think I know you. You want to figure out how to make nice cocktails at home for you and your friends. You don’t want to spend a ton of money, or buy a ton of weird ingredients just to make one drink, or end up stuck with a bunch of random bottles you’ll never use again. Well, you’re in the right place. Because in this column, I’m going to show you how you can turn three essential bottles of liquor and a handful of bodega staples into three delicious, distinctly different—and easy to make!—cocktails, so you’re set up for a whole weekend of fun, confident home bartending.We’re going to kick things off with some Campari cocktails. Ah, Campari: brilliant red, bitter ambrosia. You’ve seen it before. You’ve probably even had it. Maybe in a Negroni? Or a spritz? It looks really great in just about any setting, and tastes even better. We’re going to learn how to make three pre-war classics with it: the aforementioned Negroni, the Americano, and the Milano-Torino.But let’s back up for a second. What is Campari, anyway? Well, it’s one of Italy’s most iconic aperitivos—a word that refers to both a range of bitter liqueurs and aromatized wines as well as the pre-dinner hours in which they are habitually consumed—and was formulated in 1860 by a fellow from Novara named Gaspare Campari. (Save that fun fact for your next dinner party.) The 19th century was a hot time for aperitivos like Campari, many of which were originally created by monasteries and then by pharmacies—you know, for health purposes. It’s incredibly bitter, like old time-y medicine should be, but that astringency gives way to a really appealing citrusy sweetness. Okay, let’s get to it!Hit the liquor store, hit the bodega, and you’re good to go.\nPhoto by Chelsie CraigYour Shopping List:1 750-ml bottle Campari1 750-ml bottle gin (nothing fancy; Gordon’s or Beefeater will work great)1 750-ml bottle sweet vermouth (don’t skimp on vermouth; spring for something like Carpano Antica or Cocchi di Torino if you can)Club soda or seltzer2 oranges3 lemonsIcePhoto by Chelsie CraigThe NegroniUp first: the king of Campari cocktails. The Negroni has gained a lot of traction in recent years, and it is completely deserved. With a handsome equal-parts structure, this triad of gin, Campari, and sweet vermouth is nearly impossible to screw up. (But if you do, it’ll probably be delicious anyway.) It’s supremely balanced between the boozy, the bitter, and the sweet, with a beautifully silky texture that’s as appealing in hot weather as it is in cold.If you want to do it up proper, get a mixing glass out. (If you’ve got a pint glass, that will do!) Pour in 1 oz. each Campari, sweet vermouth, and gin. Fill your mixing glass with ice and stir for a good 15 seconds. Presentation-wise, you’ve got two options. You can strain your Negroni into a rocks glass filled with fresh ice for a longer-drinking, slightly more refreshing drink—it’s ideal for porch sipping. In winter, though, it can be nice to get fancy and strain it into a coupe or other stemmed glass, sans ice, or “up.”Almost done! It wouldn’t be a Negroni without an orange peel garnish—that peel is full of aromatic oils that will seriously enhance your cocktail drinking experience. Use a vegetable peeler to cut a wide piece of orange peel, avoiding the pith, or white stuff, as much as you can. Squeeze the oils out of the peel and onto the drink by pinching it between your thumbs, fore- and middle-fingers, peel side out, over the glass. (Both hands!) You should be able to see the oil droplets hitting the surface of your drink. Then drag the peel around the rim of the glass, twist it into a nice shape, toss it in the glass and serve. Yeah, you just did that! The thing that bartenders do! It’s not actually hard, and makes your drink look and taste like a million bucks. Cool, huh?(Oh, and if you don’t want to do the whole stirring-and-straining thing, that’s okay. You can “build” the drink in a rocks glass, i.e. pour all of the ingredients over ice, give it a stir, and call it a day. The nice thing about stirring in a mixing glass is that you get consistent dilution—extra important when you’re serving it up—and it’s super-cold and silky from the first sip. Worth it, but not essential.)Nerd Corner: The drink is supposedly named after one Count Camillo Negroni, who ordered an “Americano, with a bit of a kick” from a barman at Florence’s Caffè Casoni in 1919. I hate to imagine where we’d be if he hadn’t. Speaking of an Americano...Photo by Chelsie CraigThe AmericanoIt’s on to drink number two! The Americano is fizzy and low enough in alcohol that you can throw back two or three in a sitting without falling off your chair. It’s ideal for when you want to feel like you’re lounging out on some cobblestoned piazza, laughing with friends, even though you’re actually drinking in the kitchen by yourself.Take a tall glass, like a highball or Collins, and fill it with ice. Pour in ¾ oz. Campari and 1 oz. sweet vermouth. Top with club soda or seltzer. Garnish with a lemon peel using the technique we just learned; maybe throw in a nice-looking (i.e. non-plastic) straw.A little more history: It’s called “The Americano“ because it was a favorite of boozing American expats and tourists during Prohibition. (Also, for all you 007 fans out there, it’s the first drink ordered by the man himself in Casino Royale, Ian Fleming’s very first Bond book.)Photo by Chelsie CraigThe Milano-TorinoThis last drink is super easy, and has the unassuming coolness of a well-dressed grandpa. The Milano-Torino is kind of like an Italian Rusty Nail—a cocktail made with Scotch whiskey and a sweet, herbaceous Scottish liqueur called Drambuie—but is brighter and lower octane. And you build it straight in the glass you’re drinking it out of like any good old man drink. Measure out ¾ oz. Campari and pour it into a small rocks glass full of ice. Then do the same with 2½ oz. of sweet vermouth. Stir well and garnish with both a lemon peel and an orange peel.What’s that? That seems like a LOT of vermouth? It’s not. Vermouth is terribly misunderstood. It’s actually delicious, and the reason people think they don’t like it is because most have been using the same old, dusty bottle of cheap vermouth they’ve had for years. It’s made from wine, and it’s perishable! Which means you should always store it in the fridge, and ideally use it within a month. How the hell are you supposed to go through that much vermouth in a month, you ask? Make more Milano-Torinos, obviously!And there you have it, folks: three Campari cocktails you can make with a mere three bottles of liquor. Go forth and make Negronis! Be Italian grandpas! Mix, drink, and be merry!Al Culliton is a bartender and writer working in New York City. She is the general manager of the beloved Red Hook bar and restaurant Fort Defiance. Al loves poring over menus and cocktail books from bygone eras, visiting the New English countryside, and cooking for her partner at their home in Brooklyn.Looking to upgrade your bar gear? We've got you covered:All the Gear You Need to Make Killer Cocktails at HomeYou need more than just a shaker—but not that much more. Here's our list of essential cocktail gear.View StoryExplore Bon AppétitCampariGinVermouthCocktailBasicallyHappy Hour with AlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-08", "author": ["Condé Nast", "Al Culliton"]}