{"id": "f4e6d218732187c811cbeb9571be7071", "url": "https://www.bonappetit.com/recipe/cilantro-pisco-smash", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Cilantro Pisco Smash Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueCilantro Pisco SmashBy Danielle Bell and Pablo OsorioJanuary 4, 20224.2(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Caroline Hwang, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThis cilantro pisco smash is inspired by Malina Bickford’s lovage aquavit smash, but here the Scandinavian spirit is swapped out for Peru’s iconic pisco. Aromatic, herbal, and subtly sweet, it pairs well with cilantro for a bit of freshness.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSmall Saucepan$155 At AmazonCocktail Shaker$20 At AmazonCocktail Muddler$13 At AmazonHawthorne Strainer$7 At Amazon1.25\" Silicone Ice Cube Tray$15 At AmazonIngredientsMakes 2½cup sugar3Tbsp. cilantro leaves with tender stems, plus more for serving2Tbsp. fresh lemon juice1Tbsp. fresh lime juice6Tbsp. Peruvian piscoPreparationStep 1Bring sugar and ½ cup water to a boil in a small saucepan, stirring until sugar is dissolved. Remove from heat and let simple syrup cool.Step 2Muddle 3 Tbsp. cilantro with lemon juice and lime juice in a cocktail shaker. Add pisco and 2 Tbsp. simple syrup. Fill shaker with ice and shake until well chilled, about 30 seconds. Strain into 2 rocks glasses filled with ice. Garnish with cilantro.Do Ahead: Simple syrup can be made 3 weeks ahead. Transfer to an airtight container; cover and chill.How would you rate Cilantro Pisco Smash?Leave a ReviewTell us what you thinkReviews (1)Back to TopTrianglePerfect for taco night, we never use up a whole bunch of cilantro. Refreshing cocktail! I don't even like cilantro and I liked this cocktail, the cilantro added a nice grassy element without being too forward.KaitlinChicago1/24/2022Explore Bon AppétitDrinksCocktailDrinks AllPiscoAlcohol & Other DrinksCilantroHerbs & SpicesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Danielle Bell", "Pablo Osorio"]}