{"id": "f4e724a907692c830fd14d49dcb0c3f5", "url": "https://www.bonappetit.com/recipe/apple-rose-pie", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Apple-Rose Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueApple-Rose PieBy Cheryl DayOctober 19, 20214.3(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Christopher Testani, Food styling by Victoria Granof, prop styling by Alex BrannianEmailPinterestPrintEmailPinterestPrintThis floral take on a classic apple pie from Back in the Day Bakery owner Cheryl Day may be new to many, but the use of rose water here is rooted in American history. “Before vanilla extract was widely available, the most popular flavoring in America was rose water,” Day writes in her newest cookbook, Cheryl Day’s Treasury of Southern Baking. “This recipe brings the lovely taste of rose water back to apple pie.” Plan to mix the filling at least 4 hours ahead so the accumulated juices can be reduced before you assemble and bake the pie. While the pie pictured has a layered top crust to create a floral effect, here we call for a simple rolled-out top crust with a few vents, which does the job nicely.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron9\"-Diameter Deep Pie Dish$22 At AmazonElectric Mixer$40 At AmazonRound Cookie Cutter Set, 12-Pack$12 At AmazonBench Scraper$8 At AmazonVegetable Peeler$10 At AmazonAutumn Carpenter Pastry Rulers, Set of 6$20 At Kitchen JukeboxScale$25 At AmazonPastry Brush$9 At AmazonHeatproof Measuring Cup$18 At AmazonSieve$18 At AmazonSmall Saucepan$155 At AmazonIngredients8 ServingsDough1Tbsp. apple cider vinegar2½cups (313 g) all-purpose flour1Tbsp. granulated sugar2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt1tsp. baking powder1cup (2 sticks) chilled unsalted butter, cut into piecesFilling and assembly3lb. firm baking apples (such as Pink Lady or Granny Smith; about 6), peeled, cored, thinly sliced¼cup (50 g) granulated sugar¼cup (packed; 50 g) light brown sugar2Tbsp. unsalted butter, cut into ½\" pieces1Tbsp. fresh lemon juice2tsp. ground cinnamon¼tsp. freshly grated nutmeg¼tsp. ground cardamom1tsp. Diamond Crystal or ½ tsp. Morton kosher salt2Tbsp. all-purpose flour, plus more for surface1½tsp. rose water, divided2Tbsp. plus 1 cup heavy cream, divided2Tbsp. powdered sugarspecial equipmentA mini cookie cutterPreparationDoughStep 1Combine vinegar and ½ cup cold water in a measuring glass. Whisk flour, sugar, salt, and baking powder in a large bowl. Add butter and toss to coat. Working quickly and using a pastry blender or 2 butter knives, cut butter into flour to create large shaggy pieces of dough (you want some pea-size pieces of butter and some that are large and chunky). Drizzle half of the vinegar mixture over; stir with a fork until dough starts to come together (it should look a little dry, but add remaining vinegar mixture by the tablespoonful if needed).Step 2Transfer dough to a surface; gather into a ball. Using the heel of your hand, smear dough across surface by a full arm’s length to flatten. Using a bench scraper, gather back into a ball. Smear and regather 2 more times. Cut dough in half. Wrap each piece tightly in plastic; flatten into a disk. Chill until firm, at least 1 hour.Do ahead: Dough can be made 1 week ahead. Keep chilled or freeze up to 1 month. If frozen, thaw overnight in refrigerator before using.Filling and assemblyStep 3Toss apples, granulated sugar, brown sugar, butter, lemon juice, cinnamon, nutmeg, cardamom, salt, 2 Tbsp. flour, and 1 tsp. rose water in a large bowl until evenly coated. Cover and chill at least 4 hours or up to 12 hours.Step 4Drain apples in a sieve set over a small saucepan; transfer apples back to bowl. Bring liquid to a boil over medium heat and cook until thickened, about 4 minutes. Pour sauce over apples; toss to combine.Step 5Let dough sit at room temperature 5 minutes, then roll out 1 disk of dough on a lightly floured surface to a 12\" round. Transfer to a standard 9\"-diameter pie dish, then lift edges and allow dough to slump down into dish. Trim, leaving about a ½\" overhang; chill while you roll out remaining dough disk to a 10\" round. Using cookie cutter, punch out 4–8 vents in second round. Spoon apple filling, including any juices, into pie dish. Place second dough round over filling. Trim, leaving a 1\" overhang. Press crusts together and fold over to seal. Crimp edges; decorate with cutout dough pieces as desired. Chill pie in freezer 20 minutes.Step 6Meanwhile, place a rack in lower third of oven and preheat to 400°.Step 7Place pie on a parchment-lined rimmed baking sheet; brush crust with 2 Tbsp. cream. Bake 20 minutes. Reduce oven temperature to 375° and continue to bake until crust is deep golden brown and juices are thick and bubbling, 60–80 minutes longer. Transfer pie to a wire rack and let cool at least 3 hours.Step 8Using an electric mixer on medium-high speed, beat powdered sugar, remaining 1 cup cream, and remaining ½ tsp. rose water in a small bowl until cream begins to thicken. Reduce speed to medium and beat until soft peaks form.Step 9Serve slices of pie with whipped cream.Do ahead: Pie can be baked 1 day ahead. Store loosely covered at room temperature.Recipes adapted with permission from ‘Cheryl Day’s Treasury of Southern Baking’ by Cheryl Day (Artisan Books). Copyright © 2021.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Apple-Rose Pie?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleLoved this recipe. The rose water created a light sweetness, subtle and present. The crust recipe reminded me of being 8 and learning how to make pie crust with my grandma, knives and rubbing and no quick fixes. It was so supple and easy to work with. \n\nA couple tweaks: \nI didn’t end up with much juice after 10 hours of sitting so I added juice of 1 lemon, tsp of rose water and few squirts of honey to the juices to cook down. It resulted in a very bright syrup and very concentrated flavor. I would definetely repeat.\n\nI did a half dairy/half plant based butter for the crust (Miyokis cultured cashew butter). Again, texture, flavor, visuals were all spot on.\n\nProbably blasphemy here, but I used half brown sugar swerve after half coconut sugar to reduce overall sugar intake and glycemic load.\n\nThe comments I got from the pie were all rave. Thank you for this recipe!! AnonymousPortland, OR11/27/2021See Julia Child, Jeanne. Vol. 1, p. 141.  \"Fraisagea'Frank/BallNew York, NY11/16/2021That‘s the most ridiculous way to make pie crust that I‘ve ever seen. All that smearing results in too much handling and a tough crust.  I might make it again using my own crust recipe.\nJeanneIdaho11/12/2021Explore Bon AppétitDessertPieapple pieAppleFruitRose WaterAlcohol & Other DrinksBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Cheryl Day"]}