{"id": "f4eb8459c4015a37ec355df1d55bdb04", "url": "https://www.bonappetit.com/story/demi-group-chats", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "This New Chat Line Lets You Text Your Favorite Chefs For Cooking Advice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis New Chat Line Lets You Text Your Favorite Chefs For Cooking AdviceAs private messaging platforms come up against social media, DEMI brings cooking wisdom out of the DMs and into the group thread.By Aliza AbarbanelMarch 3, 2021FacebookTwitterEmailCaramelized ricotta blintzes with rhubarb compote.Photograph by Felicity SpectorFacebookTwitterEmailDispatching from the Oregon coast...Pulled in 4 Dungeness crabs. @Lucas Sin, seeking your fave crab ideas 2x ways.The message from Portland culinary producer Liz Calderón popped up on my phone beneath photographic evidence: four hefty crabs on a weathered dock, plus a sunny seascape that set my very cold New-York-in-February soul ablaze with envy. Instantly, my screen lit up with a small riot of flame and crab emojis. Once summoned, Lucas Sin, chef of mini fast casual chains Junzi Kitchen and Nice Day Chinese Takeout, fired back a loose formula for ginger-scallion crab stir-fry. Several hours later a photo arrived: A neat pile of crab legs with aromatic butter, fortified with “1 loose packet of grocery store sushi soy sauce.”If the state of my phone is any indication, the days of social distancing have sparked a group chat renaissance—but this exuberant WhatsApp chat is something entirely new. The “community” is a prototype from DEMI, a pandemic-era startup that cuts out the middleman (in this case, social media) and helps food professionals grow and connect with audiences directly.Founded by Ian Moore, the former chief operations officer of Copenhagen-based distillery Empirical Spirits, the app is part of a larger shift from social media to private online communities like Clubhouse and closed Discord servers. Users pay $10 a month per group chat, and for now it all goes straight to the hosts. The growing roster includes Sin, pastry chef Natasha Pickowicz, Italian food writer Katie Parla, APÉRITIF author Rebekah Peppler, and Peoples Wine managing partner Daryl Nuhn. “I want to build a sustainable business within food,” says Moore. “We want to show that chefs deserve to get paid more for their hard work, passion, and knowledge.”Like Substack, Pateron, and other popular hosting platforms for subscription-based content, DEMI plans to start collecting a yet-to-be-determined percentage of profits with the launch of its app in the next two months—if development stays on schedule. It’ll launch with an ambitious roster of a hundred hosts, from Sean Sherman of The Sioux Chef to Diaspora Co founder Sana Javeri Kadri, with updated features like a section to store shared recipes and a pared-down notification system to lighten the barrage of message alerts.For DEMI’s food-world hosts, the group chat is another side hustle in a year of reinventions necessitated by COVID-19’s destructive impact on the restaurant industry. According to the National Restaurant Association, over 100,000 eating and drinking establishments closed in 2020, eliminating almost 2.5 million jobs. In response, hospitality professionals—especially those with followings online—are launching recipe newsletters and pop-ups, searching for new ways to connect with their communities and turn a profit in the process.“Like a lot of restaurant people, I’m cobbling together this freelance life by developing recipes, writing stories, and getting involved with campaigns that fit my perspective,” says Pickowicz, who lost her job as the pastry chef for New York's acclaimed Café Altro Paradiso and Flora Bar last June. She views DEMI as a way to break free from the “hegemony of social media” with a format that requires less bandwidth than setting up a Patreon. “I don't want to be in someone’s in-box,” she says. “I like the conversational aspect of the chat. I’m more interested in knowing who Sarah or Sally are, thinking about the people who read it and what their lives are like.”DEMI’s conversational core provides fertile ground for experimentation. As a reporter I got a free pass for both Pickowicz’s Never Ending Salon and Sin’s Chinese-ish Cooking Club, which immediately felt distinct. Pickowicz conducts weekly recipe exchanges with guest hosts from the wide world of pastry, who often stick around to dispense wisdom. Sin drops niche Youtube links, advice on ordering at Cantonese restaurants, and loose recipes for everything from mapo tofu lasagna to superior broth simmered with chicken bones, pork bones, and jinhua ham. The similarities lie in the collaborative, refreshingly casual chat; a space for everyone to geek out about food without having to worry about likes, perfect lighting, or other measurements of clout.In the era of Substack and OnlyFans, DEMI’s bet—that people will pay for increased access to food-world personalities—is a good one. But for the hosts themselves, the big draw is the like-minded community of industry professionals and enthusiastic home cooks that follow them. Where besides Sin’s Chinese-sh Cooking Club could you find three Ph.D. candidates independently writing a dissertation on ketchup?“My hope is to cultivate a more democratic, flat, open space to talk about Chinese food because my deeply personal, very biased opinion is that a better understanding of Chinese food will make for a better world,”  Sin says. “It felt like an extension of what I was doing in my Instagram DMs, which was conversing with a group of dedicated, interesting people who care about Chinese food.”Despite DEMI’s stance as a social media alternative, the two platforms are interwoven.Moore says the team scouted hosts based on their social presence, prioritizing creative storytelling and community building. There is no prerequisite for the hosts to have a certain size following or promote their chat on Instagram, but high engagement is an advantage: Each host (whose followings currently range from 11K–198K) advertises their community on Instagram, creating a clear pipeline from followers to DEMI members.Sin, who started an Instagram account only last March after the pandemic hit, says that DEMI’s closed, collaborative community takes the pressure off, allowing him to start conversations on topics like healthy eating that he’d never raise on social media. “When you post on a one-directional platform, like Instagram, people presume you're an expert in the field,” he says. “Here I can be curious and ask questions.”DEMI has a low-stakes vibe, thanks to the inherently closed nature of subscription-based content. Instagram is free to join and users can follow whomever as long as they have a public profile; DEMI’s hosts are handpicked and each community has an entrance fee. Two of the communities—Peppler’s CLUB APÉRO and Peoples Wine Social Club—currently offer free membership for BIPOC folks, and Pickowicz and Sin both donate a portion of their monthly proceeds to organizations promoting equity in the food industry.Ultimately, engaging with an intimate online community is a privilege that can only exist because of exclusivity. It’s hard to imagine DEMI’s magic working in a group chat of thousands, and it would be foolish to pretend self-selecting communities are a cure for all of social media’s ailments. But watching creators attempt to game Instagram’s increasingly opaque algorithm to reach their audience doesn’t exactly feel democratic either. To me these chats offer a third space between public and private, a glimpse into lives both very similar and very different from my own.When households across Texas lost power for days (or more) in February, my Brooklyn-heavy Instagram feed brimmed over with mutual aid posts—and then went quiet. But Chinese-ish Cooking Club started trading tips for flushing toilets with pool water, conserving phone batteries, and, yes, cooking amid rolling blackouts and water shutdowns. Photos appeared: golden fried rice gleaned from emptied-out supermarket shelves, curry and roti illuminated only by Barack and Michelle Obama votive candles. It was the kind of food that rarely gets documented on social media. I couldn’t look away.Explore Bon AppétitCooking TipsHealthyishTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-03", "author": ["Condé Nast", "Aliza Abarbanel"]}