{"id": "f4fd2167290c64e9d5b1001b3bfb488f", "url": "https://www.bonappetit.com/story/these-kreplach-are-my-bubbes-greatest-culinary-legacy", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "These Jewish Kreplach Are My Bubbe's Greatest Culinary Legacy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Oniony, Meat-Filled Dumplings Are My Bubbe's Greatest Culinary LegacySimmer kreplach in broth or crisp them and serve with mustard.By Hannah SelingerFebruary 16, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I wish I could report that these dumplings were part of my personal familial lore (and, to hear my mother tell it, they are). The recipe belonged to my bubbe, Molly, who passed away in the summer of 2017, but I don’t remember them. Instead, the culinary legacies of hers that I recall are sky-high lemon meringue pie, cranberry sauce, and, of course, tzimmes, a dish of simmered sweet potato and carrot that—with deep apologies to my ancestors—I never could stand.When people think of dumplings, they may not immediately think of the food of my people, Jewish-American immigrants who have embraced a cultural mishmash of Eastern European tradition and food, wrapped up in an American retelling. But dumplings are part of our story, too. My bubbe called them kreplach, and she stuffed them with oniony ground meat. How they’re served depends largely on the moment. They can arrive in a bowl of hot chicken soup, or crispy from the oven, or even fried in hot oil. Like other varieties of dumplings, they are, at their core, a flexible comfort food, made from excess ingredients and access: Here is all that we have, these dumplings say.Though I have no memories of her kreplach, when my mother dusted off the recipe for the Jewish high holidays this year, it occurred to me that this particular food is exactly the kind of recipe I search for when I’m stumbling to set the world straight. A dumpling has that sort of rousing power.The recipe my mother sent, through no fault of her own, is unintelligible. My grandmother cooked through intuition, and her transcriptions were loose, and the notes she passed down were only a recitation of ingredients. The rest she left for us to figure out on our own. I have learned, through trial-and-error, to make this interpretation of my bubbe’s recipe, altering her filling, originally made only from ground beef, eggs, and salt.To make kreplach (this recipe makes about 30), combine 2 ½ cups flour, 2 large beaten eggs, and ½ cup warm water until a dough forms. Knead the dough vigorously until it forms a ball that is not sticky to the touch, 3–5 minutes, and cover with a moist towel while you prepare the filling. For the filling, combine 1 pound ground beef, ½ onion, finely chopped, ½ teaspoon Worcestershire sauce, ¼ teaspoon granulated garlic, ¾ teaspoon kosher salt, and 1 lightly beaten egg. Mix until integrated.Separate the dough into two balls and then roll each ball out on a lightly floured board to ¼\" thick (if you intend to cook them in the oven, keep the dough slightly thicker). Cut with a pizza wheel into 3-inch squares. Fill each square with a spoonful of the meat mixture and fold it into a triangle, then wet the edges lightly with water and pinch closed to seal (you might need to use a little flour here to assist you).Part of the magic of kreplach is that they can be served however you happen to need them: gently simmered, like wontons in broth, or crispy (and, as my mother would have them, accompanied by a jar of nasal passage-clearing Ba Tempte mustard). Drop each dumpling into a pot of salted, boiling water and simmer for 15 minutes. If you plan on using your kreplach in soup, transfer immediately to hot chicken broth. To crisp them, transfer to a strainer after boiling for 30 minutes and then place in a shallow, greased pan and bake at 350° for 30–45 minutes, until golden.I hope that Molly will forgive me, for filling in the blank spaces of her recipe. This is a conversation with an ancestor who has moved on to a place, I hope, that is filled with dumplings, and with other such corporeal comforts. While the kreplach that live on in my kitchen are a version of the ones I can’t actually recall, I know a lineage binds me and Molly, a genetic tie of flour, water, and the perfect comfort of a Jewish dumpling.Hannah Selinger’s IACP award-nominated work has appeared in the New York Times, Eater, the Wall Street Journal, the Washington Post, The Cut, Wine Enthusiast, and elsewhere.Explore Bon AppétitIt's That SimpleJewishDumplingsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-16", "author": ["Condé Nast", "Hannah Selinger"]}