{"id": "f502a842b078deb463de79c873cd903d", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/relae", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Relæ Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenRelæLive a little with the Nørrebro tasting-menu restaurant that’s still making wavesFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: because OG Noma chef Christian F. Puglisi was one of the first to strike out on his own—and he’s been the most successful by far. (He’s behind favorites Manfreds, Bæst, and Mirabelle.) His tasting-menu restaurant has set the bar for countless ambitious young chefs around the world—and not just with its leather aprons and silverware drawers but due to Puglisi’s approach to in-the-moment seasonal local cuisine that’s both careful and extreme.ORDER THE: tasting menu with wine pairings, all the way. (The three-course one, if you’re pressed for time. But really?) Here, Puglisi conjures dishes that push the limits of flavor, like dried yellow beet sashimi with elderflower. If you’re the kind of person who doesn’t like to fill up on the bread, develop temporary amnesia: Puglisi’s sourdough is among the world’s best.THE VIBE IS: reverent but cool. Maybe it’s because of all that natural wine being poured. You’ll find visiting chefs, local creatives, and dignified gastronauts from around the world in the lo-fi brick-and-wood room and perched at the kitchen counter.PRACTICAL STUFF: Open for dinner Tuesday to Saturday, from 5 p.m. to midnight, and lunch Friday and Saturday, from noon to 3 p.m. Closed Sunday and Monday. Be sure to book ahead.—Christine MuhlkePhoto by Ditte IsagerWE ALSO LOVEBæstPizza perfected in Inner NørrebroMirabellePlan a mini croissant- and yogurt-filled vacation at this café-like spot in NørreboroManfredsThe still boundary-pushing, still neighborhood-y restaurant in Outer NørrebroExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}