{"id": "f5041d5d9133016630cfe73f4c6ae5b8", "url": "https://www.bonappetit.com/story/4-ingredient-kimchi-vinaigrette", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "This 4-Ingredient Kimchi Vinaigrette Can Do It All | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis 4-Ingredient Kimchi Vinaigrette Can Do It AllAnd two of the ingredients are optional, TBH.By Amiel StanekJune 17, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeFacebookTwitterEmailMaximum flavor, minimal effort. For most of us, that’s the Holy Grail of weeknight cooking—we want something that tastes like it took hours upon hours to make without having to spend, you know, hours and hours making it. And if you ask me, the simplest and most delicious way of achieving this feat is to make liberal use of fermented things, which have spent weeks or even years developing layers upon layers of flavor and are ready to be deployed at the drop of a hat. Case in point: the umami-packed kimchi vinaigrette used in this super crunchy chopped salad recipe, courtesy of chef Lauren Schaefer at Kitty’s Market in Hudson, NY. (Full disclosure: I am married to the chef.)This kimchi vinaigrette is about as easy to make as a smoothie. All you have to do is put a goodly amount of quality Napa cabbage kimchi—look for a brand that lists some kind of seafood, like shrimp, oyster, or anchovies, in the ingredients—into a blender and buzz it up with some neutral oil until it’s fluffy and emulsified, adding a bit of water to thin it out and a splash of rice vinegar and/or fish sauce to taste. That’s it! A maximum of four ingredients, about three minutes of effort, and you have a rich, pungent, savory-sweet-spicy sauce that tastes unmistakably of the complex flavors created when vegetables are salted, seasoned, and left to their own microbiological devices.Photo by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeAnd while I love the way this dressing tastes on the aforementioned chopped salad, my favorite thing about it is just how many ways there are to use it. Mix a few big spoonfuls with cooked and chilled ramen noodles for a quick picnic side. Use a few dollops to brighten up a platter of grilled steak or fish. Sneak a bit into just about any mayo-based salad—think potato or chicken—for a hit of funk and heat. Put it on fried eggs! Swipe it on a sandwich! All this is to say, don’t be afraid to double this dressing. Because the only thing better than a versatile, big-flavor, put-it-on-anything sauce that only takes you a couple minutes to make is a versatile, big-flavor, put-it-on-anything sauce that’s already waiting for you in the fridge.Get the Recipe:Chopped Salad Supreme With Kimchi VinaigretteWhen you start with good kimchi, all you need is a little neutral oil to make a vinaigrette that will flatter any selection of raw and blanched vegetables.View RecipeExplore Bon AppétitBasicallytechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-17", "author": ["Condé Nast", "Amiel Stanek"]}