{"id": "f504355af905c8714ec2feef161a4e86", "url": "https://www.bonappetit.com/story/novelty-mugs", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Novelty Mugs Are the Only Mugs I Want to Drink My Coffee From | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSave Your Tasteful Glazes and Funny Handles, I Like My Coffee From a Novelty MugCatch me and my teddy bear mug on Zoom.By Alex DelanyMarch 23, 2020FacebookTwitterEmailPhoto by Emma Fishman, Styling by Allie WistFacebookTwitterEmailFor someone who has never considered a career in ceramics, I think about mugs a lot. The shapes. The colors. The handles. The slope of the walls. The finish! (Matte?! Glossy?!?) There’s so much to consider! So much to admire! And after devoting a considerable amount of my time—read: every single morning and early afternoon—to such a multi-faceted category, I’ve arrived at one conclusion: Novelty mugs are the only mugs I want to drink from. And the competition isn’t even close.You know the type: It’s got thin walls that run straight up-and-down. A handle big enough for two or three fingers to comfortably hold. A glossy finish that says, “I’m dishwasher safe,” and feels nice on the lips. A cup that holds 11 ounces of liquid, which is enough to get you caffeinated without giving you the shakes. They’re found in every gift shop, roadside rest stop, and airport from Albuquerque to JFK, plus places you find awesome second-hand vintage stuff, like antique stores and eBay, too. That means the coolest ones already exist, and that might make them sorta kinda better for the planet!In an era when artisan pottery made by hand with organic glazes and specialty clays are all the rage (see this and this and this and this), nothing comes close to the standard issue mug. Artsy tall, thin ones with a narrow opening smack the bridge of my nose every time I sip. Short, squat ones pose a higher spill risk when walking. Ones with outwardly slanted walls double that spill risk. And don’t even get me started on those “creative” handles: the comically large loops that compromise balance; the thick, heavy grips that turn every sip into a workout; the single “finger-sized” hole that no finger of mine ever seems to fit. High-design should never come at the cost of basic ergonomics!You’ll know what mood I’m in by the mug I’m drinking from.\nPhoto by Emma FishmanBut most importantly, a blank mug is a missed opportunity. Novelty mugs will never be boring. They go beyond a tasteful earth tone glaze to a look that actually says something. (Most of the time quite literally.) Think of the designs, think of the memories! I hear the groovy guitar and strings from Lost in Music every time I drink from my LISTEN TO SISTER SLEDGE mug. I proudly proclaim my dedication to faded denim and cowboy shirts with every sip of my cowboy Polo Bear mug. My 2001 Eastern Conference Final Philadelphia 76ers mug transfers all of Allen Iverson’s game 1 energy into my coffee. My Maine mug is for nostalgic Mondays. Polar Skate Co. is for whimsical Tuesdays. And Wednesday is obviously for my Goodfellas diner sign. You know, for the “Fuck you, pay me,” kind of days.The minute you start sipping your morning coffee from something a little less tasteful and a little more playful, we know you’ll feel more joyful, more snug, more at ease even. That’s because novelty mugs are made to pull on your heartstrings and remind you of happier times. That and, well, the really comfortable handle.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-23", "author": ["Condé Nast", "Alex Delany"]}