{"id": "f5212409a82e8d9fde68ac1e8ed35612", "url": "https://www.bonappetit.com/recipe/one-pot-chicken-and-rice", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "One-Pot Chicken and Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueOne-Pot Gingery Chicken and Rice With Peanut SauceBy Molly BazFebruary 11, 20204.4(253)Read ReviewsTriangleEmailPinterestPrintPhoto by David Malosh, food styling by Rebecca Jurkevich, prop styling by Cindy DiprimaEmailPinterestPrintEmailPinterestPrintWe took loose inspiration from Hainanese chicken rice to create this weeknight-friendly dish that retains the comforting and fragrant qualities of the beloved original. Seek out the highest-quality basmati rice you can find (we recommend Daawat brand)—it will make a world of difference in yielding supremely fluffy, evenly cooked rice.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonSmall Bowl$13 At AmazonWhisk$10 At AmazonWooden Spoon$6 At AmazonIngredients6 servingsChicken and Rice6small skin-on, bone-in chicken thighs (about 3 lb.)¾tsp. kosher salt, plus more2large shallots, finely chopped8garlic cloves, finely chopped12\" piece ginger, peeled, finely chopped2cups high-quality basmati rice, rinsed2whole star anise1Tbsp. soy sauceSauce and Assembly½cup creamy peanut butter2Tbsp. soy sauce2Tbsp. unseasoned rice vinegar5tsp. Sriracha11\" piece ginger, peeled, finely chopped1½tsp. honey1English hothouse cucumber, halved lengthwise, thinly sliced on a diagonal1cup cilantro leaves with tender stemsPreparationChicken and RiceStep 1Pat chicken dry and season all over with salt. Arrange, skin side down, in a cold, dry medium Dutch oven and set over medium heat. Cook, undisturbed, until skin is golden brown and crisp and easily releases from pot, 8–10 minutes. Slide thighs around to different spots (this will ensure even browning) and continue to cook until deeply browned, 3–5 minutes longer. Transfer chicken to a plate. Let pot cool 2 minutes.Step 2Set pot over medium-low heat; add shallots, garlic, and ginger and cook, stirring constantly, until very fragrant but not browned, about 2 minutes. Stir in rice and star anise and cook, stirring constantly, 1 minute. Stir in soy sauce, ¾ tsp. salt, and 3 cups water. Nestle chicken back into rice mixture in pot, arranging skin side up. Increase heat to medium and bring liquid to a simmer. Immediately cover pot, reduce heat to low, and cook 25 minutes. Remove from heat and let chicken and rice sit 10 minutes.Sauce and AssemblyStep 3While the chicken and rice are cooking, make the sauce. Whisk peanut butter, soy sauce, vinegar, Sriracha, ginger, honey, and ¼ cup warm water in a small bowl until smooth and pourable. If sauce still looks a little thick, continuing adding water until it reaches a drizzle-able consistency.Step 4Remove lid from pot and fluff rice with a fork. Pluck out and discard star anise. Serve chicken and rice with peanut sauce, cucumber, and cilantro alongside.Do Ahead: Sauce can be made 3 days ahead. Cover and chill.How would you rate One-Pot Gingery Chicken and Rice With Peanut Sauce?Leave a ReviewTell us what you thinkReviews (138)Back to TopTriangleI have good luck with most of BA's recipes.  This looked delicious.  I'm not a fan of star anise, but used it because it seemed essential to the dish.  Everything cooked up quick and easy, but it needed a more pungent flavor profile.  My fussy husband enjoyed it.  I did not.  It needed fresh lime juice, scallions, soy sauce, or some fish sauce--or all four.  I will make this again and build a whole different seasoning dynamic.  Maybe smokey.  Maybe Mediterranean.  The ease of prep on this makes it worth playing with next time.AnonymousSouthington, CT1/4/2022Fail recipe here, IMO. Cooking times here aren't near enough to cook chicken thoroughly with the rice. And like (weirdly?) I lot of Molly Baz recipes, it's a lot of ingredients and steps for...like kinda-ok flavour? Thumbs down.BrutesOttawa, ON12/30/2021So good! Really unique flavors with the star anise & chicken fat. The sauce is amazing too. Great weeknight meal that makes a Monday feel a little bit fancier than just chicken and rice. Araminta Seattle11/30/2021Awesome dish! You can't go without prawn crackers to finish the leftover peanut sauce after this dish.\nAlso works perfectly with vegetarian chicken alternatives, adding some soy beans for a little protein boost💪StefanAmsterdam9/26/2021This is the perfect balance of easy, comforting and tasty.  I used what I had... brown rice and boneless skinless chx breast. I also had some left over peanut sauce that I combined with the boiling water (half sauce, half water). The chicken was amazingly tender. We had green beans with it. This is a really great idea and a super flexible recipe. SabineAlameda, CA7/4/2021Absolutely loved this recipe! Followed pretty much as written and it came out perfectly. Took some of the recs from previous commenters and added the juice of one lime + a grated garlic clove to the peanut sauce, which is definitely the star of the recipe in my opinion. Also used chicken broth in place of the water because I thought it would elevate the flavor. Would agree with a few other people who said it's a bit too much rice, but it really wasn't a big deal. My family loved it so much they went for seconds! I'll definitely be putting this recipe in rotation with my other favorites. Thanks Molly :) Anonymous6/8/2021Satisfying and easy with pantry staples Gillian Canada5/17/2021This dish was just okay.  Waaay too much rice and honestly, the peanut sauce is the only thing that saves it from being bland.  I've made better versions of peanut sauce as well.  This one was a bit gloppy and one note and needed something like coconut milk to smooth it out.  If I made this again I would use half a can of coconut milk with the rice liquid, half as much rice, and the other half of the coconut milk in the peanut sauce.  AnonymousChicago4/14/2021So so delicious. I followed a review and used the cucumber, cilantro, and sauce with some added EVOO to make a salad to top. Family loved it!AnonymousDenver, CO4/4/2021Love love love this dish. Peanut sauce is beautifully balanced, especially with the cilantro and cucumber. We don't have Sriracha so I substituted for 5 tsp of Sambal Oelek. Also used Haiga rice instead of jasmine, no change to liquid amount or cooking time. Rinsed the rice, used just water (no broth) and the rice tasted incredible. I wouldn't change it for chicken broth. Gorrrrgeous dish. Had it for breakfast the next day.  \nAlso, I was kind of disappointed that the crispy skin didn't stick around, but I didn't care because it was perfect the way it was. I was surprised. I wouldn't change a thing to get it to be crispy.HannahSeattle, WA3/18/2021FANTASTIC recipe! I made a couple adjustments (some that were mentioned in comments below) that I thought I would share since I think it really elevated the dish. Instead of using just water, I used chicken broth to cook the rice and chicken in. In order to make this dish healthier, I made it with brown jasmine rice and cooked it separately for 20 minutes, then added the rice to the dish when the recipe calls for it and followed the recipe from there. I added the juice of a whole lime to the peanut sauce, and created somewhat of a salad by mixing the cucumbers and cilantro, added a drizzle of EVOO, juice of half a lime, and some garlic salt. All of these additions made for a delicious meal. Thank you for another keeper, Bon Appetit!KayleeBozeman, MT2/23/2021Great meal after a busy day - comes together very quickly - especially if you cheat and used pre-prepared garlic and ginger.    I used chicken breasts because that is what was in the freezer.    I also used chicken broth instead of water and needed more than 3 cups.    The sauce is lovely.   Sauteed bok choy, snow peas and asparagus to go with it - yum!\n AlisonOttawa, On, Canada2/22/2021the rice and peanut sauce is such a great combo! the crispy chicken thighs pair perfectly!Kiersten Wasserman2/14/2021Let me start by saying that this dish is excellent and is going into my regular rotation of favorite meals. Thank you so muchNanetteAnchorage, Alaska2/1/2021Easy to make and totally delicious!! I used skin on boneless chicken breasts which worked equally well and did not dry out. The skin browned but was not crispy and I hate slimy chicken skin so to get a nice crispy skin before serving I grilled the breast skin side up for probably less than a minute. Perfect!!  Definitely a new fave!!AshLondon, UK1/24/2021Explore Bon AppétitChicken ThighChickenPoultryPeanut ButterCondiments, Sauces & PastesRiceRice & GrainsEasyOne-Pot MealsWeeknight MealsMainDairy-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Molly Baz"]}