{"id": "f53909e23b5c7cc65d3b5540a24ec45d", "url": "https://www.bonappetit.com/story/dumpling-dowel", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "You Need A Small Rolling Pin If You're Serious About Making Dumplings | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You're Serious About Making Dumplings, You Need A Small Rolling PinA small rolling pin makes a big difference.By Hetty McKinnonApril 15, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Along with perseverance and practice, there is one other weapon that can take your dumpling game to the next level: a small dumpling rolling pin. Sometimes called a Chinese rolling pin, it’s like a regular rolling pin but shorter and thinner. While I was in Hong Kong a few years ago, I wandered into a restaurant supply store and came across a display of mini rollers, ranging in width, length, and shape, everything from thin dowels to ones with tapered ends. I picked out a few to bring home and try.I learned then what I wished I had learned years before. A shorter and thinner rolling pin makes a huge difference. The main improvement was in the handling—it gave me so much more control over rolling than an unwieldy large rolling pin and made it easier to maneuver with one hand, freeing the other hand to turn the dough. I was able to produce dumpling wrappers that were the round, thin shape I wanted as well as thinner on the edges than the middle.The dowel in action!\nDumpling rolling pins are usually about 9–12 inches long, in varying widths. The thinnest one I own is only ½-inch in diameter, but my favorite is 1-inch thick and 9 inches long. The width you choose may depend on the size of your hands and what feels most comfortable to you. To start, I recommend a 1-inch diameter roller that is around 10 inches long.These small rolling pins can be purchased at Asian kitchenware stores and online, but if you are looking for a less expensive alternative, a simple dowel from the hardware store would work well too. Look for a round dowel that is about ¾–1\" thick and ask them to cut it to 10 inches long. Make sure you sand and oil them before first use.Photo by Isa ZapataThin Wooden Dowel$11 at AmazonOnce you have your small rolling pin, it can also be used for other projects that require working with small pieces of dough. I also use mine for rolling dough for char siu bao, mochi, tortillas, empanadas, and hand pies. Outside of dough, small rolling pins can do double-time as a muddler, as it’s the perfect size and shape to crush fruit and herbs for cocktails. I also use mine to smash things up in the kitchen, like graham crackers for pie crust or ice.Arguably the most essential tool in your dumpling-making arsenal, a smaller rolling pin will make a big difference in improving your wrapper rolling skills—it did for me.Roll with it:Pea and Ricotta Potstickers With Homemade Dumpling WrappersMaking fresh dumpling wrappers isn't hard when you have Hetty McKinnon to guide you. (But we won't tell if you use store-bought.)View RecipeTo Asia, With Love$43 at AmazonPartially excerpted from TO ASIA, WITH LOVE by Hetty McKinnon. Copyright 2020 by Hetty McKinnon. Published by Prestel, an imprint of Penguin Random House. Reprinted with permission.Explore Bon AppétitShoppingtechniqueDumplingsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-15", "author": ["Condé Nast", "Hetty Mckinnon"]}