{"id": "f547bcaeb1d998152608fa5978ebc691", "url": "https://www.bonappetit.com/recipe/salvadoran-cabbage-relish-curtido", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Curtido - Salvadoran Cabbage Relish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCurtido (Salvadoran Cabbage Relish)By Rick MartinezSeptember 13, 20214.5(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, styling by Sean DooleyEmailPinterestPrintEmailPinterestPrintIf you’re new to fermenting, this curtido recipe is a good place to start as it pickles quickly and easily. You can taste the difference in flavor every day, and the longer you let this Salvadoran cabbage relish ferment, the better it’s going to taste. Sure, it’s great as a fresh slaw, but by day three, you’ll see what we mean. The salty brine becomes tangier as it sits, meaning you may not need to add the vinegar.Traditionally, curtido is served with Pupusas and pairs well with Salvadoran Salsa Roja, but it is also excellent used alongside grilled meats and heavier mains, or any time you want a bright and pickle-y topping.Editor’s note: This recipe was originally published on May 5, 2017.IngredientsMakes about 6 cups½large head of green cabbage, thinly sliced3medium carrots, grated on the large holes of a box grater½large white onion, thinly sliced2serrano chiles, thinly sliced1garlic clove, finely grated2teaspoons dried oregano, preferably Mexican5tsp. Diamond Crystal or 3 tsp. Morton kosher salt, plus more¼cup extra-virgin olive oilApple cider vinegar (for serving)PreparationStep 1Toss cabbage, carrots, onion, chiles, garlic, oregano, and 5 tsp. Diamond Crystal or 3 tsp. Morton kosher salt in a large bowl to combine. Let sit 30 minutes for cabbage to wilt. Transfer to an airtight container (such as a 2-qt. glass jar) and press down firmly on cabbage to release juices; liquid should be at or above level of vegetables. Tightly cover curtido and let sit at room temperature, tasting daily, until flavor is to your liking, at least 1 day and up to 5 days.Step 2Just before serving, drizzle oil into curtido and toss to combine. Taste and season with vinegar and more salt if needed. (If serving after 48 hours or longer, curtido will be tangy and may not need vinegar.)Do Ahead: Curtido can be made 1 week ahead. Chill after you have added the oil and seasoned.How would you rate Curtido (Salvadoran Cabbage Relish)?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleYes. Add salt gradually. My first batch was too salty but my second batch came out perfecto. so so so good. AnonymousIthaca, NY1/15/2022The complaints about saltiness can be remedied by sticking to a proportion of salt that is about 2.2-3% of the total weight.  That's enough salt to prevent the growth of botulinum.    Typically, that's 3 tablespoons of fine salt to 5 pounds of vegetables. Obviously, the size of the cabbage can influence the salinity.   Best to avoid kosher salt, as its density is variable and lighter than fine salt.  Sad to say, but you need a scale to make it only as salty as it needs to be to be made safely.  steve the pickle guywisconsin11/2/2021WonderfulS.FryeN.C.6/5/2021Paigedeck's comment  regarding salt and fermentation is spot on. This recipe is for fermentation - don't change the quantity of salt unless you know what you are doing! You must ensure you are growing the microbes that make the curtido delicious, not the kind that send you to the hospital. If this is too salty for you, you are being impatient. The recipe says it can be made a week ahead, but I would suggest it should be made a week ahead so that it can develop properly. The flavor becomes much more complex and less salty as it ages. The curtido on day 1 is a completely different dish from the curtido on day 15+.NonamakerMassachusetts8/14/2020Here's the thing. This recipe is for natural fermentation. That's why it calls for so much salt and DOES NOT say to add the vinegar and oil right away. It confused me too, which is why I added vinegar and oil after 30 minutes the first couple times I tried this. And that method totally works--it just won't give you natural fermentation. After 24 hours, this will taste too salty with the amount of salt they recommend for natural fermentation. But after 48 hours or more, it should be just fine. If you want to eat it before that time, use less salt and add enough vinegar and oil to cover the mix in your container right after 30 minutes of wilting. It still tastes great and lasts forever in your fridge. The key I've discovered for the authentic natural fermentation method is you really need to mush the mix down in your jar to release enough juices, which might require more wilting time. You can also just add distilled water to ensure your mix is covered in the jar. Good luck! Other experimenters--please share your tips!PaigeDeckMichigan6/25/2020Everyone here is right. The slaw is way too salty, and I figured it would be as I was spooning in 5 tsps(!) of salt. But I wanted to trust Rick because his pupusas are amazing. I've been dumping liquid out of the container and replacing it with plain water in hopes it will calm the salt. I'm probably flushing the fermentation agent and other flavors as well, though. For those making this, consider 1-2 tsps of salt instead.Mark2000San Francisco5/26/2020What weight of salt is needed?? I made this with Morton's kosher salt and it was so salty that it was inedible. @BonAppetit please put the grams of salt in this recipe!jfperelman1/17/2020I haven't made the curitdo yet but I look forward to trying it along with along side Rick's pupusas, but this recipe needs an edit. The recipe preparations neglects to mention that the vinegar needs to go in the jar along with cabbage, etc. \"Toss cabbage, carrots, onion, chiles, garlic, oregano, and salt in a large bowl. Let sit 30 minutes to wilt cabbage. Transfer to an airtight container (like a 2-qt. ball jar) and press down firmly on cabbage to release juices; liquid should be at or above level of vegetables. Seal and let sit at room temperature at least 24 hours.\"  No reference to vinegar, only \"liquid\". The following paragraph is confusing because only then does it mention adding vinegar after 24 hours.AnonymousToronto6/26/2019Overall, a good recipe, but way, WAY too much salt.  Maybe that's part of the fermentation process, but it's unfortunately so salty that it's almost inedible.AnonymousPhiladelphia, PA5/13/2019Pumped to make this fermented slaw! One question - what is the red sauce on the side? Having a dinner and want to make sure I’ve got all the accouterments the pupusas need for optimal enjoyment soccerchick19896/6/2018Explore Bon AppétitCondimentSalvadoranCentral AmericanLatin AmericanCarrotVegetableRed CabbageCabbageLeafy GreensSerrano ChileChileEasySideNut-FreeDairy-FreeGluten-FreeRawVeganVegetarianPickle and PreserveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-05-05", "author": ["Condé Nast", "Rick Martinez"]}