{"id": "f55cf4aa3fdb6f8b08309d249cc0b048", "url": "https://www.bonappetit.com/story/pan-con-tomate", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "This Pan Con Tomate Is the Tomato Toast of 2019 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Pan Con Tomate Is the Tomato Toast of 2019It requires minimal effort for an incredible payoff. But also: good bread.By Andy BaraghaniAugust 5, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykFacebookTwitterEmailI’ve done tomato toast. Last summer, the summer before. It’s my favorite thing to eat from August 1 to Labor Day. This year, I got a lot of questions from readers asking what the new tomato toast was going to be. Well, it’s this untraditional but exceptional pan con tomate. You’re welcome.If you’re familiar with the Catalonian staple, you’ll notice I changed up the technique a bit. The idea of rubbing tomatoes on stale bread didn’t do it for me, so you’ll need an oven for toasting and a box grater for getting maximum flavor from those perfectly ripe tomatoes. These steps don’t make the recipe any harder, but they do you more control over the outcome. Think of this as the Type A person’s pan con tomate. It’s still simple, and still requires minimal effort for an incredible payoff. I might even say it guarantees it. Let me walk you through it.The breadYou need a thick slice of bread to soak up juices from the tomatoes. I used ciabatta loaf, cut in half, open-faced. I drizzle it with oil and bake it at low heat to dry it out completely so it can soak up the juices. If the bread’s too fluffy, it’ll get soggy under the tomatoes, and we’re going for crispy edges here. (In keeping with tradition, though, when the toast’s warm, rub it with a cut half of garlic.) I want to control every factor of a recipe, so I’d rather dry the bread out myself than call for stale bread, which you also might not have casually laying around.The tomatoesUse good ones. At the market, feel for heavy fruit that gives off a sweet, tomato fragrance. There aren’t lots of other things going on here, so it’s worth spending the time finding the winners.The methodWhen you rub the tomatoes on the bread, you don’t get the tomato skin, just pulp. But the tomato skin has a ton of flavor, aroma, and texture, so I grate the tomatoes and then chop up the skin and mix that back in. I season that with a ton of salt and oil, spoon it over the bread, and then leave it for a minute or two. Letting the toast sit will help it really soak up the tomatoes.That’s as perfect as it gets. But if you want to gussy it up further, you can add herbs like oregano, fresh cracked pepper, oil-packed anchovies, chile flakes, and/or lemon zest. And if you’re entertaining, you can make it ahead; the toasted bread can sit, keep the tomato mixture separate, and then spoon it over before serving.Get the recipe:Pan con TomateSpoiler alert: We broke with tradition. Instead of rubbing toast with cut tomatoes, we grated the tomatoes to make a raw sauce that the bread can really absorb.View RecipeExplore Bon AppétitTomatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-31", "author": ["Condé Nast", "Andy Baraghani"]}