{"id": "f56a474506f071693270767794291496", "url": "https://www.bonappetit.com/recipe/sichuan-boiled-fish", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Sichuan Boiled Fish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueSichuan Boiled FishBy Lisa Cheng SmithNovember 19, 20194.0(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Lillian Chou, prop styling by Beatrice ChastkaEmailPinterestPrintEmailPinterestPrintThe flavors of this fish are out of control—super spicy, super intense, super delicious. This recipe moves fast, though, so stay on top of it by prepping and lining up your ingredients before you start cooking. This recipe is from Taiwanese-American cook Lisa Cheng Smith’s spectacular Lunar New Year feast. Find the rest of her menu here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFly By Jing Sichuan Peppercorns$23 At Bon Appétit MarketCarbon Steel Wok$60 At AmazonMicroplane$16 At AmazonStainless Steel Mixing Bowls$26 At AmazonIngredients8 regular or 16 small servings1large egg white¼cup rice wine2Tbsp. cornstarch2tsp. finely grated peeled ginger1tsp. kosher salt½tsp. freshly ground white pepper (optional)2tsp. ground Sichuan peppercorns (from 3 tsp. whole), divided1lb. skinless, boneless white fish fillets (such as cod, flounder, or red snapper)6Tbsp. grapeseed or vegetable oil, divided3celery stalks, sliced into 3\"-long matchsticks½cup bean sprouts⅓cup dried Sichuan chiles (about 32) or other red Chinese chiles, divided7garlic cloves, 6 smashed, coarsely chopped, 1 finely chopped13\" piece ginger, peeled, thinly sliced (about 5 slices)2tsp. whole Sichuan peppercorns, divided3Tbsp. doubanjiang (Sichuan-style fermented chili bean paste)2½cups fish stock, low-sodium chicken broth, or water2scallions, thinly sliced on a diagonal2sprigs cilantro, sliced into 2\" pieces (stems and leaves)2tsp. gochugaru (fine Korean red pepper powder)1tsp. sesame seedsPreparationStep 1Whisk egg white, wine, cornstarch, grated ginger, salt, white pepper (if using), and 1 tsp. ground Sichuan peppercorns in a medium bowl. Thinly slice fish fillets on a diagonal into ¼\" slices and place in bowl with marinade. Toss to coat and let sit 30 minutes while you make the broth.Step 2Heat 1 Tbsp. oil in a large wok or deep-sided skillet over medium-high. Add celery and bean sprouts and stir-fry, stirring constantly, until crisp-tender, about 1 minute. Transfer to a large deep bowl.Step 3Remove seeds from 6 dried chiles and cut crosswise into ¼\" pieces. Pour 1 Tbsp. oil into same wok and heat over medium-high. Add coarsely chopped garlic, sliced ginger, sliced dried chiles, 6 whole dried chiles, 1 tsp. whole Sichuan peppercorns and cook, stirring, until fragrant, about 1 minute. Add bean paste and cook, stirring, until fragrant, about 1 minute. Pour in stock and add remaining 1 tsp. ground Sichuan peppercorns. Bring to a boil. Reduce heat to medium-low, cover wok (use a baking sheet if you don’t have a lid), and simmer 15 minutes to infuse broth with flavor.Step 4Using your hands, lift fish out of marinade, shaking to remove excess, and transfer to hot broth; discard marinade. Cook over medium-low until just opaque, about 2 minutes. Using a spider or slotted spoon, transfer fish to bowl with celery and bean sprouts, arranging on top; carefully pour broth over. Top with scallions and cilantro.Step 5Wipe out wok, pour in remaining 4 Tbsp. oil, and heat over high until just smoking. Add finely chopped garlic, gochugaru, sesame seeds, remaining 20 chiles, and remaining 1 tsp. whole Sichuan peppercorns and cook, stirring constantly, until fragrant, about 1 minute. Immediately pour over top of fish.How would you rate Sichuan Boiled Fish?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleAs a Caribbean the amount of dried chilies did not bother me, so I made this with Red Snapper and followed the recipe  exactly and it was a HIT! I had bowls of fresh cilantros, watercress, & sliced shallots on the table for people to add in as they ate. It was really good. Will definitely be making this again. Gigi KAtlanta, GA12/20/2020We were worried about the heat from reading the reviews, so I used 1/4tsp of ground sichuan peppercorns in the marinade and 1/4 in the final step.  Also, we used jalapenos instead of the dried chilis as we never eat the dried and wanted a little more flavor.  We used Mahi Mahi and loved it - we will definitely serve this again.elizengNew York City6/11/2020This recipe is a bit flawed if made as written. I agree with the other reviews about spice level. Skip the 20 Chiles at the end and I’m one who really enjoys heat.  Otherwise, this dish can be really delicious with some common sense alterations. AnonymousBethesda, MD5/16/2020This soup gets rave reviews every time I make it. I don't even like fish soup normally, but this is on a different level. It's spicy but not killer as long as you adjust the dried chilis. I am dying to know what kind of chilis Bon Appetit used such that they could add 32! I used 5-6 dried chilis (I'm not sure but I think they were facing heaven peppers with a couple of dried Thai chilis) and the spice level was 8/10. I always use tilapia for the fish.AnonymousWashington, DC4/25/2020I took a clue from the other reviewer and went halfsies on the peppers.  I also skipped the last topping, opting for just the sesame seeds, cilantro and scallions for topping.  I used Orange roughy, which was just right. The ingredients were easy to find at my local Asian market.  The dish was delicious!  Flavorful and just the right amount of spicy.   The broth was really tasty with the aromatics and fermented chili paste.   It may be just too much Szechuan.pepper for us westerners as written.   LynsoCincinnati 4/20/2020I found this basically inedible. There's just WAY too much happening, to the point where I didn't enjoy the spiciness (and I LOVE all spicy food), but instead just found it punishing. Also, the way the recipe is written is intensely confusing. Generally speaking, I adore Bon Appetit and love everything I make from the magazine, but this was just a bust for me. Kimberly MickenbergNew York, New York3/4/2020Explore Bon AppétitStewSoups and StewsSichuanChineseEast AsianAsianFishSeafoodChileVegetableSichuan PeppercornHerbs & SpicesMainDairy-FreeHealthyishSimmerLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Lisa Cheng Smith"]}