{"id": "f5980e47b67e0d5c124cb343780c8ec4", "url": "https://www.bonappetit.com/recipe/tomatoes-and-haricots-verts-with-anchovies", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Tomatoes and Haricots Verts with Anchovies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueTomatoes and Haricots Verts with AnchoviesBy Ignacio MattosApril 17, 20181.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintSummertime is when tomatoes and long beans are at their peak. Produce that grows together goes well together. But this time the anchovies are not optional. They’re an integral ingredient here, and it’s worth seeking out quality brands. We love the oil-packed ones from Ortiz, Agostino Recca, and Merro. For a long, lazy lunch menu serve this salad alongside sea bream crudo, handmade malfatti, grilled turbot, and tiramisù with cookies.Ingredients8 servings4oz. haricots verts or green beans, trimmedKosher salt2lb. medium tomatoes, some sliced, some cut into wedges1pint Sun Gold and/or cherry tomatoes, halved crosswise16oil-packed anchovy fillets¼cup celery leaves or parsley leaves2Tbsp. red wine vinegar2Tbsp. extra-virgin olive oilSmoked or regular flaky sea saltFreshly ground black pepperPreparationStep 1Cook haricots verts in a large pot of boiling salted water until bright green and tender, about 5 minutes. Using a slotted spoon, transfer to a bowl of ice water; let cool. Drain and pat dry.Step 2Toss haricots verts, both kinds of tomatoes, anchovies, celery leaves, and vinegar in a large bowl; season lightly with kosher salt.Step 3Transfer salad to a platter, drizzle with oil, and season with sea salt and pepper.How would you rate Tomatoes and Haricots Verts with Anchovies?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladGreen BeanVegetableTomatoAnchovyFishSeafoodSummerEasyQuickSideDairy-FreeGluten-FreeNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}