{"id": "f599a8aa1fddc6aabd4b05e9fc32eb6e", "url": "https://www.bonappetit.com/story/kiano-moju-jikoni-creative", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "How Culinary Creative Kiano Moju Makes It From Morning Dance Breaks to Popcorn Dinners | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Culinary Creative Kiano Moju Makes It From Morning Dance Breaks to Popcorn DinnersShe’s all about graffiti strolls and lunch in Little Tokyo.By Leah BhabhaJune 3, 2021FacebookTwitterEmailPhotograph by Jasmine DurhalFacebookTwitterEmailIn our series Office Crush, we’re asking people with the coolest jobs to take us to work. Up next, Kiano Moju, the founder of culinary creative studio Jikoni Studios, takes us through a day of African house-fueled dance parties, office family meals, and midday strolls through Downtown L.A.“My North Star,” says Kiano Moju, “is to do my work with integrity and know what tastes good.” The 30-year-old former BuzzFeed food producer founded Jikoni Studios in 2019 with this ethos in mind. As a multi-hyphenate who approaches the culinary world through many lenses, from recipe development to video production and photography, Moju decided to build a studio to house all her pursuits. At Jikoni’s bright space in Downtown L.A., she and her team create and consult on branded food content, host events, develop recipes, and rent out their on-site kitchen studios for photo and video shoots.Despite the business finding its groove in early 2020, the studio was temporarily shuttered due to the pandemic and only just reopened in September. The ever effervescent Moju was undaunted. Along with her team, she channeled their drive into new virtual projects, like Jikoni’s community recipe site, which sources dishes from a global community of gourmands and brings them to life through interviews and step-by-step videos.The venture spoke to one of Moju’s central missions: celebrating traditionally underrepresented voices and cultures in food media. Growing up between Oakland and Kenya, she’s often been met with blank eyes when talking about the cuisine of her heritage. “I hate speaking about the food of Sub-Saharan Africa as a monolith, but that’s how big the gap of culinary knowledge is about this region in other parts of the world,” she explains. Throughout her career, Moju has fought to highlight marginalized food cultures, rejecting the all-too-common practice of relegating the limelight to holidays or heritage months.When I first connected with Kiano in June 2020, Jikoni’s single kitchen space had gone dark. Ten months later, it’s expanded to include four colorful, thronging studios and an ever expanding team. Perched at her desk in the airy test kitchen, Moju chatted about walking meetings, normalizing life at work, and her team’s favorite lunch.Early mornings with French breakfast tea and eggsI sleep with my blinds open and have so much energy when I wake up, which is usually between 6:30 and 7:30 a.m. The morning, in my opinion, is the best time to eat, and I always make a hearty meal. My go-to is sautéed spinach with a clove of garlic and some eggs scrambled in; toast on the side if I have it.Tea is my fancy indulgence. I have either matcha with a little honey or black tea with a splash of milk. The French Breakfast Tea from Mariage Frères is my favorite—it comes in this black box with gold on the inside that glows back at you. Treating myself at the start of the day makes me feel like I’m walking on clouds.Moju making green curry for her team.\nPhotograph by Jasmine DurhalMore dancing, fewer crunchesDepending on the day, I’ll do 15 minutes of fitness—I can’t do more than that at home or I’ll become incredibly uninterested. I got the Mirror recently because it doubles as decoration; I didn’t like the idea of having a bulky fitness machine in my apartment. Instead, I might do a couple of dance videos on YouTube; my go-tos are by L.A.-based YouTuber The Fitness Marshall. They’re easy to follow but always have a comedic tone to them. I gravitate toward classes that are fun, I don’t like to feel tortured while working out.African house musicUnless I have to be at the studio early for a shoot, I’ll get in around 10 a.m. The office is in our test kitchen and whoever arrives first knows to put the playlist on. We have morning dance breakouts and, for a Friday energy boost, I’ll blast my Wakanda lineup, which features African house artists like Burna Boy and WizKd. My top track on the list is “Come We Bill Ehh” by Midas the Jagaban.Our supervising producer, Claire, will usually make a big pot of Kenyan chai and put it in a thermos so everyone can have some tea when they arrive. On Fridays, we have breakfast sandwiches.Soaking up the sun in Downtown L.A.\nPhotograph by Jasmine DurhalGraffiti strolls, walking meetings, and fridge foragingIf it’s a shoot day, I’m on my computer for 30 minutes and then we’re in the studio making sure our clients are well taken care of. Otherwise, I’m busy at my desk with interviews and business plans, interrupted by occasional trips to the test kitchen for a snack. We’re in the Arts District in Downtown L.A., so I might walk around the block and try to get out somewhere—maybe check out some graffiti in the neighborhood. Work takes up such a huge chunk of our days, I want to build everyday life into the workplace, rather than making it a place you have to break away from. I try to encourage my team to have walking meetings when computers aren’t needed.Sometime before 2 p.m., we’ll have a family meal, which is often Thai green curry. I’ll forage in the fridge for test kitchen leftovers and add them to a base of curry paste, coconut milk, and fish sauce. I keep stacks of frozen parathas as well, so we’ll have those too. If we’re testing recipes, we’ll always make a bit extra for lunches. If we do leave, we’ll go nearby to Little Tokyo, where there are a lot of great places.(Virtual) office hoursClaire and I will do office hours on Clubhouse, where we say, “Are you a food content creator that feels stuck on something? Talk to us and we’ll try to workshop it with you.” Those conversations are incredibly energizing because they are a tangible reminder of our mission and feel more like in-person interactions.The hard part about being an entrepreneur is not losing sight of why you started what you’re doing, especially right now, when many businesses are struggling. Luckily, so much of what we do is grounded in the everyday—everyday people, everyday problems. The motivations come frequently and they come from everywhere.Moju’s skin-care lineup.\nPhotograph by Jasmine DurhalDinner popcorn, a mini-facial, and YouTube videosI don’t care about dinner! I front-load my days with food, and by the time it’s evening, I’m just ready to go to bed. If I eat a proper breakfast and lunch, I’ll have snacks for dinner—a couple bites of something, like popcorn.After a long day I just want to stay in and take time with my skin-care routine. It’s really joyous for me, like a mini daily facial. I love watching the transformation as I go through the steps and admiring the textures and packaging of the products. First, I wash my face with either this Avène cleanser or this makeup-removing one. My skin has been breaking out from masks, and since it’s darker, I get hyperpigmentation. So I’ll also get salicylic acid pads in the mix too. I use an exfoliating toner and then eye serum and hyaluronic serum from Typology followed by a face mist and Glossier moisturizer. At night I use a recovery night serum, and when it comes to masks, I’ll go with Masque Vivant and Caudalie.While cleaning my skin, I usually brew my evening rooibos tea, and then I’ll watch some YouTube videos while I sip. I gravitate toward channels that show how people around the world live. The topics can vary from the history and culture of different African regions, interviews, or home tours. Then, I drift off to bed early, feeling peaceful and prepared for tomorrow.Explore Bon AppétitOffice CrushHealthyishInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-03", "author": ["Condé Nast", "Leah Bhabha"]}