{"id": "f59a08fefff076849b71ec3cd7803fec", "url": "https://www.bonappetit.com/story/slushies", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "These Healthy Slushies Are The Healthyish Drink of the Summer  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Healthyish Drink of the Summer is HereNo, it's not frose.By Amanda ShapiroJune 21, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Molly Baz, Prop Styling by Emily EisenFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Presenting: The Drink of the Summer, 2018:I first realized that slushies are the drink of the summer when I walked into The Goods Mart, a health-minded convenience store in the Silver Lake neighborhood of L.A., and spotted the slushy machine against the spare white wall, churning a sunset pink liquid. “It’s frozen kombucha!” explained a very friendly employee. Just a few hours later, I was down the street at Triniti, a new cafe from Jordan Kahn disciple Joseph Geiskopf and former barista David Wynn, where another (very high-class, brushed metal) slushy machine was cranking something crimson behind the cashier. “Blood orange juice and Tahitian vanilla,” he told me cheerfully. I ordered one and sat near the window, sipping it slowly. I felt like I was drinking a bespoke cocktail at 9 a.m. It was the most satisfying slushy experience I'd ever had.As someone who always, ALWAYS orders the frozen drink at the bar, much to everyone's chagrin, I'm psyched that slushies are getting the healthyish makeover. I'm also psyched to start making them at home—no slushy machine necessary. Senior associate food editor Molly Baz took my gushing enthusiasm and channeled it into a health-promoting slushy trifecta.In it to win it with glowing skin? Try the Beauty-Food Mango Slushy. All about fighting inflammation? Inflammation-Busting Pineapple packs a triple threat with pineapple, turmeric, and ginger. Want to just chillll? (* Raises hand *) Chill-Out Honeydew Cucumber is the one we'll be reaching for.All three use coconut water to lend a little sweetness without added sugar. They whip together in a blender in seconds, and they can easily be scaled up for your next summer fête. I feel fine telling you that a shot of booze tastes excellent in any of these. I might pair mezcal with mango, whiskey with pineapple, and gin or vodka with the honeydew, but that's just me.Also Presenting: Healthyish Superpowered Chicago!Tickets for Superpowered Chicago went on sale yesterday, and...looks like they're sold out. We love you too, Chicago! I'm so excited to be coming out in a couple weeks to honor the incredible Ashley Novoa and her work with the Chicago Period Project, a nonprofit helping homeless and in-need people experience their periods with dignity. I'm equally excited for the dinner at Mott Street, courtesy of chef Bridget Vanaman. (Where else should I go while I'm there? healthyish@condenast.com with your suggestions, pls.)Here and there:I donated to this non-profit helping to reunite parents and children at the U.S.–Mexico border recently, and it seems that the fundraiser has gone viral. I teared up just reading about how RAICES is going to put their $9 million dollars (and counting) to use.I've seen some really great photo essays recently, like this one by a good friend about making the decision to get top surgery—and then actually doing it. I also loved this essay about a third-generation commercial fisher and the father who taught her everything.I'm devouring this series on women and sickness. This Q+A with Porochista Khakpour about her new memoir, Sick is especially illuminating:The thinner and paler I get, [the more] I look like a white woman to people, and then there is a context for my existence. Whereas in health while I could be white-passing to some, most people have a feeling they know what I am, even if they are off—they suspect some sort of Brownness and that can be found in my features, my hair, my curves. But illness reduces me to a sort of old ancient stereotype of the ailing ghostly white woman and that happens to be a fashionable American aesthetic.And into the Amazon cart it goes.Until next week,Amanda Shapiro\nHealthyish editorGet the recipesChill-Out Honeydew Cucumber SlushyHigh in B vitamins, cucumbers both cool and calm you.View RecipeBeauty-Food Mango SlushyMangoes are packed with vitamins C and A, both of which provide major skin-brightening benefits. Lime and chile keep this slushy spicy and bright.View RecipeInflammation-Busting Pineapple SlushyThis slushy has just enough ginger to let you know you’re ALIVE.View RecipeExplore Bon AppétitHealthyish NewsletterHealthyishRead MorecookingA Veggie Burger Recipe That Doesn't Have 15 Ingredients for OnceBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-21", "author": ["Condé Nast", "Amanda Shapiro"]}