{"id": "f5a6eb4c7488738a1952d8b5d1d19690", "url": "https://www.bonappetit.com/story/wellness-anti-racism", "year": 2020.0, "month": 7.0, "day": 3.0, "content": "Wellness Anti-Racism Must Exist Together | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThere Is No Wellness Without Anti-RacismPursuing anti-racism means practicing for the world in which we can all live well. It starts with reflecting on our choices every day.By Courtney Robinson and Uzma ChowdhuryJuly 17, 2020FacebookTwitterEmailIllustration by D'Ara NazaryanFacebookTwitterEmailUzma Chowdhury and Courtney Robinson, best friends and diversity, equity, and inclusion practitioners, reflect on what it means to pursue anti-racism that aspires to ensure wellness for everyone.Wellness, for us, has always been about paying attention—when we choose to pay attention and when we don’t. When we have paid attention to how we nourish our bodies, challenge our minds, and move in our relationships, we have proactively created the conditions for ourselves, our friendships, and our communities to live and be well, healthy, and happy. It makes sense. What you pay attention to grows. What you give your energy to heals. What you make space for shows up.But what you don’t pay attention to matters even more. The larger wellness community has overlooked the blistering reality that the prerequisite to living well is living. The recent murders of George Floyd and far too many other Black people serve as brutal reminders that permission to live, let alone pursue wellness, isn’t afforded to everyone equally. From the protests sweeping the world to anti-racism books topping best-seller lists, the swelling public commitment is a beautiful sign of hope that more people are paying attention. It’s also a telling indication: if you’re just now paying attention, you’ve had the privilege not to pay attention for far too long.As we participate in the influx of reposting, advocating, donating, and attending book clubs, the two of us have also had more private conversations around what anti-racism means for us in this moment. This shows up differently for each of us. One of us is a Black woman grappling with despair while practicing hope; one of us is a non-Black South Asian woman trying to pair solidarity and action without taking up space. We first became friends on our journey to bring anti-racism to schools in our work as educators, and  today we’re reflecting on how to make anti-racism a daily habit for ourselves and others.As public opinion shifts toward widespread support for Black Lives Matter, amid a much larger movement, we are noticing that far too often it takes violence to spark change. Whether it’s a national outcry as a response to the murders of Black people right now, or Trayvon Martin in 2012, or Emmett Till in 1955, or the widely under-reported murders of Black women and Black trans people, these reactions have come after racism has claimed far too many Black lives.As we revisit our own commitments to antiracist work, there’s a similarly troubling pattern in ourselves. We have learned after apologizing for harm we’ve caused to others. We have learned from unpacking the painful parts of our own stories. We have learned after the damage has already been done. Reacting to harm should not be our primary teacher. How do we learn to do better without someone having to get hurt, or worse?Learning before the harm happens requires deep, daily reflection. It feels impossible to imagine a world without harm, but asking ourselves questions helps us think about what’s possible.What space do I take up? Am I centering myself?Do I apologize? When I apologize, do I make it about me?Do I give the gift of my story by unpacking the cultures, identities, and lived experiences that made me who I am? Do I make space to receive the gift of the stories of others?Am I denying my own reality? Am I denying the reality of others?Am I honest with myself about what I don’t know? Do I make assumptions when I should be asking questions?Do I actually listen?Do I pause before I react?Am I defensive? All knowing? Performative?Have I committed to reading, learning, and growing?Am I willing to do the humble, painful work of learning, unlearning, relearning over and over?Whether we ask ourselves one or more of these questions, what we’re ultimately asking is: Am I being anti-racist? This is what we have to ask ourselves again and again to create the world we want to live in. For us, this looks like aspiring to pause and reflect on every choice we make: daily and generationally, at work and at home, for ourselves and for others. It might look like meditating, journaling, or engaging in dialogue with others; there are many ways to build a practice that asks ourselves these questions. For us, asking and trying to answer honestly has felt incredibly rigorous. However, it always helps us become more aware. As we grow our awareness, we make new choices. As we make new choices, we shift our patterns.As adrienne maree brown reminds us in Emergent Strategy, “What we practice at the small scale sets patterns for the whole system.” The patterns of our greater society are unequivocally rooted in racism. To be anti-racists we have to engage in a constant practice. It is the practice of breaking patterns, building new ones, and continuing the work of our ancestors. It is the practice of learning and unlearning what we believe to be true. It is the practice of speaking, thinking, and acting in pursuit of a liberated world, even though we’ve never experienced one. Every day, we practice for the world in which we all want to live—and living is the bare minimum. We practice for the world in which we can all live well.Explore Bon AppétitHealthyishessayRead MoreLifestyleHow to Check In With Your Black Friends Right NowBy Jesse SparksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-17", "author": ["Condé Nast", "Courtney Robinson", "Uzma Chowdhury"]}