{"id": "f5a91d4bc1ea6d6eec8138a7fee5dc25", "url": "https://www.bonappetit.com/recipe/dirty-rice-with-black-eyed-peas", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Dirty Rice with Black-Eyed Peas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueDirty Rice with Black-Eyed Peas and ScallionsBy Commander’s Palace, New Orleans, LAFebruary 9, 20184.5(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintYou can easily skip the meat to make this dirty rice vegetarian-friendly. This recipe is from Commander's Palace in New Orleans, LA. Read more about the restaurant's legendary Family Meal here.Ingredients8 servings2Tbsp. vegetable oil3oz. chicken liver, finely chopped3oz. ground beef1large onion, finely chopped4scallions, white and green parts separated, thinly sliced1green bell pepper, ribs and seeds removed, finely chopped2celery stalks, finely chopped2garlic cloves, finely chopped2bay leaves4tsp. Cajun spice seasoning½tsp. cayenne pepperSplash of brandy or cognac (optional)3cups long-grain white rice115.5-oz. can black-eyed peas, rinsed4½cups low-sodium chicken brothKosher salt, freshly ground pepper6oz. frozen peas6Tbsp. unsalted butter, cut into piecesPreparationStep 1Heat oil in a large saucepan over medium-high. Cook chicken liver and ground beef, stirring occasionally, until brown, 5–8 minutes. Add onion, scallion whites, bell pepper, celery, and garlic and cook, stirring occasionally, until vegetables are soft, 6–8 minutes. Add bay leaves, Cajun spice seasoning, and cayenne, and cook, stirring, until fragrant, about 30 seconds. Add brandy, scraping up any brown bits on the bottom of the pot with a wooden spoon. (You can use 2 Tbsp. water if you want to skip the brandy). Add rice and cook, stirring often, until some grains are translucent, about 3 minutes.Step 2Add black-eyed peas and broth, season with salt and black pepper, and bring to a boil. Reduce heat, cover saucepan, and simmer until rice is tender and liquid is absorbed, 15–18 minutes. Remove pan from heat, add peas and butter, and fluff rice with a fork. Cover pan and let sit 10 minutes.Step 3Taste rice and season with more salt if needed. Transfer to a platter and top with scallion green.How would you rate Dirty Rice with Black-Eyed Peas and Scallions?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis recipe SLAPS! Bonus points if you soak and them simmer your own black eyed peas with ham hock first. Also it serves at least 20K~ people so leftover accordingly.bigbadbrookie Salt Lake City, UT2/12/2021Explore Bon AppétitSouthernAmericanBlack-Eyed PeaBeanVegetableGround BeefBeefMeatRiceRice & GrainsPeaEasyOne-Pot MealsMainGluten-FreeSautéKwanzaaJuneteenthNew Year'sDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-09", "author": ["Condé Nast", "Commander S Palace", "New Orleans"]}