{"id": "f5b75524102a506a57344ca910d914a0", "url": "https://www.bonappetit.com/story/all-about-yeast", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "What is Yeast, How Do You Bake With It, And What is the Difference Between Instant and Active Dry  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Bake With Yeast When You're a Total Noob Get to know yeast, one of the best single-celled microorganisms around. By Sarah JampelFebruary 27, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan Spungen FacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.Adding yeast to dough is a lot like adding money to a 401(k). It’s hard to know what’s happening (or if anything is happening). The hope, presumably, is that the money grows, but it all feels a little bit nebulous and a lot bit confusing. What are you even doing? What even is a 401(k)?By the same token, yeast is elusive, mysterious, and (I think) way more alluring than personal finance. Yeast should make the dough grow, but what is yeast exactly? How does it work? And what are all the different types? We’re breaking it down below:What is yeast and how does it work?Yeast are single-celled microorganisms that belong to the fungi kingdom (along with mushrooms and, ew, mold). Since ancient times, bakers have been using the yeast species Saccharomyces cerevisiae to make bread rise. (Different strains of the same species are used to ferment beer and wine.)In bread baking, the yeast feeds off sugar—those in the flour and any added to the dough itself—and converts them into carbon dioxide and alcohol. The carbon dioxide gets trapped within the dough, causing it to expand. (See those gassy bubbles in the photo above? They’re signs of life!)When the dough goes into the oven, fermentation increases: The yeast frantically feed until they perish at 145° F (R.I.P.), which causes the often-dramatic ballooning in the size of your dough during the first stage of baking (that’s called “oven spring”).What are the different types of yeast called for in recipes?Yeast is all around us all the time! This very second. A sourdough starter, the foundation of sourdough bread, is made with wild yeast that’s captured from the air, then fed with flour and water (it’s like an ant farm for microorganisms). But commercially made yeast is better for beginners because it’s easier to work with and produces more consistent results.You’ll see two main types of dry yeast at the grocery store. Active dry yeast, which often comes in flat packs of three, is what we call for in our Shockingly Easy No-Knead Focaccia because it’s the most widely available. The granules are large—they’re actually made up of live yeast cells surrounded by dead cells (that’s right, not all of the cells are alive) and a growth medium. The yeast is most often activated in warm water or milk, sometimes with a source of sugar, before it’s incorporated into the other ingredients. (If you’re confused, just remember: Activate your active dry yeast.) This hydration phase also gives you a chance to make sure that the yeast is alive—more on that below.The alternative to active dry yeast is instant yeast, which is finer and can be mixed directly into the dry ingredients, no activation necessary. It contains 100-percent living cells, which means that instant yeast is more powerful than active dry. If a recipe calls for active dry yeast but you want to use instant, a good rule of thumb is to decrease the volume by 25% (for example, if a recipe calls for 1 tsp. active dry, use ¾ tsp. instant). Instant yeast also has a longer shelf-life than active dry: It’s often sold in bulk and can be kept in the refrigerator for years! If you bake a lot but can’t find instant yeast in your area, it might be worth it to buy it online.What do you need to know before working with yeast?1. When working with active dry yeast, check the expiration date.But know that even if your expiration date is well in the future, there’s still a chance that the yeast in that particular packet could be deceased. Which is why it’s good to keep a few extra packets on hand and to...2. Look for signs of life.Activating active dry yeast in warm liquid helps dissolve and rehydrate the granules and gives you the opportunity to check for vital signs. Within five to 10 minutes of being mixed with warm water or milk, depending on the recipe, the yeast should start to foam and/or bubble and give off a pleasant yeasty aroma. If it doesn’t, it’s better to start over now rather than after you’ve added all of the other ingredients. (But if you've tried a couple of unexpired packets and there's still little or no action, I'd suggest you keep going!) While this activation step is not necessary for instant yeast, you can still do it if you’re questioning its vitality.3. Be mindful of the temperature of the liquid.High temperatures are deadly for yeast, so make sure your water is warm to the touch—between 100° F and 110° F if you’re taking the temp—but cool enough that you could comfortably keep a finger submerged.4. Know what “doubled in size” looks like.Recipes will often instruct you to proof your dough until it’s “doubled in size,” but it’s hard to remember what your dough originally looked like if you don’t take note. Glass bowls are handy here because you can use a piece of tape to mark your dough’s original height. It’s also helpful to use a bowl that’s not too large—if your bowl is huuuuuge, it’ll be hard to see how much your dough has grown (the same way it’s easier to distinguish the size of a grape and a blueberry when they’re placed in a small bowl rather than a big one).If all of this feels like a lot to remember, just think: On the other side of this process is fresh bread! Are you really going to let a few billion microorganisms get in your way?Ready to try?Shockingly Easy No-Knead FocacciaIf you want to fill your kitchen with the smell of fresh-baked bread but you're nervous about shaping a boule or working with a starter, focaccia is the best place to begin. We're not exaggerating when we say it requires zero skill and provides ample opportunity to be amazed by yourself and by the wonders of yeast. View RecipeExplore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-27", "author": ["Condé Nast", "Sarah Jampel"]}