{"id": "f5c05f76b62efbabfecd6f77efc8f07d", "url": "https://www.bonappetit.com/story/3-crunchy-delicious-sides-that-totally-steal-the-show", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "3 Crunchy, Delicious Sides That Totally Steal the Show | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored3 Crunchy, Delicious Sides That Totally Steal the ShowBy Alexia FoodsMarch 1, 2018FacebookTwitterEmailFacebookTwitterEmailLike many great duos in history—think Fred and Ginger, Batman and Robin, Sonny and Cher—a mouthwatering entrée is nothing without a stellar (side)kick. We love to entertain our crew with a well-planned feast and know that the addition of crunchy, delicious sides can take a regular home-cooked meal to another level. To prove our own point, we tried and tested some of our favorite chef-inspired, everyday sides from Alexia to see how they fared against our BA burgers, ribs, and steak dinners. Well, the results are in. Whether you’re a waffle cut sweet potato fan or a groupie for house cut fries with sea salt, we’re sharing three winning meals that you can easily recreate at home where the sides shine as the true star.BBQ Ribs and Sweet Potatoes Are a Match Made in HeavenThere’s something so satisfying about biting into slow-cooked ribs slathered in a rich, tangy barbecue sauce. Our Best-Ever Barbecued Ribs get the low and slow treatment in the oven before they are finished on the grill and basted with the perfect combo of sauce and residual roasting juices. But it’s the addition of crispy sweet potatoes as a side that really makes this a meal to remember. The Alexia Waffle Cut Sweet Potato Seasoned Fries are lightly seasoned with a distinctive blend of sea salt, garlic, and onion for a surprising kick! The special mix of chili, black, and red pepper complements the tanginess of the ribs and is also perfect for dipping into a creamy and smoky sauce like chipotle mayo.A Steak Frites Dinner Isn’t Just for a Special OccasionBasically, you had us at “steak frites dinner.” Anytime we want to impress a group of friends (or our special someone) we bring out a secret weapon recipe—Steak with Lemon Butter and Jammy Lemon Halves. The winning combo of perfectly charred steak with charred lemon halves gets finished in the oven, finished with a creamy butter made with the flesh of preserved lemons, juice, and zest, and a plate of seriously crispy Alexia House Cut Fries with Sea Salt. Starting with farm-fresh potatoes cut with the skin on, these fries are made with only five ingredients (as guilt-free as you can get) and will take a killer steak night to the next level.These Waffle Fries Are Your Favorite Burger’s New BFFIf we had it our way, we’d probably have these BA Smash Burgers at the ready any night of the week. Simple ground chuck flat-seared on a hot grill pan, melty American cheese, shredduce (yes, that’s shredded lettuce), and simple pickles on a potato roll is as good as it gets. But whether you are making these beauties for a crowd or whipping one (or two) up for a chill night at home, they demand a side that’s worthy of their company. Enter Alexia Seasoned Waffle Cut Fries. These fries are anything but basic with a distinctive seasoning blend made with sea salt, pepper, onion, and garlic—what we consider a winning match for the ultimate make-at-home burger.Explore Bon AppétitFrench FriesSweet PotatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-01", "author": ["Condé Nast", "Alexia Foods"]}