{"id": "f5cbfba291d38bb820c4eef9cf17d14b", "url": "https://www.bonappetit.com/recipe/crispy-potatoes-with-bay-and-scallions", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Crispy Potatoes With Bay and Scallions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueCrispy Potatoes With Bay and ScallionsBy Vincent Medina and Louis TrevinoOctober 20, 20204.8(11)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintAt Cafe Ohlone in Berkeley, CA, cofounders Vincent Medina and Louis Trevino cook traditional Ohlone food using ingredients that are almost entirely indigenous to California’s East Bay, such as hand-harvested salt and California bay laurel. This dish was traditionally prepared with foraged native Brodiaea potatoes, though Medina and Trevino use more widely available Russian banana fingerlings to give the Brodiaeas time to regenerate. Medina and Trevino say: “You can see the landscape of this area reflected in the dish: It really brings home the interconnectedness of our land, food, and culture.” For readers who don’t have access to the same ingredients, we have called for more widely available substitutes in this adapted version of their recipe.Ingredients6 - 8 Servings2lb. fingerling or other small waxy\tpotatoes, scrubbed4fresh bay leavesKosher salt3Tbsp. duck fat, room temperature6scallions, sliced on a diagonal into \t½\" piecesPreparationStep 1Preheat oven to 425°. Combine potatoes, bay leaves, and a few handfuls of salt in a large pot. Pour in cold water to cover potatoes by 2\". Bring to a boil, then reduce heat and simmer until potatoes are fork-tender, 25–35 minutes.Step 2Drain and transfer potatoes and bay leaves to a large rimmed baking sheet. Coat evenly with duck fat; season with salt. Roast, shaking baking sheet once or twice, until golden and beginning to crisp, 25–30 minutes. Remove from oven and mix in scallions. Return to oven and roast until scallions are softened and browned at the edges and potatoes are golden brown and crisp, 10–15 minutes. Transfer to a serving dish.How would you rate Crispy Potatoes With Bay and Scallions?Leave a ReviewTell us what you thinkExplore Bon AppétitNative AmericanAmericanPotatoVegetableScallionOnion Fingerling PotatoSideNut-FreeDairy-FreeGluten-FreeRoastThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Vincent Medina", "Louis Trevino"]}