{"id": "f5dfda1187c4287929251df01109b338", "url": "https://www.bonappetit.com/recipe/ginger-mint-gandt", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "Ginger Mint G&T Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredGinger Mint G&TAndy Baraghani shares his own version of a Bombay & Tonic. Andy muddles mint and ginger to recreate a G&T inspired by his travels to Spain.By BOMBAY SAPPHIRE® GINApril 3, 20215.0(4)Read ReviewsTriangleEmailPinterestPrintTed + Chelsea CavanaughEmailPinterestPrintEmailPinterestPrintIngredients1½oz. Bombay Sapphire8fresh mint leaves, slapped, plus a sprig for garnish3oz. premium tonic water1½-inch piece ginger½tsp. honeyIcePreparationStep 1Combine the mint leaves, lemon wedge, ginger, and honey in a cocktail shaker. Muddle the ingredients just until they begin to release the juices from the lemon and mixture smells fragrant. Step 2Add Bombay Sapphire Gin, fill the cocktail shaker with ice and shake vigorously for 30 seconds until the shaker is very cold and frosty.Step 3Strain the mixture through a fine-mesh sieve into a balloon glass, and top with tonic water.Step 4Garnish with more mint and lemon peel.Click to Shop Bombay Sapphire NowBE BRILLIANT AND INSPIRED. DRINK RESPONSIBLY!©2021. BOMBAY SAPPHIRE AND ITS TRADE DRESS ARE TRADEMARKS.IMPORTED BY THE BOMBAY SPIRITS COMPANY U.S.A., CORAL GABLES, FL. GIN - 47% ALC. BY VOL.How would you rate Ginger Mint G&T?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleLemons not in ingredients list FYIAnonymous4/4/2021Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-03", "author": ["Condé Nast", "Bombay Sapphire"]}