{"id": "f5e42d4aaae6ed1e01b28748c66c2be7", "url": "https://www.bonappetit.com/story/castelvetrano-olives-are-the-best-olives", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "Castelvetrano Olives Are the Best Olives, Hands Down | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCastelvetrano Olives Are the Best Olives, Hands DownThese olives appeal just as much to the olive hater as they do to the olive enthusiast. If you don't already know, get yourself involved.By Alex DelanyJanuary 18, 2018FacebookTwitterEmailFacebookTwitterEmailI used to not like olives. No…that’s not true. I used to despise olives. There was a formative experience, early in my childhood, where I encountered some gnarly black olives in a salad from an Italian takeout joint. That salad scarred me, and as a result, I spent most of my childhood and young adult life cursing the name of the olive. Black canned. Oil cured. Kalamata. I didn’t know anything about them...except that I hated them. All of them.But that changed. A particularly noble olive took my hand and showed me that I had been squandering my time on this planet. It was upon eating my first Castelvetrano olive that I realized olives did not suck. Castelvetrano olives proved to me that my own stubbornness had robbed me of joy. I was lucky enough to see the light.Where other olives are mushy, Castelvetranos are firm. Where other olives are aggressively salty, Castelvetranos are mild and soothing. Where other olives are muddy shades of brown, Castelvetranos are a lively, pale shade of green. These olives don’t have leathery skin. The Castelvetrno is tender and crisp, almost fruit-like.And with so much going for it, there’s still its ultimate accolade. Castelvetranos taste like no other olive. The flavor is sublime, mild in a way that feels more like a warm ray of sunshine or the first breath of fresh air after a day in the office than anything else. They’re creamy, as if someone injected it with little hits of butter that melt on your tongue. The flavor whispers in your ear to grab a glass and the bottle of Grüner from the fridge. It is an enabler in the best, tastiest, most snack-able way.And now, the Castelvetrano is a staple in my apartment. I’ll throw a bunch of them in a bowl for parties. Warm some in olive oil and serve them with feta and bread for a more refined appetizer. Or just keep a tub in the fridge for when that weeknight Castelvetrano itch comes a knockin’. And in a quick olive sauce over chicken thighs or seared fish? Game over.The buttery Castelvetrano, lookin' like a snack.\nTed CavanaughBut let me just say this: Castelvetranos are a shadow of their former selves when pitted. Buy them with the pits in. And this Sicilian olive is also best in September and October, as all green olives (young olives) are. That isn’t to say you shouldn’t buy them year-round. They’re just even better in-season.Maybe you’re like I was. Maybe you’ve tried olives and decided, nah, I’m good. One and done. I’m retiring from the olive game forever. Castelvetrano olives will change you. These are the olives that olive haters and enthusiasts can agree on. They bring the people of the world closer together, and that is a beautiful thing.I haven’t encountered many perfect things in my life, but I can confidently say that the Castelvetrano olive is part of that exclusive club. Castelvetrano olives forever. And ever. And ever. Amen.Welcome to this wonderful world. Let's marinate some Castelvetrano olives.Marinated Olives and FetaAn appetizer you can have it ready within 10 minutes of walking in the door.View RecipeExplore Bon AppétitBasicallyOliveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-18", "author": ["Condé Nast", "Alex Delany"]}