{"id": "f5e521bdbabfe094cebf1413d5f50616", "url": "https://www.bonappetit.com/recipe/caramelized-plantain-parfait", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Caramelized Plantain Parfait Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueCaramelized Plantain ParfaitBy Rick MartinezAugust 18, 20205.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Rick MartinezEmailPinterestPrintEmailPinterestPrintUse plátanos manzanos—a short, fat, and incredibly sweet plantain variety—if you can find them. When pan-fried, the outside caramelizes and forms a hard shell while the inside becomes soft and custardy (like crème brûlée!). Look for them in Latin and Caribbean supermarkets or in the tropical fruit section of large supermarkets.Ingredients4 Servings6Tbsp. virgin coconut oil4ripe (spotted) plátanos manzanos or 2 large ripe (black) plantains, peeled, sliced in half lengthwiseKosher salt3cups plain unsweetened coconut milk yogurt or Greek yogurt2ripe mangoes, thinly slicedToasted nuts, seeds, and/or unsweetened shredded coconut (for serving)PreparationStep 1Heat oil in a large nonstick skillet over medium-high. Cook plantains, turning once, until deep golden brown, about 3 minutes per side. Transfer to paper towels to drain; season with salt.Step 2Divide yogurt among bowls; top with plantains and mangoes, then nuts, seeds, and/or coconut as desired.How would you rate Caramelized Plantain Parfait?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleMay I pose a question to the chef?  I live in central Mexico. I have access to platanos machos or platanos tabascos. Do you think these varieties would “perform” for this recipe?  Gracias. AnonymousSan Miguel de Allende 9/25/2020Explore Bon AppétitFruit DessertDessertParfaitPlantainVegetableMangoStone FruitFruitEasyQuickSnackGluten-FreeDairy-FreeHealthyishBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Rick Martinez"]}