{"id": "f5eff0e02e1e601b9ef0c9ecba200bb1", "url": "https://www.bonappetit.com/story/vacation-eating", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Vacation Doesn't Have to Be All About the Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureVacation Doesn't Have to Be All About the FoodHealthyish editor Amanda Shapiro on taking a break from caring about what and where she eats.By Amanda ShapiroMarch 7, 2019FacebookTwitterEmailPhoto by Ditte IsagerFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.When I told my co-workers I was going to Amsterdam on vacation, they were a little bemused. “What are you going to eat?”I tried to explain that I wasn’t going there for the food, but that didn’t really compute. I get it: We’re a bunch of weirdos who plan vacations around new restaurants and keep detailed maps of the best food in cities across the globe (I’m looking at you, Andy B.). Amsterdam isn’t exactly a city on every food person’s lips.The truth is, this trip was more about my boyfriend's interests than mine. He works in nightlife policy (yes, that’s a thing), and Amsterdam has some of the most creative and progressive nightlife in the world. So, yeah, you could call it research. And, to be honest, I was pretty excited to go to a city where I wouldn’t feel pressured to plan every day around food. I still collected recommendations from friends and the Internet (thank you to everyone who DM-ed me!), but I never felt like I had to eat certain things in certain places so I could prove my food-person cred.Instagram contentThis content can also be viewed on the site it originates from.And in the end: The food was great! Of course, it helps to go in without expectations (it also helps to sleep through breakfast most days—one less chance to misstep). We fell into a nice groove once we discovered that most of the natural wine bars served delicious food: Glou Glou’s cheeses and tinned fish with a glass of La Roche Buissière rosé, Bar Centraal’s roasted radicchio with molé, Cafe Binnevisser’s celeriac fritters and light-as-air olive oil cake, and on the day we did make it to breakfast, 4850 proved that a natural wine bar could also turn out delicate cinnamon buns and decadent breakfast sandwiches in its picture-perfect space. And speaking of the vibes—everywhere, big windows, tall ceilings, and perfect golden light.But perhaps the best thing I ate was at a place that was decidedly vibe-less, like imagine if your parents’ den were the size of a warehouse on an industrial strip and it also happened to serve food. It was here at Pllek, after a long night of “research,” that a plate of buttery, peppery, roasted oyster mushrooms piled on top of brown bread with thick smears of aioli brought me back to life.Just as Amsterdam’s nightlife is about more than stag parties, legal weed, and the red light district, its food scene is diverse and growing (not to mention you can get Oatly EVERYWHERE). I can’t wait to go back in a few years and check in with the wine bars, the pizza scene, the Israeli food, and the coffee culture. In the meantime, let me know if you want my map.Until next week,Amanda Shapiro\nHealthyish EditorExplore Bon AppétitessayHealthyishHealthyish NewsletterRead MoreLifestyleWhy I’m Slowing DownBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-07", "author": ["Condé Nast", "Amanda Shapiro"]}