{"id": "f5f542d834e157d43d527c4ab0f78270", "url": "https://www.bonappetit.com/story/best-japanese-restaurants-seattle", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "It's an Exciting Time to Eat at the Best Japanese Restaurants in Seattle | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopseattleWhy Seattle Is One of the Most Exciting Places to Eat Japanese Food Right NowFrom a six-seat omakase counter to a handmade-soba shop, the west coast is meeting the far east.By Elyse InamineSeptember 11, 2018FacebookTwitterEmailPhoto by Kyle JohnsonFacebookTwitterEmailSure, we love Seattle for the picturesque hikes and the Chilhuly installations and the seemingly endless Kumamoto oysters. But right now we’re booking it to the Emerald City for its amazingly deep and diverse Japanese food scene. There’s delicate nigiri made with local fish, fresh soba that’ll ruin you for the store-bought kind, and the greatest, weirdest little shop hawking strawberry sandwiches (it’s a thing!). And that’s just the start. Here are seven reasons why we’re eating only Japanese food the next time we’re in Seattle.Sake-scented clams and cod at Adana.\nPhoto by Kyle JohnsonThe New School Japanese Restaurant Everyone Is Talking AboutIgnore the clubby music and look closely at the walls to get a true sense of Adana, a crowd-pleasing spot in Capitol Hill from chef Shota Nakajima. You’ll spy pencil drawings of his dishes in development and sake cups collected during his days off from working 19-hour shifts at the Michelin-starred Sakamoto in Osaka. Nakajima weaves his serious training into his extremely affordable tasting menu ($37 for three courses), in which you might get fat asparagus covered in shreds of Dungeness crab served with egg-enriched tama miso (a clever cousin to gribiche) or craggy fried chicken with potatoes and leeks (an homage to his mom’s recipe).All the carbs at Fuji Bakery.\nPhoto by Kyle JohnsonThe Japanese Bakery That’s Become a Local FixtureFuji Bakery, a trio of shops from Joël Robuchon–trained pastry chef Taka Hirai, might just be the sleeper hit of power-breakfast spots. Everything is baked at the Queen Anne location, but there’s something sweet about the cramped International District outpost. There’s never a dull moment, with professors, protesters on break, and office workers revolving in and out through the morning for a quick coffee and something carby: squishy savory curry puffs; buttery latticed ham-and-cheese pastries; and the most delicate rectangular croissants crowned with strawberries. Grab a stool at the counter lining the window, people-watch, listen to workplace drama, and stuff yourself silently.Chef Shiro Kashiba of Sushi Kashiba.\nPhoto by Kyle JohnsonThe Sushi Master Behind Seattle’s Sushi MastersShiro Kashiba is the man. After honing his sushi-making skills under Jiro Ono (yes, that one), he set up Shiro’s in Seattle, where he spread the gospel of Edomae (curing fish to bring out flavor) for two decades. Now 77, Kashiba could call it a day and rest on his legacy, but he’s still at it with Sushi Kashiba, a spare, blond- wood-lined omakase oasis he opened just over two years ago in the middle of tourist-swollen Pike Place. Line up at 3 p.m. (trust) to secure one of the 14 counter seats, then experience the pro at work by eating as many of the masterful nigiri as you can. (At around $100 for 15 pieces, it’s a steal.) Ganbatte!Chef Kotaro Kumita of Wataru.\nPhoto by Kyle JohnsonThe Omakase Counter Where You’ll Find Every ChefAsk a chef in Seattle for his or her favorite sushi spot, and chances are you’ll end up at Wataru in Ravenna. Locals truly appreciate the obsessive attention to detail on display, from the various salts and citrus that season the fish to the super-fresh seafood selection. Perhaps it’s because he’s in a space that feels as drab as an office, but chef Kotaro Kumita specializes in making something out of nothing. He turns typically watery gomae into a sweet, complex spinach salad and smokes sea bream for sashimi, yielding a flavor that verges on barbecue. It’s tough to reserve one of the six coveted counter seats (stalk the Yelp page), but you’re still in good hands at one of the few tables.The gleaming display at Sandwich House Tres.\nPhoto by Kyle JohnsonThe Most Charming Little Sando ShopSandwich House Tres in Bellevue is a strip mall storefront serving Japanese-style sandwiches that are even better than what you get at 7-Elevens in Japan (already a very high standard). The supersoft milk bread is baked in-house (the crusts are cut off and neatly piled in a plastic bin for free snacking), and each sandwich is thoughtfully made, not to mention time-stamped for guaranteed freshness. Get the shrimp katsu sandwich with a swipe of sweet, oniony egg salad for now and the very aesthetically pleasing strawberry one for later. It’s like a sandwich version of a strawberry shortcake, with quartered strawberries spackled together with airy whipped cream.Plating a fish cake in a lacquer bowl at Wa’z.\nPhoto by Kyle JohnsonThe Transporting Kaiseki ExperienceChef Hiro Tawara brings a peculiar yet delightful sensibility to Wa’z, his kaiseki counter in Belltown. Along with two other cooks, he carefully leads you through an eye-opening experience in nine humble-looking but mind-melding dishes ($110/person), from that first bite of cooling sea urchin from Hokkaido to a heavenly cod-and- shrimp cake to a bowl of red snapper with ethereal dashi and spicy sprigs of mitsuba. You’ll forget you’re in Seattle.Kamonegi’s buckwheat soba.\nPhoto by Kyle JohnsonThe Can’t-Miss NoodlesIf you see Mutsuko Soma run into the closet during a busy dinner service at Kamonegi, don’t be alarmed. She’s just making a fresh batch of her soba noodles, which have a grassier flavor and chewier texture than the packaged variety. Lovingly and laboriously made soba is the star of her Fremont restaurant, whether cold and dipped into buttery scallop dashi or hot and swimming in an über-savory duck soup. Kamonegi has a wacky setup, with a very tiny bar area to the right of the kitchen and, to the left, a larger dining room. But the best seat in the house is at the five-seat counter, where you can see Soma rolling and cutting the noodles out of the corner of your eye.Explore Bon AppétitJapaneseCity GuidesSeattleJapanRead MorecookingA Fruit Sando Is a Dessert Sandwich Filled with Joy and Whipped CreamBy Elyse InaminerestaurantsKatsu Sandos Are Everywhere, and We’re Here For ItBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-11", "author": ["Condé Nast", "Elyse Inamine"]}