{"id": "f5fb4c871d466569d94efb6ef97caa9c", "url": "https://www.bonappetit.com/recipe/perfect-pizza", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "Bon Appétit's Perfect Pizza Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueBon Appétit's \"Making Perfect\" PizzaBy The Bon Appétit Test KitchenApril 25, 20194.1(55)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintYou’ll only use one 200 g ball of dough and about 3 Tbsp. pizza sauce to make one pie, so you’ll have lots left over—with the best-ever excuse to invite people over for a pizza party. And with the amount of love, time, and research that went into making what constitutes the “perfect” pizza, you’ll definitely want to share. But you can also freeze the dough for up to two weeks to keep it on hand for whenever you need it. Watch the preview for our show on how it all came together here.IngredientsMakes one 10\"-diameter piePizza Dough250g Central Milling Organic High Mountain flour150g freshly milled flour (from Central Milling Organic Steel Cut Cracked Wheat) or Central Milling Organic High Mountain flour or high-quality whole wheat flour30g Diamond Crystal kosher salt600g King Arthur all-purpose flour, plus more for dusting150g sourdough starter50g Frankie’s extra-virgin olive oil5g fresh cake yeast, finely crumbledPizza Sauce228-oz. cans Bianco DiNapoli whole peeled tomatoes3thin slices of garlic (not 3 garlic cloves, thinly sliced!)2Tbsp. Frankie’s extra-virgin olive oil¼tsp. kosher saltAssembly1oz. imported mozzarella di bufala (such as Antiche Bontà Mozarella di bufala Campana), torn into quarter-size pieces1oz. fior di latte mozzarella, torn into quarter-size pieces2Tbsp. extra-virgin olive oil, plus more4oz. maitake mushrooms, torn into 1\" piecesKosher salt, freshly ground pepper2Calabrian chiles from a jar, coarsely chopped1200 g ball Pizza Dough (see above)King Arthur all-purpose flour (for dusting)3Tbsp. Pizza Sauce (see above)½garlic clove, very thinly sliced4oz. 2-year-aged Parmesan, coarsely grated6basil leaves, torn1lemonSpecial EquipmentA Breville Pizzaiolo oven; a wooden pizza peel (no more than 10\" wide and ¼\" thick); a kitchen scale; a bench scraper; a food millPreparationPizza DoughStep 1Mix High Mountain flour, freshly milled flour, salt, and 600 g all-purpose flour in the bowl of a stand mixer fitted with the dough hook just to combine.Step 2Whisk starter and 660 g room-temperature water in a large measuring glass to combine, then add oil and yeast and whisk until well blended.Step 3Make a well in dry ingredients and pour in starter mixture. Mix on low speed, increasing speed to medium as dry ingredients are incorporated, until well combined. Scrape down sides of bowl and fold in any flour, if needed. Remove bowl from mixer and scrape dough from hook. Cover bowl with plastic wrap; let dough rest at room temperature for 30 minutes.Step 4Uncover dough and fit bowl back onto mixer. Mix on medium speed until you're able to pinch and stretch a small piece of dough between your fingers until translucent and doesn’t rip, about 10 minutes (dough should look sticky but cohesive, and it should be very elastic and jiggly). Transfer dough to a very large bowl, cover tightly with plastic wrap, and let rise in a warm, draft-free spot (near the oven is great) until 50 percent expanded in volume, about 3 hours.Step 5Turn out dough onto a lightly floured surface. Lightly flour your hands, scale, bench scraper, and 2 small rimmed baking sheets.Step 6Divide dough into 200 g portions. Working one at a time, form each portion into a tight, even ball, rotating on counter and tucking under and pinching on bottom of ball to seal. Try to handle the ball as little as possible to keep dough from deflating. Using bench scraper, place balls seam side down on floured baking sheets, spacing evenly apart. Lightly sprinkle dough with some flour and cover baking sheets tightly with plastic as you go. Chill at least 24 hours and up to 48 before using.Step 7Do Ahead: Dough can be made 2 weeks ahead. Wrap balls tightly with plastic wrap and freeze. Let thaw in refrigerator overnight. Note: The frozen dough won't bake with as many bubbles or be as light as the fresh dough. It might also be stickier and harder to work with. Because of the idiosyncrasies of using starter, the success of using frozen dough will vary.Pizza SauceStep 8Place tomatoes (without juice from can) in a colander to drain. Pass tomatoes through a food mill (using the medium disk) into a medium bowl (you should have about 2 cups purée). Mix in garlic, oil, and salt. Let sit at least 30 minutes before using.Step 9Do Ahead: Sauce can be made 2 days ahead. Cover and chill.AssemblyStep 10Preheat a Breville Pizzaiolo oven to 700°. Place mozzarella and fior di latte in a fine-mesh sieve set over a medium bowl and let sit 30 minutes to drain.Step 11Drizzle a little oil in a large skillet and swirl pan to lightly coat. Heat over medium-high. Add mushrooms in a single layer and cook, undisturbed, until lightly browned underneath and starting to soften, about 3 minutes. Season with salt and pepper and toss mushrooms. Continue to cook, tossing occasionally, until lightly browned all over and softened, about 3 minutes more. Remove from heat and set aside.Step 12Place chiles in a small bowl and mix in just enough oil to make a tight sauce; set aside.Step 13Use a bench scraper to swiftly lift a ball of Pizza Dough from baking sheet, then invert it into a large bowl of flour, seam side up. Pass dough back and forth between your hands to knock off some flour. Place domed side up on work surface and use your fingertips to press dimples in dough, working from the center toward the outer edge and maintaining a circular shape. Stop dimpling 1\" before outer edge of dough (this will become the crust, and you want it to rise and puff higher than the center of the dough). After dimpling, stretch dough over the backs of your hands, moving in a circular pattern to create a 10\" round. Place onto very lightly floured peel.Step 14Spoon Pizza Sauce onto center of dough. Working in a spiral from the center outward, use spoon to spread sauce all the way to the inner edge of the crust.Step 15Top pizza with drained mozzarella and fior di latte, then garlic. Scatter several pieces of reserved mushroom around and sprinkle 1 Tbsp. Parmesan over. Slide pizza into oven and cook, rotating halfway through, until crust is puffed and charred in spots, cheese is melted, and underside of crust is golden brown with some darker leopard spots, 3 minutes. Remove pizza from oven. Drizzle with reserved chile sauce and sprinkle with another 1½ tsp. Parmesan. Arrange basil on top and finely grate a light dusting of lemon zest over.How would you rate Bon Appétit's \"Making Perfect\" Pizza?Leave a ReviewTell us what you thinkReviews (42)Back to TopTriangleSo... There are problems with the writing of this recipe, but despite that the dough came out great. I watched the Bon Appetite show about making the best pizza and wanted to try that recipe!  I'm not disappointed. The dough was very supple to handle and had great texture.Pizza FridaysPhiladelphia, PA10/17/20212 things so far: At step 2. First, 1000 grams of flour in total with all 3 types is A LOT of flour for \"one 10\" pizza\" as the receipe claims to make. Second, when looking over the recipe list I noticed there is no liquid put in this recipe other than the starter but then in step 2 it tells you to mix 660 grams of warm water with the starter. \n\nJane DoeSan Bernardino, CA 924072/15/2021I am 3. i steald my mommies compooter  becwus e this peeza was trash. itgived me da runs and maded my mommie give me bathe. big umdbs donw >:( Constipated three year old My mom2/11/2021Two questions: \n1) it seems like the 150 g of flour can either be whole wheat OR the same white bread flour (the 250 g of CM high mountain), wouldn't they behave differently in the recipe, since whole wheat absorbs more water?\n2) what is the starter fed with?  I usually feed mine with all purpose flour, but sometimes use bread flour depending what I am baking.  This can make a difference.Anonymousoakland, ca8/4/2020We've made this recipe a few times and it's so good. The first time we made changes to the original recipe and thought it was good but missing something. The second time we made it almost exactly as written, and it was so good, some of the best pizza I've ever had. The only small change we made was sprinkling on a little salt after putting on the sauce. We've proofed the dough 24 hours and 48 hours, and prefer the flavor of the dough with a 24-hour proof.Anonymous7/13/2020Best pizza ever!!!! It made 9 pizzas. 1 10 inch is enough for 1 person. So this feeds 9 people. We used our grill at 700° and a pizza stone. Definitely would recommend. We’ve tried many pizza recipes and this one surpasses them by a lot. AnonymousFlower Mound, Tx7/7/2020Fantastic results. Thanks BA team for doing all the leg work and distilling everything down to one recipe. The sauce is phenomenal.  The maitake mushroom pizza is the bomb. I used pizza dough from an Italian store near me and it worked out very well. I made a mortadella pie as well. Delish!AnonymousToronto 5/14/2020Fantastic dough, sauce, everything.AnonymousCharlottesville, Virginia4/27/2020I'm unsure of how many pizzas this recipe actually makes. The top says it makes 1 10\" pizza but this obviously isn't true (unless that 10\" pizza weighs a couple kilos). How much would I have to scale down the recipe to make 3-4 pizzas? Thanks. Love the work that went into making it BTW!csjhOttawa4/4/2020It really annoys me that this recipe isn't rated higher and that people rate it one star because it looks \"pretentious\". It makes fantastic pizza! Granted, I've only been able to make it with ingredients that are local to me, but this recipe is such a great guide to experiment with different flour combinations. Tip: if you only have a standard oven, I really recommend blind baking the dough once you've shaped it, but before you sauce it and put toppings on. If you cook it like this until it just starts to go slightly browned, you will end up with a crispier pizza with a more authentic taste. KrisbarrassVienna, Austria (originally Sunderland, UK) 1/25/2020The crust was a lot of work. We proofed the dough for 48 hours and it had good texture, the best homemade crust we've made but felt like it could have used a little more flavor, definitely more salt. We really liked the toppings, the sauce with Bianco DiNapoli tomatoes was probably our favorite component of the pizza. The mushrooms were delicious as well. The chiles were overpowering so I would not use those again. I like lemon but we skipped that and didn't miss it.Anonymous1/10/2020WARNING!: There is an error in the recipe write up. Under the ingredient list the recipe calls for \"4 oz. 2-year-aged Parmesan, coarsely grated\". This is an insane amount of parmesan cheese for 1, 10\" pie. Please refer to the end of the write up where they say to add 1Tbsp + 1.5 tsp of parm and not over a cup of grated cheese. I started off adding over an ounce and it was overpowering. Also the recipe calls for 2 cans of \" Bianco DiNapoli whole peeled tomatoes\" but 1 can makes more then you will need for 9 pizzas. I would estimate 1 can made enough for 15 pies at 3Tbsp per pie.\n\nDisclaimer: I made the Perfect Pizza with the following 2 exceptions:\n1) I do not have a Breville Pizzaiolo oven, but instead used my oven that gets to 600 degrees and a large baking steel.\n2) I do not have a flour mill and instead of milling 150 g of cracked wheat I used 100 g of Central Milling fine whole wheat flour and 50 g of Central Milling medium whole wheat flour.\n\n-Review-\n\nThere seems to be a lot of reviews for this pizza that did not follow the recipe at all or even try and make it. As a home baker I am extremely lucky to live about 40min from a central milling retail location and have access to specialty food stores that carry the other hard to find ingredients. \n\nThe dough is amazing with great feel, elastability, flavor and texture. I will be making this dough again in the future, maybe scaled down to make 4-5 pies instead of 9. I did say “Kitten Fingers!” a lot while dimple-ing the dough to the amusement of my family and friends and I feel like it was instrumental in the success I had. Note: It tripled (not doubled) in size during the 3 hour bulk rise stage so be sure you have a bowl or container large enough. After I portioned them into 200g balls and left them in the fridge for 30 hours they had not risen as much as I had hoped so I left them on the covered baking sheet out at room temp for an additional 2.5 hours before I started baking and they were perfect from start to finish. Note: I live on the west coast and cake yeast proved to be almost impossible to locate. I ended up having to drive quite a distance to obtain it and was only able to do so because I made this during the christmas holiday season. In the future I will be forced to substitute dry yeast.\n\nThe sauce was great. Bright, sweet and acidic. I liked it a lot, especially on the mushroom \"perfect pizza\" and when used to make a margarita pizza. I am a convert to Bianco DiNapoli tomatoes now and this is probably the best thing I learned about from this recipe. As I said earlier in my review you only need 1 can if your doing a single dough batch as you only use 3 Tbsp per pie. (I used the second can I bought to make some tomato soup that knocked my socks off!) In the videos the pizza places hung up on Andy when he asked what brand of canned tomatoes they used, but when Clair visited them to learn to make dough you can see pallets of Bianco DiNapoli tomatoes in the background. \n\nThe cheese hybrid was better than either is alone and made for a creamy rich “perfect” pizza. The imported mozzarella di bufala was the most difficult ingredient to source after the cake yeast, but was worth the trouble and expense. Do NOT skip or rush the step where you drain the cheese. I left it draining for an hour and it was still losing water. The pies at the end where mush less soupy then the ones at the beginning even after an hour drain. Once again; Do not add 4oz of parm to your pizza. Even a quarter of that will ruin the delicate flavor of that expensive/exquisite mozzarella di bufala.\n\nThe toppings were wonderful. The maitake mushrooms are expensive but are superior to every other mushroom pizza I have ever had. Definitely worth it. The Calabrian chiles worked very well with the rest of the flavors but I saw no advantage to chopping them and adding them to oil myself instead of using the pre-crushed ones that come in oil already. I tried both and tasted no difference in the end. (I have been using the oil to top just about everything I eat now. Move over hot sauce!) The lemon zest was a great way to brighten the pizza’s flavor profile and worked very well with the rest of the ingredients. The fresh “whisper thin” garlic slices were not very noticeable when you ate a slice but I would not have wanted to add more to this pizza.\n\n-Conclusion-\n \nIs it the perfect pizza? I don’t know. \nIs it the best mushroom pizza I have ever had? Yes.\nIs it the best pizza I have ever made at home in my oven? Yes.\nWas it worth all the effort it took? Absolutely.\nWill I make this again? Yes.WineCountryBakerNapa, CA12/23/2019So, I’m not gonna comment on the dough, didn’t have time to make a starter and get a bunch of special flours. \n\nThe sauce is simple, straight forward, and delicious. Nothing else to say. \n\nWhat I think is the biggest take away you should get from this recipe is that the combination of Calabrian chili, maitake mushroom, and lemon zest is absolutely, unbelievably delicious. Find a dough recipe, any will do. Wanna make a pan pizza? Put those toppings on it. Wanna make a Detroit style? A deep dish? Doesn’t matter. Put those toppings on it. \n\nI don’t even like mushrooms! AnonymousChicago9/6/2019I just prepared this dough, turned out perfect! I didn't have any of the special flour, not the ability to mill my own, so substituted just 1kg of high protein bread/pizza flour.\n\nI see a lot of reviews complaining that this recipe uses special equipment and expensive ingredients. Remember that this is Make Perfect, so using the best ingredients and special equipment is the best path. Having said that, the flour can be replaced (as I did) and just use your regular oven turned to the highest temp with a pizza stone inside and it will cook fine.\n\nFinal thought, anyone complaining about the use of grams needs to get serious. How do you measure 0.17637 ounces of fresh yeast. Please...\n\nGreat work BA team. Looking forward to Making Perfect : Burgers!BeerPoetBrisbane, Australia8/8/2019I loved the series and everyone in it. Even though I knew I'd never be able to replicate the recipe at home, I learned some things. First, Bianco DiNapoli tomatoes are the very best canned tomatoes that I've ever tasted and beat out all of the San Marzano DOP tomatoes that I have tried. (You can get them at the market sometimes referred to as Whole Paycheck.) I learned that raw sauce rocks! I learned how to char a crust by getting the heat source (oven) stupid hot. I put a baking stone on my gas grill, turning all burners on high. My pizza was done in three or four minutes with a perfectly charred crust! Next, I learned to choose my toppings more selectively, choosing only a few great ingredients. Previously, I was a dump-everything-you-have-on-top kind of guy. My only wish is that I could have been there when they finally tasted that perfect pizza. I bet it was to-die-for. AnonymousTucson, AZ8/5/2019Explore Bon AppétitPizzaCanned TomatoTomatoVegetableMainSnackVegetarianNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-25", "author": ["Condé Nast", "The Bon Appétit Test Kitchen"]}