{"id": "f5fd5ce971fea3dc75d99785cd04ac99", "url": "https://www.bonappetit.com/recipe/grilled-naan-with-tomatoes", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "Grilled Naan With Tomatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGrilled Naan and Tomato PartyBy Sohla El-WayllyAugust 9, 20203.8(18)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Sohla El-Waylly EmailPinterestPrintEmailPinterestPrintSnatch up summer’s big, juicy heirloom tomatoes and join Sohla El-Waylly for a grilled naan and tomato party. “Grated raw tomato and ghee-sizzled nigella seeds create a base for pretty-in-pink raita and get smeared on the naan during grilling,” she writes. “Meanwhile, big tomato wedges are tossed in spiced yogurt before charring on the grill, which approximates the super high heat of a tandoor (in which naan are traditionally baked). The dough for the naan is sticky and soft, but don’t be tempted to add flour. A supple and moist dough is key to a tender, bubbly bread. Just keep kneading and the dough will grow bouncy and smooth. If you haven’t worked much with yeast, don’t fear! Flatbread is a forgiving place to start playing with fermentation.” P.S. If you don’t have a grill, you can make this using your broiler.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Bowl$18 At AmazonWhisk$10 At AmazonWooden Spoon$6 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketScaleSmall Saucepan$155 At AmazonBox Grater$13 At AmazonMedium Bowl$17 At AmazonSmall Bowl$13 At AmazonMicroplane$16 At AmazonPastry Brush$9 At AmazonWire Rack$23 At BA MarketRimmed Baking Sheet$20 At Bon Appétit MarketTongs$13 At AmazonIngredients4 servings3⅔cups (416 g) all-purpose flour1Tbsp. plus 2 tsp. Diamond Crystal or 1 Tbsp. Morton kosher salt, plus more1Tbsp. plus 1 tsp. sugar1¼-oz. envelope active dry yeast (about 2¼ tsp.)2cups plain whole-milk Greek yogurt, divided3Tbsp. plus ½ cup ghee or unsalted butter, divided5large tomatoes (2½–3 lb.), preferably heirloom, divided3tsp. nigella seeds, divided2garlic cloves1Tbsp. fresh lime or lemon juice1tsp. coriander seeds1tsp. mustard seedsFlaky sea saltPreparationStep 1Make your dough: Whisk 3⅔ cups (416 g) all-purpose flour, 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, 1 Tbsp. sugar, and one ¼-oz. envelope active dry yeast (about 2¼ tsp.) in a large bowl to combine. Add ½ cup plain whole-milk Greek yogurt and 1 cup warm tap water (about 95°) and stir with a wooden spoon, adding more water by the tablespoonful if needed, until all of the flour is moistened and mixture comes together in a shaggy mass, about 1 minute. (The dough will not be smooth at this point; you just don’t want any spots of dry flour remaining.) Cover with a plate and let sit at room temperature 15 minutes.Step 2Melt 1 Tbsp. ghee or unsalted butter in a small saucepan; remove from heat. Knead dough in bowl until it comes together into a smooth mass, about 2 minutes. Transfer dough to a clean surface (don’t flour) and continue kneading until smooth and elastic, 8–10 minutes more. (The dough will feel very sticky at first and grow smooth and soft as you go. Avoid adding more flour if possible.) Roll dough against work surface to form into a ball and return to bowl. Coat dough all over with reserved melted ghee and turn seam side down; reserve saucepan. Cover bowl tightly with a silicone lid or plastic wrap. Let dough sit in a warm, dry spot until doubled in volume, 1–1½ hours (or chill until doubled in volume, 12–16 hours).Before the rise.\nPhoto and Food Styling by Sohla El-Waylly After the rise!\nPhoto and Food Styling by Sohla El-Waylly Step 3Meanwhile, make the fresh tomato sauce. Grate 1 large tomato on the large holes of a box grater over a medium bowl.Step 4Melt 2 Tbsp. ghee or unsalted butter in reserved saucepan over medium-high. Add 2 tsp. nigella seeds and cook, stirring, until fragrant and sizzling, about 30 seconds. Scrape ghee and nigella seeds into grated tomato; season with kosher salt. Reserve saucepan. Transfer half of tomato mixture to a small bowl.Step 5Lightly smash and peel 2 garlic cloves. Using a Microplane, finely grate garlic into small bowl with tomato mixture (the remaining mixture in the medium bowl will be used for the raita); set tomato sauce aside.Step 6Now make the raita. Add 1 cup plain whole-milk Greek-style yogurt, 1 Tbsp. fresh lime or lemon juice, and 1 tsp. sugar to remaining grated tomato mixture in the medium bowl (the bowl you didn’t just add the grated garlic to!) and season with kosher salt. Set raita aside for serving.Step 7Finish the naan and tomatoes: Melt remaining ½ cup ghee or unsalted butter in same saucepan. Remove from heat and set near work surface along with a pastry brush (2 Tbsp. will be for the tomatoes and the remaining for the naan).Step 8Uncover dough and punch down; transfer to a clean unfloured surface. Using a bench scraper or chef’s knife, divide dough into 8 pieces (about 3.5 oz. each). Photo and Food Styling by Sohla El-Waylly Step 9Working with 1 piece at a time, cup your hand over dough and roll against work surface to form into balls. Brush with reserved ghee and return to bowl. Cover and let sit 20 minutes if proofed at room temperature and 1 hour if proofed in the refrigerator (it should look slightly puffed and take a second to bounce back when you poke it).Photo and Food Styling by Sohla El-Waylly Step 10Meanwhile, mix 2 Tbsp. melted ghee, 1 tsp. coriander seeds, 1 tsp. mustard seeds, remaining 1 tsp. nigella seeds, remaining ½ cup plain whole-milk Greek yogurt, and remaining 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt in a large bowl. Cut remaining 4 large tomatoes into quarters and place in spiced yogurt as you go. Gently toss to evenly coat; set aside.Step 11If grilling naan, prepare a grill for medium-high heat; oil grate. (If not, skip to step 14.) Gently stretch 1 ball of dough by holding it with 1 hand and letting it hang in the air while you pull the edges with the other and rotate until you’ve created an oval that’s about 10\" long and 6\" wide. Transfer to a parchment-lined baking sheet and brush with ghee. Repeat with remaining balls of dough, arranging 2 pieces of dough side by side, then covering with a sheet of parchment and stacking 2 more pieces on top.Photo and Food Styling by Sohla El-Waylly Step 12Head out to the grill with dough, yogurt-coated tomatoes, flaky sea salt, remaining melted ghee, and reserved tomato sauce. Place 2 rounds of naan on grill, ghee side down. Brush with more melted ghee, evenly spread 1 Tbsp. tomato sauce over each, and sprinkle with sea salt. Cook, undisturbed, until top is puffed and bubbling in places and underside is charred in spots, about 1 minute. Turn and grill on other side until lightly browned, about 30 seconds. Wrap in a kitchen towel to keep warm. Repeat with remaining naan.Photo and Food Styling by Molly Baz Step 13Place a wire rack on grill and grill yogurt tomatoes on rack, turning every minute, until lightly charred in places and spices begin to pop, 8–10 minutes. Transfer to a platter.Step 14If baking naan in the oven, place a rack in position just below broiler. Place a large cast-iron skillet or griddle on rack and heat broiler. Gently stretch 1 ball of dough by holding it with 1 hand and letting it hang in the air while you pull the edges with the other, and rotate until you’ve created an oval that’s about 10\" long and 6\" wide. Brush with ghee.Step 15Carefully slide out rack with skillet from oven and place naan in skillet (bake one at a time if using skillet and two at a time if using griddle), ghee side down. Quickly brush other side with ghee, evenly spread 1 Tbsp. tomato sauce over each, and sprinkle with flaky sea salt. Immediately return to oven and bake until bubbly and charred in spots, about 4 minutes. Roll and stretch the next piece of dough while the first one bakes. Remove pan from oven and wrap naan in a kitchen towel to keep warm. Repeat with remaining naan.Photo and Food Styling by Sohla El-WayllyStep 16Once you’ve cooked your last piece of naan, arrange yogurt-coated tomatoes in same cast-iron skillet, skin side down, and pour any yogurt in the bottom of the bowl over. Broil, turning often, until charred in spots and spices begin to pop, 8–10 minutes.Step 17Serve naan with yogurt-coated tomatoes and raita.Step 18Do ahead: Tomato mixture (without garlic) can be made 2 days ahead; cover and chill. Raita can be made 2 days ahead; cover and chill.How would you rate Grilled Naan and Tomato Party?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleAbsolutely will make again! In fact, TONIGHT!!! My husband and I loved the naan and raita so much last time, it's on the menu for our Sunday night dinner! Along with Super Simple Chicken Tikka Masala (Teighan Gerard - HBH), Aloo Masala (Tejal Rao - NYT Cooking --> but we like to add peas!), and Saag Feta (Priya Krishna - BA). Reading through the steps seemed complicated, but once you're cooking along with it, it's simple and straight forward. LOVED LOVED the naan with the tomato nigella seed mixture! Sohla you're a mastermind!AnonymousCanada11/1/2020Took too long to make and lacked flavor. Very disappointed.Anonymous8/24/2020Thank you Sohla for this recipe! The best thing I've made recently! I didn't have a cast iron skillet so I ended up pan frying the naan but it worked out perfectly! Anonymous8/23/20200 stars for CNE, 5 stars for Sohla and this recipe!\nAwesome concept and huge flavor payoff at the end--my favorite use of summer tomatoes this year! This was definitely a project recipe and lots of fun but also pretty time-consuming for a weeknight dinner, so just be prepared for that going in. I couldn't get nigella seeds in time so I subbed a combined 2 tsp cumin seeds and 1 tsp celery seeds--slightly different flavor profile than nigella but still really delicious! Also ended up getting distracted at the end and leaving my tomatoes in for more like 15 minutes, which meant that the yogurt marinade got pretty separated. Still tasted great, but I will definitely watch the timer more closely next time.\nWhen making this again I'd want to figure out some timing issues--if you're doing the broiler method and only have room for one naan at a time, it can take 45+ min to cook all the naans individually, which means that some of your dough will be proofing in its last step for over an hour instead of the original 20 min and might get a little too puffy and flimsy. Would recommend finding a way to do at least two naans at a time!AnonymousNew York, NY8/17/2020This was tasty but I struggled with a few aspects. When shaping the naan, I ended up with thin centers and thick edges, which made it difficult to grill evenly - I ended up with some very crisp/burnt centers. The tomatoes stuck quite badly on my grill - I think I left them a bit too long when I first put them on, you really do need to turn them every minutes, and next time I would re-oil my grill before cooking the tomatoes. AnonymousMinnesota8/17/2020I found the same pan at a thrift store the other day and decided to try this out. Completely delicious, definitely would make it again! Mixing the tomatoes in with the marinade before making the bread in the oven (which take a while when cooking them one by one) made the marinade very liquidy, and the baking the tomatoes was liquidy, and so on. I’drecommend waiting a bit before mixing together. Other than that very small note - 5 stars!!Anonymous8/14/2020The naan is so good and easy to make!!! Anonymous8/13/2020You all forgot to clarify how much \"are you effing kidding me?\" colonizing fueled audacity one should include in the recipe.  AnonymousLos Angeles8/11/2020BACKPAY FOR SOHLAAnonymousChicago, Illinois8/11/2020This recipe is fantastic with a side of PAY-YOUR-BIPOC-EMPLOYEES-EQUALLY! 10/10 would stand up for racial equality again!nate_eraPennsylvania 8/10/2020Wow eff off Bon Appetit. You made Sohla record this video knowing that you were going to stiff her on her contract, and after she quit video, you posted this anyway.\n\nNo class.h27NJ8/10/2020Oof kind of weird you posted this after she left y'all since you can't treat people of color right?AnonymousAustin8/10/2020Explore Bon AppétitFlatbreadBreadSoutheast AsianAsianTomatoVegetableYeastOther IngredientsHeirloom TomatoSummerMainVegetarianGrillingDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-09", "author": ["Condé Nast", "Sohla El-Waylly"]}