{"id": "f60819815f077de28724522185f07263", "url": "https://www.bonappetit.com/story/anatomy-of-perfect-breakfast-taco", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "The Anatomy of the Perfect Breakfast Taco | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Anatomy of the Perfect Breakfast TacoHigh-quality tortillas make all the difference.By Adam RapoportSeptember 10, 2019FacebookTwitterEmailPhoto by Emily SchultzFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Every now and then, the stars align in the BA Test Kitchen. Like, when you go to your friends’ fantasy-league football draft and they serve you too much light beer and you show up at work the next morning feeling extra crusty, but there’s social media editor Emily Schultz standing over a stack of flour tortillas, announcing that she’s making breakfast tacos for everyone.Not that I’m an authority or anything, but the key to quality tacos—no matter the time of day or meal—starts with the tortillas. Schultz was working with ones that she ordered online from Caramelo. She quickly charred them over a gas flame with a set of tongs, and then tucked each, as she went, into a folded-over cotton dish towel to keep them warm.Caramelo's tortillas, made in Lawrence, Kansas, with either duck, pork, or avocado fat, are supremely moist and flavorful. I highly recommend ordering a pack. And if you live in the New York area, check out the equally delicious flour ones by Vista Hermosa. Good tortillas make all the difference.Want this letter before it hits the website? Sign up for our newsletter!I hopped on scrambled-egg duty, cracking a dozen eggs in a mixing bowl and beating them aggressively till the whites and yolks were fully incorporated and a touch frothy. I like my eggs custardy, so I set a large nonstick pan over medium-low heat with a healthy amount of butter. I stirred and stirred with a rubber spatula 'til small curds formed and when the eggs began to resemble the consistency of soft polenta, I pulled the pan from the heat. Start to finish? Maybe five minutes.In my mind, ripe, buttery avocados are a must for any breakfast taco. And if I’m serving avocados, that means I’m dousing them with lime juice and a pinch of Maldon.Fresh cilantro, if you’ve got it on hand, is always a nice touch. Chopped scallions, too. Hot sauce? Of course. Frank’s, Crystal, Cholula or Valentina. I just don’t need anything smoky or crazy hot first thing in the ayem.If I was in Austin, Texas last week, I wouldn’t have said no to bacon or potatoes or brisket in my breakfast taco. But I was in the BA Test Kitchen with Schultz running the show, and for that, my extra-crusty self was extremely thankful.Explore Bon AppétitAdam NewsletterBreakfastTacoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-10", "author": ["Condé Nast", "Adam Rapoport"]}