{"id": "f61e75a719a9a40eb30367c010565cf6", "url": "https://www.bonappetit.com/story/constance-wu", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "Constance Wu's Best Night Includes Pajamas, a Perfect Manhattan, and Bunny Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureConstance Wu's Best Night Includes Pajamas, a Perfect Manhattan, and Bunny TimeThe ‘Crazy Rich Asians’ star also has a thing for fruity Mentos.By Alyse WhitneyDecember 21, 2018FacebookTwitterEmail(Photo by Steve Granitz/WireImage)Photograph by Steve Granitz/Getty ImagesFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Up next is Constance Wu, the Golden Globe-nominated star of Crazy Rich Asians and Fresh Off the Boat on ABC.Constance Wu grew up in a Taiwanese household, but when she thinks of her comfort food, she doesn’t think of spicy mapo tofu (though it is her favorite Taiwanese dish).“I love Taiwanese food, but I think its aromas and its flavors are a little bit too intricate and delicious to be comfort food—I think comfort food is kind of bland,” Wu said while hosting American Express’s Pay It Plan It event in New York City. “I think of mashed potatoes as comfort food, because they kind of taste like nothing.”Even though she has never learned to cook her mom’s Taiwanese classics like a thousand-year-old black duck egg with tofu, green onions, and soy sauce, she has fond memories of dishes like that and eats them when she can. But her perfect meal is probably Italian food like a good bolognese or a Caprese salad.Here's what else Wu is into right now, from a surprising travel snack to her pet bunny .My idea of a perfect meal is… probably Italian food, eaten slow and leisurely with people I love and a great cocktail. My go-to drink is a Manhattan—and I take it perfect.The next place I want to travel is... New Zealand. I really love Lord of the Rings, so I want to go to all the places where they filmed, like the Shire.My dream dinner party guest list would include... the cast of Crazy Rich Asians, Barack and Michelle Obama, Oprah, Ghandi, and Legolas [Orlando Bloom], obviously.I always travel with... my Kindle and those pastel-colored fruity Mentos. I carry at least two packs of them. Normally I read physical books, but when I’m traveling, I don’t like to have so much bulk in my bag.The book on my to-read list is... Ann Patchett’s new book, Nashville: Scenes from the New American South . That’s next, because I loved Commonwealth, which takes place partially in the Commonwealth of Virginia where I grew up.I’m listening to... Miguel and Khalid on repeat lately.But my Fresh Off the Boat character, Jessica, would jam to... wholesome, female-driven music like Barbra Streisand, Shania Twain, and Amy Grant.When I’m stressed out... I love to get full-body massages. That’s when I’m really stressed. If it’s just after a regular long day at work, I like to just talk on the phone to my old friends from high school. I prefer phone calls to texts, because it’s an actual exchange. It’s a flow, and it’s not preplanned. I respond a lot to people’s voices, and I just love conversations. I don’t even like podcasts that are just one person talking.Podcasts on my rotation are... Another Round, Two Dope Queens, and Oprah’s SuperSoul Conversations.At the end of the day, I unwind by... immediately changing into pajamas. It’s always the first thing I do. It’s a matching set: the button-up, long sleeved shirt and the pants in some kind of fabric that is lightweight and has a bit of stretch to it, like just a regular plain cotton.My favorite piece of clothing is... a miniskirt. I love to wear miniskirts when I go out with friends. I have a few denim miniskirts and a corduroy one. I like the way it makes my body look, and when you feel like you look great, it boosts your confidence. When your confidence is boosted, you’ll have a great time.To practice self care…. I take my bunny, Lida Rose, to work with me. She hops around my trailer all day. It feels like self care to take a moment to care for an animal and spend time with an animal. It’s doing something that doesn’t have to do with a screen or with your job; it’s really just about downtime.If I could give a young Asian person advice, I would say... there’s no one right way to push representation forward. Do what speaks authentically to you and focus on that. Not only will that help with representation, but it makes better work.Explore Bon AppétitPerson of InterestCelebritiesHealthyishInterviewsRead MorecultureRachel Brosnahan's Winter Strategy Involves Bone Broth and Swaddling Her Dogs in BlanketsBy Alyse WhitneycultureDumplings, Kaya Toast, and Chili Crab: Inside the Food of ‘Crazy Rich Asians’By Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-21", "author": ["Condé Nast", "Alyse Whitney"]}