{"id": "f62c5bcd0479108564961ff2e91a7f50", "url": "https://www.bonappetit.com/story/smashed-chickpeas-on-toast", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "This Chickpea Salad Recipe Is Perfect for Picnics, Weeknights, and Moments of Desperation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSmashed Chickpeas on Toast Is Perfect for Picnics, Weeknights, and Moments of DesperationPlus there's a very impressive harissa-yogurt swoosh.By Aliza AbarbanelMay 23, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Molly Baz, Prop Styling by Emily EisenFacebookTwitterEmailLast summer, I learned how heat—oppressively humid, true New York summer heat—can sap a person’s will to cook. Adrift in August without an air conditioner, I'd retreat to my apartment bathroom and lie down on the cool tiled floor. I didn't even have the energy to sit in my living room like a normal person, much less the motivation to turn on a stove. Somehow I resolved to make a chickpea salad recipe from the dregs of my pantry: a can of chickpeas, a fridge shelf full of condiments, and some bread.As the Chopped theme echoed in my head, I toasted the bread, rubbed each slice with a clove of garlic, and piled on a hodgepodge of roughly chopped chickpeas, pickles, mustard, and mayo. It was an act of desperation, but damn did it work. I made it again and again, all summer long.Later, we decided my makeshift chickpea salad sandwich needed a proper recipe. Of course, senior associate food editor Molly Baz vastly improved on my midsummer creation, brightening it with pickled peperoncini, lots of herbs, and a beautiful yogurt-harissa swirl.“I tried to keep a simple ingredient list, and harissa has so much flavor packed into one condiment that it lifts a huge load flavor-wise,” says Baz. “It’s a good condiment to have in your back pocket, because it’s immediately spicy, earthy, and bright.”Her recipe starts out with an addictive, zingy base of grated garlic, lemon juice, lemon zest, and a finely chopped shallot. Next use a potato masher or wooden spoon to smash two cans of chickpeas into the shallot mixture until half of the chickpeas have broken into small pieces and half are fairly intact. (This mix of smashed and whole chickpeas binds together to help keep the salad atop the toast; it’s also more fun to eat than a straight-up mash.) To finish off the salad, add chopped celery, cilantro, peperoncini, and ¼ cup of olive oil.Finally, it’s time to assemble the toast. Begin to build flavor by rubbing one side with a cut garlic clove, then lightly season with salt and a drizzle of olive oil. To create that coveted marbled effect, spread yogurt over each slice of toast and add six to eight small dollops of harissa, then use the backside of a spoon to swirl the harissa into the yogurt. (The BA test kitchen is obsessed with NY Shuk harissa, but other brands will work too.) Swoosh swiftly and decisively, otherwise you'll wind up with pink yogurt. Pile the chickpea mixture on top of the harissa-yogurt, then finish with celery leaves, cilantro sprigs, and sliced peperoncini because it may be hot but you can still be fancy sometimes.Served alongside a small salad, this knife-and-fork tartine is perfect for a quick weeknight dinner or weekend lunch. It’s also prime picnic material—just carry a separate container of the chickpea mixture and build on location, or swap the toast with soft pita. When the summer heat sets in and your will to cook melts away, these perfectly composed tartines will come through for you, just like they did for me.Turn off the oven and crack open those chickpeas:Smashed Chickpeas on Toast with Harissa YogurtGarlicky toast smoothed with harissa yogurt and topped with chickpeas = the perfect vegetarian tartine.View RecipeExplore Bon AppétitHealthyishChickpeaToastHarissaRead Morecooking29 Healthyish Chickpea Recipes Here for Your Weeknight DinnersGallery29 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-23", "author": ["Condé Nast", "Aliza Abarbanel"]}