{"id": "f630d0dd8c3519343e281b9a3e53697a", "url": "https://www.bonappetit.com/recipe/coconut-milk-braised-chicken-legs", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Coconut Milk–Braised Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCoconut Milk–Braised Chicken LegsBy Chris MoroccoDecember 14, 20184.5(72)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintNo searing, no chopping, one baking dish. And if you don’t have ginger, garlic, and lemongrass on hand, a combination of any two will be plenty to make this chicken over-the-top delicious in about an hour. You can find curry paste in the Asian aisle at most grocery stores or at an Asian market; we recommend any from Maesri.Ingredients2 servings1cup unsweetened coconut milk1Tbsp. Thai curry paste1lemongrass stalk, tough outer layer removed, lightly crushed11\" piece ginger, peeled, smashed4garlic cloves, peeled, smashed2chicken legs (thigh and drumstick; about 1½ lb. total)Kosher saltToasted unsweetened coconut flakes, cilantro leaves with tender stems, cooked rice, and lime wedges (for serving)PreparationStep 1Place a rack in top third of oven; preheat to 400°. Stir coconut milk and curry paste in a 2-qt. baking dish to combine (or, use a medium skillet if that’s what you’ve got). Add lemongrass, ginger, and garlic. Season chicken with salt (hold back a bit since curry pastes often have a lot of salt). Place in baking dish and spoon some liquid over. Bake, occasionally spooning liquid over, until chicken is browned, tender, and cooked throughout (the joint should be reasonably easy to flex), 60–75 minutes.Step 2Divide chicken between plates. Top with coconut flakes and cilantro. Serve with rice and lime wedges alongside.How would you rate Coconut Milk–Braised Chicken Legs?Leave a ReviewTell us what you thinkReviews (46)Back to TopTriangleI've made this recipe several times to rave reviews.  And it's scaleable so make more than you think you will need as folks will ask for seconds. (also you can use boneless skinless thighs -- won't crisp but take less time.)  I mistakenly used double the amount of curry paste the first time which was delicious for me as I like spicy -- but a little too much for others so agree with the commenter who recommended tasting the sauce before you put in the chicken and adjusting. \nAnnaWashington DC10/4/2021one of our favorite recipes! shockingly easy to make, especially if you're able to find squeezable lemongrass, garlic, and ginger. make sure to baste with sauce at least 3 times. ABGVirginia9/14/2021Very low maintenance and flavorful recipe! Great for a weeknight meal! I followed the recipe, and its important to put the chicken on the upper racks of your oven so it's closer to the heating coils, and have enough space between the chicken to get the darkening and crisping of the skin. Don't overcrowd the pan! I ended up dunking the chicken pieces in the Coconut Milk/Thai Red Curry Paste/Lemongrass/Ginger/Garlic mixture, then basted them every 30 mins in the oven. If you want to get a little fancy, you can also reduce the remaining basting liquid into a sauce.Jose RizalNashville, TN7/2/2021Excellent recipe! I used the extra curry paste left over from the Chicken Khao Soi (another really good recipe) and it turned out great. Would definitely make again! Miyuki HamakawaVancouver, BC3/30/2021Great meal for anyone on a cut. About 300–350 calories per serving, mostly fat and brotein.420AbsolutelyJackedAndEngorgedMember69Hell1/22/2021I've made this about a dozen times in the past six months and each time I'm shocked by how quick and simple it is to put together and how big the payoff is. I've started adding a can of chickpeas in too, just for something extra. Pair it with roasted (nearly burnt) broccoli, and dinner is done. Thanks BA. Charla MSarasota, FL12/17/2020This is a delicious recipe and so easy!\nAnonymousSyracuse12/3/2020This is a standby at our house now. Easy, fast and delicious. We haven't seen it fail yet, even if we play fast and loose with the ingredients.AndyOttawa, ON11/28/2020This one checks all my boxes. I even used garlic and ginger in a plastic tube to make it even simpler and faster. Used 5 each drumsticks & thighs. Couldn't find lemon grass. Used whole can of lite coconut milk and bit more curry paste as other reviewers recommended. Basted 3 times. Added the coconut flakes raw for the last 20 minutes just right on top of the chicken. They came out nice and toasted and the skins were perfectly crispy. Looked just like the picture.\n\nAlso, did use the lime and cilantro. Served over fresh basmati rice. It was full of flavor and yummy! LORI B snowBelmont, CA9/19/2020This is one of the best (and easiest!) chicken recipes I’ve ever made. I just did a large spoonful of curry paste and did add a little roasted red chili paste I had because I thought the additional sugar and aromatics would help with flavor and caramelization, but you might not need it. The sauce is so flavorful and I love how roasty the chicken skin got. This is a must make recipe!!!AnonymousBoston9/7/2020Followed the recipe pretty much exactly as listed. I basted the tops about every 15 min and also rotated the pan in the oven to ensure even cooking. I used chicken thighs, 4 pretty good size. I add a bit more milk and paste. Had good heat and the skin rendered nice and crispy. Skipped the garnishes didn't have that in house. Came out very nice and crispy and browned MattLike2CookStoughton, MA6/10/2020Super confused where I went wrong.  I was skeptical from the start, covering raw chicken in coconut milk and expecting it to come out browned and lovely like the picture.  It came out rubbery and tan colored, all over.  I took the chicken out of the sauce after over an hour of cooking and seared it to the best of my abilities to make it appetizing.  Sorry, not great!AnonymousSeattle5/28/2020Delicious. The sauce didn't hold up well for leftovers and just turned oily for me but day of was fantastic. The chicken is very tender and delicious. I will make this again. AnonymousColorado5/11/2020Fantastic!!  Make sure to double the sauce, it's incredible!AnonymousTennessee 3/15/2020My best advice is taste the sauce before adding the chicken. If it tastes bland then, it will be bland after cooking. I added 1T ginger paste, 1/2 T lemongrass, 1t pepper flakes, garlic salt, brown sugar, and curry powder. That helped. KccookingbugKansas City, Missouri3/8/2020Explore Bon AppétitSoutheast AsianAsianCoconut MilkOther IngredientsChicken LegChickenPoultryEasyWeeknight MealsMainDairy-FreeGluten-FreeKetoHealthyishBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-14", "author": ["Condé Nast", "Chris Morocco"]}