{"id": "f6375fe353319a9c6c11f4f657b04089", "url": "https://www.bonappetit.com/story/all-about-oregano", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "How to Use Fresh Oregano | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOregano Is For So Much More Than PizzaYou already love dried oregano. Now learn how to use the fresh stuff.By Emma WartzmanJuly 9, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailMaybe you've only encountered oregano as the fish food-y flakes you sprinkle on pizza. And while it is, indeed, an important slice shop staple, it can—and should—be used for so much more. The dried stuff certainly has its place (pizza, yes, and also dry rubs, vinaigrettes, and sauces, too), but fresh oregano is even more powerful and versatile. (BTW, we’re talking about Mediterranean oregano here, be it Italian, Turkish, or Greek. Mexican oregano shares similar flavors but belongs to a different family.)While oregano is largely considered a “hardy herb” (akin to rosemary and thyme), it actually straddles the line between hardy and tender. It doesn’t just belong to one camp. The stems are thick enough that branches will hold together when cooked, even through long braises or simmers. Where cilantro, dill, or basil will turn brown and wilt away to virtually nothing when introduced to heat, oregano holds its form. Yet the leaves, while more substantial than silky, are still delicate enough that eating them doesn’t feel like an unpleasant jaw exercise. This is unlike rosemary or sage, which are pretty unpleasant without some heat from the oven or the stove or a really, really fine chop.This white pesto gets its kick from finely chopped fresh oregano.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensThe taste of oregano also plays both sides. The fresh leaves are peppery and assertive—sometimes even bitter or astringent. They enliven whatever they're scattered over, be it a savory melon salad, or a piece of fish—and a little goes a long way. But when cooked, its flavor mellows so that it's earthy but not aggressively woodsy. It’s powerful enough to hold its own in dishes with bold flavors, like smoky grilled chicken or slow-roasted bell peppers.These One-Pan Chicken Thighs with Burst Tomatoes, Harissa, and Feta take advantage of its two sides. You throw a whole sprig of oregano into a cast-iron skillet with chicken thighs so that the piney flavor can seep into the chicken fat, infusing the meat and the bursting cherry tomatoes. Then you discard the limp remains, plate the chicken, and scatter some fresh leaves on top for fresher, sharper flavor.You can even play around with using both, a practice endorsed by senior food editor Molly Baz. “If you see a recipe that calls for dried oregano, try cutting it with some fresh leaves, too” she says. “In a Greek salad? Delicious! Chopped up with the parsley garnish on Pork Marbella? Why not!” Mixed into this classic Italian dressing? Have at it!” Just remember that the fresh leaves are way more potent than the dried stuff, so tread lightly.Next up: Sprinkling fresh and dried oregano on a slice of pizza. Now that’s fine-dining.Go go oregano:One-Pan Chicken Thighs with Burst Tomatoes, Harissa, and FetaThis recipe requires you to chop a grand total of zero vegetables. What's the shortcut? Harissa, a North African pepper sauce that brings the flavor (so you don't have to).View RecipeExplore Bon AppétitOreganoherbRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Emma Wartzman"]}