{"id": "f63bbc12429bdff28f0ac2cd6bb57b0d", "url": "https://www.bonappetit.com/story/bartend-the-stars-51-years", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "What It’s Like to Bartend for the Stars...for 51 Years | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhat It’s Like to Bartend for the Stars...for 51 YearsMike Gotovac, a bartender at the legendary West Hollywood celebrity hangout Dan Tana’s, looks back on half a century in the biz.By Maggie LangeApril 16, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.Mike Gotovac has been behind the bar at Dan Tana’s—Santa Monica Boulevard’s “little yellow house” with the raucous late-night scene—since 1968, serving everyone from Elizabeth Taylor to the Eagles, who wrote their chart-topper “Lyin’ Eyes” about the “cheatin’ side of town” at table four. Today, a mix of Hollywood celebrities, tourists who come to ogle at celebrities, and dedicated locals keep the red leather booths full. The bar, a compact one-man operation, continues to divide the restaurant into two important parts: If you would love to be seen and you don’t mind the noise, you sit toward the front. If you’re very famous and fierce about your privacy, you sit in the other room. Either way, Gotovac keeps the drinks flowing.Need a drink? Ask Mike Gotovac.\nWhat was Dan Tana’s like when you started working there?We were open ’til 11 o’clock and medium busy. Then in the mid-’70s, Troubadour [the legendary West Hollywood rock club] started having big shows. The [crowd from the Troubadour] needed someplace to eat after the last show, which was at 10 o’clock. They asked the owner of Dan Tana’s to stay open until one. So the place just became busy. Every night we were packed.Did you stay open past close?Do I say that? Do I talk about that? In the old days we did until five or six o’clock in the morning. There was no service, but we would sit and talk, have a few drinks. Those days are gone. We were so crazy one night, we chartered two small planes and flew to Vegas after we closed. My wife called the police looking for me.Have the drinks changed?They change by generation. When I first started working, it was all gin martinis, Rob Roys, and Manhattans. Nobody drank wine. Now it’s everything vodka martinis. Now they drink more wine. Back then people would get Brandy Alexanders, the Golden Cadillac. Thank god nobody orders that anymore. It’s very messy, with the eggs and cream.Dan Tana's (and its legendary neon signage) has been around since 1968.\nPhoto by Alex LauWhat do you like to drink?I drink brandy and wine. I tell people I mix drinks in my stomach, not in my glass.Do you keep a limit on your drinks?Well, there’s no limit, you know. You either drink or you don’t drink. Thank god now for Uber. Now there are 40 to 50 Ubers lined up on weekend nights. Before, you had to take keys from a lot of people—there would be ten different keys behind the bar. So I drove customers home myself.Do you have a favorite seating?It’s my job to like every customer. You gotta be nice to everybody, take care of everybody, make sure everybody is happy with the food and drink and nobody bothers anyone else. And don’t let anyone go to the tables by the movie stars!When it comes to red sauce, it doesn't get more iconic than this place.\nPhoto by Alex LauOh, do you ever have to intervene when people crowd the movie stars?You’re busy, so you don’t know what’s going on between every meal. But yeah, we stop people right away. It happens in every place, but we never allow that here. That’s why they’re happy coming in: because we protect them.You’ve got double duty as a bodyguard?Yeah, the maître d’ and I, but most people respect us. They listen to us. Once in awhile someone gets nasty, and we’ll just tell them to leave. And we have customers who’ve been coming in for years—third and fourth generation—so if someone gives us a hard time they jump in right away: “Hey, you gotta leave!” Our long-time customers have our back.Maggie Lange is a writer in Los Angeles, who still hasn't adjusted away from Eastern Standard Time.Explore Bon AppétitRestaurantsItalian AmericanRed SauceLos AngelesRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Maggie Lange"]}