{"id": "f66919d67a447dcd1d82a39c401d56e8", "url": "https://www.bonappetit.com/story/alinea-valentines", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "My Wife and I Went for a 19-Course Valentine's Day Dinner. She Tapped Out at Course 12 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Wife and I Went for a 19-Course Valentine’s Day Dinner. She Tapped Out at Course 12It was hard not to feel anxious about what might come next.By Kevin WilsonFebruary 9, 2022FacebookTwitterEmailIllustration by Jordan BrunerFacebookTwitterEmailFive months before our son, Patch, was born, my wife and I ate a 19-course meal at Alinea, the Michelin-starred restaurant in Chicago. It was our valentine gift to each other, and I kept saying, slightly mystified, that we were going to be eating the cash equivalent of an iPad, and we thought about how nice it would be to have an iPad, to play soothing white noise for the baby while we reclined on the sofa and ate bologna sandwiches. But we were traveling for work, leaving behind the tiny cabin on the mountain where we lived, and there was a reservation available. With the second kid on the way, our oldest now four and happy to stay with his grandparents, it felt like the last time for a while when we could justify doing something so entirely focused on each other.On the upper floor of the dimly lit dining room, we were led to a table with a centerpiece that was a giant block of ice with a dark purple liquid suspended inside of it. I wondered if, at some point, we’d have to eat it. “Happy Valentine’s Day,” we told each other as we sat down. There were handsome men in suits who waited on us, insanely patient and without emotion, and it immediately made the two of us feel like we needed to be serious, to invest. We would eat the entire block of ice if one of these men instructed us to do so.Each new dish was lovely, a razor clam presented on a log covered in seaweed or a single oyster leaf in an oyster shell. There was a rhythm, tightly controlled, and the handsome suited men would bring something out, explain it to us, instruct us on how to eat it, and then we would eat it. We’d say a few things to each other (“delicious!” or “wow!” or “I’m picking up notes of fennel!”) and then a few minutes later, another dish would appear and we’d do it again. If the men had brought us eight thousand dishes, if we never left Alinea, I don’t know that we’d have objected.The first trimester of Leigh Anne’s pregnancy with Patch, unlike the one with Griff, was marked with intense bouts of indigestion and morning sickness. We had wondered about 19 dishes, so much food, all of it infused or smoked or freeze-dried. But they were so small, so perfectly made, so unbelievably delicious. The ice, we learned, would not be eaten, but we were given straws to drink beet juice nectar from the holes drilled into it. Really and truly, all liquids should be sipped out of the drilled-out holes in a giant block of ice. We were a young couple who lived in a cabin on a mountain in Tennessee, but the magic of Alinea turned us into people who unquestioningly leaned toward a precariously balanced skewer of squid wrapped around a piece of woolly pig.And then, midway through the meal, a handsome man in a suit announced that they were serving us something they were working on, a test dish, which turned out to be an entire roasted scup (which is a fish). We ate the entire roasted scup, and then, after they took the dish away, Leigh Anne leaned forward and said, “I am FULL.”“Say what now?” I asked.“I’m done. I literally cannot eat anything else.”I tried to count the dishes left in my head. “I think we have, good lord, like seven dishes left. Maybe more?”“Oh god,” Leigh Anne said. “I think I’m, you know, DONE.”“We can’t leave,” I said.“I just won’t eat what they serve,” she offered, and I imagined them bringing out a mushroom covered in diamond dust and us saying, “You can just throw that right in the garbage, thank you.”It was all ridiculous. We had wanted it that way. A once-in-a-lifetime meal. And now we were done. And it was still going. It was hard not to feel anxious about what might come next.What came next was another dish, and I ate both servings. There is something strange about eating the exact replica of the magic trick you just ate, like you still don’t understand the mystery, but you’re no longer interested in trying to figure it out. “How was that?” Leigh Anne asked, smiling. She looked happy to not have to eat, to just drink and sit in a warm room. “Good,” I said. I knew that wasn’t enough. “Like, maybe there’s paprika in it? Some kind of spice.”“I do like paprika,” she admitted.The handsome men still put plates in front of both of us, the formality, but Leigh Anne would listen to the description, nod, and then push it to me. “Ginger!” I’d tell her and she would laugh.Mostly we just talked, and that was perhaps the best part of the dinner, the spaces between courses, when we imagined what Griff was doing back home, made plans for the summer, and remembered a time when we were still dating and drove almost two hours for a barbecue sandwich that was, honestly, as amazing as anything we’d eaten tonight. In six months, we’d move into a new house, out of the woods, and we’d welcome Patch into the world. It would be the four of us: me and Leigh Anne and our sons. But right now, in Chicago on the coldest evening I’d ever experienced, it was just the two of us, and no one else in the world.For the final course, the staff brought out a protective covering for the table, a kind of silicone mat, and I cannot stress enough that under any other circumstances, a restaurant protecting its table from an impending dish would cause a certain amount of panic. A chef—unsmiling, unemotional—sprinkled multicolored powders on the table before painting streaks and dots of vanilla-scented cream and placing little pansies, a work of art. When he was finished with the preparation, he suddenly picked up a globe of white chocolate and smashed it on the table. The globe cracked open and shards of white chocolate and candies and sweets spilled out of its remains. We’d barely had time to admire the handiwork before we were left with the aftermath, the chaos. It was beautiful.Leigh Anne said, “I don’t care. I’m eating all of this,” and picked up a meringue and dipped it into a swirl of vanilla cream. I ate a huge piece of the white chocolate, dipped my finger in some green powder and tasted it, the sweetness mixed with something I couldn’t place. But I didn’t try to place it. We just sat next to each other and reached for anything that struck our fancy until there was nothing left. Until, finally, it was time to leave, to walk out of the restaurant and back into the life that we’d made, one that had always felt like magic. We could never predict what would come next, but as long as we were together, it wouldn’t matter. We would take whatever appeared in front of us and be grateful.Kevin Wilson is the author of Nothing to See Here and several other books. He lives in Sewanee, Tennessee, with his wife, the poet Leigh Anne Couch.Explore Bon AppétitRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-09", "author": ["Condé Nast", "Kevin Wilson"]}