{"id": "f672c4b37fba25599e48ab4f3055809f", "url": "https://www.bonappetit.com/recipe/baked-pasta-alla-norma", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Baked Pasta alla Norma Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueBaked Pasta alla NormaBy Claire SaffitzSeptember 18, 20184.1(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue LiEmailPinterestPrintEmailPinterestPrintCheesy, saucy baked pasta is even more fun when you can slice it into wedges. But for clean slices, let the pie rest before cutting. Spaghetti, bucatini, rigatoni—if it’s pasta, it works for this recipe. Just don’t rinse the noodles; you want that starch. Also, roasting the vegetables first concentrates their flavors and removes excess water.Ingredients8 servings 1medium globe eggplant, peeled, cut into ½\" pieces2pints cherry tomatoes8garlic cloves, smashed¼cup extra-virgin olive oil, plus more for skillet½tsp. crushed red pepper flakes, plus more for sprinklingKosher salt2large eggs2Tbsp. tomato paste4oz. finely grated Parmesan, divided1lb. spaghetti2Tbsp. drained capers½cup torn basil, plus a few whole leavesPreparationStep 1Preheat oven to 425°. Combine eggplant, tomatoes, garlic, ¼ cup oil, and ½ tsp. red pepper flakes in a large ovenproof skillet, preferably cast iron. Season generously with salt and toss to combine. Roast, shaking skillet once or twice, until eggplant is tender and tomatoes burst, 25–35 minutes. Let vegetables cool while you prepare the pasta (watch out for the hot handle when you take the skillet out of the oven). Reduce oven temperature to 400°.Step 2Whisk eggs and tomato paste in a medium bowl until smooth, then whisk in about three-quarters of Parmesan.Step 3Cook spaghetti in a pot of boiling salted water, stirring occasionally, until al dente. Immediately drain pasta in a colander and shake to remove excess water; transfer pasta back to pot.Step 4Add cooled vegetable mixture to pot with pasta. Wipe out skillet and drizzle in a little oil; roll around in skillet to coat. Add egg mixture to pasta and toss vigorously with tongs until pasta is evenly coated. Add capers and ½ cup basil and toss again to combine.Step 5Transfer pasta mixture to skillet and press gently into an even layer. Top with remaining Parmesan, a few whole basil leaves, and an extra sprinkle of red pepper flakes.Step 6Bake pasta until surface is nicely browned, 30–35 minutes. Let cool 10 minutes before cutting into wedges for serving.How would you rate Baked Pasta alla Norma?Leave a ReviewTell us what you thinkReviews (26)Back to TopTriangleVery delicious, will definitely make it againJan hepUK11/3/2021This recipe is obviously designed to set up as opposed to being saucy. What do you think is going to happen when you whisk eggs and parmesan cheese into tomato paste and then bake it in pasta? I do use most of the tomato paste from the can, instead of the two tablespoons it calls for. Other than that I make it following the recipe. This is a cast iron skillet recipe! If you are using something else the results will probably not be good. I make it whenever  cherry tomatoes are on sale, although I have used grape tomatoes. I jokingly call it spaghetti pie. Everyone we have served it to has loved it!GregChandler, AZ5/19/2021Not quite as bad as some of the other reviewers make out but I wouldn't make it again.AnonymousMiami, FL9/8/2020I expect more from BA, followed many suggestions in the comments, less pasta, add H20, second bake for 20 mins. Crunchy top and last few bites with extra veg was good, everything else was just dry, bland overcooked pasta. If making double your veg or half your pasta. Too many tasty ingredients wasted for me to have another go at it. Nick KozOmaha7/30/2020Girl. This is really good! I used two medium zucchini instead of the eggplant, put another ounce of cheese in the mixture, and didn’t wait for the cherry tomatoes to completely pop (just close!) and it was PERFECT! 10/10 bb!heystephenedwardPortland, OR5/24/2020I loved this recipe! No, it is not saucy and it should not be! But it is perfect! I made exactly as follows with the exception of not waiting for it to be brown at the end. It is a pasta highlight and the flavors are great! May need to add a smidge more salt to veggies next time as i wasn’t sure in amount. Love the basil, caper flavors! Kept eating more!Columbus ohio4/30/2020Considering the large number of comments regarding dryness, I made a few changes with great results. The keys: day old pasta, the addition of pasta water and another eggplant, and not drying out the eggplants in the oven. Rough directions:\n- Cooked 500g pasta 2 mins short of al dente the day before and saved a cup of pasta water. I wanted to make the final mix more wet so having resistant starch seemed imperative.\n- Peeled and cubed 2 eggplants and cooked them on low heat in a pan along with two chopped onions and salt, about 15 mins. Added sliced garlic and cooked for another min.\n- Took pan off heat, added canned peeled tomatoes (all I had on hand) and roughly smashed them to release juices.\n- Whisked eggs, parmesan, tomato paste, and reserved pasta water.\n- Mixed pasta (straight out of the fridge), eggplant mixture, and egg mixture. Added to a glass baking dish and sprinkled with more parmesan before baking for 40 mins.\n- Would have loved to add capers and basil but didn't have any!Hadi JalaliParis4/25/2020Considering the large number of comments regarding dryness, I made a few changes with great results. The keys: day old pasta, the addition of pasta water and another eggplant, and not drying out the eggplants in the oven. Rough directions:\n- Cooked 500g pasta 2 mins short of al dente the day before and saved a cup of pasta water. I wanted to make the final mix more wet so having resistant starch seemed imperative.\n- Peeled and cubed 2 eggplants and cooked them on low heat in a pan along with two chopped onions and salt, about 15 mins. Added sliced garlic and cooked for another min.\n- Took pan off heat, added canned peeled tomatoes (all I had on hand) and roughly smashed them to release juices.\n- Whisked eggs, parmesan, tomato paste, and reserved pasta water.\n- Mixed pasta (straight out of the fridge), eggplant mixture, and egg mixture. Added to a glass baking dish and sprinkled with more parmesan before baking for 40 mins.\n- Would have loved to add capers and basil but didn't have any T__TAnonymousParis4/25/2020One of the best things that I have cooked recently.  Definitely on my list.Jellins1Houston, TX.4/4/2020Surprisingly good! I baked it in a glass pie plate and came out fine. AnonymousWashington, DC12/1/2019I should've read the other comments before  making this. It was too dry. To save it I did something sacrilegious - I put butter on it :D. \nI might try this again with improvements suggested by others.bonaperitifSeattle, WA9/7/2019I like to review things as I want honesty from others and really do read them.  I did not like this recipe.  I felt it was way too dry and was missing an ingredient. The flavors were pretty good, though.  If I made it again (probably not) I'd have a side of \"gravy\" (marinara) in order to offset the dryness.  Just my humble opinion, but honesty is important when reviewing things.  I try to do that.\nLHemyNew Hampshire, USA8/9/2019I've made this recipe three times now and each time its fantastic the addition of the eggplant is everything hereCollegeCookingDetroit4/24/2019Great recipe.  I read the reviews about reducing pasta and adding sauce, but then proceeded to mostly follow the recipe.  I used the full 1 lb of pasta, ~1 1/4 cup freshly grated Parmesan/Romano, and an entire 6 ounce can of tomato paste.  It took 45 minutes for my tomatoes to really burst and the eggplant to start getting good color.  I also added a bit of the pasta water to the mix (maybe 1/3 cup) before I put it back in the cast iron.  I thought it came out perfect.  The entire family raved about it.  SB95Dallas2/10/2019So delicious, but with a few changes as many others have mentioned. I did less pasta, added a little tomato sauce with some basic spices, and topped the whole thing off with some mozzarella for the final bake. Will certainly be a regular in my dinner rotation!Anonymous1/9/2019Explore Bon AppétitPastaItalian AmericanAmericanItalianEuropeanEggplantVegetableCherry TomatoTomatoBasilHerbs & SpicesSpaghettiPasta & NoodlesBucatiniRigatoniMainVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Claire Saffitz"]}