{"id": "f67bd8955c93d5fd5846c9a26252d820", "url": "https://www.bonappetit.com/story/kunz-spoon", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "The Kunz Spoon Is Beloved By The Entire BA Test Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Spoon You’ll Find in Every Restaurant’s KitchenProfessional cooks (including the ones in BA's very own Test Kitchen) swear by it—and no, it’s not a soup spoon.By Zoë SessumsMarch 6, 2020FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis story, first published February 22, 2019, was updated after news of Gray Kunz’s passing in March 2020.If you ever want to look like you belong in a professional kitchen setting, pull a Gray Kunz Spoon out of your apron pocket. Make sure you pronounce it correctly, as in “koons.” Then, proceed with any of the following tasks: Artfully drizzle dressing over some crisp endive leaves; baste herby juices over a roasted chicken; flip, stir, sauce, plate whatever’s in front of you—oh, and taste it too.Just like freshly glued press-on nails used to make me feel like a kid instantly transformed into an adult, holding a Kunz spoon gives me that line-ready cook confidence—even if I’m just putting together some breakfast alone in my tiny kitchen. And there’s a reason why the real deal, including food editors in the Bon Appétit Test Kitchen, has at least one of these lying around at all times.“Some people might look at them and think they’re soup spoons or serving spoons, but no, they’re cooking utensils,” says senior food editor Anna Stockwell, who keeps hers at home by the stove, where she can get to it faster than if it were tucked inside a drawer. For spooning sauces, scooping contents from a pot to a plate, or pulling a fillet of fish from off out of a pan, “there’s no better option than the Kunz spoon.”“You start to notice with most spoons, that in order to get a deep enough bowl to actually be useful as a serving spoon, you very quickly graduate to this big flat spoon,” senior food editor Chris Morocco added, showing me a series of subpar spoons that even with a lot of surface area, hardly hold a teaspoon of liquid. This one has the depth, angle, and edges to get any job done. Plus, he says, “It feels really nice in the hand. That’s what it’s all about.”The late Gray Kunz, chef and restaurateur who formerly ran the kitchen at New York’s Lespinasse, made sure of it. Frustrated that one utensil couldn’t satisfy all his needs, he engineered his namesake tool with all these different use cases in mind. The deep bowl, with its slightly tapered edge, holds 2.5 tablespoons; the handle, short and narrow, is easy to control; the weight—perfectly balanced, and just heavy enough to maneuver with precision—all make it the One Spoon to Rule Them All. He began manufacturing them in the late ’90s, and after becoming available at J.B. Prince kitchen supply store, they quickly made their way into the hands of cooks throughout the restaurant industry.The Gray Kunz Spoon in action.\nChef Hugh Acheson won’t travel without two Gray Kunz spoons in his carry-on. Carla Lalli Music likes to give them as gifts, especially the fancier limited-edition copper version. Danny Bowien prefers his in gold. They also now come in small and XL, and with perforations if you want your spoon to double as a strainer.Take your pick. No matter what, it’s still the perfect spoon for everything you need accomplished in the kitchen.Buy it: J.B. Prince Gray Kunz Sauce Spoon, $12 on AmazonExplore Bon AppétitShoppingToolsTest KitchenStaff PicksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-21", "author": ["Condé Nast", "Zoë Sessums"]}