{"id": "f68826ff002d83e64f4480e2232646f0", "url": "https://www.bonappetit.com/recipe/three-sheets-to-the-wind-cake", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "Three-Milk Coconut-Rum Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesThree Sheets to the Wind CakeBy Anna StockwellAugust 21, 20194.0(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis tropical coconut–infused tres leches cake riffs on the classic recipe, with rum featured at every step—in the cake, in the three-milk soak, and in the whipped cream on top. One bite, and you’ll understand why this party-ready, coconut-lime dessert earned the moniker “three sheets to the wind.”Ingredients16 servingsCakeNonstick vegetable oil spray2cups all-purpose flour, plus more for pan1Tbsp. baking powder½tsp. ground cinnamon½tsp. kosher salt4large eggs1⅓cups granulated sugar2Tbsp. dark rum¾cup unsweetened coconut milk, divided3-Milk Rum Soak114-oz. can sweetened condensed milk1cup unsweetened coconut milk¾cup heavy cream¼cup dark rum1tsp. finely grated lime zest¼tsp. kosher saltRummy Whipped Cream and Assembly1¼cups heavy cream¼cup powdered sugar2Tbsp. dark rum1tsp. finely grated lime zestPinch of kosher salt1cup toasted coconut chipsPreparationCakeStep 1Place a rack in middle of oven; preheat to 350°. Coat a 13x9\" pan with nonstick spray. Dust with flour, tapping out any excess.Step 2Whisk baking powder, cinnamon, salt, and 2 cups flour in a medium bowl until combined.Step 3Beat eggs, granulated sugar, and rum in the bowl of a stand mixer fitted with the whisk attachment at medium-high speed until pale yellow, doubled in volume, and mixture falls off whisk in a thick ribbon, about 5 minutes.Step 4Fold in half of dry ingredients with a rubber spatula until most of the flour is incorporated. Fold in half of coconut milk until just absorbed and no more streaks of flour remain. Repeat with remaining dry ingredients and coconut milk.Step 5Pour batter into prepared pan. Tap gently against counter to spread and pop any bubbles. Bake cake until top is set and golden brown and a tester inserted into the center comes out clean, 35–40 minutes.3-Milk Rum SoakStep 6Whisk condensed milk, coconut milk, cream, rum, lime zest, and salt in a medium bowl until combined.Step 7Using a skewer, poke holes every ½\" into hot cake as soon as it comes out of the oven, wiggling the skewer to gently widen the holes and reach bottom of cake. Slowly pour milk mixture over cake a spoonful at a time, letting it fully absorb before adding the next. (Be patient and don’t rush. At times it will look like too much milk, but it will all soak in.) Transfer pan to a wire rack and let cake cool completely, about 2 hours.Rummy Whipped Cream and AssemblyStep 8Beat cream in bowl of stand mixer fitted with the whisk attachment until soft peaks form, 3–4 minutes. Add powdered sugar, rum, lime zest, and salt and continue to beat until stiff peaks form, 1–2 minutes.Step 9Spread rummy whipped cream evenly over cooled cake. Top with coconut chips.Step 10Do Ahead: Cake can be baked and soaked 1 day ahead. Let cool, then cover and chill. Top with rummy whipped cream and coconut chips just before serving.How would you rate Three Sheets to the Wind Cake?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleThis is sooooooooo delicious!Scott KnodleHawaii5/5/2021Cake was a little too dense and I felt like there wasn’t enough milk mixture. I ended up adding a can of evaporated milk to try to fix it. Not a recipe tres leches recipe. AnonymousNew York5/16/2020Made this for cinco de mayo dessert in an 8x8 pan, so halfed all of the ingredients, except kept the same rum proportions in the cake batter and a little bit extra in the soak. Was perfectly moist and easy to make! Recommend topping with fresh strawberries :)New Jersey5/6/2020Great recipe, so easy and delicious. The cake came out very moist, tastes decadent with the perfect amount of sweetness. I thought the amount of soak was sufficient, like other reviewers mentioned, it could have taken a bit more soak, but I didn't feel like the amount outlined in the recipe was insufficient. Also like another reviewer mentioned, it doesn't have a strong rum/alcohol flavor, but it definitely contributes to the flavors! I did think that the cake itself came out tasting kind of eggy, like a distractingly eggy flavor. Not enough to detract from my overall thoughts about the cake though! It's been a few days and I'm eating the leftovers and they are still amazing despite the coconut topping getting soggy!AnonymousSan Francisco10/14/2019One of the easiest cakes I’ve ever made.  So moist, not to sweet and the rum, lime and coconut milk make a wonderful combo.  I will be making this cake often 😘bella1946Michigan10/8/2019I used a spiced rum (and nearly doubled the ratio), more lime, and given other reviewer's feedback, doubled the soak. I will say, double the soak is too much. But it is an excuse to make more cake. \n\nDeeeeelicious. Made it for a party and it was a hit! 10/10 would recommend. talita.elizeuJersey City, NJ9/14/2019This was very delicious! \n\nI tasted a lot of lime (amazing), but not much rum or coconut, other than the toasted coconut on top. I think next time I will 1.5 or double the rum soak. It was very moist and delicious, but it was not dripping out of the cake as the picture shows, which is what I was hoping for! I also had to double the whipped topping since the layer was very thin for me (I used a 9x13 Pyrex pan). \n\nStill an amazing cake and will absolutely make again. Huge hit with my friends and family (and myself)! The recipe for the basic cake was really good, and I would love to try to use it for cupcakes. AnonymousKansas City9/9/2019YUM. This was the cake of my dreams. It is so incredibly ~moist~ and holds up for a few days (though if you're not eating it in one day the coconut flakes on the top get kind of soggy and gross). You really can't taste the rum (though it does add to the flavor) so don't skip unless you really dont want alcohol! This was SO GOOD and I could even go for more 3-milk soak!!! I added way more lime zest than called for and kinda wish I added some more! \n\nPS - use the canned coconut milk and microwave a few seconds if you cant combine the thick/liquid part with a whisk.AnonymousIndianapolis, IN9/5/2019Do you mean the canned coconut milk or the thinner drinking kind from a carton?Anonymous9/5/2019I would like to make this in a nice shaped pan; springform? Bundt; removeable bottom Tarte pan ( my favourite choice )\n\nWhich one would work best?AnonymousBritish Columbia 8/28/2019Explore Bon AppétitCakeDessertMexicanLatin AmericanCoconut MilkOther IngredientsRumAlcohol & Other DrinksCoconutFruitVegetarianBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-21", "author": ["Condé Nast", "Anna Stockwell"]}