{"id": "f68b89d465d5188f5023ae018a0abe72", "url": "https://www.bonappetit.com/recipe/basically-carrot-loaf-cake", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Basically Carrot Loaf Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBasically Carrot Loaf CakeBy Molly BazApril 7, 20194.3(53)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThe most casual-cool carrot cake of all time. A few notes on this recipe's star ingredient. We don’t generally endorse the use of horse carrots (a.k.a. those giant ones that are often sold individually at the supermarket) because they lack sweetness, but also grating a bunch of slender young carrots can be kind of a pain. Seek out something in the middle—healthy-looking, medium-sized carrots—which should deliver the right balance of flavor and convenience.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketLoaf Pan$15 At AmazonParchment Paper$3 At AmazonWhisk$10 At AmazonMedium Bowl$17 At AmazonVegetable Peeler$10 At AmazonBox Grater$13 At AmazonLarge Bowl$18 At AmazonSpatula$12.99 At AmazonCake Tester$3 At AmazonWire Rack$23 At BA MarketPlatter$29 At AmazonChef's Knife$34.53 At AmazonIngredientsMakes one 9x5\" loaf 1lb. cream cheese (2 8-oz. packages), divided¾cup vegetable oil, plus more for pan2¼cups all-purpose flour2tsp. baking powder¾tsp. baking soda2tsp. ground ginger2tsp. ground cinnamon, plus more for dusting1¾tsp. kosher salt, divided¾lb. carrots1¾cups sugar, divided2large eggs3tsp. vanilla extract, dividedPreparationStep 1First things first, we need to get that 1 lb. cream cheese to room temperature. If you don’t have time to let it sit out on the counter for several hours, cut it into 1\" pieces and place on a heatproof plate on top of your stove. Alternatively, you can microwave the plate of cream cheese in 10-second increments until just softened but not melted, about 30 seconds total.Step 2Place a rack in middle of oven; preheat to 350°. Lightly grease a 9x5\" loaf pan with vegetable oil. Line pan lengthwise with parchment paper, leaving about a 2\" overhang. (This will help you lift the cake up and out of the pan.) Important note! If you are using a smaller pan, you're going to need to hold back some batter—you'll need at least a ½\" between the batter and the lip of the pan to account for oven rise, otherwise your cake will overflow. You can bake remaining batter in muffin tins if you have them.Step 3Whisk 2¼ cups all-purpose flour, 2 tsp. baking powder, 2 tsp. ground ginger, ¾ tsp. baking soda, 2 tsp. cinnamon, and 1½ tsp. Diamond Crystal or (1 tsp. Morton) kosher salt in a medium bowl.Step 4Peel ¾ lb. carrots and cut off knobby end. Grate on the large holes of a box grater right into bowl of dry ingredients. Use your hands to toss until well coated.Step 5Scrape half of cream cheese into a large bowl. (This is for the batter, the other half is for the icing!) Using a spatula, spread cream cheese around sides of bowl, working it a few times with your spatula to help soften. Add 1½ cups sugar and keep working with spatula to completely incorporate until it’s no longer gritty all sugar is dissolved, about 15 seconds. Crack 2 large eggs into bowl, then whisk until mixture is very smooth. It might look separated and chunky at first, but whisk vigorously and it will eventually come together. Slowly stream in ¾ cup vegetable oil, whisking constantly to homogenize. Add 2 tsp. vanilla extract and whisk again to combine.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Fold dry ingredients into egg mixture with your spatula until almost no streaks of floury bits remain.Step 7Scrape batter into prepared pan, smoothing top with the back of a spoon or spatula.Step 8Bake cake until a tester inserted into the center comes out clean, 80–90 minutes. (Baking time will vary depending on the size and shape of your loaf pan, so if you aren't using a standard 9x5\", start checking for doneness at the 70-minute mark and keep an eye on things.) Let cool 20 minutes, then remove from pan using parchment overhang. If the edges are sticking, slide a butter knife around the edge to help release. Transfer to a wire rack and let cool completely.Step 9While cake cools, make your icing.  Scrape remaining 8 oz. cream cheese into a medium bowl. Similarly to what you did earlier, use a spatula to work it around sides of bowl. Add remaining ¼ cup sugar, 1 tsp. vanilla, and ¼ tsp. Diamond Crystal (or a pinch of Morton) kosher salt. Mix with spatula to bring everything together, paddling it as necessary, until icing is very smooth and shiny. (This will take some elbow grease, but don't give up!) Cover and keep chilled until cake has cooled.Step 10Place cooled cake on a platter. Dollop cream cheese frosting on top and make swirls and swooshes with the back of a small spoon as you spread it out to make it look cute. Dust lightly with more cinnamon. Slice with a sharp chef’s knife (not a serrated one) to serve.How would you rate Basically Carrot Loaf Cake?Leave a ReviewTell us what you thinkReviews (31)Back to TopTriangleI really love this cake recipe; I didnt use nearly enough cream cheese last time or I added too much flour the first time I made this. As I was just using up ingredients before they went bad. It still came out amazing and I added ground cloves and allspice last time I made it. So I simply used pumpkin spice this time, and I'm using a bunt pan to see if it helps cook easier (and I just think it's neat/I don't get to use it often either) but overall easy to read and follow. Not sure what the one review meant, even if you're a new Baker - one would think that two bowls means that one is for wet and the other dry.\n\nOh well, I'm loving it. My husband loves it too but I'm not partial to cream cheese icing unless it's for red velvet cake so I'll probably make buttercream.\n\n10/10 - I was frantically searching for this recipe today which means it's a keeper.NitaWinnipeg, MB8/30/2021To the Aussie, just convert the recipe to grams.\n\nTo PCP in New Haven, cream cheese has 50% less fat than butter and ALL carrot cake recipes use oil and Doctors approve of oil over butter. Andy Burbank, CA. 12/7/2020I have not made this cake and would not make this cake:  look at the extraordinary fat content! with a pound of cream cheese and 3/4 cup of oi!  This is a heart attack in the making, no matter how delicious it is.  If you make it, put a slice on a paper napkin and see how gross it is.pcpNew Haven, CT11/17/2020Very easy recipe to follow, however, grams would’ve been way easier....(3/4 of a pound?). Great taste and first attempt at a carrot cake. I cut back on the cream cheese frosting as using it all felt a bit too much.AnonymousVictoria, Australia 8/22/2020This was such a fun carrot cake option! The carrot grating was definitely some work, but aside from that this came together incredibly easily. I love that the recipe didn't include raisins hahaAnonymouscalifornia 7/15/2020We enjoyed this recipe very much.  We did not like how the author blended ingredients for the cake with ingredients needed for the frosting.  It made us very unhappy turtles.  Please keep ingredients for two different items separate to avoid confusion and accidents.  Do not ask someone who has never made your recipe and may be a new baker to divide ingredients.  You the person providing the recipe and our teacher need to do that.  Other than that, We at ImATurtle.com give this recipe 4 Turtles.  The overall easiness and general organization of the recipe was only 3 Turtles as we had to do too much re-reading to figure out what's what.\nOverall this recipe is Turtle Approved\nBe a good turtleQualicum Beach5/7/2020This was delicious, surprisingly so. Several of my coworkers audibly let out an \"oh!\" in surprise with the taste. Very moist and very user friendly. I don't have a scale and had to guesstimate my carrot amount. Grating it was the most annoying thing, but it was worth it. Added a little citrus to the frosting but that's about it. Try it! alisa olmstedpa5/1/2020Have been on quite the baking kick during quarantine, whole family loved it - definitely will make this again!AnonymousNYC4/28/2020SO GOOD. i really wanted to make the cardamom-pistachio carrot cake for my friends birthday but it looked too complicated to make without an electric mixer so i went with this instead and added cardamom and chopped pistachios and it was SO GOOD. aromatic. moist. sweet. tangy. delicious. thank you molly.Anonymouschicago4/20/2020BEST CAKE EVER! I loved the taste of it. I will make it again.mommy is meNashville, TN4/20/2020Made this yesterday - I’m not very good at baking normally, but  the recipe was very easy to follow and it turned out so well! AnonymousMontreal4/18/2020Easy and simple, and  I enjoyed not having walnuts or coconut. Since we didn’t have company this year for Easter, I halved it and baked in muffin tins.Anonymous4/15/2020I wanted to make a smaller cake for Easter (because quarantine) and this loaf cake struck me as just the thing. This recipe held up surprisingly well to a number of alterations. I used Neufchâtel instead of full-fat cream cheese for both the cake and the frosting to no ill effect. Like other reviewers I also added chopped walnuts and golden raisins (1/4 cup each). My loaf pan is 10 x 5 and the batter easily accommodated this! I also added about 1 cup of powdered sugar to the frosting because it didn’t seem as sweet as a conventional cream cheese frosting. After baking I cut the cake in half horizontally, and frosted the center and top to make a small layer cake. With the sugar addition there was plenty of frosting for both—it would have been too much to pile all on top, IMO. \n\nThe cake itself is moist and tender, and I think the spice levels are about perfect. The cream cheese gives the cake a satisfyingly chewy-crisp crust. The only thing I didn’t love about the recipe was the frosting, and that was easily modified to taste. Oh, and this is a serious arm workout if you do it all by hand. It’s doable, but I’m breaking out the stand mixer next time!AnonymousOhio4/11/2020As expected with a basically recipe, this is a perfect base recipe to me. It was extremely tender and the flavour was well balanced. I added roasted walnuts and raisins cause I do what I want. Otherwise, I followed the recipe exactly. I don’t agree with others regarding both the cake and icing to be too salty. I wonder if they weren’t using kosher and following the adjustments recommended?AnonymousBritish Columbia4/3/2020Found it to be very salty. I would use a finer grain or less salt in general.kconsidineMassachusetts3/27/2020Explore Bon AppétitCakeDessertLoaf CakeCarrotVegetableCream CheeseCheeseNut-FreeBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-07", "author": ["Condé Nast", "Molly Baz"]}