{"id": "f68cccb231915f4b18b5ce208a548296", "url": "https://www.bonappetit.com/story/leslie-diuguid", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Leslie Diuguid Ends the Night With Surprise Ice Cream and a Good Stretch | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLeslie Diuguid Ends the Night With Surprise Ice Cream and a Good StretchA glass of wine, an ice cream run, then it’s really bedtime.By Martine ThompsonSeptember 20, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn 'Going to Bed with...' we talk to the people we're crushing on about how they wind down before going to sleep.Leslie Diuguid is an artist who appreciates the art of process. The Brooklyn-based screenprinter crafts  original work that feels not only indispensable but immune to the digital age’s insatiable appetite for newer, faster, and shinier things. “I think it’s really important in this economy, but also in the age that we live in, to focus on and cherish things we can still make with our hands, in quality settings and under fine art conditions,” she says.Under the tutelage of silkscreen printing luminary Alexander Heinrici, whose expertise has been sought by artists such as Willem de Kooning and Andy Warhol, Diuguid has spent the better part of a year producing large scale editions. A typical day consists of cleaning and loading screens, “keeping a hawk eye on quality control and large scale paper handling,” and tending to her screenprinting business Du-Good Press, named for her grandfather, Lincoln I. Diuguid, who founded a company called Du-Good Chemical Laboratories & Manufacturers in the 1940s.To deal with the physically grueling aspects of the job, like standing hours at a time and stretching to reach every level of a five-foot-tall drying rack without harming the paper, Diuguid has cultivated a solid routine before bed. Here, Diuguid shares how she repurposes childhood memories into a wind-down for bed and the importance of finding and cultivating the self-care habits that work best for you.Diuguid stretching out before bed.\nPhoto by Emma FishmanA special stretch twice a dayWhen I was 13, I started noticing all of these changes happening in my body. I felt awkward and uncomfortable with myself and wanted to have control over some aspect of my physical growth. So I started doing a stretching routine I learned from a combination of watching my mom work out to pilates videos as a kid, track exercises, and my take on what I thought yoga was. It starts with the butterfly stretch, moves into one-leg-out stretches, and you end up in a split position eventually. I also roll on my back a bit for some reason—it made sense at the time [laughs] Doing this every day gets me to relax, and it’s a good way to transition toward bed.Some hair TLCIt’s taken a lifetime for me to learn how to take care of myself, especially when it comes to my hair. I love having a big afro during the day, but in the summertime it’s too hot so I’ll usually just braid it back. I don’t mess with my hair every day if I don’t have to: That’s a stressful thing that actually ends up hurting it. My hair care routine changes with my hairstyle, but I always make time for a weekly Sunday spa day to meditate and reflect. I wash my hair, braid it down, keep it there for the whole week, and I’ll wear a silk scarf to bed if anything at all.Netflix + ice creamI tend to fall asleep while watching Netflix, and my boyfriend gets mad that we have to go back all the time. Lately I’ve been so addicted to the HBO show Animals. It’s hilarious and similar to BoJack Horseman in that it’s about personified animals, except here it’s New York City rats, cats, dogs, and birds living like humans. After falling asleep to that, I usually wake up with the thought, “What if we went and got ice cream?!” I’m addicted to Cool Haus. Before bed sometimes my boyfriend and I will go on bodega missions for their ice cream sandwiches.Halo Top for dessert.\nPhoto by Emma FishmanBeating restless energy with chores...or wineI get pretty tired after being so energetic throughout the day so when I crash I usually crash hard, and I’m a very hard sleeper. I’m prone to falling asleep in funny places too: I’ve dozed off in the middle of my boyfriend giving me a stick-and-poke tattoo. He's a painter so I told him early on in our relationship that he could tattoo anything anywhere on me and he chose a drawing of Starlite (Rainbow Brite's horse) on my shoulder. If I do have trouble sleeping, sometimes I’ll clean the bathtub and do other chores. Or why not have a glass of wine? A glass of wine to  knock yourself out, then surprise yourself awake and get ice cream, then it’s really bedtime.Sticking to the planPart of my best self-care practice, because I’m so tactile and energetic, is to use routines to keep myself in check. That’s how I balance a lot of my life, just having a structure that lets me repeat something. As a printmaker, it helps with establishing steps along the way that keep me occupied and focused. A lot of my routines come from observing my parents, like my stretching practice. My dad tends to be practical in his diet and exercise. So far, I haven’t mastered that level of discipline, but his meticulous record-keeping has proven to be a good skill I’ve picked-up and held tight to. It’s taken me a long time to realize that I’m good at my routines and to keep with them. Bodies change constantly; you’re never fully grown. Your routines and how you care for yourself will change with your age; none of it is set in forever.Explore Bon AppétitHealthyishGoing to Bed withInterviewsRead MorecultureBria Vinaite's Before-Bed Routine Involves Cotton Candy Grapes and a Migraine HackBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-20", "author": ["Condé Nast", "Martine Thompson"]}