{"id": "f695f8f53dfc81826a199b23bdf7f0f3", "url": "https://www.bonappetit.com/recipe/shrimp-and-grits-with-fennel-potlikker", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Shrimp and Grits With Fennel Potlikker Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueShrimp and Grits With Fennel PotlikkerBy Carla HallFebruary 8, 20225.0(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintFor an herbaceous take on Southern shrimp and grits, chef Carla Hall cooks grits in her fragrant Fennel Potlikker. By giving the grits a good rinse, bringing them up to a boil from cold, and cooking them slowly and with frequent stirring, Hall ensures maximum creaminess without any dairy. The dish is rounded out with tomatoey shrimp and fresh fennel fronds. Making the Fennel Potlikker is a crucial first step here, so be sure to read through that recipe first.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Saucepan with Lid$36.99 At AmazonWhisk$10 At AmazonMedium Skillet$60 At AmazonLadle$8 At AmazonIngredients4 servings2½cups (or more) Fennel Potlikker, divided1cup stone-ground or regular yellow \tgrits, rinsed, drained1bay leaf3tsp. Diamond Crystal or 1½ tsp.Morton kosher salt, divided, plus more2tsp. freshly ground black pepper, divided, plus more1lb. large shrimp, peeled, deveined, tails on3Tbsp. extra-virgin olive oil1cup finely chopped fennel stems2garlic cloves, thinly sliced1tsp. crushed red pepper flakes2plum tomatoes, cored, finely chopped3Tbsp. coarsely chopped fennel frondsPreparationStep 1Combine 2 cups potlikker and 2 cups cold water in a medium saucepan; whisk in grits. Set pan over medium heat and bring to a boil. Reduce heat to medium-low; add bay leaf and 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt. Cook, whisking often, until grits are thick and creamy, 40–45 minutes if using stone-ground grits or 20–25 minutes if using regular grits. Stir in 1 tsp. pepper and season with salt. Remove and discard bay leaf. Cover pan and keep grits warm over very low heat, whisking occasionally.Step 2Sprinkle shrimp with remaining 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt and remaining 1 tsp. pepper. Heat oil in a medium skillet over medium-high. Working in batches, add shrimp to skillet and cook until just opaque, about 2 minutes per side. Transfer shrimp to a plate.Step 3Reduce heat to medium. Add fennel stems to skillet; cook, stirring often, until starting to brown and soften, about 5 minutes. Add garlic and red pepper flakes and cook, stirring, until fragrant, about 1 minute. Add tomatoes and remaining ½ cup potlikker. Bring to a simmer and cook until tomatoes have begun to fall apart, about 5 minutes.Step 4Return shrimp to skillet and cook until opaque throughout, about 1 minute. Season with salt and pepper; remove skillet from heat.Step 5If grits have stiffened, loosen with a little more potlikker or water before dividing among bowls. Top with shrimp and sauce. Scatter fennel fronds over.How would you rate Shrimp and Grits With Fennel Potlikker?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleDefinitely worth the effort. I am 80 years old and new to cooking. I only bother cooking recipes that I think might be \"wow-worthy.\" \n\nI didn't know what a fell was a year ago, now I use any chance I get to cook with it. This potlikkker is outstanding.zendog2The Villages, Florida3/12/2022This is by far the best shrimp and grits I have ever had. The fennel potilkker gives the grits a subtle, but beautiful flavor.Altha2/27/2022Terrific shrimp and grits. I used Ouzo instead of Pernod for the potlikker which worked well. It's a stretch to say this feeds 4 so I would consider doubling this next time.Anonymous2/26/2022Explore Bon AppétitDinnerBreakfastGluten-FreeNut-FreeShrimpShellfishSeafoodGritsRice & GrainsTomatoVegetableFennelSouthernAmericanSoul FoodMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Carla Hall"]}