{"id": "f69a362f90c4404e0aa0b11ca82e5697", "url": "https://www.bonappetit.com/story/tropical-cobb-salad", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Tropical Cobb Salad Is Even Better Than the Original—There I Said It! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Tropical Cobb Salad Is Even Better Than the Original—There I Said It!This is coming from a diehard Cobb fan—I'd never lie to you.By Amanda ShapiroJuly 25, 2018FacebookTwitterEmailFacebookTwitterEmailThere are meal salads and side salads in this world, and one is clearer superior. Side salads are typically afterthoughts, only there to make you feel good about \"getting your greens in.\" Meal salads, on the other hand, are culinary feats, full of nutritious stuff but uncompromising on flavor and not afraid to get a little hefty. And among them, one variety stands alone. I'm talking about the Cobb.The Cobb is the yardstick against which I measure all other salads, and perhaps all other foods. It's the perfect Healthyish meal, a bowl filled with everything I crave that I somehow miraculously get to call a salad. Here at BA, we never saw a reason to innovate on the classic (This recipe pretty much nails it). But then senior food editor Chris Morocco confessed that he'd been putting mango in his dinner salads, and we wanted to be there for him. As he developed the recipe, it moved closer and closer into Cobb territory. Also the word \"Tropi-Cobb\" was just too good to pass up.A traditional Cobb consists of hard-boiled eggs, bleu cheese, tomatoes, avocado, bacon, chicken, and, of course, lettuce, usually with a red-wine vinaigrette. Morocco's tropical version ditches the eggs and cheese for mango wedges and thinly sliced red onion. Tomato and avocado get to stick around, but bacon isn't invited. Wait, before you close this tab in disgust, stay with me: The chicken in this recipe is so remarkably good, you won't miss the pork fat. (And, if you do, just go ahead and put it in there. Who am I, the health police?)More on that chicken: If there's ever a shortcoming with Cobb salad—and I hesitate to even say this about the best salad, period—it's that the chicken is usually boneless skinless chicken breast, cooked well past an inch of its life and crying out for seasoning. Rest assured, the Test Kitchen that brought you perfect pan-roasted chicken thighs would never submit you to such bland horror. Morocco's recipe has us sautéing well-salted chicken thighs in oil and garlic until they're golden brown and just barely done, then seasoning them with vadouvan (or curry powder) so they're juicy and fragrant. The garlicky, spiced chicken is so flavorful, you might be tempted to forgo the dressing altogether, but I highly endorse the simple mix of lime juice, olive oil, and salt that the recipe suggests. Top it all with a mess of basil or mint and a dash of red pepper flakes, and you've got the Tropi-Cobb, aka Cousin of Cobb, aka Castaway Cobb, aka Cobb's Revenge, aka I'll stop, but this is my new favorite salad of all time.Cobb down now, here's the recipe:Tropi-Cobb SaladA refreshingly fruity twist on a traditional Cobb salad.View RecipeExplore Bon AppétitHealthyishSaladRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-25", "author": ["Condé Nast", "Amanda Shapiro"]}