{"id": "f6aab675fd4350807ea2fbe47778e942", "url": "https://www.bonappetit.com/story/brooklyn-delhi-tomato-achaar", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "I Put This Condiment on Everything When I Can't Be Bothered to Make a Sauce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Put This Condiment on Everything When I Can’t Be Bothered to Make a SauceBrooklyn Delhi’s tomato achaar is a little spicy, a lot of awesome. By Carey PolisOctober 11, 2019FacebookTwitterEmailPhoto by Laura Murray, food styling by Kat BoytsovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Never have I felt so victorious as I do when I race home from work; hang out with my five-month-old; cook dinner; and eat said dinner before 8:15 p.m, after putting said five-month-old to sleep, hopefully with a minimal number of tears (mostly him, occasionally me). At this stage of relatively early parenthood, I’ve figured out how to get salmon in the oven and have managed to even chop and sauté a vegetable.But my weekday cooking ambitions have definitely simmered down from my pre-baby life, and I’m okay with that because Brooklyn Delhi’s tomato achaar exists. This slightly spicy amalgam of tomatoes, garlic, salt, black mustard seeds, fenugreek seeds, turmeric, asafetida, tamarind, sesame oil, and sugar is exactly what my salmon needs. Actually, not just my salmon but also green beans, eggs, chicken, rice, toast, and anything else I make that needs that little extra zhuzh. It sounds like a cop-out to say that it goes with everything, but I haven’t met a savory application that it doesn’t work with. My favorite use is probably that random melange of leftovers I bring to the office for lunch—last week it was potatoes, broccoli, red onions, and a garlic-lemon sauce (yes, I made sauce…) that was somehow still bland. I spooned some achaar on it and desk lunch was SAVED.As of this year, Brooklyn Delhi’s products are now at Whole Foods nationwide, which also means… Amazon—and the realization that my favorite flavor booster is just a click or walk away.Brooklyn Delhi Tomato Achaar$12 at Snuk Foods$10 at AmazonExplore Bon AppétitHighly RecommendShoppingCondiment/SpreadRead MorecookingWhat Is Harissa, the Spicy, Peppery Condiment We Will Never Quit?By Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-11", "author": ["Condé Nast", "Carey Polis"]}