{"id": "f6b35f16e4bce10dddc67080bbfbd2f1", "url": "https://www.bonappetit.com/recipe/twice-roasted-squash-with-parmesan-butter-and-grains", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Twice-Roasted Squash With Parmesan Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueTwice-Roasted Squash With Parmesan Butter and GrainsBy Chris MoroccoFebruary 13, 20184.3(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, Food Styling by Rebecca Jurkevich, Prop Styling by Angharad BaileyEmailPinterestPrintEmailPinterestPrintPeeling, seeding, and cutting up hard winter squash is about as much fun as cleaning the stove. But slowly roasting whole, skin-on squash until it’s buttery soft means you can break it open with a spoon. While smaller squash, such as acorn, can be roasted whole, they are more starchy and liable to dry out. For this twice-roasted squash recipe, stick with the big boys.Ingredients4–6 servingsSquash13–4-lb. kabocha, buttercup, or kuri squash3oz. Parmesan, coarsely grated½cup (1 stick) unsalted butter, room temperature½tsp. finely grated lemon zestKosher salt, freshly ground pepperDressing and Assembly3Tbsp. fresh lemon juice3Tbsp. unseasoned rice vinegar3Tbsp. extra-virgin olive oil1Tbsp. honey2scallions, thinly sliced1½cups cooked whole grains (such as barley, farro, and/or black or red quinoa)⅓cup unsalted, roasted pumpkin seeds (pepitas)3Tbsp. golden raisinsShaved Parmesan (for serving)PreparationSquashStep 1Place a rack in middle of oven; preheat to 300°. Prick squash all over with the point of a sharp paring knife and arrange on a foil-lined rimmed baking sheet. Roast until very tender (knife should slide easily through the flesh), about 3 hours. (For quicker cooking, roast at 425° for 1 hour.) Tear or cut squash in half and let sit until cool enough to handle.Marcus NilssonStep 2Remove seeds from squash; discard. Scoop flesh into a medium bowl. Tear skin into 6 large (about 4x4\") pieces and set aside on same baking sheet to be refilled later; discard any excess skin. Add Parmesan, butter, and lemon zest to bowl with flesh and mash together to combine; season with salt and pepper.Step 3Carefully move rack to upper third of oven and increase oven temperature to 450°. Divide mashed squash mixture among reserved pieces of skin and roast until top of flesh is beginning to brown, 10–12 minutes.Step 4Do Ahead: Whole squash can be roasted 4 days ahead. Keep intact and chill.Dressing and AssemblyStep 5While squash is roasting, whisk lemon juice, vinegar, oil, and honey in a large bowl. Add scallions, grains, pumpkin seeds, and raisins to dressing and toss to coat.Step 6Arrange squash on a platter and spoon grain mixture and dressing over. Top with shaved Parmesan.How would you rate Twice-Roasted Squash With Parmesan Butter and Grains?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleOh no, here comes the wet blanket amongst all the rave reviews...I was excited to try this recipe, but it was a real bummer.  It took half the day to make and ended with a sweet, mushy, strange concoction.  I held the raisins until I tried it all together because I was concerned about all the sweetness—but thanks to the honey and sweetly roasted squash, I was glad I left them out! I'm obviously missing the sweet tooth needed to appreciate this dish : ( NS5/27/2021I was skeptical of the flavor combos but this was GOOD! I made it with sweet potatoes instead of squash and served it with crispy mushrooms and a jammy egg. LOVE!AnonymousAttleboro, MA3/9/2021This recipe is superb! The balance of flavors and textures is unbelievable. I've never made anything this good before. I made it for a party and changed it to be vegan. Used vegan butter, maple syrup instead of honey, and I made vegan parmesan, but you could probably just use nutritional yeast to get the umami flavor since it's getting rolled up into the squash anyway. I used a kabocha squash and all three recommended grains (totally worth it for the beauty and varied texture). Golden raisins were also sold out at my local grocery and so I subbed chopped up dates. Once I had all the ingredients ready to go this was super easy to put together, but it is somewhat involved to get everything to that point--definitely a weekend recipe. Anonymousmidwest1/1/2020This recipe is so good! Some caveats: I didn't have parmesan or raisins, so I substituted pecorino romano and dried tart cherries. I had a medium-sized red kuri squash, and was pretty sure it weighed less than the recipe, so I used (roughly) the proportions from the recipe. I used half a stick of butter and left out the cheese and lemon zest from the squash (and added a bit of sugar until it tasted right). I didn't have barley or farro on hand, so I used a Japanese multigrain rice mix and some black rice. I also left out the vinegar from the dressing (I liked it with just lemon). I'm definitely making this for a work potluck on Tuesday, it's so tasty and colorful! Nutty and bright, soft and creamy, chewy and crunchy: it's a VERY well-balanced dish.aeflinn7525Manhattan, KS11/16/2019This was a delicious recipe!  While I think it would probably have been even more delicious with all of the butter, I only used about 1/4 of what was called for.  Still great.  I found the dressing for the grain (I used farro) to be a bit too acidic--and I like vinaigrettes on the tart side.  I'd use a 1:1 ratio of acid to fat/oil next time.  Otherwise, excellent!AnonymousPhiladelphia, PA10/26/2019Oh my god, this is so good. The flavors were amazing, there was great texture from the barley and seeds, and overall it was easy if a bit time consuming (and requiring a lot of bowls/pots/pans). Such a great hearty meal since my husband is vegetarian.\n\nI roasted the squash two days beforehand and would recommend that if you’re planning to make this on a weeknight. Given my pantry situation I substituted shallots for scallions and sunflower seeds for pumpkin with no issue. I also accidentally added lemon juice to the squash instead of the dressing and I actually think that gave it a great flavor.\n\nI’ll definitely make this again!soapnanaChicago10/10/2018This is it, this is how I’m cooking squash from now on. It was so good! I didn’t even use the right type of squash (I used butternut) and it was still amazing! I was a bit weary of the sauce but just like everything else it was delicious. Instead of doing it all fancy and reroasting it in the skins I just slapped down parchment paper and cooked it on that. Also ham tastes really good with this. AnonymousMinnesota 3/27/2018So we're college students (please do not undermine our highly*** developed sense of taste), and this recipe BLEW OUR MINDS. We made this on a Monday night, yes—we refuse to settle for ramen, and yes, we are crazy busy students. IT WAS SO GOOD. We couldn't stop \"mmmmmm\"ing the entire damn time. We would absolutely make this again, it was incredible. Definitely go with the kabocha squash, it makes a huge difference. That sh*t tastes like clouds. Everything came together absolutely perfectly. We also used shallots instead of scallions (we didn't have any) and it gave the whole thing a great crunch. We loved it. Can't wait to eat this as leftovers. sashadimovSan Francisco3/13/2018Followed the recipe first time, rave reviews from dinner mates. The leftovers were used in a breakfast bowl with a poached egg on top, two more thumbs up! Next time I will skip the dressing and drizzle evoo on top, with a squeeze of lime.AnonymousSunset TX2/27/2018Explore Bon AppétitKabocha SquashSquashVegetableParmesanCheeseSideVegetarianHealthyishRoastThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Chris Morocco"]}