{"id": "f6bdaa280ec5505635f1f64c0d702517", "url": "https://www.bonappetit.com/recipe/beef-stir-fry-with-green-beans-and-tomatoes", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "Beef Stir-Fry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBeef Stir-Fry with Green Beans and TomatoesBy Chris MoroccoSeptember 25, 20185.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Olivia Anderson, Prop Styling by Bea ChastkaEmailPinterestPrintEmailPinterestPrintOlive oil works great in stir-fry recipes; its sharp grassy notes complement flavors like lemongrass and basil.Ingredients4 servings1lb. boneless beef short ribsKosher salt2lemongrass stalks, tough outer leaves and stems trimmed1serrano or Fresno chile or jalapeño12\" piece fresh ginger, peeled4garlic cloves2tsp. toasted sesame oil (optional)1tsp. light brown or granulated sugar½lb. green beans and/or snow peas2ears corn, kernels cut from cobs3Tbsp. extra-virgin olive oil, divided1cup Sun Gold or cherry tomatoes1cup basil leaves, dividedFlaky sea salt and lime wedges (for serving)PreparationStep 1Trim any big pieces of fat from beef, then thinly slice across the grain. Place in a medium bowl; season with kosher salt. Using a Microplane, finely grate lemongrass, chile, ginger, and garlic into bowl. Add sesame oil, if using, and brown sugar and toss to combine. Let sit at least 10 minutes or up to 1 hour.Step 2Meanwhile, trim stem ends from beans. Slice beans in half lengthwise (or you can slice each at a steep diagonal into a few pieces—this will help them cook a bit more quickly). Transfer to a small bowl, add corn, and toss to combine.Step 3Heat 1 Tbsp. olive oil in a large nonstick skillet over medium-high. Add half of beef mixture in a single layer and cook, undisturbed, until well browned underneath, 1–2 minutes. Toss and cook until nearly cooked through but still pink in spots, 30–60 seconds longer. Transfer to a plate. Repeat with 1 Tbsp. olive oil and remaining beef mixture.Step 4Cook bean mixture and remaining 1 Tbsp. olive oil in skillet, tossing occasionally, until beans are crisp-tender, about 4 minutes. Return beef to skillet along with tomatoes and half of basil. Cook, tossing occasionally, just to let flavors meld, about 1 minute. Season with kosher salt.Step 5Transfer stir-fry to a platter. Top with remaining ½ cup basil; sprinkle with sea salt. Serve with lime wedges for squeezing over.How would you rate Beef Stir-Fry with Green Beans and Tomatoes?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleFantastic.  Made this twice so far.  Highly recommend.   It is surprising the flavor that is carried over from the marinade into the final dish, even if that is not mentioned in the recipe, it comes through and the flavors really come together nicely.   Never grated a serrano pepper before but i used a disposable glove.Lauren TChicago8/16/2021I agree with the other reviewer as to why no one has written this one up! Its terrific. I added one more Serrano pepper. I did cut up beans and remove corn kernels the day before since this had a lot of grating steps, so it would be faster. It’s super tasty paired with basmati rice. And limes are key! DianneeeMaui Hawaii8/23/2020How has this dish not had any reviews? It was utterly delicious and comes together real fast, perfect for a weekday dinner without feeling overly full. I paired it with white rice, it was a hit!AnonymousVictoria, Australia8/21/2020Explore Bon AppétitStir-FryChineseEast AsianAsianThaiSoutheast AsianShort RibBeefMeatLemongrassHerbs & SpicesJalapeñoChileVegetableCherry TomatoTomatoBasilGreen BeanEasyOne-Pot MealsWeeknight MealsMainDairy-FreeGluten-FreeHealthyishFrySautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-25", "author": ["Condé Nast", "Chris Morocco"]}