{"id": "f6ce2ec08cdaa4d9b38311bbab64f707", "url": "https://www.bonappetit.com/recipe/cranberry-fig-sauce", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Cranberry-Fig Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueCranberry-Fig SauceBy Claire SaffitzOctober 16, 20185.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintFigs bring a touch of sweetness to this bright, chutney-ish cranberry sauce and nicely offset the sharpness of the vinegar.IngredientsMakes about 2½ cups3Tbsp. unsalted butter1large shallot, finely chopped1Tbsp. finely chopped rosemary1lb. fresh (or frozen) cranberries6oz. dried Turkish figs, coarsely chopped⅔cup (packed) light brown sugar¼cup balsamic vinegar½tsp. kosher salt, plus morePinch of crushed red pepper flakesPreparationStep 1Melt butter in a large saucepan over medium heat. Cook shallot and rosemary, stirring often, until shallot is starting to turn golden, about 4 minutes. Add cranberries, figs, brown sugar, vinegar, ½ tsp. salt, and red pepper flakes and increase heat to medium-high.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 2Bring to a boil, stirring to dissolve sugar, and cook, stirring often and reducing heat as needed to avoid scorching, until cranberries burst, juices are syrupy, and pan is visible when a wooden spoon is dragged across the bottom, 9–12 minutes. Let cool. Taste and season with more salt if needed.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 3Do Ahead: Sauce can be made 1 week ahead. Cover and chill.How would you rate Cranberry-Fig Sauce?Leave a ReviewTell us what you thinkExplore Bon AppétitSauceAmericanCranberryBerryFruitFigRosemaryHerbs & SpicesSideVegetarianNut-FreeSimmerThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Claire Saffitz"]}