{"id": "f6df615ab4c5b68673552a5fcc403c63", "url": "https://www.bonappetit.com/story/eli-kulp-high-street", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "An Amtrak Crash Left Chef Eli Kulp Confined to a Wheelchair—But It Hasn't Kept Him from Running 4 Restaurants | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAn Amtrak Crash Left Chef Eli Kulp Confined to a Wheelchair—But It Hasn't Kept Him from Running 4 Restaurants\"After an accident like this, you need a why. At the end of the day, there is no why.\"By Eli KulpJanuary 31, 2018FacebookTwitterEmailCondé Nast EntertainmentFacebookTwitterEmailIn 2012, at the age of 34, Eli Kulp quit his job at the iconic Torrisi Italian Specialties in New York to take his first executive chef post at Fork in Philadelphia. Within two years, he opened High Street on Market next door, which quickly nabbed the number two slot on the BA Hot 10 and garnered him a best new chef title from Food & Wine for Fork restaurant.Kulp’s inventive but decidedly unfussy cooking was electric. Diners flocked to Philly for his breakfast sandwich, the Forager, at High Street, which stacks a house-made bun with smoky oyster mushrooms, braised kale, and a runny fried egg. At Fork, guests came in groups to order the darkly lacquered duck that arrives at tables whole and festooned with a bouquet of fresh herbs and flowers. Kulp’s cooking helped invigorate the Philadelphia dining scene and push it into the national spotlight.Soon, he and business partner Ellen Yin started to plan an outpost of High Street in New York, with Kulp shuttling back and forth between the cities. On one of those trips in May of 2015, the train he was riding, Amtrak train 188, jetted off the rails when it headed into a sharp turn at 106 miles per hour. Eight people were killed and nearly 200 were injured, including Kulp, who suffered a major spinal cord injury, which left him confined to a power wheelchair with limited use of his arms. This summer, between tastings and meetings, he met us at High Street on Hudson to share his story. —Devra FerstTorrisi was craziness. It was this tiny little place, a thousand degrees in the basement and I was working ridiculous hours. It was good, but by the second year I realized I needed to go off on my own. I knew I would never be satisfied if I didn’t try to go off and just see what Eli can do.That’s when I got a hold of Ellen Yin, my now business partner, through a mutual friend. She was looking for a new chef for Fork, which was already 15 years old at that point. I had never even been to Philadelphia before, but our goals aligned, so I was hired as the restaurant’s executive chef. In 2012, we closed Fork for two weeks and invested about a quarter million into relaunching it. By the next summer, we were already building out High Street on Market.It was a new idea: A chef-driven breakfast to dinner concept. That wasn’t really around back then. We didn’t serve pancakes and waffles, or other typical breakfast items or fare or food. I grew up eating sandwiches for breakfast (I was never a cereal guy), so at High Street, we made them the star of the show.Our food was playful. We were reimagining of a lot of classics without presenting it in a fussy way. We took vitello tonnato (typically thinly sliced cooked veal dressed with a creamy tuna sauce) and made it a veal carpaccio with cubes of sushi-grade tuna and drops of mustard oil so the plate would look like a mosaic, and we served crab apple soup, which was apple soup with crab in it. There were a lot of plays on words, which was the Torrisi effect.The next year, 2014, was a pretty tremendous one. That June, I was named a Food & Wine best new chef. It meant everything to me because I had grown up admiring the chefs on those lists. Two months later, Bon Appetit came out with their Hot 10. I think they announced it on CBS and I was on my way to work and Ellen called me and said: “We’re number two!”I don’t think you ever expect that kind of recognition, you hope for it, but you don’t start a restaurant thinking you’ll become a national sensation. The acclaim is validating, but it doesn’t define you. When the recognition came, I would find myself thinking back to my days at Torrisi when I wasn’t sure of my ability, but I knew I had to go off on my own.In 2014 and 2015, it felt like, “Wow, this dream’s coming true.” Those were really big years and there were only going to be more big years to come.When we started contemplating a restaurant in New York, I was going back and forth between the two cities a lot. I was commuting on the train sometimes three or four times a week. On the night of the accident, I wasn't even supposed to be down in Philly that day. I left early that night because I had just started Crossfit and I wanted to get back for an early workout. I caught a train left at 9:10 p.m. instead of my usual at 11:04 p.m.A few minutes into the ride, I got a text from my friend who I had seen the weekend before. It was a photo from that Sunday of me, my wife, and son by Park Avenue and 97th Street, near where we lived. It’s where the Metro North trains come out of the tunnel from Grand Central. I used to take my son there after pre-school, and for a while, he would get a little spooked. It was too loud for him. That weekend, I was holding him up on the fence and I asked him: “Are you scared?” He said: “No, I’m not afraid of trains anymore, daddy.”I texted my friend back: “Daddy, I’m not afraid of trains anymore,” as an inside joke. Two minutes later, the train I was riding turned a corner too quickly and flipped on its side. I went airborne and smacked my neck on a luggage rack. It felt like it happened in slow motion, but it all happened in a matter of two or three seconds. That’s all it took. I didn’t have a scratch on my body; I didn’t lose consciousness, but I couldn’t move. I was face down near a window, buried under luggage that had gone flying in the air. It took about 30 or 40 minutes for me to be rescued. I thought I was dying, not too many people experience that in their life. A lot of people who get into an accident say: “I don’t remember anything.” I wish that were the case.My life since then has been a struggle of acclimating. You have to learn to live again. You have to sink into this life. Everything is a question mark; life is a question mark.I could barely move my arms at first. You’re lying there in a hospital bed and you don’t know what life is going to look like. You’re still holding on to what you thought it was going to look like. You lay there thinking: “How am I going to be a chef again? How am I going to be a dad? How am I going to be a husband? How am I going to do anything?” The questions just spiral.When I came home from the hospital six months later, I was depressed and my confidence level was shot. I really had no concept of how I could ever be happy again and I was struggling to figure out day to day how I could be effective. I wanted to fade out of the public eye; I was embarrassed. I would sit at home and say, “Look at you;” I didn’t get back to the restaurant for months.One day in the winter of 2015, I was so bored at home, but I didn’t have a car yet. I said to my assistant—since the accident, I’ve needed somebody with me all the time—“Screw it, let’s figure it out and get down there.” We got on a bus from the Upper East Side, then another, and another. Eventually we made it downtown to the West Village, where the buildout for High Street on Hudson was underway. I hadn’t told anyone I was coming, so when I rolled in, the only people there were the construction guys, who had no idea who I was. I left really deflated. I thought I was going to be happy to get here, but it ended up being this anticlimactic, depressing moment.With an injury like this, you have to grieve. Everytime you enter an environment that you haven’t been in since you got hurt, or see something you can’t do, you go through a grieving process. Your body and brain has to compute, “Wow, this sucks.”In the past, I had this dream for the restaurant. I envisioned coming downtown with my wife and my son. It was an experience I had always hoped for and then it all got wiped out—or, at least I thought it did.I look back at those days even though they were only a year and a half ago and I feel like I was a different person. Before the crash, cooking defined who I was and I couldn’t do it anymore. I was angry. I didn’t want to be creative.Everybody I met would say things like: “Oh, but you can still think about dishes and you can taste.” Or, they would say, “Look at what you can still do.” For me, it was like: “Fuck you. You don’t know. I know I can do this, that’s not the point.” I knew everybody was just trying to be helpful, but I have a pretty firm grasp of who I am and I knew I could no longer do it.I started to blame my career. After an accident like this, you need a why. At the end of the day, there is no why. An Amtrak engineer made a mistake—that’s why, that’s the reason. Depression will make you feel like you have weights on your legs, so you can’t move.But, by November 2016, something flipped. I felt like I could do it—I felt like I could take back ownership of my life. My wife and I had separated and it was sort of an end of a chapter. I started to re-organize my head and figure out how I can be effective as a parent, as a restaurateur, as a chef. I’ve realized that I’m still very effective and, at the end of the day, I’m still me, it’s just a matter of that confidence, that energy, building back up.Eli Kulp and High Street on Hudson chef Sean McPaul\nCondé Nast EntertainmentThese days, I’m living in Philly and I’ve had to switch my thought process from a chef to more of a restaurateur. It’s not that I’m forgetting about the culinary side, it’s that I’m using it to see other perspectives of the restaurant business. My involvement these days is listening, helping, supporting. I spend time strategizing with the cooks and trying to figure out how to get the best product to the table.I’ll say to my team: “I want to put tomatoes on the menu. Let’s see what you got.” And, they’ll knock out some dishes. Or, I’ll say: “Put this with that and we’ll see how it is. Is it good? Ok, great. Put it on the menu.”So, in a lot of ways, that part of my job hasn’t changed.But, I wish I could get behind the stove. There were times when I had this idea in my head for a dish and it just couldn’t get produced by one of my chefs. I gave up on it. Maybe I wasn’t explaining it well enough or it’s just not possible to execute, even though in my mind it was possible; those times have been frustrating.I lower my expectations because otherwise I get frustrated with what I can do physically. Mentally I don’t have any excuses. There are no excuses for the way I interact with the staff or lead the team. Ultimately you want to inspire your team to do what you can’t.After the accident, Jon Nodler filled my role as culinary director of three of our restaurants. I had hired him as a pasta cook back in 2012 and he’s really grown into this position. I’m proud to see that. On a trip this summer to Philadelphia, I said to him, “Let me see what you got.” He served me five or six dishes in 20 minutes. It was probably the best food I had tasted in a very long time—from anybody. He’s really talented, which is rewarding to see as a mentor.But, I miss being a part of service, I miss being the guy who fires up his troops and goes to battle with them.One silver lining out of all of this is the amount of time that I spend with my son. You ask any chef out there about family and the business and they’ll tell you it’s a difficult if not impossible balance. It’s difficult to make it all work and very few chefs have done it successfully. In a lot of ways, I was probably on that path before the crash.I want to make life as normal for my son, who’s now almost 6-years-old, as I can and I think I do a really good job of that. He’s really pushing me to live a normal life, but there are of course adjustments and slip-ups. A little while ago, we were getting the apartment painted and he was on my lap—he’s always on my lap—and something happened and a profanity slipped. I quickly said: “Uh, those are grown up words.”The restaurant business is hard for any chef, able-bodied or not. It would be easy to say I want out of it. I’ve spent hours thinking about what else I could do. I’ve thought about going back to school and becoming an attorney. But, at the end of the day, I don’t know how satisfying that would be. I spent 20 years of my life pushing pushing pushing this creative outlet that is food. Then I had to adjust. I’m not giving up the ghost yet.I have a lot of stories and this one is a long way from being finished.— As told to by Devra FerstExplore Bon AppétitPhiladelphiaNew YorkHigh Street on Marketeli kulpChefsRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-31", "author": ["Condé Nast", "Eli Kulp"]}