{"id": "f6ede68b0c42de673ff844534f924c0c", "url": "https://www.bonappetit.com/recipe/spicy-cashew-dressing", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Spicy Cashew Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueSpicy Cashew DressingBy Molly BazApril 15, 20194.9(31)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintInspired by the nut-based Caesar dressings at NYC’s Lalito and Scarr’s Pizza, our version starts with roasted cashews. The result is deeply toasty and, thanks to red pepper flakes, fiery too.IngredientsMakes about 1¼ cups½cup salted, roasted cashews¼cup vegetable oil3Tbsp. unseasoned rice vinegar¾tsp. crushed red pepper flakes¾tsp. fish sauce¾tsp. honey1garlic cloveKosher saltPreparationStep 1Blend cashews, oil, vinegar, red pepper flakes, fish sauce, honey, garlic, and ⅓ cup warm water in a blender until very creamy, smooth, and pourable. Taste dressing and season with salt.Step 2Do Ahead: Dressing can be made 3 days ahead. Cover and chill.How would you rate Spicy Cashew Dressing?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleMy daughter’s favorite comfort food is a warm rice bowl from a large trendy salad shop chain (sg) that has this dressing. We were away from home and she needed a pick me up, so I tried to make that salad with this dressing. My first attempt followed the directions to the “T” but it was acidic and a little thin. For version 2.0 I dropped the vinegar to only 2 Tbsp, added 2 Tbsp more of the cashews and nudged the pepper flakes to a full tsp. Perfect!  Thank you for the great recipe!  You made her very happy!  José G3/17/2021I've made this twice now! I didn't have any cashews tonight so I used crunchy PB and a skosh less oil instead.... BOMB! This is my new everything dip.jonathancurtisCarlsbad, CA6/24/2020OMG - Delicious!  Easy too. Decadent tasting but really kinda healthy. It'll be good on all sorts of stuff aside from salads.\nSteve BlanchardPrince Edward County, Ontario4/13/2020Awesome on roast veggies too, broccoli, cauliflower, etc. I bet it would be great on steamed sweet potatoes too. It is now a staple in out fridge.AnonymousSeattle4/9/2020Wow 🤩 what an amazing dressing! Loved it. Saving it and adding it to my collections of BA recipes 🥰jessicaolBrooklyn, NY4/7/2020This will change the way I look at cashews. Surprisingly smooth and tasty, although next time I will increase the amount of red pepper.nczippy Mount Rainier MD4/5/2020This dressing is so addictive. I love how the flavor of the rice vinegar shines through. Good also as a dipping sauce or in something like a burrito. balderdash4/1/2020For those looking for a fish sauce substitute, try vegan \"fish\" sauce made with oyster mushrooms! Or a good dash of soy sauce and some miso paste :)AnonymousCincinnati, OH3/31/2020I’ve made this with sunflower oil and olive oil and it’s just as delicious! Super creamy with a bit of a kick. I put it on everything. Game changer.cdustNew Jersey11/29/2019This recipe was a nice change up it seems like a lot of red pepper flakes but do add the entire amount! delicious!! Colorado11/7/2019Delicious on any kind of green salad. Was too cautious with the red pepper flakes, but full amount next time. AnonymousMexico10/6/2019 So easy to make and super delicious! Really seems like it would be great on everything. (And I don't really like cashews!)AnonymousLos Angeles9/29/2019Wonderful dressing and very easy to prepare, I used worchester instead of the fish sauce and it was excellent!AnonymousNorthern Virginia9/16/2019This dressing just found a permanent place in my refrigerator. Gotta have it at all times. LOVE this recipe. Thanks.AnonymousNYC9/12/2019This is delicious. I followed the recipe but used a fresh Thai chili instead of flakes and added a cube of ginger. Can’t wait to have a salad! This also would be great on cold poached salmon or chicken.capemaycookCape May, NJ9/10/2019Explore Bon AppétitCondimentCashewNutDairy-FreeGluten-FreeHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-15", "author": ["Condé Nast", "Molly Baz"]}