{"id": "f70473b2989265811b6b973a18b03a8b", "url": "https://www.bonappetit.com/recipe/winter-squash-frittata", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Winter Squash Frittata Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueWinter Squash FrittataBy Cortney BurnsJanuary 8, 20194.4(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis frittata could be made in 15 minutes, but Cortney Burns, who developed this recipe, intentionally takes much longer. She cooks the eggs over a low flame, folding the curds over themselves again and again in the skillet to create soft layers like those found in Japanese-style omelets. The low oven she finishes the eggs in ensures that those layers remain custardy and light. Just don’t skip the aioli; it balances the sweet flavors in the frittata.Ingredients6 servingsAioli½cup vegetable oil¼cup extra-virgin olive oil1large egg yolk1garlic clove, finely grated1tsp. fresh lemon juiceKosher saltAssembly2small delicata or 1 small butternut squash (about 1½ lb.)2Tbsp. plus ¼ cup extra-virgin olive oil1tsp. crumbled saffron threads12large eggs¼cup tarragon leaves, chopped1medium onion, thinly sliced2cups coarsely torn kale leaves2tsp. kosher saltRoasted pepitas (for serving, optional)PreparationAioliStep 1Combine both oils in a measuring glass. Whisk egg yolk and garlic in a small bowl. Whisk in 1 tsp. water, then, whisking constantly, add oils, drop by drop at first (do not add too quickly). Whisk until oil is incorporated and aioli holds its shape. Stir in lemon juice; season with salt.AssemblyStep 2Preheat oven to 300°. Cut squash in half lengthwise; scoop out seeds (peel if using butternut). Slice crosswise ¼\" thick. Toss squash with 2 Tbsp. oil on a parchment-lined baking sheet and arrange in a single layer. Bake until tender (don’t let them take on any color), 18–20 minutes. Remove from oven; leave oven on.Step 3Meanwhile, combine saffron and 1 Tbsp. hot water in a small bowl. Let sit 1 minute. Whisk saffron and soaking liquid, eggs, and tarragon in a large bowl.Step 4Heat remaining ¼ cup oil in an ovenproof 10\" nonstick skillet over medium. Cook onion, stirring occasionally, until softened (don’t let them take on any color), 10–12 minutes. Add kale and cook, stirring, until beginning to wilt, about 5 minutes. Add reserved squash and toss.Step 5Whisk salt into egg mixture; pour into skillet. Cook, stirring often with a rubber spatula and occasionally pushing away from skillet sides to shape and compress, until beginning to set and turn golden brown on the bottom, about 5 minutes. Press down on frittata to flatten. Transfer to oven; bake 20 minutes. Slide frittata onto a platter and serve with aioli.How would you rate Winter Squash Frittata?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThe recipe is amazing. Super savory and perfect for a chilly evening. I love the kale, eggs, and tarragon (we used dried instead of fresh - 1/3 the amount) and unlike others, did not find the salt to be too much. The aioli is a bonus but not needed. I could eat this every day. AnonymousDurham NC11/2/2019I haven't made it yet, but I have a question! Those lovely little toasty looking brown things, I assume, are roasted pepitas? Looks like an appropriate and yummy garnish for this meal; why omit them from the recipe? I do want to try this; don't know if my touch will be as light as yours, though; it was beautifully constructed...also, could a little kick of nutmeg and some grated cheese get involved here?Hillsborough, NJ10/15/2019Love the idea of the recipe, and with a few tweaks (squash cooking temp and much less salt) it's perfect.k07278British Columbia, Canada3/4/2019I loved this recipe!! Never would have thought to add butternut squash to my frittata. The saffron and sweet tarragon make such a fragrant addition. I used 1 leek, baby spinach with baby kale, 1 clove minced fresh garlic and 1/2 egg whites and 1/2 large eggs. Also, added grated Pecorino Romano. Definitely Will make again! Thank you for the recipe. Excellent for brunch!!AnonymousTuscaloosa, AL2/7/2019My whole family liked this recipe except that 2 tsp of salt is WAY TOO MUCH!  I will make this again with half as much salt. Also, the aioli is very oily tasting so no one liked it. We chose to add parmesan cheese instead.AnonymousAnnapolis, MD2/2/2019Flavor is good, delicate.  2 tsp is a bit too much salt (and I LOVE salt). Along with a nice simple salad with a lemon vinaigrette would be a perfect meal for me. JoJoBZRUSA1/16/2019Explore Bon AppétitFrittataEggDelicata SquashSquashVegetableKaleLeafy GreensButternut SquashFallWinterMainDairy-FreeGluten-FreeVegetarianHealthyishChristmasBreakfastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Cortney Burns"]}