{"id": "f7047c5a4fc551ff58bad31659039feb", "url": "https://www.bonappetit.com/story/broadway-theater-district-restaurants-nyc", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "All the Theater District Restaurants Our Fave Broadway Performers, Playwrights, Musicians, and More Can’t Wait to Return To  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoprestaurants20 Broadway Performers, Playwrights, Musicians, and More on the NYC Theater District Restaurants They Can't Wait to Return toBroadway is back. So is dinner.By Ali FrancisSeptember 21, 2021FacebookTwitterEmailIllustration by MokshiniFacebookTwitterEmailImagine nurse-scrubs-blue meets over-starched diner-girl dress and white apron. That’s what Sara Bareilles is wearing in her Broadway musical, Waitress, which returned to the Ethel Barrymore Theatre on September 2. “My heart is healing. The theater is church. People are medicine. Singing is prayer. Mistakes are inevitable. Stories are transformation. We are transforming. Broadway is back,” the singer-songwriter, author, producer, and actress captioned an intimate video she posted to Instagram during the opening night intermission.Despite some “wild” nerves and an almost snafu involving a missing pie prop, Bareilles was delighted to be back on stage. Her musical is one of a handful of performances marking New York City’s long-awaited return to Broadway. With about 30 shows currently planned to open between now and the end of year, this month is a milestone for the industry, which was forced to shut all 41 Broadway theaters on March 12, 2020, due to COVID-19. Last week a quartet of classics—The Lion King, Wicked, Hamilton, and Chicago—reopened, and coming soon are Douglas Lyons’s Chicken & Biscuits (September 23), Alanis Morissette’s Tony-nominated Jagged Little Pill (October 21), and Lynne Nottage’s Clyde’s (November 3), among others. As with any pandemic reopening, there are uncertainties: It’s likely guests will need to wear masks, and vaccination requirements will probably be up to each theater.As shows cautiously reopen, nearby restaurants—many of which are still weathering the economic fallout and labor shortages caused by long shutdowns—prepare for an influx of guests. Dinner and a show is an iconic NYC pairing. And while many locals might roll their eyes at the idea of eating anywhere within a 15 block radius of “touristy” Times Square, we promise—before show, after show, or just swinging by—you can find great food in the Theater District. To set the stage we called up 20 Broadway actors, playwrights, producers, musicians, and more to chat about the restaurants they can’t wait to get back to. From a bowl of spicy ramen to street tacos and orange soda to the quintessential Midtown steak dinner, read about where they’re going and what they’re ordering. And whatever you do—don’t miss the curtain.Jessica Phillips, actressCourtesy Quality ItalianA night out at the theater for me wouldn’t be complete without a meal at Quality Italian. It’s a little off the beaten path, but trust me, it’s worth a few extra blocks post-dinner for the incredible menu and ambience. At the right table you can even dine with a view of Central Park.If you’re a wine drinker, the selection is exquisite, especially if you love a full-bodied red. My go-to on the dinner menu is the truly unique chicken parm, which is pounded out thin and breaded. It’s delicious and large enough to feed the table (or one of my teenage boys). The baked clams are scrumptious, especially paired with a serving of the house-made noodles. I never go without ordering my two favorite sides: the corn crème brûlée and the crispy Calabrese Brussels. For dessert it’s a toss up between the chocolate olive oil cake and the traditional tiramisu because, heck, you don’t get more Italian than tiramisu. Or just get them both! —Jessica Phillips, TV and Broadway actress in Law & Order: Special Victims Unit, Dear Evan Hansen, Priscilla Queen of the Desert, and moreLynn Nottage, playwright and screenwriterMy place of comfort and retreat is Ippudo, a ramen shop on 51st Street. During early evenings, in that liminal space between tech rehearsal and previews, I find that I need some place to escape and calm my nerves. There's nothing more stressful than the uncertainty and chaos of putting up a new play, and finding the perfect meal to distract myself becomes an essential part of the developmental process.Upon entering Ippudo, [you’re greeted by] the smell of simmering broth and the warmth of hot steam rising from pots. I'm partial to the sweet-savory tension in the vegetarian steamed bun. And nothing brings together all of my culinary desires better than the spicy karaka ramen. I relish the complete journey of ramen; the aroma wafting from the bowl as it is placed on the table, the first tentative sip of the hot broth, the inevitable struggle with the noodles without making a grand spectacle of myself, the discovery of the pork nestled beneath the mushrooms, bamboo shoots, and scallions—and finally, the joy of lifting the bowl to my lips to get the last bit of savory tonkotsu broth.It is a ritual that has become one of the things I look forward to most during rehearsals and previews. Inexplicably I find that in a moment I'm centered, relaxed, by my meditative time spent with a steaming hot bowl of soup. —Lynn Nottage, cofounder of the production company, Market Road Films, and two-time Pulitzer Prize–winning playwright of The Secret Life of Bees, Intimate Apparel, MJ (forthcoming), and moreKristin Chenoweth, actress and singerJoe Allen. It’s our history. It’s our DNA. It just opened back up. And I love the banana cream pie. I usually go after the show so I can go to town and eat. —Kristin Chenoweth, singer and Emmy and Tony award–winning actress in You’re a Good Man, Charlie Brown; Wicked; and moreSutton Foster, actress, singer, and dancerLos Tacos No. 1, across from the Harry Potter stage door, makes my favorite tacos in the city. I usually order chicken tacos with an orange soda, of course. You stand at the counter and just shove it in your face, and then you're ready to go see a show.When The Music Man opens at the Winter Garden, I have a feeling that Casellula will be our go-to after-show haunt. It has the most amazing Shiraz and takes you on a cheese board journey with jam and mustard and all of these crazy-wonderful things. It also has this amazing chocolate cake with heavy cream on top for dessert. I might have to be careful with that! —Sutton Foster, Tony and Gracie award–winning actress in Violet, Little Women, Young Frankenstein, The Music Man, and moreJordan Roth, producerSome of my most cherished childhood memories are coming into the city with my family for lunch at Orso, followed by a matinee. [Editor's note: Orso is currently closed but plans to reopen as Broadway expands.] It was all so dazzlingly Broadway! To be eating at the theater spot with its rustic Italian design in perfect contrast to the urban electricity of the city outside. To feel the pace in the room start to quicken as curtain time approached, last coffees and checks being hurriedly delivered by servers who had become to me as iconic as the stars we were about to see on stage. To join the crowds heading across 46th Street and peeling off towards their theaters, all eagerly anticipating the lights going down and their lives changing.As a kid I didn’t get the appeal of the specialty of the house, but as I grew up, the sautéed liver with onions and pine nuts became one of my favorite splurges. I start with the tricolore salad that is always topped with the perfect shaving of parmesan. Everything is served on the restaurant’s signature Italian pottery, an explosion of painted color and joy. —Jordan Roth, president of Jujamcyn Theaters and five-time Tony Award–winning producer of Hadestown, Kinky Boots, Clybourne Park, and moreTom Kitt, composer, conductor, orchestrator, and musicianCourtesy Joe AllenSince I was very young, I have had a very special relationship with Joe Allen. Pretty much every family excursion to the theater was followed by a hearty meal and spirited conversation at one of its tables. It is still an absolute favorite of mine for a pre-show meal or a post-show celebration.I’m a sucker for the Caesar salad and the half chicken, and the banana cream pie is a show all by itself! I feel a great sense of nostalgia to dine with my children there, to take in the great ambience and warmth, and to watch them gaze as I also did when I was their age, at all the history on the walls—which also includes their father, whose very first Broadway musical is proudly on display. —Tom Kitt, Pulitzer Prize- and Tony award–winning orchestrator and composer of Next to Normal, Bring it On: The Musical, and more, and arranger for If/ThenJulie Taymor, designer and theater, film, and opera directorI love to go to Portale, a fabulous Italian restaurant on 18th Street—and then I zip up 6th Avenue to the Theater District. For an appetizer, I absolutely adore the burrata with roasted beets, cooked stone fruit, balsamic vinegar, and pistachios. I make it at home with watercress, beets, pine nuts, and watermelon, if I don’t have peaches. The meatballs, the polpette, are the best I’ve ever had; the branzino is delicious; and the pasta with mushrooms and truffles is extraordinary. [The restaurant] is quiet and you can either eat inside or outside. I think it’s great. —Julie Taymor, director of the six-time Tony Award–winning Broadway production of The Lion King and Emmy Award–winning and Academy Award–nominated director of Frida, Across the Universe, and moreDouglas Lyons, playwrightCourtesy KashkavalOne of my favorite pre- or post-show spots is Kashkaval Garden. It has the best Mediterranean dishes in town. The skewers and tapas pair perfectly with a nice glass of red wine. Post-show I also love going by the Glass House Tavern. It's the post-bow hangout for a lot of our industry, full of delicious drinks, wings, and late-night bites! —Douglas Lyons, actor, writer, director, composer, and playwright of Chicken & BiscuitsEva Price, producerIn the old days I ate out a lot. And as I've gone back to the office and started to renew my New York existence, I've been revisiting my favorite haunts. To quote an Andrew Lloyd Webber lyric, “It's as if we never said goodbye.”My favorite is a restaurant called Marseille, which is on 9th Avenue between 44th and 45th streets. My office is in the building just above it, so I eat there for lunch at least three days a week. It's a somewhat quieter dining area: a mix of tourists, locals, and Broadway types. And it serves French-Mediterranean fare in a great, airy, bright environment with huge windows. It has really terrific outdoor patio seating, wooden structures, lovely decor—the whole nine yards.My standard order is either a salad or the avocado omelet with spinach and goat cheese. Both are delicious and filling. —Eva Price, three-time Tony Award–winning producer of Jagged Little Pill, Tina, Dear Evan Hansen, and moreMiguel Cervantes, actorCourtesy Carmine'sMy favorite spot to eat before the theater in Times Square is Carmine’s. Every time I go it feels like a special event is happening. Bring lots of friends and taste some of the best classic Italian dishes in town—delicious. Then take a quick walk two streets over and grab your seat at Hamilton. The only drawback is that it is very easy to eat too much. Those costumes are tight. —Miguel Cervantes, singer and actor in Hamilton, If/Then, American Idiot, and morKelly Devine, choreographerMy favorite restaurant in Midtown is Toloache. Mexican food is my staple. I, of course, start with chips, salsa, and the rojo guacamole. Then I move on to the langosta tacos. They are by far the best lobster tacos I have ever had in my life. All to be accompanied by a chef's margarita. It is my post-show go-to! —Kelly Devine, Olivier Award–winning and Tony-nominated choreographer of Come From Away and Diana (forthcoming)Adam Kantor, actorCourtesy Glass House TavernI've missed those moments of catharsis—those almost holy moments, experienced only in the theater, shared by the audience and the performers. But just as much as the highs that exist inside the theater itself, I've missed the sense of community, manifested nightly post-show at bars around the Theater District. The places we'd go directly from the stage door to decompress, refuel, greet friends, and meet new ones.The sort of default mainstay for many casts of shows on or around 47th Street has become Glass House Tavern. That place almost feels intrinsically linked to Broadway for me. After The Band's Visit, for example, which was just across the street at the Walter Kerr [Theatre], we'd find ourselves there several times a week—taking over a booth or two. It's a place where you're likely to run into someone you know. It kind of feels like Cheers.Fries and a beer or wine and a salad or a martini and a chicken—they've got it all. And it's all pretty damn reliable. I can't wait to get back after a show. I'll probably eat a truffle risotto ball or 12. —Adam Kantor, cofounder of “dinner theater,” StoryCourse, and Grammy and Emmy award–winning Broadway performer in The Band’s Visit, Rent, Fiddler on the Roof, and moreSarah Ruhl, playwright, author, essayist, and professorWest Bank Cafe serves the most glorious mashed potatoes and roast chicken anywhere near Times Square—along with my favorite beet salad. And the red awning of the West Bank sits next to Ollie’s Sichuan, where you might get dumplings or soup on a rehearsal break.I will never forget once, when I was having my first play done in New York City, dining at the West Bank with the playwright Tom Stoppard and the director Blanka Zizka. I had my baby on my lap, and Tom Stoppard offered me one of his scallops. Oh my God, I kept thinking, I just ate one of Tom Stoppard’s scallops.It feels like a fixture of old New York; a place where you might run into a dear friend, a beloved designer, a theater agent, an actor who you’re not sure if you recognize, a theater-lover, an usher, or an artistic light you’ve always wanted to befriend and where you can get delicious, simple, unadorned food, and still make a weird curtain time on a Tuesday night. May it always be so. —Sarah Ruhl, author of the forthcoming memoir Smile: The Story of a Face and of the play and opera, EurydiceOtis Williams, musicianWhen I was in New York for meetings with the producers of the Broadway musical Ain’t Too Proud, one of the great places we dined at was The Palm Midtown located at 250 West 50th Street. It’s one of those warm, friendly places that, as soon as you step inside the dining room, you feel right at home. I love the caricatures on the wall, all reminders of the artists, writers, and Broadway and Hollywood actors who have shared meals there.The food is cooked to perfection and the restaurant team is always on point. If you crave a great steak dinner, the steaks at The Palm are excellent. The seafood is exceptional too; I personally love the restaurant’s lobster bisque, chopped salads, and Chilean sea bass. Usually at the table, between all guests present, there is a bone-in rib eye steak cooked to order, surf and turf, jumbo lump crab cakes, fresh asparagus, and more. I have to stay fit for my concert performances, especially our famous “Temptations’ Walk,” so I have to push back from the table when it comes to the incredible desserts!  —Dr. Otis Williams, sole surviving and founding member of The Temptations, singer, songwriter, and executive producer of Ain’t Too ProudKathryn Gallagher, singer and actressCourtesy PS KitchenMy favorite Midtown restaurant is the amazing P.S. Kitchen. It’s entirely plant-based. Every Saturday I would order the vegan BBQ burger with fries and Caesar salad with fried capers to get my greens in during act two so it was ready right as the curtain came down. Being plant-based myself, finding indulgent vegan food is a full-time hobby and P.S. Kitchen has NEVER disappointed. My mouth is watering thinking about it. I’d have whichever friends in the cast who wanted to join sit in my dressing room and debrief, catch up, and chow down. —Kathryn Gallagher, Grammy Award–winning actress and singer in Jagged Little PillAlexander Smalls, chef-restaurateur, author, and former performerI’m a chef who has owned and operated a few restaurants, so I usually make my own meal before a night at the theater. But for a post-show drink, I prefer the hotels. My favorites are The Bar at the Baccarat Hotel, The Rum House at the Hotel Edison, or Dear Irving on Hudson at the Aliz Hotel. Dear Irving’s Balto Old Fashioned is a new riff on a beloved classic. —Alexander Smalls, James Beard Award–winning chef and co-owner of the restaurants, The Cecil and Minton’s; co-author of the cookbooks Between Harlem and Heaven and Meals, Music, and Muses; Grammy and Tony award–winning opera singer; and Broadway performer in Porgy and BessTiler Peck, ballet dancer and performerQuality Italian is my favorite restaurant. It’s close enough to the Broadway shows to make it on time but far enough away to not feel like you're caught eating in crowded Times Square. My [go-to orders] on the menu are the NY chopped salad (it’s my favorite salad in NY!) and the spicy lobster rigatoni alla vodka. Not to mention the bread they serve for the table is the best.I love how private Bar Centrale is. If you don’t know where it is, you could easily miss it, so just walking in is an experience. I love the intimacy of the space and to me it feels like I am transported into a hidden gem on a side street in Covent Garden! The guacamole is to die for; I love the fish tacos; and the grilled cheese is spectacular if you’re feeling the need for some comfort food. —Tiler Peck, principal dancer with the New York City Ballet and performer in On the Town and The Music ManKatrina Lenk, actress and musicianP.S. Kitchen has delicious vegan food (even lasagna!) and an elegant cocktail menu. The restaurant also donates 100% of profits to sustainable charitable work locally and overseas, while creating jobs for marginalized New Yorkers. I love P.S. Kitchen. —Katrina Lenk, Tony and Grammy Award–winning musician and actress in The Band’s Visit, Tommy, The Marvelous Mrs. Maisel, and moreBeth Williams, producerLast month my husband and I were invited to attend the final rehearsal of Bruce Springsteen’s return to Broadway. After 15 months away from live theater—the business we’ve both worked in for 35-plus years—it was thrilling to head back to Midtown. We decided to make a night of it and met at one of our favorite Broadway-area restaurants, La Masseria, before the show.What I love most about La Masseria is the effusive welcome—both at the door and at the table. I think of [the experience] as a 90-minute mini-vacation in Italy. My full dinner order involves prosciutto and melon, branzino and broccoli rabe, the meatballs, and a bottle of any Italian red wine that starts with a B (Barolo, Barbaresco, Brunello, Barbera, etc). It’s my never-fail trick for ordering Italian red.The restaurant cleared out about 25 minutes before the curtain, and I know I’m not the only person who cried a little when the lights went down at the St. James Theatre. The show was fantastic, of course. But the best smile of the night was in the taxi home when my husband and I were comparing notes. We both agreed that what really made us feel like things were coming back to our Broadway “normal” life was that pre-show dinner at La Masseria. —Beth Williams, co-owner of Grove Entertainment and producer of Diana (forthcoming), The Band’s Visit, On Your Feet!, and moreMare Winningham, actress and singerBefore a show in the theater district I like to go to Molyvos [for] a cocktail and the classic hummus and pita, then avgolemono soup (lemon and chicken soup; wonderful), and fresh whole fish in a lemon oil emulsion. The staff debones it and it’s perfect.After a play or musical I usually go to Joe Allen, because it’s homey, everything tastes good, and you know you’re in a place that has had more conversation about theater per square inch than anywhere in the world. We’ll have some guacamole and chips with a gin and tonic or a Negroni and talk about whatever we’ve seen.Because I am working at the Belasco now, which is next door to Un Deux Trois, we usually stop by after the show and are warmly welcomed to the spacious French bistro where I can have a bowl of soup (always good) or maybe some of their incredible french fries with a green salad and a glass of wine. [Editor's note: Un Deux Trois is temporarily closed but plans to open October 5.]Off-Broadway means a world of choices. My favorite pre-theater meal would be at DomoDomo on Houston Street, for some of its incredibly delicious hand rolls with a glass of sake. It’s a light meal before sitting down to watch something for a couple of hours…and then you’ll be ready for another meal after the show. —Mare Winningham, singer-songwriter and Emmy- and Oscar Award-winning actress in Girl From The North Country, Casa Valentina, Picnic, and moreExplore Bon AppétitRestaurantsNew YorkPop CultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-21", "author": ["Condé Nast", "Ali Francis"]}