{"id": "f712f258a1507437997d1221a3b5ce50", "url": "https://www.bonappetit.com/city-guides/san-francisco/venue/the-riddler", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "The Riddler Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginsan franciscoThe RiddlerPop some bottles at this Hayes Valley Champagne barFacebookPinterestTwitterEmailKassie Borreson GO HERE: for a pre-dinner pregame. Or for a big way to celebrate something big (there are magnums!). Whatever your reason is for popping open a bottle of Champagne, The Riddler has some seriously special bubbles to get your night started.ORDER THE: Champagne! Owner Jen Pelka and her enthusiastic, knowledgeable team stock over 100 bottles of Champagne and curate a not-too serious by-the-glass list (See: “A Joan, for when you’ve had a hard day, a glass of cheap house wine...filled all the way to the rim.”). If you’re feeling peckish, get one of the tater tot waffles, which are just as good as they sound.THE VIBE IS: chill, despite how busy it can get. It feels like you’re dropping in at a friend’s house party, where you can squeeze at the wood bar decorated with vintage Champagne buckets or sprawl out at a table for a hour or two. If it’s warm out, snag one of the two-tops on the sidewalk and imagine you’re in Paris, sitting on the rattan chairs and sipping a condensation-dotted glass of sparkling wine.PRACTICAL STUFF: Open Tuesday to Thursday 4 p.m. to 10 p.m., Friday 4 p.m. to 11 p.m., Saturday 11 a.m. to 11 p.m., and Sunday 11 a.m. to 9 p.m. Closed Monday. You can book a table ahead of time via OpenTable.—Elyse InamineKassie BorresonKassie BorresonWE ALSO LOVERT RotisserieRotisserie chicken gets the spotlight at this unfussy Hayes Valley spotZuni CaféThe iconic Hayes Valley bistro that's world-famous for a reasonTrick DogSteal this Mission cocktail menu, which changes twice a yearExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-28", "author": ["Elyse Inamine"]}