{"id": "f71411ad1fb2424f07eb350699cd85f9", "url": "https://www.bonappetit.com/story/cheese-pants", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "These Cheese Pants Carry 3 Pounds of Cheddar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Cheddar-Colored Cargo Pants Carry 3 Lb. of CheeseI tried on Tillamook’s new cheese pants—and I shan’t take them off.By Ali FrancisFebruary 1, 2022FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Precisely one week ago my colleague, senior editor MacKenzie Chung Fegan, Slacked our entire team a link to these Party Pants from Tillamook’s new Cheddar Capsule collection. There was no text attached; there didn’t need to be. They’re cheese-colored pants custom-designed for storing a lotta cheese. “​​Finally, I can take cubes of cheddar from the party cheese plate back to my apartment,” said senior social media manager Esra Erol, who is as smart at living as she is at dairy-heisting. (Keep an eye on her around your charcuterie.)As someone whose mother recently accused her of being anti-capitalist, “like that sad protagonist in Conversations With Friends,” it’s rare that I see branded merch and think: Wow, cool, I love to be sold things that are designed to turn me into a walking billboard. Maybe it’s their sturdy-looking ship icon or the sort of Old World font they use for their logo, but I like to think of Tillamook as the nice guys of Big Cheese. They’re based in Oregon (cue the kooky Portlandia vibes). They’re a farmer-owned co-op. Their cheese is genuinely very delicious.I thought about the Tillamook marketing team sitting around their boardroom table—made of farmhouse wood—and of one intrepid employee pitching this wild idea to their Cheese Boss. There will be insulated pockets, I imagined them saying. They will come in fresh curd yellow. They will demand a matching tasseled sweater—thick-cut, like our rustic, beloved cheddar. I envisioned the young genius slowly rising out of their chair as the room burst into applause and a tear trickled down the CEO’s face. I ordered a pair of the cargo pants. And then, a few days later, I Slacked this photo to my colleagues:The author feeling powerful in her cheese suit.\nOf course, they had questions. “How many pounds of cheese can you fit?” asked production assistant Nico Avalle, straight to the business end of things. I thought about testing this with Babybels as the unit of measure, which seemed like a more objective—independent?—study. But after much discussion, it seemed unlikely that my employer would cover this expense. So I asked a Tillamook spokesperson, who confirmed: The Party Pants, which were made in collaboration with Portland Garment Factory, are purpose-built to carry three pounds of cheese. (Or about 68 Babybels.)A bunch of people wanted more information on the pockets. I am not a mathematician, but I counted nine. The largest, which is intended to fit Tillamook’s one-pound block, is insulated, removable (like a fanny pack), appears to be made from poly-spandex, and promises to keep your cheese cold for up to six hours. Impressive!On the front-left leg, you’ll find another removable pocket about the size of an iPhone with a cord you can slip around your wrist if you’re worried about cheese pirates copping your stash. Over the left knee are three rows of two pockets each, stitched into the nylon pant leg with the same poly-blend flaps. I cannot deny, I am less confident in their insulating abilities but appreciate the effort all the same. The poly butt pocket delivers no surprises—unless you sit on your cheese. A good tip from Tillamook’s people: “Cheese should stay wrapped while in pockets to keep dogs from sniffing you out at a party.”As for the fit, I ordered a S/M and they were a little tight around the waist (I typically wear a 4 or a 6)—definitely not enough room to accommodate the three pounds of cheese being harbored below the belt. The matching oversize Thick Cut Crewneck was a little scratchy at the seams but would certainly be fine if you wear an undershirt.“You look like a baby chicken,” my boyfriend said as I paraded around our apartment in the full set, which was very confusing—a metaphor from the wrong side of the aisle. “Do you feel ✨ flawless ✨?” asked our executive editor, Sonia Chopra. I felt powerful, like the assertive zing of sharp, aged cheddar. And while stocks last you can too.Tillamook Cheese Party Pants$35 at Tillamook ShopExplore Bon AppétitShoppingCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-01", "author": ["Condé Nast", "Ali Francis"]}