{"id": "f71bb80ff063f1130f918c5beb29624f", "url": "https://www.bonappetit.com/recipe/pineapple-glazed-ham", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Pineapple-Glazed Ham Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssuePineapple-Glazed HamBy Chris MoroccoNovember 20, 20184.3(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWe love the look of 1950s-style pineapple-glazed ham, maraschino cherries and all, but not the cloying sweetness. We spiked the glaze for our retro-chic version with hot sauce and apple cider vinegar to cut through the sugar. For the best results, the ham should rest before slicing just like any other roast; a full hour is ideal, but 30 minutes will work.Ingredients8–12 servings½pineapple, peeled, sliced into rings1large orange, sliced into thick rounds110-lb. cured smoked bone-in ham or 6-lb. cured boneless ham3cups pineapple juice½cup apple cider vinegar½cup (packed) light brown sugar¼cup hot sauceMaraschino cherries (for serving)PreparationStep 1Preheat oven to 300°. Stack 2–3 sheets of foil ample enough to cover ham on a work surface and arrange pineapple and orange slices on top in a single layer. Set ham on fruit (if using a bone-in ham and it has a fat cap, score very lightly, making cuts about ¾\" apart) and wrap up tightly. Transfer to a wire rack set inside a large rimmed baking sheet and bake until an instant-read thermometer inserted into the thickest part of ham registers 115°, 3–3½ hours for boneless, 3½–4 hours for bone-in.Step 2Meanwhile, bring pineapple juice, vinegar, brown sugar, and hot sauce to a boil in a large saucepan. Reduce heat; simmer, swirling occasionally, until thick enough to coat a spoon. Keep warm.Step 3Remove ham from oven and increase oven temperature to 425°. Unwrap ham, peeling back the foil so it covers the baking sheet (this will make for easy cleanup). Once oven is at 425°, baste ham with warm glaze and return to oven. Bake, brushing with more glaze every 3 minutes or so, until glaze is deeply browned and thermometer registers 125°, 12–15 minutes. Carefully transfer ham to a cutting board and let rest 30–60 minutes before slicing.Step 4While ham is resting, roast fruit, spooning juices over from time to time, until deeply browned, 20–25 minutes.Step 5Serve ham with roasted fruit and cherries alongside.How would you rate Pineapple-Glazed Ham?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleLean Jester read the recipe, this is for a non Country style Ham. Believe it or not some folks don't like Country Ham. NBSP of N.M. this recipe calls for it to be heated in an oven, not a Crockpot, that's probably why yours turned out a mess. The oven is normally that box like thing under the burners.terrySt. Augustine12/11/2021It's an okay kind of city-Yankee receipe, but would never work with a \"country\" ham, which is what I grew up with. \n\nMy mother was from the Gulf Coast, born in the Edwardian age. Hams were salt-cured, the other additions to the base cure varied from ham house/butcher. \n\nFirst, you soak your ham for 24 hours, this both hydrates the ham and gets rid of the cure, otherwise it's far too salty. Then you score the ham in a one-inch pattern, inserting a whole clove at each intersection. Bake in a slow oven (~300°F) on a rack, tented with aluminium foil. When the ham reaches 115°F, remove from oven, discard tent and increase oven to fast (~450°F). Drain pan juices in a graduate, add sugar (mom would use dark brown, I prefer turbinado) and fresh orange juice. Baste ham, return to oven un-covered, basting every ten minutes until it reaches 145°F. Let rest, use remaining glaze and juices to make a thin gravy thickened with cornstarch. Enjoy! Merry Christmas from Southern Virginia.\n\nADDENDA: Using Coca-Cola in a glaze was in my mother's view, \"an abomination before God.\" Many Southerners dis-agree. I've had it, it's okay, and I wasn't struck by either lightning or a ghostly spoon. \nPre-cooked hams: bah. Just get a canned Westphalian ham and be done with it.\nPre-sliced hams: Gentlemen learn to carve. 'Nuff said.Leon JesterSouth Central Virginia12/10/2021Yummmmm\nAnonymous12/10/2021I made this last year for Christmas and it was a perfect compliment to the whole meal. I'm making it again this year and am really looking forward to it! The glaze smells very acidic while it's cooking so it made me nervous, but once I started basting the ham and saw it build I got very excited. I like to make slightly deeper cuts so the glaze gets deeper in the ham-- it's only what you broil that gets a nice sticky glaze. Take your time with this step, you won't be sorry. Amanda D.West Virginia11/24/2021Made this for Easter and it was a hit! The glaze was smelly (bc of the ACV) and took a long time to reduce but it was worth it! I used fresh pineapple sliced the day before and it did not turn the ham to mush. I used the bone and leftover ham to make soup and the sweetness made the brodo sooo good. Will definitely make this every year. SKPhiladelphia, PA4/10/2021Do NOT use fresh pineapple. It turned my ham into paste! 10/10 would NOT recommend.AnonymousChicago11/28/2019I made this recipe twice, Christmas Eve and Easter.  It is always  a family favorite and a new tradition   I followed recipe exactly as stated    The only thing worth mentioning is the sauce takes forever to thicken however it’s worth the wait.  This recipe will not disappoint.   Garnet333Upstate NY 4/21/2019Made this for a New Year's Eve meal-- fantastic when following the recipe exactly. The sauce for basting was perfection. I'm typically not about hot sauce, but this for sure converted me to embrace its better merits. With so much fruity sweetness in the dish, the spiciness was a welcome counter-balance. My guests really appreciated how the glaze accentuated the outer edge of the ham, the part I already consider the best part. With people arriving shortly and watching the pot closely, I thought the sauce would never come to a boil but patience won the evening. After lowering the heat to make it simmer, I got the perfect viscosity and a real night-winning main course. This was an absolutely fantastic way to close out 2018. jrehbockLos Angeles, CA1/1/2019Beware fresh pineapple with ham.  It turned my crockpot pineapple ham into ham paste.  Something about the enzyme in pineapple.  Similar problem with gelatin - it will never gel with fresh pineapple.  I won't rate the recipe.  It sounds like it would be delicious if it doesn't turn into ham souffle.  Happy holidays all!nbspNew Mexico12/24/2018I bought an 8.75 bone in ham from Trader Joes. Not really sure the fruit at the base did much, but it didn’t hurt. For the glaze I used one can of pineapple juice, one can of Vernors ginger ale. I don’t think I used as much hot sauce, as I only had a 1/4/of a small bottle of Chalula.  It never really got thick, but poured it over the ham 2x during the high temp part. Everyone loved it. mizzvickNapa12/24/2018Wondering if you'd brine or season the ham overnight at all?hopeshelbyprice12/7/2018Explore Bon AppétitAmericanHamMeatPineappleFruitMainNut-FreeGluten-FreeDairy-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Chris Morocco"]}