{"id": "f733ab3c19123a5bb01baa2a4414cdc1", "url": "https://www.bonappetit.com/story/folasade-adeoso", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Folasade Adeoso Goes to Bed With Indica and an Easy Homemade Linen Spray | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleFolasade Adeoso Goes to Bed With Indica and an Easy Homemade Linen SprayA killer playlist and all-natural skin routine also her up unwind.By  Siraad DirsheMay 24, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn Going to Bed with..., we talk to the people we're crushing on about how they wind down before going to sleep.The job title “creative” is certainly eye-rolling, but in some cases it’s couldn’t be more apropos, and Folasade Adeoso is one of those cases. The 31-year-old Harlem-based Adeoso is not only a digital collage artist but also the co-owner of Teranga, a New York City-based African fast-casual restaurant and community gathering place.Born in Abeokuta, Nigeria, Adeoso grew up in Canada then moved to New York City during her senior year of high school, which was when her creative direction truly started to form. “I was in a band and took my first web/graphic design class. I found myself waiting for my mom to go to bed so that I could stay up and code my BlackPlanet and Myspace pages and make digital collages on Photoshop.”When you ask Adeoso to describe what she does now, her answer is simple: “I make things happen.” Like her dream of paying homage to her culture through food come true. “For me, African food as always been personal. Eating at Teranga is as delicious as it is educational.”Despite being incredibly busy, Adeoso still puts in serious effort to ground and care for herself each night. Reading art magazines that she picks up at McNally Jackson Books, listening to disco music, and surrounding herself with like-minded folks well into the evening are all a part of her routine. Keep reading to find out what songs help her unwind and the linen spray she swears by for a restful sleep.Nothing de-stresses like a really good stretch.\nPhoto by Emma FishmanStretch it outMy days are pretty jam-packed, especially since opening Teranga, so it’s really important that I slow down each evening once I come home. I’m on my feet for most of the day, so yoga and stretching really help me unwind. You can also find me dancing around my apartment a lot of nights. Moving helps to clear my mind while getting in a bit of exercise before bed.Stress less, disco moreI’m really into groovy music, even in the evenings, which I know sounds contradictory. I recently curated Teranga FM’s Vol. 2 (Disco Inferno) playlist on Spotify, and it’s a compilation of some of the best disco music to come out of Africa during the 1970s and early 80s. I’ll often put this on when I come home from a long day to help me forget about the day’s stress.Cooking as therapyMost Saturday nights are spent working at Teranga, but if I’m home I’ll most likely have on music and be cooking. My favorite Nigerian dish to make is a spinach stew called Efo Riro with Eba, which is a fufu made from pounded cassava. I usually make this for my family, since it really reminds me of home.Mixing a homemade turmeric mask\nPhoto by Emma FishmanNatural skin care or bustMy evening skincare routine is a time for me to pause, slow down from my busy day, and wash it all away. Right now, I’m transitioning out most of my previous skin care products for natural ones.I really like Herbivore Botanicals. Their Moon Fruit Superfruit Night Treatment is a leave-on treatment cream that I am obsessed with because it’s perfect for gentle overnight exfoliation plus it smells amazing! I also love making my own masks, like Baobab and Turmeric.Power down to power upBefore going to bed I like to smoke an Indica strain of cannabis to help me power down from the day. Right now, I’m into mixing with other flowers. Barbari's herbal blend is my favorite! Because I don’t know how to roll, I usually use my Laundry Day pipe if no one’s around to help me.I’m also really into using CBD, in all its forms, to help me unwind in the evenings. In fact, I recently switched my melatonin for Gossamer's Dusk night time CBD. I also swear by CBD bath bombs, which I pick up from Poplar, to help with achy joints and sore muscles.Linen spray for better sleepThe one thing I do each night before hopping into bed is I spray our sheets with a homemade linen spray. I started making my own spray, a mixture of rose water and lemongrass essential oil, and it’s made a huge difference in how we sleep. I honestly can’t recommend it enough.Sipping a turmeric seltzer before bed.\nPhoto by Emma FishmanExplore Bon AppétitGoing to Bed withHealthyishprofileRead MoreLifestyleWhipped Cream and Cricket Sounds Help Chani Nicholas Fall AsleepBy Kristin BraswellRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-24", "author": ["Condé Nast", "Siraad Dirshe"]}