{"id": "f73677bda294cb8b1ba6e8140d67caff", "url": "https://www.bonappetit.com/story/weeknight-dinner-party-menu-formula", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "My Dinner Party Tips for Staying Sane When Hosting On a Weeknight  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Simple Strategy for Staying Sane When Hosting a Weeknight Dinner PartyAnd nope, it’s not “order pizza.”By Sarah JampelSeptember 6, 2018FacebookTwitterEmailNicole FranzenFacebookTwitterEmailSomehow—and I think it’s because I toss dinner invitations around like throw pillows—it’s not unusual that I have a couple friends coming for dinner and not a lot of time to plan.Now, my apartment is not designed for hosting dinner parties (the kitchen is small and poorly ventilated, the seating is limited, the cats are hairy, and the smell of whatever I’m cooking streams straight into the bedroom, making roasting broccoli a true commitment), and my lifestyle isn’t so conducive, either. I struggle to find time, as we all do, to cook for myself on a weeknight, let alone make something presentable enough to feed visitors.But this is a success, not a sob, story! Because I’ve finally nailed my personal method for getting it done calmly and cooly: I choose one recipe for the oven, one recipe for the stove, and one recipe that’s completely (or almost completely) no-cook.You know what’s good to serve at a dinner party?The Oven-Stove-Raw FormulaSince all three dishes can be working at once, I maximize my use of time and space, avoiding the tricky logistics that come with cooking two recipes at different oven temps or the dish-washing woes that come with multiple oily frying pans. If all goes well, I can manage to make a main, a side, and a dessert (!) in less than an hour, give or take. If my friends bring a snack (cheese, please) and drinks, we’re all set.As someone often paralyzed by too many choices (I’m the one standing in front of the peanut butter wall at the supermarket for a good ten minutes), this schema also helps me to put blinders on and think strategically, with less opportunity for distraction.Plum Salad with Black Pepper and ParmesanA savory fruit salad that holds its own at the dinner table.View RecipeSo what does that look like IRL? A few weeks ago, I made corn risotto (on the stove), chopped up a watermelon-tomato salad (totally raw and fine to hang out for a bit), and baked The World’s Most Famous Plum Cake (oh, you don’t know her?).I began with the task that was going to take the most time from start to finish. Since that was the cake, I made sure it was in the oven (and that the mixing bowls and spoons were clean and put away) before I started on anything else.While the cake baked, I focused on the stovetop risotto. Between frequent stirs, I prepped the salad, which only involved cutting tomatoes and watermelon, tearing herbs and cheese, and whisking together a simple dressing. When the friends arrived, they snacked on the cheese and crackers they brought while I finished the risotto and transferred the salad from mixing bowl to serving dish. During dinner, the timer for the cake went off and I rushed up from the table and whisked it out of the oven, very Nigella-like.Your friends are about to be i-m-p-r-e-s-s-e-d.\nAlex LauThis oven-stove-raw formula works well in the scheme of that example: a main on the stove, dessert in the oven, and a raw side salad, but it’s also easily adjusted. Say you want to use the oven to make Slow-Roasted Salmon with Harissa and the stove to make Swiss Chard Tahini Dip. Dessert could be whipped cream with fresh berries. Or, you could ditch the dip, switch to a shaved salad, and use your stove to make hot fudge (ask the guests to bring ice cream) or, come winter, rice pudding instead.Another, perhaps wiser, dinner party strategy is to simply plan ahead. But what fun’s a weeknight dinner party without at least a little frantic energy, huh?4 Oven + Stove + Raw CombosRaspberry Ricotta Cake + Shrimp and Basil Stir-Fry + Ultimate Caprese SaladRoast Chicken with Bell Peppers, Lemon, and Thyme + Berries with Tea-Infused Cream and Pistachios + Lazy Caesar SaladRoasted Cherry Tomato Caprese + Salt and Pepper Skirt Steak + Radicchio and Stone Fruit Salad12-Minute Saucy Chicken Breasts with Limes + Fluffy Rice Pilaf + Strawberry Eton MessAnother weeknight main dish idea:Explore Bon AppétitDinnerPartiesEntertaining + StyleRead MorecookingThis Salmon Niçoise Salad Is a Weeknight Dinner Party DunkBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-06", "author": ["Condé Nast", "Sarah Jampel"]}