{"id": "f74d2d3ed3a5c29bbe781bac42be3c86", "url": "https://www.bonappetit.com/recipe/grilled-salmon-with-lemon-sesame-sauce", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Grilled Salmon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGrilled Crispy-Skinned Salmon with Whole Lemon-Sesame SauceBy Andy BaraghaniJuly 20, 20184.4(34)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintAdding an entire lemon—skin, pith, and flesh—to the sauce provides it with brightness and texture. Any bitterness from the pith will be offset by the sesame oil and honey. That balance makes it a super versatile condiment that pairs well with grilled or roasted vegetables and is great as a topping for stews and braises come winter. And remember: You absolutely want to cook fish that still has its skin on. It protects the fish while it grills and, despite what you think or have been told, will help it release from the grill grates more easily.Ingredients4 servings46-oz. skin-on salmon fillets, pin bones removed, patted dry2Tbsp. plus ⅓ cup extra-virgin olive oil, plus more for grillKosher salt1small lemon1small shallot, finely chopped2tsp. black sesame seeds1tsp. honey½tsp. toasted sesame oilFreshly ground black pepper1cup torn basil leavesPreparationStep 1Prepare a grill for medium heat. Rub salmon with 2 Tbsp. olive oil; season both sides with salt.Step 2Cut ends off lemon and discard. Place lemon upright and slice off outer lobes in 4 sections, leaving a square-shaped core and seeds behind. Finely chop lobes (flesh, pith, and all) and transfer to a small bowl (you should have about ⅓ cup). Squeeze out juice from core over bowl. Add shallot, sesame seeds, honey, sesame oil, and remaining ⅓ cup olive oil; season with salt and lots of pepper. Toss to combine.Step 3Clean and oil grate, then immediately place salmon on grill skin side down. Cover grill and cook, skin side down the entire time, until skin is lightly charred and fish is opaque, 6–8 minutes. Transfer salmon to a plate and let cool slightly.Step 4Divide salmon among plates. Top with basil. Spoon lemon-sesame sauce over.How would you rate Grilled Crispy-Skinned Salmon with Whole Lemon-Sesame Sauce?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleAwesome recipe...I also make as a COLD appetizer dish...it has been a favorite at my cocktail 🍸 parties!Angela Pitera Louisville. Ky10/2/2021I didn’t feel like going outside and grilling so I cooked the salmon on a griddle pan in the kitchen instead. I was a little apprehensive at first about the basil being too much but this was actually a delightful surprise ! It was absolutely delicious, I added a little soy sauce to the lemon salsa and skipped the sesame seeds (didn’t have any). Served alongside an arugula/beet/cucumber/tomato/basil salad with a shallot pickled garlic white wine vinegar vinaigrette and soy sesame sautéed zucchini. Chef_sadgalLos Angeles 7/12/2020I meant to say raved.... 😁😂ElisaGraceWisconsin5/27/2020This fish was AMAZING!!! \nI didn’t have salmon, so I used cod instead. I was worried that the lemon would be tough and hard to chew, but not a bit. \nMy family raced over it countless times and I will definitely be making it again!!!ElisaGraceWisconsin 5/27/2020I just made this for dinner tonight! Very simple, quick and light. Perfect for a weeknight. I think next time I'll try adding some more spice to the lemon sauce. AnonymousDenver, CO5/14/2020It was delicious. I made 2 small changes: encrusted the top of the salmon with black sesame seeds and left out the shallots (i hate onions).  May try with garlic instead but I loved it as is.Anonymous4/30/2020This was so good. Didn't want to use the shared apartment complex grill, so I dusted off my electric grill and cranked it as high as it would go. It worked great--crispy skin, and buttery, delicate salmon. Was worried about the lemon pith being too bitter in the dressing but it was bright and perfect with the rich fatty fish. Mint was the only fresh herb I had but I thought it went really well. Felt like a real treat! I'm looking forward to getting fresh salmon from my local shop so I can make this again. Thank you!Jenben4/27/2020This was delicious and my new favourite way to cook salmon perfectly. We cooked it on a cast iron griddle pan and had to flip it for 30 seconds on the other side, but it was perfectly cooked and delicate inside. I love using the whole lemon and found the sauce perfectly balanced, and made the whole quantity of sauce for two servings which was fine given how delicious it was. One of my favourite Andy recipes of all swinksSydney4/25/2020One of the best and easiest salmon recipes ever!AnonymousLos Angeles1/21/2020This was definitely a creative recipe but I could not get past the lemon pith. It was chewy and bitter and was not offset by the honey.\n\nI hoped this would work out well but it did not. Anonymous7/1/2019This may work well with farmed salmon but the flavor overpowered Copper River salmon.AnonymousLos Angeles5/30/2019This was fabulous. The lemon salsa alone was amazing but paired with the slight char on the salmon skin it was next level. I'm sure we will have this many more times over the summer months, thanks!Houston5/29/2019This method of grilling salmon is fool proof, and the dish comes together very quickly if you make the salsa ahead. It was a big crowd pleaser!NY, NY5/27/2019My new go-to salmon recipe. Lemon Salsa 2020AnonymousBrooklyn, NY4/2/2019Excellent.  Easy and delicious.  A real winner.  The honey just balances the lemon without going to sweet.  Super good.  Will be looking for additional ways to use the lemon salsa.  It's fabulous.MarianneKH926731/28/2019Explore Bon AppétitSalmonFishSeafoodLemonCitrusFruitQuickEasyWeeknight MealsMainGluten-FreeDairy-FreeKetoHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-20", "author": ["Condé Nast", "Andy Baraghani"]}