{"id": "f74e3d0f88882aad55254775cae6bf2b", "url": "https://www.bonappetit.com/recipe/warm-buttered-tomatoes-with-ginger-and-scallions", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Buttered Tomatoes with Ginger Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2017 IssueButtered Tomatoes with GingerBy Amiel StanekAugust 1, 20184.3(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Judy ManciniEmailPinterestPrintEmailPinterestPrintThis versatile peak-of-summer condiment can be served on top of white rice, pasta, toast, steamed fish, steak, or roast chicken. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.Ingredients4 servings4tablespoons unsalted butter11-inch piece ginger, peeled, cut into thin matchsticks4scallions, white and pale green parts finely chopped, dark green parts thinly sliced1½pounds tomatoes, cut into 1-inch pieces (about 4 cups)2tablespoons plus 1½ teaspoons white or regular soy sauceKosher saltPreparationHeat butter in a large skillet over medium. As soon as butter stops foaming, add ginger and scallion whites and cook, stirring, until fragrant, about 1 minutes. Add tomatoes and cook, turning gently with a large spoon, until tomatoes are juicy and just warmed through, about 2 minutes. Add soy sauce and toss to combine. Taste and season with salt, if needed. Top with scallion greens.Alex LauHow would you rate Buttered Tomatoes with Ginger?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleThis was such a nice way to use up some heirloom tomatoes that were on the verge of past prime. I wouldn't have thought of incorporating ginger and soy, but it was a refreshing change of pace from garlic. Silky and deceptively simple, an A+ component to dress up any meal.JulesKauai, HI12/13/2021A staple recipe in our household now. My husband loves this dish and always skips a little when he smells this dish wafting from the kitchen. Sometimes I add bell peppers too if we have some extra. Vy DPortland, OR10/6/2021All the negative reviews make me question how they messed up something simple. If you don’t like ginger then it’s just not for you , it shines through well .\n\nGreat tasting simple snack, I just ate with sourdough toast.KyleLong Beach, CA10/6/2021Garbage total garbage\nSuch a waste of peak tomato!  What were you thinking!!!Steven WChicago8/11/2021SO EASY and quick! A great meal to throw together on weekdays or if your pantry is looking like it is a little barren. It's awesome over short-grain rice. I have also served it with some grilled chicken thighs and really recommend it.AnonymousLos Angeles10/12/2020I can’t stop making this. Great over rice. AnonymousIllinois9/3/2020I had been really looking forward to this, especially after reading the reviews but am super disappointed. I love tomatoes, love ginger, love butter, it smelled incredible...but just ho hum. Not terrible, but not really much of an improvement on good tomatoes with salt on good buttered toastAnonymousChicago9/3/2020This is incredible. We have a garden and LOTS of tomatoes this time of year, so always looking for quick and yummy ways to make them up. This recipe takes maybe 10 minutes including prep. So far served this over sourdough toast, on its own, on crackers, over rice.... favorite combo so far has been over crispy rice and topped with a fried egg 🤤🤤🤤ethompsMinneapolis, Mn8/11/2020Wow... I was a little skeptical of the soy sauce ginger combo with the tomatoes and butter but it was incredible!! We had to make it two nights in a row because it was so good! We poached cod in it and served it over rice which was amazing. If you don't like to use too much butter I think it would still be excellent without it or with just a bit of oil. In the future I'll add slices of eggplant and zucchini or some poached potatoes. Definitely a keeper!California8/10/2020I made a username just to review this recipe because I couldn’t believe there were only 3!\nThis is so good! So easy & flavorful! Such a good recipe to keep in your back pocket for a quick at home lunch over some crusty bread. AnonymousPhiladelphia4/22/2020Very delicious - the soy sauce adds such a great touch, that I never would have thought of! An unexpected twist, mysterious umami flavor that you can’t place unless you were the chef!\n\nI made a couple minor changes:\n-only used dark scallion greens (sautéed with the ginger since mine were very pungent)\n-minced the ginger to avoid overpowering very spicy bites\n-next time I will use less butter to make it healthierBoston8/19/2019Loved it! So flavorful! I had it on toast and it was amazing. My dad also made it and he had it over breaded steak. AnonymousArgentina5/8/2019Absolutely delicious! Perfect flavoursAnonymousBrazil9/8/2018Explore Bon AppétitCondimentToastAmericanTomatoVegetableGingerHerbs & SpicesSummerQuickEasyMainNut-FreeVegetarianHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-07-18", "author": ["Condé Nast", "Amiel Stanek"]}