{"id": "f769cf59f4d2be58a00fcad90ea2edae", "url": "https://www.bonappetit.com/recipe/smashed-cucumber-salad-with-hot-vinegar", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Smashed Cucumber Salad with Hot Vinegar Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueSmashed Cucumber Salad with Hot VinegarBy Chris MoroccoMarch 20, 20184.2(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintCucumbers are practically all water, so you gotta dress them like you mean it. This hot, sweet, and tart dressing will have them covered.Ingredients4 servings 5mini seedless or Persian cucumbers or 1 small English hothouse cucumber (about 12 oz.)Kosher salt4red or green Thai chiles, halved lengthwise keeping stem end intact, or 1 serrano chile, thinly sliced2garlic cloves, lightly smashed½cup unseasoned rice vinegar2Tbsp. fish sauce1Tbsp. sugarChopped unsalted or salted roasted peanuts (for serving)PreparationStep 1Gently smash cucumbers with a rolling pin or the back of a heavy knife just to break open. Tear into irregular 2\" pieces and place in a medium bowl; season lightly with salt. Let sit at least 5 minutes and up to 1 hour.Step 2Meanwhile, whisk chiles, garlic, vinegar, fish sauce, and sugar in a medium bowl until sugar dissolves. Let sit while cucumbers macerate.Step 3Drain cucumbers, discarding any liquid they have released. Add to bowl with dressing and toss several times to coat. Top with peanuts.Step 4Do Ahead: Dressing can be made 3 days ahead. Cover and chill.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Smashed Cucumber Salad with Hot Vinegar?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis was SO GOOD!! The cucumbers released a lot more water than I expected, so plan for that. I don’t have any other comments, love this recipe!ElleLA8/10/2021This was a revelation! I have a bad habit of letting my Persian cukes hang in the fridge a bit too long and get soft so last night I was determined to make a salad with ones I had on hand. I stumbled across this recipe and wow. Such little effort, such big rewards. The dressing is tangy, sweet, and highly addictive. We'd also made chicken for dinner which we were dipping in the juices it was so good. The only edit we made was to smash the Serrano in a mortar and pestle along with garlic. I find that makes dressings a bit spicier which I love.emilyrBoston, MA4/6/2020This was a nice salad! Made it as a side for carnitas tacos (that recipe is on Basically) and it was super refreshing. I'm finding it hard to believe you could smash the cucumbers with a rolling pin without horribly bruising them - I hacked at them with the back of a chef's knife and then ripped them up where the cuts were, which worked well. Also, I doubled the recipe and it made wayyyyy too much dressing - I feel like even a single batch of dressing would be too much for twice the cucumbers. Lastly, I wouldn't count on keeping any leftovers since it starts to taste like pickles, so eat it all up the night you make it!soapnanaChicago4/30/2018Explore Bon AppétitSaladChineseEast AsianAsianCucumberVegetableChileQuickEasySideDairy-FreeGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Chris Morocco"]}