{"id": "f77225ae1a4b9cc14257755c73587f85", "url": "https://www.bonappetit.com/recipe/tapsilog", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "Tapsilog Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTapsilogBy Arlyn OsborneJanuary 20, 20224.3(31)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintTapsilog, a popular Filipino meal, is a portmanteau of the dish’s three components: tapa (beef), sinangag (garlic fried rice), and itlog (fried egg). It’s one of many variations of silog (garlic fried rice plus fried egg), others of which include tosilog (made with pork), bangsilog (fish), and Spamsilog (Spam).Tapa has origins in the pre-refrigeration era, when it was cured and dried in a fashion similar to beef jerky as a means of preservation, but today the meat is most often marinated before being fried or grilled. There are countless ways to make the marinade and prepare the protein (read more about silog and its variations here!), but the method below is my personal favorite.While my recipe is fairly straightforward, there are a few ways to ensure a great result. First, make sure that the garlic in the tapa marinade is coarsely—not finely—chopped; otherwise, it will burn in the hot oil. Second, really drain the marinade from the beef (I like to press it firmly against a fine-mesh sieve to get rid of as much liquid as possible). Third, have a pair of long tongs handy when you start frying, as the oil will splatter when the meat cooks and you’ll want to stand back. Though silog is traditionally served for breakfast—occasionally alongside spicy vinegar, fresh tomato, cucumber, or atchara (a kind of pickled papaya)—it makes a savory, satisfying meal any time of day. —Arlyn OsborneAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronWhisk$10 At AmazonLarge Nonstick Skillet$50 At AmazonSilicone Spatula$13 At BA MarketMedium Bowl$17 At AmazonMesh Sieve$13 At AmazonIngredients4 servingstapa1lb. sirloin, thinly sliced against the grain into bite-size strips6garlic cloves, coarsely chopped⅓cup (packed) light brown sugar¼cup low-sodium soy sauce1Tbsp. distilled white vinegar1Tbsp. cornstarch½tsp. crushed red pepper flakes½tsp. freshly ground black pepper¼tsp. kosher salt¼cup vegetable oilassembly4cups chilled leftover cooked jasmine rice1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more¼cup (or more) vegetable oil12garlic cloves, finely chopped4large eggsPreparationtapaStep 1Pat beef dry with paper towels. Whisk garlic, brown sugar, soy sauce, vinegar, cornstarch, red pepper flakes, black pepper, and salt in a medium bowl. Add beef to marinade and toss well to coat. Cover and chill at least 6 hours and up to 1 day.Step 2Heat oil in a large nonstick skillet over high. Drain beef in a sieve, letting as much excess marinade drip off as possible. Add half of beef to skillet, arranging in a single layer and cook, turning halfway through, until beef is cooked through and deeply browned in spots, about 3 minutes (be careful; the marinade will splatter). Transfer beef to a plate. Discard any garlic remaining in pan and repeat process with remaining beef. Keep warm. Clean skillet and set aside.assemblyStep 3Place rice in a large bowl and break up with a rubber spatula. Stir in 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt; set aside.Step 4Heat oil in reserved skillet over medium-low. Cook garlic, stirring occasionally, until golden brown and crisp, about 5 minutes. Drain garlic in a fine-mesh sieve set over a small bowl; transfer to a small plate.Step 5Pour 2 Tbsp. garlic oil back into skillet and heat over medium-high. Add reserved rice mixture and stir to coat in oil. Cook, stirring occasionally, until heated through, about 5 minutes. Set 1 Tbsp. fried garlic aside for serving and stir remaining fried garlic into rice. Transfer to a bowl and keep warm.Step 6Heat remaining garlic oil in the same skillet over medium-high (you should have 2 Tbsp.; add vegetable oil to make up the difference if needed). Crack eggs into skillet and season with salt. Cook until whites are almost set, about 2 minutes. Carefully tilt skillet so oil pools on one side. Spoon oil over egg whites until fully set, about 1 minute.Step 7Divide rice mixture, meat, and eggs among plates and top with reserved fried garlic.How would you rate Tapsilog?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI had some sirloin to make beef stroganoff on this icy Texas day, but saw this recipe and quickly changed my mind. And we are SO glad I did! This is incredible. My son says it is his favorite new meal. These eggs are - just- my goodness, the bottom of them is amazing. The whole meal is amazing. Two people, no leftovers (except rice) I AM watching my figure lol. \nMAKE THIS NOW! AlohalifeAustin TX2/4/2022Pretty good. Followed the recipe but didn't fry the meat- instead used skewers on a foil-covered sheet under the broiler to avoid extra oil and spatter. Added slivered red onion to the marinade and skewers. Without the nostalgia-tradition of Filipino breakfast, instead making this for casual dinner in freezing-fog Oregon, I added Tajin (lime-chile salt) for acidity and wished I had some bitter greens to balance the sweetness. I might make again with less sugar.  The garlic rice I'll definitely make again, with gratitude.  Hey, BA, when are you going to show real measures for garlic, like \"2 tsp finely-chopped\" instead of '4 cloves' which could be anywhere from 1-5 tsp? Yes, cooking is an art. It's also a science.troutappleTucson1/29/2022SO. Damn. Delicious!!! Thank you!MaryDTKenmore WA1/29/2022An old time favorite…always delicious! Very easy to cook and may be eaten any time of the day! (BTW, 👍 Filipinx)Tess LainHawaii1/25/2022FILIPINO. Stop trying to make Filipinx happen. The language is gender-neutral. 🙄Filipino NOT Filipinx Manila1/22/2022This was oh so scrumptious. We can eat this every day.  Thanks BA!AnonymousGermany1/20/2022Explore Bon AppétitDinnerBreakfastEasyFilipinoSoutheast AsianAsianEggSteakBeefMeatRiceRice & GrainsGarlicVegetableMainGluten-FreeDairy-FreeNut-FreeFryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-20", "author": ["Condé Nast", "Arlyn Osborne"]}