{"id": "f77f73b5ed2d970f2ecd8c49270212f2", "url": "https://www.bonappetit.com/recipe/classic-tuna-salad", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Classic Tuna Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesClassic Tuna SaladBy Alison RomanDecember 18, 20203.4(206)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintEditor’s note: This recipe was originally published on June 30, 2015 and was updated by Samar Lazzari in December 2020.This classic tuna salad recipe doesn’t try to fix what isn’t broken. It has all the essentials for turning canned tuna (preferably oil-packed and salted) into something truly compelling. Just-enough mayo, capers, and lemon for brightness, celery and onion for crunch, and mustard and (optional) hot sauce for a little extra flavor intrigue. Feel free to sub Greek yogurt for mayo, or pickle relish instead of capers.Ingredients2 large or 4 small servings¼small red onion, finely chopped1celery stalk, finely chopped6Tbsp. mayonnaise2Tbsp. coarsely chopped parsley or cilantro2Tbsp. drained capers, finely chopped2tsp. fresh lemon juice1tsp. Dijon mustard1tsp. hot sauce (optional)Kosher salt, freshly ground pepper15-oz. can tuna, preferably oil-packed and salted, drainedBread or salad greens (for serving)PreparationStep 1Using a fork, mix onion, celery, mayonnaise, parsley, capers, lemon juice, mustard, and hot sauce (if using) in a medium bowl. Season with salt and pepper.Step 2Mix in tuna, breaking up any large pieces, until well combined. Taste and season with more salt and pepper if needed. Serve on toast or salad.Do ahead: Tuna salad can be made 3 days ahead. Cover and chill.How would you rate Classic Tuna Salad?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleTo Annonymous, your fat gram count is seriously off, not to mention your outrage. The average mayo has 10 grams of fat per tablespoon, which is 30 grams per full serving. The tuna clearly says it's drained, so that averages 3-5 grams per can, which is 1.5 to 2.5 grams per serving. My store-bought bread says it has 2 grams per 2 slices, so 1 sandwich, although the recipe clearly states it can be replaced with lettuce. Whether using the FDA and AHA recommendations for fat intake, 1/2 of this recipe clearly falls well below the fat intake recommendations. Further, remaining meals for the day can be fat-limited. This recipe as written is very good. I personally prefer far less mayo, so that is how I made it, but I otherwise used this recipe. It's a keeper.Debs414Tucson, AZ11/28/2021Really tasty! I admit I switched the mayo for yogurt but you can't taste the difference. The capers really shine with the extra splash of lime. Will make again!FoodNoob11/7/2021Dear God almighty, SIX tablespoons is \"just enough\" mayo for one can of tuna, and you recommend oil-packed tuna on top of that? By the time you include the bread and other ingredients, you're adding more than seventy-five grams of fat beyond what was in the tuna itself.\n\nBy way of comparison, you have added more than two-and-a-half Big Macs-worth of fat to a recipe you claim is just two servings. 🤮AnonymousSomewhereville, USA10/7/2021WHAT is going on with the reviews these days?  If what you have to say it isn't a review of the recipe as made, DON'T POST IT!!!!   What has changed?TIrvToronto, ON5/12/2021This might work for older kids, but I know there’s almost nothing more embarrassing than being the kid with the “stinky” lunch. My 6 yo loves Tuna Salad at home, but many his age find the smell to be gross, I wouldn’t pack this based on the reactions it could get from other kids.AnonymousEastern, KY3/19/2021A nice but often skipped ingredient is a tsp. of horseradish. Used sparingly it adds a new level to the blend. \n\nStephen King — 'The gunslinger had no idea what tooter-fish was, but he knew a popkin when he saw it.'Tooter FishThe Dark Tower2/24/2021Delicius and no need to change anything I use Rio Mare oil packed tuna GillianToronto Canada1/7/2021I like a chopped sweet gherkin and a chopped hard boiled egg in mine, as well.  No need for the capers.DavidPhiladelphia, PA12/22/2020bit too much mayo for my taste.  Key is using tuna in oil.  a touch of sugar helps.  Don DraperNew York, NY12/21/2020PAY YOUR BIPOC EMPLOYEES FAIRLY! \nGET THE RACISTS OUT OF CONDE NAST Anonymous6/10/2020Excellent Tuna Salad. Felt like the ratio between the actual tuna and the other ingredients were off balance. Just ended up using four 5oz. cans of tuna instead of just one, and it was perfect! This is my go-to tuna salad recipe now. Thank you.ChriistieTexas6/3/2020Perfect!AnonymousToronto, Ontario 5/28/2020Delicious. I doubled up on the recipe and add harrisa for a bit of kick, it has an excellent ratio of creamy/crunchy textures and lots of acid to keep it bright.AnonymousVirginia Beach, VA11/20/2019Explore Bon AppétitSaladAmericanTunaFishSeafoodEasyMainDairy-FreeLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2015-06-30", "author": ["Condé Nast", "Alison Roman"]}