{"id": "f78b99720c4d22a76854821b9b8cb56a", "url": "https://www.bonappetit.com/story/minas", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Mina Stone Explains How her New All-Day Cafe Came to Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleEverything We Love About Mina Stone's New Greek-ish CafeInside MoMA PS1, Mina's is the latest museum restaurant that's a destination all its own.By Aliza AbarbanelDecember 13, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailEven on the gloomiest winter afternoon, Mina’s oversized windows beam light over tables dotted with gold-rimmed plates of crusty bread and cloud-like whipped feta. The rest of MoMA PS1 may be all brick and concrete—after all, the contemporary art museum in Queens, NY was once an elementary school —but Mina’s, a Greek-inspired restaurant that opened in November, is  a mint-and-magenta oasis within its walls.Like Flora Bar (below the Met Breur on the Upper East Side) and Otium (next to The Broad in downtown L.A.), Mina’s is the latest museum restaurant to assert itself as a dining destination in its own right—no museum admission required. There are no pre-wrapped egg salad sandwiches here. Instead, there’s a Mediterranean-accented menu from Mina Stone, who has transitioned to feeding art lovers after years of working as a personal in-studio chef for the artist Urs Fischer and art dealer Gavin Brown. (Stone’s 2015 cookbook, Cooking for Artists, has found a rabid fan base among art and food lovers alike.)“I'm out of my safe world of people who have eaten my food before,” Stone says with a laugh. “That’s what’s so exciting about the museum: I’m opened up to the world—the young, old, tourists, New Yorkers, whoever it might be.”Stone is drawn to pops of joy, like this colorful plumage.\nPhoto by Emma FishmanA proudly self-described “home cook,” Stone says she never planned on opening a restaurant of her own. But when she was approached by Peter Eleey, MoMA PS1’s chief curator, to take over the cafe previously occupied by M. Wells Dinette, the idea stuck. Stone’s husband, artist Alex Eagleton, worked with designer Isobel Herbold to channel their shared Greek heritage without relying on taverna kitsch, instead creating a “visually calm respite” from the heavy themes explored in the surrounding classroom-sized galleries.The result is a museum cafe born of the all-day café era, serving up obligatory (and welcome) glasses of natural wine alongside Stone’s signature comfort food: lentil soup jolted with lemon juice, gooey slabs of tahini babka, white anchovies swimming in very good olive oil, and high-octane ouzo, all delivered by waiters with art school haircuts in gothic gingham track pants (a gift from Stone’s fashion school friend, womenswear designer Adam Selman.) Here, Stone and Eagleton share the origins of the Greek-ish elements that give Mina’s its distinct sense of place.Photo by Emma FishmanIt’s all about the snacksStone: Our small plates are based on mezzetaki, which is something you do in the late afternoon in Greece—you have some ouzo and sit on the beach, and the kitchen brings you out these little snacks with toothpicks. We have pickled cucumbers and carrots, whipped feta, muhammara, white anchovies, Greek sausage, and olives with cracked coriander. The Greek sausage we get from a butcher in Astoria who makes them all on-site. Alex and I go to Astoria all the time because there’s a supermarket called Titan that has all the delicious Greek feta—it’s the Greek megastore of New York. This butcher shop has lambs hanging in the window; it’s one of the butcher shops Americans would be pretty freaked out by.Photo by Emma FishmanTahini babka that’s also French toastStone: The tahini walnut babka is something I developed with Natasha Price, the chef de cuisine. She’s a really talented cook and baker and she worked so hard to make that recipe work. Putting the tahini walnut mixture in a babka dough is like my two cultures coming together, because my dad is a Jew from Cleveland and my mom is Greek. On the weekends, we’re toasting it up into French toast putting Greek yogurt and fruit compote on it.Photo by Emma FishmanOlive oil as restaurant merchEagleton: I grew up spending my summers on Paros. The way the Greek olive oil thing tends to happen is that every family has x amount of olives, and they get them pressed at the town mill. It’s not usually for sale, but with the crisis, people started selling some of their oil. I have an old friend on Paros who puts his oil together with a couple other guys, so I was like, ‘Can you get me a thousand kilos?”Once the oil leaves the mill, it has to get tested and approved by an FDA-approved lab before you can bring it into the country, so I basically had to hustle the guy to get all those approvals included in the price I was negotiating, and he handled the shipping for me as well. A van came and dropped it off at the museum, and now we’re storing it in the basement and selling some limited-run bottles to customers. Urs Fischer designed the label. We’re not going to become oil rich off it, but it’s another type of merch that makes sense for us. A nice Christmas gift, if you will.Photo by Emma FishmanKick back in the magenta mood lightingStone: If you go to Greece, these chairs are everywhere—Alex has some at his project space there. They’re meant for sitting in for hours because there’s a big outdoor cinema culture in Greece, especially in the summertime. It ended up being cheaper for us to get custom chairs made in Greece and shipped over here than to get the basic chairs on Webstaurant. I feel like the mint green has both a Greek summer vibe and a Miami vibe, which I like.Eagleton: If you go to Astoria, you see that lighting game. If you go to a Greek American establishment, they’re going to put some columns it in and change the lights around the columns.Stone: It’s a little bit of a club vibe.Eagleton: And you gotta sneak Mykonos into the mix with the clubby lighting. We play around with the color but the magenta looks best with the rest of the room and it brings back our original mood board, which was a hybrid of Miami and Athens thirty years ago. It’s a nod to hot-weather countries, and it definitely helps lighten the mood. It’s calming while energizing, and we honestly just felt it would be fun.Explore Bon AppétitGreekNew YorkHealthyishRead MoreLifestyleArtist Nadia Gohar Calms Her “Studio Brain” with Fennel Tea and Soft PJsBy Kyle BeecheyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-13", "author": ["Condé Nast", "Aliza Abarbanel"]}