{"id": "f791a0a9776b1a3f66e05824ba3330ca", "url": "https://www.bonappetit.com/recipe/soy-marinated-eggs", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Soy-Marinated Eggs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueSoy-Marinated EggsBy Sohui KimFebruary 13, 20194.7(43)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelEmailPinterestPrintEmailPinterestPrintWhat’s better than a jammy egg? One that’s been sitting in a tangy-salty marinade of chiles, soy, mirin, and vinegar, like this classic star of Korean banchan. The longer you let them sit, the more flavor they’ll pick up, but if you only have an hour, serve egg quarters with some of the pickling liquid drizzled over for extra flavor.Ingredients6 servings6large eggs5garlic cloves, peeled3dried chiles de árbol or 1 tsp. crushed red pepper flakes¾cup soy sauce3Tbsp. mirin (sweet Japanese rice wine)2Tbsp. unseasoned rice vinegarToasted sesame seeds (for serving; optional)PreparationStep 1Gently lower eggs into a large saucepan of boiling water. When water returns to a gentle boil, cook 7 minutes. Using a slotted spoon, transfer to a bowl of ice water and let cool 2 minutes (eggs may still be a little warm). Remove eggs from ice water and peel.Step 2Meanwhile, bring garlic, chiles, soy sauce, mirin, vinegar, and 2 cups water to a boil in a medium saucepan. Reduce heat; simmer 5 minutes. Remove from heat and add eggs. Let sit at least 1 hour.Step 3To serve, drain eggs, quarter, and sprinkle with sesame seeds if desired.Step 4Do Ahead: Eggs can be marinated 2 days ahead. Cover and chill.How would you rate Soy-Marinated Eggs?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangleThis was like finding an old friend, first their phone number, and reuniting.  I have hens, which means an abundance of eggs!  Ramen Bowls on steroids with these eggs,:)David StarnesHenryville, IN1/2/2022This is one of my favorite recipes to make.  I have made them substituting the rice vinegar for black vinegar and that is also delicious.  I have also don't always put the chili in them and still love them.  I love to smash them into rice and spoon a little marinade over it.  I do always end up throwing out some marinade to make it fit in my tupperware which sucks but I digress.Tatumseattle, wa12/20/2020This is one of my go-to recipes and it always turns out sooo good. I normally marinate overnight to get a deeper flavor. There's a lot of marinade, so I  typically put a block of tofu into the marinade as well and then bake it the next day. These eggs taste excellent with sweet potatoes!Alyssa MBrooklyn, NY11/30/2020Good apart from the amount of marinade was enough for 12 eggs and still quite a bit of it left over even. Perhaps because I did it in a jar so it was more compact? And I simmered it a bit over 5 minutes so it wasn't that enough water hadn't evaporated. So if you do this either halve the recipe for the marinade or do more eggs.Anonymous11/11/2020I LOVE LOVE LOVE this recipe! I too had them with the congee (I did the pork/shiitake version which was recently featured, I liked this better than the one I usually make, w/chicken). This egg recipe is super easy, and they are great w/just about anything (tuna, crudites, steamed veggies, whatever), or as a stand alone snack. I'm to provide an appetizer for our (small, family bubble) Thanksgiving. I think I will bring these w/some pickles, celery sticks and radishes. Nancy MillerMendocino County, CA11/8/2020These are especially good served with jook/congee (savory rice porridge).Anonymous11/2/2020Absolutely stunning. I had a soy sauce egg at Osaka and absolutely loved it, so I decided to try this recipe. It’s so good, especially when left overnight to marinate in the fridge.AnonymousReading, England9/24/2020I make these all the time, as do many of my friends! So easy and sooo delicious.... they make a great snack and are also awesome on top of all kinds of food. I've never sprinkled them with sesame seeds, but I'll try that tonight.AnonymousNew York6/3/2020This is a traditional recipe, it is pretty much exactly how my amah makes marinated soy sauce eggs (we just skip the sesame and use sugar instead of mirin). They're best if you marinate them overnight and use dark Chinese soy sauce! AnonymousToronto 4/5/2020I love this recipe and use it all the time.Brooklyn, New York11/17/2019I thought these were gross. I followed the recipe to a T, but couldn't stand the flavor profile. I threw them all out. AnonymousLos Angeles11/14/2019These were awesome! Gonna make them again right now! They’re great after a few days, and I spoon a bit of the marinade over them every time I eat them. I make them and put them in a mason jar in the fridge and they get better every day. JordanbritneyTexas11/12/2019Let the eggs marinate for at least three days in the fridge. Tried them after an hour, not much flavor. After one day, they just tasted like soy sauce. After the third day, all the flavors penetrated throughout.AnonymousNew York10/23/2019So easy and delicious! I used Chinese dark vinegar for a deeper flavor. A great snack to have on hand. AnonymousNorthern California4/23/2019I have made this recipe countless times, and I don’t change a thing. I keep the marinade, in a tall container, in my fridge for a week. I add cooked eggs as the week goes on, and after a week I swap the marinade out for a fresh batch. These eggs are that good. ehrinkNew Hampshire 4/22/2019Explore Bon AppétitKoreanEast AsianAsianEggSnackStarterDairy-FreeVegetarianKetoHealthyishPickle and PreserveLunar New YearRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Sohui Kim"]}