{"id": "f79dcb865cd44e6d1094f3f35c789df3", "url": "https://www.bonappetit.com/recipe/crushed-pineapple-and-mint-margarita", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "Crushed Pineapple and Mint Margarita Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredCrushed Pineapple and Mint MargaritaBA's Andy Baraghani mixes a crushed pinepple and mint margarita with Cointreau, blanco tequila, fresh lime juice, fresh pineapple juice, and mint.By CointreauJune 23, 20213.2(5)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintIngredients1 oz. Cointreau2 oz. Blanco Tequila¾ oz. Fresh Lime Juice½ oz. Fresh Pineapple Juice1 Tablespoon Kosher SaltLime Wedge, for Garnise1, 1-inch Piece of Fresh PineappleMintIcePreparationStep 1Rub the rim of the glass with a lime wedge and reserve for serving. Dip the rim of the glass into the salt and fill with ice. Set aside. Step 2Muddle the pineapple and mint in the bottom of the cocktail shaker. Add the Cointreau, lime juice, and tequila. Step 3Fill shaker with ice, cover and shake vigorously until outside of shaker is very cold, about 30 seconds. Step 4Strain the margarita through a fine-mesh strainer into prepared glass. Garnish with lime wedge. How would you rate Crushed Pineapple and Mint Margarita?Leave a ReviewTell us what you thinkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-23", "author": ["Condé Nast"]}