{"id": "f79d1c69f8d50079957f209e13176e9c", "url": "https://www.bonappetit.com/story/literally-everything-is-better-with-butter", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Literally Everything Is Better With Butter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLiterally Everything Is Better With ButterButter not only adds incredible flavor to everything it touches, it has special properties that are key to the integrity of many classic sweet and savory dishes.By American Butter InstituteOctober 4, 2019FacebookTwitterEmailFacebookTwitterEmailFrom the time the milk leaves the farm, there’s nothing added (other than maybe a little salt). It’s no secret that butter is delicious; calling a dish “buttery” is the highest compliment. But butter is more than just a tasty fridge staple. This hardworking ingredient is responsible for the texture and quality of many of your favorite dishes. Here, we explain the science of why butter is often not only better than other oils or fats—it’s actually irreplaceable.Butter’s the reason...pie crusts are flaky.How it works: Butter has water content that’s missing from other baking ingredients like coconut oil. So, as pie dough is baked and the butter melts, the water in the butter creates steam, trapping it in the dough and creating air pockets. Once the dough has cooled, these air pockets become delicate layers of flaky dough.Why it matters: A perfect pie crust cradles any type of filling—from cream to fruit, chocolate to nuts. When done right, pie is the ideal, portable dessert to bring to any party, all year round. (Like this perfect-for-the-holiday rhubarb pie.)Butter’s the reason...layer cakes can stand up.How it works: Most American butter is comprised of 80% fat; the other 20% is made up of about 5% milk solids and 15% water. The water strengthens the gluten in the flour, resulting in a crumb with more substance than a cake made with oil, allowing it to support another layer (or many more).Why it matters: Without butter-enhanced cake, there would be no wedding cake! (Not to mention buttercream frosting, another layer cake must-have!)Butter’s the reason...cookies are tender.How it works: The fat in butter inhibits the formation of tough gluten, leading to more tender results. The higher the proportion of butter to other ingredients, the more tender the cookie, and the more it’ll spread as it bakes.Why it matters: Cookies are all about texture, so once you nail the right one, you’ll be ready to whip up batches of buttery-tender cookies with confidence all throughout the holiday season—and beyond.Butter’s the reason...biscuits are golden and crisp on the outside and fluffy on the inside.How it works: The milk solids in butter contain sugars that caramelize in a hot oven, leading to that deep golden biscuit top and bottom. Also, the cold butter forms large flakes in dough, creating clusters of steam that lead to the pull-apart quality of biscuits.Why it matters: If you’re from the South, you would never think to ask why biscuits matter. If you’re not from the South, trust that perfecting the biscuit is a worthwhile life goal, and will enhance every breakfast here on out. Change up your Sunday menu and introduce your brunch gang to these BLT Biscuit Sliders.Butter’s the reason...sauces are smooth.How it works: When you whisk flour into melted butter for a roux (the basis of many sauces), the butterfat coats the particles of flour, separating them and making them less likely to form lumps once milk, wine or another liquid is added.Why it matters: Sauces are meant to enhance every dish, and lumps ruin that magic trick—whether you’re attempting béchamel, gravy, beurre blanc, or any other sauce.So, don't forget to stock your fridge with your favorite brand of butter and get re-inspired with your favorite breakfast, lunch, and even dinner recipes.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-03", "author": ["Condé Nast", "American Butter Institute"]}