{"id": "f7ad70fd9ce70770e8b17a6de0947e9b", "url": "https://www.bonappetit.com/story/chicken-curry-recipe-as-easy-as-it-gets", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "This Chicken Curry Recipe Is Delicious, Warming, and About as Easy as It Gets | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Chicken Curry Recipe Is Delicious, Warming, and About as Easy as It GetsAll you need is some rice to soak up all that spiced, coconut-y goodness. This chicken curry recipe is a winner.By Molly BazOctober 2, 2018FacebookTwitterEmailPhoto by Caleb AdamsFacebookTwitterEmailI feel you: There's something about the word \"curry\" in a recipe title that might make you swipe left. You might think that it's going to take a lot of time, or require a bunch of of ingredients that you don't know how to find. And while this is sometimes true—curry can mean so many different delicious things—I'm here to tell you that it is not the case with this easy chicken curry recipe, and it is deserving of a hard swipe right. Our Coconut-Curry Braised Chicken Thighs are about as simple as simple gets, and the recipe calls for a grand total of 10 ingredients, all of which you can find at almost any grocery store. If you're looking for a little braise-y comfort as the weather starts to get colder, this one's never going to let you down.Let’s start from the top. You begin by crisping up some chicken thighs. I’d like shout out the foolproof, near-genius technique that this recipe employs to ensure the crispiest, crunchiest GD chicken skin you’ve ever seen. It’s loosely referred to as the “cold pan method” in our test kitchen, and was introduced to me by the one and only Christopher Morocco a few years back. To say my life has been forever altered would truly be an understatement. In a nutshell, 6 bone-in, skin-on chicken thighs get placed skin side down in a COLD, not preheated, dry dutch oven over medium heat. They cook there, undisturbed for about 15 minutes. By bringing them up to a sizzle gradually, you ensure that the chicken skin crisps evenly instead of curling up the way it would if you placed them in a hot, preheated pan. Sure, the method takes a few minutes longer than a quick sear, but the payoff is huge—you don't even have to add any extra oil, and you’re not at risk of being attacked by spitting chicken fat. Win, win, win.Next comes the aromatics that create the base of the sauce. You’ll add fat wedges of onion and cook them until softened, and then throw in some garlic and ginger and let them sizzle until they get all fragrant and your mouth starts to water, at which point you add two tablespoons of curry powder to the mix. (Any medium curry powder or curry spice blend will work here). This part is key: Since a lot of the spices in curry powder are fat soluble, not water soluble, they want to be \"bloomed\" in hot fat before any liquid gets added to the mix to really activate their flavorful potential. Half a can of coconut milk goes in, which helps to release some of the nutty brown yummy-town business stuck to the bottom of the pot. (If you've ever wondered what people mean when they say \"deglazing,\" well, that's what it is.)Rice for soaking up all of that delicious curry goodness? Non-negotiable.\nThe chicken goes back into the pot, a lid gets thrown on, and the whole thing goes into a 300°F oven to braise. After about 30 minutes that chicken will be fully cooked. You could stop right here and just enjoy the thighs as they are in all their coconut-y glory, but the real magic happens over the next 30 minutes of cooking. At this point you’ll peel and chop some sweet potatoes and add them in to the pot along with the rest of that can of coconut milk and throw it all back in the oven to finish braising. As the chicken continues to cook ever so gently, the muscles relax, and things start to get super duper fall off the bone tender. By the time the sweet potatoes are done, you’ve got super tender chicken thighs and a deeply flavorful curry sauce to spoon overtop.A quick condiment of chopped red onion, lime, cilantro and toasted coconut gets sprinkled over the whole thing and bring a welcomed brightness to this warm, hearty stew. I’d highly recommend you serve it up with some rice for soaking up all that flavor you’ve just built. It’d be a real shame to leave any of that glory behind. So, hop to it! This chicken curry recipe is the truth, and you’ll be on your way to braise-y, warming deliciousness in no time at all.Get the recipe:Coconut-Curry Braised Chicken ThighsThis simple, big-flavor chicken thigh dish is a great intro to the fundamentals of braising—once you've got the method down, you can braise just about anything.View RecipeExplore Bon AppétitChickenSweet PotatoCoconut MilkCoconutBraiseBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-02", "author": ["Condé Nast", "Molly Baz"]}