{"id": "f7adc060c937e2ce09cc1f5f658aed00", "url": "https://www.bonappetit.com/story/chai-formula", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "The Chai Formula That's Impossible to Mess Up | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Chai Formula That's Impossible to Mess Up\"For my mom, the significance of chai is not the execution of a precise recipe but the function it serves in her life.\"By Priya KrishnaFebruary 5, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailChai means a lot of things to a lot of people. In Ethiopia, it’s a milk-less spice infused tea; in Kashmir, it’s salty and steeped in a samovar; in Starbucks, it’s a syrupy, saccharine, pre-mixed blend (people, why are you still drinking this stuff?)! But in the Krishna house, chai is typically a milky, English breakfast tea made earthy and aromatic with any combination of fresh ginger, cardamom pods, peppercorns, and cinnamon sticks.For my mom, a pro-level, self-taught home cook, the significance of chai is not the execution of a precise recipe but the function it serves in her life. Her basic recipe comes from how her family drank chai when she was growing up in northern India, but she’s been making it since she immigrated to America in 1980. Chai has always been my mom’s moment to breathe—when she returns from her walk, when we’ve just done a big shopping trip, when she gets back from a vacation, and lately, when she’s helping her daughter (me) test recipes for a cookbook but needs a second to recalibrate after coming home from work.“But first,” she always tells my nagging, impatient self, her voice perfectly calm, “I’ve got to have my chai.”On most days, her chai routine is the same—a pared down, every day method that doesn’t require any saucepans or fancy strainers. She boils water, and adds it to a flowery porcelain mug (the only one she’ll use for chai, as it’s exactly the right serving size) containing a bag of Tetley, a British brand of black tea with a cultish following in India—my mom likes its extra strong flavor. Then she crushes a few whole cardamom pods in a mortar and pestle, and throws them into the tea, along with a spoonful of sugar and a few dabs of milk.The exceptions to her usual chai habits are on exceptionally cold or sick days, when she makes her extra-fortified chai. For this version, she crushes fresh ginger and some black peppercorns, maybe throwing in some cinnamon sticks for good measure; then she strains out the spices, and adds her usual milk and sugar. Each version she makes differs based on what’s in the house. This is the chai you make when your throat needs some extra TLC, or when you need something to make your whole body feel cozy when the temperature drops under 40 degrees (note: my mom lives in Texas).Yet another variation involves adding a few squirts of honey and two to three thin slices of lime into black tea as it steeps—the tea is served hot, but has slightly more refreshing notes, making it a pleasant summer drink.  Maybe some people don’t count that under their definition of chai; but chai, in Hindi, just translates to “tea.” It doesn’t necessitate any specific combination of ingredients. For my mom, if it’s warm and it invigorates your soul, it counts.Click to enlarge.\nDesign by Alaina SullivanPriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.BA's Best Chai Recipe Is What You Make It:Explore Bon AppétitChaiIndianTeaIndianishRead MorecultureInside Patel Brothers, the Most Beloved Indian Grocery Store in AmericaBy Priya KrishnaPhotography by Dan GoldbergtechniquesLet’s Chaat: A Guide to Indian SnacksBy Priya KrishnacultureThe Indian Snacks That I'll Have Over Doritos Any DayBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-05", "author": ["Condé Nast", "Priya Krishna"]}