{"id": "f7b12e221dcd174aaaa799314d999563", "url": "https://www.bonappetit.com/story/do-you-need-cherry-pitter", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "Can You Pit Cherries Without a Cherry Pitter? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCan You Pit Cherries Without a Cherry Pitter?We tried three methods for pitting cherries. Not all are created equal.By Alex BeggsAugust 19, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Nothing will stop me from baking with cherries. Nothing! But that tiny pit inside, turns out, stops plenty of people, including the editor of this story who revealed to me that he’d never pitted a cherry, ever. Too much hassle, he said.And you know what? Whether you’re pitting with a paperclip, a chopstick, a patented cherry pitter, or your own bare hands, it IS a hassle. It’s as annoying a task as: peeling apples, chopping onions, trimming green beans. And yet we do all of those with a lot less whining. Cherry pitting is a pain—until you look at it as meditative. A part of the process. Let the world slow down a bit. Pit!You have a few pitting options, but if you’re baking a recipe that calls for more than six cherries, just BUY A PITTER. They’re like little guns and you pew-pew-pew the pits into a bowl and toss your still intact, hollowed-out cherries in another. They cause cherry juice splatter, but it washes off easily. (Wear a dang apron already.) My favorite single-pit pitter is OXO’s. It’s like $10 and I use it for olives, too. It’s not perfect—sometimes the pit is off-center and you need to take a few stabs at it. But it’s fast and efficient and stores away all winter, awaiting its moment.OXO Cherry Pitter$13 at AmazonIt takes some people a lot of convincing to commit that $10, though. So today I pitted a bag of sweet cherries three different ways to compare the differences. Pitting by hand was the absolute worst. I tried a hack I had heard about in which you position a cherry at one end of a reusable plastic straw and use a chopstick to push the pit through it, and that method took a full minute longer than when I used the pitter. The cherries pitted with the straw/stick always meant I was constantly stabbing myself in the hand, and I ended up tearing or ripping or otherwise mangling all those cherries. PITTER ALL THE WAY.Do you love cherries as much as me and bake with them as long as the sun’s stretched into the late evening hours? OXO released a MEGA pitter this year. It does six cherries at once. By the time you carefully place every cherry in it before clamping it shut, it took about the same amount of time to pit as the single pitter. Again, I literally timed it. (36.5 seconds for 6 cherries.) However, this design creates NO SPLATTER WHATSOEVER. And it captures the pits in a little trap. Those details are nice, but I found it was more likely to miss a few pits, so I had to check every cherry or count the pits in the trap to make sure I got ‘em all.Photo by Emma FishmanOXO Multi-Cherry Pitter$20 at Bed Bath and BeyondFor that reason, the single pitter is still my favorite. You get your cherry assembly line going, you can see every pit as it shoots out, and it stores easily in the drawer of kitchen tools not used very often, next to the crab crackers.Not baking with cherries and wondering if you need a pitter? Nah, you don’t. Spit the pits into the yard and get on with your summer.Once you've pitted a bunch, make this:Sour Cherry PieAdding almond flour to the pastry dough makes for a super-tender, toasty-looking crust. View RecipeExplore Bon AppétitcookingShoppingtechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-19", "author": ["Condé Nast", "Alex Beggs"]}