{"id": "f7bc2793862d41981434d33b737aaa9a", "url": "https://www.bonappetit.com/story/make-lunch-every-day-without-losing-sanity", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "How I Make My Lunch Every Day Without Losing My Sanity | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow I Make My Lunch Every Day Without Losing My SanityLunching al desko can be a way more enjoyable and, yes, exciting part of your week.By Christina ChaeyOctober 7, 2019FacebookTwitterEmailIllustration by Łukasz GolędzinowskiFacebookTwitterEmailLong before I started working at Bon Appétit, I got into the routine of packing my lunch every day. At first it was for financial reasons—I was 22 and making an hourly salary equivalent to the cost of a Chipotle burrito (no guac)—but then the habit stuck. Over the years, I’ve learned to find joy in the simple act of it, which helps keep me from ever feeling like I’m “meal prepping,” a term I find totally depressing. Plus, the longer I do it, the more efficient in the kitchen I become and the more motivated I feel to keep going.I’ve also found creative freedom in ditching the notion that lunch has to look like something you’d find on the menu at an all-day café. A pile of lentils over quickly torn greens with crumbled feta and lemony dressing or a mishmash of leftover roasted veg with a scoop of hummus and some cooked grains might not be lookers, but they’re the kind of nourishing fuel I need to power through most afternoons. And, they beat the $13+ I’d have to shell out for a mediocre salad bowl any day.Here are a few strategies I’ve incorporated into my life to make bringing my lunch to work a little more enjoyable, varied, healthy, and, above all, not a big deal.This all-day-every-day yogurt sauce makes literally everything better.\nPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiCook Something Every DayOkay, half of you have stopped reading. But hear me out: Even if you spend only a few minutes passing through your kitchen every day, I guarantee you can sneak in a tiny bit of cooking that will pay dividends you can eat in the form of more-exciting future lunches. I’ve recently gotten into the (admittedly kind of extra) habit of cooking in the mornings before work. (I consider this one microscopic step forward in my lifelong mission to emulate The Cut editor-in-chief Stella Bugbee, who is also an aficionado of a.m. cookery.) I’ll put on the kettle for coffee, then tackle a small cooking task in the six or so minutes it takes the water to come to a boil. I’ll quickly sauté a handful of kale with sliced garlic and sesame oil to add to that day’s lunch. Or I’ll sear a couple of chicken sausages that I know I’ll throw into a pasta or tacos in the next few days. Maybe grate a garlic clove into yogurt for an all-purpose sauce for the week. These mini-prep moments don’t necessarily have to happen in the morning, of course. The key is to stealthily fold these tasks into the parts of your existing routine that bring you into the kitchen in the first place (in my case, making my morning coffee) so it doesn’t seem like you’re going out of your way.Get the Recipe:Quick-Cooked KaleAll Day Every Day SauceWho’s not getting excited about these for lunch?\nMake One Thing You’re Truly Stoked to EatIf I’m not deeply excited about what I’ve packed for lunch, I will actively look for any excuse not to eat it (and buy something else instead). No matter how noble my broccoli-and-lentil-filled intentions, I’ve learned that I need to include a “treat” in the mix to psych myself up for lunch as a whole. For me, this treat usually falls under my all-time favorite food group: simple ass carbs. Tucking some roasted potatoes, a couple of fritters, or some noodles into my lunch is usually sufficient to quell my starchy desires, which means I will happily eat piles of vegetables/whole grains/seeds/good stuff alongside. Again, it’s all about the mental trickery.Get the Recipes:Corn-Jalapeño FrittersPerfectly Roasted PotatoesUdon with Chicken and Garlicky Peanut DressingShop SmarterYou’ve heard this before, likely from my colleague, food director Carla Lalli Music, who basically wrote an entire cookbook about embracing frequent, small grocery trips. It’s a smart strategy not just for making lunch, but for any and all cooking endeavors: Buy only what you need and you’re almost guaranteed to waste less food. I am extremely fortunate to live in a major metropolitan area where the Trader Joe’s is a skip away from the nose-to-tail butcher shop, so I can generally build in a highly directed, 10-minute trip to the store (no dawdling in the cheese aisle!) on my way home from work most nights. But you can still use the “shop smarter” mentality even if you’re mostly a once-a-week shopper. Prioritize buying ingredients that are easily adaptable (lemons, garlic, good-quality tinned fish) and consider whether you need to buy the whole bag of lemons, or whether you can get by perfectly fine with just a couple.Never mad seeing a container of these in the fridge.\nPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiBig-Batch in a Smart WayI’m not opposed to the idea of all big-batch cooking—just the kind that leaves you with five identical plastic storage containers filled with equal portions of practical slop. On Sundays, I try to make no more than two or three batches of “building block” foods to mix and match throughout the week as my whims change. Things like a small pot of lemony chickpeas, a batch of grains like farro, and a panful of crispy mushrooms. I store everything in separate clear glass containers so I know exactly what (and how much) I have at all times. Because everything is already cooked, I’m only ever a few minutes away from putting together a decently cohesive meal. For example, I might stir-fry some cooked farro in sesame oil with scallions, add a handful of chopped jarred kimchi and a splash of soy sauce, and throw in some mushrooms, and boom: kimchi-mushroom fried grains, a lunch I would happily eat every day.Get the Recipes:Quite Possibly the Best ChickpeasSeared Mushrooms with Garlic and ThymeKimchi Fried GrainsQuick-cooked kale. So easy. So tasty.\nMinimize the Boring StuffI cook for a living, but this does not make me exempt from passionately hating the following prep tasks:Anything related to the peeling, mincing, or Microplaning of ginger, that cursed rhizomeWiping dirt chunks off mushroomsPeeling garlicWashing, spinning, tearing up, and storing greens, especially delicate salad greens that will start making brown juice in the fridge if you store them before they’re bone dryThese activities all become infinitely more unappealing when I’m faced with the prospect of having to do them every single time I want to cook something. So...I don’t. On days when I know I’ll have a few hours to dedicate to cooking, usually Sundays, I’ll suck it up and tear up the whole bunch of kale, pick some herbs and stash them in a bag, or mince a bunch of ginger for adding to stir-fries and dressings. (Just make sure they’re air tight!) Commit to these pesky tasks in one fell swoop upfront, and you’ll be rewarded......at least until next week when you’ll do it all over again. Life is not an episode of 30 Minute Meals, and that bunch of gritty spinach will never come with a small army of house-elves who will wash it for you in the middle of the night. Like any cooking endeavor, committing to lunch takes some thoughtful planning and a bit of work. But there’s no deeper state of relaxation for me than going to bed on Sunday knowing there’s a fridge full of building blocks and a sauce or two waiting to become something healthful and delicious. And there’s nothing better than waking up than a lunch I know I can look forward to.Explore Bon AppétitLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-07", "author": ["Condé Nast", "Christina Chaey"]}