{"id": "f7be698f518b151d0487da9a43969319", "url": "https://www.bonappetit.com/story/miso-eggplant-bowl", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "This Miso Eggplant Bowl May Convert Even the Hater-y-est of Eggplant Haters | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Miso Eggplant Bowl Will Convert Even the Most Hater-y of Eggplant HatersIf every eggplant were glazed with miso, the world would be a better place.By Hilary CadiganAugust 27, 2018FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Chris MoroccoFacebookTwitterEmailOver the course of eight years and six apartments and two continents, one recurring battle has plagued my fiancé and me. It pops up at unforeseen moments, devolves into loud and circular discussions that often include yelling, and cannot be solved no matter how many times we rehash it. The subject? Eggplant.See, like many deluded human beings on this vast and confusing planet, Rob insists he doesn’t like eggplant. And, yes, that’s an issue, because I love eggplant. But it’s not the crux of the argument. If he just flat-out hated the stuff, like I do raw bell peppers (ugh), I’d move on with my life, which would continue to include copious amounts of eggplant not shared with Rob. But no. The capital-I Issue here is that every time we eat good eggplant, he loves it. Still he stubbornly clings to his blanket dismissal, leading, inevitably, to the following conversation:“See? You like eggplant.”“No, I just like this eggplant.”“Okay, so you like good eggplant, which is the same as just, liking eggplant.”“No, because most eggplant is bad.”“But you liked it literally the past five times we ate it, dude. WHY MUST YOU FIGHT ME ON EVERYTHING?”While I recognize that I have a somewhat unhealthy emotional attachment to eggplant’s goodness and also that Rob may be trolling me, I’ve taken upon myself the role of eggplant evangelist, constantly in search of recipes with which to convince Rob that these nightshades are delicious. Which brings me to this Miso-Glazed Eggplant Grain Bowls with Basil recipe.Created by senior food editor Chris Morocco, the recipe was inspired by the incontestable GOAT of eggplant dishes: nasu dengaku, a Japanese creation that when done right takes on the flavor and texture of savory creme brulee. Chris believes rightly that eggplant is one of earth’s best vegetables yet often gets the shaft when sautéed or steamed either a) not enough or b) within an inch of its life.Chris recommends buying fresh Japanese or Chinese eggplants at the farmers' market (the long skinny kind) rather than the hulking Italian varietals you’ll find at most grocery stores. I couldn’t find the former so I opted for some small-ish Sicilian eggplants with pretty white stripes. Which is fine, says Chris, because the real key to this recipe is its two-step baking process.First, split and score the eggplants and bake them at 400 degrees for 22-28 minutes. While they’re cooking, whisk together a simple glaze of ginger, miso, soy sauce (tamari if you have it), vinegar, sugar, and olive oil. Then, up the temp on those ‘plants to 450, spoon on the glaze, and pop them back in the oven for another 12-15 to get all nice and caramelized. Things will start to smell very good in the kitchen, and your fiancé may comment on said smell in a positive fashion, to which you can choose to a) smile nicely or b) bark “IT’S EGGPLANT, DICK” with a self-satisfied sneer. Your choice.While this is happening, cook up some quinoa and perhaps some other healthful grains like barley, freekeh, or farro. You could use white quinoa if you want to get judged by Chris on Instagram, or you could opt for red or black if you “want it to actually taste good” (Chris’s words). You’re also making your fiancé chop cucumbers at this point. Persian ideally, but if you can’t find Persian, you can use regular old cucumbers as I did, salted and massaged to reduce the water content like so. (I personally skipped this step and was fine but as Chris also pointed out on Instagram and then again the next day, I could have done better.)All this is going into a kind of grain salad situation involving fresh basil leaves, scallions chopped into matchsticks, and a bit of extra glaze cut with lime juice for zing. Once your eggplants are all caramelized and yummy and slightly cooled, just spoon that salad onto them and boom! It’s the treatment those sweet lil bbs always deserved: crisp and bubbling on the outside, creamy on the inside, and flavored fully throughout with a tangy, salty, umami richness that will convert even the hater-y-est of eggplant haters.Well, maybe. Rob’s reply: “Yes I like it because this is one of the good ones.”This eggplant recipe is one of the good ones:Miso-Glazed Eggplant Grain Bowls with BasilThis recipe is a great way to showcase the eggplants and basil you just hauled from the market.View RecipeExplore Bon AppétitHealthyishEggplantMisoGrainsWhole GrainRead MorecookingA Fairy Tale Eggplant Recipe That Comes With an Irresistible Cashew SauceBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-27", "author": ["Condé Nast", "Hilary Cadigan"]}