{"id": "f7be57cd4080d0b8061bc0c4175c259d", "url": "https://www.bonappetit.com/story/strawberry-snacking-cake", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Bet You Can’t Eat Just One Slice of This Strawberry Snacking Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBet You Can’t Eat Just One Slice of This Strawberry Snacking CakeAfter nine tries (and so. much. cake.), we’re really sure it’s good.By Sarah JampelJune 5, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kat BoytsovaFacebookTwitterEmailIf there’s an inspirational poster somewhere in the world with the aphorism, “You won’t know your destination until you get there,” it might as well be about this strawberry cake.See, we knew that our destination was “strawberry oil cake”—imagine sweet, juicy berries against the lush, slightly savory olive oil backdrop, with a crackly sugared crust—but the number of paths we could take to get there were infinite. Would it be baked in a loaf pan? How about a springform? Would it have fresh or jammy strawberries? Or was this the time for freeze-dried? Would it be tall and lofty or short and squat? I stressed about it and came to no conclusion. I did know that no matter how the cake would look, it had to be as simple as possible: Because the easier the cake, the more likely you are to bake it (especially when it’s summer and the beach is calling).The problem, though, was that I adamant that the strawberries be roasted before being incorporated into the cake batter. Because strawberries are among the most watery fruits (they’re about 92% water, nearly as watery as watermelon), they leak a lot of moisture into batter, leaving damp, flavorless blueish-grayish pockets. By roasting the strawberries first, I’d rid them of excess moisture while intensifying their sweetness and color. It was a bit of extra time and a handful of additional dishes to wash, but I was sure it would be worth it.Watch these disappear, one slice at a time.\nPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaAnd so versions one through eight (yes, there was a lot of cake) started off with olive oil-roasted strawberries, strewn atop cake batter in a 9-inch round cake pan. But the roasted berries, so much heavier than the liquidy batter, sank into the middle of the cake. I kept tinkering with other variables—the number of eggs, the amount of leavener, the volume of flour—to try to keep the fruit afloat. Some of the changes I made I liked—I added cornmeal to bulk up the batter, create a slight crunch, and enhance the sunny-yellow color, and I swirled in strawberry jam for streaks of fruit flavor throughout—but the recipe was getting complicated. I played with using a mix of roasted and fresh berries, of layering the batter with the fruit, of finishing the cake with a lemon-turbinado glaze. I knew it was getting fussy, but I didn’t know how to stop.But before I tried versions 9 through 18, I (thankfully!) made one simple change that solved all my issues: By pouring the cake batter into a 13x9-inch pan instead of a round, I could distribute it in a thinner layer over a greater area. The cake set faster in the oven, which meant the strawberries had less time to sink. And because I was no longer worried about the fruit falling deep into the batter and creating those yucky mushy spots, I didn’t have to bother with roasting them either. Now, I could just slice the strawberries and lay them on the top of the cake, where they’d be exposed to the high heat of the oven. Dramatic sigh of relief. Instead of sogging out, they get jammy—almost like I, well, roasted them.The happy ending is that the most straight-forward version of this cake also tasted (and looked) the best.  It’s so pretty it needs no additional elaborations, it’s durable enough to tote to a cookout or a picnic, and yes, it’s simple enough to make with no advance planning and just an hour of free time. And, as it turns out, it’s just the strawberry cake we were looking for all along.Get the recipe:Strawberry Snacking CakeDon’t be surprised at how quickly this olive oil and cornmeal-enriched sheet cake will disappear.View RecipeExplore Bon AppétitSummerStrawberryCakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-05", "author": ["Condé Nast", "Sarah Jampel"]}