{"id": "f7c7265ea79e659fd4b26d6fc8b5da70", "url": "https://www.bonappetit.com/story/rent-week-gingerade-for-dry-january", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "A Rent Week Gingerade for Dry January (and All the Time, TBH) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Rent Week Gingerade for Dry January (and All the Time, TBH)The first ever Rent Week drink recipe is here. And it's loaded with ginger.By Alex DelanyJanuary 17, 2019FacebookTwitterEmailFacebookTwitterEmailI don’t drink during the month of January. Go ahead, criticize me all you want. Call me a trendy millennial cleanse exponent. Explain to me that taking a cold turkey break from booze for a month and then hopping back on the train on February 1st isn’t doing much for my liver. Whatever. I am one of those No-Drink January people, and I have been for the past few years. It helps me realign my mind. It reignites my appreciation for and ability to taste the alcoholic beverages I love. It sheds a couple pounds off my frame. And as a side effect, my wallet rejoices.I usually save a ton of money during January, mostly because I’m not rationalizing wild purchases at wine stores, breweries, amaro bars, or cider shops. There’s no post-bar pizza or dumpling stops. My dinner bills get cut in half, because iced tea isn't quite as expensive as a martini. But where I prosper financially, I suffer in terms of drink variety. Kombucha and seltzer can only do so much. I need something more involved. More interesting. More rewarding.Wait. Did you feel that? Yeah, that little rumble beneath your feet. That was progress, my friends. This a momentous occasion. This dry, bleak, booze-free January brings with it the first drink recipe in the history of Rent Week. A beverage! Wow! Neat-o!The answer to my problem is a homemade gingerade that turns seltzer into a whole new thing. If you’ve been a Bon Appétit reader for a while, you may have made our Lemon-Ginger Brew, which is similar to this recipe conceptually, although a little different in terms of flavor and consistency. Regardless, this Rent Week recipe is going to be quick, easily scalable, and something you can enjoy over the course of a few weeks. So throw on this Same Ol’ Me playlist (filled with the usual high-quality tunes and free of charge), and grab a pot and some oranges. We’ve got some juicing to do.You can store this gingerade for weeks in the fridge.\nThe general gist of this recipe is that we’re going to simmer ginger, spices, and fruit, let it reduce, and strain out the solids so that we're left with zesty, addictive liquid gold. (Actually, it’s murky and brown, so use your imagination.) But instead of just using water to boil, we’re going to cut into that with orange juice. Grab a saucepan and measure out 3 cups of water, emptying them into the pan. Then grab a juicer—not one of those fancy ones, a hand-powered guy will do fine—and juice 2 cups of orange juice. This is going to take about 8 navel oranges, but before you juice the last two, use a vegetable peeler to peel the skin off of the oranges in strips. Throw the 2 orange peels and the 2 cups of orange juice into the pot with the water.Now we need our ginger. Usually, a recipe calls for just a bit of ginger. This gingerade is not one of those recipes. We want about 10 oz. of ginger, which is about 10 1.5” x 1” pieces of ginger. It’s a lot of ginger to peel, but we’re going to get through it like the champs we are. The reason we peel the ginger is so we can expose the maximum amount of flesh to the liquid we’re simmering it in. Once your ginger is peeled, you can either grate it (if you’re feeling ambitious) or slice it into thin medallions (if you’re feeling lazy, which is totally fine and what I usually do). Add the 10 oz. of sliced or grated ginger into the saucepan.A little bit of spice is what we need next. Add ½ Tbsp. of whole cloves and 1 Tbsp. of whole black peppercorns to the liquid. You can also add ½ Tbsp. of anise seed or fennel seed in there, if you have it. But no pressure. I don’t want you to go out and buy spices during Rent Week.Bring the liquid into the saucepan to a boil over high heat. Once it reaches a boil, turn the heat down to medium-low and let the pot simmer for a little over an hour. You can give it a stir and admire the smell every fifteen minutes, just to make sure everything is getting enough love in there.Garnish it. Make it nice.\nBy simmering the liquid for a while, we’re evaporating some water and concentrating the flavors. You’ll notice the amount of liquid in the pot start to reduce, and once it’s been simmering for an hour-ish, you should have less than half of what you started with. Remove the pot from your stove. We’re about to cross the finish line.Pour the contents of the saucepan through a fine mesh strainer and into a large measuring cup or mixing bowl. That gingerade is going to be immensely flavorful, but also a bit unbalanced. The bright flavors and sweetness in the orange juice faded throughout the cooking process, so we need to reintroduce them. Add the juice from 2 limes and ¼ cup of honey into the concentrate and stir.Look at that! It’s murky and brown and honestly not that good-looking. But this gingerade is destined for refreshment. It’s going to satisfy your thirst. I like to double the recipe and store my brew in a couple of Mason jars in the fridge, where it'll last for weeks. And when it’s time to mix up a drink, I fill a glass with plenty of ice, add 3 parts seltzer to 1 part gingerade, and garnish with an extra slice of orange peel and/or a lime wedge. (The garnish is key—it really makes it feel like a cocktail.)You’ll understand when you sip this, but the balance of bright citrus, warm spice notes, gingery spice, fruity notes from the orange peel, and sweetness from the honey almost make me think I’m drinking a spritz. Almost. And after 30 days of drinking this gingerade, I’m sure I’ll be ready for a real one.Want a real Rent Week meal to go with your gingerade? Here ya' go:Turn This Lemony Rent Week Pasta with Leeks and Chile Flakes All the Way UpThe ingredient list is simple. But the pasta is loud.View StoryExplore Bon AppétitRent WeekBasicallyGingerOrangeSeltzerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-03", "author": ["Condé Nast", "Alex Delany"]}