{"id": "f7d1d50eae2a3316ee540cd77cf1c205", "url": "https://www.bonappetit.com/story/sophia-maroon-dress-it-up-salad-dressing", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Dress It Up Founder Sophia Maroon on the 6 Rules She Never Breaks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow I Turned My Mom’s Recipe Into an Award-Winning Food BusinessThe founder of Dress It Up bottled salad dressings, on the six rules she never breaks.By Sophia Maroon, as told to Jen MarshallFebruary 22, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is from 13 Ways to Launch the Food Business of Your Dreams, where women entrepreneurs share their experiences and best advice on turning a passion for food into a career.My mother, Suzy, had long been celebrated for her homemade salad dressing, a delicious garlicky vinaigrette. She created the recipe after my dad was diagnosed as prediabetic and had to change his diet. At holidays we’d inevitably say, “You should sell this!” It became kind of a family jest until my brother dared me to actually try.I was a newly single mother with three children under the age of 10, and my job as a documentary filmmaker wasn’t going to cut it. I needed flexible, close-to-home work. So I began mixing dressing in my Maryland kitchen and sharing it with friends. I named my company Dress It Up, because that’s exactly what my mother’s dressing could do: effortlessly elevate any meal. Thanks to my friends’ vocal support, orders came in from strangers. I invested $7,000 in July of that first year to make 60 cases each of Dress It Up’s first four flavors: champagne, red wine, apple cider, and chocolate. By November, it was stocked in my local Whole Foods. But I couldn’t afford to make more.Sophia Maroon, pouring it on.\nPhoto by Alex LauSeven family members and friends each pitched in $5,000, enough for a second, bigger order and part of the third. I wouldn’t be where I am now—founder of an award-winning company with six dressing flavors available nationally—without them.Last year the community helped us out again. We’d planned to launch individual dressing packets designed for salad bars. Then came the pandemic and a warehouse full of product with nowhere to go. For several years, we’d partnered with D.C. public schools to provide our dressing at reduced cost. The school system happily put the packets to use. At every step, community relationships have made our work not just meaningful but possible.The 6 Rules I Live and Work ByRose-Colored Glasses Forever. Believe that what you are trying to do can be done. Every entrepreneur needs that level of conviction.Figure Out What Motivates You. After my unexpected divorce, I had a “say no to nothing” mantra, and that helped my business succeed.Check Your Fear. I was afraid of nothing when I started Dress It Up. The worst thing—an unexpected divorce—had already happened to me. I had a “say no to nothing” mantra, and that helped my business succeed.Nail Your Nonnegotiables. Here are mine: ingredients (no canola oil and no xanthan gum), family first (it’s only salad dressing!), and financial responsibility (I’d secure a loan against my house, but I won’t touch my IRA).Find Investors Who Respect Your Vision. Many investors today want to see a five-year exit plan with a 20-times return. In other words, they want you to grow and make money fast. There’s a lot of pressure! I see growth differently. I couldn’t afford for my company to get too big too fast and flame out. That’s a fun story for an 18-year-old in a college dorm, not for a 40-something mother trying to make ends meet. Slow and steady made the most sense for me.Apply for More Than Money. Last year, Dress It Up was fortunate enough to be a Stacy’s Rise Project winner. In addition to a $10K award, we got access to a cohort of fellow crazy-optimist female founders and top-level brand advisers who provide tactical advice about sustainable growth.Explore Bon AppétitFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-17", "author": ["Condé Nast", "Sophia Maroon", "As Told To Jen Marshall"]}