{"id": "f7d17067632f9aef37184cb5a9ce6dbe", "url": "https://www.bonappetit.com/story/calaca-brooklyn", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Calaca in Brooklyn Is the Only Restaurant Where I Don’t Even Experience Vegetarian FOMO | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsCalaca Is the Only Restaurant Where I Don’t Experience Vegetarian FOMOSure, the carnitas at the teeny-tiny Mexican spot look good, but have you ordered the huitlacoche quesadilla?By Sarah JampelMay 9, 2019FacebookTwitterEmailPhoto by Jesus ZapataFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.There are a lot of instances when I experience malignant FOMO as a vegetarian (see: weddings; turkey tails; Franklin BBQ): Often what I’m eating pales in comparison to the meat options or just feels like something I could’ve made at home. But I have never, ever felt left out, neglected, or overlooked at Calaca, a teeny-tiny Mexican restaurant a couple of blocks away from my apartment in Bed-Stuy, Brooklyn.Even though the menu is nearly as small as the space itself, vegetarians are well taken care of. Tacos and quesadillas aren’t filled with mushy squash or slithering roasted peppers; instead, they’re stuffed with huitlacoche (a.k.a. a savory, earthy, funky, delicious fungus that grows on blighted corn), roasted corn, and cotija. The tostadas hit the perfect equilibrium. They’re so crisp they shatter, yet they’re still sturdy enough to hold a pile of refried beans topped with queso fresco, thick slices of avocado, and pico de gallo.And if that’s not enough to leave me satisfied, I order some snacks, which aren’t throwaways or fillers: queso with mushrooms and pickled onions; guacamole with cotija and homemade chips; elote; or a couple of their homemade tortillas.From my spot at the bar, where the $5 happy hour margaritas are easier to access, I look over the small, candle-lit room, squint to spot any minor celebrities (and by that I mean the coolest girl in my college class or that culture writer for the New York Times), and take comfort in the fact that I’m not jealous of anyone around me—even if it’s clear they’re thoroughly enjoying their carnitas and mahi-mahi and red snapper. I’m loving my corn smut just as much.Go there: CalacaExplore Bon AppétitHighly RecommendRestaurantsMexicanNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-09", "author": ["Condé Nast", "Sarah Jampel"]}