{"id": "f80e74d1cdf765e73953cca7192fb1af", "url": "https://www.bonappetit.com/recipe/steak-sandwiches-with-fennel-slaw", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Steak Sandwiches with Fennel Slaw Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueSteak Sandwiches with Fennel SlawBy David TamarkinJanuary 8, 20195.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis open-faced wonder comes together quick and easy when you plan ahead—a little strategy we call nextovers. Fresh fennel adds crunch against thinly sliced steak and pillowy focaccia. Reprinted With Permission From COOK90: The 30-Day Plan for Faster, Healthier, Happier Meals By David Tamarkin, Published By Little, Brown and Company, 2018Ingredients1chilled leftover steak (from Pan-Roasted Steak with Crispy Broccoli)1small fennel bulb, very thinly sliced, plus coarsely torn fronds½small red onion, very thinly sliced, rinsed¼cup leftover cilantro salsa verde (from Pan-Roasted Steak with Crispy Broccoli)½tsp. kosher salt, plus moreFreshly ground black pepper1sandwich-size piece focaccia, split lengthwise, toasted4Tbsp. mayonnaisePreparationStep 1Slice steak against the grain into as-thin-as-you-can-get-them strips (this is much easier to do when the steak is cold). Transfer to a large bowl and let sit at room temperature while you make the slaw. If you have time, slice the steak before you start cooking; an hour is ideal to completely take off the chill.Step 2Toss sliced fennel, red onion, salsa verde, ½ tsp. salt, and 1 Tbsp. fennel fronds in a large bowl to combine. Season slaw with a few grinds of pepper and toss again.Step 3Spread cut sides of focaccia with 2 Tbsp. mayonnaise each; transfer to plates. Divide steak between bread and crown each sandwich with a big handful of slaw. (You may have a small amount left—nibble on it or serve on the side.) Top sandwiches with more fennel fronds and sprinkle with salt.How would you rate Steak Sandwiches with Fennel Slaw?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis recipe is a knockout. Great flavor, easy to prepare, and so satisfying! I'm not a huge red meat eater and I loved this. Will definitely making this again (and again and again...).rachaelsenning0130Washington, DC8/13/2019This recipe is now my go to recipe to consume left over steak. The flavors blend so perfectly, my boyfriend stated that this is the best sandwich he has ever had.AnonymousFort Wayne, IN3/19/2019Explore Bon AppétitSandwichSteakBeefMeatRed OnionOnionVegetableFennelQuickEasyWeeknight MealsMainDairy-FreeNut-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "David Tamarkin"]}