{"id": "f81374fc11e7031649ee11455d2d3206", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/amass", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Amass Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenAmassHidden in Refshaleøen, an elaborate root-to-stem tasting menuFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: to experience former Noma chef Matt Orlando’s grand and bracingly challenging experiment in a concrete warehouse on an until-recently neglected waterfront strip far from the crowds.ORDER THE: tasting menu, but there are a few first-come seats at the kitchen counter and bar, where you can order à la carte. Here, Orlando and his dedicated team serve push-all-the-envelopes food with a mission to generate 75 percent less waste: kale stems flavor a hollandaise, burnt wood infuses oil, and leftover potato peels are worked into crisps.THE VIBE IS: warehouse-y—concrete walls and columns, widely spaced tables, graffiti as art—with polished moments. (Despite the hip-hop and spray paint, the team takes itself very seriously.) Swing by in summer when the industrial room opens to the outside and nightly bonfires are lit near the raised garden bed.PRACTICAL STUFF: Open for dinner Tuesday to Saturday, from 6 p.m. to midnight and lunch Friday and Saturday, from noon to 3:30 p.m. (last seating at 1 p.m.). Closed Sunday and Monday. Make sure your phone is charged before dinner: There’s no way you’re hailing a cab back to the hotel in this neck of the woods, so call for an Uber.—Christine MuhlkePhoto by Ditte IsagerWE ALSO LOVENomaThe next evolution of René Redzepi’s destination restaurant in RefshaleøenRelæLive a little with the Nørrebro tasting-menu restaurant that’s still making waves La BanchinaGet real R&R in at this Amager Harbor vegetable-focused restaurant with a few surprisesExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}