{"id": "f81671d635bcb9f993b3c9365ac5c46c", "url": "https://www.bonappetit.com/story/waiter-wisdom-wisecracks", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Meet the Waiter With Half a Century’s Worth of Wisdom and Wisecracks to Share | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMeet the Waiter With Half a Century’s Worth of Wisdom and Wisecracks to ShareSilvio Frlic has been working at Brooklyn red sauce stalwart Bamonte’s for 41 years. Silvio Frlic has seen some things.By Hilary CadiganApril 16, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.When he arrived in New York City from Croatia back in 1965, Silvio Frlic was 16 and spoke no English. But he did speak German, Spanish, Italian, Romanian, a little Russian, a little Belarusian, and a little Polish. “Once you know a few,” he says with a shrug, “it’s easy to learn a few more.” He spent nights going to school and days working in food service—incidentally building a resume that reads like a Rolodex of NYC’s most iconic restaurants: the Friars Club, Café La Fortuna, the Gaslight Café, Mamma Leone’s. Eventually he settled at Bamonte’s, one of the few institutions that remain from that era, an Italian-American white-tablecloth time capsule dating back to 1900.Things have changed a lot since. The neighborhood, Williamsburg, has morphed into a hipster mecca. The rents have skyrocketed. Most of the original restaurants have closed. Many of their customers have passed away. But Bamonte’s, says Frlic, has changed very little—well, aside from the fact that he no longer presses the juice out of an entire duck carcass tableside. We sat down beside a wall covered in photos of a younger Frlic (a few more teeth, a lot more hair, the same impish grin) and talked about all the things he’s seen and heard (and not seen and not heard) in a half-century waiting tables.So, how did you start working at Bamonte’s?I didn’t really want to come. It was summer—a beautiful day. I wanted to go to the beach! But my cousin Mario was working here so he called me. It was 1977 or ’78, during the Giglio Feast, a big Italian festival they have in Williamsburg every July, and they didn’t have no help. After that I kept coming back. We never have a slow night, except the Super Bowl and when the Yankees are in the World Series. I’ve been here 41 years. But cousin Mario’s been here 42, so he beats me.What was the first day like?Oh, I was used to it. I worked at a lot of restaurants before Bamonte’s: At Danny’s Hide-A-Way, I started as a pot washer—the worst thing in the world—and worked my way up to second chef. Then Friars Club, Café La Fortuna, the Gaslight Café, Amalfi. All of them are closed now. I worked at Mamma Leone’s too. Dish carrier. First day I went inside, I got lost. It was gigantic! I didn’t know how to get out of the place. They used to serve thousands of people a night. Hundreds of waiters. The kitchen was one block long.What made you switch from the kitchen to front of house?My hair.Your…hair?My hair started to fall off. And the chef told me, “If you stay any longer in the kitchen, you’re not gonna have hair.” I was 20 years old. I says, “God. Let me get outta here.” In those days, if you don’t have no hair, you don’t have no dates. Today, it’s different.Now you can get dates without hair?Oh, yeah. Now it’s no problem.What was it like being a waiter in those days?Everything was done in front of you. All the salads, pastas, whole fish, even—we’d fillet it at the table. Cherries jubilee, crepes suzette. My favorite was duck à la presse. They half-cook a whole duck, and you put it in a machine and squeeze all the juices out at the table. Then you bring it back in the kitchen, and they make the sauce. You bring it back out and flambé it.Back then, if you didn’t know how to do everything in front of the customer, you didn’t have no job. So all the waiters did it—classic art. And when the ladies came in and sat down, I took their shoes off. In summer, they’d get a cold pillow under their feet. In the winters, hot pillow.You actually did that? You took off their shoes?Of course! It’s part of the service, part of the job. The ladies used to love it. You kidding me? That type of dining doesn’t exist anymore.What was the most exciting part of working in those days?I used to meet all the actors and actresses at the Friars Club. Frank Sinatra, Jerry Lewis, Dean Martin, all those guys. That’s where they hung out. They’d show up together, and all of them was nice. But Frank Sinatra was the nicest guy in the world.What’d they talk about?Ah, that was private. You don’t listen. You’re not supposed to. You don’t want to know their business. I’m not nosy.Did you get any mobsters?No. I don’t know nothin’ about mobsters.Silvio Frlic has worked at Bamonte's for 41 years.\nPhoto by Alex LauWhat’s the craziest thing that ever happened while you were working?Maybe I shouldn’t tell you.Oh, come on.There was two guys always coming with their wives to eat. And one day they came with their girlfriends. They’re eating at a table and I see the wives coming in. So I tell them, and they run to the kitchen, and I put them in the dumbwaiter and send them outside.You put the guys in the dumbwaiter?What are you gonna do? It would’ve been World War III. I didn’t want that to happen. It was the ’70s, in Manhattan.That’s a good story.No, it’s a true story.What was different at Bamonte’s back then versus now?Nothing. Almost nothing. Food is good, always. Customers are like family, generation after generation. I have more regulars than hairs on my head.How many hairs do you have?I don’t know. There’s quite a few left in the back!What are the biggest changes you’ve seen in the neighborhood?This here used to be all warehouses and factories. Everybody left. They went to China, India, Mexico, Carolinas, Texas. Who ended up with the property? The city. They changed the zone to residential and the prices went through the roof overnight.And now there are expensive bars and restaurants popping up everywhere.Yeah, but not like Bamonte’s. If I go to any of those places, I have to double order. Portions are tiny—all decoration. Over here, they give you the real McCoy. If you eat one dish, you’re satisfied. And besides, it’s good.What do you think of the hipsters that have taken over Williamsburg?Oh, they’re very nice. They come after nine and eat and drink like there’s no tomorrow. But the only thing is: They don’t eat dessert. They get a lot of appetizers, a lot of food on the table—usually too much and I have to tell them to cut it in half. (I’m usually right. It’s always good to talk to the waiter.) But dessert? No. Unless somebody has a birthday. Then, it’s a candle and a piece of cake. Everybody tastes it and that’s it.What about drinks?Mostly they drink wine. When I was working in the ’60s, ’70s, if you served a glass of wine every week, it used to be a big deal. Nobody drank wine in those days. Only hard liquor. But these youngsters, mostly wine.What food do you serve them?Well, everything’s good. So I always ask, “What are you in the mood for?” A lot of people, they don’t want no menu. They tell me, “Just bring the food.” So I mix it up. Chicken scarpariello—I like it with the bone. Lemon. Butter and white wine. Delicious. If you wanted pork? Pork chop abbamonte, with vinegar pepper, hot and sweet. Delicious. Or shrimp parmigiana, if you like shrimps. Sheesh!Do you eat here yourself?Of course. Mostly every day. Sometimes twice a day if I’m hungry!Have you ever spilled food on anybody at the restaurant?Oh, yeah. Not often. But a guy the other day, he’s going with his hand like this—talking about how big something was—as I was passing by. What are you gonna do? Plate of food to the man; plate’s on the floor. You know why?Why?Because his kids were there. If I didn’t do that, I would’ve burned his kids. He got a little on him, yeah, but I told him, “Suppose I spilled all this hot food on top of your kids?” Then he apologized, said, “You’re right, you’re right.” Yeah. You don’t want to burn a kid, huh?Certainly not. Do you think you’ll ever retire?When I get tired, I guess. But what am I gonna do all day at home? Eat and drink and watch television? That's not my cup of tea. I’m strong, never been sick, have good legs….Wait, you’ve never been sick?Never in my life.Never ever?Not even a cold.How is that possible?I don’t know. Good food? I went for a checkup a couple years ago, and the doctor asked me, “When was the last time you came for a checkup?” I said, “Let me think. It was 1967 at Fort Hamilton. I was drafted.”Hilary Cadigan is an associate editor at Bon Appétit.Explore Bon AppétitRestaurantsItalian AmericanRed SauceBrooklynRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Hilary Cadigan"]}