{"id": "f83238aabbb6f29fc5f33b48bbf3efde", "url": "https://www.bonappetit.com/story/united-ferments", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "This Kombucha Tastes Like Your Favorite Orange Wine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Kombucha Tastes Like Your Favorite Orange WineUnified Ferments are expressive, restrained, and unlike any other kombucha I’ve ever had.By Elissa SuhFebruary 10, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.A few years ago I drank kombucha so regularly that my then boyfriend, now husband gifted me a SCOBY, the jellyfish-like starter that transforms sweetened tea into a kicky, tart beverage. I was excited to brew my own booch, both as a cost-saving measure and a creative challenge: I’d done regular rotations through all the brands and flavors, and my tongue was starting to tire. But my life as a kombucha hobbyist was short-lived—no matter how hard I tried, my brews always tasted lackluster and generic. So knowing just how difficult it is to make excellent kombucha, I was blown away by the nuances of Unified Ferments.Unified Ferments makes kombucha that lets the tea do all the talking, without any added fruits or flavorings. The results are expressive, restrained, and unlike any other kombucha I’ve had—this is not your health coach’s booch. They currently offer five different expressions, each named after the single-origin tea that forms the base. My favorite is the amber-colored Snow Chrysanthemum. You’ve probably had a floral chrysanthemum tea poured alongside your dim sum, but this particular flower variety, sourced from the Kunlun Mountains, is a little different. “Snow [chrysanthemum] is kind of the Tarzan version,” says co-founder Graham Pirtle. To survive the cold climate, the flower produces more proteins and amino acids, making it beefier and more gnarly than your usual chrysanthemum. Still and not sparkling, this robust kombucha has the same funkiness you expect from an orange wine. It tastes like honeyed ham, rounded out with pollen and a zing of oyster mushrooms.My second favorite is the Qi Dan, which comes from one of the oldest Chinese tea cultivars, hard to come by in the US. It’s grassy, nutty, lightly carbonated, and reminds me of toasted sugarplums. “It’s this buildup of sweetness and minerality on your tongue that gives a gorgeous mouthfeel,” Pirtle explains. It also has a distinct aftertaste that makes you want to take another sip to enhance the flavor—something tea drinkers will know as hui gan or “returning sweet” and is effectively captured here.The drinks are perfectly delicious any time of day, but I like having mine with dinner—and company—since these kombuchas only come in 750 mL bottles, like wine, sized perfectly for sharing. (They’re also non-alcoholic, so they won’t alienate anyone who’s abstaining from booze.) I love having the Snow Chrysanthemum when I’m eating something spicy like tteokbokki or these tofu noodles with chili crisp. Its juiciness goes equally well with whatever bitter greens salad I have on rotation that week. When I set out a cheese plate, I pour the Qi Dan into some nice stemware; it can hold its own against more aggressive flavors and opens up in the glass. Unified Ferments’s co-founder Young Stowe recently sung its praises when paired with carbonara.If you're thinking these kombuchas don't sound too… kombucha-y, you’re not wrong. “We even have a hard time with the word ‘kombucha’ because it brings to mind a super specific beverage,” says Pirtle, who worked at 29b Teahouse (a Bon Appétit favorite) before founding Unified Ferments, a two-person operation, with Stowe in 2019. While many brands brew with a focus on the drink’s probiotic potential, the founders of Unified Ferments have taken a different approach, trying to amplify the teas’ inherent flavors and intervening as little as possible during fermentation. “We wanted to [make kombucha] 3D instead of 2D,” Pirtle says.While some people just prefer 2D, Stowe and Pirtle believe there’s plenty of room for different expressions of kombucha. And I agree. No matter the occasion, I know something from Unified Ferments will fit right in. They’ve done the hard work of brewing for me—all I have to do is sit back and sip.Photograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaUnited Ferments Seasonal Package$35 at United Ferments (2-Pack)$60 at United Ferments (4-Pack)Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-10", "author": ["Condé Nast", "Elissa Suh"]}