{"id": "f8424e2791b4c2f6ea5178b41ff9e547", "url": "https://www.bonappetit.com/recipe/air-fryer-sesame-coconut-chicken-tenders", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Air Fryer Sesame-Coconut Chicken Tenders Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAir Fryer Sesame-Coconut Chicken TendersBy Rachel GurjarSeptember 14, 20213.3(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintWe would never turn down a chicken tender with a crisp panko coating, and this recipe goes a couple steps further, incorporating sesame seeds and shredded coconut for added texture and flavor. The best part? Making them in an air fryer means you don't have to worry about a scary pot of bubbling oil, and clean up is a breeze. (Which is to say, get ready to have a whole lot more chicken tender action in your life.) You could certainly serve these with whatever dipping sauce you like, but trust us: That creamy-tangy peanut sauce makes the whole thing over-the-top delicious.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCOSORI Air Fryer Max$120 At AmazonStainless Steel Mixing Bowls$26 At AmazonWhisk$10 At AmazonTongs$13 At AmazonIngredients4 Servings1½lb. chicken tenders1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more¾cup all-purpose flour1Tbsp. garlic powder1Tbsp. onion powder½tsp. cayenne pepper3large eggs1½cups panko1½cups unsweetened shredded coconut2Tbsp. black sesame seeds1Tbsp. white sesame seedsNonstick vegetable oil spray1garlic clove, finely gratedJuice of 1 lemon⅓cup creamy peanut butter1Tbsp. maple syrup2tsp. SrirachaSpecial equipmentAn air fryerPreparationStep 1Heat air fryer to 400°. Spread out chicken tenders on a large plate and pat dry with paper towels. Season on both sides with salt. Chill, uncovered, until ready to use.Step 2Whisk flour, garlic powder, onion powder, cayenne, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a medium bowl to combine. Whisk eggs in another medium bowl.Step 3Combine panko, shredded coconut, black sesame seeds, and white sesame seeds in a third medium bowl. Spray with nonstick spray, then mix with a spoon. Repeat 3 times, until panko mixture is thoroughly coated in oil.Step 4Working one at a time, dip tenders in flour mixture, turning to coat all over. Shake off any excess. Dip in egg mixture, letting excess drip back into bowl. Dredge in panko mixture, turning to coat and pressing lightly to adhere. Transfer tenders to a large plate or a small rimmed baking sheet.Step 5Working in 2 batches, arrange tenders in a single layer in air fryer. Cook until lightly browned underneath, 7–9 minutes. Turn tenders over and cook until cooked through, another 7–9 minutes.Step 6Meanwhile, whisk garlic, lemon juice, peanut butter, maple syrup, Sriracha, and ¼ cup water in a medium bowl until smooth, about 30 seconds. Season with salt.Step 7Transfer tenders to a platter. Serve with peanut sauce alongside.How would you rate Air Fryer Sesame-Coconut Chicken Tenders?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleNot so much a review as a question. Step 3; I’m spraying the bowl with the nonstick spray? The food? I’ve never seen that before so I’m a little flummoxed.Mauma-MiaDutchess, NY12/1/2021The recipe for the chicken is great, turned out so crispy and flavorful. Will definitely make again and serve on chicken or even a katsu style sandwich. The peanut sauce was very disappointing. I actually threw it out and made my go to peanut sauce recipe which paired great. Would recommend serving with some green onions and cucumbers on rice. BucatiniBimboTraverse City, MI10/10/2021This was OK cooked in a ‘scary deep fat fryer' at 375*f  for 6 min each batch, .I expect it could better if I knew enough about  using the unit (with built in oil filtration and storage that I bought via link on these pages) unmodified a lot of the coating of seeds and coconut fell off in the deep fat fryer…So,  how should the recipe be modified to correct for that in a proper fryer?WindyMidCoast Maine9/24/2021Turned out great, peanut could have used some soy sauce and green onions.  The amount of coconut and panko could have been cut in half, threw out a bunch.  Eggs where just the right amount.  More air fryer recipes like these please.JkdrummerAuburn, WA9/19/2021why cant the ingredients be divided into the different components for the dish.\nmakes it so easy to understand, and adapt if one wants to swap ingredients. Here one has to read the full list, read the whole recipe, and understand whats going where. Even the instructions can be made component wise. Its just so surprising you'll havent thought of it making this change. Anonymousmumbai, in9/17/2021Explore Bon AppétitChickenPoultryPeanut ButterCondiments, Sauces & PastesDinnerWeeknightCoconutFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Rachel Gurjar"]}