{"id": "f85947b225b8ce327bd42458c4ce5741", "url": "https://www.bonappetit.com/story/rent-week-tomato-sauce", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "This Easy Tomato Sauce Is Perfect for Rent Week and Everything Else | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Rent Week Tomato Sauce for August and BeyondCheap? Yes. Tasty? Yes. Easy? Yes. Simple? Yes. Versatile? Yes. Should we start? Again, yes.By Alex DelanyAugust 3, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIt doesn’t matter how I got this sunburnt. Maybe I had a few margaritas and fell asleep by the side of a pool. Maybe I didn’t. Like I said, the cause of my pain is not important. What matters is that my arms and shoulders hurt. And that when I remove my shirt, I look like a massive, oblong tomato. The shade of red is startling.But let’s get back to tomatoes. Not a human impersonator, but the actual fruit. It’s that wonderful time of the year when farmers' markets are full of them, and I’m not talking about the ghostly pink orbs that grocery stores pass off as tomatoes from October to July. I’m talking about peak-season tomatoes—the purest, juiciest, most colorful and refreshing example of what in-season produce can be. Farmers market tomatoes are perfect for Rent Week and the highlight of summer.Sadly, that highlight is a brief one. Peak season tomatoes show up for one drink and ditch the party immediately after, leaving everyone else standing around, murmuring things like, “Wait. In-Season Tomatoes were here? They left? Are you sure? Did you check the bathroom?”Which is why when I can get my hands on farmers market tomatoes, I make as much of this easy tomato sauce as I possibly can. The tomato sauce I make isn’t a cook-all-day-with-your-nonna type thing. It doesn’t hold a brilliant red dye 40 hue or a homogenous texture. It’s a fresh, quick, minimalist’s tomato sauce. It’s color varies. It’s chunky. It’s simple. It’s rough around the edges.And it can go on just about anything. It’s not just pasta sauce. This is egg sauce. And beans sauce. And rice sauce. And pork cutlet sauce. And veggie sauce. And grilled chicken sauce. And—yes, occasionally—pasta sauce. This is a tomato sauce to be used for many things, as frequently as possible, and I made this Primo Summer Vibes playlist (including a healthy portion of disco and absolutely free of charge) so you can make sauce, while grooving to the sauce. Let’s start with our tomatoes.This is what we're going for. Not quite your typical red sauce.\nPhoto by Alex LauIt doesn’t really matter what size or color or variety your tomatoes are. In fact, this sauce is actually better when you mix it up. The only thing that matters is that the tomatoes come from somewhere groovy and nearby, not ones that spent days and days on a refrigerated truck. Grab a variety of breeds, sizes, and colors of heirloom tomatoes at your farmers market or roadside veggie stand. (Also: They don't need to be perfect. If vendors at the farmers' market are selling bruised or otherwise \"imperfect\" tomatoes at a discount, those will do nicely too—just trim off any gnarly bits and you're good to go.) And if you need a little guidance, ask the farmer. They should know what’s up with their produce.Cover the bottom of a Dutch oven in olive oil, and heat it over medium heat. Smash 8 cloves of garlic and slice each clove in half, widthwise, so you get a bunch of little garlic shards. Is shards a bad word? Yeah. Okay. Garlic splinters. No. That’s worse. Garlic...fragments? I guess that’ll do. Throw your garlic fragments into the oil, and cook them until the outsides brown and the insides soften. This should take around six minutes.While that’s happening, cut up those beautiful tomatoes you bought. My general rule is that there should be 1 medium sized tomato for every clove or garlic, or 1 large tomato for every two cloves of garlic. If you don’t want to do that math, just do what feels right. For 8 cloves of garlic, we’re going to do 4 large tomatoes, cut into six or eight wedges. You want the pieces of tomato to be wedges, not circular slices. These will give you a more substantial bite when they’re cooked.You’ll also notice that we’re not peeling these tomatoes. That might not be kosher in the eyes of some Italian chefs, but for the purpose of this sauce, it’s 100 percent all right. Dump the chopped tomatoes into the Dutch oven and turn the heat to medium-low. Stir the tomatoes, so they get covered in the olive oil and mixed with the garlic fragments. Use the back of your spoon to mash the tomatoes slightly.Tomato sauce is a breakfast food. I promise you.\nPhoto by Alex LauHmmmm. That’s interesting: There’s a ton of liquid in the Dutch oven now. That’s totally cool! All the juices from the inside of the tomato want out, which helps build our sauce. It’s also a sign that now is the appropriate time to start seasoning. Season the sauce with red pepper flakes and kosher salt, tasting as you go. This should happen about five minutes after you add the tomatoes. You’ll have to use a little more salt than you’d use in a normal tomato sauce, since we won’t be reducing the liquid for hours over the stove. The higher the water content, the more salt the sauce will need.The sauce will simmer, and it should continue to do so, until you see the skins of the tomato wedges start to peel back from the flesh inside. This means that the flesh is almost finished cooking. Once a you see the first of the skins peel off completely, it’s time to turn off the heat. This takes between 15 and 20 minutes from the time you throw the tomatoes in. Look at that. You now have a very basic, easy tomato sauce, with big, flavorful pieces of peak season tomatoes.If you want to fold some basil into the sauce, go for it. But this is Rent Week. Basil might not be an option. What you do from this point on is your call. I’m not going to tell you how to use the sauce, but I will tell you that you should make another batch and freeze it. Hell, make three more batches. Buy all the tomatoes at the market. Buy the farm. Make farmers market tomato sauce for weeks,  until you get fired from your job, because you don’t go there anymore.No: Don’t do that. Be responsible. But keep an open mind with your sauce application. Personally, I’m a huge proponent of eating tomato sauce for breakfast. I don’t want granola and yogurt. I want scrambled eggs with farmers market tomato sauce and Parmesan cheese. Also, I’d like some aloe vera, if possible. Thank you.Want something that involves more chicken wings? Here:Chicken Wing Dinner: A Rent Week WinnerThis is me giving you permission to eat chicken wings—and only chicken wings—for dinner tonight.View StoryExplore Bon AppétitBasicallyRent WeekScrambled EggsTomato SauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-03", "author": ["Condé Nast", "Alex Delany"]}