{"id": "f861c2b08617f4f53b9fdb80e370cd35", "url": "https://www.bonappetit.com/recipe/mushroom-carbonara", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "Mushroom Carbonara Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMushroom CarbonaraBy Molly BazMarch 22, 20194.7(183)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Jennifer OphirEmailPinterestPrintEmailPinterestPrintMushrooms take the place of the traditional cured pork in this vegetarian carbonara recipe—but fear not, the dish does not lack depth of flavor! A deep browning on the mushrooms, coupled with garlic and shallots, brings the humble button mushroom to a higher place.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonChef's Knife$34.53 At AmazonLarge Pot$55 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMedium Bowl$17 At AmazonCutting Board$10 At IKEAWhisk$10 At AmazonWooden Spoon$6 At AmazonGlass Measuring Cup$19.99 At AmazonColander$11 At AmazonIngredients4 servingsKosher salt1½lb. crimini or button mushrooms6garlic cloves2medium shallots1cup parsley leaves with tender stems (about ½ bunch)5large egg yolks1large egg4oz. store-bought pre-grated Parmesan, plus more for serving1½tsp. freshly ground black pepper, plus more¼cup extra-virgin olive oil1lb. orecchiettePreparationStep 1Fill a large pot with water and season well with a few big pinches of salt. Bring to a boil.Step 2Meanwhile, do some veg prep! Tear off and discard stems of 1½ lb. crimini or button mushrooms, then tear them into quarters (or in halves if small). Transfer to a medium bowl. Lightly smash and peel 6 garlic cloves, then thinly slice. Peel and finely chop 2 medium shallots. (A small red onion will work fine in a pinch.) Coarsely chop 1 cup parsley leaves with tender stems.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Whisk 5 large egg yolks, 1 large whole egg, 4 oz. store-bought pre-grated Parmesan (about 1¼ cups), and 1½ tsp. freshly ground black pepper in another medium bowl; set aside.Step 4Heat a large Dutch oven over medium-high for a good 3 minutes. You want to get the pan very hot since adding the mushrooms is going to lower the temperature of the surface of the pan. Toss mushrooms and ¼ cup extra-virgin olive oil once in pan to coat in oil. Cook, tossing once every 4–5 minutes (but mostly undisturbed), until mushrooms are mostly golden brown, 13–16 minutes. This will take some time and they will let out a lot of moisture before they start to brown, so stick with it!Step 5Once mushrooms have been cooking for about 10 minutes, drop 1 lb. orecchiette into boiling salted water and set a timer 2 minutes shy of al dente according to package directions.Step 6Back to those mushrooms! Once you’ve finished the browning process, reduce heat to medium-low and add garlic, shallots, and 1½ tsp. salt. Cook, stirring often, until aromatics are softened but not browned, 30–60 seconds.Step 7When pasta is 2 minutes shy of al dente, scoop out 2 cups pasta cooking liquid, then drain pasta.Step 8Add pasta along with 1 cup pasta cooking liquid to mushroom mixture. Cook over medium-low heat, stirring often to finish cooking the pasta and absorb liquid, about 2 minutes (this is why you’re cooking the pasta 2 minutes shy of al dente; it allows for the flavors to meld as the pasta finishes cooking in the sauce). Remove from heat and let cool 1 minute. (Don't skip this step—if the pasta is too hot when you add the egg mixture, it will turn into scrambled eggs instead of a luxurious sauce.)Step 9Add ½ cup pasta cooking liquid to reserved egg mixture and whisk to combine and loosen eggs. Gradually add egg mixture to pot, stirring vigorously with a wooden spoon and adding more pasta cooking liquid as needed to loosen things up, until a very creamy, luscious sauce coats all noodles.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 10Add parsley and stir again to combine. Taste and adjust seasoning for salt.Step 11Divide pasta among bowls. Top with Parmesan and a few cranks of pepper.How would you rate Mushroom Carbonara ?Leave a ReviewTell us what you thinkReviews (102)Back to TopTriangleMade this yesterday for the family and it was a big hit!\nThanks!!!lookhereL.A., Ca.2/7/2022followed the directions exactly and WOW! this is a luxurious, restaurant quality meal that i made in the comfort of my own home. i was nervous about scrambling the eggs but the way the recipe was written makes it foolproof. this will become a go to recipe in our house. i absolutely loved it. alyssawest long branch, nj12/20/2021Loving the use of Puglia’s traditional pasta, orecchiette, but vegetarians beware. Parmesan is never vegetarian. Genuine Parmigiano-Reggiano, or Parmesan cheese, always uses animal rennet. For the same reason authentic traditional pesto (which uses Parmesan) is not vegetarian either.PugliaPodcastPuglia, Italy11/29/2021UNREAL!! This was my first time making a carbonara sauce and it came together flawlessly! We had a ton of mushrooms to use including a portobello cap, so I wanted to try this. I am so glad I did. I used some farm fresh eggs, the yolks were almost orange... those are the kind you want and why I realize carbonara dishes in local restaurants (here in the US) always taste just \"ok\".  Real good yolks are key!  This was outstanding and after tasting it, I couldn't believe I made this in my own kitchen. My husband waa so happy. I'm in a happy food cloud now and just had to write a review. Thank you!!! Love, beers, and cheers -- Cheeks n' LeeCourtney and ChicoLong Beach, CA8/1/2021It seems sooo delicious. I'd love to try this. My son would love it!😋\nAnonymousLondon, UK6/19/2021Followed the instructions, but added fresh truffles to take it to the next level!Gary BBeverly Hills, MI2/28/2021Made this tonight for the first time, following the recipe exactly.  It was amazing and we can't wait to make it for guests. Anonymous1/25/2021Why the salt must be a “kosher salt”? BorisCA12/18/2020So funny reading others' substitutions because we did the same thing. My teenage boys have been a hard no on mushrooms, but I told them they could either eat this or make KD for themselves...they asked for a compromise, so I added pancetta. We also used farfelle because we didn't have orecchiette and it all turned out delicious! Had a small capresse salad on the side and it was a delicious meal. Thanks for such excellent process overviews...they make me a better cook at home. karensdHamilton, ON9/29/2020Absolutely delicious! The recipe was really easy to follow (after converting the measurements to grams) and cooking the mushrooms this way added a huge depth of flavor. This method also made it really easy to temper the egg sauce so it hasn't scrambled both times I've made it. Would highly recommend.AnonymousNorth West England. 7/28/2020Sooo flavourful! Really love this. Went vegetarian 6 years ago and haven’t had carbonara since and thus definitely hit the spot! AnonymousUk6/23/2020Made the dish and happy I was able to make a carbonara sauce without the egg curdling. The dish was tasty, but I’ve never been a fan of thick pasta. But it was flavorful and it did taste good. Hubby had two helpings.MercerisAsheville, NC6/12/2020So good!!!  Just made this for my husband and I and couldn’t be happier. Time will tell if it will reheat for lunches in the coming week, but I would absolutely make it again!  Yes to fresh Parm.  I added some white wine...well, because that’s my drink of choice while cooking. :) I have to agree with the other comments about the great tips for adding the egg in, also I would suggest using a cavatelli pasta, as it was hearty and substantial.  Can’t wait to have this with braised short rib over it! AnnalysejarvisReno, NV6/1/2020Delicious recipe. I used fresh parmesan and had to use the recommended sub of red onion (who has shallots these days!). It was creamy, rich and perfect. Will definitely be making again. Don't skip the browning of the mushrooms. It really adds so much flavour.Anonymous5/27/2020Really wanted to like this recipe given the rave reviews but it fell flat for me. Flavor was very bland and one-note. Midway through eating it, I added a squeeze of lemon and red pepper flakes to give it more flavor. That said, watching the video was helpful and I'll continue to cook mushrooms this way - I just won't make the dish itself.AnonymousAmsterdam5/26/2020Explore Bon AppétitPastaCrimini MushroomMushroomVegetableButton MushroomOrecchiettePasta & NoodlesParmesanCheeseWeeknight MealsEasyMainVegetarianNut-FreeSautéLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-22", "author": ["Condé Nast", "Molly Baz"]}