{"id": "f869026b63557315830f2c97a0df2a44", "url": "https://www.bonappetit.com/recipe/grilled-brisket-with-scallion-peanut-salsa", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Brisket with Scallion-Peanut Salsa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrilled Brisket with Scallion-Peanut SalsaBy Chris MoroccoMay 22, 20184.5(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintNormally, you associate brisket with long, slow cooking—maybe on a winter afternoon—but we’re making a case for throwing it on the grill. Hear us out, because it works, especially with this peanut topping. The only thing wintry: Freezing the brisket makes it easier to slice it against the grain, which nullifies its naturally ropy texture and exposes more surface area to the flavorful marinade.Ingredients4 servingsMeat and Marinade1½lb. flat-cut beef brisket, fat trimmed to ¼\" thick4garlic cloves, finely grated¼cup fresh lime juice¼cup oyster sauce2Tbsp. soy sauce2Tbsp. dark brown sugar2tsp. toasted sesame oilSalsa and AssemblyVegetable oil (for grill)⅓cup extra-virgin olive oil⅓cup chopped raw peanuts1garlic clove, finely grated2tsp. toasted sesame seeds1tsp. crushed red pepper flakes2Tbsp. fresh lime juice2tsp. honeyKosher salt1bunch scallions (about 6), thinly sliced into matchsticks½bunch cilantro, torn into sprigsPreparationMeat and MarinadeStep 1Freeze brisket on a small baking sheet until very firm around the edges, 45–60 minutes.Step 2Remove brisket from freezer. Using a long sharp knife, slice brisket against the grain ⅛\" thick. (As the piece gets smaller, you can cut it in half crosswise to make it easier to cut.) Place inside a resealable plastic bag. Whisk garlic, lime juice, oyster sauce, soy sauce, brown sugar, and oil in a small bowl until sugar dissolves. Pour marinade over meat, seal bag, and rub vigorously to separate any meat slices that might want to stick together so the marinade can get to them. Chill at least 1 hour and up to 1 day.Salsa and AssemblyStep 3Prepare a grill for medium heat; oil grate. Cook olive oil and peanuts in a small saucepan over medium heat, swirling occasionally, until peanuts are very faintly sizzling and turn golden, 6–8 minutes. Remove from heat and stir in garlic, sesame seeds, and red pepper flakes. Let cool. Stir in lime juice and honey. Season salsa with salt; set aside.Step 4Rinse scallions under cold water; drain well. Toss in a medium bowl with cilantro.Step 5Transfer brisket slices to a large rimmed baking sheet with tongs, leaving any excess marinade behind. Lightly season with salt. Grill meat in batches until charred underneath and nearly cooked through, 1–2 minutes, then turn and grill just long enough to cook through, about 30 seconds. Transfer to a platter. Toss scallion mixture into peanut mixture and mound over brisket.How would you rate Grilled Brisket with Scallion-Peanut Salsa?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleThis is an household favorite! So easy and the flavor is AWESOME.  We serve it with crispy jasmine rice.Carly FMinneapolis, MN4/6/2021Good flavors, but brisket is tough unless cooked a very long time in my opinion, no matter how you slice it. I would try it again with a different cut of meat.SusieKansas City, Missouri1/11/2021Super skeptical about using brisket But we had a piece from Walden Local so wanted to make it a star. Amazing, couldn’t believe how tender it was. Didn’t have oyster sauce so used 2TBSP of sweet white miso as a sub. We marinaded for about 7 hours. Used a ridged cast iron griddle on the hob as the pieces were small. Fantastic char and the salsa was incredible. Salsa is a keeper!AnonymousBoston 6/15/2020Wow, there's so much flavor from the marinade and the salsa. I followed the recipe but used sirloin steak (marinated for 2 hours) based on others' reviews that brisket can be too tough, and served rice on the side as well. I don't have a grill so used a cast-iron skillet and it turned out amazing. This is an amazing dish and would be a hit at any dinner party.AnonymousAmsterdam6/13/2020Made this last night.  Followed instructions exactly.  Marinated 8 hrs.  I'd rank the marinade a 10 out of 10.  I'd rank the salsa 10 out of 10.  I'd rank the use of brisket as a negative 10.  Was tough and not eatable. Today, I'm braising the meat (long and slow) and hope it can be saved.  We both decided that using a better quality meat- even flank steak, but almost any kind of steak would be better than the brisket that is so tough to break down. St Paul MN5/12/2020Flank steak would be a tasty substitute.AnonymousVail, Colorado5/8/2020I've always thought of brisket as a tough as armor cut that you dump in soup and try not to eat, hence, I was pretty excited to try this recipe. It's a pretty easy dish however a couple things \n- Pay extra attention to cutting across the grain. I was paying more attention to just making the slices thin and thought it was good enough...the texture turned out exactly that-- good enough but not great. I still felt like there was an uncomfortable amount of chewiness to it.\n- Put some sweetness in the marinade. I don't own any kinds of sugar so I just skipped it. The meat had this slight but odd tang to it that caused me great sadness thinking about what could've been. \n- To those who were asking, pan fry is OK. Like, it was still pretty yummy and I didn't die. \n- The salsa is wonderful. It worked incredibly well with the meat.\n- I added rice to this dish and it was great. That's all. \nWhile I would probably rate the dish I made something between 3 and 4 stars bc of the mistakes, I'm really excited to remake it and even if the quality of this dish didn't improve, I'd still eat it regularly. pumpkin_knight9/4/2019Crazy crazy delicious!! Brisket was so delectable but the scallion-peanut salsa put it over the top!! And I even forgot the cilantro and it was still amazing!! Also, I had non-beef eaters in my group, so I used the marinade on chicken thighs and, of course, also CRAZY GOOD! My 3-year-old son couldn’t get enough! nerdicusWalnut, CA 7/1/2019Can you do this in a pan/oven? Asking because I don't have a grill readily available.Anonymous6/7/2019Just made this and it was so outstanding! The brisket was so tender, I was a bit skeptical at first but it really isn’t tough at all! Marinade and salsa are amazing too. I served this with some rice because I thought the salsa side wouldn’t be enough but it actually would have been enough. Take the time to slice the brisket thinly, you won’t be disappointed.nick016NYC6/4/2019Made this a few days ago. Seriously amazing flavour bomb! I pan fried it rather than grilled and used it in a melted cheese sandwich.sumi-eAustralia5/29/2019Making this tonight! Wondering how hot you recommend for the grill be?K8runDes Moines5/5/2019Hi there, is there a substitute for the oyster sauce? This looks delicious and but members of my family have shellfish allergies. Audie SullivanNorth Carolina5/2/2019Could you sub another nut like cashews for those of us with a peanut allergy?AnonymousMaine5/2/2019Explore Bon AppétitBrisketBeefMeatPeanutNutScallionOnionVegetableEasyMainDairy-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Chris Morocco"]}