{"id": "f86ac45f1159aeae292bbd26696d6778", "url": "https://www.bonappetit.com/story/nikki-giovanni-derrick-adams-revolution-repose", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Artist Derrick Adams and Poet Nikki Giovanni on Civil Rights and Relaxation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLOOK INSIDE »holiday issue 2020On Revolution, and ReposeTwo icons reflect on the connections between civil rights and relaxation.By Nikki Giovanni and Derrick AdamsDecember 1, 2020FacebookTwitterEmailDerrick Adams, ‘MLK’s Tropic Interlude,’ 2020, mixed media on paper, 8.5 x 11\"FacebookTwitterEmailArtist Derrick Adams was commissioned to create a painting to accompany the following poem by Nikki Giovanni, a civil rights icon and a leader in the Black Arts Movement. For Adams, depicting civil rights leader Dr. Martin Luther King Jr. in a state of repose was a radical yet logical choice. “When you’re dealing with oppressive structures, being able to relax is a revolutionary thing,” he says. And yet there are very few images out there of Black activists at leisure. Painted from an Ebony magazine photo of King vacationing at a Jamaican resort with his family in 1967, the piece is meant to humanize a figure so often viewed as one-dimensional. “What I’m showing here is Martin as a whole person,” Adams says. “In doing so, I’m shedding light on the type of activism that can exist today—how it can be a part of anyone’s life. People can protest and then go out to lunch with their friends after. One act doesn’t negate the other.”He believes that the juxtaposition of poem and painting helps clarify the political intent behind the work. “I like the fact that they aren’t necessarily a narration of each other but do speak to each other.” In the same way that Adams’s painting offers a multidimensional look at King, whose birthday we honor in January, Giovanni’s poem presents a candid portrait of Black life in which joy and pain, abundance and loss, revolution and repose exist simultaneously. “It’s a chance for the viewer or reader to meditate on the connection between these two objects,” Adams says. “It’s about taking a moment to look within.” —Hilary Cadigan3-1593 400 Mulvaney StreetBy Nikki GiovanniIt was a small houseIn a small neighborhoodTheir bedroom was in the front overlooking the front porchMine in the back sharing a windowInto our next door neighbor’s homeEdith White always closed the curtainsWhen darkness arrivedThe living room held a pianoWhich I never learned to playAnd a television set that I rememberBeing awakenedTo see Lena Horne on Ed SullivanThe couch was a rose color print and I still have itThough now it holds mostly my booksAnd a quilt given to me when I was diagnosedWith lung cancerOur kitchen held a pantryThat I arrangedAnd waxedUntil the mice gave upAnd went awayGrandpapa purchased GrandmotherA stove that had a deep wellA forerunner to the slow cookerThe refrigerator never held chicken eggsThey lay in a triangular dishWhich I still have with blue pinkAnd dark brown eggsWe had a back porchThat had a rollaway bed for anyonePassing throughWho needed a place to restThe dining room was special and preciousThe dining room table was covered with white laceAnd always fresh flowersIn the corner was a cake platter with a crystal topAnd in the cabinet were the Sunday dishesThat we used only when we had companyThere was a drawer holdingHer sterling silver that she had purchased oneSetting at a time I polished regularly just in caseThe Book Club or Civil Rights WomenOr even the Church Women would come byTo have Tea and discuss their next moveAgainst segregation I was in college when I got a rideHome to spend a surpriseThanksgiving with themI arrived on Wednesday and was so glad to beHomeIt was obvious Grandmother had not plannedAnything special but now I wasCompanyShe scooted across the alley to get a chickenFrom Reverend AbramsAnd my job became stringing the beansShe was up early Thursday to wringThe neck and I had to pluck the feathersWe stuffed it with cornbreadPut the green beans on with a strick of leanGrandpapa and I both loved bread puddingAnd luckily she had some stale breadNo ice cream today but a wonderful saladThat I still don’t knowHow she put togetherThe bathroom was between the two bedrooms and as I heardThe water running I knewEveryone had to batheGrandmother first with her beloved Sweetheart SoapThen she helped GrandpapaHe put his favorite tie onAnd I noticed he was moving a bit slower but I thoughtIt was all rightI bathed in the tub with fresh water and tried to lookDressed upThat evening as we three sat at the tableGrandpapa said the blessingAnd I lied about how well I was doingIn collegeMy ride back to Nashville cameThat night and I kissed them bothNever knowingThat would be our Last ThanksgivingHe went to Heaven three months laterI have never bathed sinceI received a call: Call your GrandmotherAnd the only telephone number I remember even nowIs 3-1593.I knew when I dialed he was goneAnd all that I knew of loveWould also be buriedPoet and activist Nikki Giovanni is a National Book Award finalist, Grammy nominee, and University Distinguished Professor at Virginia Tech. She’s won the Langston Hughes Medal, seven NAACP Image Awards, and been named one of Oprah Winfrey’s 25 Living Legends.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Nikki Giovanni", "Derrick Adams"]}