{"id": "f87b5559c6c8b7d920058d689d2016ba", "url": "https://www.bonappetit.com/recipe/dashi-oats-with-crunchy-veg", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "Dashi Oats With Vegetables Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDashi Oats With Crunchy VegBy Sohla El-WayllyDecember 1, 20195.0(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintInstant dashi powder gives so much savory umami flavor to the oats that this porridge can easily be served for dinner. Bright and crisp vinegar-dressed cucumbers and radishes add colorful contrast, but feel free to sub any other crunchy vegetables you have on hand.Ingredients4 servings5red radishes, thinly sliced2Persian cucumbers, thinly sliced2Tbsp. black vinegar or unseasoned rice wine vinegarKosher salt12scallions, divided¼cup (½ stick) unsalted butter2garlic cloves, thinly sliced1Tbsp. finely grated peeled ginger (from one 1\" piece)1cup steel-cut oats4tsp. instant dashi powder (we like Ajinomoto)4tsp. chili oil or your favorite hot sauce¼cup coarsely chopped roasted salted peanutsPreparationStep 1Toss radishes, cucumbers, and vinegar in a medium bowl; season with salt. Gently massage vegetables with your hands to soften. Let marinate until ready to use.Step 2Thinly slice 8 scallions. Melt butter in a medium pot over medium heat until foaming. Add garlic, ginger, and sliced scallions and cook, stirring often, until tender and golden, 8–10 minutes. Stir in oats and cook, coating the grains in the aromatics, until warmed through, about 2 minutes. Add dashi powder and 5 cups water. Increase heat to high and bring to a boil, then reduce heat to medium-low and cook, stirring occasionally, until oats are tender and liquid is thick and creamy, 30–35 minutes.Step 3Slice remaining 4 scallions on a diagonal and toss with pickled vegetables.Step 4Divide oats among bowls. Arrange crunchy veg on top and drizzle with any liquid that remains in bowl. Drizzle with chili oil and top with peanuts.How would you rate Dashi Oats With Crunchy Veg?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleI'm mostly reviewing to tell you that I used old fashioned rolled oats and they worked just fine! Did some improvising and added some kimchi and a couple soft boiled eggs and it was quite delightful. This is for sure going to be a go-to dinner for me from here out, so easy and so good!SamuelWashington2/9/2021I don’t like most oatmeal, but this was great. I used furikake as the topping with chili sauce. Burley BarnettTexas3/22/2020This was so amazing! we used black vinegar and I thought it was going to be over powering but it wasn't. such a nice flavor to cut through the richness! We had this a full meal so as suggested in the comments we added a soft boiled egg (definitely a must!) This recipe has made it into our top 10 dinners!AnonymousChicago1/23/2020I would die for Sohla. Made this several times already, sometimes getting lazy and going without the pickle. While it's great without, the pickles really add that perfect sparkle. Love how it's ingredients I usually have on hand combined just the right way. Add an egg, soft boiled or poached with the oats, for a beautiful day.AnonymousVancouver, Canada1/15/2020I was hesitant to try a savory oatmeal, but this was fantastic. The crunch and vinegar of the veg really brought it together.AnonymousDenver, CO12/10/2019Unbelievably flavorful and comforting. I'll be eating this all winter.AnonymousScottsdale, AZ12/10/2019Sohla! This was sooo good, like omg. Thank you. Up until now, I was kinda afraid of savoury porridge (dunno why, love congee, love sweet porridge, love em all), but this recipe made me curious and now I love it. This will become a part of my regular dishes to cook. IWriteReviewsNotTragedies12/9/2019I am very glad that I was able to get over the idea of a savory oatmeal.  I followed the recipe exactly as written and wouldn’t change a thing. This was absolutely delicious.  It was mind expanding. solsrSanta Cruz, California 12/6/2019Just made it with buckwheat groats instead of oats, worked wonderfully. Thanks for the non-traditional combination tip! I kind of want to add dashi in everything now.AnonymousEstonia12/4/2019Explore Bon AppétitPorridgeOatRice & GrainsRadishVegetableCucumberMainHealthyishSimmerBreakfastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-01", "author": ["Condé Nast", "Sohla El-Waylly"]}