{"id": "f889b85e0d71b96bfab7014a9deecbba", "url": "https://www.bonappetit.com/recipe/stuffed-quahogs", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Stuffed Quahogs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueStuffed QuahogsBy Betsy and Kristine LarsenApril 14, 20205.0(3)Read ReviewsTriangleEmailPinterestPrintPhotographs by Elizabeth Cecil, food styling by Danielle PattavinaEmailPinterestPrintEmailPinterestPrintThese buttery breadcrumb-stuffed clams taste like summer. Quahogs (large hard-shell clams) can be tricky to find out of season. If you can’t track them down, use topnecks (the same species, just smaller) instead. This recipe is from Larsen’s Fish Market, a tiny little seafood shack in the tiny little fishing village of Menemsha, Martha’s Vineyard.IngredientsMakes 12-1610lb. quahog or topneck clams, scrubbed8oz. stale soft white sandwich bread, torn into 1\" pieces (about 7 cups)1green bell pepper, ribs and seeds removed, coarsely chopped1red bell pepper, ribs and seeds removed, coarsely chopped1small onion, coarsely chopped6Tbsp. unsalted butter, divided¾tsp. kosher salt, plus more1tsp. crushed red pepper flakesPaprika and lemon wedges (for serving)PreparationStep 1Pour water into a large pot to come 1\" up sides; bring to a simmer. Add clams, cover pot, and steam until clams have opened, 8–11 minutes (discard any clams that don’t open). Drain clams and transfer to a colander. Rinse under cold running water to cool and remove any remaining grit. Remove clams from shells. Reserve 6 shells if using quahogs and 8 if using topnecks; discard remaining shells. Break shells at the hinge to separate sides.Step 2Meanwhile, pulse bread in a food processor until fine crumbs form. Transfer breadcrumbs to a large bowl; wipe out food processor. Pulse clams in food processor 3–4 times to coarsely chop. Add to breadcrumbs. Wipe out food processor again and pulse bell peppers and onion until finely chopped.Step 3Melt 4 Tbsp. butter in a large heavy pot over medium heat. Add bell pepper mixture and ¾ tsp. salt and cook, stirring often, until vegetables are very soft, 10–12 minutes. Add red pepper flakes and cook, stirring, until fragrant, about 1 minute. Add vegetable mixture to bowl with breadcrumb mixture and mix well; season with salt. Let stuffing cool.Step 4Position a rack in middle of oven; preheat to 450°. Melt remaining 2 Tbsp. butter in a small saucepan over medium-low heat. Fill each half shell with a generous heap of stuffing; arrange on a rimmed baking sheet. Brush with butter and bake until hot and beginning to turn brown in spots, 8–10 minutes.Step 5Sprinkle clams with paprika and serve with lemon wedges for squeezing over.How would you rate Stuffed Quahogs?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleDeee-lish!A cook from BuffaloBuffalo, NY11/2/2021Explore Bon AppétitNew EnglandAmericanClamShellfishSeafoodBell PepperVegetableSummerStarterNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Betsy", "Kristine Larsen"]}