{"id": "f88ddb6ea6078efa5407954438cf4351", "url": "https://www.bonappetit.com/story/riedel-vinum-water-glasses", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "My Favorite Wine Glasses Are Actually Riedel Water Glasses | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Favorite Wine Glasses Are Actually Water GlassesA newer, saner era of sensible drinking vessels has arrived.By Amiel StanekMay 14, 2019FacebookTwitterEmailFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I will freely admit that I think about glassware a LOT more than most people do, or frankly should. And with that out of the way, I can say that the last decade or so has been an...interesting time for restaurant glassware in NYC, particularly in the wine department. Here is my condensed, completely unresearched, likely apocryphal history.First, the economy collapsed, and the kind of fancy, varietal-specific stemware stocked by any establishment serious about wine went out of fashion, ushering in the era of those bulbous, god-awful stemless things. Then came the too-cool-for-wine-glasses period, where classic stackable Duralex tumblers and thin-walled CB2 bodega glasses reigned supreme. (So millennial!) This was followed by the return of the Unfussy Stem. It seemed like every bar manager in the city took a pilgrimage to the natural wine bars of Paris and started stocking the kind of diminutive, narrow-bowled tasting glasses popular with the Glou Glou Illuminati. And then Frenchette, Riad Nasr and Lee Hanson’s celebrated TriBeCa neo-bistro and natty wine mecca, opened. And I witnessed the dawn of a newer, saner era.I remember very distinctly my first encounter with Frenchette’s striking glass of choice. The bowl was delicate but not overly so—narrower than that of your average red wine goblet, but proudly top-heavy perched atop a squat stem. It was also capacious enough for a bit of swirling and sniffing but not so big as to demand it; the glasses split the difference between the towering, pretentious-seeming chalices preferred by my parents’ generation and the anarchic pét-nat delivery vehicles favored by my own. After several visits to the restaurant, enjoying everything from rich, lusty reds to fizzy oranges to Champagne out of the same vessel, I finally got around to asking Jorge Riera, Frenchette’s ever-present wine director, where they came from.“Oh those?” he said, “Those are just Riedel water glasses, man.”No shit! Elegant without being intimidating, different without being obtuse, and a true pleasure to both behold and hold, I realized that the wine glass we’ve been Goldilocksing our way toward for the better part of 10 years was not actually a wine glass at all. I placed an order for a set of six before I had even left the restaurant. The time is now: One glass to rule them all.Buy it: Set of 2 Riedel Vinum Water Glasses, $30 at amazonExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-14", "author": ["Condé Nast", "Amiel Stanek"]}