{"id": "f89ca1f7b33e78f008fb9ab78f6dc9a2", "url": "https://www.bonappetit.com/recipe/braised-chicken-thighs-with-olives-and-herbs", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Braised Chicken Thighs With Olives and Herbs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueBraised Chicken Thighs With Olives and HerbsBy Carla HallFebruary 8, 20224.6(16)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintThese fall-off-the-bone tender chicken thighs from chef Carla Hall are ideal for any night of the week (especially since they’re made in one skillet). Hall starts with her Smoked Paprika and Sun-Dried Tomato Potlikker as a rich, smoky flavor foundation, then adds Kalamata olives, lemon zest, and fresh herbs for bright, uplifting notes. Making the Smoked Paprika and Sun-Dried Tomato Potlikker is a crucial step here, so be sure to read through that recipe first.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Straight-Sided Skillet$290 $199 At AmazonInstant-Read Thermometer$35 At ThermoworksTongs$13 At AmazonWooden Spoon$6 At AmazonIngredients4 servings4–6bone-in, skin-on chicken thighsKosher salt, freshly ground pepper1Tbsp. extra-virgin olive oil2medium onions, thinly sliced6garlic cloves, smashed1cup canned diced tomatoes1cup Smoked Paprika and Sun-Dried Tomato Potlikker1tsp. crushed red pepper flakes⅓cup pitted Kalamata olives, halved¼cup coarsely chopped oregano¼cup coarsely chopped parsley2tsp. finely grated lemon zestPreparationStep 1Pat chicken dry with paper towels; season with salt and pepper on both sides.Step 2Heat oil in a large skillet over medium-high. Arrange chicken, skin side down, in skillet and cook, undisturbed, until skin is crisp and golden brown, 8–10 minutes. Turn chicken over and cook on other side until golden brown, 5–7 minutes. Using tongs, transfer chicken to a plate, leaving fat behind.Step 3Add onions and garlic to skillet. Cook, stirring often, until onions are translucent and beginning to brown at the edges, 6–8 minutes. Reduce heat to medium-low and stir in tomatoes. Cook, stirring occasionally, until mixture is jammy, 5–7 minutes. Stir in potlikker and red pepper flakes, season with salt and pepper, and bring to a simmer.Step 4Return chicken to skillet, arranging skin side up. Cover skillet and simmer until chicken is tender and cooked through (an instant-read thermometer inserted into the thickest part of thighs should register 165°), 15–17 minutes.Step 5Uncover skillet; scatter olives, oregano, parsley, and lemon zest over chicken.How would you rate Braised Chicken Thighs With Olives and Herbs?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleWonderful! Thank you, Carla! AnonymousHawaii3/6/2022This was really tasty and super easy! I made the potlikker a few days ago while I was cooking something else so everything came together quickly. I only needed to braise them for 12 minutes before I got an internal reading of 165 but otherwise it was a perfect recipe. Throw some more pepper flakes in if you like a kick-- I always use Aleppo. LuluPittsburgh2/25/2022The recipe looks amazing, however, for the final covered simmering isn’t the chicken likely to lose its crispy skin? Could it not be finished uncovered in the oven or uncovered on top? I guess the key is just getting it to 165°…KipToronto 2/23/2022Wonderful!AnonymousBeavercreek, OH2/18/2022Explore Bon AppétitDinnerEasyWeeknight MealsGluten-FreeDairy-FreeNut-FreeChicken ThighChickenPoultryOliveOther IngredientsBraiseMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Carla Hall"]}