{"id": "f8a3e386fafaa551ed0dce05d53a210f", "url": "https://www.bonappetit.com/story/spelt-flour", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "What is Spelt Flour, the Whole Wheat Flour That's a Good Substitute For All-Purpose? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSpelt Flour Is Like All-Purpose Flour But With One Huge AdvantageIt actually tastes like something!By Alex BeggsMarch 24, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailIf you are BORED, if you are ANTSY, if you are in a RUT, or if you're looking for low-risk ways to change things up in the kitchen, how about a bag of spelt flour?What is it though?Spelt is a type of wheat, and spelt flour is a type of whole wheat flour made from the entire grain (bran, endosperm, germ, and all). I know, you tried whole wheat flour once, the pie crust came out dry and the banana bread was dense. But that was probably hard red wheat, which is higher in protein and more finicky than spelt. You see, each type of wheat has its own properties and flavor. In the wide world of whole wheat flours, spelt performs the closest to all-purpose white flour while bringing a lot more flavor.“Spelt is perhaps the best-known ‘ancient’ wheat” Roxana Jullapat writes in her fabulous new cookbook, Mother Grains. In it, she calls spelt a “gateway grain” because it’s easier than other wheats (...elusive einkorn) to find in big grocery stores—Bob’s Red Mill makes one. Jullapat gets hers from her local mill, Grist & Toll. I got mine from a local Ann Arbor hippie co-op, out of a bulk bin. We both store our spelt flour and other whole wheat flours in the fridge, where they’ll last longer. (Long story short: Whole wheat flours, ground up with their outer grain layers, are fresher and prone to going rancid. White flour has been stripped of those outer layers and is more shelf-stable.)Our buddy, spelt flour.\nPhoto by Emma FishmanWhat does it taste like?I made crispy spelt flour chocolate chip cookies this week (recipe from Mother Grains) that had a flavor similar to deeply golden-brown toast. I can’t stop eating them.“Spelt has a little bit of an acidic note, almost yogurt-like,” Jullapat said. “That acidity can range, in an I'm alive kind of way. It also has a very mineral feel to it. You almost taste a little saltiness, a little bit of iron. I’ve definitely described it as the taste of running through a dusty field.”Can you tell she’s spent a lot of time with spelt? When I baked Jullapat’s blueberry muffins, I tasted a hint of pecan and bran from the spelt flour, subtle but present. It made me realize how neutral and flavorless all-purpose flour is. Boring, even! But was I tasting a lactic, yogurt-like fermented note? A hint of salt? Or am I tasting that because I’m searching for it? I guess you’ll have to bake with it and see for yourself.Is it better for you?Whole wheat flour is made of wheat that’s ground up with its outer layer, a.k.a. the bran, which is where the B vitamins, fatty acids, protein, minerals, and fiber are. Since those layers are removed before white flour is ground, you’re getting more nutrients when you eat whole wheat flour. Are we talking HUGE benefits? Not really. (Try spinach.) It’s a small amount when you get down to the single-cookie serving, but I’ll take my fiber wherever I can get it.How—and what!—to bake with spelt flour“Spelt adds a pleasant grainful flavor” to whatever you’re baking, said Jullapat. “It’s very compatible with an array of flavors, from blueberries and peaches to brownies. You’ll get very similar results as baking with all-purpose flour but spelt adds more oomph—I want to say body. A little bit more texture, but also a little bit more dimension to your baking.”Use it as a direct 1:1 substitute for all-purpose flour in cakes, muffins, and cookies, as well as fruit desserts like crumbles and crisps. In buns, pretzels, and breads, however, you’ll have to play around, balancing it with all-purpose, to get the right rise and texture because spelt forms less gluten than white flour. It’s not gluten-free, though, which is why it works so well to create a fluffy, tender crumb.If you’re still nervous about going off-recipe with your spelt flour, do like Claire Saffitz does in her spelt croissant recipe in Dessert Person and swap in a small amount of spelt flour, keeping the majority of the recipe AP (say, 25 percent spelt, 75 AP). You might notice a subtle flavor difference (I didn’t), but more likely you’ll just notice the brown flecks, which makes your baked goods look wholesome and rustic. And who’s to say they aren’t?It's better with spelt:Blueberry Spelt MuffinsThe classic blueberry muffin gets a makeover with nutty, whole-grain spelt flour in the batter and the crispy streusel topping.View RecipeExplore Bon AppétitFlourBasically BakingSpeltRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-24", "author": ["Condé Nast", "Alex Beggs"]}