{"id": "f8a6c1413cac703ad54ed6b22c83872f", "url": "https://www.bonappetit.com/recipe/charred-eggplant-with-spicy-tomato-sauce", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Charred Eggplant With Spicy Tomato Sauce and Peanuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueCharred Eggplant With Spicy Tomato Sauce and PeanutsBy Rachel GurjarJuly 6, 20214.3(10)Read ReviewsTriangleEmailPinterestPrintPhotograph by Yudi Ela, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThis spicy sauce, based on the chile-based Thai condiment nam prik, uses charred tomatoes to add smoke, which complements the eggplant’s silky texture. Pick an eggplant that feels light and airy (it likely has fewer seeds and more flesh, which means maximum creaminess); you can score the cut sides before placing on the grill to decrease the cooking time. —Rachel GurjarAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCharcoal Grill$98 $82 At AmazonBlender$32 At AmazonHeat Resistant Leather Gloves$22 At AmazonStainless Steel Skewer$5.89 At AmazonIngredients4 ServingsSauce1shallot, unpeeled, halved4garlic cloves, skin on4small tomatoes (about 1 lb.)½bunch cilantro, tough stems trimmedJuice of 1 lime3green Thai chiles3Tbsp. fish sauce1tsp. dark brown sugarEggplant and assembly6Italian eggplants, halvedExtra-virgin olive oil (for drizzling)Kosher salt½cup unsalted dry-roasted peanutsThinly sliced serrano chiles and coarsely chopped cilantro (for serving)Special equipmentA metal skewerPreparationSauceStep 1Prepare a grill for medium indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Thread shallot and garlic onto a metal skewer. Arrange skewer and tomatoes on grate over direct heat and grill, turning halfway through, until skins are blistered and charred and flesh is slightly tender, 10–12 minutes per side. Transfer skewers and tomatoes to a large plate; remove skins from shallot and garlic.Step 2Combine tomatoes, shallot, garlic, cilantro, lime juice, chiles, fish sauce, and brown sugar in a blender and blend to a coarse sauce. Transfer to a bowl.Eggplant and assemblyStep 3Place eggplant, skin side down, on a rimmed baking sheet. Drizzle with oil and season with salt. Turn over and drizzle with oil and season with salt again.Step 4Place eggplant, cut side down, on grate over indirect heat. Cover and grill until slightly golden brown and flesh is tender, 18–20 minutes. Move eggplant over direct heat (still cut side down) and grill until cut sides are charred, 8–10 minutes. Transfer to baking sheet and arrange skin side down. Slightly mash flesh with a fork or butter knife.Step 5Arrange eggplant on a platter. Drizzle tomato sauce over, and top with peanuts, chiles, and cilantro leaves.How would you rate Charred Eggplant With Spicy Tomato Sauce and Peanuts?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleLove eggplant and this is a easy and delicious recipe to make.AnonymousToronto Ontario Canada8/31/2021wonderful texture and flavor my husband loved it too.  Good for meatless Mondays!AnonymousPinckney, Michigan8/5/2021For the love of God!!! Veggie Bob!!!! I don't know what Catholic religion you were brought up in or taught but never did or do the Catholics think FISH is VETIGETARIAN!!!!  Fridays and some of the other religious days were meant to be MEAT free NOT FISH free or vegetarian!!!\nThis is a wonderful recipe, get excited again Veggie Bob and omit the FISH SAUCE and substitute Braggs  Aminos!!!! \nChill DUDE!!!\nOh yeah we all make mistakes :)AnonymousPinckney, Michigan8/5/2021This is in the current July 2021 issue of the magazine. I'm a vegetarian; I love eggplant. So I read it with a level of excitement. Then it struck me:\n\n3 Tbsp. fish sauce\n\nThis is not a vegetarian ingredient. Fish is not \"vegetarian\" no matter what your Catholic upbringing may tell you (that's the only source of the idea that fish is vegetarian I know of). If you're going to write recipes for a vegetarian article then make sure they are, indeed, vegetarian.Veggie BobSan Francisco, CA7/16/2021Explore Bon AppétitThaiSoutheast AsianAsianEggplantVegetableTomatoThai ChileChileCilantroHerbs & SpicesPeanutNutSummerSideDairy-FreeGluten-FreeKetoGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Rachel Gurjar"]}