{"id": "f8b09275e1f7ba6d49c53182dc37f4cd", "url": "https://www.bonappetit.com/story/all-about-poha", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "Indian Poha 101: How to Buy and Cook With Poha | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere’s No Need to Ask Me What’s for Breakfast—It’s Always Kande PohePoha is the flattened rice that cooks up fast.By Annada RathiSeptember 2, 2020FacebookTwitterEmailPhoto and Food Styling by Matt Taylor-Gross FacebookTwitterEmailPoha, a staple in many Indian pantries, is rice that’s parboiled, flattened, and dried. White, flat, and similar in looks to cornflakes, poha, which comes in thick and thin varieties, is tasteless. But grains of thick poha, when hydrated, become fluffy and absorbent, qualities that lend well to, well, pohe or poha, the eponymous name of a hot breakfast dish popular in Western and Central India.Thin poha, on the other hand, are dry-roasted or deep-fried for chivda, a beloved dry snack with countless varieties. Chivda is cooked in homes for Diwali, sold on handcarts by small vendors, or packaged in attention-grabbing vacuum-sealed bags by processed food companies throughout the country.In the eastern states of Assam and Odisha, thick poha is served with yogurt or milk and sweetened with jaggery, sugar, or banana. In West Bengal, another eastern state, a savory preparation called chirer polao, which is loaded with vegetables, is common.Any discussion about poha is incomplete, however, without mention of Indori poha, a sweet and spicy dish from Indore, a city in the central state of Madhya Pradesh. The real draw of the Indori poha is the eye-popping toppings: Diced onions, tomatoes, roasted peanuts, lime juice, and cilantro are followed by pepper- and clove-spiced sev, pomegranate seeds, and boondi, deep-fried chickpea flour balls the size of corn kernels. It’s a feast of flavors and textures.And in my house, there’s no need to even ask what we should have for breakfast. The answer is always poha, by which my husband means kande pohe. Kande pohe is a savory, spicy, and cherished breakfast or snack in Maharashtra in western India, and variations abound in many states (it is India, after all). The dish consists of kande, which means “onions” in Marathi, the language of Maharashtra (where Mumbai is located), and poha. The two are cooked together in the omnipresent tadka along with peanuts, then garnished with grated coconut and chopped cilantro. Last week I timed myself making it—from getting the poha out of the pantry to chopping the onions to plating, the recipe clocked in at a cool 21 minutes.Kande pohe also has deep cultural significance. In Maharashtra, when a boy and girl meet with the prospect of marriage in mind, protocol dictates that kande pohe and tea must be served. Over the years, this juxtaposition has become so tight that this meeting itself is called kande pohe. Some even muse that if kande pohe had not been invented, this state would have no weddings. Suffice to say, Maharashtrians love their kande pohe. (There is even a hit song titled “kande pohe” from a popular Marathi movie that equates kande pohe to the vicissitudes of life.)A quick, easy, hot dish that requires only pantry ingredients, kande pohe is a favorite of hosts, a throwback to the days when it was not uncommon for guests to drop in without prior notice. By the time the initial chitchat was over, piping hot poha, with a visually delightful garnish of fresh grated coconut and cilantro, would be served amid oohs and aahs (alongside steaming tea).This is how you make it:Pour 1½ cups thick poha into a colander and run poha under water, making sure all of the poha get wet. This is the only tricky part of the recipe—you want to make sure every grain is soft, fluffy, and distinct. (Don’t be tempted to use thin poha: When thin poha is hydrated, it turns into soggy mush.)Let the water drain from the colander completely, then set the poha aside to hydrate. After five minutes, if you find that the soaked poha grains are not soft and fluffy, splash them generously with water and set aside for another 10 minutes. (This may happen if the poha is too old.)Next, heat 2 Tbsp. neutral oil in a heavy-bottomed skillet. Add one mustard seed to the oil. If it starts popping and dancing as soon as it hits the oil, the temperature of the oil is ready. If not, wait and perform the test again with another mustard seed. Add ¼ tsp. black or yellow mustard seeds and ¼ tsp. cumin seeds. As soon as the seeds stop popping and dancing, add ¼ tsp. ground turmeric and ¼ cup raw peanuts.Stir the peanuts till they become dark brown in color, 2–3 minutes, then fish out with a slotted spoon and transfer to the colander with the soaked poha. Add 5–6 curry leaves, 1 red Thai chile, sliced, and ½ cup finely chopped red or yellow onion to the pan. Sauté till the onion is light brown.With the rest of your curry leaves, make dahi toast.\nAdd the soaked poha to the pan along with ½ tsp. salt, 2 pinches sugar, and 1 tsp. lime juice. Stir well, then cover with a lid for about 5 minutes, until all of the poha grains look homogenous and yellow. Turn off the heat and serve hot with ¼ cup freshly chopped cilantro and ¼ cup fresh or frozen and thawed grated coconut. And don’t forget ginger masala chai to go with.I prefer to make poha for breakfast when I know I’m going to have a long, hectic day at work and may not have the chance to eat until dinner. Poha by itself is a respectable light lunch too. Prepare it in the morning and eat it for lunch by microwaving with a splash of water. It will be as good as fresh. You can always make bulked-up versions with potatoes and peas, but my heart is with kande pohe. Be it weekday or weekend, 21 minutes from pantry to plate adds to the appeal. Please report back if you break my record.Annada Rathi is a food writer interested in highlighting the glory of Indian flavors. She has written for Food52 and Tenderly.Explore Bon AppétitIndianBreakfastRead MorecookingI’ve Been Making Roti Jala Since I Was 10. You Can TooBy Mehreen KarimcookingNimbu Pani is What I Drink When I Feel Like a Human FurnaceBy Nayantara DuttacookingI'll Take a “Chaat Treatment” Over a “Spa Treatment” Any DayBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-02", "author": ["Condé Nast", "Annada Rathi"]}