{"id": "f8c04c691f9bd2bb29854dc45cb03d15", "url": "https://www.bonappetit.com/recipe/chocolate-cashew-chia-pudding", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Chocolate-Cashew Chia Pudding Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChocolate-Cashew Chia PuddingBy Molly BazDecember 26, 20184.5(48)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis chia pudding is delicious on its own—and even better when layered with maple yogurt as a parfait. Leftover maple yogurt can be repurposed for breakfast and topped with fruit and granola. It’s a choose-your-own-adventure kind of dessert. This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right.Ingredients4–6 servingsChia Pudding7oz. Medjool dates (about 13), pitted3cups cashew milk⅔cup raw cashews3Tbsp. cocoa powder2tsp. vanilla extract1½tsp. kosher salt1tsp. ground cinnamon½cup white chia seedsMaple Yogurt and Assembly2cups whole-milk or coconut yogurt¼cup pure maple syrup, plus more for servingFlaky sea saltGround cinnamon (for serving)PreparationChia PuddingStep 1Blend dates, cashew milk, cashews, cocoa powder, vanilla, salt, and cinnamon in a blender on high speed until very smooth, about 1 minute. Transfer date milk to a quart-size jar or resealable container. Stir in chia seeds. Cover and chill at least 6 hours.Step 2Do Ahead: Chia pudding can be made 5 days ahead. Keep chilled.Maple Yogurt and AssemblyStep 3Stir yogurt and ¼ cup maple syrup in a medium bowl. Transfer to a quart-size jar or resealable container (or reserve yogurt container and use that!).Step 4To serve, alternate layering a few spoonfuls of chia pudding and maple yogurt in a small ramekin or 8-oz. glass. Drizzle with maple syrup and sprinkle with sea salt. Dust with cinnamon.Step 5Do Ahead: Maple yogurt can be made 5 days ahead. Chill.How would you rate Chocolate-Cashew Chia Pudding?Leave a ReviewTell us what you thinkReviews (39)Back to TopTriangleI’m glad I gave this recipe a try! I’ve made a lot of disappointing chia puddings in the past. This one is incredible, both flavor and texture. It tastes even better with the yogurt, I will be making this regularly. I did reduce the amount of dates, salt, and maple syrup in the yogurt. AnonymousNew York1/2/2022Fabulous for a dessert or brunch. I first followed recipe as is and was far too salty. I then used 1/3 the salt and it was perfect. I had only black chia seeds and it was fine. A big hit for all!  SallyLos Angeles9/11/2021Thank you so much!  it was delicious.  I'll make this over and over. SoosChesterfield, MO8/8/2021The kind of dessert you can eat every night of the week and not feel too bad about indulgingAnonymous10/7/2020LOVE this recipe. The combo with yogurt is SO GOOD. The only thing i'd change is, making this half recipe. I live alone and could not finish the whole recipe in 4-5 days. AnonymousSan Francisco8/24/2020I will make this pudding again today but with less salt. Otherwise - tasty and rich flavor, but totally agree that salt should be reduced. I made it without yogurt, just the chocolaty part. Nice and rich morning treat.lolitapuLatvia, Riga8/3/2020I will make this pudding again today but with less salt. Otherwise - tasty and rich flavor, but totally agree that salt should be reduced. I made it without yogurt, just the chocolaty part. Nice and rich morning treat.Anonymous8/3/2020I made this today, it is delicious but I will cut back on the salt next time it is a little too strong. Quite easy to make and will last me a few days.AnonymousLondon5/24/2020This is good! The pudding on its own is a nice, but mixing it with the yogurt, maple syrup, and flakey salt really takes it to the next level. I held back on the salt and think that was the right decision; I find it plenty sweet-salty with just 1/2 tsp. I used black chia seeds and don't think it had any negative effect.AnonymousNew York2/27/2020I’ve seen a few people talking about overly-salty pudding. I was worried about this, too. I bought unsalted cashews and I think that helped? Overall I really enjoyed this recipe. I’ve never had dates before but it turns out I like them! I’m trying to find healthier alternatives to sweets, this is one I will definitely make again. AnonymousRhode Island1/13/2020This chia pudding portion is too salty. I love Molly’s recipes but this one was very weird when it came to salt to sweet ratio. I added honey after the fact and it still didn’t cut the saltiness. Cut your salt on it, add a little at a time! AnonymousIrvine, Ca1/7/2020This pudding was dank! Super delicious but not over-indulgent.airusk12/9/2019I love this recipe, made it for my friendsgiving potluck.Anonymous12/9/2019LOVED THIS. It felt sweet, indulgent, filling, but not overly heavy or cloying. I made my own cashew milk to start, then blended everything together. Those who had trouble with crunchy pudding: Blend your chia seeds into the rest and add a little extra milk. I personally didn't but I love chia pudding. AnonymousBellingham, WA10/14/2019My white chia seeds did not soften. Pudding should not be crunchy. Very disappointing. Should I have heated milk? Anyone else have this problem. Upset I had to throw it out. Salt was not a issue.AnonymousBraintree Ma10/2/2019Explore Bon AppétitPuddingDessertChiaSeedCashewNutCocoaOther IngredientsYogurtDairy-FreeGluten-FreeVeganHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "Molly Baz"]}