{"id": "f8d99c8ec4eba9683b8d2715bb5025ae", "url": "https://www.bonappetit.com/story/baking-steel-griddle", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "The Baking Steel Griddle Turns Your Crappy Stove Into a Diner-Style Flattop | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Baking Steel Griddle Turns Your Crappy Stove Into a Diner-Style Flattop For lovers of pancakes, omelets, hash browns, grilled cheese, etc., etc., etc.By Jarrett MelendezMay 21, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.One of my first kitchen jobs was working as a line cook in a local diner in my hometown of Bucksport, Maine. My favorite days were when I was in charge of the “grill”—actually a big steel flattop—that was the heart of the kitchen. I still remember the rush of Sunday brunches: hash browns crisping in the upper left, a scramble, an omelet, and as many fried eggs as you could fit in the lower left, pancakes and French toast browning in the center, and bacon, sausage, and corned beef hash sizzling away on the right.Between meals we’d scrape it down with a bench scraper, oil it, and get ready for lunch and dinner, during which we’d cook burgers, chop up shaved steak with mushrooms and onions for cheesesteaks, toast buttered buns and rolls, and make grilled cheese sandwiches, among an unseemly amount of other diner fare. I loved the versatility, the multi-zone heating, even the bang and clang of metal spatulas at work on its perfectly seasoned surface.It’s my goal to have one installed in whatever kitchen I end up building with my partner in our forever home. In the meantime, while I’m still at the mercy of landlords and whatever stoves they choose for our apartment, I’ve found a pretty good substitute: the Baking Steel Griddle.Baking Steel got its start in 2013 when Andris Lagsdin combined his two passions—food and steel—to create a pizza “stone” made of solid metal. It was well-received by home cooks and seasoned pros alike—so much so that Lagsdin expanded his offerings to include different size steels, and, in 2015, a combo griddles, which consists of a griddle with grease grooves on one side and the original baking steel surface on the other. It’s the perfect home cook–friendly substitute for an actual flattop.A short(ish) list of things I’ve made on my Baking Steel includes the majority of my old diner hits—omelets (made by pouring three well-beaten eggs on a very wide, long ripping hot surface, sprinkling with fillings, and rolling up using a thin, metal spatula, all in under a minute), smash burgers, grilled cheeses, Philly cheesesteaks, pancakes, countless fried eggs, and corned beef hash. I’ve also used it to make fresh tortillas, flatbread, and English muffins. Quails, cooked six at a time, and Wagyu steaks have even made appearances. I’d be remiss, of course, if I didn’t mention that I have flipped it over and put it in the oven to make some of the crispiest pizza I’ve ever been able to make at home.I’ve had the chance to test all three griddles Baking Steel offers. The Mini, a single burner griddle, is pretty great for folks with smaller kitchens or who typically cook for one or two people. The Skinny and the original model are fairly comparable—they both cover two burners, but the Skinny is a little narrower than the original, which is slightly more square and has a larger cook surface. For me, my kitchen, and the number of people I typically cook for, the Skinny is exactly what I need, but I love having the original for whenever I’m able to start cooking for bigger crowds.I got my first Baking Steel griddle in August 2020, and it hasn’t moved from its spot on my stove since then, apart from the occasional deep clean in the sink, pizza nights, and the handful of times I’ve used it on the grill. I don’t know when I’ll ever get my coveted flattop, but given the amount of time I’ve already spent cooking with my Baking Steel, I’m not really in a rush anymore.Photo by Isa ZapataThe Skinny Griddle$179 at Baking SteelJarrett Melendez is a graphic novel writer and former cook living in Boston with his partner, Stuart, and their collection of plush pigs.Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-21", "author": ["Condé Nast", "Jarrett Melendez"]}