{"id": "f8e55d037c15eb1b8b56162a2a4a8dd6", "url": "https://www.bonappetit.com/story/dallas-texas-city-of-the-year-2019", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Dallas, Texas, Is the 2019 Restaurant City of the Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopbest-new-restaurantsDallas, Texas, Is the 2019 Restaurant City of the YearFrom the rich bowls of boat noodles to the crazy charcuterie boards to the spicy strawberry sotol, one thing is clear: Texas’ oft-skipped food destination is no longer skippable.By Hilary CadiganSeptember 12, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmail“We’ve always been looking over our shoulders at Houston,” says the first guy I meet in Dallas, his tone dramatic. “But not anymore!” And it’s true. Though Dallas and its food scene have long been overlooked in favor of other Texas towns, today, the city's in the midst of a renaissance, with excellent new restaurants and bars opening so fast and so furious that it's hard to keep up. (Seriously—I was last there in mid-June and already feel like I'm behind.)It's not just one person or one thing that's driving the change, but rather Dallas' community of highly ambitious chefs, hailing from all different backgrounds, working independently and yet with a palpable sense of synchronicity. These chefs are ditching the large-scale restaurant group models of yesteryear and instead forging their own paths, creating highly specific, highly personal spaces that feel more like stepping directly into said chef's brain. See: Donny Sirisavath's artful yet technically pristine riffs on the Laotian food he grew up eating at Khao Noodle Shop, or Misti Norris's butchery-and-fermentation playground at Petra and the Beast—both of which made our Top 50 list this year. Meanwhile, the confluence of strong immigrant communities that dot and surround the city mean that while you may have to drive a bit for your fresh-baked Iraqi bread or your Jalisco-style flautas or your perfect gas station momos, you'll never have to go without.I was actually born in Dallas, but until this past summer hadn't been back for a proper visit since elementary school. So I enlisted the help of some locals—including the Dallas Observer's infinitely knowledgeable food critic, Brian Reinhart—to help me look past the slick football-field-sized steakhouses I remembered and discover instead a city of thriving neighborhoods, each boasting its own homegrown gems. What I found (and ate, and drank—to the point of almost-bursting) were a whole bunch of reasons to book a flight right back to DFW ASAP.Meatums forever.\nPhoto by Alex LauMeet the mad scientist of meatTucked into a former gas station on a quiet street in old East Dallas is a wonderland of dried flowers, jars of fermenting shiso leaves, and animal skulls. This is Petra and the Beast, and it’s unlike any other restaurant in the city, or really...anywhere (which is how it snagged a spot on our Top 50 list!). Chef Misti Norris is doing crazy and incredible things with animal parts, homemade pastas, and fermentation. It’s a carnivore’s duty to order Meatums, a charcuterie board that changes constantly but never seems to falter. Milk-and-mustard-bathed chicken hearts? A pork-blood-and-chocolate terrine? Butter-soft pork rillettes sprinkled with cabbage dust? Just say yes.Prepare thy napkins for the snow crab boil at Ceviche Oyster Bar.\nPhoto by Alex LauSpend a day strolling through Bishop Arts DistrictYou may need a Lyft to get to this cozy epicenter of all things artsy and independent, but once you do, it’s easy to traverse on foot. Start with a lunch of boiled, fried, or lime-cured shellfish chased by frozen margaritas on bright red picnic tables at Ceviche Oyster Bar. While away the afternoon perusing the boutiques (jewelry! chocolate! fancy cigars! sooo much vintage clothing!) then settle in for salumi, wine, and cheese toast with fluffy soft-scrambled eggs at Macellaio, the new sister restaurant to nearby Italian mainstay Lucia. Once the sun sets, head down the street to Revelers Hall where you can dance it all off, Sazerac in hand, to live brass and killer vinyl at a cozy 1920s New Orleans–inspired bar and venue.Rare agaves abound at Las Almas Rotas.\nPhoto by Alex LauGet your mezcal fixNo matter what part of the city you’re in, there’s likely a pretty great mezcaleria right around the corner. In South Dallas, it’s Las Almas Rotas, where an all-knowing bartender can help you sort through the 20-page menu, or point you toward the spicy house-made strawberry sotol. In Deep Ellum, Ruins offers up a similarly extensive selection, along with live music, late-night tlayudas, and cactus fries. And in Belmont Park, just push through an unmarked door beside El Come Taco (or through the fake bridal storefront next door) and behold! La Viuda Negra: a neon-lit speakeasy pulsing with EDM, creamy pulque, and mezcal cocktails that look more like art.At Nori Handroll Bar, you'll need no chopsticks.\nPhoto by Alex LauHave handrolls for lunchThis year saw a mini-boom of Japanese handroll-centric restaurants in Dallas, including Namo and Sushi de Handroll. But our favorite spot is Nori Handroll Bar’s Blade Runner-esque sushi counter in Deep Ellum. Go for lunch to skip the long lines (and higher prices) at dinner, mark your picks on the dry-erase menu, watch the rainbow-haired staff roll out perfect cones of temaki to a hip-hop beat, and shove ’em in your mouth in 30 seconds or less for maximum freshness.Caldo de pollo at Miriam Cocina Latina\nPhoto by Allison David PhotographyTo tacos...and beyond!Powerhouse Mexican chefs are paying homage to their home countries, and experimenting with more traditional dishes, in Texas-sized spaces all over the city. Check out Anastacia Quiñones’ seasonal Guadalajaran fare at José (hot tip from Reinhart: Say “Tell Anastacia to feed me” when you order for a Mexican omakase-style feast of chef-chosen dishes). Get lost in the country-crossing menu at Jalisco Norte, led by Enrique Olvera-trained chef Jose Meza Arróyave. Or pop into Miriam Cocina Latina, where contemporary Mexican cuisine gets Dominican touches thanks to co-owner Miriam Jimenez, whose face looms larger than life over the bar.Trust us and order the whole menu...even if you're eating alone.\nPhoto by Alex LauEat allllll the Laotian foodMetro Dallas has one of the largest Lao communities in the U.S.—and as a result, many excellent Laotian restaurants (Sabaidee, Zaap Kitchen, and the OG, Nalinh Market, to name a few) but what chef Donny Sirisavath is doing at Khao Noodle Shop (another Top 50 nominee!) is next level. He makes his noodles from scratch (the old-fashioned way, which involves a strip of cloth stretched over a vat of boiling water). His recipes are a blend of childhood memories and smart, informed experimentation. And the result is a menu of artful-yet-affordable small plates just as fun as they are delicious. Try the genre-defining boat noodles for sure, but really you should just go with a group and order the entire menu.Midnight Rambler's lit-up bar is inspired by the one in The Shining.\nPhoto by Alex LauDrink where you sleepTurn right at the giant eyeball (a 30-foot-tall art installation by Tony Tasset) for Dallas’s sexiest hotel: The Joule, located inside a 1920s neo-Gothic tower. Nightcaps are mandatory at Midnight Rambler, a glowy basement bar inspired by the one where Jack Torrance drinks Jack Daniels in The Shining. You can up the ante with an ever-changing array of excellent gin-based (and everything-based) cocktails.Sandwich Hag owner Reyna Duong with her brother, Sang\nPhoto by Alex LauWhat’s better than banh mi on a patio?Not much, as tiny-but-mighty Sandwich Hag proves. Imagine the best hot dog you ever ate, flattened into a glazy patty, layered with pickled veg and garlic aioli, and plopped onto a crispy baguette. This is the Vietnamese pork sausage banh mi, and you need it. Chef-owner Reyna Duong opened the restaurant to employ her brother, Sang, who has Down syndrome, and today makes a point to hire people of all abilities. Read the full story on how the restaurant came to be right here.The stretchy (!) ice cream at BigDash\nPhoto by Hilary CadiganStretch your boundariesRichardson, just north of the city limits, is a bit of a trek, but the international eating options are worth it, from the pan-Asian delights of DFW China Town to the poufy Iraqi bread and shawarma sandwiches at Bilad Bakery to the stretchy (!) ice cream and cheesy kunafa at Syrian dessert emporium BigDash.Explore Bon AppétitHot 10 2019Hot 10DallasRead MorerestaurantsOur 50 Nominees for the Hot 10: America’s Best New Restaurants 2019By The Bon Appétit StaffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-12", "author": ["Condé Nast", "Hilary Cadigan"]}