{"id": "f8e88af0eaa4bc696b7cc841eca2f17c", "url": "https://www.bonappetit.com/story/chile-crisp-recipe", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Make This Chile Oil at Home Then Pour It on Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake This Chile Crisp at Home Then Pour It on EverythingIt heats up a cool celery tofu salad...and anything else in your fridge.By Chris MoroccoJuly 24, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI would never try to make ketchup from scratch. Or Dijon mustard, for that matter. These condiments, and plenty of others, are hard to improve upon and even harder to reproduce in a home kitchen. Chile oil is an exception—it's so easy to make a stand-out version at home—as I found out the day I tasted the one gifted to us by chef Tom Cunanan of Washington DC’s Bad Saint. The ochre-tinted oil was packed with crispy bits of chile, as solid as it was liquid. The flavor was so much more than spicy, although it had plenty of heat: It was toasty, warm, floral, and deep. Anything the oil touched turned from good into amazing. Scrambled eggs? Check. Plain rice? Check. Raw vegetables and cooked vegetables and pretty much anything else? Check check check.Food director Carla Lalli Music and I did the only sensible thing, which was to hide it from everyone else on staff. She wrapped the jar in scrap paper to disguise it, decorated it with a skull and crossbones, and helped me hide it in a different refrigerator after every use. It wasn’t enough. We ran out, and I had no choice but to start making my own. Luckily, chile oil is one of the easiest condiments to make, and homemade oils tend to be a big improvement over anything store-bought. Having it on hand means never being more than five minutes away from a meal, as proven by this Celery, Green Bean, and Tofu Salad.Tom’s oil was close in texture to “Old Godmother Sauce,” or Lao Gan Ma, a Chinese brand that makes an iconic condiment packed with crispy bits of chile. While you can certainly make a chile oil from nothing more than crushed chile flakes and neutral oil, adding other aromatics like garlic, ginger, and warm spices like cinnamon and anise make a much more interesting condiment, one that builds in flavor and complexity over time (just don’t try biting into the cinnamon or anise, okay?).Start by slicing the shallots and ginger, which need to cook for a while in the oil to drive out their moisture and make them crispy. Combine them with the oil, cinnamon, and anise in a small saucepan over medium heat. Bring them to a simmer and let them cook, swirling the pot occasionally, until they are golden brown and crispy, 20–25 minutes. While those are going, combine the ginger, pepper flakes, soy sauce, and sugar in a small heat-proof jar or bowl. Strain the oil through a fine mesh strainer over the chile flakes but do not discard the shallots and garlic. (The soy sauce and chiles may bubble up so do this slowly and carefully.) Let the oil cool. Break up any clumps of shallot and garlic and stir back into the cooled oil.From here you can use the oil as-is or brighten it with lime juice to use as a dressing for crunchy veg. In this recipe, raw green beans, braised or extra-firm tofu (look for Hodo), and sliced celery become a bright and spicy salad that is frankly more delicious than anything with raw tofu has a right to be.It all starts with a chile oil that is so easy to make, you won’t even feel compelled to hide it. You can always just make more.Use this stuff on everything:Chile CrispThis all-purpose chile crisp—which is tangy, spicy, and crunchy—will give your other condiments an inferiority complex.View RecipeCelery, Green Bean, and Tofu Salad with Chile Crisp:Celery, Green Bean, and Tofu Salad with Chile CrispIf you have a batch of our Chile Crisp at the ready, you can make this summery, no-fuss pantry salad in just 5 minutes.View RecipeExplore Bon AppétitHealthyishChileTofuGarlicOilCondiment/SpreadRead MorecookingThis Condiment Is Sweet, Spicy, Garlicky and Just Ridiculously GoodBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-24", "author": ["Condé Nast", "Chris Morocco"]}