{"id": "f8ec9166d5a81ed21363efacab63a283", "url": "https://www.bonappetit.com/recipe/coffee-creme-caramel", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Coffee Crème Caramel Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueCoffee Crème CaramelBy Carla Lalli MusicJune 1, 20193.9(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Gentl and Hyers, food styling by Susie Theodorou, prop styling by Nina LalliEmailPinterestPrintEmailPinterestPrintThe flavor inspiration for this recipe was Häagen-Dazs coffee ice cream mixed with burned caramel. Baking the crème caramel in a water bath is key for achieving that barely set, dense, and luscious consistency. And the lemon juice will help prevent your caramel from crystallizing. This recipe is from Where Cooking Begins by Carla Lalli Music.Ingredients8 servings 2½cups whole milk¼cup coffee beans, coarsely chopped1wide strip of lemon zest½cup plus ⅔ cup sugar1vanilla bean, split lengthwise1tsp. fresh lemon juice6large eggsPreparationStep 1Combine milk, coffee, lemon zest, and ½ cup sugar in a small saucepan. Scrape in vanilla seeds; add pod. Bring to a gentle simmer over medium heat. Remove from heat, cover, and let sit 30 minutes.Step 2Preheat oven to 325°. Place a 9\" pie dish or 1½-qt. loaf pan next to the stove. Cook lemon juice, remaining ⅔ cup sugar, and ¼ cup water in a small saucepan over medium-low heat, stirring constantly, until sugar dissolves, about 5 minutes. Do not rush this step; if liquid boils before sugar dissolves, the caramel will never darken. Once syrup turns clear, stop stirring and increase heat to medium. Cook, swirling pan every few minutes, until caramel is deep mahogany and wisps of smoke appear. Immediately pour into pie dish. Quickly tilt pan to coat bottom and a bit of the way up the sides with caramel. Set inside a roasting pan or other ovenproof dish with high sides.Step 3Whisk eggs in a medium bowl to break them up a bit. Reheat coffee mixture until steaming, then pour into eggs, whisking constantly to combine. Pour through a fine-mesh sieve into caramel-lined dish. Transfer to oven and pour enough boiling water into roasting pan to come halfway up sides of dish. Bake until custard is set but still jiggles a bit at the very center, about 1½ hours. Let cool in water bath 30 minutes. Remove dish, cover with plastic wrap, and chill crème caramel until set, at least 4 hours and up to 2 days.Step 4To unmold, run a thin-bladed knife around edges of dish, making sure tip of knife stays flush against bottom of dish. Invert a large plate over dish, then quickly flip. Slowly lift off dish; crème caramel should slide out. If not, tap plate against countertop until it does. Serve in slices with caramel spooned over.How would you rate Coffee Crème Caramel?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleAs many people point out, the cooking time is a little over-kill.  50 minutes seems to be the sweet spot. If you have an old oven like me, then you'll also need to increase the cooking temperature (325 F is just waaaay too low) .\n\nA big tip to know when it's done: if you see that the top is starting to change color (to a golden brown) take it out immediately! If you see bubbles then you might have over cooked it, it will develop a skin on the bottom that is not pleasant to eat (but the rest of the cake is still okay-just not ideal).\n\nI've made this a few times. Another tip while making the caramel, if you add more than 1 tablespoon of lemon juice, then flan will have more of a lemon drop flavor (which isn't bad, but it over-powers the coffee flavor). You could do a lemon-flavored flan with this method without the coffee beans. \n\nThe flan will always have a dull gray-ish color to it, hence the coffee beans, (which is not typical for flans) but I don't think it takes away from the texture or flavor. It just looks unusual for this dish.Big ChungusGeorgia12/31/2020Please change the time to cook the recipe!!!! I read the comments after putting mine in the oven for an hour and the texture was awful. Such a waste and so frustrating. Anonymous6/21/2020soooooooo great, followed the 50 min rec in the comments. cook perfectly. my tips, is don't crush the coffee too much, and keep an eye on the milk, don't let it go past a light simmer. I also used a milk alternative. tasted great. making it again in a few days!@moes_houselondon, uk.6/2/2020THANK YOU EVERYONE I made this AFTER reading all the reviews so I was well aware of the time & I also didnt reheat my coffee before adding IT came out PERFECT and I have ALL of you to thank.!! What I hot from all your reviews 50 minutes is  perfect timing , dont bother reheating coffee it doesnt change anything & use a pie dish.  Hope anyone in the future just takes my advicd and cooks it the way all the reviews suggest.Yumma1Tewksbury, Mass5/1/2020Great recipe but you really need to change the cooking time to 50 minutes ! Do not cook for 1 1/2 hours people !!YesChefParis4/23/2020Can anyone explain the point of the lemon peel in the coffee mixture?  I don't recall Haagen Daz coffee ice cream having a lemony undertone.Anonymous1/21/2020Read the reviews before I made this and subsequently checked on my creme caramel in the oven every ten minutes. Around 50-55 minutes it was perfect! Came out so, so delicious and I will definitely be making it again. AnonymousHudson Valley, NY12/1/2019Oooooooh, I wish I'd read the comments before making this - I baked it the full 1 1/2 hours as directed and it came out completely ruined - overcooked, awful texture, horrible flavour. Pretty disappointing - I was supposed to take this to a friend's house for dinner and was very much looking forward to eating it! I would like to say I'll try it again sometime with the shorter baking time but I'm feeling a little gun shy after such a flop.KDVVancouver Island, BC, Canada11/16/2019Ok. First of all, this was fantastic. I made it for a dinner party and everyone raved about how delicious it was. And I was like “Guys, no. We should all be thanking Carla Lalli Music. She is responsible for this beige goodness.” Overall dessert was perf and super fun to make. A tiny warning: 1 hour is more than enough for the oven, mine was done in 50-ish mins. Couscous RoyaleIstanbul7/23/2019Followed the recipe to the dot, except for two things. One, I didn't reheat the coffee mixture, which meant I mixed them w/ the eggs cold. Two, the time in the oven. I'm paranoid so I tend to check every 15 minutes, turning each time. It was done in less than an hour, around 50 mins. \nFirst time I successfully browned the sugar so the lemon juice tip was A+. It tastes p e r f e c t.lea26karlaPhilippines7/21/2019I made the recipe as instructed, but opted for the loaf pan rather than the pie form. No adjustment for time was instructed for the loaf version so I set the timer for 1:10 in response to people’s concern the cooking time was off. A full 20 minutes early the top was overly browned and burned in a few spots. The flavor was alright and the crème unmolded easily, however the top layer of caramel is strictly adhered to the bottom of my loaf pan. Not sure if this was an overcoming if the caramel or not, but most likely the pan will have to get tossed out. Sounded easy enough but would not make again. (Ps Carla I love you) LoukasChar_charOrlando, Florida 7/20/2019I followed the instructions EXACTLY, but turns out the 1:30 hours was WAY too much to let it cook. Turned out horrible(the smell was as bad as the taste and the texture was cheese like). A risky thing to bake and i recommend you check it regularly to prevent wasting ingredients like i did. XosrovIR7/19/2019My girl Carla absolutely went off. 10/10 recommend for anyone experimenting with custard-esque dishesBrit515Mass7/17/2019Does it really take one and a half hours in the oven? Really want to try this recipe Anonymousguatemala7/13/2019I absolutely loved the recipe!! The coffee flavor was really present yet not bitter or overwhelming. I had to redo my caramel as the first one did not color (explanations in the recipe) but other than that, it is a winner!Rangeley, Maine6/6/2019Explore Bon AppétitCustardDessertCoffeeAlcohol & Other DrinksGluten-FreeNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Carla Lalli Music"]}