{"id": "f8ec30963f393efd76f3858908474ab5", "url": "https://www.bonappetit.com/story/sun-dried-tomato-walnut-pesto", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Sun-Dried Tomato Walnut Pesto | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSay What You Will About Sun-Dried Tomatoes—They're Perfect in This Walnut DipEating this pesto is as close to dining in a Paris bistro as I'm going to get.By Emma WartzmanApril 24, 2020FacebookTwitterEmailPhoto and Food Styling by Emma Wartzman FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.The first truly perfect dinner I had at a restaurant was at Buvette when I was visiting New York in high school. A tiny French bistro in the West Village run by Jody Williams, Buvette is as alluring for its food as for its ability to transport you to Paris. But the food! The food is really good.Somewhere between the rich brandade, the fall-apart coq au vin, and a truly luxe chocolate mousse came an unsuspecting course—the underdog, even. It was a chunky walnut pesto, served on perfect crusty bread.Lucky for me, Williams published the pesto recipe in Buvette’s eponymous cookbook—which I got my hands on right before moving to NYC to set up shop as someone resembling a grown-up. That recipe accompanied me across the country and then from apartment to apartment. I’ve changed a couple of small things as I’ve made it over the years, serving it with way more than toasted bread.Here’s how my take goes: First, heat your oven to 350° F. Then, scoop 1 generous cup of raw walnuts onto a baking tray and pop them in the oven to toast. Here’s a helpful guide for toasting. (For the record, Williams uses raw nuts, but to me, the toasty flavor takes things to the next level.)While the walnuts are turning deeply golden brown, peel 1 small garlic clove, grate ¼ cup parmesan cheese, pick 2 tsp. fresh thyme leaves from their spindly stems (or really, another herb like rosemary or fresh oregano would do too), and finely chop 2 Tbsp. sun-dried tomatoes. I know, I know. But before you run in the other direction thinking that I must be insane for touting a recipe that calls for controversial sun-dried tomatoes, just hear me out: They’re good in this! Slightly sweet and slightly acidic, they fill out the background rather than announce themselves front and center as they’ve been known to do. And, well, it just works.Have I convinced you? Okay, good, because the walnuts are definitely done toasting by now. Once they’ve cooled, transfer them to a food processor (shout out to my more affordable, more space-efficient mini one), along with the garlic clove, the parm, and 1 tsp. sherry vinegar. Pulse until coarsely chopped.Transfer that mixture to a bowl, stir in the sun-dried tomatoes and about ¼ cup extra-virgin olive oil, and season with salt to taste.I do, indeed, eat this pesto on toasted bread. But I’ve also spooned a dollop over roasted vegetables for added crunch, served it with chicken and with steak, and used it as a spread on sandwiches, a dip for crudités, and, when loosened up with some pasta water and more cheese, a pasta sauce.No matter how it’s served, though, it takes me back to the tiny, bustling dining room at Buvette—an imaginary trip I can always use, and especially now.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-24", "author": ["Condé Nast", "Emma Wartzman"]}