{"id": "f8ef020d91e3b72ebb866c17a96413b4", "url": "https://www.bonappetit.com/recipe/zaatar-chicken-cutlets-with-cabbage-salad", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Za’atar Chicken Cutlets With Cabbage Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueZa’atar Chicken Cutlets With Cabbage SaladBy Andy BaraghaniMarch 16, 20214.5(63)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintBreading chicken with panko plus homemade za’atar creates cutlets with tons of nutty, floral, and tangy flavor. Senior food editor Andy Baraghani recommends mixing your own za’atar to ensure that the proportions of bright, lemony sumac and textural sesame seeds are just right for the purposes here. Leftover cutlets and cabbage can be layered between slices of tahini-slathered sourdough for a deliciously crunchy chicken sandwich the next day. Ingredients4 ServingsTahini Sauce1small garlic clove, finely grated½cup tahini (such as Soom)¼cup fresh lemon juice3Tbsp. extra-virgin olive oilKosher saltChicken and assembly3large eggs, beaten to blend1cup all-purpose flour1cup panko½cup raw white sesame seeds⅓cup crushed dried thyme and/or oregano¼cup sumac2skinless, boneless chicken breasts (about 1½ lb. total)Kosher saltVegetable oil (for frying; 3–4 cups)½head of green cabbage, thinly sliced½small red onion, very thinly sliced2Tbsp. extra-virgin olive oil2Tbsp. fresh lemon juice6salt-brined Middle Eastern–style or other pickles, halved lengthwise, sliced on a diagonalPreparationtahini SauceStep 1Whisk garlic, tahini, lemon juice, oil, and ¼ cup water in a small bowl to combine; season with salt.Chicken and AssemblyStep 2Place eggs, flour, and panko in 3 separate shallow bowls. Mix sesame seeds, thyme, and sumac into panko.Step 3Working one at a time, hold a long knife parallel to a cutting board and cut chicken breasts in half, slicing along a long side to make 4 thin cutlets. Place a cutlet between 2 large sheets of wax paper or plastic wrap. Using a meat mallet or rolling pin, pound to ⅓\" thick. Repeat with remaining cutlets.Step 4Season both sides of a cutlet with salt. Dredge in flour, shaking off excess, then dip into egg wash, letting excess drip back into bowl. Dredge in panko mixture, pressing firmly to adhere. Repeat with remaining cutlets.Step 5Pour vegetable oil into a large heavy high-sided skillet to come ½\" up sides. Heat over medium until an instant-read thermometer registers 400°. Working in batches and returning oil to 400° after each batch, carefully lower cutlets into skillet with tongs; cook, turning halfway through, until deep golden brown, about 4 minutes. Transfer cutlets to paper towels to drain and sprinkle lightly with salt.Step 6Place cabbage, onion, olive oil, and lemon juice in a medium bowl; season with salt. Toss, lightly squeezing, until cabbage is slightly wilted. Add pickles and toss again just to combine.Step 7Serve cutlets with cabbage salad and tahini sauce.How would you rate Za’atar Chicken Cutlets With Cabbage Salad?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleWould not mix lemon juice in the cabbage salad because it already has pickles got too sour and lemonny Anonymous3/22/2022This was DELICIOUS! The slight crunch of the coating on the chicken contrasted with the moist center. I added a little za'atar and black sesame seeds to the cabbage salad for some added flair.Lauren LangeCrested Butte, CO12/1/2021We really like this meal!! The flavors complement wonderfully and it comes together quick-like too. I've stuck to the thyme herb exclusively but will try oregano tonight for a change - all of my seasonings are fresh but for some reason I feel that the Za'atar isn't quite as punchy as I'd like - will report back. Agree with another reviewer that the panko breading makes up in excessive quantity; one can scale back ingredients significantly, perhaps by 50%. Love another reviewer's thought to make israeli couscous to accompany. KristinPortland, Ore11/14/2021Outstanding!  My entire family devoured it, even my picky 9 year old.  Loved the tahini.  And added some trader joes garlic sauce for additional dipping.  Served with israeli couscous and green beans.  This breading was seriously fabulous.  AnonymousLos Angeles, CA8/17/2021Super simple and full of flavor!  This went together in a snap (thanks to our meat market guy pounding the chicken out for us).  Big flavor - even the cabbage was eaten by my son, who normally doesn't like it.  He said as long as he ate it with the chicken or tahini, it was good!  Will definitely do this one again.LBinTXFort Worth, TX5/25/2021We all liked this!  The cabbage seemed like it wouldn't have much flavor but it had more than its components would suggest, everything went together very well.  The breadcrumb mixture makes much more than you need for two chicken breasts' worth of cutlets, I had a hard time using a slightly reduced portion of breadcrumbs on six giant cutlets.  Just be aware, if you're not making extra chicken, either make less breading or set some aside before you start dipping raw chicken in it so you don't have to throw out a bunch that you didn't need but is now unsafe.  703847NoVA5/4/2021The breading for the chicken cutlets is wonderful. The recipe as written will make enough for at least four chicken breasts (8 cutlets).Bob GreigPlymouth, MI4/23/2021Delicious - by the three people who shared the meal. My husband and son love Zatar (traditionally eaten on pita locally), so I was anxious to try this meal. I like Zatar, but not if it is overwhelming. This meal made me appreciate this Lebanese seasoning in a whole new way. The tahini dressing was also surprisingly easy and tasty - we all thoroughly enjoyed the meal, including the cabbage slaw with the surprisingly tasty addition of pickles!!! Keep the great ideas coming, Andy!DianeCWestlake, Ohio4/19/2021Explore Bon AppétitCutletChicken BreastChickenPoultryTahiniCondiments, Sauces & PastesGreen CabbageCabbageLeafy GreensVegetableWeeknight MealsMainHealthyishFryRosh HashanahHanukkahLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Andy Baraghani"]}