{"id": "f8f2000ab4689a38e38370caa03cf6e2", "url": "https://www.bonappetit.com/recipe/spicy-baked-ricotta-and-pepper-dip", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "Spicy Baked Ricotta and Pepper Dip Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDSpicy Baked Ricotta and Pepper DipSponsored by FarmToForkFacebookPinterestTwitterEmail8 servingsThe Calabrian pepper in the sauce, along with roasted red bell pepper and pepperoncini, add spicy, sweet, and pickled flavors that complement this creamy, warm ricotta dip.PrintIngredients1 large egg2 cups ricotta cheese1 1/2 cups grated low moisture mozzarella cheese1/4 cup grated Parmesan cheese2 tsp. brine from pepperoncini peppers, plus 1/4 cup thinly sliced pepperonciniRed pepper flakes1 small garlic cloveKosher salt and freshly ground black pepper3/4 cup FarmToFork Spicy Marinara Sauce, (from one 23.5 oz. jar)2 medium roasted red bell peppers, diced (3/4 cup)Extra-virgin olive oil, for brushingCrostini, for dippingRecipe PreparationPreheat oven to 400°. In a medium bowl, beat the egg. Add the ricotta, mozzarella, Parmesan, thyme, the pepperoncini brine, and a large pinch of red pepper flakes. Using a micro plane, grate the garlic into the bowl with the cheese, stir to combine. Season with salt and pepper.Brush an 8-inch skillet or small baking dish with oil. Dollop spoonfuls of the ricotta mixture into the prepared skillet. Bake until golden and puffed, about 30 minutes.In a small bowl, combine the tomato sauce with the roasted pepper.Remove skillet from oven and spoon remaining tomato sauce mixture over top. Return to oven to heat sauce, about 5 minutes more.Let cool slightly, then top with sliced pepperoncini, sprinkle with more red pepper flakes, and serve warm with crostini for dipping.Sponsored by FarmToForkGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitFarmToFork™SponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}