{"id": "f8f5c70872d1d7de7a305a30c17e6f42", "url": "https://www.bonappetit.com/story/keep-you-company", "year": 2020.0, "month": 3.0, "day": 5.0, "content": "We're Glad to Keep You Company | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWe’re Glad to Keep You CompanyWe’ve got recipes, but we’re also here to hang.By Adam RapoportMarch 31, 2020FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.When this whole thing started, I assumed that most people would turn to BA for the same reasons they always have—recipes and cooking advice.And over the past two weeks, man, we’ve produced no shortage of that content. We’ve served up all sorts of handy slide shows, like 89 Recipes with 5 Ingredients or Fewer—Seriously (special shout out to Andy Baraghani’s Charred Leeks with Vinegar and Honey for taking advantage of an allium with a long shelf life that’s in abundance this time of year). Another favorite of mine is 86 Comfort Foods for Cold Nights, Broken Hearts, and Wednesdays (props to whoever wrote that headline).But as Week 1 of quarantine crept into Week 2, it became pretty clear that our readers, users, listeners, and viewers wanted more from us than just to what to cook. They wanted company.And who can blame them? Isn’t that the reason why so many of us started cooking in the first place? Not because of sustenance, but as a way to bring together our friends, our partners, and our families.So when we posted a video on Friday of our test kitchen editors in their home kitchens (complete with dogs, cats, and kids filtering in and out), the response was overwhelming. Brad and Claire and Andy and Sohla and Carla and the gang let our 5.5 million YouTube subscribers know that the BA Test Kitchen videos would keep on keeping on—except from home, with remote equipment.Want this letter before it hits the website? Sign up for our newsletter!Brad, bumbling about at home.\nAnd our followers let us know how they felt, blitzing Twitter, Reddit, and our YouTube comments board.“I literally cried, this made me feel so good and comfortable.”“I just got a little verklempt watching the new @bonappetit video of the crew in their homes. So that's where my emotional stability is charting today. How's everyone else?”“This was free therapy for me. Haven’t felt this social in weeks.”“I’m crying a little bit lol. I didn’t realise how attached I was to the BA staff. I’ve been watching for years, and hearing them talk about missing each other was so sweet.”And it’s not a one-way street. We’re just as hungry to connect with everyone out there. It’s why you’ll spot Sohla on her Instagram stories giving DIY cooking lessons. It’s why Carla will be on @bonappetit’s Test Kitchen Tuesday Instagram series tomorrow at 2pm, checking in with Claire, Chaey, and Delany. And it’s why you can catch the entire test kitchen crew on YouTube tomorrow when it launches its second all-remote group video, wherein each editor demonstrates how to make his or her perfect cup of coffee.The fact that we’re able to keep doing what we do—albeit from different locations with slightly different equipment—isn’t a burden, it’s a privilege.Explore Bon AppétitAdam NewsletterRead MoreLifestyleThese Are a Few of My Favorite FatsBy Christina Chaeycooking10 Tips For Keeping Produce Fresh Until Your Next Trip to the Grocery StoreBy Caroline LangecookingCook the Food That Makes You Feel GoodBy Adam RapoportLifestyleCooking at a (Social) DistanceBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-31", "author": ["Condé Nast", "Adam Rapoport"]}