{"id": "f8fb59ef8312932e21419aa2a9de45c5", "url": "https://www.bonappetit.com/story/moku-light-towel", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "The Moku Light Towel Brings Me So Much Joy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Didn’t Know a Fancy Kitchen Towel Could Bring Me This Much JoyI thought I would be content to dry my hands on ratty old towels for the rest of time—and wow, was I WRONG.By Christina ChaeyMarch 4, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.A few months ago, I had a heated argument with my boss Adam Rapoport about fancy dish towels. He was trying to make the case that everyone should have two sets of towels: a workhorse set you keep out of sight and only pull out to do the dirty work (e.g. mopping up tomato sauce and wine splotches, wiping down the oven door) and a “fancy” set exclusively dedicated to drying dishes and hands. I argued that it wasn’t worth the trouble to try to separate your tomato sauce towels from your hand towels because someone would inevitably mix them up (that someone in Adam’s house is Adam) and proudly said I would “probably never” own two sets of towels in my life.All of this happened before I discovered Kontex, a brand of towels from Imabari (a.k.a. the unofficial towel capital of Japan). I recently ordered three of the Moku Light Towels from Rikumo, a Philly home goods store that’s also one of my favorite places to digitally window shop (emphasis on “window”). They have completely and utterly turned me into a FTP—a Fancy Towel Person. Everything about these towels is pleasing to me: the featherlight weight; the plush, super-soft feel of the cotton; the fact that they are at least twice as absorbent as they appear, yet dry in what feels like minutes. Even the colorways come in pleasing names like Mustard, Azure, and Almond. The day I got them delivered, I had friends over for dinner and made everyone take a turn using the towels to dry the dishes. (They were all #influenced, and I’ve now figured out my holiday gift strategy for the year.)I’d never before given much thought to the towels I was using to dry my hands and dishes every day. But ever since I’ve started keeping a Moku towel slung over my oven door next to my tomato sauce towels, I’ve realized a good dish towel can be every bit as wonderful as a sharp knife, a wooden spoon, or a heavy cutting board. Author Peter Miller says it best in How to Wash the Dishes, his sweet little ode to the daily kitchen activity so many of us tend to gloss over: “Find a dish towel that you love the look and feel of. It is, in a way, both a scarf and a tool for a working kitchen, bringing pattern and color but also working as hard as any sauté pan.” I think that’s what Marie Kondo means about sparking joy.Buy It: Moku Light Hand Towel, $20 each at RikumoAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingproductRead MorecookingThe Best Kitchen Towels Cost Less Than $1 Each, So Stock UpBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-04", "author": ["Condé Nast", "Christina Chaey"]}