{"id": "f910df0061f2b79e4375b03172e2896f", "url": "https://www.bonappetit.com/recipe/ramadan-date-cookies", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Ramadan Date Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueRamadan Date CookiesBy Anissa HelouMay 15, 20183.7(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Kristin PerersEmailPinterestPrintEmailPinterestPrintRamadan is the most important month in the Islamic calendar, a time for fasting during the day and feasting after sunset and until sunrise. During that whole month, sweets occupy an important place in people’s lives. These date-ﬁlled cookies are a typical Ramadan sweet. If you can’t ﬁnd date paste, use an equal amount of pitted dates and process with cinnamon and butter in a food processor until a smooth paste forms.IngredientsMakes about 40Dough2cups (350 g) semolina flour¼cup (50 g) baker’s sugar or superﬁne sugar¼tsp. active dry yeast¼cup plus 1 Tbsp. (50 g) all-purpose ﬂour, plus more for surface½cup (1 stick) plus 2 Tbsp. unsalted butter, room temperature3Tbsp. orange blossom water3Tbsp. rose waterDate Filling and Assembly12oz. dried date paste½tsp. ground cinnamon2Tbsp. unsalted butter, meltedSpecial EquipmentA ma'amoul cookie moldPreparationDoughStep 1Mix semolina flour, sugar, yeast, and ¼ cup plus 1 Tbsp. all-purpose flour in a large bowl. Add butter and work it in with your fingertips until fully incorporated. Add orange blossom and rose water. Knead dough in bowl until smooth and elastic. Roll dough into a ball and place seam side down on a lightly ﬂoured work surface. Cover with a very damp cloth and let rest in a cool place 1½ hours.Date Filling and AssemblyStep 2Combine date paste and cinnamon in a small bowl. Gradually add butter, working it in by hand until a smooth, soft paste forms. Pinch off a small piece and shape into a disk 1½\" (3.5 cm) in diameter and about ¼\" (6 mm) thick. Transfer to a plate. Repeat process with remaining paste (you should have 40 disks). Cover with plastic wrap.Step 3Preheat oven to 400°. Pinch off a piece of dough and roll into a walnut-sized ball. Flatten on your palm to form a 3\" (7.5 cm) disk about ¼\" (6 mm) thick. Lay a date disk in center of dough. Fold edges of dough over date to cover. Pinch edges together—the date disk should be covered with an even layer of dough.Photo by Kristin PerersLightly press into cookie mold. Turn mold over and tap top edge lightly against work surface while holding your other hand underneath to catch dough as it falls out of mold. Slide dough onto a parchment-lined baking sheet or silicone baking mat. Repeat with remaining dough and disks.Photo by Kristin PerersPhoto by Kristin PerersStep 4Bake cookies until lightly golden, 15–18 minutes. Transfer to a wire rack and let cool.Step 5Do Ahead: Cookies can be made 2 weeks ahead. Store in an airtight container at room temperature.How would you rate Ramadan Date Cookies?Leave a ReviewTell us what you thinkExplore Bon AppétitCookieDessertMiddle EasternSemolina FlourFlourDateDried FruitFruitRose WaterAlcohol & Other DrinksEasyNut-FreeBakingRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-15", "author": ["Condé Nast", "Anissa Helou"]}