{"id": "f919162a104b8870e006b3195a056127", "url": "https://www.bonappetit.com/recipe/lamb-and-winter-squash-in-chile-broth", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Lamb and Winter Squash Soup  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueLamb and Winter Squash SoupBy Andy BaraghaniJanuary 9, 20184.6(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Emily EisenEmailPinterestPrintEmailPinterestPrintIf you can’t find delicata squash in your neck of the woods, acorn or butternut will do the trick.Ingredients4 servings1pound boneless lamb shoulder, excess fat trimmed, cut into 2-inch piecesKosher salt1dried guajillo or ancho chile1medium onion, sliced into ½-inch-thick rounds4garlic cloves, unpeeled2tablespoons vegetable oil2bay leaves2allspice berries1½teaspoons ground coriander1teaspoon ground cumin½teaspoon dried oregano1small delicata squash (about 1 pound), seeds removed, sliced into ½-inch-thick roundsCrumbled feta, cilantro sprigs, and lime wedges (for serving)PreparationStep 1Season lamb on all sides with salt. Let sit for 1 hour at room temperature or chill, uncovered, for up to 12 hours (longer is better; overnight works great).Step 2Preheat oven to 400°. Roast chile on a rimmed baking sheet until puffy and it smells toasty, about 2 minutes. Remove seeds and place chile in a blender along with 1 cup hot water.Step 3Heat broiler. Scatter onion and garlic on same rimmed baking sheet. Broil, undisturbed, until blackened on top (don’t worry if they get super dark), 12–14 minutes. Pop garlic out of skins and place garlic and onion in blender with chile. Purée until smooth but still speckled with chile; set aside.Step 4Heat oil in a large Dutch oven or other heavy pot over medium-high. Working in batches, cook lamb, turning occasionally until brown on all sides, 12–14 minutes total. Using a slotted spoon, transfer lamb to a plate. Carefully pour off oil and return lamb to pot. Add bay leaves, allspice, coriander, cumin, and oregano and cook, stirring to coat lamb, until fragrant, about 30 seconds. Pour in 6 cups water and bring to a boil. Reduce heat to a bare simmer; mostly cover with lid (you want a little space for steam to escape) and cook, stirring occasionally, until lamb is tender, 60–75 minutes.Step 5Add squash to stew and cook until almost tender, 6–8 minutes. Stir in onion-chile purée, season with salt, and cook 10 minutes to let flavors meld. Taste and season with more salt if needed.Step 6Ladle stew into bowls and top with feta and cilantro. Serve with lime wedges.Step 7Do Ahead: Stew (without feta and cilantro) can be made 3 days ahead. Let cool; cover and chill. Add feta and cilantro just before serving.How would you rate Lamb and Winter Squash Soup ?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleA question for anyone who knows, what is the purpose of salting the lamb over night for this recipe?  I understand dry brine and have used that technique for roasting or grilling meats but never for a stew or soup. AnonymousAlberton, MT1/4/2020Such an unexpected, delicious soup. I used butternut! The chile broth is brilliant, I'd never made a soup with this technique before. And yes, the final texture is this spiced broth, not a thick stew (re: disappointed review), but that's what it's supposed to be. If you're looking for a thick, hearty soup, try one of the slow-cooked stews from Oct 2018 issue! alexbeggsBA.com 1/20/2019I found this recipe a bit disappointing. Despite reducing it at the end, it has no body and thus is more soup than stew. Also, the  flavor of the paste wasn't really discernible, nor were the spices. All in all, not a stand-out.AnonymousLondon Ontario Canada 10/31/2018I've made this. Twice. \nIts really (really) good.hphelpsliptCatskills, NY10/8/2018This looks delicious! Can you substitute the water with chicken broth? Also, should the onion be white or yellow? I would love to make it this weekend. AnonymousSan Francisco1/17/2018Can you substitute the water with chicken broth?  Also, what type of onion...yellow or white? I'll be making it this weekend! Anonymous1/17/2018Explore Bon AppétitSoupSoups and StewsAncho ChileChileVegetableDelicata SquashSquashLamb ShoulderLambMeatGuajillo ChileWinterMainGluten-FreeNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}