{"id": "f91d2a06ac91e970227c9ebe74a7e2c0", "url": "https://www.bonappetit.com/story/make-focaccia-be-happy", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Be a Person Who Makes Focaccia on the Regular | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBe a Person Who Makes Focaccia on the RegularTop it with crunchy flakes of Maldon salt, thinly sliced red onion, a big red ribbon—you do you.By Alex BeggsMarch 6, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI hear that if you say “classic focaccia” three times aloud on the night of a full moon, it might appear hot and puffy from the oven right before your eyes. And if that doesn’t work, we’ve got a recipe.Focaccia is an olive oil-rich Italian bread we can’t decide is better described metaphorically as a sponge or a springy mattress. It’s crispy and golden on the top and bottom crusts, and inside, it has an airy crumb (meaning there are tons of air holes, big and small, that squish in the best way possible). Most of the actual work takes place in the stand mixer, while the rest requires a study in patience as you wait for the dough to develop overnight.Break me off a piece of that.\nPhoto by Alex LauHere’s how our recipe by Claire Saffitz breaks down. The day before you want bread, mix flour and water in your Kitchenaid/stand mixer so you can stare at it contemplatively without getting doughy fingers. Let that rest in the bowl while you create up a bubbling mixture of yeast/sugar/water, then add that to dough in the stand mixer, add salt, and continue mixing until it’s smooth, stretchy dough.This focaccia dough is wetter than a lot of other bread doughs, so don’t freak out and start Googling and second-guessing everything while falling prey to targeted ads for those clogs you kinda want. The dough should be very sticky but not as thin as batter. Let that rise for 2 hours in an oiled bowl somewhere warm and cozy.Instagram contentThis content can also be viewed on the site it originates from.Next, you’ll fold the dough a few times in an oiled 18\" x 13\" sheet pan with 1-inch sides—this recipe is perfectly tailored to this size. Oil your hands before doing all of this, too, and then thank us later for your moisturized cuticles. Let it rest a few minutes to allow the stretchy gluten to relax—the spandex of bread—and then pull the dough into a rectangle shape.That’s it for day 1. The sheet pan goes into the fridge overnight.Whyyyyyyy?! For flavor. By tossing the dough into the fridge, we’re slooooowing down the fermentation process. Instead, the yeast can chill and develop this nutty, chewy flavor that’s noticeably complex. Otherwise you’d have focaccia that tastes like flavorless white flour. We want that fragrant, warm, yeasty flavor. So wait it out!The next day you’ll let it warm up and rise to the top of the sheet pan while the oven gets HOT. 450°, people. That way the bread nearly fries in all of the oil, creating that crispy edges we swoon for like focaccia groupies. Before it goes in the oven, though, you’ll drizzle olive oil all over (whatever you have as long as it’s extra virgin, not the $$$ fancy stuff) to anticipate the crispy crunch crust. Then oil your hands again and play the piano on the soft dough, creating dimples all over, an inch apart or so. Welcome to Planet Focaccia, earthlings. Final move: Sprinkle a generous amount of Maldon salt (have you embraced bucket life yet, btw?) all over. 25–35 minutes later and you’re golden—literally golden brown. And blessed with a ton of focaccia to rest your weary head upon.Photo by Alex LauOh, obviously it’s best eaten fresh, but it stores well for a few days, in which case you can revive it in the toaster oven, adding a drizzle of oil if you want. You can slice and freeze it too, then throw it in the toaster straight from frozen.We like to dip this classic, salt + oil focaccia in soup, sauces, or use it as awesome sandwich bookends. It’s not pizza—the fewer accoutrements the better. But you can get artsy and doctor it up with these toppings after you dimple the dough:Thinly sliced garlic and rosemary leavesThinly sliced lemonThinly sliced red onion (see a theme here?)Parmesan—but better added after it’s baked so it won’t get that burnt bitter tasteYou tell me! Make it and let us know your variations in the recipe commentsGet the recipe:Classic Focaccia BreadThe salty, springy bread that looks like the surface of a distant planet. Take us there.View RecipeExplore Bon AppétitBreadItalianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-06", "author": ["Condé Nast", "Alex Beggs"]}