{"id": "f9218a9ff9bdcac161e7c3224b775564", "url": "https://www.bonappetit.com/recipe/wali-ya-mboga", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "Wali Ya Mboga Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesWali Ya MbogaBy Zaynab IssaJanuary 27, 20224.8(17)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintIn its purest form, wali ya mboga (Swahili for “rice and vegetables”) is a minimalist dish—usually a simple mix of sautéed vegetables and basmati rice. This riff on the East African original presents a more maximalist approach and reflects my roots in both East Africa and India. Sure, rice and vegetables are still present in the form of long-grain rice swirled with ribbons of Swiss chard, but there’s also tender yogurt-marinated chicken and an earthy, aromatic tomato curry, with lots of sweet, jammy caramelized onions, making this version closer to a biryani. To serve, layer the rice, onions, and chicken on a platter; or for a more casual vibe, give everything a gentle toss and serve directly from the pot. Finish each serving with a dollop of creamy salted yogurt and some punchy quick-pickled onion, known as kachumbar, and you’ll have a wonderfully balanced and hearty meal. —Zaynab IssaAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCitrus Juicer$7 At AmazonMicroplane Grater$16 At AmazonTongs$13 At AmazonLarge Nonstick Skillet$50 At AmazonLarge Pot$55 At AmazonColander$11 At AmazonIngredients4–6 servingsWali Ya Mboga1⅔cups good-quality basmati rice (such as Shahzada)¼cup plain whole-milk yogurt (not Greek)11\" piece ginger, scrubbed, finely grated7garlic cloves, finely grated, divided2¾tsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, divided, plus more½tsp. ground turmeric, dividedFreshly ground black pepper1½lb. skinless, boneless chicken thighs4Tbsp. extra-virgin olive oil, divided1large onion, thinly sliced14.5 oz. tube double-concentrated tomato paste1tsp. ground coriander1tsp. ground cumin½tsp. Kashmiri chile powder or a pinch of cayenne pepper1bunch Swiss chard, kale, or spinach, tough ribs and stems removed, sliced into 1\" ribbonsAssembly1small onion, thinly slicedJuice of 1 lemon2green Thai chiles or 1 jalapeño, seeds removed if desired, sliced¼cup cherry tomatoes, diced1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, divided¾cup plain whole-milk yogurt (not Greek)PreparationWali Ya MbogaStep 1Place rice in a medium bowl and pour in cold water to cover. Agitate rice with your hands until water is cloudy. Drain and repeat until water is almost clear (about 3 times). Pour in water to cover rice by 2\"; soak at least 30 minutes and up to 12 hours.Step 2Stir yogurt, ginger, half of garlic, ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and ¼ tsp turmeric in a medium bowl to combine. Season with pepper. Add chicken thighs, turning to coat. Let sit at room temperature at least 30 minutes and up to 1 hour.Step 3Meanwhile, heat 2 Tbsp. oil in a large nonstick skillet over medium-high. Add onion and sprinkle with ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt. Cook, stirring occasionally, until onion is frizzled and deeply browned, 15–17 minutes. Transfer onion to a plate and set aside.Step 4Heat remaining 2 Tbsp. oil in same skillet (still over medium-high). Working in batches if necessary, remove chicken from marinade and cook until browned and cooked through, about 5 minutes per side. Transfer chicken to a plate, leaving oil behind.Step 5Add tomato paste, coriander, cumin, chile powder, remaining half of garlic, remaining 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt, and remaining ¼ tsp. turmeric to skillet. Cook over medium-high, stirring often, until tomato paste turns a shade darker in color, about 5 minutes. Reduce heat to medium-low, stir in 1 cup water, and bring to simmer. Cook, stirring occasionally, until flavors come together and sauce has thickened, 10–12 minutes. Return chicken to pan and stir to coat in sauce. Remove from heat; cover and keep warm.Step 6Drain rice and cook in a large pot of boiling generously salted water until tender but still with some bite, 10–15 minutes. Stir in Swiss chard and cook until wilted and bright green, about 3 minutes. Drain in a colander and let sit 10 minutes to allow moisture to steam off. AssemblyStep 7While the rice rests, combine onion, lemon juice, chiles, tomatoes, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a small bowl. Toss with a fork to combine, breaking up the onion slices. Let kachumbar sit 5 minutes.Step 8Stir yogurt and remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in another small bowl.Step 9To serve, fluff rice with a fork, making sure Swiss chard is evenly distributed; transfer to a platter. Scatter reserved onion over and arrange chicken on top. (Or for a more casual look, return rice to pot and gently stir in chicken and onion.) Serve with kachumbar and salted yogurt alongside.How would you rate Wali Ya Mboga?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleAmazing flavors!  A new comfort dish on the list of favorites.   My family loved it and asked when we could have it again. Shannon Anchor point AK2/23/2022I loved this dish.  The flavors really popped.  I used spinach, but will try again with kale.  The blend of flavors and textures with the sautéed onions and homemade salsa, along with the roasted sauce, chicken, rice and yogurt, were perfect together.  tjw36Frederick MD2/6/2022Take it easy on the salt. Every step is separately salted and it quickly adds up. I also did not care for the rice this way. There was too much for the amount of chicken and it was very, very soft. However, I will definitely try this meal again. I loved the other ingredients and flavors.AprilTallahassee, Fl2/4/2022The rice bit didn't work out for us.  Very mushy.  Next time we'll just make the rice in the rice cooker as normal.  But the flavors were fantastic.DaveSeattle, WA1/31/2022Perfect comfort food, recipe was straight forward and easy to follow. Unusual but delicious mix of curry with a quasi-salsa. I made this as a weeknight dinner but I would make it for company.\n\nOnly recommendation would be to make sure the pot for the rice is big enough, and to oil the pan for the chicken, I had a lot of sticking and burning. Also it makes a ton of rice but I almost doubled the amount of chicken to compensate.AnonymousOttawa, ON, Canada1/31/2022Explore Bon AppétitDinnerGluten-FreeNut-FreeChickenPoultryChicken ThighRiceRice & GrainsYogurtOther IngredientsEast AfricanAfricanSwiss ChardLeafy GreensVegetableKaleSpinachMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-27", "author": ["Condé Nast", "Zaynab Issa"]}