{"id": "f925c58281310195b9b6d492f18ab8de", "url": "https://www.bonappetit.com/recipe/texas-toast-turkey-sandwich", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Texas Toast Turkey Sandwich Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTexas Toast Turkey SandwichBy Heinz® Mayonnaise November 1, 2018EmailPinterestPrintEmailPinterestPrintEmailPinterestPrintPrep Time15Total Time45Texas Toast, slathered with HEINZ® mayonnaise for a deliciously creamy taste, is the perfect vehicle for this stacked sandwich.Ingredients4 servingsIngredientslarge (12 ounce) sweet potato, sliced into 1/4 inch rounds1/4 cup extra virgin olive oil8ounces of brussel sprouts, trimmed and thinly slicedkosher salt3/4 cup Heinz® Mayonnaise8thick slices of white pullman or country bread2cups Stove Top Turkey Stuffing2teaspoons apple cider vinegar2cups red and/or white cabbage, finely shredded1carrot, peeled and sliced into thin matchsticks12slices of turkey breast, 1/8-in thin3/4 cup cranberry saucePreparationPreparationStep 1Preheat oven to 425°. Toss sweet potatoes with 1 tablespoon oil. Toss brussels sprouts with 1 tablespoon oil. Arrange each on one half of rimmed baking sheet; season with salt and pepper. Roast until golden, 25 minutes.Step 2Heat large skillet over medium. Spread mayonnaise on both sides of bread, 1 tablespoon per slice. Working in batches, toast until golden, 1 to 2 minutes per side.Step 3Increase heat to medium-high. Add remaining oil and stuffing. Cook, turning occasionally, until crisp, 5 minutes.Step 4Whisk 1 tablespoon oil with vinegar. Toss with cabbage and carrot; season with salt and pepper.Step 5Assemble sandwich: Spread remaining mayonnaise on one side of each slice toasted bread. Top 4 slices with slaw, turkey, brussels sprouts, sweet potatoes, cranberry sauce, and stuffing. Close sandwiches.How would you rate Texas Toast Turkey Sandwich?Leave a ReviewTell us what you thinkExplore Bon AppétitSandwichTurkeyPoultryBrussels SproutVegetableSweet PotatoPotatoCabbageLeafy GreensMainNut-FreeRoastThanksgivingLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-02", "author": ["Condé Nast", "Heinz"]}