{"id": "f92f7a0e51c92ab4b73c08c7562ee3c9", "url": "https://www.bonappetit.com/recipe/digaag-qumbe-yogurt-coconut-chicken", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "Digaag Qumbe (Yogurt-Coconut Chicken) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueDigaag Qumbe (Yogurt-Coconut Chicken)By Hawa HassanAugust 27, 20194.8(120)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintWarming cumin, cardamom, turmeric, and ginger make this Somali chicken stew recipe from Hawa Hassan, founder of hot sauce and chutney company Basbaas, a rich aromatic experience. While it’s traditional to serve stews like diaag qumbe with a whole banana (get ready for a delicious study in hot-cold, savory-sweet contrasts) and white rice, Hawa likes to put her own spin on the dish—as all of the women in her family do—by switching in fresh spinach.Ingredients8 servings3medium tomatoes, coarsely chopped (about 6 cups)1red bell pepper, seeds and membranes removed, coarsely chopped2jalapeños, seeds removed if you want less heat, coarsely chopped½cup extra-virgin olive oil2onions, chopped2large garlic cloves, finely chopped11\" piece fresh ginger, peeled, finely chopped (about 1 Tbsp.)1Tbsp. curry powder1Tbsp. ground cumin1tsp. ground turmeric¼tsp. ground cardamomKosher salt1cup plain yogurt1Tbsp. tomato paste1Yukon Gold potato, peeled, cut into ¾\" cubes1carrot, peeled, cut into ¼\"-thick coins2lb. skinless, boneless chicken thighs, cut into 1\" pieces114-oz. can coconut milk3Tbsp. ghee (optional)1cup cilantro, coarsely chopped, plus whole leaves for servingSteamed rice and/or spinach (for serving)PreparationStep 1Blend tomatoes, bell pepper, and jalapeños in a blender or food processor until almost smooth; set aside.Step 2Heat oil in a large pot over medium. Add onion and garlic and cook, stirring often, until beginning to soften, about 5 minutes. Add ginger, cumin, curry powder, turmeric, and cardamom; season generously with salt. Cook, stirring, until very fragrant, about 1 minute. Add reserved tomato mixture to pot and stir well to combine. Stir in yogurt and tomato paste, cover pot, and simmer 10 minutes. Add potato and carrot and continue to cook, stirring occasionally, until vegetables are nearly tender, 15–18 minutes.Step 3Add chicken, coconut milk, ghee (if using), and 1 cup cilantro. Stir to combine, then simmer until chicken is tender and sauce thickens, about 20 minutes. Season with salt.Step 4Divide rice among bowls. Spoon chicken, vegetables, and sauce over. Top with cilantro leaves.How would you rate Digaag Qumbe (Yogurt-Coconut Chicken) ?Leave a ReviewTell us what you thinkReviews (66)Back to TopTriangleI discovered this recipe January 2020 and it's so good I make it once a month, just for myself, so it feeds me for a whole week. The flavors are nice and complex, so it's not something that becomes bland or something I tire of. I eat it just as is, without the rice or spinach, and unfortunately I can't eat bananas. But regardless, it's great. very similar to some indian food and simple and easy to make. AndrewColorado Springs10/14/2021I don't know what Mark from New Jersey did wrong for him to give such a scathing review... but it is completely unwarranted. I followed this recipe basically to a T... (a little more garlic, spices, and veg) but otherwise the same. And it turned out PHENOMENAL! I am EXTREMELY pleased with this dish and will definitely be making it againChelsea KTwin Cities, MN9/9/2021This is NOT a 5 star dish.    Not even a 4 star.     As I type this review, the stars read 5 even though I entered 2.     Stars are not properly updating.        The end result was acceptable but not something I'd make again.     Several technique issues at play.     Stewing the chicken raw without browning first is a mistake in this dish.       Adding the tomato paste raw without a saute is another mistake.        In the end, something was out of balance.     OK but not great and I'm not sure how to fix it.       MarkNJ7/10/2021This recipe is excellent, and goes great with Hawa's Zanzibari pilau as well. My partner is dairy free so subbing in any kind of dairy free yogurt still creates a great creaminess and cohesion in the dish. Anonymous6/23/2021This was incredible and every picky eater in the family loved it!  Added more carrot and potato from previous reviews and totally agree that the sauce can handle the additions. I also tripled the curry and doubled the cumin because that's how we roll!  Didn't have cardamom so threw in some cinnamon. Did take longer to cook the veggies than in the recipe which wasn't a problem other than people were salivating at the aroma and hovering in the kitchen around the stove.  Fed a family of four and still leftovers.   Definitely in the permanent rotation!  MelissaRochester, NY6/3/2021Delicious! Really enjoyed the BA video of the chef making this dish.PGSanta Fe, NM3/4/2021Absolutely wonderful! Makes a ton of food, totally worth the prep work. I second other reviewers' comments that there's quite a bit of sauce -- I upped the vegetables to 16oz of carrots + 2 potatoes and I still had enough sauce to really soak into the rice. I also added 3 jalepenos instead of 2 and it's still really mild (and I'm definitely not someone who handles heat in food well), so no worries to anyone concerned about that.\n\nI REALLY loved this dish when it made it in the summer because those fresh tomatoes made the sauce phenomenal. Not as mindblowing in winter, although I think just using a 28oz can of whole tomatoes (minus the liquid in the can) is better than paying up for bland out of season tomatoes. Still good either way, though!RJacobs2/28/2021SO GOOD!!! the yogurt gives a creamy ness that is irresistible. i used chicken breast and chicken thighs two separate times. both are great, but the thighs give an extra fattiness. served with homemade flatbread (from claire saffitz’s cookbook) and it was A PERFECT COMBO!!Kiersten Wasserman2/21/2021I've made this several times and it's always delicious. I'd recommend making it as the recipe suggests, but in a pinch I've substituted canned tomatoes for fresh and even mild harissa for red pepper and it's still delicious. I've also been lazy and skipped the blending step which also results in still tasty rustic version of the original recipe. AnonymousNew York, NY1/22/2021This recipe was a complete hit and one that everyone asked to be included in the rotation. I kept the jalapeño seeds which gave it more spice but I will say I would give the potatoes a little longer because with the times they gave my potatoes were still a little too firm for my liking. Also added more garlic and turned out delicious. Nick C Atlanta, Ga 1/22/2021This is a definite keeper recipe. The spices are well balanced with nothing overpowering the flavor profile. Just enough heat (keep the jalapeño seeds for more) a real comfort food dish! I followed the recipe to the letter and wouldn’t change anything. I served it over spinach and riced cauliflower with banana on the side. It was wonderful!  DanAlbuquerque 12/24/2020How's this different than a chicken tikka masala? HalNew York, NY 11/23/2020Amazing dish!  I am from India and this has the same flavor profile as many Indian dishes. I didn’t think there was too much chopping at all and I halved the recipe which worked well for my family of 4.  AnonymousColorado Springs, CO11/6/2020Wow, this is one wicked yummy dish.  Not hard. The chopping is not that bad (IMHO) as if I’m doing something off BA or Epi I expect a little work. That said, an hour is too much for a weeknight, but this is an excellent idea to prep on the weekend and have later during the busy work week.  (Thx to the person who suggested sweet potato as I lame brained picking Yukons up at the groc store).  That said, my husband didn’t care for it.  Bummer. Lunch for me!AnonymousReston, VA11/1/2020With the first fall chill in the air I thought, “Dang. Summer is over.” My second thought was “But we can cook Hawa’s awesome dish without sweating to death.” I struggle not to make this every single week from October to April. BA made a grave error in not recognizing and rewarding Hawa’s skills. I preordered “Bibi’s Kitchen,” and I have a feeling it’s pages will soon be stained and well-worn in no time. Everyone, go get that cookbook. AnonymousNew Hampshire 10/5/2020Explore Bon AppétitStewSoups and StewsAfricanChicken ThighChickenPoultryCoconut MilkOther IngredientsTomatoVegetableYogurtEasyOne-Pot MealsWeeknight MealsMainGluten-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-27", "author": ["Condé Nast", "Hawa Hassan"]}