{"id": "f932aed741c7d4e30236427e964b09a7", "url": "https://www.bonappetit.com/story/win-win-coffee-bar-philadelphia", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "Don’t Even Open the Menu at WIN WIN Coffee Bar‚ Just Trust the Bartenders | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsDon’t Even Open the Menu at W/N W/N Coffee Bar‚ Just Trust the BartendersYou’ll be in good hands at this Philly spot.By Emily SchultzJune 28, 2019FacebookTwitterEmailPhoto by Jason VarneyFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.As someone who is extremely online, I read A LOT. Whether it’s a Twitter feud between two people I’ve never met, the homepage of The Cut, an article from the print pages of GQ, or Sally Rooney’s latest book (yes, even I still like to handle paper). So when I’m at a bar after a long day, reading a menu is the last thing I want to do.Thankfully at W/N W/N, a recently renovated coffee shop and bar in Philly, I trust the bartenders to deliver the ideal cocktail simply by prompting them with a light description of what I’d like to drink—no reading required. I know from looking at the back bar alone that they’ll get it right, with all the bottles of small-batch amaro, infused simple syrups, and housemade tepache and kombucha they have. And I know too that when they’re not behind the bar, many of the staff are known to concoct their own experiments at home. (Take Reddy Cypress, who told me his Parmesan amaro that sounds crazy good.) So yeah, it’s safe to say I know they’ll pull out something that impresses.The last time I employed this strategy, one chilly November eve, I ended up with an Amaro I’d never tasted before. It had an intense piney, straight-from-the-Christmas-tree flavor, and came  from a bottle with the old-school Italian label design 20-somethings (read: me) can’t get enough of. It was exactly the right thing to warm me up, and get me excited for the season to come.So trust the process at W/N W/N because the bartenders know exactly what you need—maybe even more than you do.Go there: W/N W/NExplore Bon AppétitRestaurantsBarsPhiladelphiaHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-24", "author": ["Condé Nast", "Emily Schultz"]}