{"id": "f93215f6c57a0556f0f3356d9c284d96", "url": "https://www.bonappetit.com/recipe/baked-cinnamon-toast-with-fruit", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Baked Cinnamon Toast with Fruit Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueBaked Cinnamon Toast with FruitBy Claire SaffitzAugust 14, 20184.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintImagine a mash-up of cinnamon toast, bread pudding, and pie. We’re all about the warm jammy fruit hiding inside this dessert. Covering the whole dish with foil keeps the bread from burning before the fruit cooks through, and weighing the entire thing down with a heavy skillet ensures that maximum syrupy fruit juices soak into the slices.Ingredients8 servings10Tbsp. unsalted butter, room temperature, plus more for pan½cup sugar1½tsp. ground cinnamon½tsp. ground cardamom (optional)Pinch of kosher salt2lb. apples, sliced, stone fruit, cut into thick wedges, blackberries, and/or blueberries1tsp. vanilla extract1loaf challah, brioche, or pullman, sliced ½\" thick (you’ll need 12–15)Maple syrup and vanilla ice cream (for serving)PreparationStep 1Place a rack in middle of oven and preheat to 350°. Butter a shallow 2-qt. baking dish. Mix sugar, cinnamon, cardamom, and salt in a small bowl. Toss fruit, vanilla, and ¼ cup sugar mixture in a medium bowl; set aside.Step 2Spread 10 Tbsp. butter in a thin layer across each slice of bread, working butter all the way to the edges (you mighthave extra butter, depending on the size of your slices). Generously sprinkle remaining sugar mixture over buttered side of bread. Add any leftover sugar to reserved fruit. Fit about half of bread slices along bottom and up sides of prepared dish, placing sugared side down and overlapping slightly. Scatter reserved fruit over and top with remaining slices of bread, placing sugared side up and shingling to cover fruit. Place dish on a rimmed baking sheet and cover tightly with foil. Set a cast-iron skillet on top to weigh down; bake until juices are bubbling, 50–60 minutes.Step 3Carefully remove dish from oven; remove skillet and foil. Bake, uncovered, until golden brown, 10–15 minutes more. Let cool 20 minutes.Step 4Divide baked cinnamon toast among plates, top with a scoop of ice cream, and drizzle with maple syrup.Step 5Do Ahead: Dessert can be baked 1 day ahead. Let cool, then store tightly wrapped at room temperature. Reheat, uncovered, in a 300° oven.How would you rate Baked Cinnamon Toast with Fruit?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis is a delicious breakfast dish!  I used a purchased loaf of challah bread from Whole Foods bakery, sliced 3/4 loaf in half horizontally, rather than slices...added 1 pound sliced (unpeeled) peaches, 8 oz. each blueberries and blackberries.  Otherwise, followed recipe step by step, including weighing dish down w/ cast iron skillet.   \nYes ! I will make this dish again!  Janice ReynoldsKY7/22/2020Explore Bon AppétitCasseroleAmericanCardamomHerbs & SpicesCinnamonAppleFruitBlueberryBerryBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Claire Saffitz"]}