{"id": "f93fae658bb265f0a0c582c923a8571b", "url": "https://www.bonappetit.com/story/what-are-chives", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "What are chives? They're the Ingredient You Should Be Using Way More Of | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Should Be Using More Chives...On EverythingI want so much more than that teeny-tiny sprinkle. Gimme chives by the handful, not the pinch!By Alex DelanyFebruary 22, 2019FacebookTwitterEmailPHOTO BY HIRSHEIMER & HAMILTONFacebookTwitterEmailSome things deserve to be treated with gentleness and care. These things include stained glass, antique photos, and puppies. And then there are the things that don’t, like chives. I’m sick and tired of chives being sliced thinly and sprinkled sparingly over a dish as an afterthought. Chives should not be cast in a supporting role. Chives don't have to be a mere garnish. Chives can stand on their own.It's weird that chives get used so gingerly—they're so much more delicate than other alliums, like onions, to begin with. If logic were to prevail here, less pungency would mean that you would use more, not less of an ingredient. But no, we went the illogical route. So I, a logical person, would like to change that. I want you to put more chives on everything.And I’m not talking about dried chives here. Or the kind that come in that tiny little plastic container, the one that fits like ten chives. I’m talking about a nice, big bundle of fresh chives, deeply green and standing straight up. The chives in those clam containers are half brown when you buy them, and even sadder by the time they get opened for dinner. What you want is a bundle, just like the bundle of scallions you buy. These are most often found at farmers' markets and Asian grocery stores, but some big supermarkets will sell chives by-the-bundle too.But how do I do this, Alex? How do I up my chive levels? Is there some kind of special chive knowledge I need to obtain? Please. Help.I would have gone with even more chives here, but it's a start.\nWhoa. Calm down. No, not really. You just up the dosage. I just checked with the doctor, and she said it was totally fine. If you’re topping crispy smashed potatoes with chives, use many, not a few. If you’re going to chop chives for your scrambled eggs, really go for it. If you want to throw down some chives on your steak, lay down a mean layer of green. What I’m saying is this: Put the pedal to the metal. Turn it to eleven. Go nuclear. Let the chives do the talking.Maybe you’re not ready for that kind of chive dosage just yet. That’s fine. Start small and work your way up. And by small, I mean chop up a hell of a lot more chives than you normally do, and make it rain the green stuff all over everything. The chives can handle it. Your food can handle it. And so can you.About those crispy smashed potatoes:Smashed and Loaded Crispy PotatoesCooking potatoes twice—once in water, and a second time in hot oil—is hands-down the best way to achieve extra-crispy potatoes at home.View RecipeExplore Bon AppétitBasicallychivesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-22", "author": ["Condé Nast", "Alex Delany"]}