{"id": "f9557929445acec021a758258a0e58e0", "url": "https://www.bonappetit.com/recipe/grilled-eggplant-with-garlicky-tahini-yogurt-sauce", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Grilled Eggplant With Garlicky Tahini-Yogurt Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueGrilled Eggplant With Garlicky Tahini-Yogurt SauceBy Brad LeoneJune 2, 20204.4(7)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintYou’ve heard of fully loaded baked potatoes, right? RIGHT? This grilling method gives similar crispy skins and creamy interiors to eggplant, which need just a handful of toppings to get full-on delicious.Ingredients4–6 servings2lb. assorted small eggplant (such as fairy tale and/or Graffiti)2heads of garlic1cup plain whole-milk Greek yogurt1Tbsp. tahiniKosher salt1lemon, halvedSumac (for serving)Brad’s Spoon Sauce (for serving; optional)Ingredient InfoSumac, a tart, citrusy spice generally sold in ground form, can be found at Middle Eastern markets, specialty foods stores, and online.PreparationStep 1Prepare a grill for medium-high indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Grill eggplant over indirect heat, turning occasionally, until completely tender, 1–1½ hours (depending on size and type).Step 2Meanwhile, grill whole garlic heads over indirect heat until cloves are tender and jammy, 40–50 minutes.Step 3Mix together yogurt and tahini in a small bowl; season with salt. Slice heads of garlic in half crosswise and squeeze cloves into yogurt mixture; stir well to incorporate.Step 4Cut a slit lengthwise down each eggplant and carefully pull open with your hands. Arrange on a platter and squeeze juice from lemon over; season with salt. Dollop yogurt sauce around and sprinkle with sumac. Serve with spoon sauce (optional).How would you rate Grilled Eggplant With Garlicky Tahini-Yogurt Sauce?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleYou can’t grill fairytale eggplants for 1.5 hours……Anonymous10/14/2021Very yummy. I don't have a grill so I sliced, salted (and let sit for about 10 mins), and drizzled my eggplant with olive oil and roasted in the oven for about 50 mins on 450. They came out great this way! The sauce was really good -- could've used a bit more lemon, which I might mix into the sauce directly in the future. EmilyDavis, CA9/23/2021Would help if you noted to pierce the eggplant before grilling.  Mine exploded in the grill and went flying everywhere.AnonymousColumbus OH6/13/2020Explore Bon AppétitMiddle EasternEggplantVegetableTahiniCondiments, Sauces & PastesGarlicSummerEasySideVegetarianGluten-FreeHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Brad Leone"]}