{"id": "f956eecbf5ce04dfe530d79301978627", "url": "https://www.bonappetit.com/recipe/hoisin-and-balsamic-glazed-lamb-chops", "year": 2021.0, "month": 3.0, "day": 5.0, "content": "Hoisin-and-Balsamic-Glazed Lamb Chops Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHoisin-and-Balsamic-Glazed Lamb ChopsBy Dalia DavidMarch 29, 20214.7(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintThis recipe from chef Dalia David is exactly the kind of easy yet satisfying dish we crave during “shoulder season,” when warmer weather beckons but a chill still hangs in the air.  The hoisin-and-balsamic glaze—juiced up with butter, toasted sesame oil, gochujang, garlic, and onion— completely envelops the chops with rich flavor and tons of umami. Cooking down the leftover marinade and incorporating it back into the final dish ensures no flavor goes to waste. Given the high sodium content in both hoisin and gochujang, additional salt probably won’t be needed.Ingredients4 Servings⅔cup hoisin sauce2Tbsp. gochujang (Korean hot pepper paste)2garlic cloves, finely chopped½tsp. freshly ground black pepper, plus more¼tsp. plus ⅛ tsp. high-quality balsamic vinegar12lamb rib chops (1–1¼\" thick)1bunch scallions1tsp. grapeseed oil or vegetable oilKosher salt2Tbsp. toasted sesame oil3Tbsp. unsalted butter, divided1medium onion, finely chopped1tsp. toasted sesame seedsPreparationStep 1Purée hoisin, gochujang, garlic, ½ tsp. pepper, ¼ tsp. vinegar, and ⅔ cup water in a blender until smooth. Place lamb chops in a baking dish and pour marinade over; turn to coat. Let sit at room temperature at least 15 minutes.Step 2Meanwhile, arrange scallions on a rimmed baking sheet and drizzle with grapeseed oil; turn to coat. Season with salt and pepper; set aside.Step 3Heat sesame oil in a large high-sided skillet over medium-high; add 2 Tbsp. butter. Working in 2 batches, remove lamb chops from marinade, letting excess drain back into dish, and cook in a single layer until golden brown, about 3 minutes per side for medium-rare. Transfer to a platter; set marinade aside.Step 4Add onion to drippings in skillet and cook (still over medium-high), stirring occasionally, until golden brown, about 10 minutes. Add reserved marinade and bring to a simmer. Reduce heat to medium and cook, stirring occasionally, until thickened, about 2 minutes. Stir remaining ⅛ tsp. vinegar into sauce and remove from heat.Step 5Drizzle ½ cup sauce over lamb chops. Let remaining sauce in skillet cool 1 minute, then transfer to a blender. Add remaining 1 Tbsp. butter and 2 Tbsp. water and purée until smooth. Transfer to a small bowl and set dipping sauce aside.Step 6Wipe out skillet (or use a medium skillet if you prefer) and heat over medium-high. Cook reserved scallions, turning often, until charred in spots, about 3 minutes.Step 7Arrange scallions on platter next to lamb chops and sprinkle sesame seeds over lamb. Serve with reserved dipping sauce alongside.How would you rate Hoisin-and-Balsamic-Glazed Lamb Chops?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI'm confused.  There is at least 20 minutes of preparation AFTER the lamb has been cooked and is resting on a platter.  I can't imagine that the chops won't be cold by that time and probably well into a medium-well state.  Have I missed something here?ColoBillDenver, CO12/17/2021Hi! Chef Dalia here. I made this recipe and I'm commenting here to answer your question. Don't recommend making with chicken but it's great with any cut of beef or even venison. Dalia DavidNew York, NY10/27/2021these turned out great!megtampa8/8/2021Why are people's questions never answered? Doesn't anyone at Bon Appetit read recipe comments?AnonymousCalifornia6/8/2021Would this work with chicken?Deb JSacramento CA5/23/2021Lovely fast Easter lunch. Made my own hoisin sauce and sautéed baby broccoli in the cooking juice 😋Caroline JGOrlando, FL4/4/2021ho man this looks amazingAB3/31/2021Explore Bon AppétitLamb ChopLambMeatWeeknight MealsMainDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-29", "author": ["Condé Nast", "Dalia David"]}