{"id": "f9618dae284785a60dcea06b633ae91f", "url": "https://www.bonappetit.com/recipe/new-mexican-breakfast-burrito", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "New Mexican–Style Breakfast Burritos Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueNew Mexican–Style Breakfast BurritosBy Eric SeeSeptember 14, 20214.3(43)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintRoll up to Ursula, a New Mexican cafe in Brooklyn, any given morning and you’ll likely find a long line of people waiting for the same thing: chef Eric See’s breakfast burritos. He modeled his burritos after the ones served at Golden Pride, a drive-thru burrito chain he grew up with in Albuquerque. “There are two ingredients that are non-negotiable in New Mexican–style breakfast burritos: shredded hash browns and New Mexico chiles,” See says. You can customize everything else in this breakfast burrito recipe based on what’s in your fridge. For the dried New Mexico chiles in the sauce, See recommends Made in New Mexico’s sun-dried red chiles. For jarred green chiles, he reaches for Zia Hatch Chile Company’s roasted and jarred chiles.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonBox Grater$13 At AmazonMesh Sieve$13 At AmazonFlexible Metal Spatula$9.99 At AmazonSmall Saucepan$155 At AmazonIngredientsMakes 2Sauce10–12dried New Mexico chiles (about 2 oz.), seeds removed3garlic cloves, smashed¼tsp. Mexican oregano¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt1Tbsp. plus 1½ tsp. all-purpose flourBurritos8oz. fresh chorizo, breakfast sausage, or plant-based sausage1large russet potato (about 10 oz.)¾tsp. garlic powder¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more¼tsp. freshly ground black pepper, plus more3Tbsp. extra-virgin olive oil, plus more4large eggs1Tbsp. chilled unsalted butter29\"–10\" flour tortillas1cup shredded cheddar¼cup jarred New Mexico green chilesPreparationSauceStep 1Combine dried chiles, garlic, oregano, and 2 cups water in a small saucepan; add more water if needed to cover chiles. Bring to a simmer over medium heat. Cook until chiles are soft, 10–15 minutes.Step 2Transfer chiles and cooking liquid to a blender; purée until smooth. Strain red chile sauce through a fine-mesh sieve back into pan; discard solids. Whisk in salt and flour and bring to a simmer over medium heat. Cook, whisking constantly, until thickened, 5–7 minutes.Do ahead: Sauce can be made 1 week ahead. Transfer to an airtight container; cover and chill.BurritosStep 3Remove chorizo from casings if needed and place in a small saucepan. Add 1 cup red chile sauce. Cook over medium heat, stirring often and breaking up sausage with a spatula, until sausage is cooked through, 8–10 minutes.Step 4Meanwhile, peel potato and grate on the large holes of a box grater. Transfer to a fine-mesh sieve and rinse under cold water to remove excess starch; drain well and pat dry. Transfer potato to a medium bowl. Add garlic powder, ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and ¼ tsp. pepper and toss to coat.Step 5Heat 3 Tbsp. oil in a medium nonstick skillet over medium-high. Add potato, pressing gently. Cook, undisturbed, until a golden brown crust forms, 5–7 minutes. Break up potato with a spatula and continue to cook, stirring occasionally, until golden brown all over, 6–8 minutes more (add more oil if pan seems dry). Transfer hash browns to a plate.Step 6Return skillet to medium heat. Add eggs and butter; season with salt and pepper. Cook, stirring with a heatproof spatula, until eggs are glossy and just set, about 3 minutes. Scrape eggs onto a plate and wipe out pan.Step 7To assemble burritos, place tortillas on a work surface. Arrange half of hash browns, scrambled eggs, cheese, and chorizo mixture in parallel strips across center of each tortilla, leaving a 1\" border on left and right sides. Spoon half of green chiles over each. Fold in sides of tortillas and roll up tightly.Step 8Place burritos, seam side down, in pan. Cook over medium-high heat until sealed and light golden brown, about 2 minutes. Turn over and cook until light golden brown on other side.How would you rate New Mexican–Style Breakfast Burritos?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangle*hash browns, not “hash” and refried beans NOT “refrigerator beans”. (I know I typed both of those correctly.) Thanks auto-corrupt 🙄WKathrynBBAlbuquerque, NM2/6/2022*refried! Beans *hashbrowns! I know that I typed both of those words correctly sorry for the correction.I know that I typed both of those words correctly sorry for the correction.WKathrynBBAlbuquerque, NM2/6/2022Born-and-raised and living in ABQ now I  see nothing fundamentally wrong with chorizo in a breakfast burrito. No, Golden Pride doesn’t offer it as an option, but plenty of other LOCAL places do, so enough with the *well I never!* vapors over chorizo. I do occasionally get a chorizo BB, but my personal favorite (at GP) is #2 carne adovada w/hash, or #7 carne adovada w/refrigerator beans. They have some of the best carne adovada in the city IMO. Back to the recipe review… Having lived in Dallas (no fresh NM green chile in the 80’s) and Boston (also no fresh NM green chile in the 90’s) there are decent jarred options available to places outside of New Mexico. My go-to is the 505 brand for jarred, but Bueno frozen Autumn Roast is better. We all do the best we can with what we have available. Breakfast burritos are supposed to be a delicious and easy way to have a breakfast on the run. Making breakfast burritos is a pain. That’s why you go to Golden Pride for them! Lucky for those folks in Brooklyn who have a Burqueno to make theirs for them! 😃WKathrynBBAlbuquerque, NM2/6/2022from NM, regularly return for family visits.  I agree with \"wildly entitled\" comment by Orale505.  when you are away from home, needs must when the devil drives.  these are similar to what I used to make for the kitchen staff at the old Casablanca (next to La Fonda in the  '70's - served lunch then nightclub in the evenings) as well as The Haven Restaurant up on Canyon Rd.  bottom line, don't break your arm patting yourself on the back for being able to get fresh fire roasted - just because you live on third base doesn't mean you hit a triple.MowerF15Durham, NC12/22/2021Orale505 - you are right on! The differences of opinion in the comments goes to show the passion Nuevo Mexicanos feel about their BBs. I too love the #11 at GP and since I've gone gluten free, I get it without the tortilla. For those who think you can't get a chorizo BB, I guess you've never been to El Parasol where they make a great BB w/chorizo and diced potatoes instead of hash browns. The only commonality of NM BBs, in my opinion, are eggs and chile.SF505Santa Fe, NM9/27/2021There are some wildly entitled and ignorant comments on here. Not everyone has access to fresh New Mexican chile, most of our country lives outside of New Mexico so of course a jarred option is listed here. And nowhere does it say to fry the burrito that everyone keeps talking about, the last step says to toast it which you should absolutely do to your tortilla at some point!\n\nAs another ABQ native, not a friend's cousin who lived there in college, I can attest that my favorite burrito at Golden Pride is the number 11. and guess what, it DOES have sausage. But were you hoping for a recipe on how to cook two strips of bacon? I'm just happy to see some New Mexican representation here and this burrito looks damn delicious. Orale505Burque9/26/2021My best friend moved to New Mexico more than 40 years ago and I’ve been visiting ever since. Lived there for 7 years while attending UNM and I have never seen a breakfast burrito that looked like this, or was made with chorizo. Not saying it can’t be done, just saying I would argue that this recipe would ever be considered authentic by locals. Some people like Christmas, but usually it’s going to be red OR green. I would never eat this. I’m green all the way!  LolJAGPortland, OR9/26/2021I'm trying to think of a Golden Pride/Frontier Restaurant (same co. but better) burrito that this resembles. At a loss. This seems to be a Christmas (red+green) chimichanga variant. Breakfast burritos are not fried. Potatoes (hash or homefry), chile (red/green) and eggs are the core. Bacon or carne adovada is more common than chorizo. Do try to get fresh NM chiles and roast them instead of getting canned ones.AnonymousABQ9/26/2021I've had breakfast burritos in San Diego and LA.  The SD used hash browns and LA used rice.  Both prevent dripping of watery sauces like Pico de Gallo.Bud9/26/2021The basics of this recipe are fine.  However, as a local, (I am sitting here in my home town of Santa Fe) in my humble opinion, neither potato nor rice should ever be in any kind of burrito.  It is true, it is common to find them included here; but when I get a burrito to go locally, I always ask for no potatoes (or no rice).  If I am ordering in, I will ask for the potatoes on the side if they are indeed hashbrowns.  In a burro, these are pure redundant fillers that double the bad carbo load (I love carbs, but not the dumb kind), needlessly increase the calories and the muffle both the mouth feel of the burrito and the layers of flavor in the eating of it.  Another thing that happens here (or rather doesn't happen) that I don't like, is the burritos are rarely grilled/browned on the outside after they are assembled.  At home, or if I get one to-go and take it home, I in fact char or blacken the sides of my burritos (even if I am going to smother or sauce it); this step adds a distinct layer of flavor and crunch to the experience.  Just my little peeves.  Green chile (hot) is essential; but at home I also add lots of good-for-you ingredients, like pico de gallo, grilled vegetables, chopped spinach or kale and oh! sour cream.RodoSanta Fe, NM9/26/2021First we usually use chicken broth not water in red chile sauce, we NEVER use jarred green chiles…omg! And we very rarely ever see burritos with sausage or chorizo. It isn’t very common and we NEVER fry the tortillas. I have never seen that is ANY place I have every been…..Anonymous9/26/2021Truthfully this recipe is just ok…too salty and we do not fry the tortillas. We used chicken broth usually instead of water for sauce. In my area we don’t use chorizo or sausage in ours very often and we NEVER use jarred green chiles! YIKESAnonymousSanta Fe, NM9/26/2021yes! Hashbrowns and New Mexican Chile. Thanks for repping NM food.AnonymousNM9/24/2021delicious red chile sauce! very authenticavocado galSanta Fe, NM9/24/2021Actually, the non-negotiables are flame roasted green chile and fresh, made from scratch flour tortillas.  T_ABQ_NMAlbuquerque 9/24/2021Explore Bon AppétitBurritoWrapBreakfastChorizoSausageMeatRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Eric See"]}