{"id": "f96849665effe1fe57cc59691adfb809", "url": "https://www.bonappetit.com/recipe/jalapeno-cornbread-with-dairy-free-cilantro-lime-honey-butter", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Jalapeño Cornbread with Dairy-Free Cilantro-Lime Honey Butter Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginhealthyishJalapeño Cornbread with Dairy-Free Cilantro-Lime Honey ButterFacebookPinterestTwitterEmail6 - 8 servingsPrep Time: 10 minActive Time: 25 minThis dairy-free cornbread is made with a kick! With the delicious taste of Country Crock® Plant Butter with Avocado Oil, this recipe could be made for all occasions: a side dish, a breakfast treat or even dessert.PrintIngredientsDry Ingredients:1 ¼ cup cornmeal 1 cup all-purpose flour½ cup raw turbinado sugar1 Tbsp baking powder½ tsp baking soda½ tsp saltWet Ingredients: 5 Tbsp Country Crock® Plant Butter with Avocado Oil - plus a little extra 15 oz canned full fat coconut milk2 eggs¾ cup jalapeños, ribs and seeds removedFor dairy-free cilantro-lime honey butter:½ cup cilantro, leaves and tender stems4 Tbsp Country Crock® Plant Butter with Avocado Oil1 Tbsp honey1 lime, zested then juicedRecipe PreparationMake the cornbread:Preheat your oven to 400°F. Grease a 12” cast iron skillet with the room temperature Country Crock® Plant Butter.In a large bowl, combine the dry ingredients. Then add the wet ingredients. Stir until just combined, then fold in the chopped jalapeños. Pour batter into the greased skillet.Bake 20 - 25 minutes until edges are beginning to brown and a toothpick or cake tester inserted into the center comes out clean. Let cool for at least 15 minutes before slicing.Make the dairy-free cilantro honey butter:While the cornbread is baking, make the honey butter by mashing Country Crock® Plant Butter, honey, cilantro leaves, half of the lime zest, and half the lime juice together with the back of a wooden spoon until thoroughly combined.Serve your dish:Garnish the cornbread with the remaining lime zest. Serve your warm cornbread with a generous slathering of the cilantro-lime honey butter, plus extra on the side.Recipe by Country Crock® Plant ButterReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredHealthyishMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Country Crock", "Plant Butter"]}