{"id": "f9694c114a6a74b0ee7d6d84d6857709", "url": "https://www.bonappetit.com/story/3-easy-rum-cocktails", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "3 Easy Rum Cocktails Made with Rum, Lime Juice, and Sugar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRum + Sugar + Lime = 3 Perfect Summer CocktailsWhen the summer heat won't stop, it's time for rum.By Al CullitonJuly 13, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically's resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.We’ve finally made it to summer and, as we often forget when in winter’s clutches, the once dreamed-of bliss of July is kind of a lie we tell ourselves. It’s painfully hot, and the humid air is so thick you feel resistance with every step. Since it already feels like you're in the tropics, why not bring a little rum to wherever you live? It will cure your heat-induced exhaustion and make your skin feel just a tad less sticky.Way back in the 1700s, rum was called kill-devil—once a term for a brazen adventurer, it evolved into a shorthand for rotgut booze—and its rakish reputation has carried on for most of the spirit’s existence. Perhaps you’re surprised that I’m writing about rum in a serious way with regard to cocktails because you or someone you know spent a bit too much time with the Captain at some point. I think they call that college? There's no judgment here, but I am eager indeed to show you the very good side of rum, if you don’t know it already.Most often made from molasses, a byproduct of refining sugar, rum can also come from fresh sugarcane juice. Whatever the base product, it’s fermented and then distilled in a multitude of styles. Today we’re going to focus our attention on a very fine white rum (yes, they exist) and an aged rum. The distillation process is the same, but the big difference is that the second one takes on different characteristics as it ages. There’s a sweetness to both, but the first is lighter in body and flavor, with fruity notes, while the second is—as a result of the aging process—more vanilla-y, with a weightier mouthfeel.We’re about to make three great cocktails, and they’ve all got rum, sugar and lime, so get ye to the store.Shopping List:1 bottle white rum (try Denizen Aged White)1 bottle aged rum (Appleton Reserve is my fave)A dozen limesMintDemerara sugarAngostura bittersSodaAs is true of many a great night of cocktail-ing, you’re going to begin with a little prep session. First, we’re making a rich demerara syrup. (Daiquiris can be made with a couple different types of simple syrup, but this one will work best for all our drinks today.) Rich syrups are typically 2:1 ratio of sugar to water, and are so named because they’re heavier and more viscous than a 1:1 syrup. Demerara refers to the type of sugar, which is an large-grain, amber-colored variety. (If you’re looking for a grocery store brand, Sugar in the Raw falls in this category.) First, measure out 1 cup demerara sugar and ½ cup boiling water. Combine in a container and stir until sugar is completely dissolved. Allow your syrup to cool. Now, juice about eight limes, reserving a few for later.The DaiquiriNow we’re ready to start with the most elemental, classic rum cocktail there is: the Daiquiri. You may associate daiquiris with monstrous, frozen, way-too-big, chain-restaurant drinks, but the cocktail wasn’t always like this. The original version is an import from Cuba. Classified as a sour (a.k.a. a cocktail with booze, citrus, and sweetener), a proper daiquiri has legitimate universal appeal.How to make it: Take your cocktail shaker and pour in 2 oz.  rum, 1 oz. lime juice, and ½ oz. of the rich syrup you so deftly made. (Use the white rum for a breezier beverage and the flavor-packed aged rum for something a bit more rich.) Add ice and shake hard for 12 seconds. Strain into a coupe or other stemmed cocktail glass. That’s a Daiquiri, and that first one is for you.The MojitoNow, with that same base of rum, lime, and sugar, we’ll build a drink that’s taller and more relaxed: a mojito. This one also came to the US from Cuba and is an ideal drink for that long backyard hang on a summer afternoon.How to make it: Slice a few lime wheels, making a slit in each from the center out to the peel. Your wheels should be thin but not so thin that they won’t stand up straight when installed on the lip of a glass. Pick eight mint leaves and, while you’re at it, identify a really nice mint sprig to use as garnish. Drop the mint leaves into your shaker tin and add the following: 1½ oz. white rum, ¾ oz. lime juice, and ½ oz. rich demerara syrup. Shake hard for 12 seconds.Strain into a tall, straight-sided glass such as a Collins or highball, and top with soda. Garnish with a lime wheel and that mint sprig, being sure to give the mint a quick slap against the palm of your hand to release the oils beforehand. (This might look silly, but it works. Trust me.)The Rum Old-FashionedFinally, we’ve got something that you can make for your guests before a late summer dinner. This stirred cocktail is a beautiful marriage of the traditional rum old-fashioned and a Caribbean classic, the Ti’ Punch. A rum old-fashioned is typically made with aged rum, sugar in some form, and bitters. Ti’ Punch, which is very popular on Martinique and other Francophone islands, relies on un-aged rhum agricole (which is made from sugarcane juice instead of molasses), cane syrup, and lime and often prepared without ice.How to make it: Cut just the very ends off  1 lime and cut it into eight wedges. Take your rocks glass and throw in two lime wedges. Add ¼ oz. rich demerara syrup and 3 dashes Angostura bitters. Gently muddle the limes with the syrup and bitters. Add 2 oz. aged rum and a few cubes of ice (or one big cube!). Stir for a good ten seconds. Now hand it to your friend who “doesn’t like rum” and watch them change their mind.I do believe that you’ve got yourself a good old kill-devil party on your hands. Shake and stir the heat away and you may even feel a pleasant tropical breeze! If not, keep sipping and crank up the air conditioning.Al Culliton is a writer, bartender and consultant living in western Massachusetts. She is an alum of the beloved Red Hook bar and restaurant Fort Defiance and owns her own cocktail company, Al’s Bar. Al enjoys poring over menus and cocktail books from bygone eras, touring the New English countryside, and cooking for her partner at home.Explore Bon AppétitHappy Hour with AlBasicallyCocktailRumSummer DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-13", "author": ["Condé Nast", "Al Culliton"]}