{"id": "f97090ba34174d05f9dddff6422ead36", "url": "https://www.bonappetit.com/recipe/coconut-ice-cream-sandwiches", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "Coconut Ice Cream Sandwiches With Salty Chocolate Shell Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCoconut Ice Cream Sandwiches With Salty Chocolate ShellBy Bill ClarkJune 27, 20214.6(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Micah MortonEmailPinterestPrintEmailPinterestPrintThese chewy brown sugar and coconut cookies, filled with vanilla ice cream and dipped in a salty chocolate shell, are better (and more impressive!) than any store-bought frozen novelty.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonMedium #40 Cookie Scoop$16 At AmazonMedium Saucepan$39 At AmazonSilicone Spatula$13 At BA MarketLarge Bowl$18 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketWhisk$10 At AmazonMedium Bowl$17 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketParchment Paper$3 At AmazonIngredientsMakes 6Cookies¾cup (packed; 150 g) light brown sugar½cup (1 stick) unsalted butter, room temperature1large egg1tsp. dark rum or vanilla extract1¼cups (156 g) all-purpose flour1cup sweetened shredded coconut1tsp. baking soda1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1pint vanilla or coconut ice creamChocolate Shell2cups bittersweet chocolate chips¼cup refined coconut oil½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltFlaky sea saltPreparationCookiesStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Beat ¾ cup (packed; 150 g) light brown sugar and ½ cup (1 stick) room-temperature unsalted butter in the bowl of a stand mixer fitted with the paddle attachment (or a large bowl if using a hand mixer) on medium speed until light and fluffy, about 5 minutes. Scrape sides and bottom of bowl with a rubber spatula and beat again to combine. Add 1 large egg and 1 tsp. dark rum or vanilla extract and beat until combined and fluffy.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Whisk 1¼ cups (156 g) all-purpose flour, 1 cup sweetened shredded coconut, 1 tsp. baking soda, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a medium bowl to combine.Step 3Add dry ingredients to brown sugar mixture all at once and mix on low speed until well combined. Scrape sides and bottom of bowl with spatula and beat again to incorporate.Step 4Line 2 rimmed baking sheets with parchment paper. Using cookie scoop, scoop 12 heaping rounds onto prepared baking sheets, spacing about 2\" apart. (If you don’t have a #40 scoop, make each cookie about 2 Tbsp.)Step 5Bake cookies, rotating front to back and top to bottom after 5 minutes, until edges are golden and solid but centers are still a little underbaked, 11–13 minutes.Step 6Remove cookies from oven and smack baking sheet hard on counter a couple of times—be firm! This will cause the cookies to collapse in the center and keep them chewy.Step 7Let cookies cool on baking sheets, then gently transfer all of the cookies to 1 baking sheet, arranging in a single layer. Chill cookies in the freezer until cold and firm, about 15 minutes.Step 8While cookies are chilling, let 1 pint vanilla or coconut ice cream sit on counter at room temperature until pliable (but before it’s melted), 10–15 minutes.Step 9Scoop a heaping ¼ cup ice cream onto bottoms of 6 cookies. Top with remaining 6 cookies, bottoms facing down. Gently press sandwiches together until ice cream is even and almost at the edge all the way around.Step 10Chill ice cream sandwiches in the freezer until firm and set up, at least 10 minutes.Chocolate ShellStep 11Pour 2 cups water into a medium saucepan and set a medium heatproof bowl on top of pan. Bring water to a simmer over medium-high heat.Step 12Combine 2 cups bittersweet chocolate chips, ¼ cup refined coconut oil, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in bowl and heat, stirring occasionally with a clean spatula, until chips are melted and combined. Remove from heat and keep chocolate shell mixture warm over water. (You can also melt chocolate shell mixture in a microwave-safe bowl in the microwave at medium-high power in 20-second increments.)Step 13Remove cookies from freezer and, working one at a time, dip half of each sandwich in chocolate shell. (Store any extra chocolate shell in the refrigerator—it keeps almost indefinitely and can be reheated for ice cream sundaes or as dip for fruit, cookies, and even potato chips.) Place sandwiches back on baking sheet and sprinkle with flaky sea salt as you go. Chill in freezer until set before serving, at least 15 minutes.Do ahead: Ice cream sandwiches can be made 1 month ahead. Transfer to an airtight container, stacking with sheets of parchment paper between each layer, and freeze.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronHow would you rate Coconut Ice Cream Sandwiches With Salty Chocolate Shell?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThese were DELICIOUS! The cookies turn out huge, however, and we found that the sandwiches were way too big for one person to eat. Next time will make smaller cookies.CatherineSan Francisco12/5/2021Succulent cookies! My batter was very  soft and needed a few minutes chilling before shaping and baking.  Make sure ice cream (or vegan ice cream) reaches close to the edge of the two cookies before dipping. \nI used Miyokos vegan butter. The salty tang compliments the sweet perfectly! I will be making these for company!Pushkin23Albany, NY7/16/2021I had unsweetened coconut so I added some agave nectar which provided needed sweetness.  I used a scant tablespoon of dough for each cookie and ended up with 22 cookies or 11 sandwiches. I followed all the directions including dipping the frozen cookies into the chocolate. When the frozen bars hit the hot chocolate, eventually drops of ice cream landed in the chocolate. \nAnd the melted chocolate did what melted chocolate \ndoes… it seized.  I used a knife and managed to spread \nthe chocolate on half of each sandwich. For some\nreason the chocolate didn’t harden but it did harden on the ice cream sandwiches made with store bought cookies. This is my first time using homemade cookies for this project and I likely will not do it again. For the amount of work the end result was just okay. However, I’m sure my guests will enjoy them. Bite by EveChicago 7/4/2021How can I substitute dried coconut for the sweetened shredded coconut? My husband is extremely sensitive to the sulfites in sweetened coconut so I need a substitute workaround. What do you suggest?AnonymousEtna, Wtoming7/1/2021Flavors were good! The cookies are the best part here. Here are my notes if I make them again:\n- these cookies are GIANT, I think I would go fairly smaller and aim to get 8 sandwiches instead of six \n- You probably want more than a pint of ice cream, I used a pint but there isn't a ton of ice cream in these\n- CHILL longer than what is suggested above. You want everything to be nice and cold before moving on to the next step HannaVirginia6/30/2021Explore Bon AppétitCookieDessertIce CreamFrozen DessertAmericanCoconutFruitChocolateOther IngredientsSummerBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-27", "author": ["Condé Nast", "Bill Clark"]}