{"id": "f97884a38a072b7287fd56709dbd15f9", "url": "https://www.bonappetit.com/story/summer-bean-salad-recipe", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "A New Take on Three-Bean Salad with Way More Fried Garlic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA New Take on Three Bean Salad with Way More Fried GarlicOut with the canned beans, in with the fresh.By Emma WartzmanJune 4, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailI know you see bean salad in the photo above, but let’s talk about that scattering of mahogany-colored garlic cloves. Garlic imparts a pungent, spicy base to whatever it’s added to, makes your kitchen smell delicious, keeps away the vampires, and keeps away people you don’t want to kiss. But like most foods, garlic is even better when fried.The genius of this Charred Bean and Pea Salad is not the fact that it takes less than 30 minutes (including clean up), or that it can be made ahead, or that it celebrates two of the most underrated categories of summer produce (beans and peas!). No, the genius comes from the fried garlic, which is fried in oil that is then used for the dressing. Double garlic, double win.Senior food editor Claire Saffitz, who developed this recipe, set out to make some summer side dishes that are lighter, modern riffs on classics (shout out to this spicy kimchi slaw and this romesco pasta salad, both of which are on my To Cook ASAP list). This one takes its inspiration from a three-bean salad, only instead of sad canned beans we’re using fresh. Instead of chopped raw onion, we’re using that fried garlic I just went on about. And instead of white sugar and vinegar in the dressing to give a sweet and acidic balance, we’re using maple syrup and lime juice. Wholly more interesting, more dynamic, and more delicious. (Not to mention that three-bean salad tends to be kind of, well, unattractive, and this dish is seriously beautiful.)You start the recipe with a simple dressing— ⅓ cup olive oil, some peeled and thinly sliced ginger, black pepper, whole cumin seeds, two dried chiles de árbol, and six cloves of garlic, all simmered together in small saucepan over medium heat for under 10 minutes. As it’s simmering, swirl it occasionally. In between swirling, measure out 2 tbs. of lime juice and 1 tsp. of pure maple syrup and put them in a bowl together with enough room to add the oil when it’s done.You’ll know that the oil is done when the garlic is looking toasty and the whole thing is as fragrant as a bouquet of roses, only superior because it’s garlic, not roses. (If the cloves come apart a bit, even better because that means more bites of fried garlic.) Turn off the heat and add it in the lime juice and maple syrup that you set aside. It’s all going on in there now: layers of spice from the chiles, garlic, and pepper, maple-y sweetness, tang from the lime, heat from the ginger. Whisk it all together and your dressing is done.Place the beans and peas on a wire rack set inside of a rimmed baking sheet and drizzle them with 2 tbs. of olive oil (though you don’t have to measure exactly, a few glugs right out of the bottle will do). Season generously with salt, toss so that everything is coated evenly, and then spread them out in a single layer. Broil until they’re tender and blistered all over. You could also do this on a grill or in a cast-iron skillet. No matter the method, though, don’t walk away because beans and peas only take about four minutes to cook through before they become mushy. Once you pull them out of the oven, let them cool.When you’re ready to serve, pile up the beans and peas on a platter, add a sprinkling more of salt (I like a super flaky kind, like Maldon), and spoon over the dressing, letting the fried pieces of garlic fall on top so that people can gawk at those oily, golden brown nuggets.Get the recipe:Charred Bean and Pea SaladA riff on a three-bean salad with a garlic-chile-maple-lime dressing that we can’t quit.View RecipeExplore Bon AppétitGarlicSaladSalad DressingGreen BeanSugar Snap PeaRead MorecookingRomanos Are the Queen of Snap Beans and I Want to Eat Them AllBy Christina ChaeySpicy Kimchi SlawRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-04", "author": ["Condé Nast", "Emma Wartzman"]}