{"id": "f97dae0603da8ae30a18196ed1d02cba", "url": "https://www.bonappetit.com/city-guides/los-angeles/venue/freedmans", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Freedman's Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlos angelesFreedman'sThe Silver Lake Jewish deli that successfully straddles old-school and new-waveFacebookPinterestTwitterEmailAlex LauGO: to be transported to the Jewish deli’s alternate universe, where the half-sour pickles come in salad form, the matzo balls are light as air, and the toilet is decorated with 24-karat gold trim. Welcome to Freedman’s, one of our 2018 Hot 10 winners.ORDER THE: tender brisket carved tableside with a battery-operated Waring knife, the genius half-sour salad, extra-crispy latkes straight out of the waffle iron, airy matzo ball soup, and corned beef-stuffed Reubens.THE VIBE IS: like a cooler version of your great uncle’s den. There’s tons of dark wood, like the handsome bar that used to be a fireplace mantle; and wallpaper galore, from modern Escher-like prints to 1940s deadstock florals. It makes you want to order another martini, sink a little deeper into the caramel-hued banquettes, and hang out all night.PRACTICAL STUFF: Open Tuesday to Thursday, 11:30 a.m. to 2:30 p.m. and 6 p.m. to 10 p.m.; Friday, 11:30 a.m. to 2:30 p.m. and 6 p.m. to 11 p.m.; Saturday, 10:30 a.m. to 2:30 p.m. and 6 p.m. to 11 p.m.; and Sunday, 10:30 a.m. to 2:30 p.m. and 6 p.m. to 10 p.m. Closed Mondays.WE ALSO LOVELanger'sL.A.’s unbeatable pastrami sandwich (sorry Katz's)BotanicaSpend the whole day in Silver Lake at this breezy, vegetable-laden all-day spotSqirlIt’s not a restaurant, it’s a Silver Lake community with a major cult followingExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-11-12", "author": ["Elyse Inamine"]}