{"id": "f9ade186ea8b34ecdd8c23ce1ea700ee", "url": "https://www.bonappetit.com/story/cottage-cheese-sexiest-summer-ingredient", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "Your Summer Needs More Cottage Cheese | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Summer Needs More Cottage CheeseIt’s the season’s sexiest ingredient. Prove me wrong.By Amiel StanekAugust 19, 2019FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Pearl JonesFacebookTwitterEmailBon Appétit editor at large Amiel Stanek has spent years trying to help readers get dinner on the table as quickly and efficiently as possible. So when he gets to cook for himself, he likes to slow things down and be a little...extra. This is Not So Fast, a column dedicated to his favorite ingredient: time.Ah, the flavors of August! Achingly ripe tomatoes glossy with olive oil. Neon-colored Italian ice melting in the sun. Hot, sweet blueberries burbling in a fresh-out-of-the-oven pie. As much as these highly seasonal delights scream “IT’S SUMMER, BABY!” with full-throated vigor, I’m here to turn you on to an ingredient that, in my humble opinion, has just as much of a place in the pantheon of hot-weather delicacies: cottage cheese.Yep, you heard me right: curdy, cultured, salty-sour cottage cheese—a dairy product that more people probably associate with senior citizens’ discounts than summer Fridays. But before you balk, I ask you to think about the other milk-based products that we don’t think twice about consuming in the high summer heat. We deploy sauces made from gussied-up ricotta and tangy Greek yogurt with abandon. What is cottage cheese but yogurt with more texture, or ricotta with more character? We giddily tear apart juicy wads of burrata and garnish them with all manner of peak-season produce. But how different, I ask you, is humble cottage cheese from the creamy, curdy stracciatella inside these fancy-sounding dairy balls?If we’re going to litigate the appropriateness of enjoying cottage cheese in the summertime, let this surprisingly refreshing salad be exhibit A: There’s a tumble of salted summer tomatoes, cucumbers, and scallions sitting pretty atop a raita-esque puddle of grated radishes mixed with large-curd cottage cheese. Served fridge cold, it’s a riot of flavors and textures—crunchy, juicy summer produce, spicy radishes, tart-rich dairy—and a better accompaniment to buttered corn and grilled sausages than coleslaw or potato salad could ever hope to be.Don’t you just want to dive right in?\nPhoto by Chelsie Craig, food styling by Pearl JonesThis wonky-sounding salad is inspired by majówka (pronounced MAH-youf-KA), a salad that my dad, who spent the first 14 years of his life in Poland, would make for us every summer. (It’s worth mentioning that no amount of Googling on my part has ever turned up another instance of a salad by this name, though apparently the word itself translates to “picnic,” which certainly supports my summertime cottage cheese thesis.)  But I like to think of it as a Polish Caprese of sorts. There are certain key differences that distinguish my version of the dish from my dad’s. Not to drag him—though I owe it to my mom to do so, considering the public shaming I gave her fruit salad a few years back—but his majówka is not the most...photogenic of dishes. Rather than “plating” the dish in any real way, he tosses all of the veggies together with not only cottage cheese but sour cream as well. (The two make up the secret ingredients in his mashed potatoes too). It’s delicious, to be sure, but looks more like a giant bowl of onion dip than anything most people would consider a “salad.” Mine’s cuter, Dad. Sorry! I love you!But the key technique at the core of both dishes remains the same. All of the vegetables get prepped individually—cukes cut into wheels, radishes grated, scallions sliced, tomatoes chunked—and are then salted generously and left to sit, ridding them of any excess water and concentrating their distinct flavors. It’s a small step, but an important one—a modest investment of time (half an hour!) that ensures that sweet, sweet cottage cheese doesn’t get too watered down.Welcome to the Summer of Cottage Cheese.Get the recipe:For the Love of Cottage Cheese SaladIf the idea of cottage cheese in a summer tomato salad sounds weird to you, try to think of it like a caprese that just got back from a little Eastern European vacation.View RecipeExplore Bon AppétitNot So FastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-19", "author": ["Condé Nast", "Amiel Stanek"]}