{"id": "f9b77ebfe8c58b1ec4977d0a8601ae64", "url": "https://www.bonappetit.com/story/marie-kondo-kitchen", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Even Marie Kondo’s Favorite Tupperware Will Give You Tupperware Envy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMarie Kondo’s Kitchen Is So Tidy, She’s Trying to Fill It With StuffWe talked to the declutter queen about the kitchen tools that spark the most joy.By Alex BeggsJanuary 11, 2019FacebookTwitterEmailCourtesy of Denise Crew/NetflixFacebookTwitterEmailMarie Kondo has one struggle. She’s 4’7” and these American kitchen counters are too damn high. “I’m always on my tippie toes!” she laughs. She’s brought an entourage to visit the Bon Appétit offices (messy) and Test Kitchen (“systematically organized!” Kondo declared). We’ve got her husband, two KonMari colleagues, and her interpreter, Marie Iida, the unsung hero of Kondo’s new Netflix show, Tidying Up with Marie Kondo. We’re chatting in the tasting room, a sort of prop kitchen where we host events and shoot branded videos. It’s therefore the tidiest place in our office, complete with a fig tree, and Kondo loves it.Kondo, impressed at Test Kitchen manager Gaby Melian’s spice cabinet.\nPhoto Courtesy of Marie KondoIn the show, Kondo helps American families declutter their home over a month’s span. It’s like Hoarders Lite. There’s a lady who has too many Nutcrackers (Kondo will never tell her she has too many, but I’m telling you, she has too many)—a tame problem compared to the garages full of feral starving kittens on Hoarders. Tidying Up is like a vitamin, making the viewer energized to envision a cleaner, more organized home, filled with neat stacks of underwear folded into files.In her mega-bestseller The Life-Changing Magic of Tidying Up, you declutter your house in a certain order. Clothes first, then books, papers, komono (miscellany), and sentimental items. The kitchen section, within komono, doesn’t get as detailed as other sections. It’s less about a vegetable peeler sparking joy, and more about learning to appreciate the utility the tool offers, and by the time you’ve tidied your clothes, books, and papers, you have more of a sense of what should stay and what goes to Goodwill. We were curious about what Kondo cooks and how she keeps her own kitchen—are there mismatched mugs and old pickle jars?! She was kind enough to give us a glimpse.Instagram contentThis content can also be viewed on the site it originates from.The last thing I cooked was a rice dish cooked in fish stock, made in my donabe. I got the cooking bug last January. I’ve always liked it, but when I got married, my husband was very much into cooking. So I got into it too. The first thing I cooked was a chicken soup that my mother taught me the recipe for.The kitchen tool that sparks the most joy for me is my donabe. I have three. Each has a different purpose, making miso soup or making rice.Typically, I start the day with tea. Green, white, or matcha. I like to make miso soup and rice. I prepare a little bento box for my daughter before she goes to school with Japanese omelet, sweet potato, chicken, and onigiri.Instagram contentThis content can also be viewed on the site it originates from.Then I almost always end the day with amazake, which is a traditional sweet, lower non-alcohol Japanese drink made from fermented rice.The most horrifying thing I’ve seen in a client’s kitchen was canned food that had expired 40 years ago. That was a surprise for me.Most people have too many tongs! And disposable plastic cutlery, what you get when you get delivery food, and packets of sauces. So many of them.When it comes to the plasticware* problem we should be using the same brands. I use Noda Horo’s white porcelain containers with bamboo lids, which is popular in Japan. It makes it looks much neater and easier to keep track. I always encourage my clients to keep the box part and the lids separate. The lids you can store standing upright, but the box should be stacked together. This way, you can maximize your storage space.I don’t have 100 spices, no. In Japan, you don’t use many spices. You’d much rather use liquid condiments, such as soy sauce, sake, and mirin, so those are all kept in jars. I only have five types of spices in my kitchen. Black pepper, salts, cumin powder, turmeric.A condiment that’s always in my fridge is salted rice malt. You used to season meat before you prepare it. It makes meat very tender, and very flavorful.I take out the garbage twice a week. I wait until the trashcan is completely full. We do have a separate trash can for raw trash that gets composted.The last thing I KonMaried from my kitchen was nothing! I have the opposite problem. I always have very few items in the kitchen, so right now I’m actually adding to it. Recently I’ve replaced my cutting boards to something that truly sparks joy for me, made from Gingko trees. I’m also in the market for a big, sharp knife.*We can’t call it tupperware for legal reasons lol.Watch Tidying Up with Marie Kondo on Netflix here.Explore Bon AppétitGet OrganizedCleaningPeopleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-11", "author": ["Condé Nast", "Alex Beggs"]}