{"id": "f9ba51e1c9ebdd16565aa6519e001f33", "url": "https://www.bonappetit.com/story/kyocera-ceramic-knives", "year": 2021.0, "month": 11.0, "day": 3.0, "content": "Kyocera Ceramic Knives Stay Sharper, Longer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Perfect Knife Set Doesn’t Exi—Kyocera’s ceramic trio stays sharper for longer.By Zaynab Issa, as told to Nico AvalleNovember 18, 2021FacebookTwitterEmailPhoto by Isa Zapata, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.When it comes to knives, I’m on team “less is more.” Those 16-piece sets might seem essential when you’re shopping, but in the end you’re probably going to end up using only a few of them while the rest collect dust—or worse, rust. If I mostly cook vegetarian dishes, do I really need to waste space on an 8-inch cleaver? No way. I live in an apartment, meaning there is no room on my counters for nonsense.For a long time I owned just a standard chef’s knife and a serrated knife for bread. But a couple of years ago I picked up this set of three Kyocera ceramic knives to round out the pack. Unlike knives forged with metal, ceramic blades are made from a substance called zirconia, which can be made astoundingly sharp and don’t lose their edge as quickly as steel blades. You may recognize the 5.5\" chef’s knife in this set from Emily Mariko’s viral cooking videos on TikTok, where you’ll hear the knives producing some of the purest kitchen ASMR sounds I’ve ever heard. While I haven’t thrown away my steel chef’s knife, the Kyocera has definitely become my go-to tool for cutting just about everything. It feels comfortable and nimble in my hand; it’s easy to clean thanks to the fuss-free soft plastic handle and the fact that ceramic literally cannot rust; and the razor-sharp blade makes easy work of turning mountains of veggies into tidy piles of finely chopped mise.TikTok contentThis content can also be viewed on the site it originates from.Of course, it doesn’t matter how sharp a knife is when you buy it if it doesn’t stay that way. That’s where a ceramic blade comes in handy. My first six months of cutting with this Kyocera set felt like the first few days with a freshly sharpened steel chef’s knife. The Japanese zirconia Kyocera uses is nearly as hard as diamond, meaning it doesn’t dull in the same way steel does. Treat the knives right and they’ll feel satisfying to chop with for a long, long time. The flip side of that is that they’re a bit delicate. I wouldn’t recommend cutting bone-in meat or hard veggies like winter squash with a ceramic knife (here’s where you need that cleaver) because you risk chipping the blade, but just about everything else is fair game—so long as you’re not using a glass cutting board. Ever!Kyocera 3-Piece Ceramic Knife Set$85 at AmazonThe chef’s knife is worth the trio’s price tag on its own. But the set also includes a slightly smaller 4.5\" utility knife, which I typically use for quicker jobs like chopping carrots or as a backup when the full-size knife is dirty, and a 3\" paring knife that’s perfect for tasks like cutting stems from strawberries, peeling veggies, and slicing hunks of hard cheese. Even though the 5.5\" Kyocera ceramic knife remains my favorite, the minimalist in me has been surprised by how often I reach for the other two. Don’t get me wrong, they’re playing support roles, but whenever a recipe calls for precision, I’m happy to have them nearby.My only real quibble with this knife set is that they require a little extra pampering. Even though I haven’t had to sharpen mine for the two years I’ve owned them (and they’re still cutting through fruits and veggies like softened butter), if they do eventually dull, a whetstone won’t be able to help. Because of their diamond-hard strength, ceramic knives require special care. If you normally send your knives out for sharpening, be sure your service can handle ceramic materials. And if you prefer to do things yourself, Kyocera also sells a special diamond knife sharpener for keeping your tools as sharp as the day you opened the box.These days I’m deploying my knives to prep hearty greens, autumnal veggies for soups, and flavorful aromatics for dense, comforting braises. My trio is up to the task, and with Thanksgiving around the corner, they’ll be my go-to tools for slicing up green beans and mushrooms, salad upon salad, sprouts, and sweet potatoes. Now, would you look at that, maybe I’m a maximalist after all.Explore Bon AppétitHighly RecommendShoppingCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-18", "author": ["Condé Nast", "Zaynab Issa", "As Told To Nico Avalle"]}