{"id": "f9be472aab6d4ecf05fc7e5e7b02fb48", "url": "https://www.bonappetit.com/recipe/cbd-mango-smoothie", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "CBD Smoothie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCBD Mango SmoothieBy Andy BaraghaniApril 29, 20195.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintTo give this smoothie some heat, add a pinch of crushed red pepper flakes and a little bit more salt before you blend. We developed this recipe using a 1,000 milligram (mg) bottle of Lily CBD. It's part of the Healthyish Guide to Cooking With, Eating, and Truly Enjoying Weed in collaboration with Broccoli. Click here to read more about how to make cannabis delicious.Ingredients2 servings1mango, peeled, chopped1banana, chopped11\" piece ginger, peeled, finely grated½cup unsweetened coconut water½tsp. CBD oil½tsp. ground turmericPinch of kosher saltPreparationPurée mango, banana, ginger, coconut water, CBD oil, turmeric, salt, and 1 cup ice in a blender until smooth. Divide between glasses.How would you rate CBD Mango Smoothie?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleHave you ever felt sick to your stomach after taking CBD oil? Rachel_ATexas, America8/13/2020Explore Bon AppétitCold DrinkDrinks AllSmoothieMangoStone FruitFruitBananaCannabisHerbs & SpicesQuickDrinksSnackDairy-FreeGluten-FreeVegetarianRawVeganNonalcoholicHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-29", "author": ["Condé Nast", "Andy Baraghani"]}