{"id": "f9c8116502637b39fc3e7cc74ada7036", "url": "https://www.bonappetit.com/story/led-grow-lights", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "These Tiny LED Grow Lights Keep My Houseplants Alive and My Sanity in Check | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Tiny LED Grow Lights Keep My Houseplants Alive and My Sanity in CheckNo natural light? No problem!By Elyse InamineJune 11, 2021FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!Every time I check on my plants, I talk to them. I encourage them to hang in there! after I notice droopy leaves or brown crusts forming along the edges. I quietly command them to not die as I pinch their stalks, dread washing over me when I realize they’ve turned to mush.These conversations are one-sided, but somehow the tone of them has recently taken a turn. “Wow, where did all these leaves come from?” I’ll ask my dwarf ZZ, surprised and impressed that it’s alive. “You look so good,” I’ll tell my very pink Chinese evergreen that was looking very frail (and crispy?!) just a few months ago. My little chats with my plants are no longer desperate and self-flagellating but an inadvertent pat on the back for me, a former plant noob who has blossomed into an actual plant parent. And it’s all thanks to my GrowLED plant lights.GrowLED Umbrella Plant Grow Light$28 $22 at Amazon$22 at WayfairBefore I owned these lights, zero plants survived living in my apartment. ZERO. Let that sad statistic sink in. As I spent more time at home in the past year, more time reading blogs and following expert greenthumbs on IG, and more time obsessing over my plants, I realized that the biggest threat to them thriving in my apartment was actually a lack of natural light. I clung to this fact partially because it absolved me and partially because it made total sense. My apartment has gigantic windows (10 feet tall!) but it’s gridlocked between office buildings, meaning it gets no direct sunlight and feeble indirect sunlight. Even low-light plants like succulents struggled sitting on my window ledges.So I took matters into my own hands and got a two-pack of these LED lights, mainly because they wouldn't make my apartment look like a rave at night. They come in sleek matte hues (white, blue, yellow!) and are shaped like tiny umbrellas with a dare I say mid-century-modern look. Also, I noticed the keywords “Ideal for Plant Grow Novice” in the item name (GrowLED gets me).The lights are easy to install. You just attach the cord to the lamp itself, connect it to an outlet (get an extension cord if your plants aren’t close to outlets since the GrowLED cord itself is short; less than five feet), plunge the pointed tip of the lamp into your plant’s soil, and you’re done! They come with a timer, if you don’t want to think about turning the lights on and off, but I like to play God, switching the lights on once the sun sets and turning them off before I go to sleep. The light is 4000K, a warm light that is apparently ideal for plants since it has a good amount of blue light for regulating intake of water and carbon dioxide and yellow light for growth (thank you, blogs and plant experts!). The lamp itself is small but has an adjustable height, so it can grow as your plants do.It's been six months since I’ve started using the lights, and they’ve forever changed my work-from-home life. Everyone is thriving.Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-11", "author": ["Condé Nast", "Elyse Inamine"]}