{"id": "f9d1f2e98b8e75954cd97019a74feaf6", "url": "https://www.bonappetit.com/story/easiest-roast-chicken-recipe", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "An Easy Roast Chicken Recipe for the Chicken Hall of Fame | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Easiest Roast Chicken You'll Ever MakeYou don't even need a thermometer to know when it's done.By Alyse WhitneyFebruary 20, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailRoasting a whole chicken sounds a lot more complicated than it actually is. You don't have to be Ina Garten on a Friday night to make it happen—this easy roast chicken recipe has six ingredients (including salt and pepper), can be prepped in five minutes, and you don't even use a thermometer to check its doneness. Stress-free is somehow an understatement.First thing's first: preheat your oven to 425°. While it gets toasty, halve a head of garlic crosswise (aka turn it on its side and slice through), do the same to a lemon, and remove the seeds. (I forgot to and it was fine—just make sure to pick them out later.) Put them aside while you tend to your bird.Photo by Alex LauPlace a 3-4 lb. chicken on a cutting board, breast-side up and legs pointing toward you. Take the sharpest knife you own and carefully cut about a 3\"-long incision into the loose skin between the leg and breast on both sides until you get to the joint between the leg and the body. This is going to make it easier for heat to circulate and allow you to easily test if the chicken is cooked. (A twofer!)Do some gynmastics with your bird to season along the backbone!\nPhoto by Alex LauGuess what? That's the only knife work you need to do until you carve the chicken, but let's not get ahead of ourselves here. Next you have to generously season the bird with kosher salt and pepper. When we say \"generous pinch,\" we mean \"four-fingered pinches of salt.\" Really go for it. Get into every nook and cranny, including the skin, along the backbone, the cavity, and the part of the leg you just exposed.Photo by Alex LauOnce you're done seasoning, put the chicken breast-side up in a large skillet—anything ovenproof and 12\" or bigger works, whether cast iron or stainless steel—and arrange the lemon and garlic cut-side down around the chicken (as artfully as you'd like). Drizzle chicken with 3 Tbsp. melted butter to help encourage browning (but you can also use olive oil) and roast in the center of oven for 45-60 minutes. I roasted sweet potatoes wrapped in foil on my lower rack while the chicken was cooking, but you could also nestle potatoes or other vegetables in the pan for an easy side dish.Slow motion butter drizzle.\nPhoto by Alex LauNow comes the scary part: testing the chicken to see if it's done. Around the 45-minute mark, take the pan out of the oven and give it a look. Is the skin crispy and brown? Good sign. Now pierce the meat in the leg joint and see if the juices run clear. If they're rosy pink, it needs more time—stick it back in the oven for five minutes and check again (and repeat if necessary). I roasted a 4.5-lb. chicken, so I had to go about an hour and 15 minutes—you can adjust time for larger birds.Photo by Alex LauIf you're like \"I don't know what color the juices are?!\" there are a few more ways to check. Lightly shred some meat on the thigh (close to the bone) and see if the meat is opaque. The meat should separate easily into shreds. If the fibers of the meat don't come apart easily, put it back in the oven. When you wriggle the chicken leg, it should move around without too much resistance. Still unsure? Try pressing lightly on the chicken breast. If it feels firm, you're probably in the clear.Now, just be patient and let the chicken rest for 15 minutes before carving so the juices don't run out and leave you with a dry bird. Not really sure how to carve a chicken? Let me show you.Photo by Alex LauStart carving by removing the leg and thigh. The thigh joint should separate easily from the carcass.Photo by Alex LauSeparate the leg from the thigh joint with a sharp knife.Photo by Alex LauFollow the breastbone to carve the breast, using the cartilage as a guide for your knife. Cut the wing joint and separate the underside of the breast from the breast plate/ribs.Photo by Alex LauTo finish, remove the wings by first taking off the flat and then removing the drumette. (Perfect for snacking on before you serve).Photo by Alex LauIf you're still confused, here's a video of how to carve a chicken, which is what I watched for a refresher beforehand. Grab a loaf of bread, because you're going to want to soak up all the lemony, garlicky pan juices. Squeeze the halved garlic bulbs into the pan and whisk them in for sweet roasted garlic goodness. You'll never need to buy rotisserie chicken again.Get the recipe:No-Fail Roast Chicken with Lemon and GarlicOnly 6 ingredients, and you'll always know when it's done.View RecipeExplore Bon AppétitBasicsChickenroast chickenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-03-14", "author": ["Condé Nast", "Alyse Whitney"]}