{"id": "f9d6d1ff27eec52f040842f35b621e39", "url": "https://www.bonappetit.com/recipe/thai-roast-chicken-thighs-with-coconut-rice", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "Thai Roast Chicken Thighs With Coconut Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesThai Roast Chicken Thighs With Coconut RiceBy Diana YenMay 20, 20214.6(261)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, food styling by Micah Morton, prop styling by Nicole LouieEmailPinterestPrintEmailPinterestPrintChicken thighs marinated in coconut milk, lime juice, and fish sauce give this one-skillet meal plenty of umami. Lining the skillet with cabbage wedges allows them to catch every drop of the rich juices as they become melt-in-your-mouth tender. While the chicken roasts, there is plenty of time to make fragrant rice with the leftover coconut milk and slices of ginger. This dish was inspired by the rotisserie chicken from the now closed Uncle Boon’s, one of my favorite restaurants in New York. They had it on rotating spits with heads of cabbage to catch all the juices. This at home version with thighs is a more approachable way to highlight all those good flavors. —Diana YenAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonBrush$7.99 At AmazonMedium Saucepan$39 At AmazonMicroplane$16 At AmazonIngredients4 servingsZest and juice of 1 lime11\" piece ginger, peeled, finely grated, plus 3 peeled slices2garlic cloves, finely chopped⅓cup coconut palm sugar or (packed) light brown sugar¼cup fish sauce113.5-oz. can unsweetened coconut milk, divided2Tbsp. extra-virgin olive oil, plus more for brushing2tsp. freshly ground black pepper, plus more2lb. skin-on, bone-in chicken thighs (4–6)½medium head of green cabbage, stem trimmed, sliced into 1\"-thick wedges½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more1cup white jasmine rice, rinsed until water runs clearCilantro leaves with tender stems and lime wedges (for serving)PreparationStep 1Whisk lime zest and juice, grated ginger, garlic, coconut palm sugar, fish sauce, ½ cup coconut milk, 2 Tbsp. oil, 2 tsp. pepper in a large bowl to combine. Set ¼ cup marinade aside for serving. Place chicken in remaining marinade and toss to coat. Cover and chill at least 1 hour and up to 12 hours.Step 2Preheat oven to 400°. Generously brush cabbage wedges on both sides with oil; season with salt and pepper. Arrange, a cut side down, in a medium cast-iron skillet. Remove chicken from marinade and set, skin side up, on top of cabbage; season with salt and pepper. Roast 35 minutes. Increase oven temperature to 450° and continue to roast, rotating pan halfway through, until chicken thighs are browned and crispy, 5–7 minutes more.Step 3Meanwhile, bring rice, ginger slices, remaining 1 cup coconut milk, remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, and 1 cup water to a boil in a medium saucepan over medium-high heat. Reduce heat, cover, and simmer until liquid is absorbed, 15–20 minutes. Remove pan from heat. Fish out and discard ginger slices. Re-cover pan and let rice sit until ready to serve. Step 4Arrange chicken on a platter; drizzle with reserved marinade and top with cilantro leaves. Serve with coconut rice and lime wedges for squeezing over.How would you rate Thai Roast Chicken Thighs With Coconut Rice?Leave a ReviewTell us what you thinkReviews (67)Back to TopTriangleDelicious!! Roasted cabbage always wins. Half a Serrano pepper in the leftover sauce goes a long way.Lanuchan3/25/2022Really tasty.  The sauce pulls it all together!KateSanta Monica, CA3/21/2022Great recipe! Like others I added red pepper flakes. Will definitely make this  one again.Mountainman NorCal 3/6/2022This one's a keeper! A little red pepper flakes is a nice addition.  Anonymous2/27/2022Shockingly rich and well rounded / complex flavor for relatively little effort. Outstanding cabbage. A delightful combination that I will use to introduce people to the wonders of fish sauce. JaycSeattle2/22/2022Braising is my new favorite cooking technique. I marinated the chicken for about 2 hours and it was delicious. Husband asked that it get added to the rotation. I agree that this dish needs some heat. Served with chili garlic sauce. Perfect. Jenna C. California 2/9/2022Soooo delicious, the chicken was so tender and the rice and cabbage were perfectAnonymousPhx Az2/3/2022A good basic recipe but to make it Thai, it needs a few more ingredients - lemongrass, lime leaves, and most importantly, a chili or two. I will give it a try with these additions.TuvaVancouver1/27/2022Delicious. Definitely needs more cabbage to sop up the fantastic juices. I sprinkled the seasoned cabbage base with red pepper flakes, which gave it just a little pop of heat. Loved the coconut rice. A really terrific dish.VickiVancouver, Canada1/24/2022After I made this my husband said - this is the best executed dish you’ve made in over a year. It came together quickly and easily and was flavorful. My 10 month old loved it. I only had boneless skinless so added those after the cabbage had roasted for 15 minutes. I also added in the marinade with the chicken to the cabbage mixture. Next time I would use an entire head of cabbage and probably add some Serrano or jalapeño.AJSeattle1/19/2022This works.   The cabbage part was intriguing which is always a hook for me.  When I saw the marinade and the set aside juice I decided to cook them both up.  Glad I did as (of course) it had a great taste and silky texture. Perfectly safe - not any different from cooking raw meat in a typical Thai curry.  And anyway the set aside juice looked thin and unattractive.  AnonymousVaison La Romaine  1/18/2022Wonderful recipe! Lovely flavour combination, our entire family enjoyed including my 3 year old who can be a bit picky. Great use for the humble cabbage as the cooking method brings all the flavours together when braising - turns out SO GOOD. If you're hesitating on trying this, do not, it's one of my favourite recipes from the many I've made over the years from B.A. Diana Yen, you are a superstar for sharing this recipe with us.. thank you!NicoleCanada1/13/2022Made this tonight and it was excellent! Only used 1/3 cup of brown sugar and that was definitely enough sweetness. Used brown jasmine rice so had to supplement the remaining coconut milk with water and some more salt but was still delicious. Absolutely making this again.JamieWashington, DC1/11/2022Yesterday was a disaster in the kitchen. Including not realizing I should have been marinating this chicken while I reworked my meal prep lunches plan since I forgot two of the main ingredients for the intended recipe. \n\nSO: marinated the chicken for a wee bit while reloaded dishwasher and prepped rice. Patted chicken dry and seared it. After chicken was crisped up, set it to the side, poured off some of the oil, and seared cabbage in the pan. Then added chicken back on top, pouring in the marinade. Brought to boil, then tossed in oven ‘til chick was at temp. SO GOOD. And the rice?? Ridiculous. Will be doing this again ASAP. AnnWinston-Salem, NC1/10/2022Awesome recipe! I made it for the family before the holidays and it was delicious.  My wife and I went back on  low carb after  New Years, so last night made it with SPLENDA subbed for sugar and added fresh French green beans w/ the cabbage, and we hardly missed the rice--delicious.Anonymousmorehead city, nc1/6/2022Explore Bon AppétitThaiSoutheast AsianAsianChicken ThighChickenPoultryCoconut MilkOther IngredientsGreen CabbageCabbageLeafy GreensVegetableRiceRice & GrainsEasyMainDairy-FreeGluten-FreeSimmerRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-20", "author": ["Condé Nast", "Diana Yen"]}