{"id": "f9d866ebdd3d5880ce60456f92a0188e", "url": "https://www.bonappetit.com/story/cheesy-broccoli-skillet", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "This Cheesy Broccoli Recipe Might Be Best Thing I’ve Ever Made | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Cheesy, Crispy Broccoli Skillet Might Be the Best Thing I’ve Ever MadeI cook for a living and \"Broccoli Delight\" is my kids' most-requested recipe.By Carla Lalli MusicJune 18, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Michelle GattonFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed.Broccoli Delight was born on a night when I came home from work very hungry and without a plan, and my near-empty fridge came through for me.It's also a dish that my teenage son claims is the “best thing you make.” While this could be construed as an insult considering how many other things I’ve made for him, I’m pretty sure it’s meant as a compliment, and that what he’s getting at is that pan-roasted broccoli florets bound to one another by melted-crispy sheets of cheese never disappoints.To make Broccoli Delight, you need five ingredients, not counting salt: a head of broccoli (cut into florets, with plenty of stem attached), extra-virgin olive oil, aged cheddar cheese, a lemon, and crushed red pepper flakes. Add a generous coating of olive oil to a preheated cast-iron pan over medium-high heat, then add the broccoli (try to arrange the cut sides down), season with salt, and let cook, undisturbed, until the undersides are dark brown and the florets are bright green, 4 to 5 minutes. Toss everything around and let the broccoli cook a few minutes longer, until the new undersides take on some color and the stems are crisp-tender, another 5 minutes or so (but taste one to find out).While that's happening, crumble about 4 ounces of cheddar (or your other favorite melting cheese) into ½” pieces, then sprinkle them over the broccoli. The cheese will immediately melt and some will start to drip down into the spots between the florets and onto the hot surface of the pan. Whatever lands there will bubble and brown into cheese sheets. The rest of the cheese will softly melt onto the florets without getting crispy, and that’s just what you want. One cheese, two textures.When all of the cheese has at least softened and started to melt, and the cheese that’s on the pan is golden brown and bubbling, Broccoli Delight is done. Give it a pinch of crushed red pepper flakes for a little pizazz and serve it with lemon wedges to squeeze over top and you’ve got a winner of a dish. I'm in the habit of making tuna salad to go with Broccoli D., but you don’t have to. It could be a side for any kind of quick protein, or you could just eat the entire batch on its own, by yourself.It’s weird thinking my best recipe work is behind me, but if this is the dish I peak with, I’m okay with it.Broccoli, you're the bomb:Crispy Roasted Broccoli with Tahini SauceHigh heat and the simplest sauce ever make for roasted veggies that feel like a dish, not an afterthought.View RecipeExplore Bon AppétitIt's That SimpleBroccoliCheeseCast ironRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-18", "author": ["Condé Nast", "Carla Lalli Music"]}