{"id": "f9dd24ab79fcac1bf7df0f3c448b6f45", "url": "https://www.bonappetit.com/story/kyla-peal-restaurant-diary-3", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "Restaurants Are Eager to Get Back to 'Normal,' But Status Quo Isn't Enough | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsRestaurants Are Eager to Get Back to “Normal,” But Status Quo Isn’t EnoughIn her third Restaurant Diary entry, wine educator Kyla Peal talks about creating restaurants that are not only COVID-19-safe but also more equitable.By Kyla Peal, as told to Angela BurkeApril 7, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week you’ll hear from one of them: bartender turned brand ambassador Jenny Feldt, line cook Peter Steckler, farmer Kristyn Leach, and wine educator Kyla Peal. Here, Peal shares the gaps she is seeing as restaurants rush to reopen without addressing the reckonings on racism and sexism within the industry, what a path forward for restaurants can look like, and how her wine education company, Slik Wines, is keeping these issues in mind. Read Peal’s first and second diary entries here.In Chicago, when winter finally breaks, the city comes alive. Everyone’s out and patio season is in full effect! We’ve recently had a few unseasonably warm days, which have been good for restaurants because they must maximize business during the short-lived season. Currently, restaurants in Chicago are able to operate at 50 percent dining-in capacity, and there’s talk of that increasing soon. But as establishments reopen, I’m concerned that a focus on COVID safety precautions, which are extremely critical, will tamper down the urgency for systemic change instead of elevating both. Restaurants are eager to go back—to pre-pivot operations, to indoor dining, to normal. But for me, and a lot of others, status quo isn’t good enough.To be clear, I didn’t expect sexism and racism to end overnight simply because Marie, Danielle, and I started our wine education company, Slik. But after last year—with a lot of chef-owners and management being called out for the way they handled themselves, their businesses, and the folks they employ—I just expected this new chapter of reopening to include some type of awareness. I thought there would be an attempt at building and maintaining a healthy environment for hospitality workers that addresses the disparities we’ve been talking about nationally for the past year—and a lot longer within industry circles.Part of me feels like it was easier for some to acknowledge living in dual crises—coronavirus and racial injustice—when we were at the height of it. After all, last year we were at home, connecting through our screens, so it was very easy for restaurant brands to post a black square and a quick sound bite of support. But that was just P.R. Now—now it’s time for action.Photo by Alex J. RiveraI’m not even sure restaurants know how to fix the issue. A lot of restaurants and businesses have started to implement these diversity programs because of what’s been going on, but such initiatives fall short of any substantial change. There’s no quick fix. In order for any measure to have a meaningful impact, those in power must center staff in the conversation. But there’s an underlying fear about having those talks. Perhaps because some have never done it before. Perhaps because some don’t want to be held accountable.Those conversations require restaurant managers and owners to educate themselves and maybe even bring in someone who specializes in facilitating them. We don’t have anything on Slik’s site on how to begin doing that work—though, I love that idea—so for now, I’d refer anyone to a resource like CHADD (Chicago Hospitality Accountable Actions Database) to start. Next steps would include cultivating a more equitable work environment, which means allowing employees, especially Black and brown ones, to flourish within the establishment. So, don’t keep someone as a backwaiter for five years without any opportunity for upward mobility. It’s not only important to have a diverse group working in the restaurant—it’s also about getting them into positions of management and giving them space to reimagine how the restaurant functions.With reopening and the weather warming up, our events at Slik are slowing down slightly. We’ve made the decision to keep all of our programming virtual for now. Whenever we decide it’s safe for us to host in-person events—and not just when the city designates a particular capacity level—we will. But I don’t see us ever fully parting ways with the digital aspect of our business, and we’re not going to base our actions on everyone else’s. We’re lucky that we don’t have to contend with the same kinds of pressures that most restaurants have right now.Recently, we had our first pay-what-you-can blind tasting of the year on Zoom and the class went really well. I like to keep our blind tastings super casual and fun. It’s interesting to see what people get out of a wine and what it reminds them of. There’s an intimacy and a level of trust that comes with gathering in a tasting group. There’s always one or two folks who want to know about my journey in wine and we usually have a few who have worked in restaurants—they’re often most outwardly excited about me leading the tasting. Because of their familiarity with the restaurant industry, they know how uncommon it is to see Black women in positions of authority on wine. Part of my job as a wine educator is to prompt us to explore the breadth of wine and consider all of its possibilities, among them the people who work with it.Explore Bon AppétitRestaurant DiariesCoronavirusWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-07", "author": ["Condé Nast", "Kyla Peal", "As Told To Angela Burke"]}