{"id": "fa03e672245e1ae5674830c0a17c8995", "url": "https://www.bonappetit.com/recipe/bulgogi-style-eggplant", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "Bulgogi-Style Eggplant Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueBulgogi-Style EggplantBy MaangchiDecember 2, 20193.8(39)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Kat BoystovaEmailPinterestPrintEmailPinterestPrintThis recipe is one of our favorites from Maangchi's Big Book of Korean Cooking, our December 2019 pick for BA’s Cookbook Club. We like to think of this sweet and salty dish as a sort of vegetarian bulgogi. Marinating and pan-frying eggplant keeps it firm, flavorful, and chewy—almost meaty. The marinade glazes it as it cooks, so it glistens. Prepared this way, the eggplant looks very special, even though the recipe is easy. It’s a versatile dish that makes a great side for rice and many other preparations. The eggplant tastes wonderful right off the stove, but it’s even better after a few hours, when all the flavors have had time to mingle and deepen. Seek out Korean eggplants, if possible, which are sold in Korean markets. They are thinner than ordinary eggplants and the skin is more tender. But regular eggplants work, too.Excerpted from Maangchi’s Big Book of Korean Cooking: From Everyday Meals to Celebration Cuisine ©️ 2019 by Maangchi. Photography ©️ 2019 by Maangchi. Reproduced by permission of Houghton Mifflin Harcourt. All rights reserved.Ingredients4 side servings¼medium onion, finely chopped (about ⅓ cup)3garlic cloves, finely chopped1scallion, chopped¼cup rice syrup or 2 Tbsp. sugar1Tbsp. soy sauce2tsp. gochugaru (coarse Korean hot pepper flakes)1tsp. toasted sesame oil1Tbsp. plus ½ tsp. kosher salt1lb. eggplants (preferably Korean)1Tbsp. vegetable oil1tsp. toasted sesame seedsPreparationStep 1Mix onion, garlic, scallion, rice syrup, soy sauce, gochugaru, sesame oil, and ½ tsp. salt in a medium bowl until well combined.Step 2Cut eggplants crosswise at 3\"–4\" intervals, then slice pieces ½\" wide by ¼\" thick.Step 3Put eggplant strips in a large bowl and add 1 Tbsp. salt. Toss well by hand until all eggplant is salted. Let sit, tossing every 5 minutes, for 20 minutes.Step 4Drain eggplant; discard liquid. Take up handfuls of eggplant and squeeze tightly to remove excess liquid, then return to large bowl. Add marinade to bowl with eggplant and mix together well. Cover and chill 30 minutes.Step 5Heat oil in a large heavy skillet over medium-high and swirl to coat pan evenly. Add marinated eggplant and spread evenly in skillet. Leave to sear for a few minutes, until bottom is lightly colored. Turn with a spatula or tongs and cook until other side is lightly browned, 2–3 minutes. Reduce heat to medium and continue to cook, pressing eggplant into pan and turning from time to time, until eggplant is cooked through and glazed and any excess marinade has evaporated, 5–6 minutes.Step 6Transfer eggplant to a plate. Sprinkle with sesame seeds. Serve hot or cold.Step 7Do Ahead: Eggplant can be made 3 days ahead. Store in an airtight container and chill.How would you rate Bulgogi-Style Eggplant?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleOk dish, the aubergine didn’t need the salt. Added crispy tofu that had also been marinated. Quite an intense dish that needed a few other elements to round out, a bit of acidity would have balanced it out. AnonymousSydney, Australia12/16/2021This was delicious. Even my vegetable hating partner liked it. cherieeCanada9/19/2021I grow Japanese eggplants in Earth boxes.   I have an abundance of eggplants and am always looking for new recipes.  First of all I recommend to only use Korean, Chinese or Japanese eggplants. They are long and thin.  They have a much more delicate flavor.  Secondly soak your eggplant in water but DO NOT SALT.  My daughter-in-law is Japanese.  No one salts eggplant in Japan.  When you soak them in water you will notice that the water turns brown. I have used this method for years.  My dishes never have a bitter taste. Thirdly I love this marinade.  It is has that lovely hot and sweet taste.  Take the time to find gochugaru.  It makes the dish.M. LaurenOrland Park, IL9/11/2021Made this last night using 3 different types of eggplants I grew in my garden.  I made a few revisions to the recipe: I used less salt, 2 teaspoons total, and let the eggplant sit for 30 minutes.  I then rinsed it quickly in water and squeezed it out small handfuls at a time.  Tot he marinade I added more soy sauce and sesame oil, reduced sugar to 1 TBSP, and added some crushed red pepper flakes as I did not have gochugaru.  It came out delicious! I served it with \"OUR FAVORITE KOREAN CHICKEN RECIPE\" from sliceofjess.com and plain jasmine rice, with cilantro, slices of lime for moisture and citrus kick.  My husband loved it as well!  Will use these recipes again asap.  PS:  Leftovers next day are even better as the flavors have time to meld together over night :)EVNY9/11/2021Made for dinner, doubled the sauce and added tofu. Cooked for way longer to make sure the eggplant was soft and tofu was crispy. Fantastic!! GBHSag Harbor 4/25/2021damn white ppl really calling recipes flavorless and fishy when these are key korean ingredients. get over yourself lol. i made as is & it's perfect.Anonymous4/4/2021Flavorless. Not worth the prep or clean up scrubbing the pan. AnonymousSan Francisco 3/9/2021Fishy. Followed all the steps as written and the eggplant tasted like anchovies. If you like that, then this is a good anchovy substitute for pizza, pasta, etc. It has no place in bibimbap.Susan3/1/2021Flavor was wonderful but much too salty. I will make it again omitting salt from marinade and rinsing before squeezing the eggplant. Patty D12/27/2020I halved all the salt amounts since I was using Morton (as opposed to Diamond) and thought it was appropriately seasoned. Followed all the steps of salting, squeezing, marinating, and chilling and it does lead to a fairly firm texture after cooking. I wouldn't describe it as chewy or meaty. Like some other reviewers, I found the flavour to be a bit flat, and I ended up using some hot sauce and honey to punch it up.AnonymousNew York10/10/2020I think you can actually get away with using quite a bit less salt on the eggplant - I basically sprinkled them lightly with salt and it did the trick without ending up too salty. Also, if you have one, a potato ricer is a big help for squeezing the water out of the eggplant. I also substituted gochujang for gochugaru and used a lot of it. Definitely taste the marinade and make sure it's got the right kick of flavors. Last, after chilling the eggplant in the fridge I noticed it also released a lot more water into the bowl, but I'm glad I added it all back to the pan because I think the flavor would have suffered if I didn't. Hope this helps!Indianapolis, IN9/16/2020I had high hopes for this because the other reviewers liked it. Honestly I couldn’t find much to like about it. The flavor was just kind of one-note sweet and salty. The eggplant was gooey to me, despite all the salting and squeezing we did. For all the prep work it didn’t have many redeeming qualities... we ate most of it though. Also I substituted gochujang for gochugaru and that might have been my fatal flaw... apologies if the fault is my own, but honestly can’t imagine this dish tasting much better than the mediocrity that it was. AnonymousMinneapolis, MN9/1/2020I really loved this! I found it just slightly too salty for my taste, so in the future I’ll probably omit the 1/2 tsp salt from the marinade. Otherwise I think this is a great recipe that I’ll definitely make again. AnonymousToronto5/12/2020This was the most incredible, flavorful vegetarian recipe. The eggplant had no bitterness at all. I constantly crave this now and love eating this with some koshihikari rice or making this into a bibimbap bowl.joolie.gCleveland, OH3/31/2020So spicy and good!  Substituted agave syrup for rice syrup.  \nI will try adding some ginger next timeAnonymoussebastopol, calif3/29/2020Explore Bon AppétitKoreanEast AsianAsianEggplantVegetableEasySideVegetarianVeganDairy-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-02", "author": ["Condé Nast"]}