{"id": "fa09f3b6e6c767ab24e4bf04e4affe0e", "url": "https://www.bonappetit.com/recipe/spicy-sweet-sambal-pork-noodles", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "Spicy-Sweet Sambal Pork Noodles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpicy-Sweet Sambal Pork NoodlesBy Chris MoroccoFebruary 22, 20194.7(323)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThese weeknight noodles are inspired by the silky richness of meaty tomato sauce and the fiery, tangy-sweet flavors of pad kee mao (a.k.a. drunken noodles). It's full-on explosive flavor in under an hour.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSun Ramen Noodles$6 At AmazonDutch Oven$80 At AmazonLarge Pot$55 At AmazonIngredients6–8 servings2Tbsp. extra-virgin olive oil2lb. ground pork, divided12\" piece fresh ginger, peeled, cut into thin matchsticks or finely chopped8garlic cloves, thinly sliced2Tbsp. sugar2Tbsp. tomato paste2sprigs basil, plus more for serving⅓cup hot chili paste (such as sambal oelek)¼cup soy sauce¼cup unseasoned rice vinegar1½lb. fresh ramen noodles or 16 oz. dried spaghettiKosher salt2Tbsp. unsalted butterPreparationStep 1Heat oil in a large wide heavy pot over medium-high. Add half of pork to pot, breaking apart into 6–8 large chunks with a wooden spoon. Cook, undisturbed, until well browned underneath, about 5 minutes. Turn pieces and continue to cook, turning occasionally, until pork is browned on 2–3 sides, about 5 minutes longer. Add ginger, garlic, sugar, and remaining pork to pot and cook, breaking up pork into small clumps, until meat is nearly cooked through, about 5 minutes longer. Add tomato paste and 2 basil sprigs. Cook, stirring occasionally, until paste darkens, about 2 minutes. Add chili paste, soy sauce, vinegar, and 2 cups water. Bring to a simmer, reduce heat to low, and cook, uncovered and stirring occasionally, until sauce is slightly thickened and flavors have melded, 30–45 minutes.Step 2Cook noodles in a large pot of boiling salted water, stirring occasionally, until 1 minute short of al dente. Add to pot with sauce along with butter and a splash of pasta cooking liquid. Simmer, tossing occasionally, until sauce begins to cling to noodles, about 1 minute. Pluck out basil sprigs.Step 3Divide noodles among plates. Top with torn basil.How would you rate Spicy-Sweet Sambal Pork Noodles?Leave a ReviewTell us what you thinkReviews (198)Back to TopTriangleI have made this more times than I could ever count. I love it, my husband loves it, our son, who moved out on his own and took the recipe with him, loves it. The leftovers are amazing; in fact, my husband will often take some of our leftovers to a co-worker who also loves it. I have always mostly followed the recipe to a T. I still watch the video every time I make it — I can’t quit it, apparently. ;) \n I have used just about every style of noodle over the years. Our favorite happens to be a specialty Italian pasta: Rustichella d’Abruzzo Fusilli col buco which I originally used out of necessity during the pandemic. It is amazingly long with tight curls and holds up really well to the meat sauce. The curls really snag the bits of meat. Any noodle works and is delicious but we have found that ramens and Yakisobas can break down a bit. \nSometimes, if my ground pork seems a little fattier than usual, I might try to wipe some of the excess out of the pan before adding anything else. Otherwise, we adore it as is. Chris, you rock my world!\nCarrieLouWhoSeattle, WA3/17/2022I friend made this for me and I begged for the recipe, and finally planned to make it while on vacation. The only change I made was I used ground beef because our grocery store was out of ground pork. As others have said it is so good that you don’t want to stop eating.  Grateful we have leftovers for 2 tonight.KellyMN1/17/2022cooking this currently, but BA should know that the print function is broken on the site. it cuts the first 2 lines of instructions off on the second page every time!Anonymous12/10/2021This is crazy good. Super simple and yet something you won't want to stop eating. The recipe is for 6-8 servings but I literally can't stop eating it and may eat all of the servings by myself.VivianSanta Ana, CA11/18/2021One of my all-time favorites. Easy. Mostly pantry items. Delicious. Try it. You’ll love it!!Susan Gainen Saint Paul MN11/17/2021Wow, great!  I followed the recipe exactly. Next time, I think I would add chopped peanuts at the end. NickAnkeny, IA10/9/2021This is one of the first meals my boyfriend and I cooked together and it is still a favorite almost 3 years later. We have tried it with all different types of noodles and they are all pretty good! Such an easy and delicious recipe. AnonymousAtlanta, GA9/3/2021Made this according to the directions and was VERY pleased! If you like spaghetti Bolognese and you like spicy Asian noodle dishes, you will LOVE this. I'm making it again in a few days, and I expect it will become one of my go-to weeknight meals. Great dish for little effort.Johnny BellrockSedona, AZ7/31/2021After buying sambal for the first time ever I googled “sambal recipes” and found this! I’m vegan and gluten free so instead of pork I used gardien soy crumbles and 1/2 a block of drained tofu crumbled and tossed with 3 tbs of corn starch. I substituted the butter for vegan butter and used Bun Gao (Vietnemese vermicelli rice noodles). I cut back on the soy sauce used a little less than 1/4 cup and used coconut nectar instead of sugar. It came out incredible! Can’t wait to make this for my friends:)BBoston,MA7/5/2021Question!!!  I made a crown roast so I have a lot of leftover pork.  Do you all think it would work in here in place of the ground pork??BernadettePark City, IL6/28/2021Love this recipe. I've probably made it about 4 or 5 times at this point and it never fails. This most recent time I made it with pappardelle (like you might see with a bolognese) and I would definitely recommend this variation. Definitely not necessary but it's a fun little twist. Hope you guys enjoy it.Jon C.Providence, RI6/9/2021This is great, I've made it several times now. I use Chinese black vinegar, and it brings it closer to a Ma Po Dofu flavor to me, even more when you sprinkle some ma la chili powder on top. I've done this will all kids of whatever ground meat I had lying around and it always works. You could even do a vegetarian version with mushrooms and tofu, and I think that would be quite delicious. Really tasty, easy, unique, and versatile dish. Anonymousvictoria, tx5/4/2021We love this and we make it often.  It is hard to stop eating it and the spiciness is just right for me.AnonymousOregon4/28/2021Frankly just fine... Was very excited for it but did not feel worth it after the time it took. Agree with the reviews that say it's kind of a marriage between an Italian meaty sauce and a Chinese pork dish, though I think those two are more delicious on their own. I added some spinach in there, which was a good call because the meal definitely needs veggies. We still ate it all (no waste!) but I wasn't super thrilled with the turnout. Won't make again sadly.AnonymousArizona4/22/2021This is one of our favorite family meals that I make regularly.  I recently started using 1/2 Impossible Burger and 1/2 pork (or sometimes ground beef) and it's just as meaty and delicious as it was before when I used all pork.  I often use cilantro instead of the basil.  I cut the sambal oelek from 1/3 cup to 1/4 cup - it's still spicy for our 3 little ones, but not so spicy that they can't eat it.  And I usually use apple cider vinegar instead of the rice vinegar since that's what I have on hand.  I don't add the butter since the pork is fatty and rich enough on its own.  If I was making this for company, I'd probably include the butter to amp the richness.  I usually serve it with whole wheat spaghetti noodles though I have occasionally used rice noodles - both are good.  I'm considering adding some Szechuan peppercorns next time - I think they'd work really well in this.CareyCary, nc4/14/2021Explore Bon AppétitPastaRamen NoodleNoodlePasta & NoodlesSpaghettiGround PorkPorkMeatMainDairy-FreeNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-22", "author": ["Condé Nast", "Chris Morocco"]}