{"id": "fa1c2f1c91b0f48ba68e5cdb788d9dfb", "url": "https://www.bonappetit.com/story/chitranna-has-it-all", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "This Chitranna Recipe is Savory, Sour, Sweet, AND Spicy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSavory, Sour, Sweet, AND Spicy, Chitranna is the Dish I'll Always Look Forward ToYou can't have it all, but your chitranna can.By Chitra AgrawalAugust 16, 2020FacebookTwitterEmailPhoto and Food Styling by Sarah Jampel FacebookTwitterEmailMy mother prepared chitranna, a South Indian rice recipe from her home state of Karnataka, on certain occasions—for picnics, long car rides, holiday gatherings, and, as I recall, an international potluck held by my fourth-grade teacher. She referred to it simply as yellow peanut rice, and I always looked forward to it even though I didn’t learn its proper name until I was much older. The word chitranna translates to “mixed rice” in Kannada, and there are numerous variations, all relying on different souring agents such as lime, green mango, tamarind, or, in the case of the one I grew up eating most often, lemon.The bright yellow rice, colored with turmeric, is sautéed in oil that has been seasoned with black mustard seeds, curry leaves, chile, and the umami-rich spice asafetida along with urad dal and chana dal, two lentils that add a nutty taste and crunchy texture. The dish is finally garnished with fried peanuts, grated coconut, cilantro, and a generous amount of lemon juice, resulting in a symphony of savory, sour, sweet, spicy, and herbaceous notes.You can eat lemon chitranna plain or make a bowl of it by layering on Green Beans Palya, some plain yogurt or a yogurt raita, and achaar (hot Indian pickle).The recipe is a good lesson in tempering spices and aromatics in hot fat to bring about their full flavor; this seasoned oil, referred to as vagarne in Kannada and other names such as tadke (tadka) or chhaunk throughout Southeast Asia, infuses the whole dish. If you're using precooked rice, it’s also a meal that comes together quickly.Get the recipe:ChitrannaTo make chitranna, which translates to “mixed rice\" in Kannada, bright yellow rice, colored with turmeric, is sautéed in oil that's been seasoned with black mustard seeds, curry leaves, chile, the umami-rich spice asafetida, and urad dal and chana dal, two lentils that add a nutty taste and crunchy texture. The dish is finally garnished with fried peanuts, grated coconut, cilantro, and a generous amount of lemon juice, resulting in a symphony of savory, sour, sweet, spicy, and herbaceous notes.View RecipeChitra Agrawal is the author of Vibrant India: Fresh Vegetarian Recipes from Bangalore to Brooklyn and the founder of Brooklyn Delhi.Explore Bon AppétitRiceIndianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-16", "author": ["Condé Nast", "Chitra Agrawal"]}