{"id": "fa262c03a3f536e5165fc0e9cd061b64", "url": "https://www.bonappetit.com/story/never-fail-salt-and-pepper-skirt-steak-recipe", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "The Skirt Steak Recipe I Can Cook Even on My Old, Cheap Gas Grill | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Skirt Steak Recipe I Can Cook Even on My Old, Cheap Gas GrillI used to have an irrational fear of grilling steak and messing it up—and then I met the no-fail skirt steak recipe of my dreams.By Carey PolisAugust 10, 2018FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.For many years, I refused to grill steak. I lacked confidence in my grilling ability, and feared spending cash on an expensive piece of meat that I would probably accidentally overcook. See, my grill is not what you would call \"good.\" It was purchased in 2012 at Lowe's, and I believe my criteria for purchase were that a) it was cheap, and b) it would turn on.I've made due despite my lack of investment in quality equipment. Over the years, I've managed to cook everything from spatchcocked chicken to whole fish on my trusty gas grill. I've made chile-lime clams with tomatoes, spiced lamb burgers, grilled pizza. And while this $80 wunderkind has surprised me with its stamina, I've never been willing to test a high-quality steak on it. It feels too risky. Too high of a margin of error. And then I met the skirt steak recipe that changed everything.I'm talking about this salt-and-pepper steak recipe, and in the preceding clause of this sentence I've already mentioned the entire ingredient list. Here's what happens: You take a pound and a half of skirt steak, cut it into four pieces, and season it with salt and pepper. Grill over medium-high heat for about four minutes per side until the steak is medium-rare.Eight minutes later, you have a juicy piece of meat that tastes like it was grilled on a piece of equipment that doesn't have Mystery Char clinging to the grates and a few fewer parts than it was born with. It's amazing what a good shower of salt and a generous amount of freshly cracked black pepper can do for a piece of beef.Skirt steak tends to be a fairly forgiving cut of meat—it's way thinner than a ribeye, so there's no shuffling back and forth between hot and less-hot parts of the grill. Instead of searing it and worrying about whether or not it's still raw inside, you just hit it hot-and-fast on both sides and you know it's done. And did I mention the price? It's a hell of a lot more affordable than big ticket cuts of cow like New York strip, rib eye, and tenderloin, and boasts tons of big, mineral-y, beefy flavor. After cooking—and nailing—this skirt steak recipe a few times, I started to wonder why people bothered with those other cuts of steak at all. The one important thing to remember is that it has a little bit more chew than those pricier options, so you will need to make sure that you slice it relatively thinly against the grain before you serve it.As far as sauce options go, a simple chimichurri takes the cake.\nPhoto by Alex Lau, food styling by Rebecca JurkevichSo, if you find yourself with a grill that's a little more engine-that-could rather than Shinkansen, it's a good cut to choose. In my experience of grilling it over the past four years, it's never stuck to the grates...even when maybe I haven't oiled them as much as I should have.The steak is excellent by itself, sliced and plated and maybe drizzled with a bit of grassy olive oil. Or throw together a quick salsa verde or chimichurri to get some herb action in the mix. Or you can serve it with a lightly dressed arugula salad, or warm tortillas, chopped onion and cilantro, and a simple salsa. It's versatile, delicious, and all the more so for how dead-simple it really is. The recipe has never let me down and, come to think of it, neither has my beauty-is-on-the-inside grill—two things that make my summers great.Get the recipe:Salt-and-Pepper SteakView RecipeExplore Bon AppétitSteakGrillBasicallyNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-10", "author": ["Condé Nast", "Carey Polis"]}