{"id": "fa2e871f1f71ebef64f49cd3e2bc0367", "url": "https://www.bonappetit.com/story/diet-coke-four-new-flavors-new-look", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Diet Coke Debuts Four New Flavors and a Sleek New Look | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDiet Coke Debuts Four New Flavors and a Sleek New LookIn an effort to land millennials, of course.By Melissa MintonJanuary 10, 2018FacebookTwitterEmailWonna Cott/Coca-ColaFacebookTwitterEmailDiet Coke is the old reliable of sodas: ever-present, with just the right amount of caffeine and je ne sais quoi to keep you going throughout the day. However, the fizzy friend you know and love is about to have a major overhaul that might remind you of a certain beloved seltzer. Today, Coca-Cola announced a new era for Diet Coke that includes fresh flavors and a sleek redesign for the first time in 35 years. Over a two-year innovation process, the company spoke to more than 10,000 people from across the country to gather insight on potential new flavors, aiming squarely at targeting millennials. And boy, did they deliver: the four official, very descriptive new flavors are Ginger Lime, Feisty Cherry, Zesty Blood Orange, and Twisted Mango. \"Through extensive consumer research, we learned that younger Americans have an affinity for bold, yet refreshing and great-tasting, flavors in their favorite foods and beverages—from hoppy craft beers to spicy sauces,\" the brand wrote in a press release.The fruit and citrus flavors and original Diet Coke will be packaged in thin 12 ounce cans—the same design as Dasani Sparkling—and sold as on-the-go singles and in eight-packs to hit shelves this month. The new look includes the brand’s classic silver with a simplified color palette, focused on silver and red with accents of other bright colors to represent the flavors. A slightly different typography \"simultaneously preserves Diet Coke’s heritage, yet presents it in a more progressive manner.\" Don't you love marketing-speak?!If you're not big into change and can't handle more than one new feature at a time (or just really love those little mini-cans), don't worry, Diet Coke will continue to be offered in all existing package sizes and designs. But who doesn't want to at least try Feisty Cherry?Twitter contentThis content can also be viewed on the site it originates from.Related: Espresso Cola: Give Your Soda the Coffee Treatment It DeservesExplore Bon AppétitCold SodaSodaTrends + NewsTrendsRead MorecultureNow You Can Turn Water Into Sparkling Wine With Your SodaStream MachineBy Andrea ParkcultureWhich of These Grapefruit Sodas Won Our Blind Taste Test?By Christina Chaey and Amiel StanekcultureLaCroix's Newest Flavor Is Here—If You Can Find ItBy Andrea ParkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-10", "author": ["Condé Nast", "Melissa Minton"]}