{"id": "fa4729d06b3d9b6c725a091df7e23ac1", "url": "https://www.bonappetit.com/recipe/vegetarian-bean-chili-with-fritos", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "Vegetarian Bean Chili Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegetarian Chili With Lots of FritosBy Sarah JampelJanuary 12, 20204.7(90)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintQuick, spicy, filling, and made mostly of pantry ingredients, this chili/tortilla soup/frito pie mash-up is calling your name. (Shhh. Listen closely.) Garnish it with the toppings of your choice: We like avocado, sour cream, and chopped white onion, but you can add shredded cheese, pickled or fresh jalapeños, and/or sliced scallions or radishes. You can use any tortilla chips you like—they add body and flavor to the soup itself and go on top for extra oomph. You could also fry or bake your own stale tortillas, cut into strips, but if we're being honest, salty, crunchy Fritos will probably taste better. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAForkSmall Bowl$13 At AmazonSieve$18 At AmazonDutch Oven$80 At AmazonWooden Spoon$6 At AmazonIngredients4–6 servings1large white onion6garlic cloves½bunch cilantro1chipotle chiles in adobo, plus 1 tsp. adobo sauce¼cup tomato paste215-oz. cans pinto beans¼cup extra-virgin olive oil2tsp. chili powder128-oz. can fire-roasted tomatoes1Tbsp. Diamond Crystal or 2 tsp. Morton kosher salt, plus more1½cups Fritos or other salty tortilla chips, divided1lime1avocado½cup sour creamFreshly ground black pepperPreparationStep 1Prep your ingredients: First, finely chop 1 large white onion. Cut in half from top to bottom. Trim top, then peel onion skin and first tough layer; discard. Leave root end on. Make slices parallel to cutting board, starting close to the board and moving upward. Then make slices lengthwise from top of onion to root end. Slice across onion, again from top to bottom, and you’ll come away with nice little cubes. Run your knife through once more if any pieces are too big. You should have about 2 cups chopped onions. Set aside 2 Tbsp. for serving.Step 2Smash, peel, and finely chop 6 garlic cloves. Separate leaves from stems from ½ bunch cilantro. Coarsely chop leaves; set aside for serving. Finely chop stems. Using a fork, pull 1 chipotle chile from can, then finely chop until a paste forms. Transfer to a small bowl, along with 1 tsp. adobo sauce from can. Add ¼ cup tomato paste. Drain and rinse 2 15-oz. cans pinto beans.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Heat ¼ cup extra-virgin olive oil in a large saucepan or Dutch oven over medium-high. Add onion, garlic, cilantro stems, and 2 tsp. chili powder and cook, stirring frequently, until onion is starting to soften, 5–6 minutes. Add tomato paste mixture and cook, stirring frequently, until brick red and starting to stick to bottom of pan, 2–3 minutes.Step 4Add 1 28-oz. can fire-roasted tomatoes and bring to a simmer. Cook, stirring frequently, until tomatoes are cooked down and slightly darker in color, 8–10 minutes.Step 5Add beans, 1 Tbsp. Diamond Crystal or 2 tsp. Morton kosher salt, and 5 cups water. Bring to a boil over high heat, then reduce heat to medium-low and simmer uncovered, stirring occasionally, until soup has reduced slightly and flavors have melded, 30–35 minutes. Mash about one-quarter of beans with the back of a wooden spoon or potato masher—this will make the soup thicker and creamier. Stir in 1 cup Fritos (or 1 cup crushed tortilla chips) and cook, stirring occasionally, until softened, 1–2 minutes. Squeeze in juice of 1 lime half, then taste for salt (you may need to add as much as 2 tsp.).Step 6Cut remaining 1 lime half into 4 wedges. Slice 1 avocado in half, carefully remove pit, then crosshatch flesh in its shell. Scoop out flesh with a spoon.Step 7Divide soup among bowls. Top with ½ cup sour cream, avocado, reserved cilantro leaves and chopped onion, and remaining ½ cup Fritos. Season with pepper.How would you rate Vegetarian Chili With Lots of Fritos?Leave a ReviewTell us what you thinkReviews (40)Back to TopTriangleFiery, smoky flavor, might be best chili I’ve  made. Instead of 5 cups of water I used 2 cups of chicken broth and left the Fritos for on top only. I immersion blended a small amount of finished chili for texture cuz I forgot to crush the beans. You can use any beans, I only had chickpeas and black beans and in they went. Avocado, sour cream, lime, Fritos on top. Great recipe!AnonymousMassachusetts12/22/2021I don't normally comment on recipes but this one is so stellar and so unique I just had to echo all the previous rave reviews. I have tried soooo many chili recipes in the past and thought all were just meh.  The flavor in this is simply outstanding. My husband could not stop raving about it. He recently went vegan so always looking for flavorful vegan recipes. Thank you for this one!!! MicheleBerwyn, PA11/12/2021This is basically the only chili recipe I ever make anymore. Sometimes I use different beans because I only have one can of pinto. Sometimes I forget cilantro and don’t have the stems. I never forget the Fritos though! \nI also sometimes have this for lunches at work on top of half a slow roasted sweet potato. Definitely our favorite chili recipe KateRipon, WI 10/9/2021Normally \"vegetarian chili\" is a phrase that makes me immediately hostile, but this one's an absolute winner! It's rich and satisfying, and the garnishes make it even better. I tend to prefer a super meaty chili but the beans and tomatoes in this are so hearty that I don't miss the meat at all. Only thing I'll do differently next time is to add another can of red or black beans, because those are even meatier than the pintos.DuffuserEvansville, Indiana9/24/2021Absolutely DELICIOUS!  This is definitely my new go-too chili.  Super easy to throw together and incredibly delicious.  Alison JDenver, CO3/15/2021delish! What an enjoyable and hearty soup. Glad that I did not get indigestion from it!NancyAtlanta 1/17/2021This was sooo good - even my meat eating boyfriend loved it.  I added green bell pepper and celery too.  I would say CAUTION with the salt. I added 2.5 tsp of kosher AFTER adding the chips, specifically because I knew the fritos would add salt as well (this was still too salt and had to balance with lime) so I suggest add the salt after and taste as you go.  Also echoing the water adjustments from other reviews as I used 4 instead of 5 cups.K GravyCA1/13/2021This is the most delicious chili I’ve ever tasted. My husband loved it, too. I am a vegan, so it’s great to add a dish to the repertoire that my non-vegan husband also enjoys.Julie ZVancouver, BC1/2/2021We love this chili! The Fritos make it great! I've made it several times.MaxineBrooklyn, N.Y.12/17/2020I echo all other reviews!  I consider myself a good cook but have never been able to master chili...well, things have changed.  Thank you!  Wish I was able to print the recipe to save it for the future.  AnonymousSacramento, CA11/30/2020This chili is my all-time fave!! So hearty even tho no meat, and the Fritos add so much. It also reheats super well!AnonymousChicago, IL9/8/2020I am crying with joy (or possibly from dicing the onion) over how delicious this chili is. Simple ingredients but the flavor packs a big punch. The crushed up corn chips give it a sort of tortilla soup flavor. Definitely will make again! Victoria MillerWashington, DC 6/3/2020I LOVE this chili. It’s simple enough to make on a week night and I basically always have the ingredients. I use chipotle chili powder instead of regular chili powder for some added chipotle flavor, but it’s honestly so great as is! AnonymousHuntsville 5/25/2020Goes absolutely nuts! Did 3 cups of water, 2 chilis, sweet potatoes and carrots and I already want to make it again. AnonymousChicago 5/6/2020Smoky and delicious! Loved the texture the fritos added. I threw in a couple extra chiles to match my personal heat preferences. Anonymous5/4/2020Explore Bon AppétitChiliStewSoups and StewsTex-MexAmericanPinto BeanBeanVegetableCanned TomatoTomatoOne-Pot MealsEasyMainGluten-FreeNut-FreeVegetarianSuper BowlDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-12", "author": ["Condé Nast", "Sarah Jampel"]}