{"id": "fa50d038b321c6788e0e6fff1d3fe74b", "url": "https://www.bonappetit.com/story/any-soup-can-be-egg-drop-soup", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "How to Make Egg Drop Soup From Any Kind of Soup | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAny Soup Can Be Egg Drop Soup If You Want It to BeThe only \"drop\" I'm waiting for is egg drop.By Lucas SinMay 15, 2020FacebookTwitterEmailLucas SinFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.The egg drop soup is a sublime experience: a bright yellow, deeply savory broth laced with dreamy wisps of eggs.But even though the soup is humble, its origins are not. In Cantonese imperial courts, egg drop soup was used as a way to showcase a chef’s finesse: the fine swirl of eggs, when done right, was meant to mimic the gelatinous texture of a clear stock fortified with rooster and Jinhua ham.That idea has since evolved into the American Chinese takeout-style egg drop soup, made from instant chicken stock, thickened with a cornstarch slurry, and perfumed with sesame oil, white pepper, and a dash of light soy sauce. It’s delicious—but egg drop doesn’t have to end there.Consider West Lake Beef Soup, from Hangzhou, a silky beef consommé studded with shiitake, ginger, and coriander and finished with threads of egg white. Or the Cantonese corn and fish maw soup, a brilliantly yellow seafood stock with sweet corn and egg drop. Or the modest tomato and egg soup, a deeply savory Northern Chinese specialty made from nothing but water, tomatoes, scallions, and a generous egg drop.In any case, that is to say, that most, if not all, soups could be enhanced by a last-second egg drop to give it an aesthetic and textural enhancement. You can and should egg drop any soup.Egg dropped in dashi.\nAlex LauThis is how to do it:Whisk the freshest eggs you can find—you need about 1 egg per 1–2 cups of broth—with a touch of any vinegar, neutral oil, and water. About 1 teaspoon each, per egg. Vinegar lowers to pH, which allows the proteins to denature more quickly and results in thinner threads. Oil offers silkiness. And water thins out the egg to make the pour smooth. When it gets to actually dropping the egg, there are a couple methods at your disposal.For slight, short strands of eggs...You want to start with your soup at a strong boil. While continuously and decisively stirring the pot, pour in the egg mixture as slowly as you can from a small pitcher or another tool with a spout. Be careful not to stir it too vigorously, or it will emulsify into the soup. If you do it right, the small strands of eggs will almost instantly float to the top, revealing a beautiful egg lattice.For a larger sheet of egg...The egg drop should be made with an egg mixture without vinegar. Take the soup off the heat—you’ll need to be gentle here. Once the surface of the soup is still, gently pour a thin layer of egg in a circle around the pan. Patiently wait for the egg to cook and set, then with chopsticks or a spoon, push the egg into the center of your pan until a thin wispy blanket of egg has formed.After your first foray into Chinese egg drop soups, you may be tempted to look beyond Chinese cuisine, and you would find plenty of evidence for the beauty of egg dropped soups and stews around the globe. Colombians eat changua, whole eggs poached in milk with cilantro and scallions, for breakfast. The Castilian garlic soup, sopa de ajo, is made from day-old bread, pimentón, and a generous amount of olive oil and finished with a thinly spun curtain of a whole egg, simmered and served in the broth. And perhaps most texturally similar to the Chinese egg drop soup is the Roman stracciatella, which boasts swirled threads of eggs, semolina, and cheese. Or experiment by egg-dropping dishes that don't call for it: a tomato sauce ready to be tossed with pasta that needs a touch of creaminess, a white bean stew lacking a bit more body, a robust Thai curry that begs for a touch of silkiness, or a noodle soup that wants a flourish of egg a bit more elegant than a whole egg over the top.The egg drop dances between one cuisine and another, giving us the license to revel in the wonders of an extra velvety, luxurious broth.Lucas Sin is the culinary director of Junzi Kitchen in New York.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-15", "author": ["Condé Nast", "Lucas Sin"]}