{"id": "fa5e599b424b540cb71832e04cf83df2", "url": "https://www.bonappetit.com/story/i-hated-my-roommate-but-loved-her-cooking", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Bad Roommate Stories: She Was a Terrible Roommate But I Loved Everything She Cooked | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Hated My Roommate But I Loved Everything She CookedEmily was one part domestic goddess, one part roommate from hell.By Taylor HenriquezNovember 7, 2018FacebookTwitterEmailIllustrations by Ariel DavisFacebookTwitterEmailRoommates come into your life for a reason, a season, and to teach you how to cook. It was Emily (not her real name), my first roommate post-grad, who taught me how to eat seasonally, purchase pantry staples like red wine vinegar and dijon mustard, make homemade tomato soup, and more. Alas, I never got the chance to thank her for these things, because we weren’t on speaking terms when the lease ended. Emily was a domestic goddess, but she was also a roommate from hell.To be fair, she would say the same about me. I’m self-aware enough to know that I am the world’s worst dishwasher, but I like to think I make up for it by always deep-cleaning the fridge and throwing away expired food, like the bottle of ketchup that had been crusting over since Obama was president.I met Emily a few days after moving to New York, via her roommate listing online. I came to tour the apartment with its small, white kitchen and gas stove. I liked Emily. She too had recently moved to the city, enjoyed cooking, and was writing for a local restaurant blog. It was a year-long lease, what could go wrong?In the beginning, nothing. I admired Emily every time she went to the local farmers’ market and brought home in-season produce like Brussels sprouts and chard to be roasted and sautéed, while I schlepped to the supermarket around the corner and purchased out-of-season tomatoes to top tacos I made from a boxed kit.Before I met Emily, my idea of cooking was limited to what I was exposed to growing up in Illinois and Georgia, and boy, did I love casseroles. In college, my go-to meal was baked spaghetti made with cream of mushroom soup, lean ground beef, and pre-shredded cheddar cheese. Post-grad, it was a lot of boxed macaroni and cheese and steamed broccoli.From the couch, eating whatever frozen Trader Joe’s meal I’d thrown together, I’d watch Emily make her own marinara sauce with canned tomatoes simmered in olive oil, garlic, and herbs. I watched her make her own salad dressing, whisking together the simplest of ingredients—oil, vinegar, salt and herbs. I vowed never to buy bottled dressing again.We prepared meals mostly for ourselves, only sharing unless we made too much of something: a pan of lasagna, a tray of blueberry muffins. I didn’t mind. I absorbed every detail of how to become a better cook just by watching. I learned the difference between a microplane and grater. I learned to roast a chicken, which I did alongside mashed potatoes for a guy I’d been dating, who bailed on dinner at the last minute. That was one of the few meals Emily and I shared.After six months of living together, my cooking was improving, but our relationship was not. At first, Emily and I were always pleasant to each other, and the disagreements we did have were standard roommate spats revolving around who never took out the garbage (Emily) and who was half-assing the dishes (me).But when I started hearing Emily and her boyfriend having loud sex, on more than one occasion, with her bedroom door half-open, that was the beginning of the end. From then on, everything about each other got on our nerves. When our lease ended, Emily decided to move in with a friend down the street. By this point, we were barely on speaking terms.On the eve of her leaving, we got into an argument over slights that had been compounding: the cleaning or lack thereof, her boyfriend. She complained about how often she had to sweep because my curly brown hair was everywhere. Meanwhile, I had recently found a long blonde hair tucked inside my underwear when I went to the bathroom at work. I was always unclogging the tub drain. At one point during this fight, Emily lunged towards me to make her point clear. For a split second, I thought, “Is she going to hit me?”She didn’t. She left the next day, and my new roommate, who responded to my own online listing, moved in a few days later, with her own set of spices, pans, and recipes. Emily will never know, but I continued to cook more for myself. She didn’t get to see me bring home a tote of Honeycrisp apples from the farmers' market to make an apple pie for my new roommate, nor did she see me make my own tomato sauce, using in-season cherry tomatoes, which I served over pasta with grated Parmigiano-Reggiano that didn’t come from a green can.It’s been five years since Emily moved out, and we don’t keep in touch. But whatever she’s doing, I hope she’s still making her bomb marinara and salad dressing and feeling fabulous while doing it. I know I am.A marinara sauce we can all agree on:Classic Marinara SauceThe little black dress of Italian-American cooking. This recipe is from Palizzi Social Club in Philadelphia, PA.View RecipeExplore Bon AppétitHealthyishSauceessayRead MorecultureThe Keto Diet Crushed My Soul But Taught Me One Good ThingBy Molly Guinn BradleyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-07", "author": ["Condé Nast", "Taylor Henriquez"]}