{"id": "fa60beb7763ee7ecbed3f28976d3022f", "url": "https://www.bonappetit.com/story/estelle-colored-glass-champagne-coupe", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "Who Needs Holiday Decorations When Your Glassware Is This Festive? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWho Needs Holiday Decorations When Your Glassware Is This Festive?From Friendsgiving to New Year’s, it’s all about colored glassware, folks! By Emily SchultzOctober 22, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.In the Before Times, my good friend Amanda and I would split hosting responsibilities when it came to holiday parties. She had the Christmas festivities—roasting a big fish, making tons of pasta, and coordinating the secret Santa list—and I took on Friendsgiving.I would make several trays of stuffing, roast chickens (my apologies, turkey), and tastefully arrange the bottles of wine everyone brought over in an ice bucket on my bar. I live in a small apartment that used to be crammed with people and food alike (again, major TBT), which meant there was no room for holiday decorations. But who even needs decorative gourds, cornucopias, or candles shaped like flightless birds when Estelle Colored Glass’s coupe and wine glasses are scattered across your table? (The answer is: no one.)Stephanie Summerson Hall started Estelle Colored Glass as an homage to her grandmother Estelle’s love of antiquing and cooking. All of her pieces are hand-blown and vintage-inspired from warm orange wine glasses to blush pink cake stands. But I’m partial to the coupe glasses. I want to drink freezing cold dirty martinis and sparkly Champagne out of them, no matter the time of year or the number of people in my apartment. Even if my kitchen isn’t crowded with friends this year—and even if my table isn’t covered in glasses of various colors and sizes—I’ll still be holding up my mint green coupe glass on FaceTime and toasting to the holidays. Estelle Colored Wine Glasses, Set of 6$175 at Food52Estelle Colored Champagne Coupes, Set of 6$195 at West ElmExplore Bon AppétitCocktailHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-22", "author": ["Condé Nast", "Emily Schultz"]}