{"id": "fa60cd18d812154b4dc64b18e16f7e99", "url": "https://www.bonappetit.com/story/starve-a-fever-and-feed-a-cold", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Does Feed a Cold, Starve A Fever Actually Work? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleShould You Really Starve a Fever And Feed a Cold?You deserve to know the truth.By Rachel Sugar March 7, 2018FacebookTwitterEmailLaura MurrayFacebookTwitterEmailThis story is part of the Healthyish Guide to Feeling Better Already, a collection of recipes, remedies, and distractions to get you back on your feet.Feed a cold, starve a fever. This refrain is something I think about a lot, mostly when I am sick and looking to justify my choices. As in: I do deserve this $14 ramen; I am feeding my cold. This is what the old wives would want.Where exactly the phrase comes from is murky, but according to Quackery: A Brief History of the Worst Ways to Cure Everything, you can trace it back to a 1574 dictionary by the English lexicographer John Withals, who wrote “fasting is a great remedy of fever.” And that does make some intuitive sense, sort of. Fevers produce heat, and heat takes energy. So if you don’t give your body energy to produce the fever, then the fever should go away. Meanwhile, writes Smithsonian, colds were believed to be caused by “a drop in temperature,” which required food to help “stoke the fire.” It is persuasive logic, in a 16th century kind of way.But, in 2018, I could not find a doctor ready to back up the wisdom of the elders. “First of all, there’s no truth to ‘feed a cold, starve a fever,’” says Catherine Troisi, Associate Professor at the Center for Infectious Diseases at the University of Texas School of Public Health. “That would not be guidance I would give my patients,” agrees Ian Nelligan, Assistant Clinical Professor at Stanford School of Medicine, tactfully.Which is not to say that there is no evidence that the old adage could have (some) merit. In recent years, a number of studies have suggested that, depending on the illness, eating or not eating may in fact bolster recovery. A very buzzy 2002 Dutch study “found that eating a meal boosts the type of immune response that destroys the viruses responsible for colds, while fasting stimulates the response that tackles the bacterial infections responsible for most fevers,” New Scientist explained. (Also, though, the study had six people in it.)Then, in 2016, an immunologist at Yale was trying to figure out if there might be some unknown protective benefit to not eating while sick—why else do we so often lose our appetites?—and found that the tentative answer seemed to be yes. Mice injected injected with listeria (a foodborne bacterium) had better survival rates if they weren’t force-fed. Mice with a flu virus, though, were drastically more likely to survive if they were. For our purposes, what matters here isn’t the specific diseases, but rather the possibility that what and whether to eat may indeed depend on exactly what’s wrong with you. But it’s early. People aren’t mice. If there’s an immediate takeaway, the study’s lead author, Ruslan Medzhitov told The Atlantic, it’s to listen to your body when you’re sick.That is what everyone keeps telling me. “You want to make sure that your body has enough energy to fight whatever it is that you’re fighting,” says Molly Broder, a pediatrician at the Children’s Hospital at Montefiore. But if you can’t stomach it, she adds, that’s also fine. As Troisi points out, “you're not going to starve to death in the week or ten days that a cold lasts.”The one thing you do have to do when you’re sick is stay hydrated, whether your body tells you to or not. It is a boring truth, but necessary. “You really should drink even if you're not thirsty,” Troisi says. Drink water. Drink herbal tea. If you’re worried about a dearth of calories, drink fruit juice for god’s sake. Just drink. Not coffee. Not alcohol. But what about a healing shot of whiskey? That’s a question for another day.This is the ultimate dehydration cure:BA Brad’s Classic TonicView RecipeExplore Bon AppétitHealthyishGet WellRead MoreLifestyleThe Healthyish Guide to Feeling Better AlreadyGallery13 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "Rachel Sugar"]}