{"id": "fa61e0f20a10371cc4014f0517171be1", "url": "https://www.bonappetit.com/recipe/raspberry-cream-cake", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Raspberry Cake With Whipped Cream Filling Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueRaspberry Cake With Whipped Cream FillingBy Shilpa UskokovicMarch 15, 20224.2(9)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Summer Moore EmailPinterestPrintEmailPinterestPrintThis raspberry-filled chiffon cake is inspired by the layered fruit and cream cakes in Japanese bakeries—it’s light, airy, and delicately sweet. It’s both visually striking and startlingly deep in flavor, and as far as most cakes go, it’s fairly make-ahead friendly. Since cakes with whipped cream filling always need to be refrigerated, using chiffon cake—which uses oil, not butter—is a strategic choice as the layers will remain soft and tender even straight out of the fridge. (Butter-based cakes, on the other hand, seem hard and leaden after a stint in the cold.) The whipped cream, which is flavored with freeze-dried raspberries and dotted with whole fruit, stays stable for a few days. Be sure to use ungreased regular (not nonstick) cake pans so that the batter can cling to the sides and rise tall as it bakes.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronPiping Bag and Tips Set$13 At AmazonStand Mixer$460 At Amazon8-Inch Cake Pan$10 At AmazonScale$25 At AmazonSilicone Spatula$13 At BA MarketMesh Sieve$13 At AmazonWhisk$10 At AmazonOffset Spatula$12 At AmazonFood Processor$49 At AmazonIngredients12 servingsCake4large eggs, room temperature, separated1tsp. Diamond Crystal or ½ tsp. Morton kosher salt½tsp. cream of tartar1cup (200 g) sugar, divided⅓cup vegetable oil1tsp. vanilla extract1cup (125 g) cake flour½tsp. baking powderAssembly1cup (200 g) sugar1½cups (37 g) freeze-dried raspberries; plus more crushed for serving (optional)3cups heavy cream1tsp. vanilla extract1tsp. Diamond Crystal or ½ tsp. Morton kosher salt¼cup (80 g) raspberry jam2cups (170 g) fresh raspberriesSpecial equipmentA pastry bag and a ½\"-diameter tipPreparationCakeStep 1Position a rack in middle of oven; preheat to 350°. Line two 8\"-diameter cake pans with parchment paper rounds (do not grease). Beat egg whites, salt, cream of tartar, and ½ cup (100 g) sugar in the bowl of a stand mixer fitted with the whisk attachment on medium-low speed until egg whites are broken up, about 30 seconds. Increase speed to medium-high and beat until meringue is glossy and holds firm peaks, 8–10 minutes.Step 2Whisk egg yolks and remaining ½ cup (100 g) sugar by hand in a large bowl until pale and well combined, about 2 minutes. Whisk in oil, vanilla, and ⅓ cup room-temperature water. Sift flour and baking powder over and whisk vigorously to combine.Step 3Add one fourth of meringue to egg yolk mixture and mix thoroughly to incorporate (this will lighten the batter). Add remaining meringue in 3 batches, gently folding after each addition until only a few streaks of meringue remain (err on the side of mixing slightly less rather than more to keep batter billowy).Step 4Divide batter evenly between prepared pans and gently smooth surface. Bake cakes 15 minutes. Reduce oven temperature to 325° and continue baking until golden brown and tops spring back when gently pressed, 35–40 minutes more. Remove from oven; invert pans onto a wire rack. Let cakes cool in pans (cooling them upside down reduces shrinkage), 60–70 minutes. Turn cakes over and run an offset spatula around sides of cakes to loosen, then invert cakes onto wire rack. Peel away parchment.AssemblyStep 5Finely grind sugar and 1½ cups (37 g) freeze-dried raspberries in a spice mill or food processor (if using food processor, sift powder through a fine-mesh sieve after to remove seeds). Transfer to the clean bowl of a stand mixer fitted with the whisk attachment; add cream, vanilla, and salt and beat on medium-high speed until firm peaks form, 5–7 minutes.Step 6Stir jam in a small bowl to loosen, then gently fold in fresh raspberries.Step 7Place 1 cake on a cake platter or large plate. Scoop a heaping cupful of raspberry cream on top; spread evenly with offset spatula. Spoon berry mixture on top of cream, leaving a 1\" border around the edges (this will prevent berries from spilling over the sides). Place second cake layer on top. Spoon a heaping ½ cup raspberry cream into pastry bag fitted with tip. Frost top and sides of cake with raspberry cream still in bowl, then pipe dollops of raspberry cream around edges of top of cake. Chill cake, uncovered, at least 2 hours.Step 8To serve, sprinkle top of cake with crushed freeze-dried raspberries if desired. Slice cake with a serrated knife, wiping clean between cuts.Do ahead: Cake can be baked 1 day ahead; store tightly wrapped at room temperature, or freeze up to 1 week. If frozen, thaw in refrigerator overnight before using. Cake (without crushed raspberry topping) can be assembled 1 day ahead; cover loosely and chill.How would you rate Raspberry Cake With Whipped Cream Filling?Leave a ReviewTell us what you thinkExplore Bon AppétitDessertLayer CakeCakeNut-FreeBakingRaspberryBerryFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Shilpa Uskokovic"]}