{"id": "fa664acbc854dd32471588e4b8f6c03d", "url": "https://www.bonappetit.com/recipe/glazed-shallots-with-chile-and-thyme", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Glazed Shallots Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueGlazed Shallots with Chile and ThymeBy Molly BazOctober 16, 20185.0(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThese sweet and saucy shallots are your best answer to a plan-way-ahead side: They can hold for a day or two, and then go straight from the fridge to the microwave to the table. Choose shallots that are all about the same size so that they soften evenly as they cook. And if spicy is not your thing, skip the Fresno chiles.Ingredients8 servings4Tbsp. unsalted butter1½lb. medium shallots, peeled, halved if largeKosher salt3Tbsp. sherry vinegar or red wine vinegar3large sprigs thyme, plus 1 tsp. thyme leaves for serving2red Fresno chiles, halved lengthwise, seeds removed1Tbsp. sugarPreparationStep 1Preheat oven to 400°. Heat butter in a large skillet over medium, swirling until foaming subsides. Arrange shallots in a single layer in skillet, flat or cut side down where possible. Season well with salt and cook, undisturbed, until deep golden brown underneath, about 5 minutes. Turn and cook until deep golden brown on the other side, about 5 minutes.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 2Add vinegar and 1 cup water, then add thyme sprigs, chiles, and sugar and swirl skillet to combine. Bring liquid to a boil; reduce heat so liquid is at a simmer.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 3Transfer skillet to oven and roast shallots, turning halfway through, until sauce is reduced to a glaze and a paring knife easily slides through centers, 35–40 minutes. Taste and season with more salt if needed.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 4Spoon shallots and glaze into a serving dish and top with thyme leaves.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 5Do Ahead: Shallots can be cooked 2 days ahead. Gently reheat in a large saucepan (or in the microwave in 30-second intervals) with a little water to loosen up glaze.How would you rate Glazed Shallots with Chile and Thyme?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleMade this for Thanksgiving and everyone raved about. A must for this year’s turkey!SueOttawa, On10/5/2021Wonderful recipe and worked out perfect. Since Bon Appetit recommended this as a Chanukah recipe, it's important to note that be able to serve with meat, replace the butter with a non-dairy fat, like schmaltz or a good olive oil. AnonymousAustin, TX12/14/2019Excellent new side dish! Served it with Thanksgiving Dinner, then served it 2 weeks later with prime rib. So easy to make and it looks as pretty as the photo.AnonymousNEWPORT Beach, California 12/9/2019A total hit! alizaraeNew York 11/25/2019Made this along with Andy's \"dry-rub turkey\" and BA roasted parsnips.... oh my! A complete hit!!!!  Will definitely make again!!! suechen25Toronto, Can10/16/2019Solid recipe. Tastes so good days later tooAnonymousBrooklyn, NY4/2/2019Incredible recipe, the low-key heat from the Fresnos is amazing. I made it two days ahead and reheated on the stove with some water—success. Such a great all-purpose side. Next time I'll double it. alexbeggsBA.com 1/3/2019new best side for roast beast!  And yes, you can use olive oil instead of butter for a dairy sub.AnonymousBoise12/17/2018Any recommendations for a dairy substitution?AnonymousIndianapolis12/17/2018Explore Bon AppétitAmericanShallotVegetableFresno ChileChileFallSideNut-FreeVegetarianGluten-FreeHealthyishThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Molly Baz"]}