{"id": "fa6628fe48a1cb3e28996def5fa717ed", "url": "https://www.bonappetit.com/story/nick-cho-tiktok", "year": 2021.0, "month": 10.0, "day": 5.0, "content": "How Nick Cho Became TikTok’s ‘Your Korean Dad’ | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHey, It’s Your Korean DadNick Cho started his TikTok account to share coffee recipes. Somewhere along the way, he became a global parenting phenomenon.By Bettina MakalintalOctober 29, 2021FacebookTwitterEmailCourtesy Nick ChoFacebookTwitterEmailIn Person of Interest we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Nick Cho, cofounder of Wrecking Ball Coffee Roasters and parent behind the beloved TikTok account Your Korean Dad.If you know specialty coffee, you likely know the name Nick Cho. Since he entered the industry 20 years ago, Cho has founded coffee shops, spoken at conferences and college classes, trained plenty of baristas, judged coffee competitions, and started the niche’s first podcast, Portafilter. Since 2011 he and his business partner and wife, Trish Rothgeb, who coined the term “third wave” coffee, have run San Francisco’s Wrecking Ball Coffee Roasters, which boasts two locations and a roastery. That work is why I started following Cho on Twitter and TikTok.But in the spring of 2020, I started seeing Cho all over my feeds as his videos were reposted and referenced even by people who couldn’t tell a V60 from a Chemex. His TikTok—where he’d initially made coffee drinks at home and shared his sneaker collection—turned into a global phenomenon as he became “Your Korean Dad,” now with close to 3 million loyal followers. Your Korean Dad isn’t a persona but a public display of how he is in daily life, says Cho—who has two kids in addition to his many internet ones.A typical Your Korean Dad video starts with Cho introducing himself. “I’m your Korean dad,” he says, patting your head. What follows is, honestly, pretty mundane, like a trip to Walgreens, or the grocery store, or Five Guys. In one video he makes you a coffee while you do your homework, and in another, he drops you off at the airport, waving as you walk away. Far away from my family, I feel comforted by Cho’s videos as I remember the childhood grocery trips and errand runs I took for granted.TikTok contentThis content can also be viewed on the site it originates from.The fact that Your Korean Dad videos are directed at you, the unseen viewer, is the point—Cho is talking to you and sharing with you. While grocery shopping, he asks which Babybel color you prefer, black or red, and while visiting the Costco food court for a slice of pizza and a hot dog, he adds that you should eat only as much as you feel like eating. These clips may seem simple, but they represent how food is a powerful act of parental love. Many of Cho’s commenters refer to absent, distant, or deceased parents, suggesting that Your Korean Dad eases the sense of loss. “Best dad ever” is a common refrain. The overwhelming sentiment is that Cho is Dad to all of us.Amid the chaotic energy of the internet, Cho’s videos offer a feeling of genuine support, like you’re being cared for, even if only through a screen. I caught up with Cho over Zoom to talk about his unexpected TikTok success, how fatherhood and food are connected for him, and, to bring it all back to the start, how coffee shops informed his approach to parenting, online and off.This interview has been edited for clarity.I got on TikTok because... I have teenage daughters and they said, “You should be making TikTok videos.” I've been making videos since I was 14, on VHS tape and things like that. I started making coffee videos on TikTok and I was like, “That's my day job. It's boring.” I started to be more focused and more intentional.Having run coffee shops for 20 years… I’ve learned there’s this interesting relationship between what do people want—and what are you giving them? It's always been an interesting idea for me and Trish: Instead of trying to figure out what our coffee philosophy and coffee profile and aesthetic was going to be, what if we started with the question: “What do people want when they want coffee?” Not: “What are they asking for?” Not: “What do they say they want?”When I first opened my first coffee shop in 2002… I remember spending extra energy trying to make my mom an extra good latte. After she left I was reflecting: Why did I make it special for her—like, doesn't everyone deserve that amount of care? Though capitalism and commerce has commodified the gesture, giving someone something to eat or drink really is an act of love at the core.Your Korean Dad came from... realizing that the viewer should be the main character. I’m Korean, I’m a dad, and like a lot of dads, I’m trying to wrap my brain around what being a dad means. But the “your” is maybe the most important part—that I’m offering myself up to the viewer in that way. When you say you’re so-and-so's dad, you’re subordinate in the narrative.The first Korean Dad video to blow up was… a trip to Walgreens to get snacks. It was really unexpected, and in fact, to be honest, a little jarring at first. That’s when I was getting duets of kids crying, watching my video. There are a lot of tears involved from the audience when they’re engaging with me.People have emotional relationships with food... especially when it comes to parents. With dads, we’re talking about one person—sometimes two or three—for any individual, so the make-or-break element of that relationship is heartbreaking. Even when the relationship goes well, it can be bittersweet. When it’s a failure or when there’s pain and trauma mixed in, it’s a lot for a person.I think about what healthy really means... in a way that is centering the kid. For me it’s ultimately about what’s healthy psychologically and emotionally, as well as physically. I almost make certain messages incidental: “No, you don’t have to finish the hot dog,” and then I try to move on. The idea of “finish your plate” is such a fraught topic, from an individual's relationship to food going all the way to their relationships with family and culture.The mundaneness is the profound part… for a lot of people. I made a second Walgreens video and it was to go get tampons, with the idea that it was no big deal for a dad. I’m trying to find opportunities to model behavior that’s going to mean something to people and actually make a statement, even if it’s a little bit more covert than overt.Managing young 20-somethings in coffee shops… has helped me sharpen my parenting style. I think I’m a good dad; my kids seem to think so. We don’t have the kind of bickering relationship that some kids have with their parents. They’re never like, “I hate you.” We’ve never had a fight. Sometimes it’s creepily too perfect.My number-one job as a parent, and, for that matter, as a manager is... to always build trust and to never break trust. Once you break it, you can’t really put it back together the same way. But that can also get you almost like a turtle in a shell: afraid to do anything in case you mess up. There’s this meekness and this hesitancy that comes with that, and I know that’s not being a good dad. One of the things that I want to be able to do is challenge people, but in a way they’re totally capable of being challenged.Explore Bon AppétitPerson of InterestLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-29", "author": ["Condé Nast", "Bettina Makalintal"]}