{"id": "fa6b247a491c06be1cf32988400c12d7", "url": "https://www.bonappetit.com/story/5-ways-to-master-healthy-cooking", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "5 Ways to Master Healthy Cooking in 2018 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking5 Ways to Master Healthy Cooking in 2018The healthy cooking strategies behind the delicious recipes in the Feel Good Food PlanBy Emma WartzmanJanuary 4, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Emily EisenFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.When people think of eating healthier, they generally think of a salad. But that's not always the right idea. In the winter, when you're cooking more at home, there are so many ways to make your food flavorful, warming, and as straight-up delicious as it is good for you. These are the strategies that senior food editor Andy Baraghani employed when creating his recipes for the Feel Good Food Plan, but they don't just work for those recipes. Keep these in mind all the time (unless you're going all out with spaghetti and meatballs for Sunday supper, because it's all about balance, people). You might even forget you're eating healthy–you'll just know you're eating well.Go NuttyNut butter is a great way to add heft and protein to sauces and dressings, but we especially love chopped nuts. You get a lot of crunch that way, no matter if you're topping, say, a piece of fish or meat, some roasted veggies, or even your morning yogurt. \"They're an all purpose texture-elevator,\" says Baraghani, \"and they also really fill you up.\" Pro tip: Get them from a bulk bin instead of pre-packaged: They're much cheaper that way.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Emily EisenRaw Veg > Cooked VegGenerally speaking, raw vegetables keep you full longer than cooked ones because your stomach has to work harder to digest them. But, as we said, you can't live on salad alone. Try adding an element of raw veg to your food (say, crunchy celery on your slow-roasted salmon, or slices of carrots and cucumbers in your noodle bowl). And, while you're at it, cut that raw veg up smaller. \"I find that it's easier to eat more when you have thin strips or mandolined slices of something fresh and crunchy,\" Baraghani says. \"You tend to pack a lot more in that way without even noticing.\"Fat Is Your FriendWe've said this before, and we'll say it again: Don't be afraid of fat. You need it both to feel full and also to carry whatever other flavor you're adding to a given dish. Just know that a lot goes a long way, and be smart about your fat sources. Use the fat that comes with whole foods. For example, in these these One-Skillet Crispy Chicken Thighs with Fennel and Harissa, the chicken, vegetables, and potatoes all cook in the fat that renders from the chicken skin, no extra oil required.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Emily EisenPucker UpOften, if a dish tastes bland, we think it needs more salt. But acid is what your food is missing, we guarantee it. Here's the thing: You probably already juice a lemon for your salad dressing, or maybe you drizzle some balsamic over your caprese, but that juicy brightness can do a world of good for, well, pretty much everything. Think lime wedges squeezed on Turmeric-Coconut Curry with Pork or slices of grapefruit in Slow-Cooked White Fish with Charred Cabbage or a squeeze of lemon over Chickpea and Celery Soup with Garlic-Chile Oil. For a more nuanced oomph, \"try mixing more than one kind,\" says Baraghani, \"like both a vinegar and a citrus.\"Hot, Hot HeatLike acid, heat is an excellent addition to almost anything. Sure, you can add some hot sauce to your food when all is said and done (and in the case of, say, a taco, we're definitely not opposed). But the smarter move is to think about it as you're cooking—giving your food depth with heat as you go. In the case of that chickpea soup, heat comes in the form of a crunchy garlic chile oil sprinkled on top. In this Roasted Broccoli and Tofu with Creamy Miso Dressing, mild red pepper flakes add that bite, and with those one-skillet chicken thighs, it all comes from that harissa.Explore Bon AppétitHealthyishFeel Good Food PlanRead MoreshoppingCondiments Come and Go, But NY Shuk Harissa is ForeverBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-04", "author": ["Condé Nast", "Emma Wartzman"]}