{"id": "fa6ec6dd864b181a95f3c5f71b18ae82", "url": "https://www.bonappetit.com/recipe/fiery-green-tahini-sauce", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Fiery Green Tahini Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueFiery Green Tahini SauceBy Andy BaraghaniJuly 10, 20185.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThis is the condiment version of those summer sandals you want to wear with everything. This tahini sauce recipe goes with sandwiches, crunchy vegetables, and chips. Just make sure you start with the good stuff (we love Soom!)—now’s not the time to skimp on quality. IngredientsMakes about 2 cups2lemons2serrano chiles2garlic cloves, crushed3cups chopped parsley¼cup extra-virgin olive oil½cup tahini (such as Soom)Kosher saltPreparationStep 1Finely grate zest of 1 lemon into a blender. Cut both lemons in half and tease out seeds. Squeeze juice into blender; you should have around ½ cup. Add chiles, garlic, parsley, oil, and ⅓ cup cold water and blend on high speed until smooth and very green.Step 2Pour mixture into a medium bowl, add tahini, and whisk until fully incorporated; season sauce generously with salt.Step 3Do Ahead: Sauce can be made 3 days ahead. Cover and chill.How would you rate Fiery Green Tahini Sauce?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI had a jalapeño on hand so used it - whole - and added from my garden a few leaves of kale, young collard, and a handful of basil in addition to parsley.  Also toasted and chopped a handful of pistachios, and added a some chopped dates (those two ideas from another BA broccoli recipe). Excellent! AnonymousSugar Hill, NH7/13/2021I made this with jalapenos instead of serranos (I had a bunch to use up), and roasted them first, removing the skins. Served it on a grilled pizza topped with eggplant, onions, bell peppers, and ground beef, all topped with spring greens. So yum!AnonymousNew Jersey 7/7/2019Explore Bon AppétitSauceCondimentHot SauceTahiniCondiments, Sauces & PastesParsleyHerbs & SpicesSerrano ChileChileVegetableSummerEasyQuickDairy-FreeGluten-FreeVeganVegetarianKetoHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Andy Baraghani"]}