{"id": "fa72f70ea5ceec52fb66603180865e97", "url": "https://www.bonappetit.com/story/never-fail-flaky-bread", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "This Flaky Bread Is the Best Recipe I've Ever Found in a Random Google Search | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Flaky Bread Is the Best Recipe I've Ever Found in a Random Google SearchIt's buttery, flaky, and tastes like my childhood.By Elaheh NozariMarch 23, 2018FacebookTwitterEmailDanny KimFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down. This week: the flaky bread recipe that e-commerce editor Elaheh Nozari just couldn't live without.My love for flaky bread begins long before I knew that there was a magazine called Bon Appétit, when was I was a nine-year-old from New Jersey living in Tokyo.I don’t remember too much of the two years my family lived in Japan, but something I think about a lot is the naan-like bread my mom used to buy from an international grocery store near our apartment. Each clear plastic bag came with three pieces of buttery flatbread in it, and the best was the middle one that soaked up the grease from the two that sandwiched it. Every morning, I’d heat up the naan in the toaster oven then pour honey all over it. (I would’ve spread a little extra butter on it too, but my mom told me that the bread had enough. She was right. Whatever.)I’ve searched long and hard for that particular flaky bread at Indian and Asian grocery stores since I moved back to the States, but have always come up empty-handed. That is, until I typed “bread like naan butter flaky” into Google a few years ago on a nostalgic whim and stumbled upon this Bon Appétit recipe. (I didn't even work at BA at the time!) It's not exactly naan (in fact, the recipe is based on Yemeni malawah), but it tastes just like my long-lost bread—and is freakishly easy to make.I love a lot of things about this recipe, one being that it doesn’t require any yeast. Don’t get me wrong, I’m all about a homemade boule, but I crave fresh-baked bread more often than I have active yeast hanging around. I also don’t like to leave my apartment, and when that craving for bread hits, all I have to do is go into my kitchen and whisk together flour, butter, water, and salt in a bowl.It takes about seven minutes to mix the ingredients together and knead the dough, which you have to let sit for four hours. It’s not instant gratification bread, but it doesn’t require a sourdough loaf level of commitment either—and the waiting isn’t that bad, I swear. Sure, you can go out and interact with the world, but I’ve made this bread while working from home during a snowstorm, in the midst of a Netflix binge, and, most recently, while doing my taxes. The dough doesn’t rise in that time so much as it lets the butter mingle with the flour, and uh, oil it up. Do not rush the oiling up stage, the butter and flour need to get to know each other!You can eat that flaky flatbread on its own, but nobody's going to say no to some creamy dip...\nAlex LauAfter four hours or so, the dough is ready to be partitioned into smaller ball-shaped pieces. You’ll have to let these guys rest for fifteen minutes, then it’s party time. The key to making this bread flaky and wonderful is coiling the dough: roll each little ball out into a thin round with a rolling pin, give it a light brush of butter and dash of sea salt, fold the round into itself to create a long rope, then wind the rope into a tight coil. Finally, roll the coil back out into a thin round. Yes it will look the same as when you started the whole shebang, but the butter is now redistributed across thin layers.My coils always look like little snails before I give them their final roll down. Each round takes about four minutes to cook—two on each side in a cast-iron pan—but you don’t have to cook them all at once. You can freeze a few, so when you wake up from that recurring dream of you and Oprah talking about how much you love bread, you can plop a frozen disk into your cast-iron and have freshly baked bread in five minutes. If that's not the point of life, I don't know what is.Get the recipe:Flaky Bread (Malawah)This warm, buttery, pull-apart bread is easy to throw together (just five ingredients) and crazy versatile.View RecipeExplore Bon AppétitBasicallyFlatbreadNever FailButterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-23", "author": ["Condé Nast", "Elaheh Nozari"]}