{"id": "fa78eadd55ad71345708fba0c4b9f9a7", "url": "https://www.bonappetit.com/recipe/tiger-fruit-salad", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Tiger Fruit Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueTiger Fruit SaladBy Sarah JampelJune 2, 20204.8(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Sue Li EmailPinterestPrintEmailPinterestPrintWhen that summer peach or plum isn’t quite ripe enough to eat out of hand, marinate thin slices in a vinegary dressing for this refreshing riff on the Chinese dish lao hu cai, otherwise known as tiger salad. This method also works beautifully on firm pears and unripe mangoes.Ingredients4 servings1lb. underripe stone fruit (such as plums, nectarines, or peaches), pears, or mangoes, thinly sliced1serrano chile, seeds removed if desired, thinly sliced2Tbsp. unseasoned rice vinegar1Tbsp. sugar½tsp. kosher salt, plus more1bunch cilantro4scallions, thinly sliced on a diagonal2celery stalks, thinly sliced on a diagonal2tsp. toasted sesame oil1tsp. low-sodium soy sauceZest of 1 lime2Tbsp. toasted sesame seedsLime wedges (for serving)PreparationStep 1Gently toss fruit, chile, vinegar, sugar, and ½ tsp. salt in a medium bowl to combine. Let sit until fruit is spicy and flavorful, about 10 minutes.Step 2Meanwhile, gather cilantro into a bundle and cut into 2\"-long pieces. Transfer to a medium bowl, add scallions and celery, and toss to combine.Step 3Drain fruit in a fine-mesh sieve set over a small bowl; set fruit aside. Add oil, soy sauce, and lime zest to marinating liquid in bowl and whisk to combine. Pour dressing over cilantro mixture and toss to coat. Add reserved fruit and sesame seeds and toss gently to combine. Taste and season with more salt if needed.Step 4Transfer salad to a platter\nand serve with lime wedges.How would you rate Tiger Fruit Salad?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleWonderful salad, I did change the seed to sunflower for a bit more buttery feel and nixed the soy sauce because I paired it with the lacquered ribeye in the same issue. I'll be making this a lot this summer!!!  cproctor5West Virginia7/8/2020Super easy, quick, and refreshing summer salad and most ingredients I had from other recipes I’d used them in! Loved itAnonymousATL7/7/2020Super easy and super delicious. The sesame seeds are essential for texture and bringing all of these flavors together. We've been using peaches for the unripe fruit and have been very happy.\n\nHolds well enough for a day or two in the fridge.ngcarr92Seattle, WA6/30/2020An interesting salad- great flavors and a fun option for summer. There's a slight feeling of something missing but it's hard to nail down. Anonymous6/22/2020Explore Bon AppétitSaladAsianPlumStone FruitFruitPeachNectarineSerrano ChileChileVegetableSummerEasyQuickSideDairy-FreeVeganVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Sarah Jampel"]}