{"id": "fa7b35be50156d0a41f3b44e207dedf2", "url": "https://www.bonappetit.com/recipe/brothy-meatballs-with-peas-fennel-and-tiny-pasta", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Brothy Meatballs with Peas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueBrothy Meatballs with Peas, Fennel, and Tiny PastaBy Alison RomanApril 16, 20194.5(23)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintThis dish is a perfect choice for those blustery but bright early spring days: It's comforting from the simple-but-flavorful broth and bright from the crunchy fresh topping.Ingredients6–8 servings Meatballs1small onion, finely chopped1cup very finely chopped parsley¾cup plain whole-milk Greek yogurt1Tbsp. fennel seeds2tsp. kosher salt1tsp. freshly ground black pepper2lb. ground pork or lambAssembly2Tbsp. (or more) extra-virgin olive oil, plus more for drizzling3large shallots, thinly sliced4garlic cloves, thinly sliced2medium fennel bulbs, halved, cored, very thinly sliced lengthwise, dividedKosher salt, freshly ground pepper4cups low-sodium chicken or vegetable broth3Tbsp. white wine vinegar, divided2cups pea shoots (tendrils)½cup torn dill½cup parsley leaves with tender stems8oz. sugar snap peas, thinly sliced on a diagonal (about 2 cups)2cups shelled fresh (or frozen) English peas and/or shelled fava beans3cups cooked fregola, Israeli couscous, or farroAleppo-style pepper (optional), lemon wedges, and grated Parmesan (for serving)PreparationMeatballsStep 1Mix onion, parsley, yogurt, fennel seeds, salt, and pepper in a large bowl just to combine. Add pork and mix with your hands (or a wooden spoon) until well blended but take care not to overmix, or meatballs could be dense.Step 2Using your hands, lightly pack meatball mixture into tangerine-size balls (about 1½\" in diameter) and place them on a rimmed baking sheet.AssemblyStep 3Heat 2 Tbsp. oil in a large heavy pot over medium-high. Working in batches and adding more oil if needed, add meatballs to pot, making sure to leave enough space between them so you can move them freely, and cook, turning occasionally to help them keep their shape, until evenly browned on all sides, 5–8 minutes. Transfer to a clean rimmed baking sheet.Step 4Add shallots, garlic, and half of fennel to pot (no need to wipe out). Season with salt and pepper and cook, stirring occasionally and reducing heat as needed, until vegetables are softened and starting to brown, 10–12 minutes.Step 5Add broth and 2 Tbsp. vinegar to pot and bring liquid to a simmer. Return meatballs to pot along with any juices that have accumulated on baking sheet and simmer long enough to let flavors meld, 6–8 minutes.Step 6Meanwhile, toss pea shoots, dill, remaining sliced fennel bulb and remaining 1 Tbsp. vinegar in a medium bowl; season with salt and pepper. Set salad aside.Step 7Just before serving, add sugar snap peas and English peas to broth and cook until no longer raw, just a minute or two (you want them to retain a little bit of bite).Step 8Spoon fregola into bowls and ladle meatballs, vegetables, and broth over. Top with reserved pea shoot salad and sprinkle with Aleppo-style pepper if desired. Serve lemon wedges and Parmesan alongside.How would you rate Brothy Meatballs with Peas, Fennel, and Tiny Pasta?Leave a ReviewTell us what you thinkReviews (18)Back to TopTriangleThis is easily one of my favorite bon appetit recipes. The first time I made it I definitely had the problem of the meatballs falling apart during cooking. This time I added an egg and cooked them in the oven at 400 for 15 minutes, and then broiled them for 10 minutes. They came out perfect. LindsayDallas, Texas 9/20/2021Really one of the best things I've made in some time!  We simplified steps and cooked the meatballs in cast iron skillets in the oven at 450, browning them for a short bit under the broiler.  Held their shape beautifully. All the fresh Spring flavors were delightful!  Substituted garlic scapes for pea shoots (no pea shoots left around here). Will make again!CarolynWalla Walla, WA6/16/2021Added a beaten egg to the meatballs.  They held together well.  Otherwise, delicious!AnonymousCheektowaga NY4/4/2021Tasted great, but the meatballs did almost immediately fall apart. The flavors, however, were wonderful and I've got soup for days.AnonymousHouston, TX1/11/2021This was amazing, but the meatballs fell apart so easily. It was still really nice with the mince mixture throughout the broth. I especially loved all the fennel.AnonymousAustralia4/11/2020This is honestly some of the best soup I have ever had. I didn’t follow the recipe perfectly as I couldn’t get my hands on enough pea shoots and a couple other items. Even still- IT IS SO GOOD. The lemon adds a wonderful crisp flavor and I used couscous which are just fun to eat amiright? Anyway- make this.ATellyCooksJersey11/18/2019This took a while to make and there were way too many peas for my liking. This easily serves 8 people. Anonymous10/14/2019I tweaked this recipe a little bit and it’s great but I will say the meatballs are super salty!!  I’ll use less salt next time for sure. AnonymousNew York 7/9/2019My meatballs stuck to the pan and were impossible to turn without falling apart...any advice?AnonymousMountain View7/9/2019I wanted to love this but it was pretty meh :( I was hoping the meatballs would be more flavorful. The broth was pretty good though.AnonymousSan Diego5/30/2019This recipe is super delicious and really impressive to serve up. I love the different possible variations and the idea that you could break down the 'make ahead' elements to make it a quick weeknight recipe. I can't wait to make it again!!AnonymousMontreal5/26/2019Loved this - perfect for when you want something warm but fresh and light at the same time. Skipped the dill, used ditalini pasta, and couldn’t find pea tendrils so used bok choi instead. \n\nNote: the recipe is missing parsley in one of the steps- where it says add dill I think it should be dill and parsley (if you are using both)AnonymousChicago5/22/2019Darn autocorrect. I used farro, not Fargo. lorilHouston5/21/2019This is excellent!  I used ground pork, Fargo, and English peas and made everything exactly as written. However, I would say the recipe easily feeds 8 and maybe even 10 light eaters. lorilHouston5/21/2019Absolutely delicious! We used lamb for the meatballs and farro for the grain (no dill bc we didn't have any) and it was amazing.  Extremely hearty, filling and healthy. My sister-in-law said, \"This was the best homemade meal I've had in months!\" Would definitely cook again. Anonymous5/1/2019Explore Bon AppétitMeatballSoupSoups and StewsPastaGround PorkPorkMeatFennelVegetablePea ShootLeafy GreensSugar Snap PeaPeaFarroRice & GrainsGround LambLambIsraeli couscousCouscousPasta & NoodlesFregolaNoodleYogurtOther IngredientsSpringMainNut-FreeHealthyishEasterDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Alison Roman"]}