{"id": "fa8ae3f84aaa5b55a30d835c3b8fffb9", "url": "https://www.bonappetit.com/story/stretching-while-high", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "Stretching While High Is My New Favorite Activity | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleStretching While High Is My New Favorite Activity Letting my body and mind safely unwind has let me access physical comfort more in my sober life, too.By Martine ThompsonFebruary 25, 2020FacebookTwitterEmailIllustration by Sonya KorshenboymFacebookTwitterEmailI’ve started stretching while high. And it feels gooooood. Like, orgasmic good. Turns out, the benefits of stretching while riding the wave of a good high are well documented, and far from new. “Cannabis helps to relax the body and anxieties in the mind, both of which prevent us from truly connecting to and appreciating the sensations in our bodies,” writes Dee Dussault, cannabis-enhanced yoga instructor and author of Ganja Yoga: A Practical Guide to Conscious Relaxation, Soothing Pain Relief, and Enlightened Self-Discovery. “Once tensions are lifted,” she explains, “it’s easier to tune in and enjoy the sensitivities of stretching.”When I get high, it’s because I want that floating-on-a-cloud happy feeling, I want those creative bursts of inspiration, sure. A great high for me is like being at an Odesza concert with the love of my life on one side and my best friend on the other, eating a really good snack. But my highs provide much more than giddy fun. They return me to what feels like a more authentic version of myself––a me aware of my trauma and the oppressive world in which I live, but unweighted by it. I’m not anxious or over analyzing. The stress and discomfort that manifests in my body from its regular encounters with misogynoir and cis-heteronormative culture melts away.So stretching, practicing mindfulness, and getting high? I’m into that. In the name of research, I decided to keep a diary on the Wednesday that I experimented, to track what exactly makes this union between loosening the body and weed so satisfying.12:30 p.m. – The cannabisI’m starting off with one piece of candy from a pack of 2020 Future cannabis-infused edibles. Reminiscent of the sour belt candies of my childhood, the sugary, rainbow strips are 30 mg each and made with THC distillate oil. This particular edible is an indica/sativa hybrid you can get from dispensaries in California and, in my own experience, takes 30 to 50 minutes to kick in.1:17 p.m. – Settling inSo far it’s stretching as usual: [Enjoys stretching]…[Looks at phone]…[Goes down anxiety hole] What if that post I saw about Amazon workers getting random recordings of people who didn’t know they were being recorded and being tasked with transcribing them happens to me?! I talk out loud to myself hella often...what if my cell phone company gets those recordings?! They’d probably be like, “This isn’t even helpful, it’s just sad. Get this woman some therapy.”.....[Returns to stretching]…Hmm, yeah, this is nice.1:27 p.m. – Lifting offFinally that familiar euphoria has set in: I feel smiley, pensive, and connected to my body. Wow, more people should watch the Moonlight trailer while high, so beautiful! Ugh, imagine if we could hit rewind and experience the bliss of seeing it for the first time any time we wanted...1:45 p.m. – FlowingI’m taking deep, concentrated breaths innnn and outttt, standing tall, and stretching my leg across the top of my dresser in a ballerina pose. I do this because it helps with my posture (for a few seconds at least). Now the stretches are deeper than usual, and so is the breathing. It’s like my body is on a soothing version of autopilot and I’m along for the ride.I stretch my arms downward, to my toes, but notice how I don’t push it the way I usually do. I let my body do the talking, and it says, you don’t have to endure as much pain as you can tolerate for this to be a valuable experience.I sit down cross-legged and extend my arms toward the ceiling, wiggling away the stiffness. As I lean into a side stretch, I feel something like Pop Rocks meeting my tongue—but in my body!—from the tip of my fingers down my side. It feels like I can shimmy tension out of my body in any position I choose.2:07 p.m. – Feeling myself[Looks down, sees only underwear] When did I take off my clothes? [Continues stretching] I don’t normally stretch in my underwear. Body dysmorphia has left me with a challenging relationship with my physical self. I’m never fully comfortable naked, but being in solitude and high allows me to be naked without shame or hyper-awareness. I appreciate time like this with my body where I don’t feel under the intense gaze of societal expectations and can just be.2:15 p.m. – Wrapping upI’m in the mood to munch. BBQ honey twists. Late July Jalapeno Lime tortilla chips. No, I want homemade vanilla ice cream with fresh raspberries…[Goes to kitchen and finds neither chips nor homemade ice cream] Cheesecake it is!AfterthoughtsLetting my body and mind safely unwind and take a trip has let me access physical comfort more in my sober life, too. Surviving in this world is hard and requires an ever-evolving toolkit. Cannabis is one of my tools, though I’m still learning where the line between healthy coping and unhealthy indulgence falls. What I do know is that stretching while high has helped me be more vulnerable, address trauma, and relax deeply, fully, and freely: the way my body deserves to.Explore Bon AppétitHealthyishCannabisessaySelf CareRead MoreLifestyleYour Weed Buying Habits Can Make the Cannabis Industry More Ethical and FairBy Charlotte PalerminoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-25", "author": ["Condé Nast", "Martine Thompson"]}