{"id": "fa90d1717b636f9c3a707ce79ffcbe3a", "url": "https://www.bonappetit.com/story/how-to-talk-to-your-family-about-weed", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "How to Talk to Your Parents About Weed This Holiday Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Talk to Your Family About Weed This Holiday SeasonBecause they're definitely going to ask.By Charlotte PalerminoNovember 9, 2018FacebookTwitterEmailIllustration by Lan TruongFacebookTwitterEmailThere are a few cardinal rules to surviving the holidays with your extended family: Dodge inquiries into your dating life, choose political debates wisely, and never talk about recreational drugs.This holiday season, the latter may be impossible to avoid. With baby boomers becoming the fastest growing cannabis consumers, even if your pops isn’t hitting a vape, chances are he’s read a headline about it. With CBD proliferating across the wellness world and the recent legalization of cannabis in Canada, older generations are letting go of stoner stereotypes and getting curious about weed 2.0.But, kind of like that one Thanksgiving when you taught a masterclass on emojis, your relatives will need an education on cannabis as well. The internet is a confusing place to learn about weed, so here’s a handy guide to the most common questions you’ll get asked about this brave new weed world...and how to handle them.Slow down, kid. Doesn’t weed just get you high?Not all weed.There are over 140 known compounds found in weed, and only one gets you high. Tetrahydrocannabinol (THC) intoxicates users by binding to receptors in your central nervous system. You can breed plants to have higher or lower THC levels, which is why some weed can get you really, really high—it’s been GMO’ed to be that way.THC also affects appetite and may reduce inflammation, but it’s the other compounds in cannabis that may help regulate pain, treat acne, and reduce anxiety, no high included.So what’s that trendy thing called? BSB? CBGB?Cannabidiol a.k.a CBD is another abundant compound found in cannabis. CBD is also found in hemp, which has low levels of THC and is gray-area legal. (The FDA recently approved its use in one drug—Epidiolex.)  Unlike THC, from what we know, CBD doesn’t bind to receptors in your central nervous system. Instead it interacts mostly with your CB2 receptors, which are found all over the body including the digestive tract, peripheral nervous system, epidermis, and immune cells.While it won’t cure all your ills and file your tax returns, there are preliminary studies that indicate it helps with a host of things like pain, acne, and anxiety without the high. Combine that with it being technically legal in most states and you have the hottest trend in wellness.But weed is still illegal, right?It’s complicated. If you live in one of the nine recreationally legalized states, it’s legal. If you qualify for a medical condition in 30 states and get a medical card, it’s legal. If you’re in one of the 35 states that have a hemp pilot program, hemp-derived CBD is legal through your state’s hemp pilot program.See? Very complicated.Not if you’re in Canada. On October 17th, Canada became the first G7 country to legalize weed recreationally, meaning anyone who visits can buy it. Just make sure Uncle Ted doesn’t try to bring any back, because that’s a federal crime.Is hemp the same as weed? And is that carton of hemp milk going to get me high?The best way to think about hemp is that it’s cannabis that’s been bred to remove most of the THC. The U.S. government recognizes any cannabis plant that has less than .3% THC as industrial hemp. Currently, it’s gray-area legal but will be legalized federally soon as Mitch McConnell (yes that Mitch McConnell) is pushing a controversial farm bill.If you’re in a legalized state for cannabis, we recommend buying CBD, THC, and anything that is cannabis-based from a dispensary, which is a state-licensed store that has purity standards. If you’re shopping for CBD on the unregulated hemp market, read this article.Will I get addicted to weed? It’s so much stronger than when I was your age.Based on the research we have, you won’t get addicted to CBD. THC does have addiction rates but they’re lower than alcohol and cigarettes.If you’re wondering why weed is so much stronger, it’s because certain strains have been genetically modified to be that way. Much like you can breed corn to be pesticide-resistant, weed is just like any other agricultural product. Some strains have a lot of THC, some have very little. Age can also impact how you tolerate cannabis so, the older you get, the more careful you need to be.If you want something milder than Girl Scout Cookies (google it), try strains and products that have higher CBD than THC levels. Ratios that are 1:1 CBD:THC or higher are a safe bet for a mild high. Strains like ACDC, Charlotte’s Web, Sweet and Sour Widow, or Stephen Hawking Kush (no lie) are all CBD-dominant or balanced strains that mitigate the impact of THC.If you have a history of addiction, we recommend speaking with your doctor before experimenting with any cannabis strains.What happens if I take too much CBD?Unlike shots of tequila, CBD has a bell curve response rate. More CBD doesn’t mean stronger results. Everyone has their own “Goldilocks Zone,” and the only known side effect of taking too much CBD is drowsiness.My back hurts. Will weed help?For localized pain relief—aching muscles, sore joints—try a topical cannabis product. Topicals with THC can enter your bloodstream and make you high, so if you don’t want that, use a CBD topical instead. CBD on its own has been shown to help with inflammation. That being said, there is some research on mice showing full-spectrum (whole plant including at least some THC) as a more effective way to consume CBD. If you aren’t worried about trace amounts of THC, try the full-spectrum topical to see how you feel.Smoking is bad for you!We’ve come a long way from bong rips and roaches. You rub cannabis on your face and joints, slap on a transdermal patch, or take a tincture and hold it under your tongue. In other words, smoking isn’t the only way to feel the benefits of weed. The great thing about legalization? Better access to a wider range of products and more innovation.Explore Bon AppétitHealthyishCannabisFamilyTrendsRead MoreLifestyleThese Sparkling CBD Drinks Have Replaced My La Croix Habit For GoodBy Annie DalyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-09", "author": ["Condé Nast", "Charlotte Palermino"]}