{"id": "fa9adcfbb4b820e5577139d539646dcc", "url": "https://www.bonappetit.com/story/starbucks-blonde-roast-espresso", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Starbucks Is Introducing a Blonde Roast Espresso | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureStarbucks Is Introducing a Blonde Roast EspressoThe first change to espresso in the company's 40-year history.By Melissa MintonJanuary 9, 2018FacebookTwitterEmailStarbucksFacebookTwitterEmailJust when you thought that there was already an endless combination of coffees, milks, and flavors at Starbucks, they went and added a whole new blend of espresso. On Tuesday the company introduced Blonde Espresso, the first new espresso in the company's more than 40-year history.So what does this coffee makeover mean for you? The same principles of light, medium, and dark roast coffee apply to espresso: A blonde roast is lighter and a bit sweeter than your average cup and, contrary to popular belief, actually has the same amount of caffeine as darker roasts. The introduction of Blonde Espresso could also help you on your way to a healthier 2018, since, as the company noted in a press release, \"Blonde is a great option for customers who are new to coffee, or who are looking for a smoother coffee flavor that needs less cream and sugar added.\" Plus, if you opt to add Blonde Espresso to your favorite espresso-based flavored drinks, like the Vanilla Latte or Caramel Macchiato, the baristas will add less of the sugary syrups than they would if they were using the traditional darker roast to balance out the sweeter flavors of the new espresso blend.Last year, Starbucks tested out the lighter roast in Canada, and is now taking it worldwide as part of the permanent menu. The new option blends lightly roasted Latin American and East African beans to \"bring out their bright, sweet citrus notes and smooth body\" and has \"hints of lemon, orange, and caramel\" while the traditional, darker roast is \"bolder and roastier.\" Starbucks suggests ordering a Blonde Flat White or Espresso Macchiato if you want a smoother taste, but recommends sticking with dark roast for something like a mocha, which has a rich and bittersweet flavor. Soon enough, you'll be counting down the days until you can try a Blonde Pumpkin Spice Latte when the beloved drink returns to the menu in the fall.It was a big start to the new year for Starbucks, they also won the \"underfilled latte\" lawsuit,, in which a customer claimed the chain purposely left space in drinks—we'll call that Angel's Foam. Glad we can all move on now, to bigger and lighter roasted things.Related: Starbucks Apron Colors Have Secret MeaningsSuddenly craving one of these...Explore Bon AppétitTrends + NewsStarbucksTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Melissa Minton"]}