{"id": "fad017434d6f6dfaddfde299c94c3de8", "url": "https://www.bonappetit.com/story/supplement-when-my-coworkers-are-sick", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Wellness Formula Vitamins Keep Me Healthy When All My Coworkers Are Sick | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Supplement Keeps Me Healthy When All My Coworkers Are SickI reach for this blend of antioxidants, herbal extracts, vitamins, and minerals when everyone is sniffly.By Rachel KartenApril 2, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!In the five-ish years that I’ve lived in New York, where we are all essentially swaddled in a warm blanket of germs, I have never needed to go to the doctor for being sick. *Aggressively knocks on wood*  And when people ask how, the answer is always Wellness Formula vitamins.Every time I feel a little off—scratch in the back of my throat, clammy hands, runny nose—I take six capsules twice a day. Within a day or two, I am completely free of any symptoms. That’s because each capsule is packed with antioxidants, herbal extracts, vitamins, and minerals—from garlic bulb to echinacea to astragalus—that each address and support a specific part of your immune system. I like to think of Wellness Formula as the Marvel movie of vitamins, with every ingredient (there are over 30 of them!) doing its part to fight off the evil New York germs plotting an attack on my immune system. – Rachel Karten, senior social media manager.Buy it: Source Naturals Wellness Formula, $31 for 240 capsules.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItSelf CareShoppingRead MoreshoppingThese Sleep Supplements Got Me Through a 20-Hour Flight—and Jet LagBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Rachel Karten"]}