{"id": "fad5ed66369802fe5ec34653aedcb83e", "url": "https://www.bonappetit.com/story/apple-tart-with-almond-streusel", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "This Glazed and Flaky Apple Tart Will Make You Forget All About Pie | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoptest-kitchenThis Glazed and Flaky Apple Tart Will Make You Forget All About PieThis dessert has everything: maple-roasted apples, a crunchy almond filling, and a puff pastry crust so buttery and crisp, no one will believe you made yourself.By Christina ChaeyNovember 2, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailI’ve heard you should never wait until the day of a big, fancy dinner to try out a recipe you’ve never made before. And yet, that’s never stopped me from baking a brand new (at least to me) dessert from Bon Appétit each Thanksgiving, much to my family’s chagrin. There was the year I over-pulsed the hazelnuts for this Pumpkin-Caramel Tart and spent half an hour carefully blotting away the nut grease that kept seeping out of my oily baked crust. Then there was the time I opted for this Cranberry-Lime Pie, which looked GREAT until I tried to slice it. Can you even cut something the consistency of pudding? But on my quest for redemption in 2018, I picked this new Glazed and Flaky Apple Tart and then proceeded to break my own rule by testing it out first.This is the part where I’m supposed to convince you that you NEED to make this apple tart, and honestly I’m not even sure where to begin. So I’ll say this: It’s likely one of the only times you’ll feel extreme satisfaction while watching something you’ve spent hours making completely crumble apart.Apples, face down in a complex maple syrup–brandy–vanilla situation.\nMichael GraydonIf that’s not convincing, there’s this: The apples are halved and cored (no chopping! No slicing!), then roasted in a maple syrup-brandy-vanilla mixture that infuses the fruit with lots of complex, toasty flavor. These tender apples then get laid atop a delightfully crunchy bed of stir-together almond streusel. But the real pièce de résistance is that you make your own freakin’ amazing PUFF PASTRY, like some kind of dough god.True puff pastry is made via a technique called lamination, in which pastry dough is repeatedly layered with butter then folded and rolled again and again until you end up with endless layers that tower and puff up as they bake—this is what gives croissants, palmiers, and turnovers their irresistibly buttery-crisp texture. This recipe’s streamlined method requires far fewer fold-and-rolls, but achieves a similarly impressive effect. I have no better baking skills than your hobbyist cake baker, but I came out of this tart-making experience feeling like I could school Pierre Hermé in a croissant-off, which is how I imagine this tart’s genius mastermind, Claire Saffitz, feels every day. Here’s the thing I never realized until I made this recipe: If you can make pie crust, you can make puff pastry.To create layers and layers of flaky pastry, fold the dough into thirds like a letter then roll out into a smooth sheet with a rolling pin.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiI learned a few more tricks from Claire that made my finished tart look like it belonged behind the display case at a high-end bakery. 1) She suggests using a melon baller for the most neatly cored apple halves, but I haven’t seen a melon baller since 2002 and have found that a round teaspoon also works perfectly. w) Use a ruler when slicing off thin dough strips from the sides of your tart dough to create the neatest border. 3) And don’t worry about arranging your roasted apple halves in a perfect 3x4 grid within your tart—in fact, the more askew and random they are, the prettier and more natural the final effect. As my test-run tart baked in the Test Kitchen oven at 6:30 p.m. a few weeks ago, scenting the entire room with maple and vanilla as it cooked, I kept cracking open the oven door and screaming at Claire over my shoulder, \"It’s WORKING!!!\"A crunchy bed of streusel before it’s topped with baked apples.\nMichael GraydonThere are few things I’ll do differently when I make this for Thanksgiving. One of them is to use medium apples as, uh, the recipes calls for, and not the cute, slightly-too-tiny apples I acquired during an apple-picking sojourn. I’ll also break up the project over the course of a couple of days. Making it all in a single day is an excellent way to procrastinate for 6 hours at work, but it wasn’t  the most effective way of going about the recipe. Next time, I’ll make the dough and roast the apples a day ahead (though you can make them up to two days ahead) and assemble and bake on Thanksgiving day. I’ll then cut it into slabs and serve it with scoops of vanilla ice cream. I’ll probably eat seconds standing up in the kitchen watching my dad do the dishes and start his turkey-corn chowder with all the leftover meat. And if I’m lucky enough to wake up to thirds for breakfast, well, there’s a high chance that last night’s pint of ice cream will be joining me at the table.Get the Recipe:Glazed and Flaky Apple TartIf you're the type who prefers fruit desserts that go heavy on the fruit, this flaky, crunchy, juicy apple tart's for you.View RecipeExplore Bon AppétitThanksgivingAppleDessertRead MorecookingThe Easy Thanksgiving Dessert For \"People Who Don't Bake\"By Amiel StanekcookingThis Shaved Carrot and Charred Date Salad Will Make You Ditch Lettuce for GoodBy Aliza AbarbanelcookingThe Glazed Brussels Sprouts You’ll Be Making All FallBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-02", "author": ["Condé Nast", "Christina Chaey"]}