{"id": "fad893643625245f932798789844dc01", "url": "https://www.bonappetit.com/story/gravlax-recipe", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Making This Gravlax Recipe Was My Biggest Accomplishment of 2018 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Biggest Accomplishment of 2018 Was Making My Own GravlaxBreakfast has never been more rewarding.By Elaheh NozariDecember 13, 2018FacebookTwitterEmailFacebookTwitterEmailAbout six months ago, my boyfriend sat me down, took his hand in mine, and looked me in the eye. “Ellie,” he said, “I've been doing a lot of research and... I think we should start making our own gravlax.” He told me his dreams of curing salmon during the week and inviting friends over on weekends to feast on our hard work. I wasn’t crazy about the idea—I’m deeply scared of foodborne illnesses—but since he was so full of hope, I suggested we do it at my parent’s house over the Fourth of July.It was a disaster. I place the majority of the blame on the still-unidentified member of my family who left the refrigerator door ajar for 18 hours, destroying most, if not all, of the food inside. I place some of the blame on my partner and me for being bad lox babysitters.Gravlax takes about two to three days to come to fruition, and many recipes, including the one I followed in July (and old recipes we’ve published) require you to care for the salmon like it’s a small child during that period. Every 24 hours, you have to unwrap the fish from its tight packaging, drain it, flip it, and repeat. The process reminds me of that high school health class project where you carry a sack of flour around like it’s a baby, except in this case, your hands are covered in fish oil instead of flour. We were bad lox parents and the final product was mostly inedible, and suspiciously slimy and soggy. I had one bite, panicked that I had listeria, and swore I’d never make my own gravlax again. That is, until I saw this new recipe for citrus and dill gravlax from our own, very exacting Chris Morocco.Compared to other at-home curing methods, there’s minimal room for error with this one. The recipe calls for a 3-pound chunk of filleted salmon to feed 12 people (if you’re making it for a smaller group, buy a 1-pound chunk and cut the recipe by one-third). Chris recommends requesting a thicker cut of the fish—request from middle or closer to the head—and staying away from the tail, which gets too thin. Don’t worry if it’s farm-raised or wild, just buy the freshest salmon you can find at a price you’re comfortable spending. Make the cure—dill, salt, brown sugar, grapefruit and lemon zest, and peppercorns—and cover every side of the salmon with it, including the skin. It’s gonna look like a lot of cure, but that’s what makes this recipe so hands-off: You won’t need to flip the salmon every day to redistribute it. Next, wrap the salmon in parchment paper and plastic wrap like you’re getting paid to wrap holiday presents at the mall. This is no time for laziness—the salmon needs to be wrapped so tightly that no air will get in and no liquid will escape. Sandwich it between two baking sheets, place a cast-iron skillet on top (or anything that’ll weigh the fish down enough to drain all the water), and put the whole contraption in a nice and chilly refrigerator.After 72 hours, the salt and brown sugar cure will have seeped through the layers of fish until the fillet is slightly translucent, and salty, but not overpoweringly so. (It will have left a puddle of fish juice behind too, and you should toss that right in the sink.) Have your bagels and cream cheese at the ready. Wipe off the cure with a towel and slice the salmon. Layer a few pieces on half a cinnamon raisin (trust me and Cynthia Nixon on this—it’s good!), take a bite, and bask in the glory of having made your own gravlax. You’re a proud parent to a healthy batch of lox—and no one can take that away from you.Get the recipe:Citrus-and-Dill GravlaxMany gravlax recipes will instruct you to drain, turn, and babysit the fish while it cures. Not this one: Set it and forget it.View RecipeExplore Bon AppétitSalmonBreakfastFishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-13", "author": ["Condé Nast", "Elaheh Nozari"]}