{"id": "fadbfae5606a71bf8bf2dd6488438b06", "url": "https://www.bonappetit.com/story/i-love-kimchi", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "What is Kimchi and How Do You Cook With It? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Fridge Isn’t Complete Without a Massive Jar of KimchiWith kimchi on hand I'm set up for kimchijeon, kimchi jjigae, or a great grilled cheese.By Amber LeeNovember 13, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailAt the heart of Korean cuisine is kimchi, a banchan (side dish) with spicy, sour, and slightly sweet flavors that lend a unique complexity to any meal. Perhaps Sohui Kim explained it best in her book Korean Home Cooking when she shared what her father used to say: “If you don’t have kimchi on the table, you’re not eating well.”What is kimchi and how is it made?The Korean Kimchi Cookbook by Kim Man-Jo, Lee O-Young, and Lee Kyou-Tae briefly delves into the history of kimchi, explaining that early records show kimchi has been around since the Goryeo Dynasty (918–1392 CE), though some scholars argue that kimchi's oldest variations date back much further. Harsh winters in Korea made food preservation essential, and one method consisted of salting vegetables, among other foods, and storing them underground in earthenware containers to ferment. While there are a few ways to make kimchi, the basic approach is somewhat consistent. Your vegetable of choice (Napa cabbage, Korean radish, and cucumber are common picks) is first pickled in brine, then drained and seasoned with a paste that consists largely of gochugaru, fish sauce, and water. Other common accompanying ingredients that go into the mix include garlic, ginger, Asian pear, scallions, and salted shrimp. The seasoned veggies are then packed into an airtight container before being stored in the fridge to ferment.During the fermentation stage, the lactic acid that was first produced during the initial pickling step proliferates. According to Hooni Kim, author of My Korea, the “lactic acid lowers the pH of the vegetable, giving the kimchi its distinct sour flavor.”While many definitions of kimchi include the words “fermented vegetables,” that’s not the full story. In The Korean Kimchi Cookbook, you’ll see that even squid and green persimmon can be kimchi’d. The main stars of these varieties aren't vegetables, though the recipes still call for radish, carrots, or cucumbers in the vegetable mix. Bottom line: Nearly anything can be kimchi, and vegetables will almost always play the supporting role if not the main. With all the room for variation, it’s no surprise then that there are well over 100 types of kimchi including the common Napa cabbage version.Recipes for kimchi can vary greatly depending on household, restaurant, and even where you are on the map. Even though raw oyster and octopus are common additions that promote bacteria growth during the fermentation process, for example, you’re less likely to find them in kimchi made outside of Korea.Dive right in!\nPhoto and Food Styling by Emma FishmanHow do you eat and cook with kimchi?Kimchi has nearly as many roles as it does varieties. When eaten as a side dish, it’s folded over meat or rice for a bite with a perfect medley of flavors. It’s often simmered in stews like kimchi jjigae and budae jjigae, where the kimchi’s biting tang and spice make for a hearty base. When braised, the reduced kimchi liquid simmers down to a concentrated flavor that’ll coat meat or fish in an irresistible sauce. Soups, stews, and braises are great for using up leftover kimchi that’s been sitting in the fridge for a month or two—that extra sour punch is welcome. When stir-fried, kimchi mellows out, becoming the perfect base for fried rice or grains or dumpling fillings. And since kimchi itself is already bursting with flavor, you only need to add flour and water and you’ve made yourself a delicious batter for kimchijeon.Chopped kimchi also works well as a garnish for hotdogs and burgers as a substitute for pickles and relish. I’ve even seen bottles of kimchi seasoning mix that can replace regular ol’ chile flakes on pizza, tacos, and spaghetti. But perhaps my favorite way to use kimchi is to incorporate it into cheese-heavy foods like grilled cheese sandwiches and mac and cheese. The sharp acidity cuts through the creamy cheese, giving my palate a much needed break from the heavy flavors.I always make sure to have enough kimchi on hand for a spontaneous kimchi jjigae dinner on rainy nights or to whip up a midday kimchi jeon snack in under 15 minutes. Now I don’t put out a side of kimchi with all of my meals, but on days that I do, my appetite turns ravenous.Say kimcheese:One-Pot Kimchi and Squash Mac and CheeseThis is a “necessity is the mother of invention” kind of recipe, born from isolation, scant ingredients, an oversupply of kimchi, and sheer hunger. Yet this unconventional one-pot approach also happens to be one of the simplest ways to prepare mac and cheese. View RecipeExplore Bon AppétitKoreanKimchiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-11", "author": ["Condé Nast", "Amber Lee"]}