{"id": "fadcdfe2c233dcee7e01e069e3de5d81", "url": "https://www.bonappetit.com/story/best-non-dairy-milks", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "The 6 Best Non-Dairy Milks in 2022, According to Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Tried All These Nondairy Milks. Here’s What Tastes BestIt’s me, your soy sommelier.By Karen YuanJanuary 15, 2022FacebookTwitterEmailPhoto by Isa Zapata, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I grew up suspicious of dairy milk. Like so many Chinese families, my parents and I almost always drank soy milk for breakfast. We weren’t lactose intolerant. We didn’t think soy milk had any magical benefits. We just knew it tasted best, especially when hot and freshly ground, like coffee. (Yes, at eight I was already a snob about nondairy milks. No, I didn’t grow up in Brooklyn!)Nowadays I’m more tolerant of the various types of milk out there. But I still drink nondairy milks just for the taste—and I’m obsessed with trying out all the nutty, beany blends and origins. After a lifetime of playing soy sommelier, I’ve homed in on the best nondairy milks—not based on alleged health properties or sustainability claims, but purely on taste. I can’t compare apples almonds and oranges oats, so I’ve named the best nondairy milk for lattes, cereal, smoothies, and all our other favorite ways to drink mylks, malks, and mülks.The Best Milk for LattesThis faintly tastes like…chocolate. I’m not kidding. Sproud’s Original Pea Milk does not taste like peas—instead, it has a vaguely bittersweet aftertaste that kind of reminds me of cacao. For some, it might be a little unusual to drink on its own, but I’ve discovered that a warm cup of coffee plus splashes of pea milk tastes almost like mocha, or at least like someone’s gently whispered the word “mocha” into the drink while brewing it. It’s nice.Sproud Dairy-Free Milk$5 at Target$30 at Amazon (6-pack)The Best Milk for SmoothiesMilk goes in smoothies and hemp seed goes in smoothies, so Good Mylk’s Hemp Mylk is a double whammy. It tastes strong and earthy and really rich when blended with cacao powder, bananas, dates, and honey. The brand actually provides the milk as a concentrate (in a bag, fun) that you stir into water, so it’s a DIY hemp milk. I’ve found this quasi-homemade version to taste a bit textured and gritty, but I’m the kind of person who likes orange juice crammed with pulp, so I enjoy it.Good Mylk Hemp Mylk$60 at Good Mylk$83 at Amazon (6-pack)The Best Milk for Drinking in a Whole Damn GlassWow, Minor Figures's Barista Oat. I could drink a bathtub of it. How does water and oats taste like this??? Its texture is so creamy, and it tastes like cow’s milk amped up with a hint of natural sweetness. I’ve maniacally added this to everything, including coffee, cereal, and tea. At one point I found myself drinking more coffee just so I could drink more of this milk and realized that was a very bad way to be. Then I realized I could just drink the milk all by itself, and my life has never been the same since.Minor Figures Oat Milk$32 at Amazon (6-pack)$32 at Amazon (2-pack)The Best Milk for Dunking CookiesWilla’s Creamy Oat Milk features whole grain oats, so it’s full of protein and fiber and light on sugar—one cup includes fewer than three grams. And because it uses the whole oat, it’s also zero waste! Drink this oat milk to feel like a good person. As for its taste, the mouthfeel is super smooth and creamy, and because it’s less sweet than other oat milks, I’ve discovered it’s perfect for dunking Oreos, chocolate chip cookies, and any funky sugary cookies left over from the holidays (okay, maybe not the last one if you want to live).Willa’s Organic Oat Milk$7 at Hive$10 at Amazon$40 at Willa's Kitchen (6-Pack)The Best Milk for OatmealsThis is rich and nutty and transforms a regular bowl of oatmeal into an enigmatic dish layered with flavor and secrets. I like adding almonds and all sorts of nuts to my oatmeal or muesli, so Elmhurst’s Unsweetened Milked Almonds brings me halfway there. I top my bowl with extra nuts and berries so I’m basically eating trail mix for breakfast. Like Willa’s, Elmhurst’s production process is also zero waste.Elmhurst Unsweetened Milked Almonds$6 at Hive$5 at Thrive Market$40 at Amazon (6-pack)The Best Milk for CerealsThis is the OG. Silk’s Organic Unsweetened Soy Milk is the nondairy milk I grew up drinking, and at this point, it’s a comfort bev. It doesn’t have fancy packaging or ingredients, but it’ll always be there for me. I don’t eat cereal that much, but when I do have a bowl of Kashi or Cinnamon Toast Crunch (more likely the latter tbh), this milk completes it. It tastes very mild and very creamy and very nostalgic. When I just want a taste of home, this is the one.Silk Unsweetened Organic Soymilk$16 at Amazon (6-pack)Explore Bon AppétitCultureLifestyleShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-15", "author": ["Condé Nast", "Karen Yuan"]}