{"id": "fae0651a6509a0e3235bf55ed1c9e45d", "url": "https://www.bonappetit.com/story/lovelys-at-the-lodge-oakland", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "Lovely’s at The Lodge Turns Out the Best Burger in Oakland | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Dive Bar Is Turning Out the Best Burger in OaklandMikey Yoon, the one-man show behind Lovely’s at The Lodge, knows to get it just right.By Julia KramerJune 17, 2019FacebookTwitterEmailPhoto by Aubrie PickFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.On my most recent visit to the Bay Area, I hit all the places people were telling me to hit: the new small-plates wine bar, the handmade soba spot, the tasting menu seafood restaurant, the cocktail-bar-turned-food-destination. And when I got on the plane for the return flight home, there was no doubt in my mind where I’d eaten the most delicious food: at the Lodge, a neighborhood tavern in Oakland that reminds me of the places I’d hang out at in Chicago—but that are increasingly difficult to find in New York and S.F. A place with non-ironic antler heads, a popcorn machine, and a tiny kitchen that plays host to pop-ups, such as, on the night I visited, one called Lovely’s, run by the chef Mikey Yoon. Here I ate the most flawless diner-style burger I’ve had in recent memory, and that’s coming from someone who has eaten many diner-style burgers in her lifetime. I had to know what Yoon was doing back there in that closet-size kitchen to make an even more special sauce, so I jumped on the phone with him to get the details.The genius behind the burgers, chef Mikey Yoon.\nPhoto by Brian MolyneauxThe Beef“I wanted to tackle a classic five- or six-dollar burger. I grind the meat every day. Because I’m doing a thinner-style patty, I need more fat, and I get that from using a ratio of about 70-to-30 chuck roll to brisket.”The Technique“This is a very Midwest-style griddle burger, so I smash the patty, making sure I get a good crust. From there I salt and flip it, and that’s when the onions go on. I call them glitter magic onions because I glitter the beef with my onions.”The Cheese“It’s just cheap American cheese.”The Bun“I’m from Maryland, so Martin’s are the buns I grew up with. Back then you would only find them in certain places on the East Coast! I toast them in beef fat on the plancha.”The Toppings“I get Early Girl tomatoes from the farmers’ market when they’re in season, but the lettuce is always shredded iceberg, which is important for that crunch. Then I add two County Fair pickle slices: They do the job well and have a nice tang.”The Sauce“I make homemade mayo that’s kind of a riff on Edna Lewis’ recipe, which is super Southern style. I want the richness of the Hellmann’s or Duke’s that I loved as a kid. I combine that with ketchup, mustard, and other seasonings for the burger sauce.”Explore Bon AppétitOaklandBurgersDish DecodedRead MorecultureI Instagram-Stalked This Croissant, So I Found Out How It’s MadeBy Rachel KartenrestaurantsTurkey Tails Are The Most Delicious Thing You Didn’t Even Know You Could EatBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-17", "author": ["Condé Nast", "Julia Kramer"]}