{"id": "fae0c097a557ee365d7455fd92595092", "url": "https://www.bonappetit.com/story/myro-natural-deodorant", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Myro Deodorant Keeps You Smelling Good No Matter How Much You Sweat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMyro Natural Deodorant Has a 16K Wait List, But Does It Work?We sent a natural-deodorant skeptic to find out.By Deanna PaiDecember 10, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI’m the perfect sucker for natural deodorant, as I’m crunchy-curious. You won’t find me tossing away my synthetic acids, but I can get down with clean moisturizers and organic shampoos—so long as they work. What’s held me up in the past with natural deodorants, though, is that my sweat glands are perpetually on turbo. I walk around looking like the Coast Guard just pulled me out of the East River, and even in the winter, I get damp if my winter coat is too damn cozy. Forget sweater weather. It’s sweat weather for me, and it’s a year-round phenomenon.The thing is, natural deodorants don’t really impress me. They’re old news compared to clay masks that change color and Biologique Recherche P50 dupes. I would need a natural deodorant to be able to mop my floors for me to give it a second look, or for Beyoncé to give it a whole-hearted endorsement for free. So when Myro, the newest natural deodorant on the market, hit the scene with a 16,000-person waitlist, I was intrigued. Like...why? You know y’all can get natural deodorants at upstate New York drugstores now, right?Myro deodorant comes in colorful cases like blush, moss, and royal blue.\nPhoto by Chelsie CraigAnd natural deodorants, as good and wholesome as they may be, are not antiperspirants. That was one of the first things Greg Laptevsky, the founder of Myro, told me. While a deodorant nixes odor, antiperspirants reduce sweating. And the only antiperspirant approved by the FDA is aluminum, he explains. (The rise of natural deodorants stemmed from the claim, since debunked by the American Cancer Society, that aluminum is linked to breast cancer.) Instead, barley powder in the deodorant absorbs moisture.But I wasn’t trying this just for its sweat-reducing power. I was doing it because it’s also cute. Everything about it is cute, from the sculptural packaging to the soft colors—including millennial pink, which is what I use because I am drops voice to a whisper a millennial—to the five scents, which are floral and bright and so appealing that I couldn’t pick a favorite. Plus, they’re refillable—good for the environment and my budget—and small enough to keep in your bag for touch-ups. The brand’s hashtag, #bettervibesdaily, has 182 tags and counting. That doesn’t sound all that impressive until you remember that it’s a deodorant. People are Instagramming their deodorant.Anyway, I popped a pod in the Chill Wave scent (a combination of cucumber, jasmine, and spearmint) into my pink case and swiped it on. My first thought was that it didn’t sting my underarms the way other natural deodorants I’ve tried have. The creamy texture also doesn’t transfer onto my clothing, which was an unexpected bonus.On my hour-long walk, I started to sweat with abandon. I couldn’t really fault Myro for this one: They’re not selling themselves as an antiperspirant, anyway, and there’s likely not enough barley powder in all the world to handle my sweat glands. Once I take my coat off and air myself out, I do a sniff test, to the delight of everyone in the coffee shop. I no longer smell quite like Chill Wave, but it’s still floral and warm—and not anywhere like the funk I’d be experiencing without any deodorant at all.Hot yoga takes it down within minutes, though I saw that coming. It’s wildly distracting to feel sweat streaming down my arms during pyramid pose. But it holds up surprisingly well when I go for a run in chilly weather. I don’t even sweat too much, thanks to the windchill, and when I get back, I smell mostly the fabric softener from my t-shirt and faint floral notes.I’ve been using it for a few weeks now, and while I miss antiperspirant for the sake of my t-shirts, I’m impressed by how well Myro manages to hold back my signature stank. Despite the sweat, I never actually smell bad. And while I won’t pose with it on my Instagram, I’ll keep using it—and sub in the antiperspirant for hot yoga. It’s all about balance.Explore Bon AppétitHealthyishNatural BeautyTrendsRead MoreLifestyleThis Color-Changing Vitamin C Mask Is More Than Just Instagram BaitBy Deanna PaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-10", "author": ["Condé Nast", "Deanna Pai"]}