{"id": "faf7eb41d491cf7105e32122c84084b0", "url": "https://www.bonappetit.com/story/no-substitute-for-marmite", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "There Is No Substitute For Marmite | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThere Is No Substitute for MarmiteI can make do without a lot of things, but not without this all-drama, highly polarizing spread.By Lauren JosephApril 15, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.It was September when I first heard the news. I had stopped into Hiller & Moon, the Brooklyn cheese shop and specialty grocery that stocks all the British snacks I miss from the part of my childhood spent in London—minty Aero Bars, crunchy Twiglets, and creamy Cadburys. I was there to pick up another jar of salty Marmite, but to my dismay the shelves had been ransacked. That’s when I learned there was a worldwide shortage of the stuff. See, Marmite, the love-it-or-hate-it toast-topping spread, is a fortuitous by-product of beer production, made from sticky spent brewer’s yeast. When breweries slowed their work earlier this year due to the pandemic, so too did the steady stream of Marmite grind to a halt.I can make peace with wild rice when the bodega is out of my beloved basmati. I can accept that I’m lactose-intolerant, and the oat milk is staying. I can chalk up the number of cauliflower steaks I’ve cooked in place of meat as a sensible substitution. But Marmite is singular in its powerful tang; it just can’t be replaced.Made of yeast, sugar, salt, herbs, spices, and vitamins like B12, it rings all my umami alarm bells with just one small swipe. It’s naturally high in glutamate, which is essentially MSG, that other much misunderstood but truly beautiful salty-savory ingredient. It’s got the texture of molasses and is best wrangled into a spreadable consistency by mashing it into a dose of butter on the side of your plate until it reaches a tawny hue. It’s then ready to be smeared atop a piece of toast. The Sri Lankan side of my family (Sri Lanka is the biggest importer of Marmite worldwide, a remnant of colonialism) adds a thin shellac of orange marmalade, which gives the whole thing a zingy, sweet-bitter slickness.But to only use it as spread would be to misunderstand its whole range; it’s got so much more to offer! I like to stir a teaspoon into a meaty stew or braise to up the dimension of flavors (just adjust the salt accordingly). Combine a smidge with butter and mix it into warm noodles topped with a handful of sliced scallions. Slather chicken with it before roasting or whisk it into olive oil and drizzle over hearty cruciferous vegetables. What tastes straight salty out of the jar actually adds a complex intensity—think that mysterious flavor bump that anchovies or miso bring, or the long-simmered taste of anything that cooks away in your Dutch oven all day. Whatever you do, a little goes a long way.And thank goodness that’s true because I’m still rationing my jar since that day in September, just in case.Marmite Spread$7 at Amazon$6 at Cost Plus World MarketExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-15", "author": ["Condé Nast", "Lauren Joseph"]}