{"id": "faf7309a629c4386446bfc766c4e8b5f", "url": "https://www.bonappetit.com/story/grilled-blt-smitten-kitchen", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "Deb Perelman Knows When It Comes to BLTs, There Are No Substitutions | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen It Comes to BLTs, There Are No SubstitutionsDeb Perelman is all about feeding her kids the healthy stuff. But she’s willing to make an exception for this perfect sandwich.By Deb PerelmanAugust 16, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailWelcome back to Picky Eaters’ Club, where Smitten Kitchen’s Deb Perelman reveals what she actually cooks for her two kids.A few years ago, on a summer evening when some friends and their kids were over for dinner, I decided to make “healthy” s’mores. In an effort to avoid overly processed stuff, I bought whole wheat digestive biscuits, organic dark chocolate, and natural marshmallows. The result was, unsurprisingly, terrible. Nobody even finished them. When feeding kids, there’s a feeling of obligation to make what we believe to be wholesome decisions: Replace butter with olive oil; pasta with whole grains; fatty meats with leaner alternatives. But some foods shouldn’t be messed with. Wouldn’t it be tragic if my kids grew up thinking s’mores tasted kind of average?Thick-cut tomatoes to match that thick-cut bacon.\nPhoto by Alex Lau, Food Styling by Susie TheodorouSo when I recently decided to make us BLTs, I vowed not to mess with them. I would use white bread and full-fat mayonnaise. I wouldn’t use kale in place of iceberg. Definitely no turkey bacon. A perfect BLT is a pure and delicious thing that I wanted my kids to experience properly, especially since we only have them a couple of times a year.Grilling the bacon helps stretch the summery vibes into fall, and as a bonus you’ll also save your kitchen from a greasy mess. Thick-cut strips get evenly crisped with a light char at the edges. (Keep the lid closed and vented and the heat relatively low to control flare-ups.) While you’ve got the fire going, grill some bread. Thickly slice a couple of ripe tomatoes. Pile on crisp lettuce and a generous swipe of mayo (we adults love a little Sriracha mixed in). Create what has got to be the highest calling of a summer BLT and serve it with unwavering confidence that not a speck will go uneaten.Get the recipe:Grilled Bacon BLTsHere’s one classic, perfectly executed BLT. Plus, grilling the bacon will save your kitchen from a greasy mess.View RecipeExplore Bon AppétitBLTTomatoBaconSandwichPicky Eaters’ ClubRead MorecookingFollow These Rules to Make the Best BLTsBy Adam RapoportcookingThe Best Bread Knife Costs $22 But Is Worth Its Weight In Gold. GOLD!By Alex BeggscookingHow to Ripen Avocados When They're Too HardBy Alex Delany and Antara SinhaBLT Wraps with Horseradish MayonnaiseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-16", "author": ["Condé Nast", "Deb Perelman", "Antara Sinha"]}