{"id": "faf73bfb53d58ba90c140bcf959d055c", "url": "https://www.bonappetit.com/recipe/cherry-and-dark-chocolate-crostata", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Cherry and Dark Chocolate Crostata Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueCherry and Dark Chocolate CrostataBy Stefano SecchiMarch 15, 2022EmailPinterestPrintPhotograph by Paola + Murray, food styling by Rebecca Jurkevich, prop styling by Marina Bevilacqua EmailPinterestPrintEmailPinterestPrintYou may not be able to see the sprinkling of chopped chocolate hiding beneath the cherry filling, but you’ll taste the richness it brings to every bite. This tart was inspired by a tart chef Stefano Secchi of New York City’s Rezdôra ate while working in Piedmont, Italy, a region known for the many varieties of cherries available in the spring and summer. For a distinctly Italian variation, use half a packet of Paneangeli Lievito Pane Degli Angeli (a flavored leavening agent you can buy online) in place of the baking powder and vanilla.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron9-Inch Tart Pan$13 At AmazonFood Processor$49 At AmazonScale$25 At AmazonFrench Rolling Pin$17 At AmazonSilpat Roul' Pat$88 At AmazonPastry Brush$9 At AmazonMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonIngredients8 servingsDough2cups (250 g) Italian 00 flour or all-purpose flour½cup (100 g) granulated sugar1tsp. finely grated lemon zest1tsp. baking powder½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt11Tbsp. chilled unsalted butter, cut into small pieces1large egg1large egg yolk½tsp. vanilla extractFilling and assembly3⅓cups fresh (or frozen) sweet cherries (about 20 oz.), pitted3Tbsp. fresh lemon juice2tsp. cornstarchBig pinch of kosher salt⅓cup (67 g) sugar, plus more for sprinkling2oz. dark chocolate (at least 70% cacao), coarsely chopped1large egg, beaten to blendSpecial equipmentA 9\"- or 10\"-diameter tart pan with removable bottomPreparationDoughStep 1Pulse flour, sugar, lemon zest, baking powder, and salt in a food processor to combine. Add butter and pulse until mixture is the consistency of wet sand. Add egg, egg yolk, and vanilla and pulse again to combine. The mixture should still look crumbly but hold together when squeezed in your hand. Turn out onto a surface and smash and pat into a flat disk. Wrap in plastic and chill at least 1 hour.Do ahead: Dough can be made 2 days ahead. Keep chilled.Filling and assemblyStep 2Cook cherries, lemon juice, cornstarch, salt, and ⅓ cup (67 g) sugar in a medium saucepan over medium heat, stirring occasionally, until cherries have burst but still have some body and juices have thickened, 6–8 minutes. Let cool at least 15 minutes.Step 3Place a rack in middle of oven; preheat to 350°. Roll out dough to about ¼\" thick. Transfer to tart pan; lift up dough, allowing it to slump into corners, then press lightly into pan. Trim excess so dough is flush with rim. Set extra dough aside.Step 4Scatter chocolate across crust, then top with filling. Reroll reserved dough; cut into strips or cut out into other shapes. Use strips to make a lattice top or decorate with shapes as desired. Brush dough with egg and sprinkle with sugar. Bake until golden brown, 20–25 minutes. Let cool at least 15 minutes to let filling set.Do ahead: Filling can be made 1 day ahead; cover and chill. Crostata can be baked 4 days ahead; let cool completely. Store covered at room temperature.How would you rate Cherry and Dark Chocolate Crostata?Leave a ReviewTell us what you thinkExplore Bon AppétitDessertFruit DessertBakingNut-FreeTartCherryStone FruitFruitChocolateOther IngredientsItalianEuropeanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Stefano Secchi"]}