{"id": "faf925eab921e2e809b8bc779582d938", "url": "https://www.bonappetit.com/story/the-freezer-edit", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "The Freezer Edit | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Freezer EditI decided to take a peek in the old icebox—and ended up eating out of the freezer for a week straight.By Christina ChaeyApril 4, 2020FacebookTwitterEmailPhoto by Peden & MunkFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Some people do closet edits. Others, like editor-at-large Amiel Stanek, do “freezer edits,” and ever since he told me about this annual ritual, I do them, too. Last weekend, in the interest of cutting down on my grocery store trips as much as possible, I decided to take a peek in the old icebox—and ended up eating out of the freezer for a week straight.Here’s how it worked: I took all the items out of my (very chaotic, shelf-less!!!!) freezer and placed them on my kitchen counter to assess age, value, and potential for future deliciousness. I tossed anything that couldn’t be salvaged (goodbye, half-empty bag of very freezer-burned shrimp, we hardly knew ye); thawed a couple of surprise gems (more on those below); and, most importantly, made a list of all the properly labeled items left in the freezer. That note now lives on my fridge door. I also took a photo of it—an extra-pro Amiel tip—for grocery store reference later.Here, a list of my favorite freezer finds of the week:A raw chicken backOkay, technically this was my roommate Emma’s chicken back. I assume it was leftover from a bird she had spatchcocked to roast for dinner months ago. She’d stashed the back in the freezer, though I’d call her a “someday stock”-maker. So I gently asked if she had big plans for the chicken back, and when she couldn’t even recall freezing it in the first place, I made a stock. (I didn’t even thaw it first and, guess what, IT WAS FINE.) I used the resulting warm, soothing stock to make, among other things, the highlight of my entire week: a personal-sized version of BA’s Best Chicken and Dumplings topped with crispy chicken skin crumbles, which I made in my very favorite tiny pot that I wrote about this week for the Healthyish Guide to Being Alone.A container of marinated galbiI brought these Korean-style short ribs back with me from the last time I had dinner at my parents’ house. I thawed these in the refrigerator overnight, then broiled them for dinner with a pot of rice and a simple scallion salad bulked up with lots of thinly sliced raw bok choy leaves. If you’re feeling inspired to give a surprise meat gift to future you, a batch of this Basic Bulgogi would freeze very well, too.A package of storebought dumpling wrappersThese keep for months (the date on my homemade date read 9/2, as proof!) and just need a quick thaw in the fridge before you can get folding. Then, once you’ve made a batch of dumplings, you can freeze them in a single layer on a baking sheet until they’re solid, then slip them into a bag for future dinners and emergency snacks. I’ve started playing a game called “What’s the weirdest acceptable dumpling I can make with ingredients I already have?” This most recent batch had tofu, shiitake mushrooms, chopped sauerkraut and kimchi, carrots, green garlic (spring!), and ginger. Were they the best dumplings I’ve ever made? No. Did I eat all of them and now find myself in a slight panic that my dumpling stash is gone? Send help—or just more wrappers.I’ve since filled the void in my freezer with a new crop of items: cooked brown rice (for future fried rice), lots of good cod, halibut, and shrimp from Pierless Fish, and a few more quarts of chicken stock (yes, I am making and hoarding chicken stock like it’s the end of times right now). The next time I go to the store, I might try a trick from my friend Anna Hezel, who’s been quickly blanching torn hardy greens like kale in salted boiling water, then squeezing out the excess liquid and storing the (now teeny-tiny) greens in reusable plastic bags in the freezer. It prolongs the life of fresh greens (though no shade to frozen broccoli, ilu) while simultaneously freeing up precious room in the fridge. I’ll let you know how that goes—lord knows I need that fridge space. But that’s a story for another newsletter.Stay home and stay cooking,Christina ChaeyAssociate editorExplore Bon AppétitHealthyishWhat's Chaey Cooking?CoronavirusessayRead MoreLifestyleThese Are a Few of My Favorite FatsBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-04", "author": ["Condé Nast", "Christina Chaey"]}