{"id": "fb08238bf1a9a620dff4dd1c259d1f73", "url": "https://www.bonappetit.com/story/staten-island-deninos-ralphs", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "It’s Not a Summer Night Out in Staten Island Without a Denino’s and Ralph’s Doubleheader | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIt’s Not a Summer Night Out in Staten Island Without a Denino’s and Ralph’s DoubleheaderA pair of restaurant soul mates if there ever was one.By Myles TanzerApril 16, 2019FacebookTwitterEmailPhoto Courtesy of Ralph'sFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.It’s not really eating in Staten Island unless you’re full as hell.I spent most of my life living in the forgotten borough, and among the better things it gave me was an intense appreciation of Italian-American food. Lots and lots of it. So much of it, in fact, that the thing I most appreciate is stuffing my face at Denino’s Pizzeria & Tavern and then stuffing it a little more at the original Ralph’s Famous Italian Ices. The two establishments in the Port Richmond area are neighbors, best friends, and restaurant soul mates.Denino’s, open in the same spot in Staten Island since 1937.\nPhoto by Jaime JoshiRalph Silvestro opened his namesake dessert joint in 1928, and it’s remained in the same spot ever since. Denino’s opened right across the street in the ’30s and started slinging pies a couple of decades later once Carlo (last name Denino, if that wasn’t obvious) took over the tavern. Both have opened other locations. (There are more than 60 Ralph’s now in the Tri-state area.) Both have expanded their menus, adding contemporary flavors and combinations—like clam pizza and the M.O.R., my favorite pie, with tiny meatballs, fresh onions, and creamy ricotta—to round out the classic mozzarella sticks, fried calamari, and eggplant Parm. At Ralph’s, I can’t leave without one scoop of rainbow cookie, a neon-yellow crème ice filled with chunks of the almondy tricolor pastries, one of the 150-plus newer flavors they’ve developed since the original lemon ice. Both are still family businesses.The current management, Ralph’s grandson Larry Silvestro and Carlo’s stepson Michael Burke, have known each other their whole lives. “We’ve always looked out for each other,” Larry says. “We go way back.” When the Italian ices aren’t in season and Ralph’s is closed, Michael will call if anything looks fishy. (A few winters ago, a tip about a burst pipe saved Larry lots of trouble.) On super busy nights, Larry lets Denino’s use his parking lot.So sure, you could go to Denino’s and just get the margherita pizza, or go to Ralph’s just for vanilla chip. But why would you go to one when you could have both?Myles Tanzer is a writer living in Brooklyn.Explore Bon AppétitRestaurantsItalian AmericanRed SauceNew YorkRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Myles Tanzer"]}