{"id": "fb0a0746d79f8d51c328ebb09f8a7cd3", "url": "https://www.bonappetit.com/recipe/creamed-corn-and-grains", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "Coconut-Creamed Corn and Grains Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCoconut-Creamed Corn and GrainsBy Chris MoroccoAugust 1, 20194.9(40)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Maggie RuggieroEmailPinterestPrintEmailPinterestPrintTurmeric, chiles, and chewy-nutty cooked grains balance the sweetness of fresh corn in this loose vegan riff on creamed corn. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.Ingredients2 servings2ears of corn, husked1Tbsp. extra-virgin olive oil½serrano chile or jalapeño, thinly sliced1½\" piece fresh ginger, peeled, sliced into matchsticks2garlic cloves, thinly sliced1scallion, thinly sliced, plus more for serving¼tsp. ground turmeric½cup cooked grains, such as freekeh, farro, or quinoa½cup unsweetened coconut milk, plus more for servingKosher salt2Tbsp. store-bought crispy onions, such as Lars Own, French’s, or MaesriLime wedges (for serving)PreparationStep 1Cut kernels from corn; set aside.Step 2Heat oil in a large nonstick skillet over medium until shimmering. Cook chile, ginger, garlic, and 1 sliced scallion, tossing, until softened and fragrant, 1–2 minutes. Add turmeric and cook, stirring frequently, just until darkened and fragrant, about 30 seconds. Add reserved corn and increase heat to medium-high. Cook, tossing occasionally, until corn is beginning to lightly brown, about 3 minutes. Add grains and cook, tossing often, until heated through and beginning to crisp around the edges, about 2 minutes. Add ½ cup coconut milk; season with salt. Bring to a simmer and cook, adding 1–2 Tbsp. water if needed to loosen, until flavors have melded, about 3 minutes.Step 3Transfer corn mixture to a plate. Drizzle with more coconut milk, then top with crispy onions and sliced scallions. Serve with lime wedges alongside for squeezing over.How would you rate Coconut-Creamed Corn and Grains?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangleDamn. I said G damn. Making this on regular rotation this summer. MimiBelleville NJ6/5/2021Absolutely amazing. Corn is out of season right now so I took a cue from another reviewer and used frozen corn; I can't wait until it's back so I can try this again with fresh off the cob! I also took everyone's advice and doubled the recipe using a mix of quinoa and chickpeas because that's what I had in my pantry. I'll definitely be making this again. DownOnDoleStreetHonolulu, HI3/8/2021Absolutely delicious.  A great use of some sweet Olathe corn.  No changes made to the recipe, the French's Onions make the dish.AnonymousDenver, CO10/15/2020Loved the flavors.  Made it with farro.  Held up very well after an overnight in the fridge and a quick microwaving.  The flavors were even more melded.  I would squeeze lime over it before serving, AND serve with lime wedges. The lime makes it.  I made my own crispy shallots since I couldn't get the premade ones.  Very simple and delicious.  only thought is that I might do this preparation with JUST corn.  The texture of in-season sweet corn is so great, and combining it with the farro made it feel like some of my corn was actually lame chewy out-of-season corn.  Or just do it with farro!  Both textures are great, I just don't love them together.  AnonymousNYC8/17/2020I rarely give 5-star reviews, but this is definitely 5-star!  I had a little confusion based on the printed recipe in the actual magazine - the ingredients said \"1 cup, plus more\" for the coconut milk, but the directions said to add 1/2 cup in the pan.  As soon as I added 1/2 cup, it didn't look creamy enough, so I went ahead and added the full cup.  Glad I did, otherwise it wouldn't have been as noticeable.  I used farro for the grain.  Served it as a side to a simple Hatch marinated rotisserie chicken and it totally stole the show.  (As a side, there was enough for 2 meals for 3 people.)  My husband suggested more farro next time, as it kind of got lost.  Reheated wonderfully the next day - just keep some of the coconut milk on hand if needed.  DO NOT skip the toppings!  On day 2, my husband forgot about those when reheating it and I ate half of mine before remembering - it was perfectly good without, but that acid from the lime is really needed to brighten the whole thing and I missed the little crunch from the fried onions.  Definitely keeping this recipe handy - didn't take long to throw together!txhuskerTexas8/12/2020This is amazing! I used farro as the grain and cannot even imagine using quinoa as it would ruin the texture of the dish. The french fried onions are sooooo unnecessary and much too salty. They really diminished the quality of the overall dish. Please use fresh corn. The crunch is such an integral part of the experience. I served this along side NYT's Ginger Lime Chicken for a home run. And don't forget to serve with lime wedges. AnonymousHilton Head8/11/2020Wow. This was so good. Even the carnivore boyfriend went for seconds, and said it was filling. I did purchase the crispy onions specifically to make this, and I would say it was worth it. I used Farro and made a bit more than the 1/2 cup called for, after reading others reviews. I'm already thinking about making this again.  ktanmoSonoma County, California7/28/2020Really good, followed recipe exactly except subbed brown jasmine rice for the grain. Comfort food with a twist, yummy AnonymousMammoth Lakes, CA7/28/2020  I only had 1/2 cup quinoa, so I used that and sauteed some small dice potatoes till crispy and added them to the mix.    It worked well.    I did find the matchstick ginger too overpowering and would grate the ginger instead of slicing into matchsticks as the recipe called for.   yankeefan2Montclair,nj 7/24/2020Great lunch recipe (or a side!) - I'd say this makes 2 fairly modest portions, I added at least twice as much grains (hard to boil only 1/2 cup grains it turns out) and more coconut milk. Also - a fried egg on top! I would probably throw some coriander or mint on there as well next time AnonymousLondon, UK6/19/2020Delicious served hot but honestly, makes a KILLER cold salad! In the future I'd most likely eat it cold and serve it at a bbq! AnonymousNew York, NY5/7/2020This is wonderful!  put scallops on top.  and added habenero to mine.  total comfort food!Jane AllenDC area4/5/2020This has become my go-to comfort food-- the corn, turmeric, and ginger are amazing! I sub in one cup of frozen corn kernels for fresh, and stopped adding scallions and lime juice after the first time (no particular need, I think). The crispy onions are ESSENTIAL though, it really needs that hit of salt. Amazing recipe!rhjacobs3/21/2020Made this with quinoa and frozen corn and didn’t have crispy onions. Left the seeds In the jalapeño for extra spice. Lime juice on top is wonderful! Very yummy as side dish or meal. AnonymousSan Diego12/31/2019I bulked this recipe into a stew by adding cannellini beans, thinly sliced lactino kale, and upping the coconut milk. I love the flavor of fresh ginger and coconut with the corn. I will definitely make this again, both as a side/salad and as the stew version I did today. Would also be great with grilled white fish - as a side - or braised white fish - as a stew. arizkiDurham, NC12/29/2019Explore Bon AppétitAmericanCornVegetableCoconut MilkOther IngredientsFreekehRice & GrainsFarroQuinoaSummerQuickEasyWeeknight MealsSideMainDairy-FreeVeganVegetarianHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-01", "author": ["Condé Nast", "Chris Morocco"]}