{"id": "fb13d26ab7ee2471847a90b91cc1b40c", "url": "https://www.bonappetit.com/story/how-to-bring-dairy-to-room-temp-quickly", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "How to Bring Butter, Eggs & Dairy to Room Temperature | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Impatient Baker's Guide To Bringing Dairy To Room TempBecause sometimes you just can't wait to bake.By Michelle LopezOctober 28, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.A lot of my baking happens in the evening (hence the premise of my book Weeknight Baking), so I usually bring my butter and eggs to room temperature by removing them from the fridge right before I head off to work. I keep these ingredients in a cool, dark corner of the kitchen, far from any sunlight or residual heat from appliances. By the time I get home from my eight-hour workday, the ingredients are at room temperature.But maybe it skeeves you out to leave eggs on the counter while you're at work. Or maybe you keep your heat high (say, 80° F), in which case those eggs might spoil by the time you get home. Or maybe you just forgot. That doesn't mean you should bake with cold eggs—or cold butter, cream, or yogurt—when a recipe calls for them to be room temperature.If you're ready to bake and your ingredients aren't, follow these tips for bringing them to room temp quickly:ButterIt can take anywhere from 30 minutes to an hour for refrigerated butter to soften to room temperature. Speed things up by cutting the butter into 1-inch cubes: Take a stick of butter and halve it lengthwise. Flip the butter on its side and halve it lengthwise again. At this point, you should have four long columns of butter. Hold the columns together and slice crosswise into 1-inch pieces. Each piece will be a rough cube.Place the butter cubes in a microwave-safe bowl and microwave at 20% power in 10-second intervals until the butter cubes have softened (it really shouldn’t take more than 20 seconds or so). If you don’t have a microwave, you can place the butter cubes in a double boiler over medium-low heat for around 1 minute. Just be careful to keep an eye on the butter, because once it gets going, it melts fast!Perfectly softened butter should still be slightly cool to the touch. The butter cubes should hold their shape when lightly poked. If you want to be technical about it, use a digital thermometer—a thermometer inserted into one of the butter cubes should read between 65° and 70°F, which is generally the range people mean when they say “room temperature” for ingredients.EggsTo bring whole eggs to room temperature quickly, fill a small or medium bowl with warm water. You want the temperature to feel like a warm bath (you don’t want to end up accidentally cooking the eggs). Carefully place the eggs in the water and let them sit for 5 to 10 minutes. If you do this at the beginning of prepping a recipe, the eggs will be at room temperature right as you finish measuring out the rest of your ingredients.If you’re working with a recipe that calls for the eggs to be separated into whites and yolks, it’s easier to separate them while the eggs are still cold—at room temperature, yolks break easily. Once the eggs are separated, place the whites and yolks in separate thick ramekins or other sturdy ceramic vessels. Set the ramekins in a cake pan and pour hot water (not warm water this time—the heat needs to penetrate the ramekins) into the pan until the water reaches halfway up the sides of the ramekins. Let sit for 5 to 10 minutes, stirring occasionally.Buttermilk, cream, and milkButtermilk, cream, and milk are easy to bring to room temperature quickly: Simply pour the amount needed for the recipe into a microwave-safe container and heat at 20% power in 10-second intervals until the liquid has warmed to room temperature. Just be careful not to leave in the microwave unattended for long periods—cream has a tendency to foam and buttermilk has a tendency to separate (though giving it a good whisking before using it solves this easily).If you don’t have a microwave, heat the amount needed in a small saucepan over medium-low heat for a minute or so, swirling the pan every 10 seconds.Crème fraîche, sour cream, and yogurtCultured dairy, like crème fraîche, sour cream, and yogurt, is a bit trickier to bring to room temperature quickly—it takes on a funky odor when warmed in the microwave. My solution is low tech. I scoop out the amount needed for the recipe and place it in a heatproof bowl. I then place the heatproof bowl on top of my oven, close to where it vents heat (most ovens have a “hot spot” on the surface of its range where this occurs). As the oven preheats, it warms the dairy to room temperature.If you have a fancy oven that doesn’t emit heat this way, you can always warm up the dairy in a double boiler. Cook over medium-low heat for 1 minute, whisking continuously to prevent it from scorching.Once you know how to bring your dairy to room temp quickly, you can bake in less time—and, therefore, you can make even more. Win, win.Adapted from the book Weeknight Baking by Michelle Lopez. Copyright © 2019 by Michelle Lopez. Reprinted by permission of Simon & Schuster, Inc. All Rights Reserved.Explore Bon AppétitBakeDairyBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-28", "author": ["Condé Nast", "Michelle Lopez"]}