{"id": "fb1dbb9efdd2acfaf4d7ddf95f9752b1", "url": "https://www.bonappetit.com/story/alison-roman-chocolate-chunk-shortbread-cookies", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "Alison Roman's Chocolate Chunk Shortbread Cookies Recipe Is an Instagram Sensation  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEVERYONE Is Making These Chocolate Chunk Shortbread CookiesSo you probably should, too.By Alex BeggsJanuary 4, 2018FacebookTwitterEmailPhoto by Michael Graydon and Nikole HerriottFacebookTwitterEmailSometimes a chocolate chip cookie has a way of getting to people, stirring up strong emotions, and rallying them for a cause. The cause of eating more cookies. When Alison Roman's Dining In cookbook came out in October, she told Grub Street about these cookies—buttery, shortbread-like, rolled in crunchy Demerara sugar:  “In the book, I only have one cookie recipe,\" she said, \"and it’s for these salted butter-chocolate-chunk shortbreads that are, in my opinion, way better than a chocolate chip cookie. So I ate a bunch of cookie dough before 10 a.m., because you need to know if it’s good before you bake.”A cookie craze was in motion.The official recipe name is: Salted Butter and Chocolate Chunk Shortbread or Why Would I Make Another Chocolate Chip Cookie Ever Again?Roman writes in Dining In that traditional chocolate chip cookies are “deeply flawed”—a hot take!—and that her recipe aims to solve all the things that bothered her about them. The salted butter has a “deeper saltiness than using just salt” and the shortbread dough has barely enough flour to hold everything together, while chocolate cut into chunks prevents “chip congregation.”Instagram contentThis content can also be viewed on the site it originates from.Cookie season came in December, and Roman started noticing that more and more people were making the cookies. By now,\nshe’s been tagged in over 200 photos, easy, she told me. Eater and Refinery29 posted the recipe, and just last week, Smitten Kitchen's Deb Perelman made them and hinted that they might just be Cookie of the Year.Instagram contentThis content can also be viewed on the site it originates from.Perelman told me why she thinks the cookie is a sensation: “We’ve had years of sea salt flecked everything, many things that we wish weren’t. It’s an accent, an apology. But salt lifts flavor, and salted butter tastes more aged (cured) and developed. This cookie has gravitas.” It’s easy, with few ingredients, and the compact shape makes it pack up and travel well (to parties), she added. Oh, and: “You can really taste the butter first here. What’s the first thing you taste in a traditional chocolate chip cookie? Brown sugary softness?”Eater senior editor Daniela Galarza made the cookies and told me: ”I think this rejection of the overblown, very complicated cookie recipe that needs aging and a million ingredients is interesting. Roman honed in on a moment in which going back to basics: butter, sugar, salt, chocolate—is a welcome respite.”Now Roman wakes up to 10-20 notifications of tags on Instagram of people cooking from the book, about half of which are the cookies. She screenshots their stories and posts them on her own so that following her seems like an endless stream of cookie madness, 🍪 😍 emojis, and !!! The coin shape, the sugar crust, even if some people's are...lumpier than others...you can immediately recognize the cookies.Instagram contentThis content can also be viewed on the site it originates from.”These are now in my top 10 best cookies i've ever made” a commenter wrote on Instagram.“NOT VEGAN but oh so good” wrote, presumably, a part-time vegan.“If you buy @alisonroman's #diningincookbook and don’t make salted butter chocolate chunk shortbread, do you even Instagram?” — that one sort of confused me.“wouldn’t be December 2017 home baking without @alisonroman's instantly classic shortbread” wrote someone who lives by a cookie calendar.“cookies > Clif bars” wrote a fan skiing in Deer Valley, who Instagrammed the cookie in front of a snowy mountain scene with her glittery manicure.Instagram contentThis content can also be viewed on the site it originates from.But one person wasn’t happy about it.A cranky follower sent Roman a direct message along the lines of: “I love your work and your feed, but please, enough with the cookies.”“As if I would give one sh*t!” she laughed. Then she put together an all-cookie story, 50 slides of cookies cookies cookies.“People DM me all the time, how do I get them more round, like everyone else? I’m like, don’t even stress about that, part of the beauty of the cookie is that it’s irregular, that’s why I like to use chocolate chunks and not chips, I like how natural and real it looks. They all look different but taste delicious, they all have their own cookie personality. That’s why I like sharing them, it empowers people to know they can look like this, or like that.”The cookbook is sold out on Amazon! (It will be restocked—the fourth printing!—on January 12th or 14th.) Meanwhile, find it at Barnes and Noble Sign up for her newsletter here, and then keep an eye out for her next cookbook, which she’s about to start working on...And FINALLY, here’s the recipe:Salted Butter and Chocolate Chunk ShortbreadLess chocolate chip cookie, more brown sugar shortbread with chocolate chunks—these cookies have started an Instagram craze.View RecipeExplore Bon AppétitCookbooksCookieShortbreadRead Morerecipes99 Christmas Cookies to Fire up the Festive SpiritGallery99 SlidesBy Mehreen Karimrecipes47 Easy Cookie Recipes You’ll Make on RepeatGallery47 SlidesBy Alyse WhitneycookingHow to Tell When Literally Every Baked Good Is DoneBy Claire SaffitzcookingBreakfast Cookies Are the Reason We're Getting Up In the MorningBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-04", "author": ["Condé Nast", "Alex Beggs"]}