{"id": "fb210d7eb417ad862714d69081b2f7ce", "url": "https://www.bonappetit.com/story/bad-korean", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "How Much Kimchi Do I Have to Eat to Stop Feeling Like a Bad Korean? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Much Kimchi Do I Have to Eat to Stop Feeling Like a Bad Korean?Adopted at seven months old, I grew up burying my Korean identity  and presenting myself as culturally white. And then, I learned to cook.By Alyse WhitneyJuly 3, 2019FacebookTwitterEmailPhoto Courtesy Alyse WhitneyFacebookTwitterEmailWhen I was six years old, I had my first bite of kimchi, and I cried. The spicy, fiery-red fermented cabbage made my eyes water and sweat run down my face, as if my body were immediately rejecting it. As I wiped my eyes, the group of Korean college students around me laughed, telling me I’d get used to the spiciness. I was sure that I never would, because I wasn’t like them. On the outside, we looked the same, but on the inside I knew I was white, like my adoptive parents. That was the first moment that I can remember thinking I was a bad Korean, a feeling that I didn't know would follow me around for the next 22 years.I was adopted from Seoul, South Korea, at seven months old by a family in Binghamton, New York. They liked their food to be...neutral. Dinnertime staples were dry-as-cardboard pork chops coated in Shake ‘N Bake, reconstituted potato flake “mashed potatoes,” and the occasional cheesy casserole or homemade meatloaf with a sweet ketchup glaze. As a kid, I knew something was missing from my food, but I had no idea what it was.It turns out it was salt. My mother told me that when I was a baby, I got so excited eating Chinese food that I swallowed a piece of cashew chicken whole and nearly choked. She said it was because I was too impatient to chew, but I like to think that I was just trying to get soy sauce into my body faster. Takeout Chinese was my first introduction to any sort of Asian cuisine, but I can’t recall having Korean food until my family took me to Binghamton University’s Korean mentor program—the scene of the crime of my shocking first bite of kimchi.Rolling gimbap, a Korean version of sushi, is one of the first memories I have of making Korean food.\nIMAGES COURTESY OF ALYSE WHITNEYIn the mentor program, my brother (also adopted from Korea, three years after me) and I were assigned “big sibs,” college students who taught us about our native culture. My first cooking lesson was for gimbap, seaweed rice rolls that are the Korean equivalent of sushi. After recovering from the spicy kimchi, I remember grabbing a neon yellow vegetable excitedly, enamored by the color, and taking a big bite. I scrunched up my nose at how sour it was and immediately spit it out. “Why do you like this?!” I asked my big sib, who shrugged and replied, “I don’t know—I just grew up with it.” I couldn’t comprehend that. In our home, rice was boiled in a bag and tossed with margarine, not made in a Cuckoo rice cooker and seasoned with the perfect blend of rice vinegar, salt, and sugar.I had fleeting experiences with Korean food after that. My family went to Camp Friendship, a weeklong Korean adoptees’ retreat that immersed us in the culture and taught us how to make bulgogi. We never tried that recipe at home, opting for burgers and hot dogs on the grill instead. The sole sign of my heritage’s food was the occasional bag of mandu from the only Asian food store in Binghamton, Kim’s Oriental Grocery, that my mom would boil like pasta and serve plain—no soy sauce. Truthfully I’d rather have eaten her savory rice pudding soufflé and salisbury steak instead. I loved my adoptive parents and wanted to feel just like them: white and American.Presenting myself as culturally white was partially a defense mechanism, because I was the only Asian person in my entire grade through high school graduation. If I just blended in, no one could make fun of me for being different. I was already bullied for being fat; I didn’t want to add anything else that I could be ridiculed for. And it worked: Only a few people pulled the corners of their eyelids back to mock my slanted eyes, and once they realized I wouldn’t react, they stopped. “You’re the whitest Asian person ever,” a then-friend told me. “You’re like a Golden Oreo, yellow on the outside and white on the inside,” said another. I took both as compliments and pushed my Korean identity further down every day until it barely existed.“Annyong!” exclaimed a middle-aged Korean woman at a New York City deli during my first week living in the city after college. I knew that meant “hello” more because of Arrested Development than from understanding Korean. “Hi, sorry, I’m adopted,” I replied, laughing awkwardly. That became a canned response for whenever I felt like a bad Asian. I felt forced to tell strangers such a personal fact about my life to avoid being judged for being unable to perform a basic task, like using chopsticks. Every time I asked a waiter for a fork to eat fried rice at a Chinese restaurant, I’d volunteer the information: “I’m adopted.” When cab drivers asked me, “So, where are you from?” I just said “Upstate, Binghamton.” They would often press further, questioning, “No, where are you from? China? Japan?” And again, like a robot, I’d reply, “Korea, but I’m adopted…” in hopes of not furthering the conversation, especially if the driver was also Asian. Everyone wanted to know what kind of Asian I was, and how Asian I was. The problem was that I barely understood that myself.For most of my life, I didn’t surround myself with other Asian people. I purposely stayed away from making other Asian friends, and I even went as far as to tell my peers in college that I hoped I was their “only” Asian friend. I realize now how problematic that was, but I was so insecure with how Asian I was (or wasn’t) and how “good” of an Asian I was (or wasn’t) that I was afraid I would be compared to other people and ultimately seen as the “less cool” and uncultured Asian friend. I made myself the token Asian of every friend group I ever had, embarrassingly until I was in my early 20s. There were microaggressions of racism and biases that I started feeling in my adult life because of how I looked on the outside—even if inside I felt white—and I had no one to talk to about them.A few years ago, after eating my fair share of late-night, post-karaoke KBBQ and Korean fried chicken, I started experimenting with Korean cooking at home. I was guided by YouTube superstar Maangchi—a warm and motherly Korean woman who teaches people how to cook through her quirky videos—but I didn’t have someone to help me navigate H Mart and pick the right type of doenjang soybean paste. Then I met Frances, my first adult Korean friend. We were the only two Asian people at a media dinner, seated across from each other, and we had an instant connection. We shared a cab home together, and I told her my full adoptee story. When I mentioned my hangups with Korean cooking, she offered up her help immediately.Without her, I may never have given kimchi a second try. When she came over to my apartment to make dinner, she brought her favorite bagged (not jarred!) brand of kimchi and showed me how to cut it myself—something her eomma taught her—and store it covered in its brine in the fridge. I finally found a kimchi that was mild enough for me to eat regularly, either on its own as a side dish or in a quick kimchi pancake for weeknight dinner, and now it takes permanent residence in my fridge. We made the stir-fried fish cake banchan that I always ordered more of at Koreatown restaurants and a big batch of tteokguk, a rice cake soup typically eaten on New Year’s for good luck. It was the middle of September, but it felt like the beginning of something.Me rocking a traditional hanbok. My parents had one of my “big sibs” buy it for me in Korea.\nIMAGES COURTESY OF ALYSE WHITNEYFrances rattled off her order in Korean to a waitress at a tofu house. I didn’t understand anything she was saying, and I likely never would. I couldn’t pick up the slippery rice cakes with chopsticks. I pulled the “I’m adopted” card while asking for a fork. Although I was gaining momentum in becoming a proficient Korean cook, I still didn’t feel like a “good” Korean. When the movie Crazy Rich Asians came out, I wanted to embrace this Korean part of me even more, but I kept getting hung up on if I was Asian enough to have something to say about these pop culture moments, and if I was Asian enough to represent Korean Americans when I still felt so white inside.I started to wonder about Korea—about my birth parents. When I’ve told people that I’m adopted, their first question is whether I’ve been to Seoul yet, and if I want to find my birth parents. The answers are: I haven’t yet, and I have no fucking idea. How do you even time a meeting like that? Do I do it first thing so I’m not anxious about it the entire trip, or do I save it for the end in case it goes poorly and I just want to rush home to my real family, my adoptive parents? And even if I made a fun, food-focused itinerary to discover the best mung bean pancakes at night markets and enjoy soju-fueled nights of karaoke, I would be anxious the whole time, feeling like a total outsider. Though everyone would look like me in Korea, I can’t speak the language, which would be confusing for many Koreans who tried to say “annyong”—or more—to me. I’d just be back in the same place, or worse.Then a funny thing happened: I met Maangchi. I reached out to her to tell her about being adopted and learning almost everything I know about Korean cooking from her, and how much that meant to me. We ended up having lunch, and the moment that we sat down, she looked me right in the eyes and said, “I am so proud of you.” Like that first bite of kimchi, my eyes filled with tears, but for a much happier reason. In that moment, I felt Korean enough, for now.Explore Bon AppétitFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-03", "author": ["Condé Nast", "Alyse Whitney"]}