{"id": "fb24ed2fb5c5cf2f098733d5837df776", "url": "https://www.bonappetit.com/recipe/amaro-hot-toddy", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Hot Toddy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueAmaro Hot ToddyBy Janice TiefenbachNovember 19, 20195.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintA soul-warming, cozy but complex toddy to get you through the cold winter nights. Though technically you could replace the aged cachaça in this cocktail with the more commonly available unaged variety, we strongly recommend you source the good stuff. Aged cachaça spends time in oak barrels, resulting in all of the warm spice flavors we crave in the winter. This recipe is from Montreal’s cozy-cool coffee-pizza-wine restaurant Elena.Ingredients8 servings1cup plus 2 Tbsp. bourbon1cup plus 2 Tbsp. aged cachaça (such as Avuá Amburana)¾cup Averna amaro¾cup fresh lemon juice⅔cup honeyLarge pinch of kosher saltLemon wedges (for serving)PreparationGently heat bourbon, cachaça, amaro, lemon juice, honey, salt, and 4½ cups water in a medium saucepan over medium-low until hot but not boiling. Pour into mugs and garnish each with a lemon wedge.How would you rate Amaro Hot Toddy?Leave a ReviewTell us what you thinkReviews (1)Back to TopTrianglesubbed in white rum for the cachaça and it's good!Anonymous3/11/2020Explore Bon AppétitHot DrinkDrinks AllCocktailBourbonWhiskeyAlcohol & Other DrinksAmaroLemonCitrusFruitFallWinterQuickEasyDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Janice Tiefenbach"]}