{"id": "fb29e866fcbc04e9c4f1f96c62a0e571", "url": "https://www.bonappetit.com/story/cheez-its-apple-bars", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "These Apple Crumble Bars So Special (And Strange) Thanks To This One Ingredient | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSurprise! There Are Cheez-Its In These Apple BarsDon't knock it 'til you try it.By Sarah JampelOctober 15, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina Boytsova FacebookTwitterEmailI promise that I didn't set out to make Cheez-It apple crumb bars. It just sort of happened. We were brainstorming ways to give an apple dessert that je ne sais quoi that would set it apart from all other apple desserts. Two ingredients came to mind immediately: cheddar cheese (as in the classic pairing of apple pie with cheddar-flecked crust) and Ritz crackers (the salty-buttery-crumbly cracker that served as the primary ingredient in mock apple pies during the Great Depression).What makes this dough orange—and extraordinarily tasty?\nPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFirst I tried making them with cheddar, incorporating a big hunk of the sharp stuff into the shortbread dough. The problem was that after baking, you couldn't really taste (or see) the cheese. And the moisture it contributed to the dough made the crust and the crumb topping soft and yielding rather than crisp, sturdy, and sandy. The cheddar also shortened the shelf-life of the bars—not ideal for a dessert you'd bake with your apple haul on Sunday and whittle away throughout the week.So I moved on to our next candidate. But when I went to the store to pick up the Ritz, I couldn't help but notice the other bright red box in the snack aisle: Cheez-Its. That's it! CHEEZ-ITS!, I thought. Made with real cheese (other stuff, too—but also real cheese), Cheez-Its combine the best qualities of cheddar—sharp, toasty, savory—with the best traits of Ritz—buttery, salty, crisp, irresistible. I took the Cheez-Its back to the test kitchen, where I hid them from Chris Morocco, who I feared would fire me on the spot, and the rest of the BA team, who I feared would plow through the whole box.I set out making the apple bars with Ritz, with Cheez-Its, and, again, with grated cheddar, and I asked anyone who walked by to tell me which they preferred. I wrapped up the bars and fed them to a couple friends, not disclosing the differences between the batches. They favored the Cheez-It-spiked bars but couldn't put a finger on the secret ingredient (actually, they didn't even guess cheese!). The crackers give the dough a bold flavor, an underlying saltiness that pairs against the sweet apples, and a rich, buttery texture, all without announcing themselves with much fanfare.A real photo of the inside of my brain.\nPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaBut I shouldn't have been so surprised: Cheez-Its have been formulated by scientists who are smarter (and more maniacal) than me to be widely beloved (seriously, put a box of them in a room and watch how fast they go). I realized I was just channeling my inner Christina Tosi, who has known for years that incorporating already delicious snacks—potato chips, Cornflakes, pretzels, popcorn, even macaroni and cheese—can achieve otherwise unachievable textures and flavors. I bake with Biscoff cookies, graham crackers, and Nilla Wafers. Now Cheez-Its are joining the club.In the end, we got a fall-feeling apple bar with a jammy center, a streusel topping, and a shortbread base. The triangular slices look like pieces of pie! And the second best part? You'll have an excuse to stow a box of Cheez-Its in the kitchen—or, if you’re like me, right at your desk.Get the recipe:Suspiciously Cheesy Apple Crumb BarsIncorporating Cheez-Its into the dough results in a toasty, buttery flavor that your friends will be able to identify as deliciousness, but not necessarily as cheesiness. (Trust us, we did a blind taste-test!)View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Sarah Jampel"]}