{"id": "fb4e818a9d83f0de566b967cd4a29723", "url": "https://www.bonappetit.com/story/cooking-tongs", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "The Cooking Tongs The Bon Appétit Test Kitchen Swears By | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Test Kitchen Swears By These TongsThe search for the perfect pair can feel overwhelming. Chris Morocco has the answer, once and for all.By MacKenzie Chung FeganJanuary 30, 2020FacebookTwitterEmailPhoto by Emma Fishman, food styling by Yekaterina BoystovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.There are 6-inch tongs and 16-inch tongs, tongs made of metal and tongs made of bamboo, tongs that look like tweezers and tongs that look like they were used to deliver babies in the 19th century. How are you supposed to know what’s right? Chris Morocco is here to help.As he sees it, there are three qualities that any cooking tong worth owning possesses: a short length, a pull-tab locking mechanism, and plastic-tipped heads. In other words, these 9-inch OXO tongs are the ones you’ll likely find in the BA Test Kitchen.Photo by Emma FishmanOXO Locking Tongs with Nylon Heads$14 at Sur La Table$14 $13 at AmazonWhether you’re nestling a 30-oz rib-eye against a blazing hot cast iron skillet or fishing out a whole chicken from a stock pot or tossing pasta to coat every strand in sauce, being able to wield a pair of tongs with precision and confidence is key. “That’s why I don’t believe in long tongs,” says Chris. “You have less control. With a long tong, you’re not able to manipulate heavy things with ease.”Why, you ask? Let’s back up to seventh-grade science class. “This right here,” Chris says, snapping at me with a pair of those tongs for emphasis, “is a simple machine.” Common cooking tongs are an example of a third-class lever. The fulcrum (where the arms of the tongs connect) is at one end, the load (what you’re picking up with the tongs) is at the other, and the effort you apply (by squeezing the tongs with your hand) is in the middle. The beauty of a lever is that it multiplies your efforts; a small motion with your fingers creates a larger movement at the end of the tongs. The longer the tongs, the more that movement is multiplied. But it also means less control over precise maneuvering.Imagine trying to maneuver this steak with 16-inch tongs!\nPhoto by Emma Fishman, food styling by Yekaterina BoystovaWhile length is Chris’ first criteria in choosing a pair of tongs, it’s not the only one. “Tongs that lock are essential for storage,” he says. (Nobody likes the frustration of an open pair jamming a drawer.) There are three main locking mechanisms on the market—tongs with a pull-tab lock at the fulcrum, tongs with a ring that slides up and down the arms, and tongs with an automatic inner lock governed by dark sorcery that closes or opens depending on if the head is pointed up or down. “The pull-tab kind is the only one that works,” Chris says. “I don’t mess with the up-down thing. And tongs with the sliding ring? Horrible! The ring is always where you don’t want it to be while you’re cooking.”Essential for pasta tossin’\nMaterial must also be considered. Do you opt for a stainless steel pair or cooking tongs that are silicone- or nylon-tipped? While Chris says there’s an argument to be made for stainless, the nylon-tipped version can be used on non-stick pans, which makes it the better bet if you’re only going to buy one pair. (He says to avoid silicone, which can discolor and crack after repeated exposure to high heat.)Oh, and the non-slip handle? That added bonus ensures he can maintain a controlled grip while maneuvering both the slenderest stalks of asparagus and the heaviest of roasted chickens. And that, my friends, is science.Explore Bon AppétitproductShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-30", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}