{"id": "fb5a5e8050735d5a6049ae837d733197", "url": "https://www.bonappetit.com/recipe/bushs-white-chili-bean-toast", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "BUSH’S® White Chili Bean Toast Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDBUSH’S® White Chili Bean ToastFacebookPinterestTwitterEmailThis make-anytime meal is your satisfying new culinary staple.PrintIngredients3 tablespoons unsalted butter, room temperature4 thick slices country bread, optional with sesame seeds2 (15.5 ounce) can BUSH’S® White Chili Beans½ cup finely chopped red onion2 tablespoons each freshly chopped chives, dill, and parsley, plus more chopped chives for garnish¼ cup red wine vinegar1 teaspoon Dijon mustardKosher salt and freshly ground black pepperAleppo pepper, for servingFlaky sea saltExtra-virgin olive oil, for drizzlingRecipe PreparationSpread butter on both sides of each slice of bread.Heat a large cast iron skillet over medium. Add toast and cook, turning once, until golden on both sides, about 2 minutes per side. Transfer each piece of toasts to a small plate.Return the skillet to medium heat and add the beans and their sauce. Cook, stirring occasionally, until beans are warm. Remove from the heat.Stir the onion, chives, dill, parsley, vinegar and dijon into the warm beans. Season with salt and pepper.Spoon warm beans and their sauce over toasts. Sprinkle with more chives, Aleppo pepper, and flaky sea salt. Drizzle with olive oil and serve.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitBUSH'S® BeansToastWhite BeanQuickEasyNut-FreeLunchDinnerMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Bon Appetit"]}