{"id": "fb60e075f68b112594b992ab442bbae3", "url": "https://www.bonappetit.com/story/pork-shoulder-roast-braciola", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "This Pork Shoulder Roast Has a Secret Built-In Sunday Sauce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoptechniquesThis Pork Shoulder Roast Has a Secret Built-In Sunday SauceIt’s also stuffed with garlicky Parmesan breadcrumbs, which you won’t be mad about.By Alyse WhitneyFebruary 17, 2018FacebookTwitterEmailPhoto by Marcus Nilsson, Food Styling by Rebecca Jurkevich, Prop Styling by Angharad BaileyFacebookTwitterEmailA pork shoulder roast is like Gracie Hart in Miss Congeniality: tough at first, but give it some time and it’ll transform into a beautiful, unforgettable dish. We often braise this cheap cut of meat for pulled pork sandwiches and Momofuku-inspired bo ssam, but sometimes you don’t want fall-apart, shreddy pork—you want a hearty slice.Our new recipe for pork shoulder braciola is a twist on the traditional Italian rolled steak. You stuff an herby, garlicky Parmesan breadcrumb mixture inside the meat, roll it up like your favorite lazy deli meat and cheese snack as a kid, and cook low and slow for 4–5 hours at 225° oven. When you cut into it, it becomes beautiful pinwheels of tender pork and it has a built-in side dish: cheaters’ Sunday Sauce. Instead of stirring ragù all day, tomatoes simmer around the pork and create a hands-off flavorful sauce. All you need to do is boil pasta while the pork rests, and dinner is served.The recipe is straightforward, but there are a few key tips to help you achieve saucy braised perfection. It starts at the grocery store and ends relaxing on the couch while you wonder if it’s possible to bottle and sell the smell of a slow-roasted pork shoulder. Here are some tips from senior food editor Chris Morocco:Shop Like a ProAt the butcher or grocery store, look for a fairly compact, solid piece of pork shoulder that weighs about 4 pounds. It should have even thickness from edge to edge instead of having a thin flap of meat on one side and a larger, thicker one on the other. Try to find one that is longer rather than short and stout so you can butterfly it open and stuff it. You can also ask your butcher to do this if you’re afraid of messing it up—shoot for 12–18\" when it’s unfurled and ready to stuff with garlicky breadcrumbs.Check ItThe braciola will take at least 4 hours to cook, but you can start checking temperature a little early to make sure it’s braised but not too fall-apart or dry. It needs to come to temperature slowly over time, and you can tell it’s done when a skewer easily passes through meat or a thermometer inserted into the center registers 200–205°. If you don’t have a skewer, a chopstick will work in a pinch. If you feel a lot of resistance with a skewer, keep the meat cooking longer.Roast in AdvanceHave a whole Saturday free but want friends to come over Sunday afternoon? Roast the pork, chill it, and reheat on medium-low in a covered pot. Submerge it in some sauce to keep it moist, and don’t slice until you serve. It shouldn’t take more than 20 minutes to reheat, and that’s plenty of time to boil pasta and get ready to serve. She is beauty, she is grace, she is Miss United Pork Shoulder.Ready? Get the recipe:Pork Shoulder Braciola with RagùParmesan-stuffed pork shoulder with a Sunday gravy in the same pot. Get after it.View Recipe--Another way to cook pork shoulder:Explore Bon AppétitPork ShoulderPorkRoastPastaRaguRead MorecookingBe a Hero, Roast a Pork Shoulder on ThanksgivingBy Amiel StanekcookingThis Roasted Pork Shoulder Is the Easiest, Most Impressive Dinner Party Dish EverBy Meryl RothsteincookingBraised Pork Shoulder Sandwiches You'll Want to Eat All WeekBy Alyse WhitneycultureHomemade Carnitas: A Step-by-Step Guide That Ends in Horchata Ice CreamBy Rick MartinezPhotography by Linda XiaoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-17", "author": ["Condé Nast", "Alyse Whitney"]}