{"id": "fb63917a656efa6696bbdb1524a8ac28", "url": "https://www.bonappetit.com/story/thanksgiving-centerpiece-cornucopia", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Thanksgiving Centerpieces: Yay or Nay? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThanksgiving Centerpieces: Yay or Nay?What even is a cornucopia? And do they belong on your Thanksgiving table?By Alex BeggsNovember 10, 2018FacebookTwitterEmailFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Deep in the heart of quesoLaura MurrayBefore I could even order my first don’keyrita, my dad requested a large bowl of queso. Even the tightest trip home leaves room for queso, and we always go to Don’Key, a Tex-Mex spot off the highway in Pasadena, Texas, that never misses an opportunity to make “ass” jokes. I like that kind of commitment to comedy, and butts.The bowl of smooth, canary yellow milkified cheese comes with a lone jalapeño sunk to the bottom, my prize for getting there. When I’m homesick, I make Rick Martinez’s showstopping recipe for Bob Armstrong dip, pictured up top, which combines taco meat into the perfect blend of chiles and cheeses. It’s ridiculously good, even if you just want the cheese part, and it’s much better than the way I’d make it as a kid, microwaving slices of Velveeta with milk and stirring it with a Tostito shard.Why don’t we make this at Thanksgiving???  Get the queso recipe here.Want this letter before it hits the website? Sign up for our newsletter!Photo by Caleb Adams, Food Styling by Rhoda Boone and Jennifer OphirOverheardCrispy salmon skin is “the chicharrones of the sea,” quipped Andy Baraghani on Basically’s weekly Instagram hotline. 🤔🤔🤔Get the recipe: Crispy-Skin Salmon with Miso-Honey SauceWeird wines for weird peopleI snuck out of the office on Monday afternoon with Emily Schultz and a hungover Amiel Stanek (it was his birthday the night before, Happy Birthday, Amiel!!!) to go to Raw Wine Fair in Brooklyn. Inside, we wandered from booth to booth, sampling a range of funky natural wines, some that tasted like thick water, one with notes of human stomach acid (the aftertaste of vomiting), and one that tasted like a fuzzy navel wine cooler, but fancy. What a crowd, too! One baby-faced gentlemen poured us a nice Chilean wine that filled my nostrils with the fumes of rosemary while he flipped through a binder of photos of wild-growing grapes, bored from having to show this to hundreds of people all weekend. We cooed over the pretty grapes, and what’s that? Rosehips. Huh. Over my outreached arm, a woman squirted some discarded wine through her teeth into a bucket, like a cowboy aiming for a spittoon. She nailed it.Water picklesAfter we accidentally drank too much wine because spitting felt wrong, we went to Mission Chinese Food and had the water pickles, a dish that went micro-viral last week for being an $8 bowl of ice. (The internet!) The pickles were actually great? These pickled pieces of cabbage and radish were freezing flavor bombs, and kind of hammy. “This daikon tastes like meat,” we concluded, and we were happy.Photo by Chelsea Kyle, Food Styling by Kat BoytsovaSunday not-so-scariesHave you seen Healthyish’s Guide to Sunday? And not just my round-up of comfy lounge clothes, based on my dreams of becoming Auntie Mame. This almond quick bread is so good with coffee—and I watched Sarah Jampel make SIX loaves one afternoon to get the ratio right for the winning balance of moist, dense, and cakey. I love Sunday! Whispers, It’s my favorite day to work.Get the recipe: Almond Butter and Jam Quick BreadHow was your week?Unnecessary food feud of the weekThere are centerpieces—and then there are Sandra Lee tablescapes. Is there even room for turkey on a table full of frosted faux pumpkins?? It turns out the BA staff has a few different camps of thought: the foragers, the floral arrangers, and Brad. Molly Baz asked: “What even is  a cornucopia? I’m not convinced.”Emma Wartzman, Amanda Shapiro, Aliza Abarbanel, and Anna Stockwell are foragers, gathering leaves, sticks, acorns, pine cones, and berry branches for their rustic tableaux. This news horrified Amiel: “You can’t take stuff from the OUTSIDE and put it on your TABLE, there are BUGS!” Emma replied: “Shake them! Blow on them!” Anna’s mom has a collection of animal toys she displays throughout the gathered leaves, while Zoe Sessums family has a beach theme, a collection of stones and shells that have conglomerated with candle wax throughout the years.The sophisticated flower people include Meryl Rothstein, Hilary Cadigan, Adam Rapoport, and Julia Kramer, who once had an arrangement by Saipua that was so elaborate (and stunning!)—including artfully off-kilter persimmons—she had to set up a side buffet for food. Hilary’s mom is the president of her garden club, so. And Rapo is fine with a snaking linear arrangement of flowers and branches and whatnot, because he’s endorsing a buffet-style Thanksgiving this year: “As long as there are gravy boats on BOTH ends of the table.”Then there’s Brad. “Centerpieces? I can get into that.” He shouted at me even though I was 18 inches away from him. “Oak leaves! Acorns! Winter squash! Cranberries fresh from the bog! Some dead wild bird, pheasants, spread across the table!” Wait-wha? “I’ve been thinking about building miniature tables to put on top of the table so you can put your centerpiece on that, so there’s still room for all the food.” Take that, Pinterest.Explore Bon AppétitBeggs NewsletterThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-10", "author": ["Condé Nast", "Alex Beggs"]}