{"id": "fb683971b38b5dd82bb3c8721b53f15b", "url": "https://www.bonappetit.com/story/genevieve-villamora-on-kavanaugh-hearing", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Genevieve Villamora on What It's Like to Run a Restaurant in D.C. Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhat It’s Like to Be a Restaurant Owner in D.C. Right NowGenevieve Villamora on how she’s handling the Kavanaugh hearing with her staff and patrons.By Genevieve Villamora October 4, 2018FacebookTwitterEmailInside Bad Saint in Washington, D.C.FacebookTwitterEmailGenevieve Villamora is the co-owner of Bad Saint, the Filipino restaurant in Northwest D.C. famous for its long lines and unbeatable adobo. She’s also an anti-violence activist who’s worked at the Georgetown University Women’s Center and as a crisis hotline responder. Here she talks about how she’s handling the Kavanaugh hearing and surrounding events personally and with her restaurant staff and patrons.Overwhelmed. It’s a state I am intimately familiar with these days. I binge-consume the news, and lately the news makes me feel like I’m coming unhinged. It’s why I sometimes pull the covers up to my chin and stay in bed an extra hour. And why I have been doing deep dives into the “2 Dope Queens” archives for comic relief. It was definitely how I felt last week, as the tension built up to the day of Dr. Christine Blasey Ford’s appearance on Capitol Hill.I listened to her testimony on my phone all morning as I drove to my haircut and picked up flowers for the restaurant. The sound of her voice breaking put a lump in my throat. I yelled at the radio. I wept in my car. When her testimony ended, I turned the radio off. I had reached my emotional breaking point. Though I wanted to curl up in the fetal position and ugly cry all afternoon, I had to find a way to regroup. My day was only half over. A busy night of dinner service lay ahead.I had been at this breaking point before, overflowing with the emotion of other people’s stories. As a college student, I organized Take Back the Night events on campus to raise awareness of violence against women. Each year we had a speakout, where people could share their experiences of sexual violence. It was the first time I realized that survivors are all around us, all the time everywhere. At the bus stop. At the PTA meeting. At the doctor’s office.My first job out of college was at a local rape crisis center in D.C. I have vivid, visceral memories of the shifts I worked on the crisis hotline. Every time it rang, the voice on the other end yanked me out of my own reality and into their story. Many of the survivors I encountered had never spoken of their assault to anyone. Almost without exception, they shared experiences of violence that had happened years before. The lingering trauma haunted them daily.Once you grasp the pervasiveness of sexual violence in our society and the world, it’s not something you can unsee. The voices of these survivors have been whispering in my ear since Dr. Ford came forward.Their stories are powerful, and they’ve seeped into our conversations at the restaurant. We analyze breaking news as we set up the dining room before service. Sometimes it comes up with guests, as it did recently with a journalist covering American politics for the BBC. Other times, it feels better to focus all my energy on my work—getting our guests a good meal and a respite from whatever is outside our door.Working in a restaurant can be depleting. It can also be surprisingly restorative, especially in these times. What is more fundamental than needing to eat? What brings us together better than shared food and drink? People transform over the course of the meal. They arrive with brows furrowed from hunger or a tough day, and with every bite they get a little more relaxed, a little more themselves. I get so much satisfaction from playing a role in that transformation.A couple weeks ago, we decided to end our daily staff meetings with music—songs that give us life—inspired by the folks over at NPR’s Code Switch podcast. At the end of every episode, no matter what the topic, Code Switch ends the show with the guest (or one of the hosts) sharing a song that is giving them life. For two weeks, we jammed out to Mariah Carey, cumbia, Living Colour, and a riot of other bumpin’ tunes. It was something small, but it really helped. As people who expend a lot of energy taking care of other people, it felt good to do a little something for ourselves.This country is in a uncomfortable moment. We’re filled with tension and conflict and acrimony and angst. Though it’s distressing, I believe that discomfort can be a force for positive change, growth, and justice.Until then, I may continue staying in bed with the covers pulled up to my chin for a while. I may start binge-watching Game of Thrones from Season 1 (again). But I’ll keep showing up at the restaurant. I’ll keep adding names to the waitlist and pouring wine. And today I draw great strength from the words of Maria Gallagher, one of the women who fatefully held the elevator door open last Friday.“Look at me when I’m talking to you….Don’t look away from me. Look at me….”Explore Bon AppétitRestaurantsChefsFirst PersonRead MoreLifestyleHow I'm Talking to the Men in My Life Right NowBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-04", "author": ["Condé Nast", "Genevieve Villamora"]}