{"id": "fb6b8b13ae1e7e10015e024c5303900c", "url": "https://www.bonappetit.com/story/coronavirus-vaccine-uche-blackstock", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "We Asked a Doctor All Our COVID-19 Vaccine Questions | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe Asked a Doctor All Our COVID-19 Vaccine QuestionsDr. Blackstock’s take: People should feel confident about getting the vaccine. Here’s what else she has to say.By MacKenzie Chung FeganMarch 4, 2021FacebookTwitterEmailCourtesy of Dr. BlackstockFacebookTwitterEmailPresident Biden has suggested that by the end of May, every American who wants a COVID-19 vaccine will be able to get one. But among the many hurdles for the COVID-19 vaccine rollout plan: Not everyone wants one. Recent polls suggest about a third of adults in the U.S. are skeptical of the new vaccines’ efficacy and safety. The hesitance is understandable; there’s a lot of misinformation circulating. And as with all things pertaining to your personal health, it is okay (good, even) to ask questions. But when it comes to infectious diseases, a collective response is needed to stop the spread. So we decided to pose some common questions about the coronavirus vaccines to Uché Blackstock, M.D.—a Harvard Medical grad, emergency physician, former associate professor at NYU, medical contributor to Yahoo News, and the founder of Advancing Health Equity, a consultancy which partners with organizations to address issues of bias and racism in health care. Dr. Blackstock is one of many medical professionals in the country burdened with fighting fake news with facts. Her take: People should feel confident about getting the vaccine. Here’s what else she has to say.At the beginning of the pandemic, we kept hearing that the fastest developed vaccine took four years. How can we account for how quickly the COVID-19 shots were developed and approved? Were there corners cut with the trials?This is a concern that many people have, and it’s understandable because the public health messaging around the vaccine wasn’t what it should have been. The research for mRNA vaccines—and also the other types of vaccines that are being approved now—has been going on for years, so these vaccines were not developed overnight in terms of the technology used. Because of the urgent nature of the pandemic, the government put billions of dollars into vaccine research and development, partnering with private manufacturers in a way that provided resources to develop the vaccines on this accelerated timeline. No steps were cut. Normally vaccine development takes 10 years because all the steps are performed sequentially. But because of all the resources poured into this effort, those steps occurred in parallel, cutting down on the time significantly without cutting corners. These vaccines were tested in over 100,000 people, and they’ve been given to millions of people by now. They’ve all proven to be safe and effective. People should have confidence in them.It sounds like what you’re saying is that the way that the timeline was accelerated was by trimming bureaucracy, not by trimming the science.Exactly. That’s a nice, succinct way of putting it.You mentioned the mRNA vaccines. How are these vaccines, developed by Moderna and Pfizer, different from vaccines that I may have received in the past?The goal with these vaccines is to show the body something that looks like the coronavirus but isn’t the coronavirus, so that the body can develop antibodies. With these new vaccines, genetic material called messenger RNA, or mRNA, is injected into the body, and it gives our cells instructions on how to make a portion of the coronavirus’ spike protein. This spike protein is responsible for latching on to human cells and infecting the cells. Once the immune system sees the manufactured spike protein—which is not the actual spike protein of the virus but looks like it—the body develops antibodies. In the event of a future infection, those antibodies will attach to the virus’ spike protein and neutralize it.So it sounds like these vaccines sort of train the immune system through simulation so that if your body eventually needs to confront the real coronavirus, it knows what to do.Correct. One of the things I’ve heard people express concern about is that somehow the cells might incorporate this mRNA genetic material, and that it’ll remain there permanently. What’s really important to know is that the messenger RNA that is injected disintegrates. It does not become part of your genes; it’s transient.We have been given so many reasons to distrust the previous administration, particularly regarding its handling of the pandemic. And additionally, there are many marginalized communities—Black Americans and other people of color, the LGBTQ+ community, incarcerated people—that have been either ignored or actively harmed by the “medical establishment” in the past. How can people trust the information they’re hearing about the vaccines?There has been much damage done. Prior to January 20, we weren’t getting a lot of accurate and responsible messaging around the coronavirus from the federal government, and I think that has become embedded in people’s ideas about the vaccine. We saw an unprecedented level of political interference in the work of the FDA and the CDC, and we had leaders who did not follow the science or act in a way that was rooted in evidence. Because of this, a significant portion of the country still doesn’t think the pandemic is that serious or that masks work. There’s an abundance of misinformation, and it’s incredibly important that my physician colleagues and I get out there and that our voices are amplified so that the public can hear reliable messaging that is grounded in science.This idea of vaccine hesitancy, I like to reframe it more as one of institutional trustworthiness. Institutions have a track record of exploiting and abusing marginalized communities. Because of the urgency of this moment, there’s a push to tell people, “Just take the vaccine,” and you really can’t do that. We have to make sure that we’re getting information out to people in a culturally responsive, deeply digestible way so that they’re able to have their questions answered by people they trust. Some people may not trust the “institution” of health care, but they do trust their individual health care providers, their nurse practitioners, their physicians. Trusted messengers in the community—faith leaders, barbers, community organizers—also do a tremendous amount of health advocacy, especially in Black communities and other communities of color.This is what systemic racism does. It exploits and abuses, and then when it’s time for those communities who have been disproportionately impacted because of racism to seek care, people are distrustful. This history you mention—Tuskegee, Henrietta Lacks, “Mississippi appendectomies”—there is a certain percentage of the population, mostly older Black Americans who remember that. But I also think that we can’t forget about the ongoing discrimination that Black people face when they interface with the health care system today. It’s not just what’s happened in the past, it’s the present as well.Another institution that many consider to be untrustworthy is the pharmaceutical industry, which has paid out billions of dollars in settlements for fraudulent marketing and kickbacks to health care providers. Moderna may not be considered Big Pharma—they’ve only been around for 10 years, and this vaccine is the first drug it has brought to market—but Pfizer certainly is. Why should we trust private companies when it comes to public health?I understand the concerns, and I will say that I’m overwhelmingly convinced by the data that we’ve seen. The flu vaccine has an efficacy of between 40 and 60%, and to get emergency authorization, a vaccine needs 50% efficacy. The Moderna and Pfizer shots are 94 to 95% effective. That is almost a miracle. I continually weigh the risks and benefits, and while the institutions have proven untrustworthy in the past, we are in a situation where we can’t afford to say no to the vaccine. The only way people are going to be able to see their loved ones again, to travel, to see a newborn baby cousin is really by taking this vaccine.My perspective is of someone who was on the front lines here in New York City back in March and April when we were the epicenter of this pandemic. I work in an urgent care clinic, and I saw people—even young people in their 20s and 30s—who were sick enough that I had to send them to the emergency department. I was incredibly humbled by this virus. I was scared of what would happen to my patients. I was scared to go to work, worried about bringing this home to my family. So my perspective is that I saw the worst of it, and here we have these vaccines where the data is just so overwhelmingly convincing. They’re not only safe, they’re also effective. So even if these pharmaceutical companies have a history of proving untrustworthy, when you’re weighing the risks and benefits of getting vaccinated versus being infected with this virus, it’s safer to take the vaccine than to get infected.What if someone is thinking, It’s my body, and if I decide not to get the vaccine, that is a choice I am making to take on that risk. Is this just a personal decision?It’s almost a privilege to say that you don’t have to get vaccinated. This pandemic has exposed profound systemic inequities in our country. Black, Latinx, and Indigenous communities are disproportionately impacted by the virus. Black people are dying at the same rate of a white person 10 years older than them. At the same time, here in NYC, there is also a disparity in terms of who is being vaccinated. In Black and Latinx neighborhoods, you have people from outside those communities, nonresidents, coming to be vaccinated.So communities of color are the most likely to die from COVID-19 and also are having problems accessing the vaccine.Yes, and people are thinking, I don’t have to wear a mask if I don’t want to or No one can tell me to get a vaccine as opposed to thinking about community. Ultimately we can’t keep everyone protected unless everyone is vaccinated. Especially with infectious diseases, we need a collective response in order to mitigate the spread. While individual behavior is important, we need everyone on board in order to see any positive changes. When you’re infected with COVID, you put other people’s lives at risk. That’s just how the virus works. We are interconnected. What I do impacts other people, and I have to care about what happens to my neighbors because it directly impacts me.How do you talk to patients who might have concerns or who may be vaccine skeptical? And how do we talk to friends?One conversation is not going to change their minds. Often people just want to be able to share their concerns, and I try to answer their questions in an incredibly nonjudgmental way. My goal is not necessarily to convince them to take the vaccine but to make sure they have the information they need to make an informed decision. That’s really all that we can do.Explore Bon AppétitHealthyishCoronavirusInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-04", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}