{"id": "fb78512444065e5327e98b968564ba21", "url": "https://www.bonappetit.com/story/nut-butter-bar-recipe", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "This Energy Bar Recipe is Definitely Worth Making at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThat Nut Butter Bar You're Obsessed With Is Easy to Make at HomeNut butter bars have taken over the snack aisle, but they're a cinch to make in your own kitchen.By Sarah JampelSeptember 10, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Sue LiFacebookTwitterEmailBeing a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner.I come from an energy bar family: We packed them in carry-on bags, lunch boxes, and gym bags; we stored them in glove compartments, toiletry cases, and kitchen drawers. I’m surprised I never found them stashed under couch cushions. How my parents survived before there were bars of all kinds, I have no idea. I do know that they passed on this trait to me.I'm still a bar lover, but now that it's 2019, I'm over crumbly, too-sweet granola bars and protein bars with dubious ingredient lists. Today's bars lean in on nut butters for texture and flavor, and the BA staff has been known to squirrel away Big Spoon Roasters, ProBars, and Perfect Bars in our desk drawers. So when I set about creating a healthyish homemade energy bar, I used these new-wave bars as inspiration.To succeed, I knew the bars would have to meet certain strict requirements (otherwise, why would anyone bother making them at home?). The process should be easy and streamlined; the final product should be sturdy enough to survive at the bottom of a gym bag for a couple days but not rock hard or super chewy; the ingredient list shouldn’t call for too much sugar (it’s an energy bar, not a candy bar, okay?); and, a personal goal of mine, associate editor Christina Chaey should be willing to take one or two along on one of her 100-mile bike rides.And after many, many iterations—oats roasted, oats raw; nuts whole, nuts ground; oats whole, oats ground; almond butter, peanut butter; 8x8, 9x13—we finally landed on a chewy-but-firm bar that’s neither crumbly nor pasty. It’s a happy medium between the two poles: shattering and dry (one wrong move and it turns to granola dust) on one end, sticky and leathery (one wrong move and you pulled out a tooth) on the other.It starts with any combination of nuts and dried fruit (we mixed and matched pistachios, walnuts, almonds, hazelnuts, and pecans, and cherries, cranberries, apricots, dates, and currants), though more sugary fruits will, obviously, make the bars skew sweet, and we steered clear of waxy macadamia and Brazil nuts. The nuts get roasted and ground along with half of the oats. Grinding the oats in the food processor helps to glue the bars together while making the texture a bit softer and less bitsy.That coarse meal is mixed with whole oats (so that the bars aren’t too pasty), then coated with honey and peanut butter. Most of us prefer the natural sweetness of peanut butter to the deep, roasty flavor of almond butter, but both work! The final step is to mix in an egg white, which serves as another binder to ensure that the bars will hold together. If you want to skip the egg white, you can use 2 tablespoons chia seeds in its place: Add them to the food processor when you blitz the oats. Chia seeds make for a slightly softer bar that's reminiscent of a soft-baked oatmeal cookie.For the final step, the mixture get pressed into a pan and baked, during which the bars go from tacky and soft to sturdy and solid. The recipe makes 16, which is plenty for a week or two. I’m planning to make a big batch on the weekend so that I can keep some at home and some at my desk: If I don’t have time to eat breakfast or if my 4 p.m. stomach won't stop rumbling, there’s a snack nearby.But as to whether I can convert my parents to homemade energy bars, that’s another story.Get the recipe:Nut Butter Granola BarsThis just-sweet-enough, chewy-but-firm bar is bound together by peanut butter and honey.View RecipeExplore Bon AppétitHealthyishGranolaHealthy SnacksSnackThe Not Depressing VegetarianRead MorecookingBreakfast Cookies Are the Reason We're Getting Up In the MorningBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-10", "author": ["Condé Nast", "Sarah Jampel"]}