{"id": "fb8fde74660a966d078c44915c15383a", "url": "https://www.bonappetit.com/story/special-sunday-bottle", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "How to Have A Better Sunday Night With the Right Drink | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I Turned Sunday Nights into Something to Look Forward ToThe end of the weekend feels a little less dire when you have a bottle of something delicious waiting for you.By Alex DelanyNovember 5, 2018FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailThis story is part of the Healthyish Guide to Sunday, a compilation of recipes, suggestions, and obsessions to make the first day of the week your favorite.The worst part of weekends is that they end. And associating the worst part of the weekend with the day it happens has given Sunday a bad rap. And that’s why, come Sunday night, I open something special. I do it for me, and I do it for Sunday.The idea is simple: I save something exceptional for the very end of my weekend, so I actually end up looking forward to the termination of my two-day sabbatical as much as I anticipated the beginning. It’s a maneuver that eases my re-entry into the work week (that may or may not have been proven by some psychologist somewhere to actually work?).For me, this treat is usually a bottle I’ve been saving: a cider, wine, or beer that I’m stoked to taste. Last Sunday, for example, I opened a bottle of Frequency Illusion: Skin Contact from Ardmore, PA’s Tired Hands Brewing Company. What the hell is that? you may be asking. Why is it so exciting?This beer is fermented on spent Pennsylvania Merlot grapes, which means that as the sugar in the grain ferments, so does the residual juice in the grapes. It’s part beer and part wine, and it’s a drink that’s unlike anything else. You can’t buy it at your liquor store. You can’t pick up a six pack of this stuff at the gas station. It is, as it sounds, special. The symphony of tropical fruit flavor, pleasant bitterness, tannin, acidity, and subtle sweetness lifts me out of my surroundings and places me gently into a place of pure enjoyment. I smile at the thought of drinking something like this, which means I smile at the thought of Sunday night.But that doesn’t mean you have to follow the same path. You can go the booze-free route. You can save the last episode of whatever show you’ve been watching the week prior. You can break into the expensive chocolate bar that’s been sitting in your fridge. You can eat a slice of the carrot cake you baked on Saturday morning. It doesn’t matter what you choose, as long as it brings you joy.And no, I don’t usually drain the whole bottle by myself. My girlfriend or my roommate or my roommate’s girlfriend usually lends a hand. Because you can’t go raging into Monday. As Fergus Henderson once wrote, “Don’t let the cure become the cause.”Explore Bon AppétitGuide to SundayHealthyishAlcohol & Other DrinksBeeressayRead MorecultureAmericans Have Been Doing Cider Wrong Forever, and It's Time to ChangeBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-05", "author": ["Condé Nast", "Alex Delany"]}