{"id": "fb965b15f9b1ef5ec3248b74b7ea553e", "url": "https://www.bonappetit.com/story/cdn-tm8-kitchen-timer", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "The Greatest Kitchen Timer Is the CDN TM8 Digital Timer  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe BA Test Kitchen Swears by This Small Kitchen TimerThey say time is an illusion, but the perfect timer is real.By Zoë SessumsMarch 14, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailYou know that thing where you learn about something for the first time, and then suddenly you start seeing it everywhere? The phenomenon is called the Baader-Meinhof effect or “frequency illusion,” and it happens to me all the time. On most occasions, it feels like a funny coincidence, but when it happened with the CDN TM8 Timer, it felt like divine intervention at play.I was wandering through the Bon Appétit Test Kitchen, seeing what scraps of recipe testing I could scrounge, when I spotted this little white timer propped up at senior food editor Anna Stockwell’s station. Next to her, clipped to senior food editor Chris Morocco’s apron, I saw it too. There it was again, in the distance, magnetized to the fridge door.“This is the best inexpensive kitchen timer,” Chris said, swiftly unclipping it from his apron to show me the specs up close. “The buttons are large and easy to press, the count up and count down features make it incredibly helpful, and it’s cheap.”Stockwell echoed the joys of the TM8 Timer. “When using it for cooking and baking, it counts down to zero, rings for a minute—a decent loudness you can hear in a busy kitchen—and then counts up until you turn it off so you know how much time has elapsed. It has a memory feature so that when you bake batches of something, like cookies, you set the memory to, say, 12 minutes, and use the memory function each time. You can also add extra minutes to your set time if your bake is not quite done.”It’s also durable, moisture-resistant, and definitely less nerve-wracking to have around a pot of boiling water than a smartphone. Plus, it’s likely a lot more versatile than the timers built into your appliances. With features like the ability to track multiple things at once and longer ranges, with a clip for wearing, a fold away stand for propping up, and a built-in magnet for mounting, the petite piece of plastic will become your handy sidekick.But our Test Kitchen editors aren‘t the only CDN TM8 Timer stans. I saw it attached to an espresso machine at a coffee shop near my house, and the next day, in action at a chain coffee establishment (it rhymes with Shmarbucks) near the office. Barista friends of mine vouch they use it for all their coffee and tea brewing needs.Now that you know to look for it, you’ll start to see it everywhere too, I guarantee it. But the place I’ve become the most delighted to find it is in my own kitchen. Keeping time has never been better.Buy it: CDN TM8 Digital Timer and Clock, $13 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-14", "author": ["Condé Nast", "Zoë Sessums"]}