{"id": "fba2ee5d1d58da7021c7cc5daff6531f", "url": "https://www.bonappetit.com/recipe/cheesy-butternut-squash-and-kale-breakfast-bake", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Cheesy Butternut Squash and Kale Breakfast Bake Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesCheesy Butternut Squash and Kale Breakfast BakeFacebookPinterestTwitterEmailCreamy mushroom soup adds tons of flavor to this egg bake with just 1 ingredient. The strata can be prepared up to a night in advance and stored in the refrigerator wrapped. Bring to room temperature before baking.PrintIngredients1/4 cup extra virgin olive oil, plus more for brushing1 large butternut squash, (about 2 pounds)Kosher salt and freshly ground pepper1/2 loaf of rustic bread, (from a 1-pound loaf of bread)6 ounces gruyere cheese8 large eggs1 1/2 cups whole milk1 (10 1/2 ounce) cans Campbell's Cream of Mushroom Soup1 pound curly kale, (2 bunches)2 large leeks, white and light green parts onlyCrushed red pepperRecipe PreparationPreheat the oven to 425° and brush the bottoms and sides of a 9-by-13-inch baking dish with olive oil.Peel, halve, and seed the butternut squash. Cut into 1-inch pieces. Slice the bread into 1-inch cubes and grate the cheese on the large holes of a box grater.On a rimmed baking sheet, toss the squash with 2 tablespoons of the olive oil. Season with salt and pepper. Bake for about 25 minutes, tossing once, until the squash is just tender.While the squash roasts, whisk the eggs and milk into the Campbell's® Cream of Mushroom Soup in a large bowl. Season with ½ teaspoon salt and ¼ teaspoon pepper. Fold the bread and three quarters of the cheese into the egg mixture. Let sit, allowing the bread to absorb the egg mixture, while you prepare the greens.Remove the ribs from the kale and discard. Tear the leaves into roughly 2-inch pieces. Slice the leeks into ¼-inch rounds and wash well.Heat the remaining 2 tablespoons of oil in a large skillet over medium-high and add the leeks. Cook, stirring occasionally until softened, about 3 minutes.Add the kale to the leek mixture by the handful, stirring after each addition to wilt the leaves before adding the next handful. Season with salt and pepper and sprinkle with a large pinch of red pepper flakes.When the squash is done, reduce the oven temperature to 350. Stir the squash and kale mixture into the bread mixture and scrape into the prepared baking dish. Sprinkle with the remaining cheese.Bake the strata for about 50 minutes until just set and golden brown. Let stand for 15 minutes before serving. Serve with more red pepper flakes.Recipe by Campbell'sRelated VideoCheesy Butternut Squash and Kale Breakfast BakeReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitCampbell'sSponsoredBasicallyMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}