{"id": "fbc041ccc3918a570bf5f1a95255dbd0", "url": "https://www.bonappetit.com/story/shailene-woodleys-desert-island", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Shailene Woodley's Desert Island Food Is...Potatoes? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureShailene Woodley's Desert Island Food Is...Potatoes?Also dried bananas and something called a LifeStrawBy Alyse WhitneyJune 6, 2018FacebookTwitterEmailFacebookTwitterEmailShailene Woodley loves potatoes so much, she’ll write poetry about them. “My love of potatoes goes deep. I love the red ones. I love the purple ones. I love the pink ones. I love the waxy ones. I love the dry ones. I love the big ones. I love the small ones,” she tells me over the phone, as if she’s writing a Dr. Seuss recipe book.They're also the one food she’d miss desperately if trapped at sea. In her new based-on-a-true-story film Adrift, the actress portrays Tami Oldham, a woman who fights to keep her and her fiancé, Richard Sharp (Sam Claflin), alive after they sail directly into Hurricane Raymond en route from Tahiti to San Diego. Potatoes were not an option for Oldham; she survived on canned food and peanut butter for 41 days.Back on dry land, Woodley and her partner have potatoes for dinner at least four nights a week. With \"parsley, sage, rosemary, and thyme,” she sings in her best Simon & Garfunkel impression (but really she goes for rosemary and thyme most of the time). Recently she's into Russian-style pan-fried taters. Her best friend’s mom taught her a simple recipe: olive or grapeseed oil, “obscene amounts of garlic—like a whole head,” onions, salt, and matchstick potatoes in a nonstick pan. “They get that nice crunch on the bottom, but they’re super soft on the inside. Then you can crack on egg in it and make a little potato frittata.”Woodley portrays Tami Oldham in Adrift.\nKirsty Griffin/STX FilmsIf Woodley was packing a bag of essentials before embarking on a long journey, she would opt for Barnana dehydrated banana bites ($4 on Thrive Market) and her LifeStraw ($40 for two on Amazon) over raw potatoes. Barnanas are more like chewy bites than banana chips and are made from “imperfect” bananas to prevent food waste, and Woodley explains that you can suck any water (except salt water) through the LifeStraw directly—it will filter out bacteria and protozoa. Sure, she may get sick of dried bananas after a few weeks at sea, but they would make a good dipper for peanut butter.The moment that she got back on land, Shailene Woodley would find good water and reach for any type of moisturizer. “Give me olive oil to throw on my skin, or coconut oil. After being under the sun and berated it all day long, moisturizer would be my long lost lover,” she says. In an ideal world, it would be her favorite skincare product: Nyakio face moisturizer ($35 at Ulta). This moisturizer, and a handful of Nyakio’s products contain coffee, which Woodley says makes them smell really good and wake you up. If anyone can encourage me to swap cold brew for coffee face polish tomorrow, it’s Woodley. “When I put that cream on in the morning, I feel like I can take on the world,” she raves. Maybe the key to a great life is coffee moisturizer, dried bananas, and potatoes. You heard it here first.Explore Bon AppétitCelebritiesHealthyishprofileRead MorecultureLily Collins's Favorite Vegan Cookies Have a Surprise IngredientBy Alyse WhitneycultureWhy Kate Mara Can't Live Without Vegan CheeseBy Alyse WhitneyshoppingSasheer Zamata's Secret to Great Skin Is This Showerhead Water FilterBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Alyse Whitney"]}