{"id": "fbcfc68ae192391bd6f616c649058c8a", "url": "https://www.bonappetit.com/story/issa-rae-dinner-party", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Issa Rae’s Dream Dinner Party Is a Beachside Senegalese Feast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIssa Rae’s Dream Dinner Party Is a Beachside Senegalese FeastThe ‘Insecure’ co-creator and star's guest list includes three of the biggest names in music.By Dawn DavisOctober 20, 2021FacebookTwitterEmailIllustration by Liana JegersFacebookTwitterEmailWelcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.After four acclaimed seasons, Insecure, the groundbreaking hit from Issa Rae, is coming to an end (catch the fifth and final season premiere on October 24). We’re sad to see it go, but maybe that will give Rae time to host her fantasy dinner party, with platters of food, plenty of drinks, and a collection of legendary musicians.Which three people would you invite to your dream dinner party?I’m obsessed with musical artistry, so I would choose Frank Ocean, Solange, and Prince. I feel they would have a good time together. The only insecurity I have is what I would bring to the table.I’m sure you’d bring a lot! Are you hoping they’d introduce you to new musicians?More than that. I get a lot of creative ideas from music. Listening to a song can inspire a whole concept for a television show or movie.What do you cook?I went back and forth. Do I offer sushi, omakase, or Senegalese food? With Senegalese culture, we have such a great way of eating, with big platters built for communion, discussion, and debates. If I can’t bring anything musically, then the hosting has to be on point.What kind of Senegalese food would you serve?We have great appetizers. I love pastels. They’re like empanadas or Jamaican patties, dumplings stuffed with fish or beef. They’re delicious: fried or baked, with a spicy tomato-onion sauce for dipping. My mom used to make them on Culture Day at school.And the main course?Mafé, which can be made with beef or lamb and has a peanut sauce. It’s delicious. I love peanut butter with everything. And another favorite dish, soupou kandja, is a blend between my two cultures. My mother, who is from Louisiana, makes gumbo. Soupou kandja is kind of a Senegalese gumbo. Where are you serving this food?Maybe at a place like Africa Kine in New York, or we could go to Senegal and do it beachside. I’d do a version of what they do at a place in Senegal called Les Almadies, which is by the beach, has a sea breeze, and a cabana-esque setting with modest tablecloths and big silver and gold platters of food. We’ll eat with our hands; we’ll eat traditionally; and of course we’ll have libations.Libations of what sort?Bissap, which is a sweetened hibiscus drink, with gin mixed in, garnished with mint. You can swap in your drink of choice. I mostly drink vodka, so…Vodssap? I don’t know, I’ll work on a name. What do you talk about? I would ask which song of the other guests’ they wish they had made. What song of theirs do you wish you had made?Prince’s “The Beautiful Ones,” Solange’s “Don’t Touch My Hair,” and Frank Ocean’s “Pyramids.” It’s the last season of the pioneering show Insecure. Which character from the show gets invited to your party?Molly. Without a doubt. Because Molly can just turn it on. And she can complement my awkwardness just like she does for Issa on the show. Not that I’m mad awkward….Explore Bon AppétitDream Dinner PartyPop CultureInterviewsRead MorecultureJosé Andrés Would Serve Oysters, Gazpacho, and Fried Eggs at His Dream Dinner PartyBy Dawn DaviscultureMindy Kaling Would Only Have One Guest at Her Dream Dinner PartyBy Dawn DaviscultureCicely Tyson on the Star-Studded, Very Purple Dinner Party of Her DreamsBy Dawn DavisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-20", "author": ["Condé Nast", "Dawn Davis"]}