{"id": "fbd4d0e0e08992e75b70db2092cb6aeb", "url": "https://www.bonappetit.com/story/louis-hunter-george-floyd", "year": 2020.0, "month": 5.0, "day": 5.0, "content": "I Nearly Went to Prison for Philando Castile. I Closed My Restaurant for George Floyd. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Nearly Went to Prison for Philando Castile. I Closed My Restaurant for George Floyd.Minneapolis restaurant owner Louis Hunter wants justice for the Black community. “We have no peace.”By Louis Hunter, as told to Priya KrishnaMay 29, 2020FacebookTwitterEmailPHOTO BY CARINA LOFGRENFacebookTwitterEmailOn Thursday, May 28, protesters marched through Minneapolis to demand justice for George Floyd, who was killed by police on Monday, and the countless other Black people who have been victims of police violence. Several restaurants in Minneapolis shuttered for the evening to stand in solidarity with the Black community, including Trio, a plant-based soul food restaurant. Trio’s owner, Louis Hunter, was a cousin of Philando Castile, who was killed by a police officer in 2016. When I saw Trio post on its Instagram Story that it was closing down for the night, I called Hunter to see if he wanted to share his thoughts. Here’s what he told me over the phone, the morning after the Thursday-night protests. —Priya KrishnaGeorge Floyd. Hearing it, seeing it—my body, my mind, and my soul were devastated. It took me back to when Philando Castile was killed by a police officer in 2016.  Castile was my cousin. When he was killed, I attended a protest in Saint Paul, and the next day I was facing 20 years in prison. I was accused of throwing a Molotov cocktail at the police. I fought that case for two and a half years and with the help of my community, I beat the charges. That’s how I was able to open my restaurant, Trio.Since the pandemic, I have been doing takeout and delivery. But last night I closed down because I wanted to be in solidarity with my community. I didn’t want to keep my restaurant running knowing that a man had just died. I just had to stand back for a minute.Floyd worked in the restaurant industry.  As Black people working in the restaurant industry, our food is soul. You have so much love for people. For Floyd to be working in the restaurant industry, he had to be a people-server. He was a good person.Me and my family rolled through the protest last night, just watching things happen. I saw anger and hurt. I got out in Minneapolis, but I didn’t get out in St. Paul. It just brought back those memories of what I went through—going to a protest and getting accused of something I didn’t do. It was scary and overwhelming, so I stayed away.Louis Hunter, outside of his restaurant Trio in Minneapolis.\nPHOTO BY CARINA LOFGRENToday, I will be dropping off a box of sanitizer for everybody out there. If I had the money to feed them I would. But we are a small business, and I don’t have the funds. Also, we are going through a pandemic and a recession.We don’t want to see nobody get hurt. We just want to make sure we get justice. Justice for me is being treated equal. It is knowing I can be out at midnight on a dark street and not get killed by a police officer. Every time a police is in our vicinity, we get nervous and scared. We need peace. We have no peace. I watch these commercials at 1:20 in the morning saying, “Feed this homeless dog, take care of this homeless dog,” and guess what? A dog’s life is valued more than my life. It is sad to say.Today we have a meeting with other Black-owned restaurants in the city. I want us to come together and see what we can do for the community. I would like us to give back, to help clean up after the protests, to unite in some way. I can’t grasp what that is right now. We just need to strategize on how to save lives. As for me, I am going to put a Floyd burger on the menu, price it so a lot of people can afford it, and send some of the proceeds to Floyd’s family.I’ve been thinking about the many other people who have been killed by police. As a Black man, this is something I have witnessed all my life. We have been through this so much. Sometimes we don’t even know what to say because the hurt is so bad. How do you come up with solutions so quickly when you are in pain? That is why it is hard for me to even say where I am going to go from here. I don’t know. All we want is to be treated like humans. We want to live. That is all we want.Floyd was a brother of mine. We didn’t have the same mother or father, but he is still a brother of mine. I have a picture of me and Philando in the window of the restaurant, and now George Floyd’s name is written there as well.If you'd like to support Trio, you can donate via the restaurant's GoFundMe.Explore Bon AppétitMinneapolisFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-29", "author": ["Condé Nast", "Louis Hunter", "As Told To Priya Krishna"]}