{"id": "fbd8ee1d20a1ef1f7541d5d5c48c3d06", "url": "https://www.bonappetit.com/story/quinta-brunson", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "‘Kid of the Internet’ Quinta Brunson Wants Us to Keep Growing (and Growing and Growing) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle“Kid of the Internet” Quinta Brunson Wants Us to Keep Growing (and Growing and Growing)The comedian and author on coming of age on the web, adobo wings, and writing her first memoir.By Leigh-Ann JacksonJune 15, 2021FacebookTwitterEmailPhotograph by J Squared PhotographyFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.In Person of Interest we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Quinta Brunson, comedian, actress, viral video star, and author of the new memoir She Memes Well.For the past seven years, Quinta Brunson’s largely been recognized as the delightfully awestruck Girl Who’s Never Been on a Nice Date, her first foray into online comedy back in 2014. Clips of her have since been shared millions of times, whether it’s her deadpan rendition of the Space Jam theme song, or the spat between her and her disgruntled eyebrows from the Facebook Watch series Quinta vs. Everything. But just as the social media landscape has evolved over the past decade, so, too, has Brunson.Offline, the 31-year-old West Philadelphia native has spring-boarded to television, doing voice work for animated series like Big Mouth and Lazor Wulf. In 2019, she made her HBO debut as a cast member of the Emmy-nominated A Black Lady Sketch Show; her new workplace sitcom, Abbott Elementary, is set to air on ABC later this year; and her latest project, a memoir titled She Memes Well, reveals a series of relatable missteps and milestones designed to show her fellow “kids of the internet” what it looks like to keep going and growing, IRL.She Memes Well: Essays$25 $12 at Amazon$25 $23 at BookshopBrunson’s also dedicated to making strides in the kitchen. In one of the book’s essays, “On Cooking,” she owns up to her lacking culinary skills. “I hold cooking on this pedestal that unlocks the necessary elements for me to be a grown woman,” she writes. “I don’t think I can be as strong a performer or worker if my home life isn’t strong.” Since moving in with her fiancé in Los Angeles, she’s committed herself to cooking dinner at least once a week, despite the fact that, as she wrote, working in the kitchen scares her “more than public speaking, nuclear war, and leaving [her] phone in an Uber combined.”On a phone call, I learn Brunson’s every bit as straightforward and down-to-earth as she seems online. In the run up to the book’s June 15 release, we chat about her quest for meal-making mastery, her biggest hometown hankerings, and the importance of establishing boundaries in comedy.Somebody once told me… there’s a difference between a comic, a comedian, and a clown, and you have to choose which one you want to be in your career. With a clown, it’s like: “Be silly for me!” Being a comic is about controlling the narrative coming out of your life. And being a comedian is about seeing the funny in everything. I’ve said to myself: “I’ll live between comic and comedian, but I’ll never be a clown.”I am a human being… and not my work. I made a decision early on that my life would not be my product. I’ve set a boundary for myself: I’ll give people the work, which was made with the intent to make them happy and laugh. I have no opinion on people who are their work, because that serves a purpose in and of itself. But I knew for me, that approach was not going to work.For all the bad on the internet… I think there are people on there doing amazing things. Look at Will Smith and Leslie Jordan—these actors who have found new ways to connect with new audiences on social media. I’m, like, 47 in Internet years, so my focus is not set on the new, emerging platforms. I simply couldn’t grasp TikTok as a creator. It wasn’t clicking for me. But I can’t ever say that I’m fully taking it off the table. I think the internet is ever-evolving.It took me about three years to write my book… and “author” me is irritable! It took so long because of how much I would procrastinate. My other work flows out pretty easily, but the book was a bit more difficult. Figuring out what I wanted to put out there about myself forever was daunting at times.I want to get more creative with cooking… in the same way that I am with other areas of creativity in my life. I have a limited toolkit of recipes that I know will work. I’ve got baked chicken wings down; adobo, pepper, and garlic salt. I got the recipe from my mom and when I made it for her, she was proud of me. My dad makes collard greens very well and I’ve started experimenting with them, too. Just like: “What would lemon taste like on this? What if I add a little bit of garlic?” But I want to get so free that I can just throw things together and look like I’m in “Ratatouille,” just throwing down!When it’s cook’s night off… I used to Postmates the Mexican Pizza from Taco Bell, until they got rid of it. I have no idea why they did that! It wasn’t hurting anyone! I’ve @’ed them on social media twice now, to no avail. My goal now is to get so famous that I have some type of pull over Taco Bell.The Philly food I miss most is… Herr’s Sour Cream & Onion potato chips. I either get those delivered to me from Amazon, or friends will send them to me. Recently, though, CVS stores in L.A. have started carrying them, but for some reason they taste different here. A dirty corner store in Philly, that’s where you get the best tasting bags. It’s safe to say I also miss cheesesteaks and pretzels. Philly does a soft pretzel exceptionally well. It’s part of the culture there. Another thing that I miss more than anything is hoagies. The closest I can get here is Jersey Mike’s. But sandwiches made on an Amoroso’s roll—which are made in Philly—just taste different. And there’s something about the corner stores and the person who makes the hoagie—it all matters.Explore Bon AppétitHealthyishPerson of InterestInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-15", "author": ["Condé Nast", "Leigh-Ann Jackson"]}