{"id": "fbe3c3ae9f3ea8e4c1696a5a642cb331", "url": "https://www.bonappetit.com/story/purefish-seafood-delivery", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "Buying Sustainable Fish Just Got a Whole Lot Easier (and More Delicious!) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Finally Found a Way to Buy Sustainable Fish OnlinePureFish is better for my mom brain—and the planet.By Devorah Lev-TovMay 21, 2021FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!As a working mother living in New York City, I’m proud of myself for getting any dinner on the table, even if that’s gloops of iridescent orange mac and cheese from a box. But when I manage to serve my husband and son fish—known to be exceptionally healthy and filled with calcium, protein, vitamins, and the all-important omega-3 fatty acids—I feel like a supermom.To be clear, cooking the fish is easy enough. It’s the buying bit that’s complicated. Seafood is a murky industry rife with problems: mislabeled fish at markets and restaurants; farmed versus wild and which is more sustainable (Both? Neither? I still don’t know); overfishing and species depletion (horrifyingly, scientists have theorized that our oceans could be fishless by 2048!); and all those essentially nonrecyclable, plastic-wrapped Styrofoam trays (the most popular packaging choice for seafood, meat, and poultry). With all of that to consider, what’s a supermom to do?The answer to my plea came in January when a PureFish Rainbow Box landed on my doorstep. The San Diego–based company, which stocks restaurants like Soho House (nationwide), Lionfish in San Diego and Florida, and Wynn in Las Vegas, had just launched its direct-to-consumer arm, promising to deliver the same “fine dining quality sustainable seafood” to homes across the U.S.As I unboxed my jewel-toned haul of shrimp, salmon, tuna, and striped bass, the first thing I noticed was the packaging: no Styrofoam in sight! Each fleshy cut of fish was packed in oven-ready recycled aluminum trays—and those trays were nestled in packing insulation made from recycled cotton and denim that’s sourced from places like Goodwill. Even though the last few years have seen a switch to paper takeout containers and coffee cups (thanks to plastic and Styrofoam bans in some cities and states) and paper crinkles instead of packing peanuts, Styrofoam—which makes up 30 percent of landfills worldwide—is still the norm for raw meat, poultry, and fish. Along with ditching Styrofoam, PureFish claims it uses less single-use plastic than you’d typically find in other fish packaging.But it wasn’t only the environmentally friendlier outside that enamored me. Inside, each tray held two frozen, fully-trimmed, and ready to cook center cuts (as opposed to cuts from near the head or tail of a fish, where there’s less flesh). I’ve always been skeptical of frozen fish because it seems like it just wouldn’t be as fresh, but PureFish shock-freezes its fish as soon as they’re caught—and each one I tried was delicious. I also loved that the fish is thoughtfully sourced and fully traceable, as I discovered when I scanned the QR codes on each tray that let you “meet the fisherman.”After lightly seasoning and searing some thawed tuna fillets to serve with a soy-ginger sauce and charred bok choy, my family and I dug in. It was tender, flavorful, and delicious. Better yet, I’d finally found a way to buy fish I felt fully good about—even if I still couldn’t convince my son it was better than boxed mac and cheese.The Rainbow Box$250 at PureFishExplore Bon AppétitHealthyishHealthyish Loves ItShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-21", "author": ["Condé Nast", "Devorah Lev-Tov"]}