{"id": "fbe9a4f8b044d8c4d09d8bc0a51e3e5a", "url": "https://www.bonappetit.com/story/use-the-whole-peach", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "These Clever Peach Preserves Will Make the Most of the Whole Fruit—From Skins to Pits | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Use the Whole Peach, From Skins to PitsThis is your last chance for peaches—so use them wisely.By Ozoz SokohSeptember 4, 2020FacebookTwitterEmailPhoto by Ted CavanaughFacebookTwitterEmailPeaches are my emblem of this summer past, and I am smitten. But since I got to them a bit late this season, I’m determined to hold on to some of the summer sun long into fall and “orange season.” And what better way than to up my preserving game?Here are a few ways to bottle the last days of summer for remembering fondly when the autumn days glow amber.The skinFor me, the experience of a peach is in that first bite into soft, juicy fruit, my nose full of the delicate fragrance of summer. But many recipes—for filling pies, making preserves, and poaching gently—call for skinned peaches: peaches with Xs cut into bottoms, dunked in boiling hot water for a scant minute, cooled in ice water right after, skins shimmied off.This year, I used that skill to skin everything from plums to tomatoes. But because I didn’t consider it an option to get rid of those skins while preserving a couple of kilos of the fruit, I dried and blitzed them into flakes and powders.Peel the peaches, then top them with buttermilk and ginger syrup.\nElizabeth CecilI started with ripe peaches (unripe ones are reluctant to let go of their skins, trust me, I tried). Once they were blanched and peeled, the first step was to dry out their skins. I laid them out in a single layer on paper napkins, then microwaved for two minutes on the quick start setting, typically high heat. A tip I learned as I went: Let the skins sit for 30–60 seconds before you conclude whether or not they are crisp enough. If they aren’t crisp, put them back in for a couple of 30-second cycles.Once dry and brittle, I admired their rose-petal looks and floral scent before I blitzed them down in my spice grinder. The skins of 15 medium peaches gave me 2 teaspoons powder. And still, I’d say it was worth the trouble! I added a scant ⅛ teaspoon fine sea salt to the blend, which was perfect over vanilla ice cream with a splash of olive oil. Next destination? Coating balls of cookie dough just before baking.Even if you aren’t making preserves, peach skin powder might be up your alley if you have haptodysphoria—a dislike for fuzzy fruits and surfaces like peaches, velvet, and velour. (Or just wet the fruit and rub off the fuzz with a clean dish towel.)The fleshI cut my skinned peaches into quarters (I saved the pits for noyaux—see below!) and piled them into a sterilized jar, peppered with thick slices of green jalapeños. I poured over a sweet syrup—1 part white sugar to 3 cups water, brought to the boil then simmered for 6–7 minutes, till slightly reduced and syrupy.Once jarred, I kept them in the fridge. (You can process them for longer-term storage if you’re willing to let go of them so quickly.) I will try them in a few weeks when the days get shorter and the glow of autumn is upon us, sliced into a salad, gently stewed to make a compote of sorts, and as part of a cheese board.Try adding your own seasonings—cinnamon, lemon peel, vanilla, peppercorn—to Canal House Peach Jam.\nHirsheimer & HamiltonThe pitsNoyaux, the French word for cores, refers to the almond-like kernels nestled within the pits of stone fruits, from apricots to nectarines, plums to cherries, as well as to the extract and liqueur made from them. The kernels’ almond-esque essence (which is the result of a chemical compound called benzaldehyde) is a beloved centuries-old European flavor and fragrance. Even foods that you might associate with almonds—marzipan, amaretto, bitter almond extract—are actually made with stone fruit pits. And there are hundreds of other ways to use them too.As alluring and complex as the flavor and fragrance of stone fruit kernels, they contain a small amount of amygdalin, a compound that can be broken down by intestinal enzymes into poisonous cyanide. Don’t let this scare you, though: You’d have to consume a lot of noyaux to feel the effects, and roasting them can help neutralize the amygdalin. To safely extract flavor without putting oneself in harm’s way, I recommend applying heat twice: first to the pits, and second to the noyaux, the kernels.Toast the pits in a dry pan on low to medium heat, stirring often, or in a 350° F oven, checking and tossing frequently, for 12–15 minutes. This process will make the pits brittle so that it's easier to get to noyaux.Once the pits have cooled down, head outside with a mallet or hammer, a bowl, and a kitchen napkin. Find a safe spot where you can—pit by pit, wrapped in the towel—smash each one till it cracks to reveal the treasure within: the singular noyau.With all the noyaux unearthed, decide what you want to do next. There are two camps of noyaux-makers: those who believe in making the extract with raw noyaux, kernels roughly chopped, to capture the natural taste; and those who believe in toasting again, using the same method as you did for the pits, but shortening the cooking time to about 10 minutes, to make doubly sure that you’ve rid them of any lingering amygdalin. I am in both camps—some might say undecided. As it’s my first time making it, I’d like to do a comparison. Taste report in the winter? I say yes.My preferred preservation technique is to steep the kernels in vodka, like I would vanilla pods—15 to 20 per 1 cup of plain vodka. In a few months, ankle-deep in winter, I’ll pull that bottle out from the cold, dark cupboard where it’s been hibernating and I’ll be blessed with an extract that holds the delicate scent and flavors of summer past in every teaspoon. I’ll use it in my dense fruitcakes and other bakes, in soft cream, in every winter drink, be it a mug of hot apple toddy or mulled wine, for a sweet and floral freshly-baked scent with whiffs of almond, vanilla, and the lightest lacing of citrus.Next summer I’ll start early, eating and baking all the stone fruit I can, and saving the pits in a bag in my deep freezer for the last days of August.Ozoz Sokoh, The Kitchen Butterfly, is a Nigerian-born exploration geologist turned food-obsessive who uses foodways to explore personal narratives of history and heritage, culture, identity, and belonging. These days, you’ll find her in her kitchen in Mississauga, Canada, thinking up ways to make the most of produce scraps.Explore Bon AppétitPeachPreservingSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-04", "author": ["Condé Nast", "Ozoz Sokoh"]}