{"id": "fbed4ffb9dcf7f05d9f8c7bfb91a6716", "url": "https://www.bonappetit.com/recipe/salsa-verde-o-roja-cruda", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Salsa Verde o Roja Cruda Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueSalsa Verde o Roja CrudaBy Rick MartinezAugust 18, 20205.0(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrint“What’s the ideal way to use up a looooot of leftovers?” wonders Rick Martinez. “Tacos—which you can make out of just about anything as long as you have a highly versatile salsa to pull it all together (even when it means week-old fried rice or a few surplus meatballs).” And this standby recipe, using peak-season tomatoes in the summer or tomatillos the rest of the year, is it. Plus, it lasts five days in the fridge or up to a month if you freeze it.Ingredients12oz. tomatillos (about 8 medium), husks removed, rinsed, quartered, or 12 oz. tomatoes, cored, quartered½medium avocado (optional; for making salsa verde)¼medium white onion, coarsely chopped1garlic clove1serrano chile, coarsely chopped¼cup (packed) cilantro leaves with tender stems1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more1–2Tbsp. fresh lime juice (optional;  for making salsa roja)PreparationStep 1If making salsa verde, blend tomatillos, avocado, onion, garlic, chile, cilantro, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a blender on medium-low speed until salsa is smooth. Taste and season with more salt if needed. (Do not blend on higher than medium speed or your salsa will be airy and taste like a smoothie.)Step 2If making salsa roja, blend tomatoes, onion, garlic, chile, cilantro, 1 Tbsp. lime juice, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a blender on medium-low speed until salsa is smooth. Taste and season with more salt and lime juice if needed.Step 3Do ahead: Salsa can be made 2 days ahead. Transfer to an airtight container; cover and chill.How would you rate Salsa Verde o Roja Cruda?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI LOVE this recipe! Rick's food reminds me of home and my days growing up with my cousins in my grandma's house. I'll be \"pulling a Rick\" later today and actually freezing some - while the produce is fresh - for my winter salsa cravings. Adding the avocado to the tomatillo crudo makes for a creamier salsa, while the \"crudo\" tomatillo avoids having squishy, melty, cooked tomatillos (because they basically disappear in the oven when cooked). This is a great salsa that anyone can expand on, or eat as-is because it's perfectly simple. I would - and definitely will - make again.Allie LDenver, CO9/29/2021Thank you, RMartinez, you are a blessing! I grew up in Tucson where there is so much amazing variety of Mexican cuisine that I never learned to cook it for myself. You have revealed the secret to the salsa verde from my favorite restaurant! (La Parilla Suiza in Tucson  - alas, I am trapped in rural Oregon for the pandemic and I don't feel all that sorry for you in Mazatlan.) This tomatillo-avocado panacea is SO delicious, I drank an entire batch in one sitting, Salud, amigo!TroutappleTucson9/11/2020I rarely make my own salsa, but though it would be fun to make the salsa roja with some fresh summer tomatoes.   Totally delicious! Tasted like a perfect restaurant style salsa. Awesome with some tortilla chips. Definitely use the lime juice! Philadelphia, PA9/9/2020Explore Bon AppétitCondimentSalsaMexicanLatin AmericanTomatilloVegetableAvocadoSerrano ChileChileCilantroHerbs & SpicesEasyQuickGluten-FreeNut-FreeDairy-FreeVeganVegetarianKetoHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Rick Martinez"]}