{"id": "fbf90f207198d79a827ff74c1186cb48", "url": "https://www.bonappetit.com/recipe/salad-for-breakfast", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Salad for Breakfast Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueSalad for BreakfastBy Chris MoroccoJanuary 9, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintEggs on toast goes veggie-centric with quick-pickled veg and marinated feta. Everything except the croutons can be made ahead, and any weekday can start off this colorful.Ingredients4 servings4large eggs1teaspoon kosher salt, plus more1tablespoon sugar1teaspoon ground turmeric½cup plus 2 tablespoons unseasoned rice vinegar2cups chopped crunchy vegetables (such as cucumbers and radishes)¼sweet onion, very thinly sliced8ounces feta, cut into thick slices¼cup extra-virgin olive oil, plus more for drizzling4slices sourdough bread, toasted, cooled8cups lettuce leaves, torn if largeGround sumac (for serving)PreparationStep 1Gently lower eggs into a medium saucepan of boiling salted water and cook 6½ minutes. Transfer eggs to a bowl of ice water with a slotted spoon and let cool until just warm. Peel and set aside.Step 2Meanwhile, whisk sugar, turmeric, ½ cup vinegar, 1 tsp. salt, and ½ cup water in a medium bowl. Add vegetables and sweet onion and let sit until slightly softened and pickled; ideally you want these to sit at least 1 hour, but if you are short on time, 10 minutes and massaging gently to soften a bit will get the job done.Step 3Place feta in a small bowl and drizzle with ¼ cup oil and remaining 2 Tbsp. vinegar. Let sit at least 5 minutes.Step 4Drizzle toast with oil and tear into large pieces. Place in a large bowl with lettuce. Drain pickled vegetables and add to bowl. Drizzle marinating liquid from feta over, season with salt, and toss well.Step 5Cut eggs into quarters. Divide salad among plates; top with eggs and marinated feta and sprinkle with sumac.Step 6Do Ahead: Eggs can be made and vegetables can be pickled 4 days ahead; cover and chill. Feta can be marinated 1 week ahead; cover and chill.How would you rate Salad for Breakfast?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladEggTurmericHerbs & SpicesCucumberVegetableRadishFetaCheeseLettuceLeafy GreensQuickEasyNut-FreeVegetarianHealthyishBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Chris Morocco"]}