{"id": "fbfdb451a8f4c73f6eaeb19b7f96154d", "url": "https://www.bonappetit.com/story/blueberry-compote", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "This Blueberry Compote Helps Me Bring a Little Summer Into Sweater Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Blueberry Compote Helps Me Bring a Little Summer Into Sweater SeasonIt’s always berry season when I've got a bag of frozen blueberries in my freezer.By Christina ChaeySeptember 24, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'Mytrek BrownFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.If you asked me which cookbooks I’ve gone back to most often in the last couple of years, Amy Chaplin’s ‘Whole Food Cooking Every Day’ would be high on that list. The book is packed with hundreds of gorgeous and nutrient-packed recipes that are gluten-free, sugar-free, and dairy-free. And while I am none of those things—I assure you I am full of gluten, sugar, and dairy—I love to consult it whenever I want to add a few more fruits, vegetables, legumes, and whole grains into my diet.One chapter of the book is devoted entirely to “Simple Compotes,” with recipes to turn virtually every fruit from quince to plums into a quick stovetop compote for spooning over morning oats or yogurt. That’s where I got the inspiration for this freezer blueberry compote, which I make any time I miss eating fresh berries.So what is compote? Think of it as jam’s chunky cousin, a mix of gently-cooked fruit and sugar with pieces of fruit intact. My general formula is this: cut-up fruit (not necessary with smaller things like berries), a splash of water, a bit of sweetener like maple syrup or sugar, whatever spices I desire, and maybe a hit of acid like fresh lemon juice for brightness. If I make a cup or two of compote on a Sunday, I’ll store it in the fridge and use it to jazz up a week’s worth of oatmeal, overnight oats, yogurt, whole grain pancakes, or waffles.Here’s how to make it: Bring a 10-ounce bag of frozen blueberries, 1 tablespoon pure maple syrup, a wide strip of lemon zest, a shake of ground cardamom, and ¼ cup water to a boil in a small saucepan. Reduce heat to low and simmer until berries have burst, about 8–10 minutes. Stir 1 teaspoon cornstarch and 1 tablespoon water together in a small bowl to dissolve cornstarch, then whisk it into the blueberry mixture. Simmer until the compote is nicely thickened, another minute or two. Remove from heat and stir in 1 teaspoon fresh lemon juice. That's it!Pro tip: If you feel like a splurge, it’s worth making this with frozen wild blueberries such as Wyman’s of Maine, which are smaller than their cultivated peers and have a more intense berry flavor that reminds me of the dried blueberries in Blueberry Morning (the best cereal, IMO). No matter what kind of fruit you use, and whatever the season, this compote formula is here to help bring a little bit of sunshine into your life. Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-24", "author": ["Condé Nast", "Christina Chaey"]}