{"id": "fc02e59e1e57be1e750b55a6c88210c8", "url": "https://www.bonappetit.com/story/sweet-potato-ideas", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "5 Sweet Potato Ideas to Shake Up Your Routine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersculture5 Ways to Zhoosh Up the Sweet Potatoes in Your PantryIn uncertain times like these, stocking up on sweet potatoes is a sure bet.By Aliza AbarbanelAugust 20, 2020FacebookTwitterEmailFacebookTwitterEmailEven when I’m not stocking my pantry for the unforeseeable future, sweet potatoes occupy a permanent place on my grocery list. I can rely on the humble root vegetable to quietly hang out at the top of my cupboard (my designated “cool, dry place”) for weeks, then use it in any meal that needs extra heft. Seriously: I’ll mash steamed sweet potatoes into oatmeal if I feel like it!But sweet potatoes aren’t just a versatile addition to soups and grain bowls. Lately, I’ve been bringing them to the center of my plate, deploying a few techniques and toppings to make each dish feel fresh—no mini marshmallows allowed. Here, five ways to transform a sweet potato from the side dish into the main event.Roast ’em twiceTwice-roasted potatoes get the best of both worlds: crispy burnished skins and pillowy insides. Start by scrubbing 4 small whole sweet potatoes and arranging them in a large heavy ovenproof skillet, preferably cast iron. Pour in water to just barely cover the bottom of the pan, then cover tightly with foil and bake on the bottom rack in a 400° oven until sweet potatoes are tender, 30–35 minutes. Transfer to a cutting board and let cool slightly; reserve skillet. Slice sweet potatoes in half lengthwise. Meanwhile, return reserved skillet to oven and heat 20 minutes. Remove skillet from oven (watch that hot handle) and swirl 2 Tbsp. unsalted butter in pan to coat, then arrange sweet potatoes cut side down in pan and roast until edges are browned and crisp, 18–25 minutes. It’s a little bit extra but a lot delicious.Consider the steamerI’m not coming for your oven! I’m just here to say that steaming has its merits. The gentle hands-off method is quicker than roasting and yields perfectly fluffy, moist potatoes. I especially like to do this to Japanese sweet potatoes, which have a pleasing purple skin and extra starchy white interior that becomes soft and pudding-y after a blast of steam. At this point you can eat them right away, keep them in the fridge for a few days, or split them down the middle to crisp up in a cast-iron skillet with a bit of ghee. Top with a generous dollop of peanut butter, tahini, or any green sauce in the fridge and call it dinner.Raid the spice cabinetYou don’t have to wait until after cooking to start layering in flavor, and I’m not just talking about salt. If you’re roasting cut sweet potatoes like wedges or fries, toss the pieces with a generous amount of oil (to conduct heat and promote caramelization) and ground spices like coriander, smoked paprika, and cumin.Upgrade your butterThe only thing better than topping a toasty potato with a pat of butter? Spiking that butter with hot honey, Calabrian chiles, harissa and fresh mint, or perhaps an ultra-savory mashup of lime juice, tahini, soy sauce, and sesame oil. All of these compound butters bring in bold flavors to contrast a sweet potato’s natural, well, sweetness.Don’t skip a sauceServe burnished sweet potato halves atop a swipe of garlicky toum, top them off with a drizzle of salty-tart ponzu sauce, or finish off the bottle of vinaigrette in your fridge door.Put it over the top(ping)Nobody craves a plain sweet potato for dinner. Make it a meal by adding some kind of protein—marinated lentils and torn citrus, crisped ground lamb and sautéed mushrooms—then add a savory sprinkle for extra flavor, textural contrast, and fun. I’m talking about what the BA test kitchen affectionately calls “crunchies”: hazelnuts toasted with sesame seeds and whole spices, pepitas sizzled in butter, or even quick-pickled onions and fennel.Some combos we loveFried scallions + flaky saltAny nut butter + jellyCrispy chickpeas + whatever herbs blitzed into a sauceYogurt + tamarind chutney + cilantro + nigella seedsBlack beans + Monterrey JackChimichurri + queso frescoLentils + pickled red onionsChopped pecans + honeyWant more sweet potato recipes?1 / 46ChevronChevronRoasted Sweet Potatoes with Miso-Tahini SauceView RecipeExplore Bon AppétitSweet PotatoCoronavirusRead MorecookingHow to Turn One Blender Sauce Into a Week’s-Worth of Delicious MealsBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-03", "author": ["Condé Nast", "Aliza Abarbanel"]}