{"id": "fc0a68f58fcd57118f7af6dbc21c34d2", "url": "https://www.bonappetit.com/recipe/jammy-soft-boiled-eggs", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Jammy Soft-Boiled Eggs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2017 IssueJammy Soft-Boiled EggsBy The Bon Appétit Test KitchenDecember 16, 20204.4(156)Read ReviewsTriangleEmailPinterestPrintTed CavanaughEmailPinterestPrintEmailPinterestPrintTopping practically any dish with a perfectly cooked egg makes it that much better, which is why we have this jammy soft-boiled egg recipe memorized. Save your astonishment: All it takes is boiling water and six and half minutes. Yup, that’s the magical number for an egg with a completely cooked white and a firm but gooey yolk that you can add to any bowl of ramen, salad, flatbread—or eat on its own with a dollop of spicy mayo and relish.Notably, you don’t have to wait for the eggs to come to room temperature before cooking them in this jammy egg recipe. You can take them out of the fridge and lower them (carefully!) straight into the pot as soon as the water begins to simmer. Just remember: The eggs will continue to cook once removed from the water if you don’t cool them immediately in a bath of cold (preferably ice) water. This will also make them easier to peel and eat because they won’t be piping hot. See? Easy!Editor’s note: This recipe was originally published on March 21, 2017.Ingredients4–8 servings4–8large eggsPreparationStep 1Bring a large saucepan of water to a boil over medium-high heat. Using a slotted spoon, carefully lower eggs into water one at a time. Cook 6½ minutes, adjusting heat to maintain a gentle boil. Transfer eggs to a bowl of ice water and chill until just slightly warm, about 2 minutes.Step 2Gently crack eggs all over and peel, starting from the wider end, which contains the air pocket.Step 3Do Ahead: Eggs can be cooked and peeled 3 days ahead. Store airtight in the refrigerator.Nutrition Per ServingFor 4 servings 1 egg per serving: Calories (kcal) 80Fat (g) 5  Saturated Fat (g) 1.5Cholesterol (mg) 185Carbohydrates (g) 1 Dietary Fiber (g) 0 Total Sugars (g) 1Protein (g) 6Sodium (mg) 60 How would you rate Jammy Soft-Boiled Eggs?Leave a ReviewTell us what you thinkReviews (47)Back to TopTrianglePerfect for a soft boiled egg and best eaten while still warm.  For a jammy egg that can be eaated chilled, I will try the 7 minute cooking time.  I also found the egg a little hard to peel so will add the salt and vinegar next time.PattieCamas, Washington3/13/2022Used them in Ramen recipe.  They maintained their \"jaminess\" beautifully. DaveyG West Hartford CT 1/6/2022This was my first time cooking the eggs at a boil for the duration. I followed the directions perfectly and wound up with very soft boiled eggs with a slightly runny white also, which I am not a fan of. Maybe 7 minutes would work better like some commenters said, but the recipe as is didn't do turn out right. DezCA12/30/20217 minutes was PERFECT. Easy to peel and best jammy eggs I’ve ever made. AbbeyCleveland, OH12/23/2021Delish…but I’m gonna try Sofia’s tip from 7/23/21 next time…peeling was a disaster and I hate seeing egg whites come off on the shell 😡MindiLos Angeles, CA11/4/2021So good, reminds me of a poached egg only easier to cook and store😊AnonymousCentral PA10/7/2021This is a great recipe. Remember that elevation will play with your times. I personally suggest doing a test egg and then adjusting the time. I like my yolks really runny but the whites are solid, 10 seconds too little or too long can make all the difference between a perfect egg or one that is either too jammy or slightly undercooked whites.DeanLewis County, WA8/28/2021So perfect, I did 7 min and. Next time I would do 6.5 just to make them a little more runny.  These were so nice!\nDeblovesfoodPortland 8/4/20216.5 minutes wasn't quite enough for me, but 7 was perfect.  A tip: add a bit of salt and vinegar to the water to make for easier peeling!SofiaWashington, D.C.7/23/2021Absolutely perfect! Thank you, I can’t wait to make them again. TheresaHouston7/20/2021These come out just right...I came across this in Richard Olney's \" Simple French Food,\" btw, long ago. Makes great egg salad on crusty bread brushed with garlic. Mmmn.kgwLong Beach, CA7/15/2021Since my eggs were coming out straight out of the fridge, I followed the suggestion of boiling for 7 min. They turned out perfect!!BubgummyTennessee7/8/2021The simple method taught to me by my French-Belgian grandmother skips the ice bath, extra bowl, and peeling underwater, etc. Just put the eggs in a small pan, cover with water, turn heat to high. The moment it hits a real boil, immediately cover and remove from heat. Set a timer for 14 minutes for hard-boiled, 12 minutes for softer. When the timer goes off, drain the hot water, cover with cold water and gently swirl the water for about 30 seconds, then remove eggs from the water. The  retained heat cooks the eggs perfectly whether straight from the refrigerator or at room temperature. Boiling the eggs for any amount of time can easily overcook the eggs or risk green-rimmed yolks. TheresaOakland, CA4/12/2021This is to the \"Anonymous\" know-it-all who stated it's just a soft boiled egg, not rocket science, you obviously don't know your cooking terms.  The whole reason for this recipe is that the difference between heat and 30 seconds can change this from being too underdone to God forbid, hard-boiled.  \n\nThat being said, this has a lot to do with your stove, how much water and eggs you are cooking.  I found rapidly boiling water for 7 minutes works to my liking.  Faith AngeliLos Angeles, CA3/19/2021Worked perfectly for me. Took the eggs straight out of the fridge, boiled my water, then put the eggs to boil for 6.5 mins and iced for 2. Super easy straight forward. Eggs came out exact as described. Was jammy texture and not runny like a soft boiled.  Thanks!CamChicago, IL2/25/2021Explore Bon AppétitEggEasyQuickSnackDairy-FreeGluten-FreeVegetarianNut-FreeKetoHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-03-21", "author": ["Condé Nast", "The Bon Appétit Test Kitchen"]}