{"id": "fc1086bdb2fdc304fba18d09860aea56", "url": "https://www.bonappetit.com/story/beans-shirt-world-central-kitchen", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "We Made a Shirt to Thank All the Beans—And to Raise Money for World Central Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureWe Made a Shirt to Thank All the Beans—And to Raise Money for World Central KitchenPlus, more new spring-y merch! By The Bon Appétit StaffApril 22, 2020FacebookTwitterEmailPhotos by Laura MurrayFacebookTwitterEmailWho would have thought the humble bean would be the iconic ingredient of the moment? We’re honoring the pintos, mayocobas, limas, and garbanzos of the world with a tribute T-shirt, one of several new items we just added to our little merch shop. 100 percent of the net proceeds from the sale of these Beans tees will go to support the inspiring, critical work happening over at World Central Kitchen in the face of COVID-19: providing fresh meals to those in need, putting restaurants back to work, and feeding frontline healthcare workers.Looks good, right?\nWhat else is new in the shop? Well, we’ve re-stocked some old favorites in fresh, spring-y colorways, and we’ve added a GIANT new tote for your next contactless grocery (or wine) run. Our amazing staff photographer Laura Murray took pictures, from a safe, six-foot distance, of the BA staff sporting the latest gear. Head over to our shop to get your merch!New items besides the Beans tee!Photo by Laura MurrayDo You Have Any Natural Wine (Totes)?We designed our dream bag, made in Los Angeles by the folks at Everybody.World: sturdy-but-soft cotton, two built-in interior wine sleeves, and a big, comfy strap. This guy is roomy enough to carry a haul of groceries, a couple bottles of wild-fermented who-knows-what, and a small animal.Looks good, right?\nThe Iconic Claire Shirt—Now in Pink and PurpleOur homage to the queen, Claire Saffitz, and her stunning streak of silver hair. Now available in two new colors we’ve named Pink Radicchio and Ube, because clearly we have too much time to think about these things.Fresh Shades of The Test Kitchen ShirtOur best-selling shirt showing the layout of the BA Test Kitchen, now in colors we call Chimichurri (green) and Soft Scramble (yellow).And LOTS of New Colors of Our Classic BA ShirtDoes our logo in spring colors look more sweet?Explore Bon AppétitCoronavirusShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-22", "author": ["Condé Nast", "The Bon Appétit Staff"]}