{"id": "fc13db5bfad3fa5a7402e7f3993d884b", "url": "https://www.bonappetit.com/story/slow-roasted-fish-white-beans", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "The Slow-Roasted Fish That Packs a Lot In One Baking Dish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Slow-Roasted Fish That Packs a Lot In One Baking DishYou’ve got fish. You’ve got beans. You’ve got olives. You’ve got: dinner!By Rachel KartenSeptember 26, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue LiFacebookTwitterEmailIf there was a “Slow-Roasted Fish Fan Club” I’d be the president. I make this Healthyish slow-cooked white fish with charred cabbage at least once a week. And Alison Roman’s slow-roasted salmon is as easy as it is impressive. And now I have a new recipe to add my slow-roasted arsenal: Claire Saffitz’s Roast Fish with Cannellini Beans and Green Olives.This throw-together dinner uses pantry staples like canned beans and lemons. But don’t let the humble ingredient list fool you—what you end up with is creamy cannellinis studded with olives and chile all hanging out in an herby olive oil, topped with lemon-y tender fish.Luckily the steps for the recipe are as low-key as the ingredient list. You start things off by combining fresh oregano, canned beans (the recipe calls for cannellini but chickpeas or butter beans would work well too!), torn Castelvetrano olives, and water in a 3-qt. baking dish. You then place the fish (I used cod but the recipe works with any whitefish fillet) on top of the beans, or as Saffitz puts it “nestle into beans”, and scatter thinly sliced shallots and Fresno chiles over everything. Now here comes the part where the recipe goes from average weeknight dinner to weeknight dinner worth painting-by-number: You are going to arrange slices of thinly sliced lemon over the surface of the fish so that they are slightly overlapping. You did hear that shingling was one of the biggest trends this year, right? Once you’ve done that, drizzle everything with lots of olive oil and pop it into a 300 degree oven.See? Don’t you want to paint it by numbers?\nPhoto by Alex LauIt’s important to note that even though the word “slow” is in the whole technique for this fish, the process is anything but. The fish is only in the oven for around 30 minutes, and while you theoretically could cook the fish in less time on a higher heat, that low and slow method is what provides the best insurance against overcooking. Which is a very important kind of insurance. If you want to be extra certain the fish is done, you could go with this technique that Saffitz talked about to Healthyish a few months back: “Use a metal cake tester by sliding it into the fish and pressing it to your lower lip for three seconds. If the metal is warm, the fish is done. If it’s hot, the fish is probably overcooked, and if the metal is still cool, put it back in the oven.” Smart.Once the fish is done, take it out and let it rest for 5-10 minutes. Yes, fish needs to rest too. It’s a chance to let the flavors mingle together a little longer while letting the fish cool slightly. While that’s happening make sure the beans stay submerged-ish in the liquid (you don’t want them to dry out!). Then serve everything with a few lemon wedges to squeeze over. And if you’re future me, some crusty bread to sop up all the brothy beans, too.Get the recipe:Roast Fish with Cannellini Beans and Green OlivesThis is one of those throw-together dinner recipes that relies on staples like canned beans and lemons; all you have to do is pick up the fish.View RecipeExplore Bon AppétitWeeknightFishVegetarianWhite BeanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-26", "author": ["Condé Nast", "Rachel Karten"]}