{"id": "fc375592b4f8ef7c75f0bacd6f55b082", "url": "https://www.bonappetit.com/story/dinner-frittata", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "This Recipe Will Turn All You Dinner Frittata Skeptics Into Total Converts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Recipe Will Turn All You Dinner Frittata Skeptics Into Total ConvertsBONUS: Cabbage slaw to snack on while cooking.By Rachel KartenJanuary 6, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.Just like Harry Potter marathons, frittatas will always be there for you. They are easy to throw together, can handle just about whatever ingredients you have in the back of your fridge, and don't require one million pots and pans. That being said, I've only ever explored the ever-popular breakfast frittata category. Well, until I made Chris Morocco's eggplant frittata with cabbage slaw. It's got all of the weeknight-friendly qualities I listed above, but with more dinner flair. Ready to get on the dinner frittata bandwagon? Let's do this.First up, the slaw, made with half the Napa cabbage, cucumber, serrano chile, fresh lime juice, scallions, and salt. You won’t use the slaw until the very end, but you will mindlessly snack on it during the rest of the steps.Next, the eggplant mixture. You’re going to cut the eggplant into 2” sections (crosswise) and then into ½” thick batons. And you're going to look at all the eggplant you cut and think, “This is way too much!” Don’t worry—it cooks down a lot. Get it all browned and soft on the stove, and add the remaining cabbage, onion, and garlic. Stir around until all the ingredients get very tender. Now, take that unsightly-but-very-delicious mixture off the stove and let it cool.Okay! Egg time! Whisk two eggs and then add ginger, scallion, and tamari (I used soy sauce because I already had it in my fridge). Once the eggplant mixture is cool enough (takes about 10 minutes), add it to the egg mixture—I used my hands to incorporate it.Ready to make the frittata? First, add the egg and eggplant mixture to your oven-proof, non-stick pan, then wait about three minutes while the bottom cooks over medium-high heat on the stove. During these three minutes, you’ll unfortunately realize the next step is to flip the frittata and “invert back into skillet.” Since I don’t want you to have to do what I did (frantically look up YouTube tutorials on how to flip frittatas), here are two options for you: Option one is to slide the frittata onto a plate (or, even better, a flat pot lid), take your skillet off the stove and place it upside down on the plate (or lid), take a deep breath, and swiftly invert it back into the pan and place the pan back on the burner for another 2 minutes. And if you’re reading this and are like “INVERTING IS NOT FOR ME,” there's option two. Start on the stove for three minutes (as described above) and then pop it in a 350°F oven until the top is set, around 2-3 minutes. As Robert Frost once said, \"Two roads diverged in a wood and I took the one that made it easier for me to make a frittata, and that has made all the difference.\"Finally, slide your frittata onto a plate and top with the slaw you’ve been snacking on the whole time. Sprinkle some red pepper flakes on the whole thing. Congrats, you're a dinner frittata convert.Get the recipe:Eggplant and Cabbage Dinner FrittataWe love the just-set creamy texture of a stovetop frittata, but it does make it a little scary to handle. if you aren’t sure about inverting it to get it out of the pan, we have your back. Instead of flipping, transfer it to a 350° oven to finish cooking through.View RecipeExplore Bon AppétitHealthyishFrittataEggplantNapa CabbageFeel Good Food PlanRead MorecookingThis Roasted Broccoli Recipe Indulges All My Food ObsessionsBy Elaheh NozariRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-06", "author": ["Condé Nast", "Rachel Karten"]}