{"id": "fc47329bfc10fa0fbe428007e60778a7", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/rodneys-oyster-house", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Rodney’s Oyster House Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverRodney’s Oyster HouseSerious oyster curation in Yaletown, but that’s about where the seriousness endsFacebookPinterestTwitterEmailGrant HarderGO HERE: for the huge variety of fresh oysters at Rodney’s Oyster House, skillfully shucked by a team of very handsome men (win-win!).ORDER THE: day’s raw oysters by the dozen (keep an eye out for Royal Miyagi, Kusshi, and Raspberry Point) and some old-school favorites, like New England clam chowder, shrimp cocktail, and crab cakes. Order a British Columbian wine, like the crisp Burrowing Owl Pinot Gris.THE VIBE IS: noisy and fun, with customers catching up with their go-to bartenders and enjoying life, Cape Cod–style (a.k.a. wearing boat shoes).PRACTICAL STUFF: Open every day: Monday to Saturday, from 11:30 a.m. to 11 p.m.; and Sunday, from 4:30 p.m. to 11 p.m. You can reserve a spot by phone for either the raucous Yaletown original or the more intimate Gastown location.—Lindsay AndersonGrant HarderGrant HarderWE ALSO LOVEDock LunchMount Pleasant’s best-kept secret for lunch and a little readingGranville Island Public MarketAll the Canadian food (smoked salmon!) under one roof KishimotoThe Drive’s no-frills standby for impeccable sushiExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}