{"id": "fc4a05d8d590d03aaba9a2880846a4d3", "url": "https://www.bonappetit.com/story/valentines-day-gifts-food-jewelry", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "This Valentine’s Day, Give Your Honey The Food Earrings, Pendants, and Other Jewelry They Want | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingGorgeous Gorgeous Girls Love Jewelry Shaped Like FoodThis Valentine’s Day give them shrimp cocktail earrings.By MacKenzie Chung FeganFebruary 2, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Diamonds are a girl’s best friend, unless it’s 1 am and I’ve been out, in which case a pepperoni slice is a girl’s best friend. But why choose? Valentine’s Day is right around the corner and there’s no better gift for your number-one dining partner than a piece of food jewelry. A well-chosen set of earrings or pendant necklace is an opportunity to say to your boo, “I know you like beets. I see you.” To help you in your quest for the perfect token, we’ve rounded up BA staffers’ favorite necklaces, bracelet charms, and earrings, all shaped like the foods we love most.OIYA Chile Pepper EarringsThese days I’ve been manifesting something—anything—to come along and spice up my life. So when I noticed these delicate glass pendant chile pepper earrings while shopping for a friend’s baby on Maisonette, I simply had to add them to my cart. They’re a subtle nod to my love of cooking but cute and abstract enough to not make it A Thing. (“Chile pepper earrings aren’t a personality, Ali.”) I truly cannot wait to…wear them to the grocery store? Laundromat? While bingeing mid-’90s rom-coms from my couch? Hey, it’s the little things. —Ali Francis, associate editorOIYA Chile Pepper Earrings$88 at Maisonette$88 at OIYACatbird Holy Cannoli CharmCatbird’s wares include a mix of lovely jewelry from the brand’s Brooklyn-based design studio and extraordinary pieces from the most talented indie designers in the business. I never pass up an opportunity to ooh and ahh over the delicate gold chains, teeny tiny diamonds, and expert craftsmanship they’re known for, so I simply couldn’t contain myself when I stumbled upon their Holy Cannoli charm. Made of recycled 14k gold, this little treat is flanked by two of the tiniest pearls I’ve ever seen. Swoon. Wearing my heart on my sleeve might be cliche, but wearing a cannoli on it? Baby, that’s amore! —Jenna Adrian-Diaz, assistant to the editor in chiefHoly Cannoli Charm$118 at CatbirdÉliou Shroomie NecklaceTo me a colorful, playful piece of jewelry is not only iconic for any age or gender but also versatile for any occasion. Éliou’s handmade shroomie necklace is my go-to for gifting (self-gifts included). Who knew the combination of freshwater pearls and colorful glass beads could make mushrooms feel like candy on your neck? Layer it with other pieces or let it shine solo on a white tee—there’s no wrong way to work these shroomies. —Caroline Newton, design directorÉliou’s Shroomie Necklace$175 at ÉliouPrada Banana EarringsHello, world? Yes, hi. It’s me. Here to tell you that I have never wanted something more than these Andy Warhol-esque sterling silver and acrylic clip-on banana earrings. I know I said that last time, about the other thing, but this time I mean it. They are the most spectacular food earrings I’ve ever seen, designed after the fruit I have the deepest love-hate relationship with, which makes them emotionally significant, like poetry clipped to my ears. They cost $595 so I don’t think my husband is going to buy them for me this Valentine’s Day. But if you do, I’m yours. Forever. Or at least until I lose one. Thank you. I love you? DM for mailing address. —Hilary Cadigan, culture editorPrada Banana Earrings$595 at FarfetchKate Spade Pizza Hoops and PendantWhoever set the precedent of giving chocolate to loved ones on Valentine’s Day perhaps never tried pizza. Nothing says romance like sharing a pie with someone you love most. Enter these pizza hoops and pendant from Kate Spade, which have replaced my favorite grease-laden roni cups with jeweled red hearts and cheese with cubic zirconia. The perfect gift to give someone a…pizza my heart. —Kate Kassin, editorial operations associatePizza My Heart Earrings$98 at Kate SpadePizza My Heart Pendant$78 at Kate SpadeSusan Alexandra Shrimp Cocktail EarringsI can’t imagine anything more fabulously camp than showing up to a fancy cocktail party in these sparkly shrimp cocktail earrings from Susan Alexandra. Who else but New York’s queen of beaded accessories could make shellfish so stylish? Just make sure no one tries to nibble your ear (unless, of course, you’re into that). —Chala Tyson Tshitundu, assistant editorShrimp Cocktail Earrings$155 at Susan AlexandraVersace Iced Coffee Cup CharmIf you’re married to a homosexual like I am, you know that the only thing queers love more than iced coffee is Versace. This gold-toned brass pendant (chain not included) is embellished with crystals, Versace’s signature Greca borders, and the face of my second favorite Gorgon, Medusa. If you really want to impress, pair the charm with the super-sized version—this $1100, crystal-studded travel cup with reusable straw. “Is it too much?” you’re thinking. In the eternal words of Quavo, “Versace Versace Versace Versace.” —MacKenzie Chung Fegan, senior commerce editorVersace Iced Coffee Cup Charm$375 $113 at SSENSE$375 $262 at Luisa Via RomaWOLL Jewelry Beet EarringsThe beet is a vegetable born to be made into earrings: Its deep red color is to die for and the leaves and stems allow it to dangle quite nicely—nay! dramatically—from your earlobes. I’m also here for more root vegetable representation in jewelry. Why should strawberries get all the attention? —Esra Erol, senior social media managerBeet Earrings$45 at WollKFC Finger Lickin’ Good NecklaceEvery few months I suddenly remember the loss I felt when I neglected to purchase KFC’s 2017 limited edition raglan sweatshirt emblazoned with the phrase “Fried Chicken USA.” In those times I’ll scour the recesses of the internet hoping to find someone willing to sell theirs at a reasonable price. No luck yet. This “Finger Lickin’ Good” necklace was part of the same release, and while it doesn’t have the same vintage appeal, it’s just tacky enough that I love it almost as much. —Joe Sevier, cooking and SEO editorKFC Finger Lickin’ Good Necklace$125 at EbayMociun Waffle CharmHigh on the list of “things I want but don’t need and can’t afford” is this lovely, delicate waffle charm featuring a tiny, perfect dollop of diamond-studded whipped cream. It’s sold as part of Brooklyn-based jewelry Mociun’s fine foods line, which also boasts a decadent deviled egg with a yolky swirl of yellow gold and yellow diamonds, a cereal spoon complete with a rainbow of “cereal” gems, and the most elegant sliced fruit charms. While one might say there’s a time and a place for life-size shrimp cocktail or pop art banana earrings, this dainty waffle works as an everyday staple, with just enough sparkle to transition seamlessly from day to night. It’s the perfect gift for the food obsessive who loves decadence and breakfast, already owns a luxury coffee setup and a designer gravy boat, and still has disposable income to burn. It might not be in my budget, but it certainly lives rent-free in my mind. —Sonia Chopra, executive editorWhipped Cream Waffle Charm$1,100 at MociunGourd Friend Enoki Mushroom EarringsGarlic girls are having a moment—but I am a mushroom girl, first and foremost. Made of iridescent acrylic that looks clear from some angles and reflects colorful light from others, these enoki mushroom earrings from Gourd Friend are the perfect homage to my favorite food. Forget diamonds—I want shiny ’shrooms. —Bettina Makalintal, associate editorEnoki Mushroom Earrings$10 at Gourd FriendExplore Bon AppétitShoppingGift GuidesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-02", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}