{"id": "fc4cc9a11242978c5d299f72605e9437", "url": "https://www.bonappetit.com/story/best-canned-chickpeas-goya-organic", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "The Best Canned Chickpeas Are Goya Organic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Canned Chickpeas Are Goya OrganicCanned chickpeas are a weeknight savior, and this brand makes the best.By Claire SaffitzFebruary 15, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailCanned chickpeas are my tried-and-true pantry fallback for those days where I get home late with no game plan and no energy to cook. More than just about any other canned bean, they retain their shape and texture really well. However, the flavor, size, texture, and salt content varies widely between brands. Because we’re curious about stuff like this at Basically, we did the dirty work of blind-tasting a variety of brands and picking our favorite.We tried 5 different brands sourced from large grocery chains and sampled them straight out of the can. The all-around winner was pretty clear: Goya Organic. It had a clean, slightly sweet and nutty flavor with a smooth, yielding texture that was neither mealy nor mushy. Visually, the chickpeas came out of the can intact and had an even, pinkish-beige color—not broken down or grey-ish like other brands. And while some brands were packed with sodium, Goya Organic had big bean flavor with less salt overall. It beat out the competition in terms of taste and texture, though the organic chickpeas from Eden were a close second—good texture, but not as deliciously bean-y as Goya Organic.Chickpeas: definitely Rent Week approved.\nPhoto by Laura MurrayCanned chickpeas have terrific range, which is why I make sure I always have at least a can or two lying around at home. They puree easily into a smooth and creamy hummus or crisp into crunchy little nuggets as a component of a sheet tray dinner. For super quick applications, I like to throw them into everything from salads to pasta to soups. Do yourself a favor and buy a half dozen cans the next time you’re at the store to start your own stockpile. Because as long as you have canned chickpeas around, dinner doesn’t feel so hopelessly out of reach.Buy It: Goya Organic Chickpeas, 24-pack of 15.5-oz. cans, $36.72 on Jet.comAnd go makes some hummus!Classic Chickpea HummusSo easy you'll never buy hummus again.View RecipeExplore Bon AppétitBasicallyChickpeaBeanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-15", "author": ["Condé Nast", "Claire Saffitz"]}