{"id": "fc5ccb34f6a66b3a664c0899a5652720", "url": "https://www.bonappetit.com/recipe/chicharrones-en-salsa-verde", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "Chicharrones en Salsa Verde Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicharrones en Salsa VerdeBy Rick MartinezOctober 9, 20204.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl Jones, Prop Styling by Allie WistEmailPinterestPrintEmailPinterestPrintCrunchy chicharrones are ideal for soaking up bright tomatillo salsa, taking on an ultimate crispy-gone-soggy chewy texture. Every brand of chicharrones is different, sopping up more or less of the sauce, so you may need to add more or less water to achieve saucy-clingy consistency. If you can’t find tomatillos, use 4 cups chopped cored plum tomatoes (about 8 medium) to make a salsa roja instead.Ingredients6-8 servings8oz. chicharrones, broken into 1” pieces (about 6 cups), divided2Tbsp. lard, bacon fat, or vegetable oil3jalapeños or serrano chiles, seeds removed if desired, finely chopped5garlic cloves, finely grated1large white onion, finely chopped, divided½tsp. freshly ground black pepper1½tsp. kosher salt, plus more1lb. tomatillos, husks removed, rinsed, choppedRefried beans (for serving)12–16warm small corn or flour tortillasChopped cilantro and lime wedges (for serving)PreparationStep 1Place 2 oz. (1½ cups) chicharrones in a medium resealable freezer bag and seal bag, pushing out air (or, you can wrap up in a clean kitchen towel). Using a heavy skillet or rolling pin, crush into pea-size pieces; set aside for serving.Step 2Heat a dry large skillet, preferably cast iron, over medium-high. Toast remaining 6 oz. (4½ cups) chicharrones in skillet, tossing occasionally, until lightly charred on several sides, about 5 minutes. Transfer to a medium bowl.Step 3Combine lard, jalapeños, garlic, and 1 cup onion in same skillet over medium-high heat; season with pepper and 1½ tsp. salt. Cook, stirring occasionally, until vegetables are softened and lightly golden, 6–8 minutes. Add tomatillos, season with salt, and cook, stirring occasionally, until tomatillos are softened and start to lose their shape, about 5 minutes. Add toasted chicharrones and 3 cups water and bring to a boil. Reduce heat to medium-low and simmer gently, uncovered, stirring occasionally, until sauce is thick (it should be the consistency of ragù), 15–18 minutes. Taste and season chicharrones en salsa with more salt if needed.Step 4Spread refried beans over tortillas and top with chicharrones en salsa, cilantro, remaining onion, and reserved crushed chicharrones. Serve with lime wedges for squeezing over.How would you rate Chicharrones en Salsa Verde?Leave a ReviewTell us what you thinkExplore Bon AppétitMexicanLatin AmericanTomatilloVegetableEasyOne-Pot MealsMainNut-FreeGluten-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-20", "author": ["Condé Nast", "Rick Martinez"]}