{"id": "fc60fa1dba3dfc368f36aa8c8f48df19", "url": "https://www.bonappetit.com/story/kitchen-layout-ideas", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "These 5 Kitchen Layout Ideas Will Help You Make the Most of Any Space | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese 5 Kitchen Layout Ideas Will Help You Make the Most of Any SpaceBrooklyn designer Elizabeth Roberts has genius advice for configuring our favorite room of the house.By Sam Cochran and Nico AvalleJanuary 15, 2022FacebookTwitterEmailPhotograph by Floto + Warner FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Even the tidiest spaces can can benefit from some kitchen layout ideas. Sure, not all of us can manifest a window (and requisite dreamy landscape) in front of our kitchen sinks, or install a custom range hood in our rental apartments. But fear not: with some clever lighting solutions and playful design elements, we can learn to make the most of what we’ve got. And designer Elizabeth Roberts is here to show us how. With a track record packed with historically sensitive renovations, Roberts and her Brooklyn-based firm are no strangers to working within plenty of constraints. Her philosophy leans into new materials, open and breathable vibes, and joy-inspiring touches—without compromising the character of the kitchen she’s restoring. Here are some of her favorite kitchen layout ideas.Photograph by Nicole FranzenRoom With a ViewWhen laying out your kitchen, Roberts advises, “always think about what you want to be looking at.” A sink by the window, for instance, makes washing dishes a scenic experience, whereas a sink on an island allows for interactions with family or guests. Knowing your priorities will determine the placement of key stations.Photograph by Dustin AkslandThe Cabinet Conundrum:“There is always the question of how many upper cabinets to have and where,” Roberts notes, adding that many clients now want to stare at something other than a cupboard when cooking. A single open shelf provides an elegant display for everyday staples while leaving wall space for artwork or sconces.What’s Center Stage?“Islands are getting boring,” Roberts says. Rather than matching the cabinetry, she mixes it up with designs sheathed entirely in stone, like the marble one at fashion designer Ulla Johnson’s Brooklyn brownstone. (“I like a big block of something,” Roberts notes.) Other islands have been detailed to look like furniture, with meticulous joinery in the woodwork. For a kitchen on the North Fork of Long Island, she added eight inches to the legs of a vintage farm table to make it counter height.Photograph by Dustin Aksland Pulling Back the HoodAmong the first kitchen questions to ask is: How important is ventilation? (“Some people like the smell of bacon,” Roberts says.) Against a wall rather than above an island is typically the best place for a powerful range hood, “which can be big and bulky.” For a more minimalist look, consider concealing the air duct inside a cabinet or using a pop-out vent, like the Miele appliance at this New York City townhouse.Get Creative:For extra character, outfit your kitchen with the same decorative layers as any other room in the house. Here are four ways to do it:Courtesy of RH Fulcrum Table Lamp by RH“Go with a light fixture that is unexpected, like a task lamp on the counter or a swing-arm lamp,” says Roberts. \n$3,595 at RHCourtesy of NanzNº 6828P Cabinet PullBe playful with cabinet pulls. For heavy paneled fridges or dishwashers “you’ll need something really big.”\nShop Now at NanzCourtesy of CLE TILE Zellige Secret Lagoon Hex Tile“For kitchen flooring I advocate for stone or tile. I would rather break a jar than mar a wood plank.” \n$224 at Cletile (100 tiles)Courtesy of Matthew CoxOrangery Table“I love an island that is more furniture-like,” says Roberts, who often uses pieces by British artisan Matthew Cox. \n$3,370 at Matthew CoxRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-15", "author": ["Condé Nast", "Sam Cochran", "Nico Avalle"]}