{"id": "fc7d8e985cf61bb17df99a82b4399106", "url": "https://www.bonappetit.com/story/dani-shapiro-comfort-food", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Two Strangers With a Stunningly Intimate Connection Walk Into a Restaurant... | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTwo Strangers With a Stunningly Intimate Connection Walk Into a Restaurant...Bestselling author Dani Shapiro had no idea what to expect when she made lunch reservations at a cozy suburban Italian restaurant.By Dani ShapiroAugust 10, 2021FacebookTwitterEmailPhoto by Isa Zapata, food styling by Micah MortonFacebookTwitterEmailThis is All on the Table, a column featuring writers we love sharing stories of food, conflict, and community.The choice of restaurant was important. It needed to be not too large, not too small. Not too noisy but not oppressively quiet either. Not formal but definitely not casual. And no hovering waiters. We needed to be free of interruption. The cuisine? There had been some discussion over email: Greek? French? Italian? We chose easy, cozy Italian. The geographical parameters were also specific. My lunch date would be staying in New Jersey for a few days, just a two-hour drive from my home in Connecticut.I obsessed over every detail. How would I greet him? Shake his hand? Give him a hug? Who should pick up the check at the end of the meal? The lunch loomed in my calendar for months, eclipsing all else. The possible faux pas seemed endless. Even the most updated edition of Emily Post’s Etiquette does not contain an entry for how to behave when meeting one’s biological father for the first time at the age of 54.And then the day arrived. The four of us—my husband and me, my biological father and his wife of 50 years—convened at a dark, bustling suburban restaurant in Teaneck, New Jersey. I had called ahead and asked for a quiet table. The maître d’ asked if it was a special occasion. Yes, it was. Birthday? Anniversary? Not quite. Just special. As the four of us settled in, I was aware that other diners, if they noticed us at all, would assume that we were a family. I looked just like him.My husband reassured me that I’d know what to do as the afternoon unfolded, but it wasn’t like I had muscle memory for this. It definitely wasn’t like riding a bike. I had only just learned through taking a DNA test (for purely recreational purposes) that I had no genetic link to the dad who raised me. That my parents, unable to conceive a child of their own, had enlisted the help of a campus fertility clinic. The proceedings were cloaked in secrecy, anonymity. The young medical student who donated sperm could never have imagined a future in which he’d be an elderly retired physician meeting the result of that donation for lunch.My legs trembled beneath the table for the entire four hours of our meal. We ordered endive salads. I had the chicken paillard. I say I had it, but I barely managed three bites. I poured olive oil onto my plate, dunked the crust of my bread just for something to do with my hands. I stole a glance across the table. His hands were small and expressive. My hands. Every time I looked at him, I felt a shock of recognition. My forehead. My chin. My gestures. All reflected back at me by someone I had never met. He didn’t feel to me like my father. I’d had a great dad who died when I was young, and I missed him terribly. But this gentle doctor did feel intensely familiar to me. Hiraeth—a Welsh word—is defined as a longing for a place that never was. He was the country I was from, yet I had never set foot on its soil nor breathed its airAs our entrées were cleared, he pulled out his phone and opened a folder. His cheeks were pink. I, too, blush easily. As he handed me the phone, he cleared his throat. “Ancestors,” he said. “These are my parents. And great-grandparents.”I scrolled through faded black-and-white photographs. A handsome couple (my biological grandparents!) in front of a Midwestern farmhouse. An elegant white-haired man (my great-grandfather!) looking solemnly at the camera, in the manner of the day. The ancestors I had grown up believing were mine had come from an Eastern European shtetl.As I began to digest what I was seeing, my phone rang. It was our teenage son, calling to see how lunch had gone. I handed the phone to my biological father and introduced him to his grandson. Their words may have been polite, almost inane—it’s nice to meet you, it’s nice to meet you too—but the air around the table was charged with the energy of worlds coming full circle.We lingered over cappuccinos and a few shared desserts I no longer recall. Cheesecake? Tiramisu? My stomach was in knots. It was nearly dusk by the time we left. My husband and I walked them to their car, all of us with the sense that this was the beginning of something, not the end. I would soon be on a book tour, which would take me out West to their city. “We’ll come to your reading!” they said. We hugged goodbye. Collapsing into the passenger seat, my relief that it had gone so well—that I liked the man I came from—made me suddenly ravenous.A few minutes from home, we pulled into our favorite spot, the Mayflower Inn, a grand country hotel where we’d spent many long evenings over the years. We grabbed a table in the taproom. The pianist played Thelonious Monk. I ordered a vodka martini dry with olives. My life, my history, the whole of my childhood and the secrets my parents kept swirled around me, invisible, silent, shocking. When I excused myself to go to the ladies’ room, the face staring back at me in the mirror told a brand-new story. I felt strange, floaty, not quite myself—whatever “myself” now meant.In the meantime it was comfort food I was after: the Bibb salad with Gorgonzola, frizzled shallots, and tomatoes—a house specialty so beloved that locals have been known to revolt when it’s not on the menu. It had been a while since anything had tasted quite so perfect. Then, a bacon cheeseburger with crisp french fries. And one more martini. Hiraeth. All my life I’d carried a strange, undefinable longing without knowing why. Now I knew why. My eyes stung as I reached for my husband’s hand across the candlelit table. No matter how painful, I recognized this accidental discovery as a gift. A rare opportunity to understand the fault lines in my own history, and perhaps even to liberate myself from what had long haunted me.Get the Recipe:Tomato Salad With Blue Cheese and Crispy ShallotsRegulars of the Mayflower Inn in Washington, CT, have been known to revolt when this tomato salad isn’t on the menu.View RecipeDani Shapiro is the author of 10 books, including the best-selling memoir ‘Inheritance.’ She hosts the hit podcast ‘Family Secrets.'Explore Bon AppétitFirst PersonAll on the TableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Dani Shapiro"]}