{"id": "fc8c2752052dbb6fbe92b2396f1717f7", "url": "https://www.bonappetit.com/story/national-pie-championships-orlando", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "Inside the National Pie Championships: Keep Calm and Carry Cool Whip | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureInside the National Pie Championships: Keep Calm and Carry Cool WhipAvid bakers from across the country convene in an Orlando ballroom for blue ribbon pie glory.By Claire McNeillApril 13, 2018FacebookTwitterEmailDavid WilliamsFacebookTwitterEmailA humid blue Orlando dawn is breaking as David Harper moves pies from the frigid belly of his van to a rickety hotel cart. He needs to get all 14 of them inside, to the industrial freezers, before his whipped cream decorations lose their hold. This is a matter of some faith. Others in his midst, with pies nestled in ice-lined Publix bags and coolers driven all the way from the snowy Midwest, share his fear: How a judge may react if—horror—their pie melts into itself once sliced.Through a back entrance of the Rosen Centre Hotel the pies go, to long maroon tables in a cavernous ballroom for check-in. It’s barely 7 a.m. on this early April day, when a few dozen amateur bakers will compete for a shot at $5,000 and the glory of having baked the best pie in America.Some longtime competitors have been dueling in classic categories like pumpkin and apple since the dawn of the National Pie Championships nearly 25 years ago. These are the bakers who load up minivans with Michigan cherries and check luggage full of spatulas. They bake late into the night in sparse, rented condos in the Orlando suburbs, fine-tuning their recipes. And it’s in this carpeted ballroom that their mutual obsessions converge. These people understand why one would ship a particular mixing bowl all the way from Pennsylvania. They’re part of what 70-year-old couple Beth and Charlie Campbell call Pie Family.The day starts early. Contestant Sandy Pearce arrives with her pies.\nDavid WilliamsPearce rolls her pies into the ballroom.\nDavid WilliamsIt doesn’t take much to enter a pie, just $35 (even less for American Pie Council members), an original recipe, and a Saturday in Florida. This year’s 33 amateur entrants range from retirees to stay-at-home parents to engineers, a small but devoted bunch with 183 pie entries between them across about a dozen categories. For some, the competition is a springboard into cookbook deals and new bakeries, though earning more than $500 in pie-related endeavors means graduating to the professional category.It doesn’t take much to come judge a pie, either, just a simple application, and a will and a way to Orlando, making the event a largely volunteer affair. The host, the American Pie Council—also the group behind National Pie Day—bills itself as “preserving America’s pie heritage and promoting America’s love affair with pies.\"The heights of dessert accomplishment this is not. Perhaps the home baker’s true gauntlet is the famed Pillsbury Bake-Off, which puts $50,000 on the line. But for a hardcore few, this is the Super Bowl, a deeply earnest celebration of pie with an edge of serious competition.The veterans move with ease as they check in their entries, pricking their pies with labeled American flags. David Harper crouches down to make reverent final nudges to a few fat raspberries tucked into a lattice of chocolate cream. One of Beth Campbell’s pies is still hot.“That’s a bit too close to the wire for me,” she says.Softspoken Ronda Millington from Texas is an evident first-timer, holding her toothpick flag above a single, rustic apple pie with uncertainty.“Okay, so you put ‘em in the pie anywhere?” she asks nobody in particular.A contestant carefully places the identifying flag in her pink creation.\nPhoto by David WilliamsThis Jaws pie will compete in the “Hollywood movie” category.\nDavid WilliamsFrom the Tampa suburbs, Angela and Joe Cacciola run down a list, name-checking their 26 Cool Whip-laden pies in flimsy aluminum tins, each ruthlessly crafted to exploit some variable the couple is testing, like crust consistency. They take an unusual approach, often entering several pies in the same category to see how slightly-tweaked versions stack up on a score sheet that allots points based on creativity, crust, overall taste and more. This year, thicker fillings should improve the Cacciolas' post-slice scores. They’re also fiddling with the sentimental power of names, dubbing one “Mee Ma’s Gooey Caramel Cream Pie.”“There’s no Mee Ma,” Angela says. “These people don’t exist.”As the hour of judgment approaches, the pies get their official glamour shots taken and are whisked away for safekeeping. The judges-to-be are told to remember, please, that people pour their heart and soul into this, so be nice. And don’t screw up the math.When the pie police show up...\nPhoto by David WilliamsLegit.\nPhoto by David WilliamsThe couple hundred judges themselves are a ragtag crew—some crossovers from the barbecue circuit, some locals who like pie enough to register their weekend away for it. Others have come a long way. Dr. Leigh Wheeler, a retired doctor in a Hawaiian print shirt, flew down from Pennsylvania just to evaluate the blueberry contenders.A blueberry contender.\nPhoto by David WilliamsIn the decision room, judges sit before mountains of plastic forks and bowls of oyster crackers, a palate cleanser. Servers flit around the room with dense whipped domes and berry pies with sugared crusts. After giving judges a first impression, the pie moves to the vaunted slicer, who cuts a pristine wedge for judgment of post-slice appearance. The judges pass the piece around and mull the taste in silence, while volunteers in “PIE POLICE” T-shirts patrol to keep snooping bakers out.Overall, judging is a fairly loose affair. Each table gets about a half dozen judges who are tasked with one or two categories, like cream cheese, or pumpkin and nut. Scoresheets guide the way, with lines for judges to award points from appearance to wow factor. “Savor the first bite and rate your impression,” judges are told. Then there’s crust: How’s the consistency? How creative is the concept? The pie with the most points in its category wins a blue ribbon, then goes on to compete against the other blue ribbons for best in show.Pie Runners show pies to the judges.\nPhoto by David WilliamsOutside, winds from an impending storm whip the palms by the pool, but in this windowless room, it’s unclear what time or even what year it is. There’s only the all-American, apolitical nostalgia of slightly imperfect, homemade pie.At a central table, the ninth of 17 citrus entries arrives, billed as containing pineapple but disappointingly mild.A raspberry lemon pie follows—tasty enough, but a wilted yellow puddle on a Dixie plate.“We need a soup spoon for that,” says judge Sylvia Geier, who has adorned her name tag with a smiley face. Another mutters, “Terrible mess, dreadful.”Head Judge Joy Pautler, a redhead who learned about the National Pie Championships in her retirement community newspaper, The Villages Daily Sun, taps her scoresheet with glittery green appliqué fingernails. She writes thoughtful comments in teacherly cursive: Doesn’t taste lemon—love the raspberry.They try a vaguely named pie topped with red gelatin and decide it tastes like faintly sour nothing.“Well, they didn’t claim it tasted like anything,” says retiree Bob Southard. “It was just ‘Fun in the Sun.’”Please don’t let this meringue melt in the Florida humidity.\nDavid WilliamsThey take their task seriously, going back for slow bites of dense graham cracker crust to meditate on its texture. And then it comes out—a wet pie of such unholy wrongness that judges begin grimacing as the server makes her introductory round. Antiseptic fumes of coconut rum waft from its gloppy filling.“What in the world was in there?” Joy exclaims, betrayed. A bit weird, Bob writes. Sylvia starts scrubbing her tongue with a paper napkin.Inside Joe and Angela Cacciola’s fridge the day before the competition.\nDavid WilliamsAs Citrus finally wraps, the judges share wistful memories of a key lime cheesecake pie they tried early in the lineup, which advances to the final round.Best in Show is a sober affair, now that the ballroom has cleared out. The only sound is forks on plates. These final 14 pies are meticulously architected, cut open to reveal crisp layers. Judges Lauren Bolden, a 28-year-old who runs a pie shop in Georgia, takes considered notes on mouthfeel and aftertaste, favoring a sweet potato pecan pie.Judges assess the distinct layers of the pie.\nPhoto by David WilliamsScore sheets disappear for tallying, and a party gets going. A man in a lattice crust beret bangs out “Hey, Good Lookin’” on guitar. A wacky apron contest happens.“When the timer goes off,” says baker Jennifer Nystrom, whipping oven mitts from her hips, “I’m QUICK ON THE DRAW!”Finally, 12 hours since the arrival of the day’s first pies, the American Pie Council’s director strides to the front, and the room gets quiet. The crowd is small, white and white-haired, but hums with competitive energy.David Harper with one of his pies.\nPhoto by David WilliamsIn the amateur division, as a prim woman keeps picking up blue ribbons, someone whispers, “She entered every. category.” Mostly the audience hoots and hollers for familiar faces. One woman, picking up a ribbon in chocolate, begins to weep. David Harper wins several—for his apple peanut butter pie and black currant tiramisu, among others—and strides up to the front with flip-flops thwacking. His shirt declares, “I made the pie, GOD gets the glory.”The room holds its breath as the director fumbles with her paper.Best in show goes to—from Clarksville, Ohio, for her chocolate caramel turtle sundae pie—a delighted Jennifer Nystrom of oven mitt fame, who struggles to hold all of her ribbons and the giant check at the same time.The finalists await the results.\nPhoto by David WilliamsIn the next room, winners and losers search for their half-eaten pies on carts. The Cacciolas round up their 26 tins, taking photos to analyze for next year’s re-engineering. David Harper’s kids help box his leftovers for a fire station, including their dad’s blue-ribbon cherry, in which Twinkies comprise a significant base layer.“God willing, we’ll be back,” David’s wife Jennifer says.“You betcha,” David says, and they head out in the rain to load up the van.Jennifer Nystrom celebrates her blue ribbon.\nDavid WilliamsExplore Bon AppétitPieFloridaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-13", "author": ["Condé Nast", "Claire Mcneill"]}