{"id": "fc8ffc933a0ddd27715964b64c55c2e4", "url": "https://www.bonappetit.com/recipe/almejas-con-alguashte", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Almejas con Alguashte Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueAlmejas con AlguashteSeptember 22, 20205.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Andria Lo, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrint“Squash and pumpkins are huge crops in El Salvador, and the seeds never go to waste—they get toasted and ground to create alguashte, a Salvadoran seasoning” says chef Anthony Salguero of Popoca in Oakland. “At the restaurant I stir it into a seafood stew that’s typically made with baby crabs, though here I’ve done it with clams. The alguashte adds a deep nuttiness and crunchy texture.”Ingredients4 Servings2Tbsp. coriander seeds3medium tomatoes (about 1 lb.), coarsely chopped1medium onion, coarsely chopped6garlic cloves3jalapeños, coarsely chopped1bunch cilantro, stems and leaves separated1Tbsp. achiote (annatto) seeds or 2 tsp. powder3Tbsp. vegetable oil½cup plus 2 Tbsp. Alguashte½cup dry white wine4lb. Manila or littleneck clams, scrubbed2limes, halvedKosher salt (optional)PreparationStep 1Toast coriander seeds in a dry small skillet over medium heat until very fragrant and just beginning to smoke, about 1 minute. Let cool slightly.Step 2Transfer seeds to a food processor and pulse until coarsely ground. Add tomatoes, onion, garlic, jalapeños, cilantro stems, and achiote seeds and pulse until a coarse purée forms, about 1 minute.Step 3Heat oil in a large Dutch oven or other heavy pot over medium-high. Add purée and ½ cup Alguashte. Cook, stirring often with a wooden spoon, until thickened (spoon will leave a trail) and a few shades darker, 12–15 minutes. Add wine and cook until evaporated and spoon again leaves a trail when dragged through, about 3 minutes.Step 4Add clams to pot and stir to coat. Reduce heat to medium-low, cover pot, and cook until clams have opened, 8–12 minutes. Fish out and discard any clams that have not opened after 15 minutes.Step 5Squeeze limes over clams and toss to incorporate. If broth looks too thick, add a few tablespoonfuls of water. Taste and season with salt if needed.Step 6To serve, sprinkle remaining 2 Tbsp. Alguashte over clams and top with cilantro leaves.How would you rate Almejas con Alguashte?Leave a ReviewTell us what you thinkExplore Bon AppétitSalvadoranCentral AmericanLatin AmericanClamShellfishSeafoodMainStarterDairy-FreeGluten-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}