{"id": "fcb1cdd36dc0789b99b4536a92a1df7f", "url": "https://www.bonappetit.com/story/is-it-better-to-bake-in-glass-or-metal", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "Is It Better to Bake in Glass or Metal? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIs It Better to Bake in Glass or Metal?The great showdown: Baking “dish” versus baking “pan.”By Sarah JampelOctober 23, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan Spungen FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Peak baking season is nearly upon us. And that raises some questions: Cake or pie? Edge piece or center cut? Lunch dessert or dinner dessert (why not both)? But the query I’m writing about today may be the most important of all because it determines how those future desserts will fare. And that question is: Is it better to bake in glass or metal?Whether you’re adding to your bakeware collection or looking to upgrade what you already own, you’ll want to know which material is better for your future brownies, lemon bars, and sheet cakes. So we asked a few of the best bakers in the biz what they prefer. And almost unanimously they said metal. It’s lightweight, easy to maintain, and inexpensive, and it provides a more consistent and even bake.A very good baking pan:Nordic Ware Classic Metal 9x13 Covered Cake Pan$13 at Amazon$22 at Nordic WareIn Edd Kimber’s new book One Tin Bakes, he calls for one pan and one pan only (hence the title): a 9x13\" pan with sides at least 2\" high in natural (a.k.a. uncoated) aluminum. Edd deems the aluminum pan (his favorite brand is Nordic Ware) the “MVP of bakeware. It’s relatively cheap, doesn’t have nonstick coatings to worry about scratching, and, if looked after properly, will last a very long time. Aluminum is a very good heat conductor, which means baked goods will brown evenly, and it doesn’t rust.”Glass bakeware, in comparison, is heavier than aluminum and more expensive. Because glass is an insulator, rather than a conductor, it’s slow to heat but, once hot, retains that heat for longer. This can result in uneven baking: By the time the interior is baked through, the exterior is often overcooked, dry, or dark. (Some bakers even recommend lowering the oven temperature by 25° when baking in glass to combat this problem.)But those aren’t the only reasons to go with metal. Yossy Arefi, who baked hundreds of cakes for her newest book Snacking Cakes, is also in it for the neat corners. “My square and rectangular metal bakeware have crisp 90-degree corners,” Yossy says. “It's purely aesthetic, but I find those straight lines very satisfying.” Metal pans are also practically indestructible, which is essential in Yossy’s small kitchen.The MVP in action.\nPhoto by Chelsie Craig, Food Styling by Kat BoytsovaAluminum is good for cakes, bars, and pies—but also for breads: focaccia, sandwich loaves, and rolls.  Because metal heats up faster than glass, it contributes to a better rise and crisper, browner edges. But whatever you're baking, it's important to remember that not every metal pan is a great metal pan. Vallery Lomas, champion of season 3 of The Great American Baking Show notes that “finish, material, and quality matter—especially if you don't want the bottoms of your baked goods overdone.” If your pans are too dark, they’ll absorb more heat, which, like glass, can cause the exterior to bake too quickly.So what is the one exception to the metal-or-bust rule? Pie—for beginners. “The ONLY thing I like about glass is that you can see through it,” explains Erin McDowell, pie whisperer and author of the The Book on Pie. “This is mostly helpful for beginners who tend to not realize how long pies really need to bake. Being able to ‘check’ that bottom crust can be really helpful for those just starting out, to get comfortable with the visual cues.” Otherwise, though, Erin prefers metal. “[Metal] is the most nonstick, which is hard not to love, and does the best job of conducting heat.”A very good baking dish:Pyrex Basics 3 Quart Glass Oblong Baking Dish$25 at AmazonSave your glass pans for lasagna, plátanos maduros horneados, baked eggs, piñon, casseroles, and doughnut bread pudding—they’re easy to clean, they’re so smooth they’re naturally nonstick, they’ll keep your kugel warm as it sits on the table, they won’t cause discoloration or off-tastes when you’re slow-roasting tomatoes or other acidic foods. But metal will handle the baked goods.Your glass dish wants to be full of kugel.\nPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaAnd should you panic and forget everything you’ve learned, just hang onto this handy rule of thumb from our recipe editor Liesel Davis: If a recipe calls for a “dish,” that typically means glass or ceramic; if it calls for a “pan” or “tin,” go with metal.Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-23", "author": ["Condé Nast", "Sarah Jampel"]}