{"id": "fcb847871c6065b95dce3d57f05353cb", "url": "https://www.bonappetit.com/story/healthyish-podcast-episode-3", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "The Healthyish Podcast Episode 3: The Case for Quitting Meat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Case for Quitting MeatThis week on the Healthyish podcast, BA contributors Sarah Jampel and Chrissy Tracey talk about making the choice to not eat meat and what they're cooking for July 4th.By Bon AppétitJuly 1, 2021FacebookTwitterEmailFacebookTwitterEmailBy this point we can pretty much agree that meat consumption is hard on the planet. But does that mean we should all be vegetarian...or vegan? Not everyone thinks it’s that easy, not even BA’s senior cooking editor Sarah Jampel and video host Chrissy Tracey, both lifelong vegetarians. On the third episode of the Healthyish podcast, Sarah and Chrissy join Amanda Shapiro (not a lifelong vegetarian) to talk about their plant-based paths, when and why they break the rules, and how to cook to please even your most carnivorous friends...just in time for your July 4th cookouts.ContentThis content can also be viewed on the site it originates from.Stuff we talk about in this episode:Andrea Nguyen’s Vegetarian Chicken Soup Recipe Sarah Jampel’s vegetarian column on HealthyishChrissy’s Fried Oyster MushroomsChrissy’s Rum-Soaked Fruit and Coconut Sundae recipeChrissy’s Rum-Soaked Fruit and Coconut Sundae videoHow to ListenListen to this episode through the audio player on this page or subscribe via Apple Podcasts, Spotify, or wherever you get your podcasts for all six episodes. If you love the show, be sure to rate and review. It helps us keep putting out the good vibes.Explore Bon AppétitCulturePodcastsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-01", "author": ["Condé Nast", "Bon Appétit"]}