{"id": "fcbac2ac7f0aab4663b97bcab4e9ede9", "url": "https://www.bonappetit.com/story/never-buy-dollar-slice-pizza-again", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "Why I’m Never Buying Dollar Slice Pizza Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy I’m Never Buying Dollar Slice Pizza AgainAn argument for the $4 investment.By Alex DelanyJanuary 7, 2019FacebookTwitterEmailFacebookTwitterEmailWhen PIZZA opened on the corner of Girard and Shackamaxon in Philadelphia’s Fishtown back in April 2018, people complained. Maybe it was because another pizza joint was taking over the hallowed ground where Joe Beddia had been slinging 40 pizzas a night for five years, before closing last April to relocate and expand. Maybe it was because residents didn’t want another pizza shop in Fishtown. But from what I heard, it was because it was expensive.Seven blocks east on Girard, Tommy’s Pizza sells a whole cheese pie for $7.00. A block further, Fishtown Pizza does too. So why would you ever pay $4.00 for a single slice at PIZZA (yes, the shop’s name is just PIZZA) when you could get a whole pie for three dollars more? If you ask me, it’s because cheap pizza is actually a terrible investment. If you want a good slice, you have to pay for it.It’s long been assumed that all pizza is created equal: made with the same ingredients, using the same techniques, requiring the same overhead investment. That assumption should be buried. We’re past that. We’re in the midst of a sea change, as our everyday American slice evolves, improves, and yes, gets pricier as a result. If you need proof, go ahead and take note of the pizzerias leading the charge toward a more wholesome, delicious future.There’s Scarr’s Pizza in Manhattan, which mills all their grains in-house to create fresh flour for the dough each day.  At Brooklyn’s L’industrie, they let their dough ferment for three days, as opposed to overnight like most run-of-the-mill slice shops. At PIZZA, the produce is organic, and bought from Riverwards Produce, a grocer that works with local organic farms. Look to the crew at Pizza Jerk in Portland, OR. Or the team at Belleville in Portland, ME. Or the folks at Dino’s Tomato Pie in Seattle or Home Slice in Austin, TX. They’re all rising above the bar. Sure, it means they sell their slices for around $4.00—roughly twice (or three times) as much as their neighboring joints handing over a wedge. But they’re all worth it.Pizza, like most foods, can only be as good as the ingredients from which it’s made. Longer fermentation means superior crust texture. Freshly milled flour means healthier, more flavorful dough. Organic produce from small farms means a healthier planet, happier farmers, and profits reaped by the people who actually put the effort in. All of these commitments require extra time, labor, and money from pizza makers, and they all make the stuff taste better. They also make a slice more expensive. But that’s not to be exclusive, alienating, or elitist.“A person should pay what they’re comfortable paying for anything,” says Josh Phillips, PIZZA’s general manager. “If they’re willing to spend the extra clams then they’re surely in for a treat, but it’s up to that person to decide if it’s worth it.”That's what PIZZA's $4.00 slice looks like. And it tastes even better.\nPhoto by Alex DelanyAt many of the average slice shops in existence today, you’re shelling out for two things. The first is mediocre ingredients. White flour treated with potassium bromate, an additive that strengthens weak dough. Pepperoni loaded with non-meat fillers. And cheese that tastes nothing like milk. These ingredients are not valuable for anyone except the pizzeria, since they are cheap and increase profit per slice.The other is reputation. Slice shops, especially in the Northeast, are usually judged by their history, the neighborhoods in which they reside, and the people with their names on the buildings. Slice shops in Manhattan like Joe’s Pizza or Ray’s Pizza are applauded for their pasts and the reputations they built as the best slice shops of their time. But the thing that most customers fail to realize is that while the their technique might be proven, they’re still using the same ingredients as any other run-of-the-mill slice joint.History and reputation alone don’t taste like anything. If you’re paying for a slice because it’s billed as “traditional” or “authentic” or “the same since 1957,” you’re making a bad investment. If you’re paying $4.00 for exceptional ingredients, masterful technique, and the kind of product that has the potential to elevate the pizza industry across the board, you’re getting considerably more bang for your buck. It doesn’t matter if you’re judging from a taste perspective, a quality perspective, or a perspective that takes the future of the industry into account. Spending the $4.00 is a win-win-win. And if you’re already willing to spend five bucks on a cappuccino or a poorly made umbrella, what’s holding you back?In New York City's Lower East Side, Scarr's Pizza mills fresh flour for its pies every morning.\nIt all comes down to what your slice is actually worth. After eating a slice at a place like PIZZA, the next late-night dollar slice or 2-for-$5 pepperoni special comes with some context. People will hopefully start thinking about why cheap food is cheap, and what that low-cost mentality means for the industry. Faced with the choice, ask yourself: What exactly am I paying for? What are these dollars, whether they be two or four, going toward?Shops like PIZZA are going to make American pizza better across the board. Being complacent in the pizza game isn't going to be an option for the pizzerias using flavorless flour and industrial toppings. If business owners want to compete with this new wave of pizza visionaries, they’re going to have to step up. Eventually, all pizza-shaped ships will rise with this tide.My good friend Benjamin Franklin once said, “When you are finished changing, you’re finished.” We need to embrace and support the people who are making this change happen. We need to make sure that these new slice shops develop the reputation of being the best, not because of their history, but because their pizza actually is the best. For them. For us. For the environment. For everyone. And we do that by paying for it. Take my $8.00. I’m getting two.Now, you need to know how to eat that slice:A Long Answer to a Simple Question: How Do You Eat a Slice of Pizza?The fold. The toppings. The location. The drink. It all matters. Maybe even too much.View StoryExplore Bon AppétitPizzaDoughCheeseTomatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-07", "author": ["Condé Nast", "Alex Delany"]}