{"id": "fcbbd0aab4167626721a966d3b84de27", "url": "https://www.bonappetit.com/story/how-to-fold-a-galette", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "How to Fold a Galette Like a Professional | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Fold a Galette So It's Rustic But Not TOO Rustic It's not a pie—but it can still look pretty. By Sarah JampelApril 7, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan SpungenFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.You know how there’s a difference between “dirty” and “messy” (...or so claimed my college roommates)? Well there’s also a difference between “rustic” and “crude.” Maybe you’d be able to guess where my galettes usually fit in? Always slightly misshapen and bulged, they’re the same shape a three-year-old might draw when attempting a circle.But there’s an easy trick for making galettes that look neat and tidy (though still easy-going and low-key, of course), no matter how amoeba-like your dough appeared when you first rolled it out. And that’s simply to make slits along the border at even intervals before you start folding. Pile your filling into the middle, then use a knife to slice from the border of the dough to the border of the filling. (Make sure you’re working on a sheet of parchment paper at this point so that you can easily transfer the shaped galette to the baking sheet.)It doesn’t matter whether the slices are straight or slanted—when you fold each one in, they’ll overlap neatly, creating a shingled effect. The result is an even, uniform crust with no gaps or tears. You’ve essentially just crimped your galette, which, in my book, is the treatment it deserves.And no one will mistake your galette for a three-year-old’s.Get the recipe:Triple-Threat Onion GaletteNot just a clever name, this savory tart combines three alliums (scallions, garlic, and onion) for maximum flavor and crispy-jammy texture. The key to the flaky crust is to move fast! Rolling and folding the dough while the butter is still cold creates distinct layers of butter and flour that will steam apart during baking, making the crust light and flaky.View RecipeExplore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-07", "author": ["Condé Nast", "Sarah Jampel"]}