{"id": "fcee99068c785ee8d46df32d10a4177c", "url": "https://www.bonappetit.com/story/a-certain-hunger-chelsea-g-summers", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "The Dark and Twisted Novel You Should Read This Dark and Twisted Winter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Dark and Twisted Novel You Should Read This Dark and Twisted Winter“A Certain Hunger” by Chelsea G. Summers will have you rooting for a murderous restaurant critic.By Alex BeggsDecember 17, 2020FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.It was the “semeny chowder” that did it for me. That was the moment I realized Chelsea G. Summers’ new novel, A Certain Hunger, went to the place we, Bon Appétit, and I, writer lady, never go. A place where sex and food entwine so grossly and explicitly that it makes you laugh, scream, and need a drink as stiff as this innuendo. This book is crazy. You have to read it.The premise is: An esteemed old-school restaurant critic loves to kill the men she sleeps with. And eat them. (We’re talking about a pair of braised butt cheeks—”roast rump”—here and a skinned tongue there, not like the whole bod. She also cooks them straight-up gourmet: A lover’s liver is turned into pâté and spread on Tuscan toast.) The book made me...hungry? How? Maybe I have some soul-searching to do.The novel’s narrator, Dorothy Daniels, would probably be delighted to hear this, tapping her fingers together in her cell at Bedford Hills Correctional Facility, where she eats barely edible mush and tells us her story. “You and I are the same,” she writes. “You may not admit it aloud, but I know you will read this book and wonder how your lover would taste sautéed with shallots and mushrooms and deglazed with a little red wine.”Summers does a pitch-perfect impression of the highfalutin restaurant critic amped up on expensed rib eye and good Barolo, intoxicated by adjectives. It took me a few chapters to get into the narrator’s tone—as lofty as her six-foot frame, as fiery as her red hair—and love for food metaphors (she describes a cop as “worth his weight in crullers”). But once I did, I was rooting for this psychopathic, super-horny murderess until the last page.It’s American Psycho meets Ruth Reichl’s Save Me the Plums. Summers’ knife is twisted in Bret Easton Ellis’s book spine—she credits his influence in her acknowledgments. And, like Reichl—whose writing celebrates food’s kinky side—Dorothy earns the fat paychecks of magazine writing in the ’80s and ’90s, then adapts, and blogs, through the early 2000s. It’s a nostalgia Negroni: bitter, bracing, and barely sweet. But I skimmed that part—I’d rather get straight to the murder of men than relive the slow bloodletting of the publishing industry.We know that Dorothy gets caught eventually. But how? That question keeps you turning page after gory page. Where other thrillers string us along to figure out whodunnit, as we follow Dorothy’s murder streak, we’re wondering: But how did she cook this one? Each kill is more inventive and delicious (sorry, but true), than the last. It’s notable how often duck fat appears, considering there’s a jar of it in my fridge right now...Summers writes in her acknowledgments that the book was rejected by 25 publishers. Too lovable a cannibal? Too many references to the narrator’s labia? Too bad. It was ultimately published by Unnamed Press—and was almost immediately sold out on Amazon.A Certain Hunger will have you thinking about the taste of human flesh deglazed in red wine, which feels like a nearly illegal sentence to write. Go to the dark place and let it rattle you. The book also sparked a minor personal existential crisis about how I write about food. What are my limits? I want to compare these Trader Joe’s smoked salmon “fleurettes” to labium, which they resemble uncannily, so what’s holding me back? When did my food writing become so PG-prudish? For a brief moment, as I, yes, devoured, this book, I indulged in the possibility of going there.A Certain Hunger$26 at Amazon$23 at BookshopExplore Bon AppétitBooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-17", "author": ["Condé Nast", "Alex Beggs"]}