{"id": "fcfe14f45b8edcd3d41d6b2e2e316057", "url": "https://www.bonappetit.com/recipe/labneh-and-lime-ice-cream-with-granola", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Labneh and Lime Ice Cream With Granola Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueLabneh and Lime Ice Cream With GranolaBy Sarah JampelJune 2, 20204.7(10)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintTangy labneh gives this no-churn ice cream serious Froyo vibes. It’s creamy, lime-y, and maaaybe even healthy?! With the crushed granola, you could almost eat it for breakfast.IngredientsMakes about 2 quarts½cup labneh (Lebanese strained yogurt) or 1 cup plain whole-milk Greek yogurt¾cup (75 g) granola114-oz. can sweetened condensed milkZest and juice of 2 limes¾tsp. kosher salt1½cups heavy creamSpecial Equipment2layers of cheeseclothPreparationStep 1If using Greek yogurt, set a fine-mesh sieve over a bowl; line with cheesecloth. Place yogurt in sieve and let drain in refrigerator 4 hours (you should have ½ cup); discard drained liquid in bowl.Step 2Pulse granola in a food processor to break up a bit. (Or roll up in a kitchen towel and gently crush with a rolling pin.)Step 3Whisk labneh (or strained yogurt), condensed milk, lime zest and juice, and salt in a medium bowl until smooth.Step 4Using an electric mixer, beat cream in a medium bowl, starting on low speed and gradually increasing to medium-high as it thickens, until billowy and stiff peaks form, about 4 minutes.Step 5Add a dollop of whipped cream to labneh mixture and mix in with a rubber spatula (this is just to lighten it so that the next stage—folding—is easier). Add remaining whipped cream and fold in, running spatula down sides and along bottom of bowl, then lifting up through center and over top while rotating bowl to integrate without deflating, until very few streaks of labneh mixture remain. Fold in granola; scrape ice cream base into a loaf pan that’s at least 8½x4½\". Cover with plastic wrap or an airtight silicone lid and freeze until solid, at least 8 hours.Step 6To serve, transfer loaf pan to refrigerator and let ice cream soften 10 minutes before scooping into bowls.Step 7Do ahead: Ice cream can be made 1 week ahead. Keep frozen.How would you rate Labneh and Lime Ice Cream With Granola?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleDelicious and super easy to make. Didn't need to freeze for 8 hours; 4 hours was fine. Will be making often. Granola made a nice texture contrast. My husband doesn't eat labneh or yoghurt so I didn't tell him that was what was in it; he loved it and went back for seconds.Anonymous11/22/2020Lovely recipe Sarah!  we made it into popsicles,  it made 18 using the Ikea molds.  We used non-fat yogurt (what we had) and draining didn't make a difference, even after 6 hours.  We also experimented with the granola given how divisive it was. the 1st 6 popsicles had no granola, the next had only a little at the base (top when loading the molds) and the last 6 had it stirred in.  My family voted unanimously for stirred in.  Our granola is a homemade honey almond granola.  I did pick out the dried fruit in the mix (golden raisins) as I was thinking they would be too hard and chewy when frozen. Next time i'll add even more lime juice and zest, as we like our sour flavors to be truly tart.  The texture was fantastic. I appreciated how obviously flexible this recipe was, given that I was mucking with it from the beginning and it still stayed true to its flavor profile.  I don't usually rate recipes when I don't follow them more closely, but I felt like my adjustments are probably pretty common ones, so I'm going for it.  Make it!  leave in the granola!AnonymousDenver, CO8/3/2020Super Simple and delicious, was so excited to try this because labneh is one of my all time favorites. The ice cream had a wonderfully airy, light texture and the flavors translated similar to that of key lime pie. I used a couple of crushed up nut bars instead of granola. <3Chef_sadgalLos Angeles7/24/2020this ice cream is super delicious- with a few caveats. I will say that once in the ice cream, the granola tends to soften up so it's basically completely unnecessary as it doesn't provide the crunch you are looking for in otherwise creamy and sweet ice cream. I will also add that it is extremely sweet thanks to the condensed milk, and the flavour of the labneh is obliterated by other competing flavours. all that being said, it's delicious, and super easy. I served w baklava for my dad's birthday and it was a hit. toronto6/19/2020Flavor wise, this was very tasty. It has key lime pie vibes and the granola is a nice textural add. However this is verrrrrry rich. I felt like I was bordeline eating flavored frozen butter. Tasty, but I would serve this in smaller than usual amounts. wannappetit6/5/2020Explore Bon AppétitIce CreamFrozen DessertDessertLimeCitrusFruitSummer5 Ingredients or FewerEasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Sarah Jampel"]}