{"id": "fcff38ef11dcc4f43cd163f307990d64", "url": "https://www.bonappetit.com/story/sustainability-means-staying-rooted-brian-yazzie", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "Sustainability Means Staying Rooted in My Community | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsSustainability Means Staying Rooted in My CommunityFor Indigenous chef Brian Yazzie, this isn’t a new concept but a way of life.By Brian YazzieApril 22, 2021FacebookTwitterEmailPhotograph by Jaida Grey Eagle, prop and food styling by Rose DanielsFacebookTwitterEmailBeing an Indigenous chef, I think of myself as a land steward. It’s not just knowing my edible landscape but staying connected to the ecology of the food, knowing when to harvest and how much to harvest. The women in my life taught me this. My mom and auntie foraged for wild potatoes, lamb’s-quarters, and a lot of sumac on Navajo Nation in the Southwest, where I grew up. My grandma taught me traditional Navajo foodways, showing me how to use all parts of the animal and treat plants as medicine. Sustainability has been the natural way of life for Indigenous people, long before the term became popular.I learned to see food as art, the plate an empty canvas and the food my paint. Eventually, I started Intertribal Foodways, a catering company, with my wife, HoonMana Polk-Yazzie. We traveled the world, making Indigenous food with Indigenous ingredients for celebrity chefs, big food conferences, and tribal communities. But as we did this, I realized there was a gap. I was cooking with ingredients that were foraged or purchased from Indigenous farmers, trying to create fully decolonized recipes, while tribal communities were facing food insecurity and trying to survive on commodity food.Brian Yazzie, executive chef at Gatherings Cafe\nPhoto by Jaida Grey EagleWhen the pandemic hit we stopped traveling. Minneapolis has been my home base for the last decade, and I wanted to help my community. So I called Ben Shendo, a friend of mine who was the executive chef of Gatherings Cafe inside the Minneapolis American Indian Center, asking him what I could do. Two days later we cleared the café’s pantry and began cooking 250 hot meals a day for elders, using 50 percent native ingredients. In September, Ben left the cafe and I got the opportunity to take it over.Now I’m reimagining what Gatherings Cafe can be. I’ve prioritized not just hiring Indigenous womxn as cooks but having a gender- and nonbinary-balanced atmosphere to dismantle the patriarchy of the kitchen. We also started an internship program, run by our business manager Vanessa Casillas who is a citizen of Ho-Chunk Nation. It teaches Indigenous community members the basics of cooking as well as the fundamental Indigenous foods. Vanessa Casillas is Gatherings Cafe's business manager and internship coordinator and a citizen of Ho-Chunk Nation.\nPhoto by Jaida Grey EagleCasilla's crispy salmon with tomatillo salsa is a tribute to her father's Mexican heritage and Indigenous foodways. \nPhoto by Jaida Grey Eagle, prop and food styling by Rose DanielsWe’re working with Indigenous farmers, ranchers, and purveyors to support their work and communities. There’s Ron Brownotter of Brownotter Buffalo Ranch, who has been rearing bison for two decades on Standing Rock Sioux Reservation in South Dakota. Bison are indigenous to North America, and they represent the resiliency of Indigenous people. They’re not only crucial to our community but to the land; they restore the prairie ecosystems on which they graze, increasing plant diversity and reducing soil erosion. There’s Akimel O’odham farmer Ramona Buttons of Ramona Farms who grows velvety Teary beans with her husband, Terry, on reservation land in Sacaton, Arizona. These beans remind me of where I grew up. There’s elder Hope Flanagan of Dream of Wild Health farm just north of us in Hugo, Minnesota. She has shown our team how to forage for local dandelion greens. That makes me appreciate my current home.Strawberry tartlets with wild rice from Gatherings Cafe's sous-chef Rivianna Zeller.\nPhoto by Jaida Grey Eagle, prop and food styling by Rose DanielsZeller comes from the Bad River Band of Lake Superior Ojibwe.\nPhoto by Jaida Grey EagleWe’re still cooking for elders—sometimes it’s a meal kit, other times it’s a hot meal—and plan to continue doing that. Rivianna Zeller, a sous-chef who comes from the Bad River Band of Lake Superior Ojibwe, has been finding ways to make desserts for them that don’t rely on dairy, processed sugars, and flour since those aren’t native ingredients. So they came up with palm-size berry tarts with crisp shells made of Native Harvest wild rice. Eventually, I’m hoping we can serve sit-down dinners, featuring dishes made with the same native ingredients we feed the elders and recipes from my team, like Rivianna’s berry tartlets and Vanessa’s seared salmon with a smoky tomatillo salsa.My definition of sustainability is staying rooted within my community. It means not only creating art on the plate or feeding those in need but focusing on our plant relatives, having mutual relationships with farmers, and understanding our responsibility with the land. That’s what I’m doing at the café through reintroducing Indigenous food to native communities. I see it as a full circle.Make Yazzie's recipes:Beans and Greens Salad With Cranberry-Sumac DressingThis salad is a textural dream—creamy Tepary beans, sturdy dandelion greens, crumbly goat cheese—but our favorite part might be the bright cranberry-sumac dressing.View RecipeBison Rib Eye With Pickled VegetablesSmoked salt and herbs add depth and sweet pickled radishes bring some zing to this bison rib eye.View RecipeExplore Bon AppétitSustainableFirst PersonRestaurantsChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-22", "author": ["Condé Nast", "Brian Yazzie"]}