{"id": "fd0db359409e4188cee57f76b8c4fee6", "url": "https://www.bonappetit.com/story/breville-smart-oven", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Best Countertop Oven: Breville Smart Oven Review By Professional Baker With a lot to Bake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf Your Oven Is the WORST, Consider This Precise Multifunctional Countertop MiracleI’m a baker with a terrible oven, and this small guy is my saving grace.By Yossy ArefiApril 27, 2020FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.A few months ago, I was baking my way toward an insane deadline for my new book when my oven broke. I had what felt like a bazillion more recipes to test when it happened. But honestly, I wasn’t even upset to see it go. My old Chef Master was never a particularly great appliance. It was at least 20 years old, wildly inconsistent in the temperature department, and heated up the whole apartment in no time flat. As a renter, I didn’t have much choice in its replacement—or how quickly (or not) it would come. But luckily, I did have a little ace up my sleeve.At first glance, the Breville Smart Oven doesn’t look like more than a larger-than-average toaster oven. But don’t let its small stature and cute twisty knobs belie its power and functionality. This little appliance got me through that stressful, flour-dusted time, baking approximately one million cakes, one after another, for a couple months straight, all at a very consistent 350ºF. But it wasn’t just that trial that earned this countertop oven’s permanent place in my heart, and on my counter. And right now, it’s proving more clutch than ever.I’ve used it for toasting a handful of nuts (which saves more energy than if I used a regular oven!). Cooking a whole chicken (the convection setting, which even many full-size models lack, makes the skin extra crispy and the roasted veggies super caramelized!). Making finicky meringues (so much temperature precision!). It’s just the right size for a personal pan of nachos, but big enough to accommodate a 9x13 dish of your favorite comfort casserole or a quarter sheet pan of focaccia. It goes up to 450ºF, and you can broil to your heart’s content. Plus, it’s got a bunch of settings for heating specific foods like pizza and bagels and toast (six slices at a time!)—and one for leftovers, too.This focaccia could be yours…\nThese days, though, my favorite use for this countertop oven is pretty simple. Just about every night, I’ll bake off a couple of fresh chocolate chip cookies from the stash of dough in my freezer, so my boyfriend and I can enjoy a warm cookie on the couch without turning on the full-size oven (yes, we finally got a new one) or heating up the entire apartment.Is it pricey for a countertop appliance? Definitely. But if you have the room in your kitchen and the space in your budget, you might like having one of these around—whether you absolutely love your full-size oven, or not.Breville Smart Oven Pro$525 $280 at Sur La Table$280 at Bloomingdales'sYossy Arefi is a food photographer, food stylist, former professional baker, and the creator of the blog Apt. 2B Baking Co. Her second book, Snacking Cakes, will be out next fall.Explore Bon AppétitShoppingproductRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-27", "author": ["Condé Nast", "Yossy Arefi"]}