{"id": "fd15af71edf71f09c8463195f8a6ed24", "url": "https://www.bonappetit.com/story/tips-for-better-sheet-pan-dinners", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "Your Sheet-Pan Dinners Can Be Better—Here's How | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking10 Tips for Better Sheet-Pan DinnersIf your sheet-pan dinners consist of a jumble of random ingredients, you need to read this.By Anna StockwellMarch 28, 2018FacebookTwitterEmailFacebookTwitterEmailA sheet-pan dinner—where everything is roasted all together on one rimmed baking sheet—is a weeknight go-to for us, and not just because it means less dishes to wash. The best sheet-pan dinners are as beautiful and complex-tasting as any meal you spent hours (and many, many pots and pans) crafting, with contrasts in texture and flavor. But if you think all you've got to do is crank your oven, grease up your favorite rimmed baking sheet, and then pile it with everything you want to eat for dinner and roast it until it’s done, you're probably not living your best life. To build the best sheet-pan dinner, it helps to follow a few guidelines.1.Buy a Commercial-Grade Half Sheet-PanThe kind of sheet-pan you use to build your sheet-pan dinner on matters. The standard size for a half sheet-pan (or “rimmed baking sheet”) is 13\"x18\". All of the sheet-pan dinners we develop in the Test Kitchen are developed to fit perfectly on that size pan—try making one of those recipes on a smaller jelly roll pan or cookie sheet and it won’t work. And don’t be tempted by the nonstick options—the best sheet-pans are made of heavy duty uncoated aluminized steel or natural aluminum, which will age beautifully and develop a nice coating of seasoning the more you use them. We like these $10 ones from Nordic Ware. They’ll give you nice even browning and stay flat and sturdy for your whole life. Get two or three and use them well.2. Pair Proteins and Vegetables That Have Similar Cook TimesIf you want to build a sheet-pan dinner, you have to be a smart roasting matchmaker. Because if you set up proteins and veggies on hot dates in the oven that finish cooking at radically different speeds, you’ll have a bit of a hot mess on your hands of burnt green beans next to perfectly cooked chicken thighs. Set up vegetables and proteins that will be happy hanging out in the same temperature oven for the same amount of time. Those green beans will cook at the same rate as a fish fillet—try pairing them with halibut for a roasted take on nicoise salad. And with those chicken thighs? Try hearty whole carrots—they’ll be done at the exact same time.Check out our guide to how long and at what temp to roast vegetables for here, and bookmark this handy guide too while you’re at it.Sheet-Pan Pizza with Brussels Sprouts and SalamiThere is no higher calling of the humble Brussels sprout than this cheesy, crispy, can't-stop-eating sheet-pan pizza.View Recipe3. Or Don’t, and Just Add Them in StagesNot everything has to hang in the oven for the same amount of time to make it a good sheet-pan dinner: You’re allowed to open and close that oven door and add or take things away as many times as you want to. So, just because two things cook at different rates doesn’t mean you can’t put them together—you just need to add them at different stages during the process of roasting. For a fish dinner with potatoes or other root vegetables, roast those veggies until they’re almost done, then slide the fish on top and continue roasting until the fish is just cooked through and your veg are nice and toasty, like this baked snapper with new potatoes and spring onions. Or say you’re cooking chicken parts alongside sweet potatoes, and when you check it your chicken is cooked through but those sweets aren’t quite tender yet. Just pull the done parts out and keep roasting everything else until it’s just where you want—no one’s going to be mad at you for that.Look at that patina!\nPhoto by Alex Lau4. Season Each Element Separately (or Don't)Just because you’re cooking everything on the same sheet pan, doesn’t mean everything has to taste exactly the same. Consider coating your chicken in a sauce, but keeping your vegetables simply seasoned with salt and pepper or perhaps a pinch of a ground spice that compliments the flavors of your chicken sauce. For this chipotle-rubbed chicken dinner, each section of vegetables and chicken is seasoned separately before being roasted alongside each other.But sometimes you want to toss just everything together in the exact same spice mixture and roast it in a happy jumble, and that can be a good thing too, like in this chicken thigh dinner with squash, fennel, and grapes, or this one with potatoes and olives, both of which use the same spice mixture to season the chicken and the veg.5. Know When to Layer, Mix, and SeparateHow you place things on the sheet pan matters too. If you’re cooking vegetables that need to be tossed midway through roasting—like this mixture of bok choy, cabbage, and mushrooms—alongside a piece of fish that most definitely does NOT want to be tossed, you should keep them on separate sides of your sheet-pan so you can toss the veg without disturbing the delicate fish. If you don’t need to do any stirring or flipping of any of the elements, and you’re going to just slide everything off the sheet-pan together onto a serving platter, then mix them all together in an even layer to roast. And if you’re roasting something like citrus slices whose juices will benefit the things below it, you should absolutely make sure that thing gets placed on top of everything else before your sheet-pan dinner goes in the oven.The Best Cooling Rack Will Reward You With Crispy Fried Chicken and Tender CakesAnd yes, you can use it for sheet-pan cooking too.View Story6. Utilize Your Cooling RackSpeaking of layering, you can also use an ovenproof wire cooling rack that fits inside your 13x18” rimmed baking sheet to build layers. Do like we do in this recipe and layer a mixture of broccolini and white beans underneath a steak that sits on top of a cooling rack and drips delicious balsamic drippings as it broils.Or if you’re roasting something you want a lot of air to circulate around to make sure it gets crisp—like  breaded cutlets or fish tacos—a wire cooling rack set inside your sheet-pan is the way to go, and will forever make you think twice about going through the effort of frying cutlets.7. Sometimes Two Pans Is Better Than OneDon’t torture yourself trying to fit everything onto one sheet-pan just so you can say you cooked the entire meal on one sheet-pan. Sometimes, two sheet-pans will afford you greater control, and giving you the freedom to wilt and crisp a whole bunch of kale to add to your chicken dinner, or roast some corn to go with those crispy fish tacos.8. Roast Things that You Can Turn into a SauceThink beyond roasting and eating every element of your sheet-pan dinner exactly as it comes off the sheet-pan— try transforming part of it into a sauce. That could be as simple as roasting a head of garlic in the corner of the sheet-pan that you whisk into mayo for a cheater’s aioli, or it could be as advanced as roasting salsa ingredients alongside chicken and squash to blend into a salsa like in this new recipe of ours. Bonus points here for also using the pan drippings as the flavor-packed liquid base of the salsa.9. Make Your Broiler Work for YouWhen you need a bit of extra browning and crisping on your meatballs or your chicken legs, just turn your broiler on at the end of roasting and blast it until your desired level of crispiness is achieved. Don’t walk away from the oven during this process—watch dinner like a hawk while you give it the crisping finish under the broiler. Everyone’s broiler is different, and yours might be faster or slower than expected. You can even cook the whole sheet-pan dinner under the broiler, which works especially well for quick-cooking fish, like these cod fillets with broccolini and white beans.10. Add Raw Elements at the EndNot everything has to be actually cooked on the sheet-pan for it to be a good sheet-pan dinner. Add a bunch of fresh herbs on top of everything, or thinly slice some radishes to scatter over each serving. Or make a no-cook sauce. Or throw some baby arugula over the whole thing. Turning what you roasted on one sheet-pan into a complete dinner might need some last minute raw additions to keep it feeling fresh and fun. So live it up with those garnishes—they taste as good as they look.What're you waiting for? Go make dinner already!Chipotle-Rubbed Chicken Sheet-Pan DinnerSweet-spicy chipotle chicken, zippy roasted tomatillo salsa, and spice-rubbed squash all on one sheet pan.View RecipeExplore Bon AppétitBasicallySheet-Pan DinnersRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-28", "author": ["Condé Nast", "Anna Stockwell"]}