{"id": "fd157cc1bbe87c5eb6b913c7bdb93361", "url": "https://www.bonappetit.com/story/healthy-fudge", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "A Healthy Fudge Recipe You Can Eat Straight From the Fridge | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Healthy Fudge Recipe You Can Eat Straight From the FridgeSummer is for fudge, but that doesn't have to mean sugar hangovers too.By Amanda ShapiroJuly 23, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kat BoytsovaFacebookTwitterEmailIt's weird that fudge is a summer food. Dense, rich, and hardly immune to heat and sand, it's nowhere near as refreshing as ice cream yet somehow just as ubiquitous in beach towns up and down the Eastern Seaboard. When I was a kid, my favorite fudge was chocolate peanut butter, specifically the chocolate peanut butter at a fudge shop on Block Island, RI, which I ate every summer until I was sticky-fingered and sugar-sick. I still want fudge in the warmer months—but nowadays it's the nostalgia I'm after more than the sugar rush. That's why I peer-pressured Chris Morocco into developing a healthyish version that I could eat a whole square of without crashing my blood sugar...or having to trek to the beach.There are a lot of healthy fudge recipes out there, most of which involve tons of coconut oil or other liquid fats. To keep their fudgey consistency, most of these versions need to be eaten straight from the freezer. Morocco, always down for a challenge, decided to figure out a fudge recipe that didn't require an arctic blast to keep from melting. (He also hates peanut butter in sweet foods, so he subbed almond butter; I'm here to tell you that peanut butter or any other nut butter will also work.)This fudge recipe uses only ⅓ cup of almond butter, and the rest of the fat comes from half an avocado, which helps ensure that the fudge will be soft—not liquid—at room temperature. Maple syrup sweetens and binds, cocoa powder and melted bittersweet chocolate give it plenty of deep chocolate flavor, and it all comes together in under ten minutes in a food processor. After chilling it in the fridge, you'll end up with a dense, nutty, chocolatey fudge that rivals the real thing in texture but is just sweet enough.If you're nervous about the avocado, don't be. You won't taste it, but it will deliver the decadent creaminess that butter usually lends to fudge. Just be sure that the avocado is fully blended with the almond butter and maple syrup before adding the other ingredients because no one wants their fudge streaked with greenish-brown.And while it's fine to eat at room temperature, this fudge does need to be chilled in the fridge for at least an hour before cut, and you can store it in the fridge, wrapped in plastic, for at least a week. Pack a square in your kid's lunch, take it to work for an afternoon treat, or do as I did and bring some to the beach on a 90-degree day. It'll get a little melty and a little sandy...just the way fudge should be.Get the recipe:Chocolate-Almond Fridge FudgeThere's a secret ingredient that helps replace the dairy in this vegan, fudgelike treat. Just kidding; it's not a secret...it's avocado!View RecipeExplore Bon AppétitHealthyishSummer DessertsHealthy DessertsDessertRead MorecookingThese Chocolate Tahini Bliss Balls Are Perfect for Breakfast, Snacking, AND DessertBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-23", "author": ["Condé Nast", "Amanda Shapiro"]}