{"id": "fd1ee255c004d5477ed16cf5a556c7f9", "url": "https://www.bonappetit.com/story/break-out-the-good-stuff", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "There's No Better Time to… Break Out The Good Stuff | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusThere's No Better Time to… Break Out The Good StuffFrom Champagne to fancy pecans, here's what BA staffers are finally getting into.By MacKenzie Chung FeganApril 15, 2020FacebookTwitterEmailPhoto by Hayden SpearsFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. This week: Go ahead and open that can of fancy tuna.There are the people who eat their favorite Halloween candies first, and then there are those who save the best stuff for last. I fall into the latter camp. Stashed away on the top shelf of the pantry and the back of the bar cart are small luxuries that I’ve put away for a rainy day, like a squirrel with a scarcity mentality.This week something snapped. If not now, when? What exactly am I saving an inch of good Cognac or a small handful of Danish licorices for if not a literal global pandemic? We’ve been stripped of so many small pleasures, from hugging our friends to eating a croissant from a favorite bakery. Couple that with the larger, weightier losses many have suffered—from jobs to a sense of security to loved ones—and the only recourse is to find joy where we can. And so a couple of nights ago, I drew myself a bath, willing myself not to skimp on the fancy bath salts I was gifted four years ago, and poured myself the last few sips from a bottle of BenRiach 25-year-old Scotch. It’s my birthday on Sunday, but even if it weren’t, this weekend’s plans would involve oysters ordered from my new fish delivery guy and a bottle of Besserat de Bellefon Champagne that’s been chilling in my fridge since last fall.This is the emergency. Take the tiny hammer and break the glass.I asked some Bon Appétit staffers about what Special Occasion Treats they’ve been dipping into:Hilary Cadigan admits that she probably should have eaten her fancy pecans from the Peach Truck long ago, but instead she’s been hoarding them in her freezer, rationing them out to top her ice cream. Their time is finally up. Hilary says, “I'm going to bite the bullet and bake them all into my next batch of brownies.”Joey Hernandez and his significant other are having “active discussions” about breaking into their micro-cellar of Bordeaux, Barolo, and Champagne. Their anniversary last week went largely uncelebrated, so if I may weigh in Joey—one of each.It's a fine time for wine time.\nPhoto by Alex LauAliza Abarbanel has been socking away her stash of Rancho Gordo’s poignantly named Royal Coronas—plump beans so big they rival the size of an eight-year-old’s ear. She saved them for months, cooked them last week, and just finished off the last frozen container in a blaze of lunchtime glory.Alex Beggs, a creature unlike any other, usually saves her blocks of cheap cheddar for special occasions. But the last couple of weeks have seen her tear into her off-brand cheese and the stash of HEB tortillas she keeps in the freezer with reckless abandon.Sarah Jampel treasures pearl sugar like actual pearls: “It's one of those ingredients that you can only get off the internet, and I've been hiding a quart-container's-worth in the back of my pantry for...years now, using a tablespoon at a time to sprinkle atop homemade danishes or the most special of muffins.” But she’s throwing caution to the wind and gearing up to make liège waffles, “which incorporate cups of pearl sugar for caramelized edges and punctuations of crunchy sweetness.”Christina Chaey is to luxe pantry items as her dad is to credit card points: “we hoard and hoard without knowing exactly what we're saving for.” She’s kept a precious tin of El Capricho tuna hidden away until this week. What broke her? “The warmest spring day yet, which made me crave a highly specific lunch of cold boiled potatoes, a lemony salad of crisp lettuces and herbs, and a mound of the rich, rosy tuna with flaky salt and a squeeze of fresh lemon. Perfection.”Bryan Fountain is eyeing the “tube of foie gras in the fridge I was saving for I don’t know what,” but he’s afraid it’s too much for him to eat alone—his girlfriend is a vegetarian. Eat the tube, Bryan. Eat the whole damn tube.Explore Bon AppétitThere's No Better Time CoronavirusBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-15", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}