{"id": "fd318c5b3ccee9499b0832d9904d41cd", "url": "https://www.bonappetit.com/recipe/peach-aperol-spritz", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "Peach-Aperol Spritz Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssuePeach-Aperol SpritzBy Rachel GurjarAugust 5, 20213.7(15)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis bubbly peach sangria is one of our favorite ways to use up all those ripe, fresh stone fruits we bought at the farmers market. It’s tangy, a little sweet, and extra fizzy, which also makes it perfect for your next outdoor summer party. If you’re in a pinch and can’t find perfect peaches, don't sweat: The frozen ones work surprisingly well, too.Ingredients6 Servings1lb. ripe peaches or nectarines, cut into wedges, or frozen, thawed sliced peaches2oz. Aperol½oz. Averna amaro1lemon, sliced1orange, sliced1750-ml bottle chilled sparkling roséPreparationMuddle peaches in a large pitcher to crush lightly. Add Aperol, Averna, lemon slices, and orange slices. Pour in rosé and stir gently to combine. Pour into glasses to serve.How would you rate Peach-Aperol Spritz?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleRosé with hints of Aperol and a fleerting wisps of Averna. Disappointing. AnonymousGeneva, Switzerland 8/6/2021I was really disappointed in this. The fruit added no flavor and there was very little flavor from the Aperol or Averna. The fruit sucked up most of the bubbly and we only got two glasses out of it (and it took 4 peaches!). I couldn't let it sit because the bubbles would dissipate and it would warm up. Frustrating.Mari K-CGrand Rapids, MI7/18/20212 oz in the whole pitcher! The rosé is what makes it boozy. The aperol is more for flavor here. It's a sangria riff.AnonymousOregon7/14/20212 Oz of aperol in the whole pitcher? Or per glass? Is this a typo? Just want to make sureAnonymousCalifornia7/13/2021Explore Bon AppétitCocktailDrinks AllPitcher DrinkPeachStone FruitFruitAperolAlcohol & Other DrinksNectarineChampagneSummerDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Rachel Gurjar"]}