{"id": "fd31157f112645c7a8d3b4ad57eea465", "url": "https://www.bonappetit.com/story/o-thou-my-generous-rossis-ristorante", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "O Thou, My Generous Rossi’s Ristorante | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsO Thou, My Generous Rossi’s RistoranteAn ode to portion sizes.By Kelly ConaboyApril 16, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.There is a place where the pasta runs wild.In heaps and in mounds it’s piled and piled.“Just a side for me,” you will say, unawareThat what you’ve just ordered could feed Delaware.The restaurant’s Rossi’s; it’s outwardly mild.In Archbald, PA, it’s Italian-styled.A friendly corner place for the small-town’s folk,But oh God, the portions—they’re simply no joke.Its meatballs are boulders, they conquer a plate,Ready to squash kingdoms just lying in wait,The size of your head, no, yours and your brother’s!Saved for later meals by Archbald’s kind mothers.The chicken Parm’s bigger than both of your hands,Completely destroying your clean-plate-club plans.It comes with unlimited side salad tooAnd a bowl of pasta that feeds forty-two.*The gnocchi is lush; the polenta’s a scene.Offered only on Wednesdays, it is rare cuisineServed up on a slab, lumped high and abundant.It’s big!—at the risk of sounding redundant.Serving size is exalted on websites like Yelp.The portions are “HUGE,” wrote this one guy named Kelp.(His name wasn’t Kelp; it was, in fact, Kevin.Just needed a rhyme, and now one for Kevin.)Rossi’s is a staple for family and friendsFor when you need comfort and meals without ends.It sticks in my mind from childhood’s wonder,Lugging home leftovers, that heavy plunder.Will I ever grow large and hungry enoughTo finish my dinner, to call Rossi’s bluff?I have to say, hmm, I think probably not.I’d have to be starving. They give you a lot.*Or a side of vegetables.Kelly Conoboy is a writer-at-large at New York Magazine’s The Cut.Explore Bon AppétitItalian AmericanRed SaucePennsylvaniaRestaurantsRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Kelly Conaboy"]}