{"id": "fd35eff6bc63e9d13ab1493bb6c544c9", "url": "https://www.bonappetit.com/story/community-fridges", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "7 Ways to Meaningfully Stock Your Local Community Fridge | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersLifestyle7 Ways to Meaningfully Stock Your Local Community FridgeWe consulted mutual aid experts for advice on how they work and what we should be contributing.By Sara WeinrebMarch 25, 2021FacebookTwitterEmailFridge art by Reyna Noriega, taken outside The Polished Coconut in Miami, FL.Photograph by Valentina PerezFacebookTwitterEmailWhat if we spent as much care nourishing our communities as we do nourishing ourselves? Throughout the COVID-19 pandemic, community fridges and pantries have popped up across the country in response to increasing food insecurity, offering a practical way to support our neighbors. The concept is simple: outdoor, easily accessible fridges are stocked with homemade meals and food products; anyone is free to pitch in or take what they need.While community fridges are seemingly more visible than ever, the concept of mutual aid—the sharing of resources within a community—is nothing new. Throughout U.S. history, we’ve seen the surge of these efforts during times of crisis; for example, during the Great Depression, individuals formed cooperatives, often among immigrant and Black communities, to help chip in and provide health and life insurance during a period of historic unemployment. Mutual aid networks can activate quickly, effectively, and are often organized via social media (for example, take the swift show of support for snowstorm ravaged Texas).These grassroots enterprises aim to provide alternatives to government systems, which frequently fail to meet basic human needs for our most vulnerable members of society; and they catalyze when we need them the most. “In the aftermath of George Floyd’s murder, we saw activists all over the country getting involved in community action,” shares Eli Zain, founder of Denver Community Fridges. Since launching in December, Zain’s network has established six locations, with more on the way.Similar organizations have sprung up across the nation (from San Francisco to Miami), so chances are there’s a community fridge near you. If you’ve seen one around town and want to contribute, here are a few easy guidelines to keep in mind:Only put in what you’d want to take outDeciding what to drop off should be done with care. Think nonperishable goods, snacks, boxed meals, bottled water, juice, and bread. This is not a place to dump your leftovers or expiring food. While needs and requirements vary from community to community, Sophia Roe—chef, TV host, writer, and food welfare advocate—believes you should contribute something that feels special. Consider the season or upcoming holidays, and make care packages just as you would for family, neighbors, and friends. “The most important thing is,” Roe says, “if you wouldn’t eat it, and you wouldn’t use it, don’t drop it off.”Fresh produce is always a plusStocking fresh fruit and vegetables “gives people agency over their meals,” Zain notes. If you’d like, feel free to include a favorite recipe or tips for preparation. Not everyone who receives from the fridge has access to a kitchen and cookware, though, so grab-and-go items (such as apples or carrot sticks) also make great additions.Package with perishability in mind“Prepared items are most in demand for our houseless community members,” Zain says. Individually packed meals are ideal when possible. Roe recommends using mason jars for single-serving portions of homemade granola, soups, or salads. Be sure to label your homemade contributions with ingredients and the date you made them, too, and double-check with your local community fridge organizers that they accept homemade meals (not all do).Household items are welcomeIn some instances, contributions aren’t just limited to food. Miscellaneous home essentials such as sponges, dish liquid, hand warmers for cold days, and even menstrual products can be made readily available. Contact your organizers to find out more.Keep in touchYou can go a step further by leaving a card with your email address and other items you have to share, Roe suggests, so that people can stay connected and as for what they need directly. Or, if you’re receiving from a fridge or pantry, reach out to organizers to share your unmet needs, so they can inform the community.Get involvedIf you’re a local business, consider hosting a fridge outside your establishment. Artists, graphic designers, or marketing experts can lend their expertise to community fridge organizers and help amplify the cause. And if you can’t find a local fridge, many mutual aid networks accept donations, often via Venmo.Understand your impactContributing to these initiatives is more than a utilitarian solution; mutual aid can offer care in unexpected ways. Roe, who grew up experiencing food insecurity, knows firsthand the impact of these vital community resources. She still holds dear a memory from childhood: sharing with her mother a box of fancy pretzels they received from the local food pantry. “Here I am, 25 years later, still talking about that experience,” she says. ”You can change one person’s life, and you can do that with a box of pretzels.”Explore Bon AppétitHealthyishRead MoreLifestyleThis Online Group Taught Me the Joy and Solidarity of Buying NothingBy Iona BrannonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-25", "author": ["Condé Nast", "Sara Weinreb"]}