{"id": "fd36f8354591a4c55e3e789160dfe6bf", "url": "https://www.bonappetit.com/story/toasting-nuts-in-butter", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "To Exactly No One's Surprise, Toasting Nuts in Butter Is Awesome | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTo Exactly No One's Surprise, Toasting Nuts in Butter Is AwesomeWait. More fat? And more nuttiness? Yeah, we're interested.By Alex DelanyApril 30, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Pearl JonesFacebookTwitterEmailAfter decades of intensive studies and careful, involved experiments, we have gathered enough data to establish a general rule: Toasting something in butter will make it better. And that rule absolutely applies to any and all nuts. Walnuts. Cashews. Hazelnuts. If it’s a nut, it will taste better when you toast it in a skillet with butter. That’s science.And how could it not, right? Butter is just an unselfish giver in the flavor department. Especially when it’s salted. Nuts are already nutty, but when they’re tossed in butter that has started to brown, deeper levels of toasty, nutty flavor are unlocked. Your cashews now have double the fat and flavor, which makes them a workhorse, whether you’re using them as a topping or snacking them straight-up. And the process isn’t even close to involved. Here’s how to do it:Salted butter will give you more intense flavor, so we’re going to use that. The approximate ratio of butter to nuts is about 2 Tbsp. of butter for every 1 cup of raw nuts. This will give you enough butter to coat the nuts, but not so much that the nuts can’t pick up color from the pan.Heat your butter in a cast-iron skillet, Dutch oven, or sauce pot over medium heat. Once the butter has melted completely, add the raw nuts of your choosing. (You can do this with already-toasted/roasted nuts in a pinch, but they'll cook a lot faster and are much easier to accidentally burn.) It helps to crush the nuts slightly before adding them to the pan, so the surface area is increased and more butter comes in contact with the nuts.The butter will start to foam as the nuts toast. Don’t worry about that. That’s just the water being evaporated from the dairy. When the nuts have picked up a golden color, which will take about five minutes, they'll be perfectly toasted and super buttery. Be careful not to take them too far—they'll get a bit darker as they cool, and you don't want to accidentally burn your nuts or the butter. Brown butter is delicious; burnt butter, not so much.Using a slotted spoon, transfer the nuts to a paper towel and allow them to cool. You should take some time to think about what you want to use these for. As a pasta topping? Into it. Sprinkled over ice cream? Yes, excellent. As a textural element in a salad? Genius.You can toast whatever nuts you want! That's so exciting!\nPhoto by Ted CavanaughOr you could take a slightly different approach and make them as a snack. Adding an additional ingredient in with the butter as you melt it will take the flavor in another direction. Adding something spicy like sambal or sweet like garlic or herbal like rosemary can make these feel like a more legitimate snack.Not that we don’t co-sign eating butter-toasted nuts by themselves. We absolutely do. Like we said, toasting nuts in butter makes them better. And you deserve that kind of love.Or just use them in the pasta sauce.Tortellini with Brown Butter and SageStore-bought tortellini are the kind of weeknight hack we can get behind—especially when they're tossed with plenty of garlicky brown butter and toasty walnuts.View RecipeExplore Bon AppétitBasicallyButterWalnutCashewHazelnutPecanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-30", "author": ["Condé Nast", "Alex Delany"]}