{"id": "fd3761c8c371f8f322e9ddfd52f14514", "url": "https://www.bonappetit.com/recipe/spicy-creamy-chickpeas-with-runny-eggs-and-prosciutto", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "One-Skillet Creamy Chickpeas and Prosciutto Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueOne-Skillet Creamy Chickpeas with Eggs and ProsciuttoBy Andy BaraghaniFebruary 13, 20185.0(52)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintA fragrant and spicy tomato-cream bath gives humble chickpeas a taste of the good life in this weeknight dinner recipe.Ingredients2 servings 2Tbsp. extra-virgin olive oil2garlic cloves, thinly sliced1sprig rosemary (optional)115-oz. can chickpeas, rinsed1Tbsp. tomato paste1tsp. sweet smoked paprika1cup heavy creamKosher salt, freshly ground pepper2large eggs4thin slices of prosciuttoFlaky sea salt (optional)Flatbread (for serving)PreparationStep 1Heat oil in a medium skillet over medium. Cook garlic and rosemary (if using), tossing, until garlic is golden brown and rosemary crisps up slightly but isn’t browned, about 30 seconds for rosemary and 2 minutes for garlic. Transfer rosemary to a plate.Step 2Add chickpeas, tomato paste, and paprika to skillet and cook, stirring often, until coated, about 1 minute. Mix in cream, season with kosher salt and lots of pepper, and bring to a simmer.Step 3Crack eggs into chickpea mixture and season them with kosher salt. Cover (a baking sheet works great if you don’t have a matching lid) and cook until white parts of eggs are set but yolks are still runny, about 2 minutes. Remove from heat and drape prosciutto around eggs. Crumble rosemary on top and sprinkle with sea salt, if desired, and more pepper. Serve with flatbread.How would you rate One-Skillet Creamy Chickpeas with Eggs and Prosciutto?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleOMG…. This is so freaking good. I absolutely fell in love with it. I added a touch of fresh parsley just for the greenery and I loved every bit of it. This is a new favorite!Amanda TColorado 7/17/2021Super delicious, I will be making it again. I seared some sliced mushrooms and added them to the mix before cracking the eggs. I also crisped the prosciutto rather than serving it raw. I also added more tomato paste!Anonymous7/4/2021Very quick and tasty dinner! Could drop the prosciutto to make it vegetarian. Could also add shallots, mushrooms, maybe arugula on top...lots of ways to customize, but also a really great recipe as is :)SonaliNew Haven, CT3/3/2021I love this recipe!  We have chickens and we are always looking for ways to use the eggs.  This one is a winner!\nJRoeRoeCalifornia12/19/2020I used caramelized shallot tomato paste, added tomatoes, and it was really good! We ate it with focaccia. I def think the rosemary is a must. rodrbeaEast Tennessee11/16/2020Rockstar weeknight dinner. Good flavor (we bumped up the paprika and tomato paste). Needs some sort of acid to go with and cut the richness. Fresh tomatoes worked well. We ate it with some toasted country loaf.cbruettSalt Lake City, Utah7/17/2020I double the recipe after making this the first time and not realizing it was for 2 people.  I also pop the dish under the broiler to set the eggs at the end, so they aren’t as runny.  \n\nEasy weeknight meal and wonderful flavors.AnonymousHouston4/26/2020Wow, and incredibly easy and delicious weeknight meal. The amount of cream seemed a bit shocking for 2 servings, but was so tasty. Next time might either solely use half & half, of cut the cream with it. Definitely a keeper!AnonymousSeattle 4/23/2020The best! I've made this probably 7 times since I found the recipe. I've made it with the suggested heavy cream, coconut cream, and coconut milk. All were delicious. This is going to stay in my rotation for a long time to come!AnonymousPhiladelphia4/1/2020This warming, super-simple dish has just accelerated to a feature mid-week meal in our household and it won't be going anywhere any time soon! Involving minimal prep and no time at all from fridge to plate, it was awesome. Easy to pair with potato wedges to beef it out for hungrier folk or to dilute with some stock for a soupy feel too.grace.kennyEngland3/10/2020This literally takes 10 minutes and with little prep. The sauce tastes exactly like chicken tikka masala sauce at like a mediocre Indian place. But, in a good way if you know what I mean. Loved this and made it twice in the same day.SrAsparagusOakland, CA12/4/2019This is incredibly delicious. I used half and half and a bit of Greek yogurt instead of cream, and added cayenne and harissa for a bit more spice. Make this immediately! AnonymousBerkeley, CA10/7/2019This is so excellent. I admit, I made a couple of tweaks.. I added some shallots and Harrisa and a bit more heavy cream since I wanted to simmer it al together to make it a bit more homogeneous and braised some kale to make it a whole meal. But man, the prosciutto really makes this dish pop. So good!kermitologyCalgary5/14/2019Really loved this recipe. I sautéed the garlic with shallots also added some chicken broth, not as much heavy cream. I agreee, more tomato paste is needed. I also added a bit of lemon juice to add a bit more sourness. AnonymousFlorida4/18/2019This recipe is a hit! Would double the tomato paste and add a bit more cream, I think, to have more liquid for poaching and for the bread, but this was super easy and delicious.Anonymous3/31/2019Explore Bon AppétitChickpeaBeanVegetableEggOne-Pot MealsWeeknight MealsMainSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Andy Baraghani"]}