{"id": "fd3fc39562539c591f1fa2a597bd37f2", "url": "https://www.bonappetit.com/story/thrifty-lobster-pasta", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "The Lobster Pasta You Can Make Without Breaking the Bank | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat’s Fancy and Thrifty and Creamy All Over? This Lobster PastaNot an ounce of lobstery goodness goes to waste.By Amiel StanekDecember 11, 2019FacebookTwitterEmailPhoto by Laura Murray, Food styling by Kat Boystova, prop styling by Allie WistFacebookTwitterEmailBon Appétit editor at large Amiel Stanek has spent years trying to help readers get dinner on the table as quickly and efficiently as possible. So when he gets to cook for himself, he likes to slow things down and be a little...extra. This is Not So Fast, a column dedicated to his favorite ingredient: time.Picture your three favorite people in the whole world. (And no, I’m not talking about celebrity crushes; I mean people you actually know and know you back.) Wouldn’t you love to make them something really, really special for dinner? A dish that shows them just how much you care, the kind of thing you would never in a million years cook for just any old friends—a ride-or-dies-only sort of meal? Of course you would. Also: You should! And, also: You should make them lobster pasta.Why? Because lobster. Few words in the English language scream “faaaaaaaancy!” with the same full-throated clarity, am I right? And as is the case with many other luxury-signaling food words, that has almost everything to do with the price tag attached to them. But the cool thing about these costly crustaceans is that unlike, say, truffles or caviar or foie gras, there are more and less expensive ways to eat them—which is what this recipe is all about.I first encountered a version of lobster pasta some eight years ago flipping through The Art of Living According to Joe Beef. I was a broke-ass line cook living in Philadelphia, and was attracted to the Montreal restaurant’s iconic Spaghetti Homard Lobster, first and foremost, for the ingenious thriftiness of the thing. And despite the fact that my financial situation has improved since then, I’ve continued to make it at least once a year, tweaking it each time until it really felt like my own. It remains not only the most efficient and affordable way that I know of to enjoy lobster at home, but the most enjoyable as well.It’s a math thing. On average, a lobster is only 20 percent meat by weight, which means the other 80 percent is shell. So, if you’re thinking about the per-pound price of a live lobster in terms of the actual meat you’re getting, then yeah: lobster is expensive AF. A boiled lobster dinner is expensive. A lobster roll is expensive. But if you can turn that other 80 percent, the parts that might otherwise be carelessly thrown away, into something flavorful and filling and imminently lobster-y—well, then you’d really be on to something, wouldn’t you? And that is the beauty of lobster pasta: it cracks the code, allowing you to transform every last bit of the shellfish you paid so dearly for into maximum deliciousness.So, here’s what you’re going to do. You’re going to buy a couple of live, pound-and-a-half Maine lobsters from the tank at the grocery store. (Buying four lobsters for dinner is a tall order. But buying two lobsters and turning them into a luxe dinner for four? That’s more like it.) You’re going to take them home and do them in the only way there is: steaming them in the biggest pot you’ve got. And then, once you’ve pulled them out and they’re cool enough to touch, you’re going to spread out some newspaper on your kitchen table, put on a podcast, and carefully extract every last bit of meat from those suckers without eating any of it as you go. (A true feat of dedication.) Then, once you’re left with a shockingly small container of meat and a big ol’ pile of shells and other detritus, you’re going to break the hard parts into small pieces, sling them into a pot along with everything else (guts, goop, at all) and some aromatics, cover it all with heavy cream, and simmer every last bit of sweet lobster goodness out of them. Forty-five minutes later, all the solids get strained out and discarded, and what you’re left with is a creamy, eye rollingly rich pasta sauce that tastes deeply lobstery, but even more deeply of love. All you’ve got to do after that is boil some pasta, warm that reserved meat in the sauce, mix it all together with a bit of parm and serve it forth.Where’s the lobster? You might think you yourself as you look down at the plate in front of you, a tangle of pasta studded with a few juicy morsels of pinkish-red meat. But once you’ve twirled up that first forkful of noodles and popped it into your mouth, you’ll understand immediately: The lobster is everywhere. Because of the work you put into that sauce, every corner of that platter is suffused with sweet, succulent shellfish flavor. The lobster tastes like lobster. The pasta tastes like lobster. The finger you use to swipe up the last bit of creaminess from your plate tastes like lobster. And that is the taste of a meal your realest ones won’t soon forget.Get the recipe:Lobster PastaA creamy, eye rollingly rich pasta sauce that tastes deeply lobstery, but even more deeply of love.View RecipeExplore Bon AppétitNot So FastHoliday 2019Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-11", "author": ["Condé Nast", "Amiel Stanek"]}