{"id": "fd66e18820a2ea551b23e0db86b04997", "url": "https://www.bonappetit.com/story/how-to-toast-nuts", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "How to Toast Nuts at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Toast Nuts at HomeBuying raw nuts and toasting them at home: always worth it. Here's how to do it.By Alex DelanyJanuary 23, 2018FacebookTwitterEmailPhoto by Ted CavanaughFacebookTwitterEmailWe’ll get right to the point. Yes. Toasting nuts at home is worth it. In fact, it’s more than worth it, and if you don’t know how to toast nuts, we’ll teach you. Because toasting nuts at home will straight-up change your salad game, snack game, pilaf game, and just about any other kitchen-related game you might participate in forever.Toasted nuts that you buy at the store are fine—we've been known to call for them from time to time. But why settle for “fine” when you can do better in less than 10 minutes? Store bought nuts are never really toasted enough. They’re about 75% of the way there, but when you buy raw nuts and toast them at home, you can take it all the way, bringing out deep, nutty, roasted flavors you can’t get from the store-bought stuff. You just can't.Most of the time, we like to toast nuts in the oven. Why? Because the dry, indirect heat the oven offers will toast the nuts more evenly than a skillet will. Using a skillet might trim a few minutes off your cook time, but the heat is uneven. Even if you’re using medium or medium-low heat, you’ll still get black or charred spots. Using a sheet pan in the oven will give you beautiful, even browning. Here's how to do it.First things first: Toss the nuts with a good pinch of kosher salt. As the nuts heat up, oils will rise to the surface, giving the salt something to adhere to—a good thing. Spread them out in an even layer on a sheet pan, and pop them in a 350° oven. Generally speaking, lighter, more tender nuts like pecans, pistachios, and walnuts will take 6-8 minutes to get to a good place. Denser nuts like almonds, hazelnuts, and macadamias will take more like 8-10 minutes to finish toasting. But trust your nose over the timer: Good toasted nuts should be fragrant and roast-y smelling, never burnt or acrid. Regardless of the type of nut, you should give your sheet pan a solid shake halfway through to shift the position of the nuts for even browning.Deeply toasted nuts take any rice pilaf over the edge.\nAlex LauYou should also make sure to transfer the nuts to a plate or bowl right after you take them out of the oven. They’ll continue toasting if you leave them on the pan, and if you have them right where you want them, that’s a huge bummer. From here, you can just store the nuts at room temperature. They’ll be their best on the day you roast them, but they’re also good for the next three days. After that, they start to lose that toasty aroma and flavor. And we’re here for the toasty-ness. The roasty-ness. The nuttiness. At least one of those was a real word. But that’s not important. What is important is that you get a big batch of toasted nuts going. STAT!Toast up some walnuts, and make it rain all over this pesto potato salad:Pesto Potato SaladTo test boiled potatoes for doneness, use a skewer or the tines of a fork rather than the tip of a knife so you know they’re truly tender (a knife slides through the flesh way too easily). To test boiled eggs for doneness—wait, you can’t! Just make sure the eggs are room temperature when you drop them in the water (otherwise they’re prone to cracking), set a timer right away, and have an ice bath at the ready.View RecipeExplore Bon AppétitBasicallyNutAlmondWalnutPecanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-23", "author": ["Condé Nast", "Alex Delany"]}