{"id": "fd7770c4528d7439a0d2c6d23d229c44", "url": "https://www.bonappetit.com/story/pumpkin-pecan-hybrid-thanksgiving-pie", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "The Perfect Thanksgiving Pie Is a Pumpkin-Pecan Hybrid | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Perfect Thanksgiving Pie Is a Pumpkin-Pecan HybridHere's how Brad Leone and Claire Saffitz came up with the pie that has it all.By Alex BeggsNovember 13, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiFacebookTwitterEmailWe asked our food editors to test and retest the Thanksgiving classics: to compare Idaho potatoes to German Butterballs, to weigh the merits of whole birds against cooking in parts. And we asked them to do it while filming Making Perfect, a six-part video series documenting every success and setback. Somehow, it all worked out...perfectly. Here’s how the Pecan-Rye Pumpkin Pie came together.Find all of the recipes from the Absolutely, Positively Perfect Thanksgiving menu here.The Dream TeamBrad Leone and Claire SaffitzThe ChallengeHold on to tradition (which is to say, pumpkin pie) tighter than a Macy’s Thanksgiving Day Parade balloon handler, but dream of details that would bring it to 2019 in the best possible way.The SolutionImagine a pumpkin pie with pecan pie’s best feature— obviously, the candied nut topping. Now spike the custard with rye whiskey, up the flavor of the crust with rye flour, and voilà: pecan-rye pumpkin pie.Watch Claire and Brad make the perfect thanksgiving pie\nStarted From the Libby’s Can, Now We’re HereClaire and Brad began with the classic Libby’s pumpkin pie recipe straight off the label. From there they upped the eggs for a richer custard, DIY’d their own pumpkin pie spice mix, and swapped in heavy cream for the evaporated milk. And, yeah, the whiskey.The only can we stan.\nPhoto by Alex LauExtra DarkYour crust isn’t burning! The rye flour will make the crust look darker than your standard pie dough. If you’re really worried it’s burning, tent it with a ring of foil.Have you ever seen a better-looking slice?\nPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiNo Soggy Bottoms EverThere’s so much moisture in the pumpkin custard that it can soften the crust if there aren’t protective measures in place. But we’ve got you. The egg wash added during the blind bake serves as a moisture-fighting barrier—a seal-tight guarantee that the bottom crust won’t get mushy.The Tool: Immersion BlenderWe use an immersion blender to mix the custard filling—eggs, pumpkin, everything at once—because it’s fast, easy, and thorough. (Don’t have one? Don’t worry, a regular blender will get the job done too.)Get the recipe:Pecan-Rye Pumpkin PieImagine a pumpkin pie with pecan pie’s best feature—obviously, the candied nut topping. The best of both worlds.View RecipeFor more Absolutely, Positively Perfect Thanksgiving menu ideas:1 / 8ChevronChevronExpertly Spiced and Glazed Roast TurkeyView RecipeExplore Bon AppétitThanksgivingPieMaking Perfect: ThanksgivingRead MorecookingEverything That Goes Into Making the Absolutely, Positively Perfect Thanksgiving TurkeyBy Alex BeggscookingThe Perfect Thanksgiving Stuffing: There Will Be Corn NutsBy Alex BeggscookingThe Perfect Thanksgiving Mashed Potatoes and Gravy Have ArrivedBy Alex BeggscookingOur Nostalgic, Fancy, and Kinda Polarizing Cranberry Sauce Is HereBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-13", "author": ["Condé Nast", "Alex Beggs"]}