{"id": "fd8e549e7720797692ea4cddcda85467", "url": "https://www.bonappetit.com/story/grandmas-thanksgiving-dressing", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "I Could Never Get Grandma’s Thanksgiving Dressing Quite Right—Until She Was Gone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Could Never Get Grandma’s Thanksgiving Dressing Quite Right—Until She Was GoneMaking it was a true comedy of errors, but somehow it tasted just like hers.By Jasmine GuilloryOctober 22, 2020FacebookTwitterEmailIllustration by Jordan MossFacebookTwitterEmailMy grandmother was born during the Depression. The middle child of three sisters, she moved from Louisiana to California when she was three years old, and to her, the only important things about a meal were to make plenty of food and put plenty of heat in it. The rest didn’t matter much.Her daughter (my mom) was always a very obedient child, but one of her small, silent rebellions was against this way of cooking: She started reading food magazines—including this one—as soon as she found out they existed, fell in love with then unfamiliar ingredients and spices, and passed down to her daughter (me) a love of food, cooking, and experimentation. And while I grew up enjoying Grandma’s gumbo and jambalaya just fine, the first time my mom and I made gumbo together, I couldn’t get over how delicious it was. We later realized that ours tasted so much better in part because Grandma always added about four times the required amount of liquid to the roux—and used water instead of stock.But there was one recipe of my grandmother’s that I prized above all others. One thing my mom and I could never make even half as well as she could. And that was her famous cornbread dressing. This big golden crunchy casserole has always been the essence of Thanksgiving for me, far more than the turkey or the pies. Full of cornbread and spicy sausage, it engages all of the senses. Like everything born in New Orleans, it starts with onions and garlic and green bell peppers and celery, and as it cooks you can smell those flavors all coming together with the cayenne and the meat. When you take it out of the oven, it bubbles and crackles, its top a bronze crust, its inside deep yellow.After I went to college, I spent a number of Novembers away from home, and the absence of that dressing was always the hardest thing for me. Thanksgiving didn’t feel like Thanksgiving without it. There was stuffing—that word I learned to use around white people—on other tables, but even though I was told they were the same thing, just different words, stuffing always seemed bland and soggy in comparison to the dressing I was used to.The easiest holiday away was the time I went to an Indian friend’s house. Her parents got a turkey, but most of the dishes, like the lamb curry and aloo gobi and an enormous platter of samosas, had nothing to do with what my family was eating 3,000 miles away. I could enjoy the food for what it was and not compare.Once I was back home in California, my mom and I took over the bulk of the holiday cooking, but Grandma still made the dressing for as long as she could manage to chop all of the vegetables and make the cornbread. I was in my mid-20s and fresh out of law school—the phase where I thought I knew better than everyone else in my family. They had not done the reading, you see, but I had. Fresh was always better than canned or frozen or from a box; doing it the hard way was superior to the easy way; the fancy sausage should replace the kind my grandmother had always used.Those were the years when Thanksgiving felt like a race, and one I had to win—to make all the food, to make it my way, to try out all of the recipes in this magazine and so many others, to brine and spatchcock and bacon-wrap the turkey, to show how much I knew and could do, always more and better than the year before. But Grandma was suspicious of my need to improve upon everything—and she was probably right to be.Back then I hadn’t yet learned that the most important thing about cooking for other people is the joy your food can bring them. That it didn’t matter if my grandmother wanted her steak well-done, or her lamb topped with store-bought mint jelly instead of the fresh mint chimichurri I made, or her birthday celebrated with that old-fashioned bakery cake instead of the fancy gourmet one I bought. I hadn’t yet learned that on Thanksgiving, it’s a waste of time to roast a whole entire pumpkin for pie (the canned stuff is superior anyway!), and that investing in six great dishes is far better than churning out 12 I’m too exhausted to actually eat, and that turkey tastes approximately the same no matter what you do to it.Illustration by Jordan MossAbout 10 years ago, Grandma got too weak to do all the work necessary for the dressing. Suddenly, it was up to Mom and me. But we could never get it right. We had her recipe—handwritten in her perfect script—but it had been written many years ago, and for much larger quantities than we needed, and in units of measurements like boxes and cans and packages, some for brands that no longer existed. Or it was vague and just said “sausage” and not what kind.When Mom and I tried to replicate it, we used too many fancy ingredients, either not enough stock or the wrong kind, definitely not enough butter, absolutely the wrong sausages. Sometimes it was close; sometimes it was very wrong. But we were so busy doing everything else Thanksgiving entails that we never had time to stop and plan how to fix it.Then there was the year of the explosion. That year my grandmother was rushed to the hospital on her 80th birthday because of a dangerous infection caused by a broken ankle. She got out the day before Thanksgiving, and we were all so grateful she made it home. Mom and I tried yet again with the dressing, and we had high hopes about it that time—the texture seemed right, and it looked golden and bubbly around the edges like it was supposed to. I took it out of the oven and gloried in the smell and sight of it, then turned around and set it on a cutting board that—unbeknownst to me—held a single drop of water. I had already turned back to the stove to take care of another dish when I heard it.CRACK!The dressing’s Pyrex dish had exploded, glass and clumps of golden yellow all over the kitchen. My uncles swarmed in to clean up as I frantically tried to pull bits from the garbage, determined to salvage my favorite thing about Thanksgiving—the one year I maybe finally got it right. Did I care that there was probably glass inside the dressing? In my hyped-up, panicked Thanksgiving mode, no, no I did not.My mom saw what I was doing and shrieked with laughter, gently prying what remained out of my hands. I looked around the kitchen, and then, finally, broke down and laughed with her. We finished cleaning and determined we were cursed. I ate a lot of pie that year but also promised myself I wouldn’t stop trying to get the dressing right—we’d just use ceramic or metal pans from then on.My grandmother and I had a difficult relationship—two people who always need things done their way usually do—but there was a lot of love there. Then last year she went back to the hospital. She stayed there for 16 days before she died.For most of that time, I remained in denial about what was going to happen. I didn’t tell her something very important—something about my fourth book, which was just about to come out. It was only two days before her death that we finally got to talking about it, and she asked me who I had dedicated the book to.“I dedicated it to you, Grandma.”She was so surprised.“This means that my name will be there, even after I’m gone,” she said.Two months later it was Thanksgiving again—our first without Grandma. My mom demanded a low-key holiday, so we planned for just the essentials: turkey, potato salad (I could write another essay all about that), rolls, cranberry sauce, green beans, pie, and of course the dressing. Making it was a true comedy of errors—we couldn’t find the handwritten recipe; the butcher shop where my grandmother got her sausages every year had permanently closed; her chosen cornbread mix was sold out at every store. But we bought what we could. We settled for Italian sausages and hoped they would work. We slowed down. We tasted as we went, added more stock, more butter, and then more butter again. I wrote down every step so we’d know how to fix it the next year, and then the next.When we finally took the dressing out of the oven, we let it cool for a few minutes. Then we tasted.“Mom,” I said, “we did it.”It tasted just like Grandma’s. It tasted like Thanksgiving.Jasmine Guillory is the author of five novels, most recently Party of Two. She lives in Oakland, California.Explore Bon AppétitThanksgivingFirst PersonRead MorecultureThis Cornbread Casserole Was My Family’s Secret Thanksgiving Recipe...Until It Wasn'tBy Hilary CadigancultureIf You Need Something Done on Thanksgiving, Ask My GrandfatherBy Amanda ShapirocultureHow My Brother-in-Law Stole Thanksgiving—and How I Got it BackBy David TamarkincultureThe One Time I Actually Cooked a Thanksgiving Meal On ThanksgivingBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-22", "author": ["Condé Nast", "Jasmine Guillory"]}