{"id": "fd91964bf172cab365763acf82a237dd", "url": "https://www.bonappetit.com/recipe/savory-kale-and-sausage-brunch-strata", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "Savory Kale & Sausage Brunch Strata Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesSavory Kale & Sausage Brunch StrataFacebookPinterestTwitterEmailPrintIngredients4 tablespoons olive oil, divided1 pound sweet Italian sausage, casings removed2 bunches kale, leaves stripped and leaves torn into bite-sized piecesKosher salt1 can Campbell’s® Condensed Cream of Mushroom Soup4 large eggs2 cups whole milk1/8 teaspoon ground nutmeg1 loaf sourdough bread, sliced 1-inch thick pieces2 cups (loosely packed) grated white cheddar, about 4 ouncesRecipe PreparationHeat 2 tablespoons olive oil in a large skillet over medium high heat. Add sausages and cook, stirring occasionally, until golden and slightly crisp around the edges, 12 to 15 minutes; transfer to a large bowl and set aside.Add remaining olive oil to same skillet and add kale, in 2 batches, and cook until wilted, about 2 minutes; season with salt and transfer kale to bowl with sausages.Whisk Campbell’s® Condensed Cream of Mushroom Soup, eggs, milk, nutmeg, and 1 teaspoon kosher salt in a large bowl until combined. Add sliced bread to soup mixture and toss to coat.Spread 1 cup sausage and kale mixture along one short edge of a 9 x 13 baking dish, place 1 layer of soaked bread over it. Repeat with remaining sausage mixture and bread, overlapping slightly. Pour remaining soup mixture over casserole, cover with foil, and bake until the custard has set, 40 to 45 minutes.Remove foil, top with cheese and bake until cheese is melted, about 10 minutes. Remove from oven and let rest 10 minutes before serving.Recipe by Campbell'sReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitCampbell'sSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}