{"id": "fd99ae96e043be8f2320673ab6035c16", "url": "https://www.bonappetit.com/story/story-course-dinner-series-nyc", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "Story Course, a New Dinner Theater Series, Tells Chefs' Immigrant Stories in NYC | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureStory Course, a New Dinner Theater Series, Tells Chefs' Immigrant Stories in NYCStory Course uses musical theater to tell a chefs' immigration story throughout a six-course meal.By Alyse WhitneyFebruary 5, 2018FacebookTwitterEmailPhoto by Derek MinFacebookTwitterEmailCocktails shaken with dry ice, flambéed Baked Alaska, and tableside carved prime rib are some of the dining spectacles that you can experience in New York City. Now there's one more to add to the list: musical dinner theater by Story Course. This fully immersive interactive dining event tells the immigration story of a NYC-based chef with song, dance, and a six-course meal, kicking off with Le Bernardin chef Jae Jung in February. The series was created by Broadway actor Adam Kantor (currently in The Band's Visit) and Dinner Lab pop-up founder Brian Bordainick to combine a love of food and theater in an unexpected way.Chef Jung combines Southern and Korean styles of fried chicken to represent two places she's lived.\nPhoto by @jeaniuseatsFor roughly the same price as an orchestra Broadway ticket or a multi-course meal—$175, with shows every Thursday through Saturday in February at 7:30 p.m.—you can get both. There has been a void in the dinner theater world since Queen of the Night closed, and Story Course is filling it. Story Course is the first to truly integrate dinner and a show, and it is quickly gaining popularity. (Celebrities like Bryan Cranston are fans, and many of this month's dinners have already sold out.) The current iteration, \"How Do You Hug a Tiger?\" follows Chef Jung through six milestones in her life, starting with watching her \"Tiger Mom\" (also a chef) cook Korean chile sauce on their roof and moving through her time in culinary school and cooking in New Orleans.The seven-component Korean crepes are labor intensive, but an important part of Chef Jung's story.\nPhoto by Derek MinChef Jung's story is heartwarming and heartbreaking at the same time, and the food and stories are equally intricate. The most labor-intensive dish is the first course: Chil-Jeol-Pan, aka build-your-own Korean crepes with fillings like cooked eggs, bulgogi-style beef, braised dried shiitake mushrooms, and thinly julienned carrots and zucchini. \"This is a royal tradition and a very high-end dish that not everyone has access to eat in Korea,\" Chef Jung reveals. She chose it because it is so uncommon and special, and the seven-component dish is accompanied by her mother's famous \"sweet-sour-tangy-spicy\" gochujang chile sauce. Since it has to be cooked overnight, it illustrates the passion for cooking that both she and her mother share.Breaking the seaweed tuile symbolizes Chef Jung's mother slapping her after hearing she'd go to culinary school in New York.\nPhoto by Derek MinFrom there, Chef Jung explains, \"Each course get more Americanized to show how my taste changed after moving here nine years ago.\" She tones down the heat on a steamed cod to reflect how her spice tolerance changed, and adds cane syrup and tomato kimchi to braised pork belly for a Creole twist (a nod to her time in NOLA). There is also an interactive twist for bibimbap to portray the time her mother slapped her for moving away for culinary school (\"you break the seaweed tuile on top and then the yolk breaking is like crying\") and a half-Southern-half-Korean fried chicken to merge the places she's lived in. After half a dozen courses and emotional stories, we bet you'll leave the night with a full stomach and a full heart.Buy tickets for Story Course's \"How Do You Hug a Tiger?\" for $175 here. The show runs Thursdays through Saturdays in February at 7:30 p.m. at the Avenues school in Chelsea. As of time of publication, tickets are still available for February 8, 10, 15, 16, 17, 22, and 23.Here's a recipe for simple weeknight bulgogi:Explore Bon AppétitRestaurantsNew York CityRead MorecultureHow Being an Adopted Korean Influences the Way Kristen Kish CooksBy Alyse WhitneyrestaurantsA Fried Chicken Bender in South KoreaBy Wesley YangRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-05", "author": ["Condé Nast", "Alyse Whitney"]}