{"id": "fd9d2a560fa7fa14b7c2c6b35d5e8d64", "url": "https://www.bonappetit.com/story/pesto-alfredo-emotional-eating", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Pesto Alfredo and the Power of Emotional Eating | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsPesto Alfredo and the Power of Emotional EatingOver dairy-doused cutlets at La Famiglia Giorgio's in Boston, I started to imagine what family might look like for me.By Cleopatra ZuliApril 16, 2019FacebookTwitterEmailPhoto by Joe St. PierreFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.I fell in love with pasta after reading about an Italian witch. It was 1994, and Strega Nona by Tomie dePaola was hot on the Reading Rainbow circuit. My second-grade teacher invited a guest to read the story, and I listened intently, intrigued by the “grandma witch” with a magic pasta pot that accidentally flooded her town with spaghetti. I don’t remember who our guest was—experiential learning and frequent visitors were normal in our magnet curriculum—but I remember how she passionately taught us to make spaghetti after the reading. We added butter and Parmesan cheese to our fresh noodles, and some risk-takers, like me, topped our bowls off with freshly cracked black peppercorns.I didn’t have family meals like this, nor a magical cooking grandmother like Strega Nona. Growing up in Malden and Cambridge, Massachusetts, I was a latchkey kid often doing extracurricular activities or in the care of others. My mom, a single mother who emigrated from Haiti to the Boston metro area, worked multiple jobs and rarely cooked. So we dined out often, getting pork chops and blood sausage at Izzy’s Restaurant or griot (fried pork), banan peze (fried plantain), and pikliz (pickled cabbage with Scotch bonnet peppers) at Highland Cuisine when my mom missed home.Eating the pesto alfredo with massive chicken cutlets and homemade fettuccine became my ritual.\nPhoto by Joe St. PierreBut I longed for that second-grade feeling of eating meals as a family. Eventually, I found it at La Famiglia Giorgio’s in Boston’s North End. I was a sophomore in high school, wandering around Little Italy in search of “real Italian” food before a school trip to Italy and for a place to read Weetzie Bat unbothered. I stumbled into La Famiglia Giorgio’s and ordered the pesto alfredo with chicken, broccoli, and homemade fettuccine. Instantly I was hooked. The garlicky cream sauce was like nothing I’d had before, and the chicken was massive, larger than the size of my hand. It was the first restaurant where servers were genuinely kind to me and treated me like a paying customer rather than an inconvenience. The staff let me be, and I sat there for hours, peeling back the pages of my book and trying to tackle the massive dairy-doused cutlets and pile of pasta. It soon became my ritual. Here is where I’d happily spend my after-school job paychecks, where I’d bring friends and secret girl crushes. The dining room of La Famiglia became my own.The warm dining room of La Famiglia Giorgio’s was the first space I held for my tribe.\nPhoto by Joe St. PierreThis restaurant was the first place I started actively holding space for my tribe, where I started fantasizing about what family and home could look like for me as a queer black American child of immigrants. Now as an adult, I hold this kind of space as the cofounder of BLK PALATE, a production company and culinary collective that curates dining experiences, menus, and media that disrupt food culture and honor the African diaspora.What I eat, where I eat, and whose food I eat is a way to reignite memories and re-create the moments when I felt most emotionally full. For me, that’s the Haitian food my mother longed for. But it’s also the pesto alfredo at La Famiglia Giorgio’s. The fresh al dente noodles coated in rich basil-laden sauce have become synonymous with a comfort I’d rarely felt growing up: the comfort of a community, ready to feed both your belly and your spirit.Cleopatra Zuli is an educator, private cook, writer, and the cofounder of BLK Palate, a Brooklyn-based culinary collective and production company.Explore Bon AppétitRestaurantsItalian AmericanRed SauceMassachusettsRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Cleopatra Zuli"]}