{"id": "fda32b3df4126b054dd1905d2ca12f7e", "url": "https://www.bonappetit.com/story/alok-vaid-menon", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Alok Vaid-Menon's Nighttime Routine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAlok Vaid-Menon Winds Down with Vegan Junk Food and a \"Massage Drill\"Here's what else puts this artist to bed.By Martine ThompsonJune 28, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn 'Going to Bed with...' we talk to the people we're crushing on about how they wind down before going to sleep.“When we want to scream and we don’t scream, what happens to that scream?” asks Alok Vaid-Menon. It’s a question the writer, performance artist, and author of Femme In Public thinks about often. “Sometimes things just need to get out. I have so many ideas, so much pain, so much memory that I need to do something with.”The 26-year-old gender non-conforming artist uses art to explore the raw, unedited emotions we’re typically discouraged from articulating. The undertaking is equal parts intimate and cathartic, explains Vaid-Menon, and once you experience their work—like, for example, a poem highlighting the transgressiveness of sporting a beard while donning fluorescent lipstick—it’s easy to understand why. To see and hear Vaid-Menon in their element is a tender gut-punch. They evoke a world beyond oppressive gender binaries while reminding us that, for many—especially visibly queer, trans, and gender non-conforming people of color—simply existing is an act of resistance with regular violence woven into their daily lives.As Vaid-Menon puts it, “gender is linked to humanity,” and being an artist is about life work: How does one develop new ideas and images to change this cis-heteronormative white supremacist patriarchal world? It’s a process of “getting closer to the ideal but recognizing that you’ll never be able to [fully reach it] and living and dwelling in that impossibility,” they say. Here, the artist shares the importance of getting their feelings onto the page before bed, what they eat when feeling restless, and the ultra-helpful, albeit noisy, device that’s helping them doze off.Alok's collage-filled bedroom is a reflection of their mind.\nPhoto by Emma FishmanJournaling about the dayEvery night before I go to sleep, I journal about the day. I’ve been doing that now for the past six years. I have a record of every single thing that I’ve done, thought, and felt, every day, for the past six years. It takes so much time, but it’s some of my favorite writing because I believe in self-dialogue. How are we supposed to know what we’re thinking and feeling unless we talk to ourselves and have an intimate relationship with ourselves? That helps me process the day and release.Emo-nostalgic jamsI try to listen to music before going to sleep, while working through everything I felt that day. Recently, I’ve been binge-listening to singer and cellist Kelsey Lu, who is so phenomenal. And then there are of course the classics I return to. I was a very proud emo kid growing up in a small town in Texas so I have a collection of like ten really pathetic, white, angsty albums that I always default to.Hot chocolate and vegan junk foodI felt some pressure in doing this [interview]. I have so many bad habits, and I was like, am I going to be able to talk about that? I have the person I want to be, which is like, “Oh, I wake up at 6 a.m., and I do yoga, and I make my own breakfast, and I read a novel, and I’m self-actualized.” But that’s not who I am or who I think anyone actually is. There’s a performative quality when we talk about self-care where we glamorize ourselves as doing all these rituals that we don’t actually do because developing new habits is really hard. So for me, when I’m hungry at night, for instance, I eat lots of fried food, a second dinner, or a lot of ice cream. And I eat Oreos all the time. I am a total junk food vegan. If I have difficulty falling asleep, I drink hot chocolate. It’s a comfort drink for me. I make a cup and try to read and that usually helps.Alok lounging in bed.\nPhoto by Emma FishmanA not-so-light massageI recently acquired this device called a TheraGun. It’s basically a massage drill that beats this very hard sphere into you. It’s extremely loud and looks like an intense sex toy but it’s not. It’s revolutionized my life. I deal with a lot of chronic pain, and I just TheraGun myself before sleeping, which I’m sure annoys all of my neighbors because it sounds like I’m drilling in my house. I target all of my knots and it’s so painful but then I feel such relief afterwards.Farewell 2-in-1I never had long hair growing up because of gender stuff, and no one really taught me how to care for curly, long hair. But, these last few years, I’ve had long hair, and I’ve recently been learning how to care for it after reaching out to my Black and brown friends. I do leave-in conditioners now and use Olapex’s repairing treatment and Miracle Hair Mask, and I’ve learned the difference between argan oil and other oils, and I feel really geeked out about it because I didn’t know all of these things about hair. I was just using 2-in-1 shampoo all the time and had really brittle, dry hair. Now my hair is so soft and buoyant and curly, and I’m so proud!Sending love to friends via textI really believe in friendship as the answer to so many things. Before I go to sleep, I text like 47 people all across the world who matter to me. I just send nice notes, like “I hope you had an amazing day” or “I really care about you” or “You matter to me.” I feel like the thank you note is my favorite genre of writing. I’ve always loved writing thank you notes almost more than receiving gifts. It also really helps me before I’m going to sleep to not feel alone. I struggle a lot with feeling isolated or lonely, but in those moments I’m able to connect to these people in my life who are not just Instagram accounts I follow but people who know me and care about me.Explore Bon AppétitGoing to Bed withHealthyishprofileRead MorecultureEmilia Ortiz Cleanses Her Aura and Chats with Her Ancestors Before BedBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-28", "author": ["Condé Nast", "Martine Thompson"]}