{"id": "fda55526b4dda4166441a4399eec1756", "url": "https://www.bonappetit.com/recipe/roasted-carrots-and-chickpeas-with-herby-cashew-cream", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Roasted Carrots and Chickpeas With Herby Cashew Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRoasted Carrots and Chickpeas With Herby Cashew CreamBy Hetty McKinnonSeptember 5, 20214.4(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintCarrots are often relegated to supporting roles in soups, braises, and stews that take advantage of their sweetness but hardly make them the star. This salad lets them shine, roasted alongside chickpeas and taken to the next level by an herbaceous cashew cream. Blitzing the base cashew cream recipe with dill, parsley, and scallions brings fresh balance to the carrots. Serve extra sauce as a dip with crudités or grilled bread. —Hetty McKinnonThis is part of our meal planning package, where one recipe can become three quick weeknight meals. Use the rest of your cashew cream to make Broccoli and Cashew Cream Soup or Creamy Cashew Udon With Crispy Mushrooms.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonCitrus Juicer$7 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients4 servingsCashew Cream1cup raw cashews1garlic clove, coarsely chopped1Tbsp. extra-virgin olive oil½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltCarrots and Assembly¼cup almonds2scallions, coarsely chopped¼cup tender dill sprigs¼cup tender parsley sprigs3Tbsp. fresh lemon juice, divided¼tsp. freshly ground black pepper, divided1lb. carrots, peeled, cut into 3\" pieces214-oz. cans chickpeas, rinsed, patted dry5Tbsp. extra-virgin olive oil, divided1tsp. ground cumin1tsp. paprika1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided3cups greens (such as arugula, spinach, and/or mesclun)PreparationCashew CreamStep 1Bring a large saucepan of water to a boil, then remove from heat. Add cashews and let sit until tender, 30–60 minutes.Step 2Drain cashews and transfer to a blender (preferably high-speed) or food processor. Add garlic, oil, salt, and ½ cup water and purée until smooth.Carrots and AssemblyStep 3Preheat oven to 350°. Toast almonds on a rimmed baking sheet, tossing halfway through, until slightly darkened and fragrant, 8–10 minutes. Let cool; finely chop. Reserve baking sheet.Step 4Increase oven temperature to 425°. Purée cashew cream, scallions, dill, parsley, 2 Tbsp. lemon juice, ⅛ tsp. pepper, and ¼ cup water in a blender until smooth. Set herby cashew cream aside.Step 5Place carrots and chickpeas on reserved baking sheet. Drizzle 4 Tbsp. oil over and sprinkle cumin, paprika, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and remaining ⅛ tsp. pepper on top; toss to coat. Arrange in an even layer and roast 10 minutes. Remove carrots and chickpeas from oven and toss. Return to oven and roast until carrots are tender and mostly golden and chickpeas are crisp, 10–15 minutes.Step 6Place salad greens in a large bowl; drizzle in remaining 1 Tbsp. lemon juice and 1 Tbsp. oil and season with remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt. Toss to coat.Step 7Arrange greens on a platter, then spoon carrots and chickpeas on top. Drizzle with reserved herby cashew cream and top with almonds.How would you rate Roasted Carrots and Chickpeas With Herby Cashew Cream?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis recipe is a keeper! I kept everything separate and assembled each serving. This makes things much easier for leftovers.Michelle San Antonio, TX10/5/2021It takes some time and effort but the delicious results are worth it. The roasted carrots were perfectly seasoned along with the crispy chickpeas - an absolutely delicious dish. My family is still raving about it!MojoMcQToronto 9/16/2021Yes, it takes time to prepare, but well worth it especially if you have an herb garden!   Makes a wonderful side dish or lunch dish all by itself.  Not messy if you arrange the plate carefully and yummyAnonymousLos Angeles9/9/2021This was a lot of active kitchen time for a weeknight meal. Many components worked great on their own - seasoned chickpeas and carrots, herby cashew cream, dressed greens - but all put together, especially with the hot and cold components,  it was just a big mess of food. Cambro Vancouver WA. 9/8/2021Explore Bon AppétitRoasted VegetablesCarrotVegetableChickpeaBeanVeganHealthyishDinnerSideRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-05", "author": ["Condé Nast", "Hetty Mckinnon"]}