{"id": "fdb2ca40f3a487d0be8c371b36c15912", "url": "https://www.bonappetit.com/story/cinnamon-raisin-bread", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "This Cinnamon Raisin Bread Did More for My Love Life Than Tinder | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Cinnamon Raisin Bread Did More for My Love Life Than TinderEat, pray, loaf.By Zoë SessumsApril 6, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Emily EisenFacebookTwitterEmailI've worshipped at the altar of bread for most of my life. Early into eating solids, my family considered changing my middle name to \"breadandbutter.\" I needed to be monitored around baguettes. I felt sheer joy around bread baskets. Our Sunday mornings were spent not at church but at Bageland in Gainesville, Florida, where I grew up. At Bageland, I went through phases with favorite flavors and pairings: pumpernickel with butter, everything with cream cheese, cinnamon raisin with butter or cream cheese.The fateful loaf of cinnamon raisin bread\nPhoto by Alex LauSo it came as no surprise that, when I moved away from home to go to college in Baltimore, one of the first places I found comfort was the tiny corner of OK Natural Food Store that shelved all the bread. I'd spend peaceful moments in this nook, poking at the various shapes and sizes of wholesome loaves. One day, I picked a loaf of Vermont Bread Company Cinnamon Raisin bread—the purple packaging called and then the scent swayed me. I grabbed a jar of Once Again peanut butter and a bunch of bananas too, and trekked back to my dorm.That's how the \"CB+PB+B\" was born. Toasted cinnamon raisin bread, peanut butter, and sliced banana. Those whole wheat slices of bread were just the right size, modest squares that fit perfectly on my assortment of cheap, melamine plates. There was always the perfect number of raisins per slice, mostly scattered across and sometimes in greedy clumps. The texture was sturdy and reminded me of my grandmother's own homemade bread. That whiff of cinnamon brought me joy, a sort of sweetened carb aromatherapy.Every single day for the rest of that year, I consumed my open face sandwich. Sometimes it was one slice of that Vermont Bread Company bread; on desperate days it was four. I'd eat my hearty combination for any meal or snack. I went back to replenish my supplies with the regularity of a prescription refill.A few months into my obsession, I was snaking through the narrow aisles and saw a handsome man standing there and looking puzzled in my favorite corner. I suggested that he try the cinnamon raisin bread—the Vermont Bread Company cinnamon raisin bread, to be exact. I probably swooned just talking about it. He was trying to find a loaf to pair with spaghetti, so the cinnamon raisin wasn't going to cut it, but he thanked me for my help and asked for my phone number instead.This stranger became one of the great loves of my life. As you can imagine, I shared the CB+PB+B with him numerous times. And if I ever asked him to pick up some things from the store, he knew to grab the purple bag. I could vary in peanut butters—maybe creamy, often crunchy, a variety of different brands would do—but the loaf would always be the same.Life upheavals got the best of our relationship. First there was a sudden move, then a regretful breakup, then I landed back in Florida. But I still love this cinnamon raisin bread. It reminds me of one of the happiest times of my life. These days, as I strive to resemble a put-together human who eats a range of colors and vegetables and cooks with utensils, I've cut back on my bread consumption. But I still take a pause at any bread nook or shelf of loaves, and, if I spot that purple-labeled bag, I take a huge inhale. There's nothing quite like that sweet, cinnamon-y smell.Buy It: Vermont Bread Company Cinnamon Raisin Bread, $18 for 2 packs on Amazon or $4.29 at Whole FoodsExplore Bon AppétitShoppingRaisinBreadToastCinnamonHealthyishRead MoreLifestyleWhole Wheat Is No Healthier than White Bread, Food Scientists ClaimBy Ali RosenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-06", "author": ["Condé Nast", "Zoë Sessums"]}