{"id": "fdbc66c55b19601460ebc466ebf904fa", "url": "https://www.bonappetit.com/recipe/sous-vide-salmon-lemon-dill", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Sous Vide Salmon with Lemon and Dill Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueSous Vide Salmon with Lemon and DillBy Brad LeoneJanuary 24, 20184.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Anna BillingskogEmailPinterestPrintEmailPinterestPrintThis fish is great cold flaked over a salad or hot with some veggies. We found 125° to be the sweet spot, but adjust in intervals of 5° to try to find the perfect texture for you. Read more about what sous vide cooking is, and see how to cook anything sous vide with step-by-step photos here.Ingredients2 servings11-pound skinless, boneless salmon filletKosher salt1tablespoon coarsely chopped dill1teaspoon finely grated lemon zest½teaspoon crushed red pepper flakes1tablespoon extra-virgin olive oilSpecial EquipmentA sous vide machine; a 1-gallon vacuum-sealable or resealable plastic bagPreparationStep 1Clip (or stand) sous vide machine to a tall, large pot. Fill pot with warm water to height according to manufacturer’s instructions (keep in mind that fish when added will cause water to rise).Step 2Season salmon with salt. Mix dill, lemon zest, and red pepper flakes in a small bowl to combine, then rub all over fish. Place salmon and any spices that fall off into bag and pour in oil.Photo by Alex Lau, Food Styling by Anna BillingskogStep 3Vacuum-seal or partially close resealable bag, getting as much air out as possible to keep bag from floating, and place in water bath. If using a resealable plastic bag, push down into water to submerge (this will push more air out of the bag) and fully close. To ensure proper cooking, contents of the bag need to be completely submerged in water. Turn on machine and heat water to 125°.Step 4Using a small clip, secure top edge of resealable bag to rim of pot, positioning it opposite the machine’s water outlet; as the water circulates, it will help keep the bag submerged. If using a vacuum-sealed bag, you may need to set a small plate on top to prevent floating. Cook salmon, maintaining water bath at 125°, 1½ hours. Remove bag from water bath. Remove salmon from bag and serve as desired.Step 5Do Ahead: Salmon can be cooked in water bath 4 days ahead. Keep sealed in bag and chill, or freeze up to 1 month. Enjoy cold or reheat with sous vide machine at 100° until warmed through, about 1 hour, before serving.How would you rate Sous Vide Salmon with Lemon and Dill ?Leave a ReviewTell us what you thinkExplore Bon AppétitSalmonFishSeafoodLemonCitrusFruitDillHerbs & SpicesMainDairy-FreeGluten-FreeNut-FreeKetoDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-24", "author": ["Condé Nast", "Brad Leone"]}