{"id": "fdc352bd071592116fd3040d68cbe6ea", "url": "https://www.bonappetit.com/story/jessica-murnane-know-your-endo", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "This Book Is Making Life With Endometriosis a Whole Lot Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Book Is Making Life With Endometriosis a Whole Lot BetterJessica Murnane is all about white potatoes, foam rollers, and ditching perfectionism.By Ali FrancisApril 27, 2021FacebookTwitterEmailPhotograph by Taylor JarvisFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.In Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Jessica Murnane, author of One Part Plant: A Simple Guide to Eating Real, One Meal at a Time (2017) and Know Your Endo: An Empowering Guide to Health and Hope With Endometriosis—which was published April 27, 2021.“Living with endometriosis can be a really dark and lonely place,” Jessica Murnane says. “This book is my way of saying, ‘I see you; you’re not alone.’” Murnane is sitting on her bed in Charleston, South Carolina, and in between sips of a lukewarm smoothie, the author is recalling the motivation behind her latest book, Know Your Endo. “I’ve really been embracing acceptance and self-compassion,” she continues. “My endo is making me tired today so I’m going to take this interview from my bed, you know?”I’ve been obsessed with Murnane since the release of her 2017 cookbook, One Part Plant, a vibrant, nonjudgmental collection of recipes born of her struggle with endometriosis—the inflammatory condition affecting 10 percent of people with periods, including me. The book advocates eating just one plant-based meal a day; there are no anxiety-inducing lists of forbidden foods, no all-or-nothing mandates for health. Know Your Endo is just as friendly and nonprescriptive but takes a more holistic approach. The book walks readers through a five-step plan that introduces a new endometriosis management tool each week. Sections on food (with recipes!), movement, stress relief, and home and personal product recommendations are interspersed with first-person accounts, interviews with doctors, and blank lined sections for prompted reflection.It’s the most straightforward (and hopeful) guide to living with endometriosis I’ve read, and I wish I could press it into the hands of my fearful and confused 23-year-old self. Since my laparoscopic surgery (the most accurate route to an endometriosis diagnosis), my own approach to dealing with symptoms has been a combination of avoidance and Advil. Endo is still somewhat of a medical mystery; it wasn’t until reading Murnane’s book that I realized how much anxiety I was shoving under the rug by just powering through. Know Your Endo was the hug and pep talk I needed to face my condition head-on—and realize that I actually do have some sense of agency in my wellbeing. I can’t change my diagnosis, but I can feel better in my body.Murnane, I learn, is just as chill and empathetic in real life. Here she talks about the importance of “symptom awareness,” the one food she always turns to on her worst days, and why she’s obsessed with foam rolling.My body image has suffered greatly… because of endometriosis, and writing the book really forced me to address that. I've been in and out of therapy since high school for body dysmorphia, and I know now more than ever how endo has contributed to that. When you’re asked if you’re pregnant (due to a bloated belly) anytime you wear something remotely fitted and you’re never really sure when your symptoms will present themselves (especially some brutal urinary and GI issues)—it can definitely distort how you see, and feel in, your body.It takes an average of 10 years and eight doctors… to be diagnosed. I had endo symptoms and pain starting with my first period that were just never addressed. I remember being 21 and sharing how bad sex hurt with a gynecologist and she said I just needed to relax more in bed. I complained of urinary issues and was told I needed to drink more water. From day one I was told that my symptoms were basically my fault, which, for me, contributed to this feeling of being trapped inside my body. I was finally diagnosed when I was 28, but it took multiple ER visits and endometrial cysts rupturing for someone to really listen.Depression and anxiety can be a major byproduct… of living with endo, and I cannot stress enough how important it is to focus on the mental health impacts just as much as the physical ones. I’ve found that stress-management and mindfulness activities have been a game changer to help calm my mind and body. For me it's not meditating; it’s doing jigsaw puzzles, sitting outside for 15 minutes in the sun, stretching, or having a chill weed-Hulu-snacks kind of night.I’m always fighting for... more symptom awareness. We hear so much about painful periods being the telltale symptom, but not everyone with endo has painful periods. For example, 90 percent of people with endometriosis experience gastrointestinal issues. Fatigue from endo has severely impacted people’s relationships and careers. And many people are not diagnosed until they experience fertility issues (up to 50 percent of people with unexplained infertility have endo). It can help manage and treat what’s really going on, and most importantly, help people understand their bodies better.This book is a love letter… to anyone who has ever felt alone in their endo or didn’t think making it through another day was possible. Endo can feel really isolating, so I wanted (and needed) to bring some hope with this book. While we don’t have a cure for endo (yet), it’s my mission to help us have more good days than bad, learn to trust our bodies more, and gain, or regain, confidence to advocate for ourselves better.I talk more about a foam roller… than any person should. On the first couple days of my period, I'm foam-rolling my lower back, booty, upper back, and fronts of the legs like a champ. Is it going for a run? No. Am I breaking a sweat? Nope, but I'm still moving my body, and this plays a huge role in managing my endo symptoms. I used to be all or nothing with exercise, but in the last few years I've made a very conscious effort to really tap into what I’m capable of that day. Some days it’s more, some days it’s less—but it all makes a difference.I try to eat lower-inflammatory meals… that are full of veggies, fruits, nuts, and seeds. Endo is an inflammatory condition, so trying to reduce things that make my body more inflamed—like dairy and super processed foods—has helped me. But I’m also wary of villainizing foods because of what that can do to us mentally. The self-blame game can be dangerous with endo: “Well, I ate gluten today so that's the reason why I'm in so much pain.\" That pain could be completely unrelated to the bread you ate for lunch. There isn’t one endo diet that will work for everyone. It’s about finding the foods that work for your body.I eat a lot of white potatoes… on the days I feel the worst. There will be some nutritionists out there appalled by this, but eating simple foods that are easy to digest just works best for my body. Plus mashed potatoes are pretty much the greatest food ever invented.Know Your Endo: An Empowering Guide to Health and Hope With Endometriosis$20 $18 at Amazon$18 at BookshopExplore Bon AppétitPerson of InterestHealthyishBooksInterviewsRead MorecultureThe Woman Who Changed the Way I EatBy Lena DunhamLifestyleLearning to Eat for My Endometriosis When Answers Are ScarceBy Kirsten SlyterLifestyleAdult Acne Wrecked My Self-Esteem. Here’s How I Dealt.By Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-27", "author": ["Condé Nast", "Ali Francis"]}