{"id": "fdcb534faf47f548fba218cc61bc024f", "url": "https://www.bonappetit.com/story/almondine-bakery-brooklyn", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "Almondine Bakery Is the Only Reason You’ll Find Me in Dumbo, Brooklyn | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAlmondine Bakery Is the Only Reason You’ll Find Me in DumboI will endure bickering children and stressful parking situations for thrillingly good pastries and genuine kindness.By Chris MoroccoJanuary 8, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I sound, convincingly, twice my age whenever I visit New York City neighborhoods I frequented in my 20s and grumble about how much they have changed. Take Dumbo, which like most of New York at some point, was a wind-swept series of warehouses with a few brave restaurateurs and art gallery owners. Now, the streets are packed with selfie-takers posing between the bridges and enough new construction that feels completely irresponsible, considering the lack of street parking. Despite my complaints, there is one North Star that beckons me back to the neighborhood: Almondine Bakery.As you know, I love a good bakery. Standalone bakeries that produce everything in-house are hard to find—let alone ones that produce results as consistently good as Almondine. The bakery is on the first two floors of a charming brick house. Though it’s become increasingly crowded out by glass and steel nearby, it doesn’t seem to be going anywhere.Almondine is the kind of spot that seems to be on every corner in Paris—packed with classic French pastries, unpretentious and yet insanely good. The pain aux raisins is my favorite, a tight coil of croissant dough layered with a whisper of unctuous pastry cream and jammy-glazy raisins. The eclair, compact tubes of still-crisp choux pastry piped with chocolate, coffee, or caramel pastry cream, are the best in Brooklyn, if not all of New York. Equally impressive are the buttery slabs of fruit tart, covered with small apricots or creamy pear wedges. Even the Napoleon, usually a sweet, stodgy brick, is a marvel of flaky layers interspersed with rich custard.But I don’t come to Almondine just for the pastries. The chef, Hervé Poussot, once gave my son a warm madeleine, pressing it into his chubby two-year-old hand and saying, “Tien, mon petit.” On a separate occasion, he sent a molten chocolate cake to my wife and kids who sought refuge at the bakery after a cold walk through the park from Jane’s Carousel close by. So yeah, I will endure my bickering kids on long F train rides or 30-minute-long searches for parking in order to experience thrillingly good pastries and genuine kindness. New York isn’t Paris, and a good bakery isn’t just around the corner. But a trip to Almondine makes an argument for just one great bakery being enough.Go there: Almondine BakeryExplore Bon AppétitHighly RecommendNew York CityRead MorerestaurantsRockaway Beach Bakery Is the Real Reason I Go to the BeachBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-08", "author": ["Condé Nast", "Chris Morocco"]}