{"id": "fdcb69c7cdcd9a1457927da1a62357ff", "url": "https://www.bonappetit.com/story/jugaad-indian-philosophy", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "This Indian Philosophy Made Me a Better, More Resourceful Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Indian Philosophy Made Me a Better, More Resourceful CookI live a low-waste lifestyle almost by accident, and I’m a better cook for it. By  Akanksha SinghMay 21, 2020FacebookTwitterEmailIllustration by Simone NoronhaFacebookTwitterEmailGrowing up, as my parents shuffled our family between cities, countries, and continents—from India to the UAE to Singapore, it was my Indian mother’s cooking that tied us to our culture, and made any home ours, no matter where in the world we were. Even as an adult, as I moved myself from country to country, first for school, then for work, all I needed were a few key ingredients and I could recreate that comfort—the smells and tastes of my family’s cooking, and love. But two years ago, when I finally moved back to Mumbai, that relationship was transformed.In Singapore and Brisbane, where I’d lived before, I had access to great produce. I could go to farmers’ markets or supermarkets; I could get herbs and experiment with golden squash blossoms in any season. And though I’ve always been conscious of food waste—drilled into me by my mother—if there were a few bites of leftover pilaf after a meal, it went into the compost without undo guilt. Then I moved to Mumbai. Suddenly I was without a grocer who could supply me with dollar Hass avocados in January. “Exotic” and non-indigenous herbs such as rosemary and lavender were incredibly expensive. And it wasn’t just certain foods I had less of, but living space, too. I moved into a 290-square-foot apartment—tiny, even for Mumbai. Being waste conscious was no longer a choice I could make; it was a necessity.In India, 50 million people may be living on less than $1.90 a day, and a 2016 survey found that less than thirty percent of Indian families owned a fridge (the cost of a single door, 52-liter fridge is $150). Food is cooked and eaten fresh daily. There are no microwaves; there's no reheating leftovers unless it's on a stove. And there's no affordable fast food unless it's street food wrapped in newspaper or served in pattal with a wooden spoon—the Mumbai government did away with single-use plastic in 2018.As I settled into my new home, I noticed how, probably because of this, there appeared to be a predominant culture of reuse and ingenuity: sugarcane juice vendors welded carts to tractors and cycles; dosa batter was scooped with a flat-bottomed bowl that doubled as a spreader to make the dosas paper thin; naans were made on stoves instead of the traditional tandoor; and in homes, stove-top ovens sat on counters.There’s a word for this kind of ingenuity. “Jugaad”—where resources fail and resourcefulness steps in. A uniquely Indian concept, the word is a catchall term for many things. For cutting corners, for being innovative—it's what people have to do to get by, it's the length they’ll go to seek out the Indian dream. Jugaad rejects consumerism by necessity and shows the astonishing possibilities that arise when people are forced to make do with what they have.The word, like my understanding of it, has evolved over the years. Growing up, I understood jugaad to be somewhat dirty, like “hacking.” The connotation was something broken into, or forced outside its typical function. By the time I’d moved to Mumbai, after India’s tech startup boom, it had become a buzzword. Jugaad, said the business experts, described what made Indian innovation innovative.Jugaad rejects consumerism by necessity and shows the astonishing possibilities that arise when people are forced to make do with what they have.Jugaad is a philosophy that now extends into most areas of my life. Like my living space. In a 290-square-foot apartment, everything has to have a purpose, and most things have to have a second or third purpose. My pressure cooker’s lid can be used as a saucepot. My mini egg-frying pan doubles as a tadka pan. My multi-purpose, six-person French press has recently added “nut-milk strainer” to its list of functions. I’ve learned that old glass Perrier bottles can be filled with cleaning suds (spray nozzles fit perfectly, I swear), and my toaster-oven-friendly Madeleine mould is great for shell-shaped ice or serving ice cream. I love making fresh pasta, but the little bit of counter space I have has rounded edges and my pasta press won’t clamp onto it. So now the Murphy bar (like a Murphy bed, it’s a little bar top attached to the wall), sanded down, is for pasta, too. It’s also an ironing board, a divider between my \"bedroom\" and kitchenette, and of course, a dining table. When I host, my guests stand around it.And I’ve learned to find local substitutes for things I miss. Guava cheese and aam papad, the sweet variety, is a great substitute to membrillo on a cheese platter. I grow herbs I can’t otherwise get. I’ve even come to enjoy many vegetables I didn’t have back in Australia––mustard greens, bathua (pigweed), jackfruit, and parval (pointed gourd), to name a few.But there’s a second and very important component to my jugaad practice, which is that it’s a de facto low-waste lifestyle. Growing up, my mother was strict about food waste. If my sister and I served ourselves outrageous portions we were made to eat everything on our plates. No exceptions. “There are kids in India who don’t get one meal a day,” she’d say. It was one thing to know that food scarcity was the reality for a large majority of people—both through my mother’s words and our sheltered family visits to India—but it is quite another to live beside it.In many parts of the world, we’ve made the idea of going “low-waste” harder than it needs to be. After two years living in Mumbai, practicing jugaad, I live a low-waste lifestyle almost by accident, and I’m a better cook for it. Veggie scraps make for good broth, citrus peels mixed with vinegar make a pleasant countertop cleaning spray, or coated in sugar, a good candy. Broccoli, kale, and cauliflower stems are, I’ve learned, edible. Leftover okara from a freshly made batch of soy milk is great for both a hummus-type dip, crackers, and biscotti.Since living in Mumbai, I’ve come to realize that my unequivocal love of food had in fact been skewed by privilege. Living with the restrictions and realities has taught me a new way to cook, and eat. I used to think that food was a symbol of my culture and my mother’s care, but now it’s the act of jugaad—not wasting it—that matters more.Explore Bon AppétitHealthyishessayRead MoreLifestyleOur Favorite New Books For Climate-Friendly Cooking and LifeGallery4 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-21", "author": ["Condé Nast", "Akanksha Singh"]}