{"id": "fdd6ac003b5da92244042b10bc8e1f83", "url": "https://www.bonappetit.com/recipe/raw-and-roasted-dinner-salad", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "Raw and Roasted Dinner Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRaw and Roasted Dinner SaladBy Kat BoytsovaJanuary 6, 20194.6(36)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintCrunchy, creamy, sweet, salty, and highly satisfying, this is the kind of salad you can make a meal out of—and have leftovers you're actually excited to eat for lunch the next day. Using cabbage as the base (we like red, but green or savory cabbage would work great, too) not only makes it more substantial than it would be with delicate, leafy greens, but also increases its staying power, and massaging it with a bit of lemon juice after it's chopped ensures that it's plenty tender.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEASpoon$24.69 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketColander$11 At AmazonPaper Towels$13.45 At AmazonSpatula$12.99 At AmazonLarge Bowl$18 At AmazonSmall Bowl$13 At AmazonMicroplane$16 At AmazonWhisk$10 At AmazonPlatter$29 At AmazonIngredients4 servings1large delicata squash (about 20 oz.)115-oz. can chickpeas4Tbsp. extra-virgin olive oil, divided3tsp. kosher salt, divided1small head of red cabbage (about 1 lb.)2lemons1small garlic clove⅓cup tahini1Tbsp. honey1large Asian pear or sweet-tart apple, such as Pink Lady½cup pecan halves4oz. fetaPreparationStep 1Place a rack in bottom third of oven; preheat to 475°. First things first: Prepare your squash for roasting. Delicata is our favorite winter squash—it's sweet, sturdy, and the peel is not only edible but delicious—but you can use an equal quantity of (peeled!) butternut or acorn squash here if you want. Slice 1 large delicata squash in half lengthwise. Using a spoon, remove seeds. Cut each half again lengthwise, then crosswise into 1\" pieces. Transfer to a large rimmed baking sheet.Step 2Pour 1 15-oz. can chickpeas into a colander, rinse, and shake off excess water. Pat chickpeas dry with paper towels. (The drier they are, the crispier they will become, so don't skip this step!) Add to pan with squash.Step 3Add 2 Tbsp. extra-virgin olive oil and 1 tsp. kosher salt to pan with squash mixture and toss to combine.Step 4Roast squash and chickpeas, tossing once halfway through with a spatula, until well browned and chickpeas are crispy, about 20 minutes. Let cool slightly on pan about 5 minutes.Step 5Meanwhile, cut 1 small head of red cabbage into quarters and remove core. Slice quarters crosswise into ¾\"-thick strips. Transfer to a large bowl.Step 6Juice 2 lemons into a small bowl. Pour 3 Tbsp. juice over cabbage; reserve remaining juice in bowl.Step 7Add 1 tsp. kosher salt and remaining 2 Tbsp. extra-virgin olive oil to bowl with cabbage and massage with your hands until cabbage is beginning to wilt. This takes some of the edge off of the cabbage, softening it slightly—taste as you go, and stop when it's as crisp-tender as you like it. Let sit until ready to use.Step 8Finely grate 1 small garlic clove into bowl with reserved lemon juice. Whisk in ⅓ cup tahini, 1 Tbsp. honey, 1 Tbsp. water, and remaining 1 tsp. kosher salt. The dressing should be thick but pourable, so if it needs to be thinned out, add more water by the teaspoonful.Step 9Quarter and core 1 Asian pear or sweet-tart apple. Slice each quarter crosswise into ½\"-thick pieces. Transfer to bowl with cabbage.Step 10Add roasted veggies to bowl with cabbage and pear. Spread ½ cup pecan halves onto empty pan and toast just until fragrant, 3–4 minutes. Let cool slightly while you assemble the salad.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 11Pour dressing over cabbage mixture and toss to combine. Transfer to a large platter.Step 12Thinly slice 4 oz. feta into planks and coarsely crumble over salad.Step 13Using your hands, crush pecans over salad and serve.How would you rate Raw and Roasted Dinner Salad?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleIs there a way to view nutritional values? Thanks!A.W.South Acworth, NH1/13/2022This was fantastic. The only squash I could find was acorn so I went ahead and used that. I also used sweet potato in addition to the squash. I’m not a big fan of pears (it’s the grainy mushiness for me) so I chopped up Cosmic apples as well as the pear. I had to double the recipe as I have four teenagers that are always hungry. This meal was a hit and satisfied everyone! Even the pickiest of the four sat down and turned off TikTok to enjoy her meal. The kids say that the feta and fruit is the *chefs kiss*.  I’m just glad they’re happy and full - they didn’t even realize it was technically a salad. The recipe was easy and came together nicely. We had leftovers that were just as delicious the next day - maybe even better in my opinion. This is going to stay in our meal rotation. NicoleYonkers, NY3/16/2021WOW so good, i used sweet potato instead of the squash and it tasted fantastic, trying to put more vegetarian dishes into my daily life, will make this again and when having a get together when that happens i will bring this for sure!!CharlottePittsburgh Pa3/15/2021\n1/2 cup tahini - is that tahini sauce?MeNiles, Mi3/12/2021This is delicious! Easy to make and yummy to eat. It’s in our meatless Monday lineup for sure! AnonymousLouisville, KY2/7/2021I used sweet potato instead of squash because that's what I had. Also accidentally used radicchio instead of red cabbage - a funny mistake but the flavours balanced out really nicely. This was delicious! Good on a bed of greens as well. SophieOntario, Canada11/19/2020 I have made this twice now. The first time true to the recipe, the second I modified due to my Pandemic Pantry. Still awesome! I substituted or augmented with mixing cabbages, swapping squash for golden beets, used almonds instead of pecans, a sharp cheddar in place of the feta, beluga lentils for the chickpeas. I know, that's a lot but I kept the balance of sweet/savoury/salty/sour so it was still great! AnonymousVictoria, BC Canada4/8/2020This salad is really good! Loved the dressing. Made it exactly like the recipe. This will be a go to supper all winter long!AnonymousNorth Carolina1/20/2020A new favorite, for sure!  Made this for an office potluck and it was definitely a hit - one person said \"an explosion of flavors\", and other asked for the recipe :) Each bite is something different and delicious.  Great when fresh, or even the next day after the dressing has had even more time to breakdown the bitterness/toughness of the cabbage.  mstark22NY11/26/2019Made this almost exactly as written except I used butternut squash, omitted the chick peas and nuts as I didn't have them on hand.  It was one of the most delicious salads I've had. All the flavors worked well together - you probably don't need all the dressing as it makes quite a bit. We're usually 'green salad' people so not having any greens in this was a novelty. It comes together quickly - definitely great for weeknights. We used this as a side salad to the easy roast cod recipe on the BA website.rp21NJ10/29/2019Made it for Sunday dinner and was delicious. I used butternut and roasted it for 20 minutes before adding the chickpeas for 20 more minutes. Great winter salad to make - I never feel like a lot of salad in winter, but get tired of soups and stews. Also a great way to eat red cabbage. Unfortunately, my teenage son didn’t love it as much - I rate it 5 and he rates it 3.\nNext time, I’ll remember to make it for a potluck and might omit the feta.Seattle, USA1/21/2019This was a hit at our house! So many yummy flavors that work together perfectly. I ended up using butternut squash, bc I couldn't find delicata and was on a time crunch, but it was still awesome. Might roast a bit longer next time, but that's just bc I like a little extra char. \nNot only is it delicious, but you get so many healthy good things in one place. Also, it comes together in the time it takes to roast the squash and chickpeas. Another weeknight favorite! AnonymousChicago, IL1/17/2019YUP. Made exactly as listed - this is crazy good. Like other reviewer - I love that it's 100% exciting stuff! Would happily and easily eat this every day for lunch. kmarxmarxchicago, il1/17/2019Delicious and harmonious flavors and textures! A salad made of 100% exciting stuff, instead of 10% exciting stuff + 90% boring greens. The amount of dressing as written in the recipe felt right to me.\n\nHowever, it may not have enough calories to serve as a dinner salad for you -- I was hungry again 4 hours later. I'm going to serve it as a side salad alongside a roast chicken tonight and I think it'll be heavenly.AnonymousCalifornia1/17/2019So good. Made all of the dressing but only used about half. Added warm shredded chicken. In love with this recipescarey31Minnesota1/14/2019Explore Bon AppétitSaladChickpeaBeanVegetableFetaCheeseDelicata SquashSquashRed CabbageCabbageLeafy GreensFallMainSideVegetarianGluten-FreeRoastLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-06", "author": ["Condé Nast", "Kat Boytsova"]}