{"id": "fdea4d2f3b514cef6119b16d403c7790", "url": "https://www.bonappetit.com/story/corn-season", "year": 2019.0, "month": 7.0, "day": 5.0, "content": "The Only Way I Cook Corn | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Only Way I Cook CornAdam Rapoport has lots to say about corn, so you better not ask him to cook it in February.By Adam RapoportJuly 30, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.On the latest episode of the Bon Appétit podcast, we got into it about corn.Our pal Gabe T. was telling Carla Lalli Music and me about how he chided his sister-in-law for ordering an ear of corn at a Long Island chowder house over July 4th weekend.“Jill—that corn’s not local.”Jill laser-eyed him. “Oh really, Gabe—it’s not ‘local’?” air quotes firmly in place.Not to get too food preachy (because, honestly, who’s going to listen to a guy who drinks his beer on ice)? but Gabe’s right. Corn, like tomatoes, is one of those things you can’t rush.Want this letter before it hits the website? Sign up for our newsletter!Nothin’ like a grill to get that caramelized char.\nYes, your supermarket will start stacking piles of the stuff at the first whiff of sunscreen season, but it’s from...where, exactly? It’s been sitting in a refrigerated 18-wheeler for how long?Quality, in-season corn doesn’t hit the northeast (where we here at BA live) until right about now. And suddenly, for a couple of months, it’s everywhere.The first thing I’m doing, after sourcing the best I can find—husks that hug the ears, shiny silk, tightly bunched kernels—is plunging them into well salted, rapidly boiling water in the biggest pot I own. And for only a few minutes.Ripe, fresh-picked corn is so tender and sweet, you can (and should) eat it raw, whether in a salsa or salad. So when you’re boiling it, you’re really just trying to get it piping hot, so that butter you’re about to slather on it will get all melty.No presoaking or preshucking necessary for this salad.\nOn the grill, BA advises that you keep the husks on and lay the corn straight on the grates, no need to soak. Which I guess I’m okay with. But, personally, I love shucking the ears first and then grilling, so the kernels take on a nice caramelized char, ideal for elote, the beloved Mexican corn slicked with mayo, cotija cheese, chile, and lime juice.A couple of months from now, I hope to be so tired of corn that I won’t want to see it till next July—at which point I won’t be able to wait to get my hands on some.Get the recipe:Grilled Corn Salad with Hot Honey–Lime DressingBright and light, this grilled corn salad with avocado will go with everything else at your summer barbecue.View RecipeExplore Bon AppétitAdam NewsletterGrillCornRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-30", "author": ["Condé Nast", "Adam Rapoport"]}