{"id": "fdec587f703eacba1d625103119dcf9a", "url": "https://www.bonappetit.com/story/vitamin-c-salad-sick", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Only Vitamin C Can Save Us Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOnly Vitamin C Can Save Us NowWhen everyone is getting sick around you, make a superfruit salad.By Carla Lalli MusicJanuary 17, 2019FacebookTwitterEmailPhoto by Alex Lau, Styling by Andy BaraghaniFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Nice to vitamin C youGetting sick is not on my to-do list.The risk is real. The subway is a rolling sick ward. People are sniffling in meetings and talking about work things with hoarse, gravelly voices. Children are coughing, sometimes on me. I’m going on a work trip tomorrow—to Italy, no less!—and Molly Baz, my colleague and traveling companion, just announced that her husband has doctor-verified flu. He’s in quarantine at home and their puppy is being wiped down several times a day with antibacterial wipes, but still—we’re terrified! There’s a lot of mozzarella that I’m supposed to eat while I’m there, and I need all of my strength.Want this letter before it hits the website? Sign up for our newsletter!Whenever I feel exposed and vulnerable, I turn to food to fix everything. After getting my flu shot last week, I ran straight to the closest bodega for all of the fruits I needed for this salad: oranges, grapefruit, mango, kiwi, and a bottle of fresh carrot juice too. This big bowl of sunshine was specifically formulated to supercharge the human system: citrus and tropical fruits are loaded with vitamin C, which is a legendary antioxidant and all-around don’t-get-sick-idant. It’s also got chiles in it—did you know they have a lot of C? True story. There’s a dash of turmeric and fresh ginger for their anti-inflammatory powers and carrot juice for full vegi-fication.Photo by Ted CavanaughBut there’s another reason why I love this salad, and it’s the colorful juiciness of it all. I’ve had some fantastically sweet and juicy satsumas and cara cara oranges in the past month, and love the sharp sourness of a regular white grapefruit too. Poke around for blood oranges, clementines, and Ruby Red grapefruits next time you go shopping. Always store your citrus in the fridge, then cut away the peel and slice into any big-bite-size shape you want (they don’t have to be rounds). Winter, the darkest season, is saved by citrus, so when you have a second, thank Florida and California from the bottom of your salad bowl.Mangoes will continue ripen after being picked, so it’s okay to buy one still firm, but make sure it is fragrant at the stem end—it’s the best indication that you’ve got a potential winner on your hands. They ripen at room temperature, so when it’s tender, it’s ready. Tommy Atkins are readily available, but if you see other varieties like Ataulfo or Champagne mangoes, try them (they’re less fibrous, extremely aromatic, and the flesh is very silky).If kiwis aren’t your thing, stay on the tropical journey and substitute ripe pineapple instead. Whatever you do, don’t skip the drizzle of vegetal olive oil and topping of flaky salt, which will just make the sweet taste sweeter. And most importantly: Don’t. Get. Sick. There’s too much to do.Get the recipe:Vitamin C Superfruit SaladExplore Bon AppétitCarla NewsletterCitrusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-17", "author": ["Condé Nast", "Carla Lalli Music"]}