{"id": "fe0543cfe13103178b60ceac94b7d163", "url": "https://www.bonappetit.com/recipe/spiced-potato-wedge-fries-with-yogurt-tahini-sauce", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "Air Fryer Spiced Potato Wedge Fries With Yogurt-Tahini Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAir Fryer Spiced Potato Wedge Fries With Yogurt-Tahini SauceBy Rachel GurjarOctober 7, 20213.6(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintCrispy on the outside, soft and fluffy on the inside, these potato wedges are tossed in a seasoning spice blend and then fried until golden. Serve them with a cooling creamy yogurt-tahini sauce (we love using Soom brand tahini!) or sub your favorite plant-based yogurt to make this dairy-free and vegan.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCOSORI Air Fryer Max$120 At AmazonSoom Tahini$9 At BA MarketWhisk$10 At AmazonCitrus Juicer$7 At AmazonIngredients4 ServingsFries2lb. large russet potatoes (about 3), unpeeled, cut into ¼\"-thick wedges1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt1Tbsp. garlic powder1Tbsp. paprika½tsp. cayenne pepper3Tbsp. (or more) extra-virgin olive oilSauceJuice of 1 lemon½cup plain whole-milk yogurt¼cup tahini (such as Soom)1½tsp. maple syrup1½tsp. SrirachaKosher salt3Tbsp. finely chopped chives, dividedSpecial EquipmentAn air fryerPreparationFriesStep 1Heat air fryer to 380°. Place potatoes in a large bowl and pour in cool water to cover. Soak 15 minutes. Drain and pat dry with paper towels.Step 2Whisk salt, garlic powder, paprika, and cayenne in a small bowl until combined.Step 3Wipe out bowl and return potatoes to bowl. Toss with oil until well coated. (If any dry spots remain, toss with another 1 Tbsp. oil.) Gradually sprinkle spice mixture over, tossing potatoes to evenly coat.Step 4Transfer potatoes to air fryer and cook, shaking halfway through, until deep golden brown and cooked through, 40–45 minutes.SauceStep 5Whisk lemon juice, yogurt, tahini, maple syrup, and Sriracha in a small bowl until smooth. Season with salt. Stir in 1 Tbsp. chives.Step 6Transfer potatoes to a platter. Season with salt and sprinkle remaining 2 Tbsp. chives over. Serve with sauce alongside.How would you rate Air Fryer Spiced Potato Wedge Fries With Yogurt-Tahini Sauce?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleAgree with other reviewer about the time. Ours were super crispy in about 28 minutes--a bit overcooked, too. I'd either lower the amount of time to about 25 minute or increase the thickness of the potato to 3/8\" or maybe 1/2\". We cut the recipe in half, which was more than enough for two people...also used non-fat yogurt, which seemed to work fine--the dip was tasty.\nLebo151Pittsburgh, PA12/5/2021Great spices. But 45 minutes in an air fryer gives you burnt potatoes. You guys need to recheck that time on your air fryer. Maybe 45 in an ovenAnonymousDallas, Texas10/13/202145 minutes is not an attractive thought.guess I’ll stick with my original method but thanks for clarifying to rid me of my misconceptions.AnonymousMontana10/9/2021Explore Bon AppétitRusset PotatoPotatoVegetableYogurtOther IngredientsTahiniCondiments, Sauces & PastesVeganVegetarianDairy-FreeDinnerSideEasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-07", "author": ["Condé Nast", "Rachel Gurjar"]}