{"id": "fe11f3922e84ab7d9fe675b1e675e688", "url": "https://www.bonappetit.com/recipe/chicken-soup-with-rice-noodles-and-scallion-crisp", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Chicken Soup With Rice Noodles and Scallion Crisp Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueChicken Soup With Rice Noodles and Scallion CrispBy Christina ChaeyJanuary 4, 20223.7(25)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintNot every great chicken soup starts with hours and hours on the stove. This weeknight-friendly version gets a flavor jump-start from ginger that’s thinly sliced, fried until deep brown, and joined by garlic and scallions. While the stock cooks you’ll have enough time to use the rest of your ginger, garlic, and scallions for the crunchy-toasty topping that makes every bowl extra-special.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonInstant-Read Thermometer$35 At ThermoworksMicroplane Grater$16 At AmazonMesh Sieve$13 At AmazonIngredients4 servingsChicken and broth2Tbsp. grapeseed or vegetable oil13\" piece ginger, scrubbed, thinly sliced4scallions, cut into 3\" lengths6garlic cloves, smashed2skin-on, bone-in chicken breasts (about 2 lb. total)2tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus moreScallion crisp and assembly6scallions, white and green parts divided, thinly sliced12\" piece ginger, peeled, finely grated6garlic cloves, peeled, thinly sliced½cup grapeseed or vegetable oil1tsp. soy sauce8oz. rice stick noodlesKosher saltSambal oelek and mixed tender herbs (such as Thai basil, basil, cilantro, and/or mint; for serving)PreparationChicken and brothStep 1Heat oil in a large Dutch oven or other heavy pot over medium-high. Cook ginger, stirring, until deeply browned and very fragrant, about 5 minutes. Add scallions and garlic and stir to coat, then add chicken. Carefully pour in 8 cups water and add 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt. Bring liquid to a boil, skimming foam from the surface as needed. Partially cover pot, reduce heat, and gently simmer until chicken is cooked through and an instant-read thermometer inserted into the thickest part registers 155° (internal temperature will increase to 160° as chicken sits), 20–25 minutes. Transfer chicken to a cutting board; let sit until cool enough to handle, about 10 minutes.Step 2Remove skin from chicken and discard. Separate meat from bones and slice ½\" thick; set aside for serving. Return bones and any juices accumulated on cutting board to pot; simmer broth 15 minutes. Strain through a fine-mesh sieve into a medium heatproof bowl; discard solids. Transfer broth back to pot and season with more salt if needed. Keep warm until ready to serve.Do ahead: Chicken can be cooked and broth can be made 3 days ahead. Transfer to separate airtight containers and chill. Reheat broth and chicken before using.Scallion crisp and assemblyStep 3Place scallion greens and ginger in a medium heatproof bowl and set a fine-mesh sieve on top; set aside.Step 4Cook scallion whites, garlic, and oil in a small saucepan over medium-low, stirring occasionally, until scallion whites are beginning to crisp and turn golden brown and garlic is golden, 8–10 minutes (don’t rush this process and watch carefully toward the end to make sure garlic doesn’t burn). Pour mixture through reserved sieve into bowl with scallion greens and ginger. Turn out scallion crisp in sieve onto paper towels and let drain (this process allows the scallion and garlic to crisp up even more before adding back to oil). Stir scallion mixture in bowl to combine, then stir in soy sauce and scallion crisp; set aside.Step 5Meanwhile, cook noodles in a large pot of boiling salted water according to package directions. Drain and rinse under cold running water. Divide evenly among bowls.Step 6Top each bowl with a few slices of reserved chicken; ladle broth over. Top with a spoonful of scallion crisp, some sambal oelek, and a big handful of herbs.Do ahead: Scallion crisp can be made 1 week ahead. Let cool; transfer to an airtight container and chill.How would you rate Chicken Soup With Rice Noodles and Scallion Crisp?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI just wish it had nutrition info broken downAnonymousHamburg, NY2/9/2022After following previous reviewers’ suggestions, this did come out decent. It was a significant amount of work for a “weeknight meal,” requiring three pots and pans and a multitude of other dishes. Not bad, but I’m not sure it’s worth making again either. AshMonroe, WA2/6/2022I made this soup and my family loved it! I did make a few tweaks to it tho…. I did use 2 bone in chicken breasts but instead of using water I used chicken broth and threw in 5 star anise into the pot and 2 Tablespoons of sugar to make it a little closer to phó broth. Once the chicken was done cooking I put the bones back in the pot and let it simmer for closer to 30 minutes. I served it with jalapeño slices, scallions, Thai basil, hoisin….. because I made the broth earlier in the day I let it sit for a couple hours and it helped the flavors develop even more. This soup is good if your prepping earlier in the day or even the day before, then it’s easy to reheat, assemble and serve on a busy weeknight. I’m definitely making this again!!LeahtotheExtreme Dana Point, California 1/19/2022I’m sure this recipe was well intentioned, but the flavor was lacking. Pho is a beautiful, complex recipe that can be expedited when bone broth is made in an instant pot,  and this recipe missed the mark. Anonymous1/17/2022This is not a weeknight friendly version of chicken soup.  I used a whole chicken and had to cook for around an hour, not 20-30 minutes, to get a reasonable amount of chicken flavor in the broth. Between prepping all the pieces of this soup, it took twice as long as regular old chicken soup. That said, the flavors were nice together and it was enjoyable. Not 5star enjoyable and the prepping brings the score down further AnonymousBeit Shemesh, Israel1/17/2022Agreeing with 1/13 comment. Doesn’t have much flavor. I’m glad I added the mint at the end, because that is the only flavor I taste.AnonymousCharleston, SC1/13/2022flavorless...I can't believe there aren't more spices in the soup. this is like pho but if you took all the culture out of it.Anonymoussan diego1/13/2022Explore Bon AppétitWeeknightEasyDinnerSoupSoups and StewsRice NoodleNoodlePasta & NoodlesChickenPoultryChicken BreastGluten-FreeDairy-FreeNut-FreeHealthyishMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Christina Chaey"]}