{"id": "fe2e67152ed3a4a95dbfd7b1ffc770ea", "url": "https://www.bonappetit.com/story/the-best-pasta-pot-is-actually-a-dutch-oven", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "The Best Pasta Pot Is Actually a Dutch Oven | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Pasta Pot Is Actually a Dutch OvenWhen we're making pasta, we're doing it in a Dutch oven.By Alex DelanySeptember 11, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailIn movies, you see pasta made one of two ways. There’s either a towering aluminum pot, as large as a small home, holding what seems like 14 pounds of spaghetti and red sauce, which is being dished out to a large group of people. (Maybe even a high school football team?) Or there’s a small skillet, being meticulously stirred in a professional kitchen as a small portion of expensive pasta is added to the sauce, possibly in slow motion, and plated artfully on a glistening dish. That’s movie pasta, made in either a giant pot or a small skillet. But in real life, we make pasta in a Dutch oven, because when you’re cooking a pound of pasta, it’s the best option you have.If you’ve never used a Dutch oven to make pasta, that’s totally cool. This isn’t some new, scary experience you have to prepare for. All you have to do is switch one pot for another. But why are we telling you to do this? Well, there are a few reasons. Let’s dive in.The most convincing reason that the Dutch oven is the best pasta pot has to do with its size and shape. When we make pasta, we like to finish it, cooked just short of al dente, in the same pan that we've made our sauce in, where it can become fully coated with our beautifully-emulsified pasta sauce. And here's the thing: Tossing a whole pound of pasta in a regular ol' skillet, filled with a bunch of other ingredients, is a recipe for disaster—the pasta ends up flying everywhere. A Dutch oven is one of the few vessels in our kitchen that is large enough and has high enough sides to facilitate all of those carbs being tossed around without losing one single precious noodle.And less mess should be enough of a reason to make the switch to the Dutch oven for finishing pastas. But if you need one more, another enabler for your laziness, Dutch ovens are great for serving as well. Just wipe up the edges, put a towel down on your table, and plop that big old pot of pasta in front of everyone. Buon appetito, as they say.That's the stuff! A Dutch oven is the best pasta pot there is, period.\nPhoto by Heidi's BridgeBut there are plenty of other reasons to reach for your trusty Dutch oven when you're taking a trip to pasta town. Most Dutch ovens—whether they happen to be coated in enamel or simply seasoned—are made from a base of cast-iron, and if you’re familiar with Basically, even in the slightest, you know we’re big fans of cast-iron. We like a cast-iron skillet, pot, or pan for a multitude of reasons, but the main reason is that the material retains and balances heat very efficiently. That means more even cooking, less scorching, and a smoother all-around food-heating experience—and it's good at keeping the food in it warm long after it's been removed from the heat. What's not to like about that?You might also notice that we do a lot of different things in a Dutch oven. We use it to braise meats. We use it to caramelize onions. We use it to bake bread. A Dutch oven is a kitchen workhorse, capable of performing just about every cooking task there is. And before you complain about how expensive enameled Dutch ovens are, just relax: You can get a very high quality one from a less-hyped brand for around $80. And you should. Because this vessel can do whatever you want it to do. And because every pound of pasta you cook from now on will thank you.Just Buy It: Lodge, 7.5-Qt Enamel Dutch Oven, $79 on AmazonAnd then go ahead and make this spaghetti pomodoro:Basically Spaghetti PomodoroAlmost as easy as opening a can of the store-bought stuff, and one hundred times more delicious.View RecipeAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitBasicallyPastaWeeknightToolsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-11", "author": ["Condé Nast", "Alex Delany"]}