{"id": "fe3496f3cf977937defb132b64d8ab0b", "url": "https://www.bonappetit.com/recipe/garlicky-grilled-squid-with-marinated-peppers", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Garlicky Grilled Squid with Peppers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueGarlicky Grilled Squid with Marinated PeppersBy Andy BaraghaniMay 21, 2019EmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintAs if grilled squid that's tender in the middle and charred on the exterior weren't good enough, we're pairing it with smoky bell peppers and a lemony herb salad. For the most delicious squid possible, look for small bodies and tentacles (bodies should be about four inches in length and tentacles about two) and pat dry before tossing in the garlic oil.Ingredients4 servings⅓cup coarsely chopped blanched hazelnuts or almonds2Tbsp. plus ½ cup extra-virgin olive oil, dividedKosher salt4large red bell peppers2Tbsp. sherry vinegar or red wine vinegar1tsp. hot smoked Spanish paprika3garlic cloves, divided1½lb. cleaned squid, bodies and tentacles separated½small red onion, very thinly sliced1cup mint leaves, torn if large½lemonPreparationStep 1Preheat oven to 350°. Toast hazelnuts on a rimmed baking sheet, tossing once, until golden brown, 7–10 minutes. Let cool, then crush nuts using the side of a chef’s knife or coarsely chop. Transfer to a small bowl. Mix in 2 Tbsp. oil and season with salt. Set aside.Step 2Prepare a grill for high heat and place a wire rack on one side, orienting it perpendicular to grill grate. Place bell peppers directly on grate (not on wire rack) and grill, turning occasionally, until charred all over and flesh is very soft, 8–10 minutes.Step 3Transfer bell peppers to a medium bowl and cover tightly with plastic wrap. Let sit 10–20 minutes (doing this extends the cooking and softens the skins). Remove skins from peppers and scoop out seeds; discard. Tear or slice peppers into large pieces and place in a clean medium bowl. Add vinegar, paprika, and ¼ cup oil and finely grate 1 garlic clove into bowl. Season with salt and toss well to coat peppers.Step 4Return grill to high heat. Finely grate remaining 2 garlic cloves into a large bowl; stir in remaining ¼ cup oil. Pat squid dry, then add to oil mixture; toss well to coat. Working in batches, grill squid on wire rack on grill until marks appear on bodies and tentacles begin to crisp around the edges, 45–60 seconds per side. Transfer to a clean large bowl and season with salt.Step 5Place onion and mint in a small bowl. Finely grate zest from lemon half over, then squeeze in juice. Season with salt and toss to combine.Step 6Divide marinated peppers and squid among plates. Spoon hazelnuts over and top with mint salad.How would you rate Garlicky Grilled Squid with Marinated Peppers?Leave a ReviewTell us what you thinkExplore Bon AppétitSquidShellfishSeafoodBell PepperVegetableGarlicSummerQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeHealthyishGrillingMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Andy Baraghani"]}