{"id": "fe4256f3bff36bb06906340eb41f198d", "url": "https://www.bonappetit.com/story/fresh-sourdough-starter", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "This Fresh Sourdough Starter Takes the Stress Out of Baking Sourdough | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Fresh Starter Takes the Stress Out of Baking SourdoughIt's descended from a starter that’s over 100 years old, so you know it’s going to be bubbly, active, and reliable.By Sarah JampelMay 11, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!Sourdough-baking can be challenging, to say the least. That’s great if you're a tinkerer, experimenter, or problem-solver—but frustrating if you're a perfectionist like me. So when I wanted to pick up bread-baking again after a lengthy hiatus, I didn’t feel guilty about skipping the scariest, most uncertain part of the process: creating the starter itself.After trying twice and failing twice (first with grapes that went moldy, then with pineapple juice) to make my own, I decided to buy a starter from King Arthur, the same employee-owned Vermont-based company where I buy my all-purpose flour (and my not-so-all-purpose boiled cider and Fiori di Sicilia).KAF’s sourdough starter arrives in a little jar, alive and ready to go. (Whereas dry starters have to be rehydrated and revived, fresh starters get fed just a few times—then you can bake.) It’s descended from a starter that’s over 100 years old, so you know it’s going to be bubbly, active, and reliable. Just think of how many loaves have already been born from this starter’s siblings and cousins! Having your starter taken care of doesn't guarantee sourdough success, but at least it won’t be quite as frustrating.Buy it: King Arthur Flour Fresh Sourdough Starter, $9.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish Loves ItHealthyishBreadShoppingRead MoreLifestyleThis Cookbook Is Changing the Way I Use VegetablesBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-11", "author": ["Condé Nast", "Sarah Jampel"]}