{"id": "fe464d4e6a4a068ba5f56acf86f18f3c", "url": "https://www.bonappetit.com/story/existential-dread-meal-planning", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "My Meal Plan Isn't Stressful, It's a Lifeline | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I Conquer Existential Dread By Meal Planning for My FamilyIf a prep list worked when I was cooking professionally, it can work for my family of four.By Stephanie GanzJune 19, 2019FacebookTwitterEmailPhoto by Stephanie GanzFacebookTwitterEmailA short, non-exhaustive list of things I never thought I’d become includes: an elementary school room mom, a business owner, a hoarder of houseplants, and a meal-planner. And yet, here I am—a grown adult with the decision-making power my teenage self would have killed for, squandering that precious autonomy on the relentless demand to keep my family alive and fed.The crushing stress that comes with being the family chef de cuisine feels heavy, like those lead vests they make you wear for X-rays. It’s the squeeze of anxiety, and it manifests physically, held in my chest and pulsing through my fingertips. It lives in a headache behind my right eye. If I don’t feed them, no one will!The only option is to plan. To make a list and organize until the future begins to take shape. So, that’s what I’ve done, every Sunday for the last two years. I’ve set aside time to tally up the food I have on hand and what I still need to buy, and imagined what the heck I’m going to do with it, and tacked it up on the fridge for everyone to see. And honestly, it thrills me. I crave the ritual of the planning process, the excitement of the market, the simplicity of the task work that cooking provides. I take on the charge fully, with my husband in a support role, ready and willing to go to the store at a moment’s notice and follow my excruciatingly precise directions on how to select an avocado that will be ripe by tomorrow morning and not a moment before.When I was cooking professionally, a prep list was vital in the chaos management that’s required of cooking for other people, and if it can work for 90 covers on a Saturday, it can work for my family of four. Three meals a day, five days a week, every single week.It starts at the Saturday farmers’ market, where I take a no-limits approach, filling a big straw basket until it imprints its weave on my forearm. The basket contains the building blocks of The Plan. I usually end up with two or three days’ worth of braising greens, some lettuces, the seasonal stuff that excites me—fava beans or heirloom tomatoes—and a few days’ worth of protein, often a whole chicken and some flat, grill-and-slice cut of beef. There’s no urge to be precise or to fret over quantities. The Plan helps me stretch the scarce ingredients and preserve the surplus, so I can focus on making sure I have enough to last until the next market.A nostalgia-inducing look at past meal plans.\nPhoto by Stephanie GanzMine isn’t a particularly attractive meal plan. There’s no cute, downloadable template, no prepping of ingredients in neat little containers. It’s a sheet of white paper on a clipboard and my best Flair pen handwriting, and that’s it. But there’s a calmness to it, as if by imagining the future, I can send my best, most prepared self into it. And when I feel prepared, I feel safe and capable.I start in the upper right hand side of a blank sheet of paper with a list of what I have to play with, not everything, but the freshest, most perishable and precious things. A couple of inches below that, I start the running tab of what I need from the grocery store. It’s a who’s-who of the snacky foods my family loves: beef jerky, microwave popcorn, pickles, pretzel crisps, plain LaCroix.Floating in the middle of the page are mini-lists and reminders, like “get bread” circled near Tuesday or “make juice” later in the week when I’ll need to use up the rest of the produce. The left side of the page is the heart of the meal plan, each day underlined and divided into three meals.BreakfastMy breakfast is usually leftovers from the night before fried up with eggs or a bowl of cottage cheese and tomato drizzled with balsamic vinegar and sprinkled with the good salt. Easy. Then comes the trickiest meal of the day—my seven-year-old Lily’s breakfast. When the sight of an unwanted plate of eggs can send her and, thus, all of us, through an emotional tornado, this meal takes on a certain gravity. We’ll do two days of bagels—always a hit; then a few days of fruit and bacon or frozen waffles. Variety is key.LunchI divide lunch like breakfast. Lily on the left, me on the right. Lily almost always packs a Yumbox, a bento-box-inspired food caboodle, and she enjoys filling the compartments with string cheese, fruit, bread, and ham.When I’m not out, rushing lunch between meetings or errands, I gravitate toward something I can make in one pan, like frozen potstickers. I fry the dumplings and then douse them in soy sauce, sesame oil, chili oil, and black vinegar with some cilantro and green onions. I inhale them like I’m in a dumpling eating contest, standing over the counter, listening to Fresh Air and answering emails while the baby happily picks at her plate of dumplings, eating the wrappers and throwing the little balls of filling on the floor.DinnerMy favorite time of day is the sacred hour when I make dinner. It’s the climax of the day, when everyone is home and on their own bullshit, yelling about snacks and darting around the back yard with a soccer ball. The noise blurs in the background like a pic in portrait mode as I focus on dinner, my apron on, knife in hand, and for the longest stretch of time each day, I feel like my own self and nobody else’s.I’ve come up with each meal by studying the right hand side of The Plan and pulling inspiration from magazines and Instagram. It’s an exercise in realistic creativity. A week might look like this:On Monday, I’ll use the whole chicken, some carrots, and swiss chard from my in-stock list. I know that spatchcocked, crispy-skinned chicken with tangy lemon and sumac is just the kind of crowd-pleaser we need after we’ve made it through a hectic entry into the work week, and I know I’ll have the time to get the chicken started around 4:30 to have dinner ready by 6:00.Tuesday is Noodle Night. It could go pasta, something with capers maybe, or crispy breadcrumbs. I’ve got to use up some mint, so I play around with a simple version of a Vietnamese vermicelli that lets everyone customize to their heart’s delight—extra grilled pork for me, no cucumbers for Lily, hoisin on the side for Mr. Ganz, a pile of undressed noodles for the baby.On a rainy Wednesday, I have a vision of chili mac, a glorious bowl of macaroni noodles, beef chili with the ground beef I scored on Saturday, topped with sour cream and Ritz crackers, which I always have on hand. Everyone will have seconds, and there might be a single, whole cumin-scented minute of the sound of quiet, satisfied eating.By Thursday, even with the best meal planning, I’ll need something from a store. I’ll plan to grab some arctic char and use up the end of the salad greens, and the meal will come together quickly with a simple miso dressing.Friday is harder to pin down. It might be takeout sushi. But if we’re feeling high on weekend vibes, maybe we’ll use the stash of frozen pizza dough with the last of the market veg as toppings, tossing dough up in the air and making a mess that doesn’t have to be cleaned up until Saturday.Over the past two years of meal planning, The Plan began to guide everything else. Our weekly family meetings use the meal plan as a jumping off point. We look at each day, talk about what we’re doing, always with the subtext of the nearest meal, which we plan together. Mr. Ganz asks for pad thai, Lily wants to make her own sushi, Hazel babbles obliviously but is happy to be considered, and it cuts down on eye-rolling or outright meal refusal, which makes everyone a little calmer and happier. I don’t always stick to it faithfully; I give myself the space to be spontaneous when I can be and something to fall back on when I just can’t. It’s not necessarily following the plan that matters—it’s taking the time to make the plan that counts.Looking back at the old meal plans, fastened to a bulging clipboard, is one long nostalgic stroll. There’s the stretch of time when I scoured my cookbooks for inspiration—Koreatown, Prune, Smitten Kitchen—marked with the page numbers I cooked from; I can watch the arc of Lily’s food cravings, from all-you-can-eat pierogies to kale chips; the week after Hazel was born is full of meals from friends, there are plans for holiday feasts and funeral refreshments and potlucks with our baby gang. It’s all there like a diary I didn’t mean to write.Someone on Instagram once replied to a meal plan: “You’re a hero,” she said. And I think she meant it sincerely and not ironically. I’m no hero. I’m just a lady with a vest of anxiety and a No Bad Meals life policy who has sort of figured out how to keep the cold hug of existential dread at bay, one meal at a time.Explore Bon AppétitHealthyishMeal PrepFamilyessayRead MoreLifestyleWhen I Don't Have Time to Meal Prep, I Do This InsteadBy Meryl RothsteinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-19", "author": ["Condé Nast", "Stephanie Ganz"]}