{"id": "fe5c215b45f7851ec40f50d4e2d9e353", "url": "https://www.bonappetit.com/story/a-culinary-trek-across-the-canadian-rockies", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "A Culinary Trek Across the Canadian Rockies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredA Culinary Trek Across the Canadian RockiesA standout food experience in the Canadian Rockies starts and ends with a luxury railway journey. Along the way: food you won’t forget.By Rocky MountaineerJanuary 24, 2019FacebookTwitterEmailFacebookTwitterEmailPristine mountain views and winter sports might be some of the first things you think of when it comes to the Canadian Rockies. But with natural resources this immaculate, the food scene is thriving as well. And that’s what we’re here for.From fine-dining establishments that serve the best dry-aged Alberta beef to cozy cafes with vegan sandwiches, Rocky Mountains restaurants are marrying spectacular experiences, breathtaking views, and farm-fresh foods that make for an unforgettable trip. Dotted throughout the mountains, you’ll find award-winning chefs from around the world cultivating inventive and inviting menus dedicated to translating the flavor of the landscape onto their plates.Photo by Rocky Mountaineer | Town of Jasper, AlbertaA little over 200 miles from Edmonton sits the quaint town of Jasper, the commercial center of Jasper National Park, which was established in the early 1800s as a supply depot for the fur trade, then revitalized in 1911 by the Grand Trunk Railway. Today the mountain village has a small-town vibe, thanks to its intimate community of outdoor enthusiasts. And if you’ve ever spent time in a cozy mountain town, you’ll know that none are complete without a craft brewery.Maybe it’s the crisp air coupled with pristine views that make towns like Jasper the prime location for such a place, or simply that visitors need somewhere to relax after a day of exploring one of the area’s many falls or canyons. Either way, Jasper Brewing Company knew its calling. Three Jasper locals opened the bustling, community-minded brewpub back in 2005––and it’s as local as it gets. “Our beer uses barley and wheat primarily sourced from Alberta, and of course, our water flows right out of the surrounding Rocky Mountains,” says brewmaster Spike Baker.Photo by Jasper Brewing Company | Rockhopper IPA & Bearhill RamenAs if being the first brewery in a Canadian national park wasn’t enough to set them apart, the owners are revolutionizing pub-fare menus while they’re at it. “Our upmarket-pub, scratch-made menu and in-house brewed beer make us one of a kind,” he adds. With dishes like duck tacos and wild boar steamed buns, it’s easy to see these aren’t your standard pub offerings. If it’s your first time, Spike insists you try the rustic elk meatloaf, and wash it down with a Blackeye Blueberry Vanilla Ale.If you prefer spirits over lagers, Park Distillery in neighboring Banff––the only distillery in a Canadian national park––is going local with their award-winning, small-batch, house-made libations. The landscape has made its way into the spirits: the Park Alpine Dry Gin, made with native spruce, evokes the scent of the surrounding forest, while the grain in the base spirit is sourced from family farms in the Alberta foothills. The Park Espresso Vodka is flavored with beans from the nearby Banff Roasting Company.Photo by Anna Robi | Park spirits on ice and campfire cuisine at Park Distillery in Banff, AlbertaThough Banff, just under 200 miles from Jasper, experienced its modern renaissance in the late 1800s when the new cross-Canadian railway was routed through the area, the region has been used as a hunting ground for more than 10,000 years. Park Distillery executive chef Mark Calcafuoco is embracing that history with the help of a wood-fired grill they refer to as the “indoor campfire.”Chef Calcafuoco recommends the rotisserie chicken, which is “slowly cooked over the fire for three or so hours...a truly amazing smoke-kissed dish.” And if you’re still craving that wood-fired flavor, the Observation Peak cocktail, which features Park Glacier Rye, is capped with a torched, smoky cedar square––a fitting nightcap in the middle of the woods.It’s clear that many of the restaurants in the Canadian Rockies feel compelled to produce cuisine that reflects the local bounty. And nature has answered. At Tekarra Restaurant, a Jasper staple since 1952, chef Dale Nutt artfully prepares dishes crafted from elk, bison, wild boar, and rainbow trout in a cozy atmosphere that’s surrounded by pine trees and is oh-so serene. Unique dishes, such as bison short ribs braised in Saskatoon berries and molasses, punctuate a menu of hearty, gamey iterations of Canadian mainstays like poutine. Chef Nutt also makes his own classic sauces and jams, bourbon mustard, and smoked trout.Photo by Celina Frisson | Alberta tenderloin beef skewers at Tekarra Restaurant in Jasper, AlbertaBack in Banff, Chuck’s Steakhouse starts cultivating an exceptional steakhouse experience at the farm. Its locally sourced beef comes from three family ranches, all within 205 miles of the restaurant, where the animals are grass-fed and raised in a kind, sustainable environment. When it comes to preparing each cut, the in-house dry-aging program is unique as well, as it is the only place in Banff that dry-ages Alberta beef with such care. “The longer the beef ages, the more intense the flavor and tenderness,” says chef Sal Polizzi. He adds, “Chuck's will generally dry-age its beef for 45 days, but have aged some cuts as long as 95 days.”Photo by Anna Robi | Chef Salvatore Polizzi of Chuck’s Steakhouse with in-house, dry-aged Alberta beef cuts.Go for the steak and marvel at the experience. The scenery at Chuck’s is nothing to scoff at––it has stunning mountain views––but if you want to feel as though you’re on top of the world, take the gondola to 7,510 feet above sea level to dine on fresh, Canadian fare at Sky Bistro. From Banff’s Sulphur Mountain, you’ll be surrounded by the Rockies, and savor food that reflects just that.Tucked inside Banff National Park, a UNESCO World Heritage Site, Fairmont Banff Springs goes by the nickname the “Castle in the Rockies,” and has been a legendary getaway for more than 125 years. Here, executive chef Robert Ash matches the culinary standards of his restaurants to the awe-inspiring scenery that surrounds the resort. “Everything we do sets us apart,” says chef Ash. “Our in-house butchery program allows us to use every part of the animals,” he says. “We make our own sausages, cure our own meats, and grind all of our own meats for burgers, meatballs, and more. The fat is rendered and used for baking, mashed potatoes, and confit.”Photo by The Vermillion Room at Fairmont Banff Springs | Steak FritesIf this weren’t enough to convince you of their dedication to sustainability, he continues, “We make our own hot sauces and barrel-age them in used bourbon barrels from local producers. With vegetable and fruit scraps, we infuse and make our own vinegars used for salad dressings. Our bakery makes all the breads used on the property and leftover breads are used for bread crumbs, croutons, and bread puddings.”Then there’s the finished product. In the recently refurbished Vermillion Room, chef recommends the bouillabaisse. In Rundle Lounge, he favors the house-made chorizo-stuffed dates wrapped in bacon, and at Castello Ristorante, he urges you to try the fresh pasta dishes. No matter which of the hotel restaurants you choose to dine at, know that every ingredient has been thoughtfully procured. And with 11 establishments to choose from, you could sample cuisines from across the globe without ever leaving the premises. There’s even a food tour within the castle to help you do so.Photo by Rocky Mountaineer | Fairmont Chateau Lake LouiseFor traditional fine dining with an Alpine twist, take a scenic, 40-minute drive from Banff to Lake Louise, famous for its shimmering natural beauty. At Walliser Stube, located inside Fairmont Chateau Lake Louise, one could savor any number of German or Swiss dishes influenced by the local region. The real attraction, though––besides thrilling mountain views––is the Swiss fondue. Available in three versions: traditional, black truffle, or with roasted garlic and foraged morel mushrooms, this decadent experience is best enjoyed with an Alpine beer or a bottle from their extensive floor-to-ceiling wine library.While it seems the area is packed with fine-dining establishments, there is also a variety of low-key spots with equally high standards. Arrive hungry for breakfast at Tooloulou’s, because this local favorite is serious about its Louisiana roots, as evidenced by their expansive portion sizes of pancakes, waffles, French toast, grits, breakfast po’boys, or Cajun-style omelettes. For lunch, expect Creole menu standards like jambalaya, étouffée, gumbo, frog legs, alligator, and crawfish. Also, arrive early. Hungry patrons form a line out the door to get a taste of the unique Creole-Acadian-Canadian cuisine.Photo by Tooloulou’s | Tooloulou’s on Caribou Street in Banff, AlbertaBack in Jasper, Coco’s Cafe is a cornerstone of the community, with its fresh Phil & Sebastian coffee, roasted in nearby Calgary. Depending on the time of your visit, the menu features everything from oatmeal cinnamon waffles or warm breakfast couscous, to butter chicken naan sandwiches. The café is also proud to offer vegan, vegetarian, or celiac-friendly items. For something sweet, Bear’s Paw Bakery has mastered the art of the pastry (and is known for its sticky buns), appealing to both European visitors and neighborhood regulars.Photo by Rocky Mountaineer | The Bear’s Paw Bakery’s second location, The Other Paw Bakery Cafe, in Jasper, AlbertaAs far as getting there is concerned, the best, most luxurious way to see the Canadian Rockies is by train. On Rocky Mountaineer, catch breathtaking views of Western Canada’s most stunning natural terrain through large glass-dome windows as hosts regale you with tales from each passing town. On board, you’ll sip beer and wine from areas you pass through, snack on freshly made scones, and dine on gourmet meals prepared by award-winning chefs. In its GoldLeaf Service coaches, enjoy meals in an exclusive dining room on the main level of a bi-level dome coach. In SilverLeaf Service, sumptuous dishes are served at your seat.At the hands of chef Jean Pierre Guerin, who honed his culinary skills at five-star hotels and fine-dining establishments all over the world, and chef Frédéric Couton, who trained at Michelin-starred restaurants in Paris and Geneva, you’ll enjoy meals that hold culinary distinction in their own right, while feasting your eyes on the natural splendor of the Canadian Rockies. At breakfast, experience dishes like a Canadian cheddar soufflé or a “Sunrise Skillet,” featuring a baked egg, Canadian bacon, smoked sausages, and potatoes. At lunch, as you continue to soak up the picturesque journey, savor plates such as salmon with smoked sea salt and beef short ribs braised in a local British Columbia Merlot.Photo by Rocky Mountaineer | Breakfast in Rocky Mountaineer’s GoldLeaf Service dining room.No matter where you dine in the Canadian Rockies––in the resort town of Banff, the wilderness haven of Jasper, or the stunning oasis of Lake Louise––a few things are certain: The food is fresh, the views are remarkable, and the service is exemplary. With four different rail routes that travel between the cosmopolitan, West Coast foodie cities of Vancouver and Seattle, and iconic mountain destinations, there’s a world of adventure waiting and a wealth of restaurants to visit once you arrive with Rocky Mountaineer. The excitement, as well as the exceptional dining experiences, begin the moment you board the train. All you have to do is sit back, relax, and bring your appetite.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-24", "author": ["Condé Nast", "Rocky Mountaineer"]}