{"id": "fe60b18dcb73a035a14eafec576e7e1d", "url": "https://www.bonappetit.com/recipe/cranberry-linzer-tart", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Cranberry Linzer Tart Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueCranberry Linzer TartBy Claire SaffitzOctober 16, 20184.4(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintInside two layers of buttery, crumbly walnut crust hides a tart cranberry filling. This dough is too delicate to weave into a true lattice without breaking. Instead, arrange the strips in a crosshatch pattern, crossing over in a few places (it will look just as pretty).Ingredients10 servings Filling1lb. fresh (or frozen) cranberries1¼cups granulated sugar1Tbsp. finely grated peeled ginger1Tbsp. unsalted butterPinch of kosher salt1tsp. finely grated lemon zestDough and Assembly1½cups walnuts1cup granulated sugar2tsp. finely grated lemon zest1½tsp. ground cinnamon½tsp. kosher salt¼tsp. ground cloves¼tsp. freshly grated nutmeg¼tsp. baking powder2cups all-purpose flour, plus more for dusting14Tbsp. chilled unsalted butter, cut into pieces2large eggsPowdered sugar (for serving)Special EquipmentA 10\"-diameter fluted tart pan with removable bottomPreparationFillingStep 1Bring cranberries, sugar, ginger, butter, and salt to a boil in a large saucepan over medium-high heat, stirring often to prevent scorching and help dissolve sugar. Continue to cook, stirring often, until cranberries burst, mixture is syrupy, and pot is visible when a wooden spoon is dragged across the bottom (mixture should be reduced to about 1¾ cups), 10–12 minutes. Remove from heat and stir in lemon zest. Chill until cold, at least 1 hour.Step 2Do Ahead: Filling can be made 3 days ahead. Transfer to a nonreactive container; cover and chill.Dough and AssemblyStep 3Place a rack in middle of oven; preheat to 350°. Toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 10–12 minutes. Let cool.Step 4Pulse walnuts, granulated sugar, lemon zest, cinnamon, salt, cloves, nutmeg, baking powder, and 2 cups flour in a food processor until nuts are finely ground. Add butter and pulse until largest pieces are pea-size. Add 1 egg and process in long pulses until dough forms a ball around the blade. Divide dough in half. Wrap one half in plastic, flattening into a ½\"-thick disk. Press the remaining half into tart pan, working it across bottom and up sides with floured hands to create an even layer. Chill the dough in the pan and the wrapped dough until cold, at least 1 hour and up to 3 days.Step 5Scrape filling into crust and spread into an even layer.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 6Unwrap remaining dough and roll out on a lightly floured sheet of parchment paper, dusting with more flour as needed to prevent sticking, to a ⅛\"-thick round.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 7Cut dough into 8 strips.ChevronChevronStep 8Arrange strips over top of tart in a crosshatch pattern (this dough is delicate, so don’t fuss with strips too much once they’re on the tart). Pinch off excess dough and press strips into edges to adhere. Chill 15–20 minutes.ChevronChevronStep 9Beat remaining egg in a small bowl and brush over crust.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 10Bake tart until crust is golden brown around the edges and golden across surface and filling is bubbling, 45–55 minutes. Let cool.Step 11Just before serving, remove ring from pan and dust tart with powdered sugar.Step 12Do Ahead: Tart can be baked 1 day ahead. Store tightly wrapped at room temperature.How would you rate Cranberry Linzer Tart?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThis is really good! First time making anything like it. Would definitely make again - just altering the recipe slightly. I bake for 45 minutes at 350 as well. I used 1.5 bags of fresh cranberries to make one pound. Next time I would use at least both bags as I would like more filling. Also would keep a little more than half the dough as the bottom crust as that's a lot of dough for the top. I put the top dough in a big zip lock and rolled it out after I made it (then put it in the fridge). After adding the lattices to the top of the tarte I used the extra dough to add one more and an outer rim. I rolled that extra dough in a ball and rolled it out. It worked much better than the already rolled out straight from fridge dough so next time I'll keep the top dough in a ball in a zip lock in a ball and roll it out after I get it out of the fridge. Then I'll slice and add. Dough was never sticky (crumbly but not sticky).\nI refrigerated the dough and filling overnight.\nPerfect for Christmas!Andrea ElizabethBrooklyn, New York12/24/2021Yummy and so pretty!  I thought the ginger was a welcome change from orange in its pairing with the cranberries.  For the lattice, I rolled out the top between parchment after chilling and then gave it another good hard chill before slicing into strips.  I could then run a thin knife under the strips and transfer to to top of the tart.  That worked well!  I also sprinkled with coarse sparkly sugar on top of the eggwash, in place of powdered sugar.  Agree, some of the directions were a little imprecise, I also baked at 350.RobinOregon11/20/2020I followed the recipe to the letter, but I couldn't get the dough to roll out, it was way too sticky. I had to add extra flour to it and even then I couldn't cut it into strips, so I cut out stars with a cookie cutter and placed them over the filling. I like the filling a lot, and the dough itself does have a wonderfully crumbly, buttery texture and the walnuts add so much flavor. But I think I will be using this recipe to make actual linzer-style sandwich cookies instead of a tart. The dough just didn't cooperate for me with rolling out. Also it's not explicitly clear what temperature the oven needs to be at for baking the tart? I did 350 and the crust became a nice golden brown but the filling never really bubbled so maybe it needed to be 375?AnonymousOrange County12/2/2019I have made this twice so far with excellent results and lots of compliments.  I don’t have a tart pan so I used an 8” spring form pan and wanted a thicker filling so I increased the cranberries to 1 1/2 lbs, reduced the sugar to 3/4 cup, and added 1 peeled and grated apple.  Although the dough is a bit challenging to work with, the strips forgivingly melt together in the oven.  Thanks Claire! Cake LadyProvidence, RI11/24/2019Thumbs up from my Christmas guests! Made the filling and dough the day before. It was a tight fit in my food processor, but with care, made it work. Was surprised at the 10 servings, but glad I cut it that way, as it was quite rich. Filling is good and not too gingery as another review thought (that worried me, but I made it per the recipe). We all agreed other pies would be great with this crust. Made for nice breakfast the next day too!TXHuskerTexas12/29/2018The filling was delicious and excellent. However, this recipe, and the editing, was poorly written. The extra egg needed for the egg wash should not have been included in the original list for the dough and assembly. When people are making this recipe, they are probably quickly skimming when looking for how many eggs to put in. It would have been clearer to place one egg in another subheading for \"Egg Wash\" instead of including it all under \"Dough and Assembly.\" This is especially true when looking at the magazine edition of this issue. \nAlso, there could have been a clearer temperature for the actual baking of the tart because it was clear that the 350F was for the nuts, but not clear if it was also for the actual tart. \nOverall, the recipe is excellent and great and I would use again. However, recipe editing should be reviewed with a sharper eye for more intuitive recipes and instructions. c.xiaoDurham, NC 11/22/2018Delicious recipe!!! I just practiced making this for thanksgiving and it was incredible.  The dough is difficult to work with to create any kind of lattice but once you bake it the imperfections are not as obvious.  The flavors are incredible and worth the effort! AnonymousNew Jersey11/19/2018The crust on this is sooo good! I definitely want to reuse it with other fillings. To me, this filling left a little to be desired - it was very tart and a bit too much ginger. I also was wondering what temp this should be baked at - I assumed 350 since that was the only temp mentioned in the recipe at this time. Also, when you say \"remove ring from pan\" are you referring to just removing the tart? I reread like 5 times trying to figure out what \"the ring\" was haha. zizi jeanmaire11/14/2018This is truly delicious. The crust is tender and tastes like what a graham cracker would taste like if they were actually intended to be delectable. The filling is sharp and gingery, cutting the sweet richness of the crust. I added a bit of sea salt to the filling, which was a good addition. Anonymous10/28/2018Explore Bon AppétitTartDessertAustrianEuropeanCranberryBerryFruitCinnamonHerbs & SpicesGingerNutmegFallWinterBakingSimmerThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Claire Saffitz"]}