{"id": "fe6ff032092a0c16354898db2c335c51", "url": "https://www.bonappetit.com/story/troasted-broccoli-recipe", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "This Roasted Broccoli Recipe Indulges All My Food Obsessions | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Roasted Broccoli Recipe Indulges All My Food ObsessionsAll the miso. All the broccoli. All the hemp seeds. (So what if my food obsessions are healthy?)By Elaheh NozariJanuary 5, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.I was initially attracted to this recipe because it calls for so many things I love—maybe a little too much. I eat miso by the spoonful after long runs when my body is screaming for salt; I gained 10 pounds in college when I began a habit of stress-eating a particular brand of hempseed-packed granola; and my doctor literally told me to “cut back” on cruciferous vegetables like broccoli and cauliflower a few years ago (long story). Signing on to cook this roasted broccoli recipe was basically just an excuse to combine them all in moderation.I eat a lot of tofu, but I rarely cook with it because I’m never really sure how to—it seems so delicate! But this recipe made tofu approachable; I just had to tear it up, and you can’t really mess up when tearing things up with your bare hands. Roasting tofu is actually a lot easier than I’d thought it’d be: per this recipe, you just place it on a baking sheet with oil and spices, and then put it in a hot oven. Why did I think it was so complicated before?Despite my apprehension towards cooking tofu, I roast brussels sprouts almost daily, though this recipe forced me to approach one of my favorite side dish a little differently. Rather than roasting an entire Brussel sprout, I put only the outer leaves on the baking sheet, and saved the inner core to shred and serve raw. Serving the same vegetable two ways in one dish made me appreciate its complexity. Two combinations of flavor and texture—one charred and crispy like a chip, the other a little rough and bitter—who knew brussels sprouts had it in them?! And roasting them alongside broccoli gave me a double hit of my beloved brassicas.Aside from tearing up the tofu, the easiest part of this recipe was making the dressing. Instead of a standing blender, I used an immersion blender to purée everything, which worked fine for me as I don’t mind a coarse hemp seed here or there, but if you want a silky, smooth dressing, go with a stronger blender. I’m not just saying this, but the dressing was SO GOOD. It was equal parts nutty, umami-y, and citrusy. Luckily, I had enough left over to drizzle it on, uh, literally anything I ate for the next two days.Likely due to the hemp seeds and tofu, this salad was way more filling than I expected, but the fullness I felt after was the kind that comes from tons of vegetables and fiber, not a pint of ice cream. But, then again, everything in moderation—even brussels sprouts and broccoli.Get the recipe:Roasted Broccoli and Tofu with Creamy Miso DressingToasted sesame seeds can often be found in the Asian sections of some supermarkets, sometimes labeled Gomasio. If ever there was a time of year to keep a big jar of them on hand, pre-toasted and ready to go, this is it. They are the perfect crunchy topper for everything from salads to soups and roasted vegetables.View RecipeExplore Bon AppétitHealthyishRead MoreLifestyleThis Simple Turmeric Curry Tastes Like You Spent Hours at the StoveBy Carey PolisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-05", "author": ["Condé Nast", "Elaheh Nozari"]}