{"id": "fe8d9c2937114b6e44520bb10dfa947a", "url": "https://www.bonappetit.com/story/sexy-food-costumes-halloween", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "Sexy Food Costumes, Ranked By Sexiness | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSexy Food Costumes, Ranked By SexinessHappy Halloween! The only day a sexy cauliflower pizza might show up on your doorstep.By Alex BeggsOctober 31, 2019FacebookTwitterEmailIllustration by Johanna WalderdorffFacebookTwitterEmailHave you ever caught a glimpse of a pineapple from a certain angle and felt something? I mean in your private parts. Ever been turned on by a greasy, hot carton of spicy chicken nuggs? Is sexy food something we’re all thinking but not talking about? OBVIOUSLY. Because Halloween slinks around every year and we’re forced to face our deepest subconscious sexual desires: wanting to bang food. Pineapples, spiked seltzer, vegan hamburgers—nothing is safe from the horny manufacturers of rayon, landfill-bound sexy costumes. Since I’m happily admitting to this seasonal fetish, I’m going to take the liberty (sexy lady liberty costume right this way) of ranking a few food costumes by sexiness, on a scale from 1 [JUST FRIENDS] to 5 [DO ME NOW]. And we’re ranking costumes, not the nice models wearing them, who are equally sexy in the eyes of the lord.Photo Courtesy Tipsy Elves / John Morris PhotographySexy Pineapple, $45 on AmazonI can’t believe they muted the pineapple’s sexiest feature—those S&M spiky scales—and turned him into a minidress sweatshirt. Zippered, no less! (Everyone knows the sexiest fabric holder is a snap, like on tearaway pants.) This might make you sweat, but only because of the highly reactive polyester. In fact, I would keep that green topper away from any open flames, that’s a human tiki torch waiting to happen. This whole getup is way too flammable to get me going.Sexy ranking: 1Photo courtesy Yandy.comSexy Beyond Burger, $50 from YandyThe idea of sinking my teeth into some pea protein soaked in spices and canola oil—wheph!—talk about hot and bothered. What else is a bother? That “plant-based” head flag that pokes right into your cranium like a toothpick lobotomy. This is a veryyyy sexy costume, what with the saving-the-planet undertones and polka-dot sesame seeds and all, though I notice the “bun” sections seem disproportionate to the “yummiest artificial patty” part. Like any fake burger, there’s always going to be a little letdown.Sexy ranking: 3Photo courtesy Yandy.comSexy Cauliflower Pizza, $80 from YandyThe suggestive shape of those mushrooms, the devious winking tomatoes, the fact that the V of the pizza slice lines up with a V of one’s own, well, that’s sex with a capital S. Not to mention we’re not going to be bloated from pizza crust carbs, no sir, not with CAULI CRUST. Can’t roll over and claim a “pizza baby” is keeping you from getting it on tonight. (We will be gassy, though, but that’s never stopped me before.)Sexy rating: 4Courtesy HalloweenCostumes.comSexy Rosé Bottle, $45 from HalloweenCostumes.comThe font.Sexy rating: 1Courtesy HalloweenCostumes.comSexy Fried Egg, $25 from halloweencostumes.comSpit, spat, sputter! The sound of an egg frying in hot hot oil is as seductive as Marvin Gaye. Crispy edges, gushing yolk, fat flakes of salt and our more-than-friend pepper—get in my bed, fried egg! Not sure why this one is so shadowy-gray (old egg?), or if the leggings are supposed to imply a cast iron pan, but let’s not ask too many questions. It’s Halloween. Let sexy reign.Sexy rating: 4Explore Bon AppétitHalloweenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-31", "author": ["Condé Nast", "Alex Beggs"]}