{"id": "fe9897d963ea65fccdc11792503b26b2", "url": "https://www.bonappetit.com/story/rachel-khong-2020-resolutions", "year": 2020.0, "month": 7.0, "day": 3.0, "content": "Dear Future People | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureDear Future PeopleLast New Year’s Eve my friends and I wrote letters to ourselves that we’d open six months later. I resolved to write more, cook more, eat better. But I never could have predicted…this.By Rachel KhongJuly 16, 2020FacebookTwitterEmailIllustration by Subin YangFacebookTwitterEmailOn New Year’s Eve, with 2019 turning into 2020, my husband and I invited a small group of friends to our San Francisco apartment. It was only a few months ago, but if you’d said it was a lifetime, I’d believe it. Back then we shared snacks, hands hovered over the same platters of shrimp cocktail and deviled eggs. We blew those paper party blowers, curling and uncurling them into one another’s face, sometimes setting them down and losing track of whose were whose. We picked them back up and blew them anyway. Among friends it hadn’t mattered. We weren’t thinking about germs. We didn’t know yet to be thinking about germs.New Year’s Eve parties can be long, so we decided to count down the new year in different time zones. I assigned friends to surprise us with a food or activity for Eastern, Central, and Mountain time. At 9:00 we ate apple cake that Michael had baked (for the Big Apple). At 10:00 we marched a second line down my small hallway, playing kazoos and festooned in the Mardi Gras beads Aku and Shane brought (New Orleans). At 11:00 we sipped cannabis cider from Meng and Neel (in honor of Colorado and its legalized weed).When it became 2020 in our time zone, we played “Auld Lang Syne” on our kazoos. I brought out long hoarded stationery and stamps (Mister Rogers, Disney villains) so we could write letters to our future selves, earnest or otherwise. We sat on the living room floor to write them. I promised I’d send the letters in six months—in June. As his return address, my friend Daniel wrote: “2010s, SF, CA, USA, Earth.”Writing a letter to myself, I anticipated a quiet year. I was, embarrassingly, at a loss: unable to imagine how my life might look different because I didn’t have anything grand or spectacular planned. I wanted to finish the novel I’ve been working on for a while now (currently titled “New Thing—December 2016”). I resolved to use my gym membership—even the elaborate weight machines that intimidated me. I wanted to travel more, maybe to Hungary or Vietnam. And I wanted to cook and eat good food. The plan was to host dinner parties at our place one Sunday every month.Now I see what a failure of imagination that was. I expected that simply because I hadn’t planned big things, big things were unlikely to happen. We had fun that night; the time had felt precious, singular. But none of us could have known that the simple act of gathering would become a thing to be missed. What we could have used, actually, was a letter from the future.I didn’t know that only a few months later I’d miss picking up an avocado, squeezing it, putting it down, picking up another avocado, squeezing that one, and then deciding on the first one I touched. I’d miss forgetting something from my grocery list, then heading back to the store to get only that. I’d miss bulk bins. I’d miss picnics and dinner parties and restaurants. I’d miss sitting too close to friends at a dive bar, yelling to be heard.At the time of this writing it’s been nearly two months of sheltering in place. It’s early May and I’m still in possession of my friends’ letters, waiting to send them in June. Writing this essay is an endeavor almost as absurd as writing a letter to oneself before a history-shifting pandemic. Because Bon Appétit is a print magazine, you’ll be reading this in August. (Or in the case of the digital version, late July.) So basically I’m writing another letter to another future self, one who knows more than I do now, and certainly more than the person I was on January 1. When what I could really use is you telling me how things are panning out. (Do we have a vaccine, August people? Is yeast still weirdly hard to find?)Does life return to normal, reader of the future? Perhaps a bigger question is this: Was normal even good?In these uncertain times, when the only certainty seems to be the overuse of “in these uncertain times,” the fact that we have to cook, then eat, has been a dependably unchanging solace—or an inconvenient necessity, depending on the day. Since mid-March I’ve swung between two distinct poles when it comes to food. There are the meals I blissfully cook over hours—chili pan mee with hand-cut noodles; hamburgers with buns I baked; idli fermented for days—and then, on the other end of the spectrum, there are all the cans of sardines I’ve eaten over the sink and more PB&Js than I can possibly quantify.Better represented than either extreme are all the meals in between: meals to use up limp celery, to finish the last of a box of a certain pasta shape, to polish off the half-cans of coconut milk. It’s this in-between cooking that, on the best days, has felt like a bulwark against chaos. Trying to use every grocery and pantry item can be as satisfying as finishing a puzzle. Making stock from a bag of saved vegetable odds and ends. Turning old brittle rice into far more compelling fried rice by cooking it with ancient kimchi—and learning that no kimchi is too old for this purpose! Here I’ve finally achieved what I’ve always aspired to: not wasting food. In a recent past life, I might have completely forgotten a bunch of cilantro and rediscovered it weeks later, in its new form: putrid brown slime. If I have cilantro these days, I think about it constantly, making a plan for every stem.And it’s folly, of course, but I’m wondering what will stick. I wonder if, like people who lived through wartimes or the Great Depression, we’ll cook and behave differently after all this is a distant memory. I wonder if I’ll never throw away a bone before making stock from it. I wonder if I’ll never toss those infuriating tiny slivers of garlic you sometimes get in a head, painstakingly peeling each one instead, just in case I run out. I wonder if I’ll always adapt the recipe to what I have rather than go all the way back to the store for one missing ingredient. I wonder if I’ll stay vigilant about the very back of my refrigerator and keep eating expired condiments because actually, usually, they’re totally fine. (Confession: I kind of like old ketchup. Darker, danker, umami-rich.)Does life return to normal, reader of the future? Perhaps a bigger question is this: Was normal even good? Or was normal actually complacency and negligence? Can our new habits—the good ones, I mean—become permanent? I don’t want to go back to being the person who consumes blithely and lets cilantro rot.If I could tell my past self anything from the future, it would be that taking care trumps making plans and resolutions. The phrase “in these uncertain times” is redundant because every time is uncertain. We only delude ourselves, myopically, into believing it isn’t. I want to tell future me that even if things haven’t gone back to how they were, maybe that’s not such a bad thing. Moving forward, maybe we can behave differently for the better—with more care. Maybe we’ll recognize our time with friends as the precious thing it’s always been. Maybe we’ll be more grateful for the farmers who grew our food and for the hands that brought it to us. Maybe we’ll work toward equity, distributing food and other resources more fairly. That’s my hope for myself, at least—present and future selves included.Rachel Khong is the author of the novel Goodbye, Vitamin.Explore Bon AppétitFirst PersonCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-16", "author": ["Condé Nast", "Rachel Khong"]}