{"id": "fec2da6eeab753212007fd9aa293a966", "url": "https://www.bonappetit.com/story/vitamin-c-salad", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "This Vitamin C Salad Is Better Than Any Expensive Juice Shot | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Vitamin C Salad Is Better Than a Juice Shot and Cheaper TooThe goal was to pack as much Vitamin C as possible into this seasonal salad, but it happens to taste amazing too.By Andy BaraghaniMarch 7, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Andy Baraghani, Prop Styling by Emily EisenFacebookTwitterEmailThis story is part of the Healthyish Guide to Feeling Better Already, a collection of recipes, remedies, and distractions to get you back on your feet.When I set out to develop this simple Vitamin C salad, I wanted to come up with a dish that was exactly what the name suggested. It needed to pack a ton of Vitamin C, and it had to be something that you could make really easily, whether you’re sick, on the verge, or just feeling normal and in need of a health boost.There are so many leafy greens and other vegetables that provide Vitamin C, but I didn’t go that route because nobody wants to turn on the stove or cook anything when they’re feeling sick. Instead, I went full-on citrus and packed in some fruits that I love that don’t get enough attention. The main ingredients are mango, kiwis, and various citrus. They all pack a lot of Vitamin C, and they’re all in season right now. Just take your fruit, peel it, and cut it however you want. Irregular pieces are totally great. It doesn’t matter! You’re going to eat it! Just get it into pieces you can chew.You know those intense, $18 juice shots? That’s basically what this dressing is. I use store-bought carrot juice—if you want to make your own, that's great, but you don’t need to—a little bit of turmeric, some lime juice, and a lot of grated ginger. This is a high-energy, cold-busting dressing. The carrot juice adds even more Vitamin C plus Vitamin A, and it also lends a sweetness and creamy velvetiness that I just love. It’s not thick, but it definitely has a richness to it and it coats the fruit, which I like. And it goes well with a drizzle of olive oil.To dress the salad, spoon half the carrot dressing into a shallow bowl and arrange the citrus, mango, and kiwis on top. Add on the remaining dressing, then top with a drizzle of olive oil, sea salt, and red pepper flakes if you crave a little spice. This Vitamin C salad is so juicy, intense, zingy, and gingery—if this doesn’t make you feel better, I don’t know what will.Boost your immune systemVitamin C Superfruit SaladFeeling under the weather? This superfruit salad will give you the perfect jolt of vitamins you need to get back on the path of recovery.View RecipeExplore Bon AppétitHealthyishVitamin CCitrusCarrotGingerGet WellRead MoreLifestyleThe Healthyish Guide to Feeling Better AlreadyGallery13 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "Andy Baraghani"]}