{"id": "fed2e2755f0c4463f8579a781ffc004a", "url": "https://www.bonappetit.com/story/elevate-your-culinary-game-with-netflix-bon-appetit-and-williams-sonoma", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Elevate Your Culinary Game with Netflix, Bon Appétit, and Williams Sonoma | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredElevate Your Culinary Game with Netflix, Bon Appétit, and Williams SonomaBy NETFLIX and Williams SonomaNovember 7, 2018FacebookTwitterEmailFacebookTwitterEmailOnly one chef wins The Final Table, a new global culinary competition series from Netflix. But there will be another winner elevating cuisine to international heights thanks to Williams Sonoma, Bon Appétit, and Netflix. Perhaps it will be you?Inspired by his experience hosting The Final Table—where 12 pairs of chefs from around the world put their talent to work on national dishes for celebrities, food critics, and culinary legends—acclaimed food writer and Bon Appétit Editor-at-Large Andrew Knowlton has selected 16 of his favorite items from Williams Sonoma.Enter to win them all here:www.williams-sonoma.com/finaltablegiveawayWatch The Final Table, November 20th Only on Netflix.For more mouth-watering content follow @BonAppetitMag, @WilliamsSonoma and for more of The Final Table follow @Don'tWatchHungryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-08", "author": ["Condé Nast", "Williams Sonoma"]}