{"id": "fed42d50595e4d9ec9e6cb85c4bb41b7", "url": "https://www.bonappetit.com/story/singapore-hawker-culture-unesco", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Singapore's Hawker Centers Were on the Brink of Disappearing. Then the Government and the U.N. Stepped In. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eatSingapore's Hawker Centers Were on the Brink of Disappearing. Then the Government and the U.N. Stepped In.Thanks to UNESCO and the country's own programming, roti prata and noodle hawkers are enshrined as \"intangible\" cultural icons.By Sonia ChopraJuly 7, 2021FacebookTwitterEmailPhoto by Christopher WiseFacebookTwitterEmailAt the counter of the roti prata stall, I watch as a hawker smashes, folds, and turns stretchy dough into flatbread. Working quickly, he flips the roti prata, golden brown and flaky soft, onto a plate and hands it to me with hot curry for dipping. Another hawker “pulls” me a cup of teh tarik, pouring a stream of milky black tea between two vessels until frothy, which I sip as I walk by lines for stalls selling prawn noodles, mutton biryani, and curry puffs.This is Tekka Market & Food Centre in Singapore, one of the country’s most well-known hawker centers, or food markets that are “vibrant communal spaces where Singaporeans from all walks of life gather to dine and bond,” says Yeo Kirk Siang of the country’s National Heritage Board (NHB). There are over 110 centers across the island—and they’re vital to its identity.In the 1800s, Singapore, a port city and trading center, drew immigrants from around Asia. Some, mostly laborers, turned to street hawking. They roved the island to sell dishes from their homelands, finding a way to provide for their families and to feed an increasingly international community. In the 1960s the government began to regulate hawking, moving these entrepreneurs to food stalls in designated areas, often near housing developments, and hawker culture flourished. “When you walk into a hawker center, you can find stalls selling Chinese, Malay, Indian, and many other diverse types of dishes from different immigrant groups who settled in Singapore,” Siang says. “Over time they evolved to become distinctive local dishes that we love and formed an important part of our food heritage.”Prawn noodles from Alexandra Village Food Centre\nPhoto by Faris MustafaBut running a stall is taxing, requiring long hours and physically demanding work, and the profit margins are low. With globalization offering more options for Singapore’s young workforce and a generation of stall owners nearing retirement, there have been concerns that hawker centers are at risk of disappearing.So the government took action by creating programs to encourage newer generations to continue the craft via mentorship and grants and to help veteran hawkers with succession planning and purchasing automated equipment like steamers and meat mincers. And on a global level, Singapore underwent the multiyear process to nominate its hawker culture for inscription (or inclusion) on the UNESCO Representative List of the Intangible Cultural Heritage of Humanity.Yes, the U.N. is known for naming places such as Machu Picchu in Peru or the Acropolis in Greece to its World Heritage List. But it also recognizes “intangible” heritage, the ways of life that make up a culture. The goal of the list, established in 2008, is to protect and raise awareness for these parts of cultural heritage, communities, and identities. The process for getting an “element” on the list is involved, including a detailed application that must demonstrate cultural value, consent of the communities that create and maintain the element, and proof that communities will promote and safeguard it. When I visited Singapore in late 2019, the NHB was more than halfway through the two-year process of getting hawker culture onto UNESCO’s list.Cendol, crushed ice with red beans and “green worms” (pandan rice flour jellies), at Alexandra Village Food Centre\nPhoto by Faris MustafaMore than 20 food-related elements have been added since 2010, when foodways made it onto the list for the first time with the addition of the “gastronomic meal of the French,” “traditional Mexican cuisine,” and the beautifully intricate gingerbread craft of northern Croatia (yes, gingerbread!). They’ve since been joined by shrimp fishing on horseback (Belgium, 2013), kimchi making (South Korea, 2013; North Korea, 2015), and dolma making (Azerbaijan, 2017). Last year, the culinary arts of couscous (a collaboration between Algeria, Tunisia, Morocco, and Mauritania) and ftira, a flattened sourdough bread (Malta), were both added to the list along with Singapore’s hawker culture.It was no surprise to Singaporeans that hawker culture got UNESCO recognition. Siang tells me that when the NHB conducted polls and focus groups in early 2018, “food heritage” was the top-voted marker of intangible cultural heritage, specifically noting hawker culture. Now amid travel bans and domestic lockdowns due to COVID-19, local diners have used social media campaigns and community efforts like “group buys,” where neighbors place orders from one hawker center together, to support stalls.“It has always been a source of pride for Singaporeans,” Siang says. “And the subsequent inscription has helped spark more conversations on the role that they play to safeguard hawker culture.\"Explore Bon AppétitRestaurantsTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-07", "author": ["Condé Nast", "Sonia Chopra"]}