{"id": "fed64414a973ef8283aebeddbf632f74", "url": "https://www.bonappetit.com/recipe/creamy-ish-of-mushroom-soup", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Creamy-ish of Mushroom Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCreamy-ish of Mushroom SoupBy Chris MoroccoMarch 16, 20204.3(206)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintOkay, we waited until now to mention that this creamy, earthy, silky rich soup is vegan. Puréeing some of the mushrooms along with cashews adds body that doesn’t compromise on flavor.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonDutch Oven$80 At AmazonSlotted Spoon$13 $10 At AmazonSmall Saucepan$155 At AmazonHeatproof Measuring Cup$18 At AmazonIngredients4 servingsSoup¼cup extra-virgin olive oil12oz. mixed mushrooms (such as crimini, shiitake, oyster, and/or maitake), cut or torn into bite-size pieces1large sweet onion, finely chopped2shallots, finely choppedKosher salt4garlic cloves, thinly sliced⅓cup dry white wine¼cup raw cashews1Tbsp. red or white misoFreshly ground black pepperGarlicky Oil and Assembly3Tbsp. extra-virgin olive oil3garlic cloves, thinly sliced1Tbsp. thyme leaves½tsp. freshly cracked black pepperKosher saltPreparationSoupStep 1Heat oil in a large Dutch oven or other heavy pot over medium-high. Arrange mushrooms in a single layer and cook, undisturbed, until browned underneath, about 3 minutes. Stir and continue to cook, tossing occasionally, until golden brown all over, 5–7 minutes longer. Using a slotted spoon, transfer mushrooms to a plate, leaving oil behind.Step 2Add onion and shallots to pot; season with salt. Cook, stirring often and reducing heat as needed if beginning to brown, until very soft, 8–10 minutes. Add garlic and continue to cook, stirring occasionally, until softened and fragrant, about 3 minutes. Add wine and cook until almost completely evaporated, about 1 minute. Add 5 cups water and return mushrooms to pot. Bring to a simmer.Step 3Transfer 2 cups soup (including some mushrooms) to a blender and add cashews and miso. Purée until very smooth. Stir back into soup. Simmer, stirring occasionally, until flavors have melded, 10–15 minutes. Season with salt and pepper.Garlicky Oil and AssemblyStep 4Bring oil, garlic, thyme, and pepper to a simmer in a small saucepan over medium heat. Simmer gently until garlic is tender and just turning golden around the edges, about 3 minutes. Season with salt.Step 5To serve, ladle soup into bowls and drizzle with garlicky oil.How would you rate Creamy-ish of Mushroom Soup?Leave a ReviewTell us what you thinkReviews (98)Back to TopTriangleThere are no instructions about adding the miso. Haven’t made this yet and haven’t found miso yet either. AnonymousHouston2/24/2022Along with some of the very helpful tips, I tweaked with truffle oil, truffle salt, and topped with fried shallots. \nBeth C. Los Angeles2/23/2022This recipe is fantastic! I did add 1/2 a tablespoon of apple cider vinegar after combining the blended portion with what was in the pot. I felt like it needed something but other than that, this was a huge hit! Grace H.Savannah, GA2/22/2022This recipe is amazing! I too subbed half the water with vegetable broth, and used a little less liquid than called for. Other than that, followed recipe exactly and it is easy to execute while tasting quite sophisticated. Served with a kale caesar salad and would have been delicious with some crusty sourdough bread.  Thank you BA for this stroke of genius.KristinaWoodside, CA2/3/2022This was AMAZING! My whole family enjoyed it. I made it two days in a row! I used vegetable broth instead of water. Cobi LemkeLong Beach, California 1/26/2022This soup is delicious! The cashews make it very creamy,  you do not miss dairy at all. I have made this twice,  both times used stock (chicken or veggie) \ninstead of water which I think is key to adding flavor.    The garlic oil is also very good.  I spooned it without the garlic and it's still flavorful.  Highly recommend it. AnonymousDenver 1/26/2022Absolutely delicious!  It was so good, I forgot to make the garlicky oil.  I will be making it again immediately.Em BeeNova Scotia1/9/2022It’s great, although mushrooms should be salted. Anonymous12/13/2021It is indeed well worth the time to truly brown the mushrooms. Though I am nowhere close to being vegan this is certainly one of my favorite winter soups.KathleenNew Mexico, USA11/12/2021This is soooo divine! Thank you! I was a bit worried when I noticed the recipe didn’t call for bouillon (and I didn’t have any on hand), but it doesn’t need it. \nOne question: do you add the garlic in the garlic oil to the soup? I strained it, and it certainly doesn’t lack in flavour!Sam10/31/2021agree with other reviewers in that ,as is, the recipe lacks a flavor punch.... next time I make it I'll use veggie stock and take more time to carefully individually brown the mushrooms the medley. AnonymousDC10/21/2021Loved this so much! I didn’t have shallots, and used cooking wine instead of regular wine. Cashews made it so deliciously creamy. What a treat to have a nice rich cream of mush soup as a vegan!AnonymousOntario10/4/2021Wow did my variation of this soup come out delicious. I had a hard time browning my mushrooms so they looked ugly and I didn’t have wine so I deviated a bit from the directions. I also used more mushrooms than called for with shiitake as the primary type. I used vegetable stock rather than water and added miso for flavor since I was missing the wine. I also blended almost all the mushrooms, onions, and scallions - stirring them back into the leftover broth. Last I stirred in cashew cream left over from my other recipes instead of using the cashews called out in the recipe and blending it. This was one of the very best soups I have ever had and it was vegan. From taste to texture it was as good as I would get in the most upscale restaurant. It had an earthy and rich taste while preserving a light not dense taste and feel, and it had a velvety texture. Incredible! Paris Eden Los Angeles, California 9/17/2021So tasty! Especially on the second day. I needed soem bread for it to make a full dinner and for scraping out the bowl (wouldn't want any of that shroomy deliciousness go to waste), but otherwise followed the recipe exactly and was rewarded <3 thank you ChrisLeaGermany9/8/2021\n good!! I used Better than Bouillon mushroom stock and a mix of cremini, white button and portobello mushrooms. I’m not super familiar with miso and have not loved miso soup in the past but I added it and I only have good things to report. My craving for mushroom soup has been deliciously satisfied and I’m definitely keeping this recipe for future rotation. Thanks! :) Kirstin Whistler, Canada 9/3/2021Explore Bon AppétitSoupSoups and StewsAmericanMushroomVegetableCashewNutGarlicWinterStarterVeganVegetarianDairy-FreeHealthyishSimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-16", "author": ["Condé Nast", "Chris Morocco"]}