{"id": "fedb35834f4f7445a1a9e00028934ddf", "url": "https://www.bonappetit.com/story/what-is-cacao", "year": 2018.0, "month": 3.0, "day": 5.0, "content": "What Is Cacao, And How Does it Relate to Chocolate? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Is Cacao, And How Does it Relate to Chocolate?And what's a nib, anyway?By Aliza AbarbanelMarch 29, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Emily EisenFacebookTwitterEmailThis story is part of the Healthyish Pantry, a collection of articles breaking down the ingredients we love most. Click here to read the whole guide—then stock up.The mythos of cacao runs deep—its scientific name is Theobroma cacao, Greek for \"food of the gods.” A staple of wellness-centric pantries and all-day-cafe chia puddings, cacao beans have a storied history as currency, medicine, and, more recently, as a low-octane party drug. But what's the difference between cacao and chocolate—and what's a nib, anyway?Okay, what is cacao?The cacao tree is native to tropical regions in Central and South America, and its fruit was consumed by pre-Columbian cultures like the Mayans over 4,000 years ago. \"Cacao\" originates from the Olmec word \"ka-ka-w,\" and Aztec ruler Moctezuma II famously enjoyed drinking a frothy, bitter beverage made from ground cacao seeds called xocōlātl. Today, 70% of cacao is grown in West Africa. Cacao plants have two edible parts: the seeds (also called beans) and the fruit. If you've ever eaten chocolate, you've eaten cacao seeds. They're fermented, ground into a paste, sweetened, and sometimes flavored to create everything from Hershey's chocolate bars to Guittard's gourmet chocolate wafers. Cacao fruit isn't as ubiquitous in the U.S., but is blended into beverages in Ecuador, and slowly making its way stateside as well.Why we love it:Cacao is a true superfood, containing more antioxidants than blueberries, in addition to a good amount of iron, calcium, and magnesium. Cacao is also the reason dark chocolate is considered to have health benefits—it's a notable source of flavonoids, which may have beneficial effects on cardiovascular health, and theobromine, a bitter alkaloid similar to caffeine thought to boost moods and energy.Some of the many cacao products on the market\nHow to buy itThe cacao-curious can choose from a wide range of products, from extract tinctures and fruit juice to powder and chocolate bars. Cacao nibs are crumbled, raw cacao beans. Imagine eating a 100% dark chocolate bar: That's what cacao nibs taste like. They're dense and crunchy, with fruity notes and a strong bitter aftertaste similar to espresso beans. Cacao powder is made from a dried paste of pressed cacao nibs, which concentrates that dark chocolate flavor even further. While they sound similar, the difference between cacao powder and cocoa powder is more than a few swapped vowels. Cacao powder is made by cold-pressing raw cacao beans, while cocoa powder is made from beans that have been roasted when processed. The difference is fairly minimal from a flavor perspective, and cacao powder can be substituted with a 1:1 ratio for cocoa powder. Cacao butter (a.k.a. cocoa butter) is made by cold-pressing oil from the cacao bean, creating a smooth and stable fat that, like coconut butter, melts at room temperature. It is commonly used to make chocolate, and is also a popular natural moisturizer.Cacao powder and nibs are the most accessible and versatile types of cacao. Both can be found online and at most health food stores. We like Navitas cacao nibs, which are organic, fair trade, and relatively easy to find.How to cook with cacaoWhen it comes to cooking, cacao nibs are wonderfully versatile. Blend them into smoothies for added texture, steep and blend with coconut milk for a next-level latte, or scatter them onto your morning bowl of oatmeal. Cacao nibs are also a wonderful addition to savory dishes—use them to top a long-braised stew for additional depth of flavor. Used with a light hand, cacao balances big, savory flavors beautifully—and nourishes your body at the same time.3 cacao recipes we love:Cacao and Coconut LatteFor a more caramel-y depth of flavor, toast the coconut flakes first.View RecipeCocoa-Nut Energy BitesChoose dates that are soft and pliable—even if that means pitting them yourself.View RecipeChocolate Coconut Date BarsView RecipeExplore Bon AppétitHealthyishChocolateCacao NibRead MoreLifestyleWhat Is Matcha, the Powder Turning the World Green?By Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-29", "author": ["Condé Nast", "Aliza Abarbanel"]}