{"id": "fedd94d85274fb70db8125f8ae19b25b", "url": "https://www.bonappetit.com/recipe/grilled-chicken-and-quinoa-with-matcha-dressing", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Grilled Chicken and Quinoa with Matcha Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueGrilled Chicken and Quinoa with Matcha DressingBy Michaela SklovenJanuary 8, 20194.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe dressing on this bowl is a green goddess 2.0, with matcha adding an earthy undertone to the whole dish. Ceremonial is the highest grade of matcha and is made for drinking from the youngest tea leaves. Culinary matcha is still high-quality but has a more robust flavor, allowing it to shine through when combined with other ingredients. This recipe is from Michaela Skloven of Homegrown.Ingredients4 servings Quinoa and Chicken½cup quinoa2large skinless, boneless chicken breasts (about 18 oz.)2Tbsp. extra-virgin olive oilFreshly ground black pepperDressing and Assembly1cup vegan or regular mayonnaise2Tbsp. fresh lime juice2tsp. culinary-grade matcha1½tsp. Dijon mustard½tsp. agave nectar2garlic cloves1½tsp. kosher salt, plus more½cup basil leaves¼cup parsley leaves with tender stems12cups baby greens (such as kale, spinach, and/or arugula)2cups cherry tomatoes, halved4Persian cucumbers, cut into 1\" pieces (about 2 cups)2avocado, cut into ¾\" pieces1⅓cups crumbled fetaPreparationQuinoa and ChickenStep 1Bring a small pot of water to a boil. Add quinoa, return to a boil, and cook until tender, 15–20 minutes. Drain, return quinoa to warm pot, and fluff with a fork to release some of the steam. Season with salt; cover to keep warm until ready to serve.Step 2Meanwhile, prepare a grill for medium-high heat. (Or heat a cast-iron grill pan or medium skillet over medium-high.) Rub chicken on all sides with oil and season with salt and pepper. Grill (or sear) chicken, turning halfway through, until just cooked through, 12–15 minutes. Transfer chicken to a cutting board and let rest 5 minutes, then cut into ½\" pieces.Dressing and AssemblyStep 3Purée mayonnaise, lime juice, matcha, mustard, agave, garlic, and 1½ tsp. salt in a food processor until smooth. Add basil and parsley and pulse until incorporated.Step 4Toss quinoa, chicken, greens, tomatoes, and cucumbers in a large bowl to combine. Add ½ cup dressing and toss to coat; season with salt.Step 5Divide salad among bowls and top with avocado and feta. Serve remaining dressing alongside.How would you rate Grilled Chicken and Quinoa with Matcha Dressing?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis was good, healthy and simple. My only revision is the amount of salt in the dressing. I poured out 1 1/2 tsp into a bowl and realized that it would be way too much so I used half of it. It was still really salty, and I normally love salt. AnonymousIndianapolis2/11/2019Explore Bon AppétitSaladChicken BreastChickenPoultryQuinoaRice & GrainsMatchaOther IngredientsLeafy GreensVegetableQuickWeeknight MealsMainGluten-FreeGrillingLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Michaela Skloven"]}