{"id": "feebc51d0d2147fa060df110732a2ced", "url": "https://www.bonappetit.com/story/curried-tofu-collard-wraps", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Lettuce Wraps with Curried Tofu  Are My Summer Work Lunch Staple | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Curried Tofu Collard Wraps Are My Summer AnthemThey're a quick and crowd-pleasing hit I’ll make on repeat with no shame.By Aliza AbarbanelJuly 12, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailI have an admittedly unscientific hypothesis: Food tastes best eaten with your hands. No offense to flatware, but scooping up food with my fingers grounds me in the experience of eating like nothing else can. Plus, it’s just fun. So, when Bon Appetit’s August issue dropped a quartet of lettuce wrap recipes, I knew they would be the DIY dinner gracing my table all summer long. In particular, these collard green wraps with curried tofu have already become my food equivalent of \"I Like It\"—the irrefutable song of the summer.I’m not a vegetarian, but I love tofu. Not everyone agrees with me, mainly because tofu can taste like chewing on a wet (but clean!) sock. Still, it’s anything but boring when simmered in Thai red curry paste, creamy coconut milk, and plenty of aromatics. These collard wraps double down on flavor with plenty of scallions and tender-stemmed cilantro, and don’t forget about those addictively crunchy coconut chips. We’re especially partial to Dang Original, which snap easily and hit high on the sweet-salty matrix—the ultimate tool for judging all food on its snackability. Wrapped in sturdy collard greens, they’re virtuous enough to make you feel like a verified wellness influencer.This recipe has very little actual “cooking,” so start off by preparing all your veggies. Halve washed collard greens lengthwise, remove the ribs and stems, then cover and chill until ready to serve. Next, scallions. Thinly slice the dark green tops diagonally to create a pretty garnish, then slice remaining white and pale green parts crosswise and place in a small bowl with microplaned garlic and ginger. It’s time to cook, so keep that scallion mixture close.Heat coconut oil in a large skillet over medium high, then cook the scallion mixture, stirring, for a minute until just beginning to brown. Add Thai red curry paste and cook, stirring, for another minute. Finally, add your crumbled tofu and coconut milk, season with salt, and bring to a simmer. Let the pan hang out on medium-low, gently simmering, until the sauce is almost completely evaporated—you should be able to see the bottom of the skillet. Stir in your lime juice, and transfer the tofu to a platter.With wraps like these, it’s all in the presentation. Store-bought curry pastes come in varying degrees of spiciness (even if their labels all say the same thing) so if your tofu isn't as spicy as you hoped, amp up the heat by sprinkling a thinly sliced chile on top of the tofu. BA food editors love to use Fresno chiles for their extremely manageable medium heat and beautiful red coloring, but I often struggle to find them at my neighborhood market. If you also need a substitute, try a jalape˜no and brace for a little extra kick. Next, arrange the collard greens, cilantro, and scallions around the tofu so each component is visible and easily accessible. Place the coconut chips in a small bowl and arrange lime wedges on a small plate, and dinner is served.I like to build my own wrap first to subtly show everyone how it’s done. I lay out a big collard leaf and tuck inside a few  tofu crumbles, a tangle of herbs, and a generous sprinkle of those coconut chips. Then, I squeeze a lime wedge over the whole wrap and pop it straight in my mouth. It’s crunchy, fiery, and undeniably refreshing. Of course, after I made this recipe once, I couldn’t stop thinking of other things to stuff inside. Try adding thinly sliced cucumber, pickled carrots, sliced avocado, kimchi, or halved cherry tomatoes to keep things interesting.I can't leave you without mentioning: Wraps are fun to serve at dinner parties, but they also make for a great lunch. My packed lunch game has flagged since summer arrived and roasting off big batches of veggies for grain bowls lost its appeal, but these lettuce wraps have revived me. I suggest packing all the ingredients separately and assembling at your desk for maximum freshness. The way I see it, more packed lunches = more money left over for my true summer passion: trying every ice cream shop in my neighborhood. Now that’s some math I can get behind.Okay, let's wrap it up:Curried Tofu WrapsIf the cooked tofu isn’t as hot as you’d hoped, amp it up by tucking a slice or two of Fresno chile into your wrap.View RecipeExplore Bon AppétitHealthyishLettuceCollard GreensTofuVegetarianVeganCoconutCurryRead MorecookingA Saucy, Crispy Tofu Recipe for People Who THINK They Hate the StuffBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-12", "author": ["Condé Nast", "Aliza Abarbanel"]}