{"id": "feec4fceec794cdfa9cd2f69ccdcb83a", "url": "https://www.bonappetit.com/recipe/pork-volcanes-al-pastor", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Pork Volcánes al Pastor Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssuePork Volcánes al PastorBy Rick MartinezFebruary 11, 20205.0(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrint“In northern Mexico, this taco is called a vampiro because the crunchy fried tortilla looks like a vampire bat wing,” says Rick Martinez. “Down south, it’s volcán—maybe since they see more volcanoes than bats! Either way, juicy pork al pastor and oozy quesillo are a brilliant combo.” Thinly slicing the pork and cooking it with plenty of marinade still clinging in a hot skillet yields the charred edges and deep flavor of traditional spit-roasted pastor.IngredientsMakes 812-lb. piece skinless, boneless pork shoulder (Boston butt)7guajillo chiles, seeds removed3morita chiles, seeds removed4garlic cloves⅓cup fresh orange juice¼cup fresh lime juice3Tbsp. achiote (annatto) paste1Tbsp. Diamond Crystal or 1½ tsp. Morton kosher salt86\"-diameter corn tortillas4Tbsp. extra-virgin olive oil12oz. quesillo (Oaxaca cheese), coarsely gratedIngredient InfoAchiote paste can be found at Latin markets and online.PreparationStep 1Place pork shoulder on a parchment-lined rimmed baking sheet and freeze, uncovered, until almost completely frozen, about 2 hours. Using a very sharp knife, thinly slice pork (shoot for about ⅛\" thick). Transfer to a large bowl.Step 2Meanwhile, bring guajillo and morita chiles and 1 cup water to a boil in a medium saucepan. Cover, remove from heat, and let sit 30 minutes to allow chiles to soften.Step 3Transfer chiles and soaking liquid to a blender. Add garlic, orange juice, lime juice, achiote paste, and salt; purée until smooth. Pour over pork and toss to coat. Cover and let sit at room temperature 2 hours, or chill up to 6 hours.Step 4Place a rack in middle of oven; preheat to 350°. Evenly space out tortillas on a baking sheet and bake until lightly toasted and very crisp (edges will curl and pucker), 35–45 minutes.Step 5Heat 1 Tbsp. oil in a large nonstick skillet over high until smoking. Spread about one-fourth of pork across skillet in a single layer; cook, undisturbed, until browned underneath, about 2 minutes. Turn over and cook, undisturbed, until browned underneath and cooked through, about 2 minutes. Transfer to a platter and wipe out skillet. Working in 3 batches, repeat process with remaining pork and 3 Tbsp. oil.Step 6Increase oven temperature to 500°. Divide pork among tostadas and top with quesillo; bake until cheese is melted, 8–10 minutes. Top with onion and cilantro and serve with lime wedges.How would you rate Pork Volcánes al Pastor?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleThese are AMAZING! 100% worth making. I agree with the other posts regarding the tortillas - ours got way too crispy when we did them for the recommended temp and time but other than that made as written. Will definitely add this one to the recipe book. Lauren DanemanTampa, FL3/16/2022Nothing to do with the recipe itself, but there is a huge error in it that makes me cringe. According to Spanish orthography rules, the singular word volcán has an accent mark. The plural world, volcanes, does not.Fernando GonzalezMexico City, Mexico11/13/2021Amazingly good! I followed the recommendations from previous posts. I pan seared the tortillas then put them on the sheet pan. Topped with the pork and cheese and then baked in a 450 degree oven until the cheese melted. Topped with the onion and pickled jalapeno. Drizzled with street taco sauce and sour cream. So good! Wished we had some avocado and the lime juice (ran out of limes).  Will plan better next time. Definitely a keeper!!Kathy TreanorChesapeake VA10/29/2021I assume the chiles are dried and not fresh, right?arobertsVirginia8/24/2020These tacos are SO incredible. You’ll want to make them all the time after you get the process down (and it is a little bit of a process... But more than worth it). We’ve found that lightly frying the tortillas rather than baking them makes a more cohesive taco. Baking them at that temp for length of time made them much too crunchy and difficult to eat. These are FIRE though, definitely worth taking on. You’ll have all your friends wanting to come over for taco Tuesday every Tuesday. Octopus1Asheville, NC6/29/2020Absolutely Delicious. Another bon appetit A+ recipe.\n\nI will say though that when cooking the pork on high the marinade started to burn quickly so I took it to medium and had a bit more luck. Maybe it comes down to the thinness of your pork or the heat of your oven but regardless be wary as it could slow you down.\n\nMake these tacos. They are satisfying and extremely flavorful!nick ruffaloArizona5/8/2020can't wait to make this! i couldn't find morita chiles, what else can you suggest? Anonymouscharleston, sc3/19/2020These are really good! The marinade and preparation is a process, but worth it.\nOne note from my experience at the very end - 500 for 8-10 mins is too high. After about 5 mins, it was edging into burnt territory. The next batch at a ore moderate temperature 450, watching closely, had better results.AnonymousSacramento, CA3/2/2020Explore Bon AppétitTacoMexicanLatin AmericanPork ShoulderPorkMeatChileVegetableCheeseGuajillo ChileMainGluten-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Rick Martinez"]}