{"id": "fef92721f77e397ee2c64bae0223f832", "url": "https://www.bonappetit.com/recipe/sweet-and-saucy-pork-chops", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Sweet-and-Saucy Pork Chops Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueSweet-and-Saucy Pork ChopsBy Chris MoroccoAugust 13, 20194.7(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintFor weeknight-friendly pork chops that cook in record time but are still succulent, we turn to an unexpected ingredient: sugar. A pinch sprinkled over the surface helps the chops caramelize and develop a golden-brown crust before the meat has a chance to dry out. For max juiciness, we finish cooking them in a buttery-tangy pan sauce that then gets spooned over every slice.Ingredients2 servings21\"-thick bone-in pork rib chops (look for the most marbled ones you can find, preferably with some fat cap too)Kosher salt1½tsp. sugar, divided2Tbsp. extra-virgin olive oil, divided1large shallot, chopped4garlic cloves, thinly sliced¼cup red wine vinegar3sprigs rosemary1Tbsp. drained capers2Tbsp. unsalted butter, cut into piecesPreparationStep 1Season pork chops with salt and sprinkle evenly with ½ tsp. sugar. Heat 1 Tbsp. oil in a large skillet over medium-high. Cook chops, undisturbed, until well browned underneath, about 3 minutes. Turn and cook just until second side is lightly browned, about 1 minute. Transfer chops to a plate (they won’t be fully cooked); reduce heat to medium.Step 2Pour remaining 1 Tbsp. oil into same skillet and add shallot and garlic. Cook, stirring often, until softened and just beginning to brown, about 3 minutes.Step 3Add vinegar and remaining 1 tsp. sugar to skillet. Cook, swirling pan occasionally, until vinegar is nearly evaporated, about 2 minutes.Step 4Add rosemary, capers, and ½ cup water to skillet; season with salt. Reduce heat as needed to maintain a very low simmer. Add butter and swirl pan continuously (and vigorously) until sauce becomes smooth, glossy, and emulsified.Step 5Return pork chops to skillet, arranging darker side up. Simmer gently in sauce, swirling occasionally, until chops are cooked through, about 3 minutes (a thermometer inserted near the bones should register 135°).Step 6Transfer pork chops to plates and spoon sauce over.How would you rate Sweet-and-Saucy Pork Chops?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleI took the recommendation of other people and made this with 75% red wine + 25% balsamic vinegar and it turned out great. I think 100% red wine vinegar definitely would have been too acidic. I served with served broccoli and the meal was fantastic!Hilary WSt. Paul, MN12/17/2021So good!!! I put sautéed mushrooms in the sauce when the pork chops were done. Highly recommend JulesWashington state9/14/2021This is a great recipe! It always takes longer to cook the chops but other than that we follow it religiously and it comes out perfectly. Again, fabulous recipe!\nMari K-CGrand Rapids, MI8/2/2021This is the second time I made this recipe and I love it. It's very versatile. This time around, I didn't have red wine vinegar, so I substituted half dry red wine and half apple cider vinegar. I didn't have shallots, so I substituted one small onion. The dish still turned out delicious and beautiful. I served it with mashed potatoes, which were a perfect complement to the acidity of the sauce. The only change I would suggest is doubling the ingredients for the sauce. By the time the sauce reduces, you're not left with enough for 2 large pork chops. Carey S.Houston, TX7/16/2021Well, it really looks good on paper but in real life, meh.  Sauce was good. Chops were bland. Lot of trouble for nothing.  I'll have to keep looking for a good pork chop recipe.Jackson BrowneAugusta, GA5/9/2021I loved the flavor of the rosemary in the sauce, though it was a little watery. My sauce didn't emulsify. Love that you use just one pan and a plate. My chops were thicker than 1\" so I put them in the oven for a few minutes while making the sauce. Next time I'll add mushrooms to the sauce as suggested by another reviewer and I may add some cornstarch to thicken up the sauce or may use less than 1/2 c. water. Served on roughly mashed garlic potatoes with broccolini.Hilo GirlSan Francisco, CA3/19/2021These were very good, but maybe my stovetop is underpowered, but it took way longer than 3 minutes for my 1” pork chops to reach 135F; in fact my sauce started to break.  I had to pull them out and cook them on a sheet pan at 400F for 10 minutes for them to be safe to eat.  Next time I’ll simply plan on cooking them in the oven after browning them, with them rejoining the sauce only in the last few minutes.   Other than that, it’s a solid recipe.  NightfallBaltimore, MD2/12/2021Excellent dish. I added mushrooms to the mix and it worked perfectly.EHNew York1/3/2021This turned out wonderfully. I only had boneless, center cut pork chops, but they were thick, so they still worked well with the recipe. The seasoning was absolutely perfect. Between the salt on the pork chops and the salt in the capers, no additional salt was needed.  I only made 2 small changes - I used schmaltz instead of olive oil and chicken stock instead of water.  The sauce was beautifully thick and luscious, and next time, I'll serve it with a crusty French bread to sop up the remaining sauce. This recipe will be part of my regular rotation from now on.AnonymousHouston, TX7/10/2020Can’t wait to make this.  Am in a lock-down situation, so no fresh rosemary. Will try  about two tsps. Dried.  Hope it won’t ruin the flavour balance.\n\nSandi k, Montreal sandikramerMontreal,Canada5/10/2020Is that 1/2 tsp of salt per chop?  Or for bothKaren BrashearsChicago 2/27/2020This is my new favorite recipe! I’ve made it at least 10 times since it was published in September. Bravo!! AnonymousCold Spring, NY12/11/2019Great pork chop recipe. Although, the flavorful sauce could be used on anything. Minimal prep and speedy cooktime, make this a winner!AnonymousLouisville KY11/22/2019So delicious and so easy! And a major plus is everything is done in one pan so prep and clean up in my tiny kitchen was a breeze. It’s a keeper 👍AnonymousChicago10/27/2019My old stove shot craps and this was the maiden voyage on my new one. Not a bad choice! My husband said this was stellar. Chops I could get were thicker so I simmered them for about ten minutes longer. Perfect. And the sauce was sublime. I wish I could attach a photo... mine looked just like cover.KccookingbugKansas City, Missouri9/29/2019Explore Bon AppétitPork ChopPorkMeatQuickEasyOne-Pot MealsWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Chris Morocco"]}