{"id": "ff03ffeb7ef9ff50505b131ff8b67f20", "url": "https://www.bonappetit.com/story/maggi", "year": 2021.0, "month": 12.0, "day": 4.0, "content": "Maggi Seasoning Is The Ultimate Liquid Flavor Enhancer  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Backbone of All My Favorite Mexican Dishes? It’s MaggiComplex and loaded with umami, this potent liquid seasoning is beloved around the world.By Sylvio MartinsDecember 23, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah Morton.  Prop styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what food people are eating, drinking, and buying right now. Next up, Sylvio Martins makes the case for Maggi Seasoning.When I was growing up, our family road trips from Phoenix to Tijuana often ended at the same taqueria for some much needed quesatacos. As I’d wait for my dinner, I’d keep my teenage appetite at bay with the restaurant’s complimentary starter: charred chiles güeros drenched in lime juice and a thin, salty sauce. The dressing was just bold enough to dull the peppers’ heat and had a rich, almost meaty flavor that I couldn’t pinpoint. Years later, after I found my love for cooking and began asking relatives for Mexican recipes, I came to discover that the mysterious condiment tossed all over those charred chiles was, in fact, the secret ingredient in so many of my favorite dishes. It was none other than Maggi.Photograph by Isa Zapata.  Prop Styling by Paige HicksJugo Maggi Seasoning Sauce$12 at Amazon (for 2)$1 at Walmart (for 1)Describing Maggi can be tricky without drawing comparisons to other condiments. It’s similar to soy sauce in both appearance and consistency but differs slightly in flavor. It can also be likened to Worcestershire sauce, but it doesn’t quite carry that same faint sweetness. It’s uniquely Maggi, with a smoky and somewhat roasted flavor reminiscent of grilled onions or the charred bits of a steak. “Maggi is a staple in every Mexican kitchen condiment cabinet, and it was always in my house,” says Octavio Olivas, chef-owner of L.A.’s Ceviche Project. “I taste a little bit of soy, a little bit of salt, and smokiness. It’s super complex, and it has its own flavor. I think of it as an umami bomb that I use for multiple things, like marinating steak, enhancing salsas, and, of course, micheladas.”But much to my surprise, Maggi isn’t a Mexican product—or at least it wasn’t initially. The brand was founded in Switzerland in the late 19th century and marketed to the busy working class as a nutritious ready-to-use food product like pea- and bean-based flours and instant soups. It released its liquid seasoning, Maggi Würze, in 1886. Made from fermented wheat and packed with glutamic acid (an amino acid from which MSG is derived), this dark-colored sauce delivers an umami saltiness reminiscent of Marmite. Its ability to instantly, almost miraculously, heighten the flavors of foods with just a few drops has made it a trusted and beloved addition to kitchen pantries worldwide. Globally, you’ll find country-specific varieties of Maggi that differ slightly in flavor, including a Filipino version with strong notes of garlic, the original Swiss-German recipe with a complex vegetable taste, and, of course, the Mexican formula that’s noticeably sharper and more concentrated than its nuanced relatives.Maggi tastes wonderful when dashed on top of velvety eggs, mixed into stir-fries, or splashed into sauces for added depth of flavor. Both noodle and rice dishes happily welcome Maggi’s rich saltiness, as do marinades and seafood dishes like Mexican aguachile or Baja-style ceviche. Or, similar to the chiles güeros I enjoyed as a kid, Maggi seasoning can transform the simplest of dishes like roasted vegetables into something much more complex. To me Maggi tastes like late-night taquerias, but you’ll surely hear a diversity of answers, depending on where you are in the world.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-23", "author": ["Condé Nast", "Sylvio Martins"]}