{"id": "ff0a4803a7e25d60dc1f20c1ca54a332", "url": "https://www.bonappetit.com/story/how-to-make-meatballs-better", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "How to Make Meatballs That Are Tender, Juicy, and Delicious Every Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Meatballs That Are Tender, Juicy, and Delicious Every TimeThese five tips will make your meatballs better, no matter what kind you're making.By Alex DelanyOctober 24, 2018FacebookTwitterEmailPHOTO BY CHELSIE CRAIG, FOOD STYLING BY ANNA BILLINGSKOGFacebookTwitterEmailWhether you’re a Sunday Sauce obsessive or the kind of person who keeps sheet-pan meatballs in weekly rotation, there is a universal truth that cannot be ignored: Meatballs are a gift. When meatballs are good, they’re the shining example of what ground meat products can be—crispy and juicy and just the right size to tackle in a couple bites. But when they’re dry, well...we don’t really want to talk about that. It seems disrespectful to the good ones.What we do want is to make sure you never end up making bad meatballs. We want your meatballs to be at the top of their game until the end of time. So we’ve rounded up a little cheat sheet of meatball tips for you to pull out at your convenience. You don’t even need to say thanks. We do this in the general interest of global meatball excellence. We do it because we care. Here’s what you need to know:80/20 Is the Golden RatioWe’re not talking about some kind of business deal here. We’re talking about the fat content of your meat. If you want to walk away with 100% profit, you should use ground meat that’s at least 20% fat. A higher fat content ensures that your meatballs stay juicy. If you’ve ever had a sad, dry meatball, a lean fat content is most likely one of the reasons why.Don’t Over-Mix the MeatAnother meatball-related pitfall? Over-mixing. The more you mix ground meat with seasonings, the tougher, springier, and more compact the finished product will be—we want loose and tender, not tight and sausage-like. Mixing raw ground meat with your hands is an entirely unique feeling, and whether you enjoy it or despise it, you shouldn’t do it for that long. Once your added ingredients seem to be evenly incorporated, stop!Did We Say Added Ingredients?Yes, we did say added ingredients. A meatball made of just meat would definitely be fine, but adding some kind of texture and variety to your meatball makes the whole eating process much more enjoyable. A bit of toasty-ness and crunch from some chopped roasted nuts or some sweetness and chew from bits of dried fruit are exactly what we like to see. Even better? Throw in both. Also: herbs. Herbs are always welcome to the party.Yeah, you could also go the old-school Italian route.\nA Tester Patty Is Never a Bad IdeaYou can’t eat a scoop of raw meat to see if it’s properly seasoned. We would certainly not advise that. So to make sure you’ve added enough kosher salt to the mix, pinch off a little piece of your meatball mixture, form it into a patty, and crisp it in a hot pan. It will cook quickly, and you’ll be able to give it a taste before you form all those meatballs. If it’s tasting right, send the whole batch in. A little under-seasoned? Add a pinch or two more salt.And Then You Cook ThemBut how? There are different methods for getting those meatballs cooked through, and each is meant for a particular set of circumstances. If you have hours to kill on a Sunday afternoon, browning your meatballs and then braising them in tomato sauce is a noteworthy option. The end result will be ground meat that falls apart easily and absorbs a bunch of flavor from the sauce it’s simmering in.But most of the time, we don’t have three hours. And if it’s a Tuesday night, we definitely don’t. Here, we have two options: Searing meatballs in a skillet or roasting them in the oven. Both methods will give you a brown, crispy exterior, and juicy interior (if you’re using that 80/20 ground meat). But the skillet is better for smaller batches of meatballs with a more aggressive browning, and the oven is great for knocking out a large batch in a short time. It really comes down to how many meatballs you want to make, and how immediate your hunger is.It doesn’t matter how you keep these tips handy. Print out this list. Copy and paste them into your Notes app. Get them tattooed on your arm. You can do whatever you want, as long as you promise us to provide the world with better meatballs. Be the change you wish to see. Live it.Oh, look at that. Some meatballs.Crispy Sheet-Pan Meatballs With Salsa VerdeThe quickest, most fuss-free and delicious meatball recipe that ever was or will be.View RecipeExplore Bon AppétitBasicallyBeefGround BeefMeatballRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-24", "author": ["Condé Nast", "Alex Delany"]}