{"id": "ff0dfd5302a36cdd47947ab348e84ac8", "url": "https://www.bonappetit.com/story/dessert-person-pecan-oat-cookies", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Claire Saffitz’s Pecan Brittle Cookie Is the Best Cookie I’ve Ever Made | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAm I Allowed to Pick the Year’s Best Holiday Cookie Yet?This cookie is: crispy, chewy, filled with little brittle bits, caramelly from brown butter, and GIGANTIC.By Alex BeggsDecember 4, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.“Is it even legal,” I asked my sister, a lawyer, “for any cookie to be better than a chocolate chip cookie?”“LOL. No. It is the perfect cookie,” she replied in a 17-page brief that points to several cases of “cookie precedence.”Okay. But if you could wrap your head around the POSSIBILITY that there is a better cookie out there, I’d point to the Oat and Pecan Brittle Cookies in Claire Saffitz’s cookbook, Dessert Person. (Full disclosure: I am Claire’s former coworker and I adore her. But I’ve made a lot of cookies in my day—including three others from her book—but none that blew my boots off quite like these.)The name doesn’t quite do it justice. You have a cookie the size of a toddler’s face. It’s gorgeously textured from undulating waves of butter that spread in the heat of the oven. That would be brown butter, by the way, which makes it taste caramelized and fancy bakery expensive. But what brought me to my knees is the fact that you make pecan brittle, then blitz up SOME of it with the cookie dough’s dry ingredients while leaving SOME in small broken chunks for the final dough mixture. The final cookie is crispy-edged, thin, and chewy-centered from the oatmeal, with tiny crispy pecan brittle bits throughout.I prefer it to all other cookies. It’s the best cookie I’ve ever made. I feel as confident with this hyperbolic declaration as any I’ve ever made. I feel it strongly! And urgently! You need to make this cookie!To confirm that it’s the best cookie, I shared my cookies, which wasn’t easy, with family and neighbors. “This is an amazing cookie,” they all (basically) said. I’m rounding that up to “best.”I even asked the creator herself. “It’s not just you!” said Claire, who has some of the cookie dough in her freezer right now. “When I was developing this cookie, I wondered exactly the same thing myself, It really IS the best, right?” Her theory: “I think it’s that combination of a chewy center and lacy edge, plus the mix of butterscotchy-ness plus oaty-ness plus toasty pecans. Plus, it’s SALTY. It’s just the total cookie package.” I love Claire’s confidence in her own cookies.Why are the cookies so HUGE? I asked. “I tend to make scooped cookies like this large because it affords the cookies the ability to achieve every texture possible, from a crisp, deeply caramelized edge to a soft, barely set center and everything in between. The larger the cookie, the more variation between the edge and the center and the more delicious it is to eat.”Don’t sleep on this one…\nIn Dessert Person, Claire writes you can substitute in Heath toffee bits. Do NOT listen to her. Heath bits are great, but making pecan brittle “will definitely contribute to a superior outcome,” Claire says. You cannot top the flavor and the shard-awesome texture of homemade brittle. Go to the trouble—which isn’t too much trouble, I swear—of making the pecan brittle. I thought I had messed up mine, made the brittle too thick, but it turned out perfect in the end because you chop it up anyway.Then the cookie dough MUST rest overnight. It’s cruel! After all the work you put in so far! But let the cookies be complicated. They make you wait, and they taste that much better for it. By chilling the dough in the fridge, Claire says “the dough ‘cures,’ during which the sugar further dissolves, contributing to a chewier texture. The rest also allows the flour to fully hydrate and the fat to solidify, so you get the most pleasing spread and wrinkly surface during baking. It’s science-y, and I wish I could speak of it on a more technical level, but I know empirically that it improves basically every kind of cookie.”She put a lot of thought into cookies. That’s why Claire is Claire. And also why you need to make these as instructed in the recipe. Spend a ton of time making these. Share them with your friends and neighbors and mail carriers. Yes, 2020 is the WORST. Let these cookies be the best.Get the recipe:Oat and Pecan Brittle CookiesA gorgeously textured cookie with crispy-edges, a chewy center, toasty pecans, and tiny crispy pecan brittle bits throughout.View RecipeDessert Person$16 at Amazon$32 at BookshopExplore Bon AppétitHoliday CookiesCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-04", "author": ["Condé Nast", "Alex Beggs"]}