{"id": "ff30524fe1091d48a23fc11fbfe7dd9f", "url": "https://www.bonappetit.com/recipe/french-toast-waffles", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "French Toast Waffles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFrench Toast WafflesBy Grant MeltonJune 20, 20212.7(100)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Micah MortonEmailPinterestPrintEmailPinterestPrintCooking French toast in a waffle iron, instead of on the stovetop, creates a supremely crisp toast that’s studded with waffle-like wells. It’s served with an irresistible combination of butter and maple syrup, which is vigorously whisked together like a salad dressing to create a luscious, caramelly sauce perfect for filling all those nooks and crannies. To give the French toast some sturdiness, the bread is dried out overnight like you’re making a stuffing. The staleness makes the bread extra absorbent so it’s custardy, not soggy, once cooked. Any waffle iron will work. It doesn’t matter whether it’s round, square, thin, or a thick Belgian-style one. The size of the waffle iron may affect how many you can cook at one time, so allow extra time for a smaller iron.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronPresto FlipSide Belgian Waffle Maker$55 At AmazonSmall Saucepan$155 At AmazonWhisk$10 At AmazonWire Rack$23 At BA MarketChef's Knife$34.53 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketLarge Bowl$18 At AmazonSmall Bowl$13 At AmazonMedium Bowl$17 At AmazonIngredients4 servingsWaffles6¾\"-thick slices Texas toast, Pullman, or other white sandwich bread6large eggs½cup heavy cream¼cup sugar1tsp. vanilla extract½tsp. ground cinnamon¼tsp. freshly grated nutmeg½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt2Tbsp. unsalted butterToppings and Assembly½cup plus 2 Tbsp. pure maple syrup¼tsp. kosher salt½cup (1 stick) unsalted butter½cup heavy creamChopped pecans or fresh berries (for serving; optional)PreparationWafflesStep 1Cut six ¾\"-thick slices Texas toast, Pullman, or other white sandwich bread in half on a diagonal. Place on a wire rack set inside a rimmed baking sheet and let sit at least 3 hours and up to 12 hours to dry out. (Alternatively, if you are in a time crunch, bake in a 275° oven until bread is dry to the touch but has not taken on any color, about 30 minutes.)Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Preheat oven to 275°. Whisk 6 large eggs, ½ cup heavy cream, ¼ cup sugar, 1 tsp. vanilla extract, ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, ½ tsp. ground cinnamon, and ¼ tsp. freshly grated nutmeg in a large bowl to combine. Remove rack with bread from baking sheet and pour in egg mixture. Arrange bread in baking sheet and let soak 5 minutes. Turn bread over and let soak until most of the liquid is absorbed, about 5 minutes.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Heat a waffle iron on medium-low. Melt 2 Tbsp. unsalted butter in a small microwave-safe bowl in a microwave on medium power, in 20-second intervals (or in the smallest saucepan you’ve got over medium heat). Using a pastry brush or balled-up paper towel, brush waffle iron lightly with butter. Add 2 pieces of soaked bread (4 if your iron will allow), close, and cook until steam dissipates and waffles are golden brown, about 4 minutes. Open iron and transfer waffles to a clean rimmed baking sheet; keep warm in the oven while you cook the remaining waffles.Toppings and AssemblyStep 4Combine ½ cup pure maple syrup and ¼ tsp. kosher salt in a small heatproof bowl. Melt ½ cup (1 stick) unsalted butter in the same small microwave-safe bowl in a microwave on medium power, in 20-second intervals (or in a small saucepan over medium heat). Gradually pour butter into syrup, whisking constantly until completely incorporated. If mixture does not come together or is too thick (it should look like a light, thin caramel sauce), warm slightly by placing bowl on the warm waffle iron or briefly in the oven, then whisk again.Step 5Whisk ½ cup heavy cream and remaining 2 Tbsp. pure maple syrup in a medium bowl until soft peaks form, about 2 minutes.Step 6To serve, divide waffles among plates and drizzle some maple butter over. Top with a dollop of whipped maple cream and chopped pecans or fresh berries (if using).Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronHow would you rate French Toast Waffles?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleSooooooo good. Adam S.Los Angeles 10/4/2021Personally, I feel Bon Appetit has lost its way since Adam left.  The magazine as well as the recipes are just not up to your standards and I could not be more disappointed.  I have been a subscriber for 40 years, loves diversity and change, but your magazine is not worth reading at the moment.  \nOh and btw, where are the podcasts????\nYou really need to fix this!!!!!!\n\nKaren Boca Grande, Florida 7/9/2021For everyone wondering about the reviews, you can submit a star rating WITHOUT typing a written review. No one is hiding the reviews, these people are simply not sharing why they rated this recipe so low.AnonymousIN7/7/2021Like the other commenters, I'd like to know why this recipe was rated so low on the scale.  I intend to try the recipe to form my own opinion, but having made a lot of waffles over the years, my guess is these sandwich waffles are quite a bit heavier than those made with waffle batter.  I cannot imagine the sandwich bread taste is as light as the sandwich bread nor as sweet as some waffle batters. Really though, the recipe is what it is- nobody claimed it was airy light sandwich bread waffles. It did give me an idea though- -sandwich bread grilled cheese waffles sound pretty good with some tomato basil soup!Joe's RibMemphis, Tennessee7/7/2021How in the hect does this recipe make it into \"Your 10 Favorite Recipes of June 2021\" and have a 2 star rating average from 71 reviews that no one can read,  Come on Bon Appetite, not leaving a good taste in my mouth. \nConfused in the KitchenRVA7/1/2021I need to know if I should make the effort to heating up the waffle iron instead of just a pan. The missing reviews are telling me stick to the pan. LaurenWashington6/30/2021Would love to read the reviews and see why this recipe was rated so low. I'm intrigued by the french toast in waffle iron plan! CLCDENVER6/28/2021I also can’t read the reviews. Do they get hidden when a recipe receives a low rating? AnonymousMiami, Florida 6/25/2021Why can I not read the reviews? Anonymous6/23/2021Explore Bon AppétitWaffleAmericanEggVanillaHerbs & SpicesCinnamonVegetarianBreakfastBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-20", "author": ["Condé Nast", "Grant Melton"]}