{"id": "ff36ac08afcb33857cbc7dafd674a7f7", "url": "https://www.bonappetit.com/story/mandy-moore", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Mandy Moore on the Gluten She Does Eat and the Snack That Got Her Up Kilimanjaro | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMandy Moore on the Gluten She Does Eat and the Snack That Got Her Up KilimanjaroShe's climbed one of the tallest mountains in the world but is still figuring out that whole cooking thing.By David WaltersJuly 19, 2018FacebookTwitterEmailFacebookTwitterEmailLet’s get this out of the way: Mandy Moore does own a Crock-Pot, but unlike you she did not throw it out the window after the popular slow cooker became television’s unlikeliest villain on the second season of Moore’s hit TV show This Is Us. But since summer in SoCal isn’t what you’d call ideal chicken chili weather, Moore is perfectly happy to seek her no-fuss meals elsewhere. Here, she talks with David Walters about her low-key farmers’ market strategy, her go-to set snack, and the meals she’s planning to cook in her new dream kitchen.What's the simplest thing that you cook?MM: A piece of salmon from the farmers’ market, a little bit of olive oil, salt and pepper, put it in a pan—the minimum amount of work. I prefer sockeye if possible, but I’ll do a big piece of king salmon too. I’m not picky, but quality is important.What's your M.O. at the farmers market? What are you looking for there?MM: It depends on what I wanna cook for the week, or just at least have on hand. It's usually kind of fruit heavy, and we're just getting into cherry season, so that's always exciting. We live in California, so there's always gonna be avocados and stuff like that. I haven't gone in a couple weeks, but last time I went I got a bunch of flowers because I was having friends over.I, like other people, have experienced major kitchen envy looking at your kitchen. What do you like best about it?MM: I think the light in the kitchen is my favorite. For me, the kitchen and the family room are always going to be a really drawing point of a home. There are clear delineations between the kitchen and the living room, obviously, but they kind of flow right into each other, and I love that that invites conversation and socialization in the house. We have this beautiful marble waterfall kitchen island, and we have stools on one end. I was really adamant about there not being a sink or not making it feel like a traditional prep space. It feels like a place to gather and hang. The thing that makes me smile the most is the open shelving. It's one thing that I'd always wanted.So, have you cooked anything in the kitchen that's been sort of memorable because it is the new kitchen?MM: Oh my gosh, no, not yet. We've been in the house for about two months but we've been doing a fair bit of traveling so I don't feel like we've had a ton of time in the house yet. We're on our way to the grocery store now! That was a big thing for us moving into this home together. We're really excited about entering this next chapter of our lives, and learning how to really cook and not rely on take-out and going out to eat so much. That's gonna be our next big adventure: Not being so frightened and intimidated by the kitchen.What's on your grocery list today?MM: We’re gonna make something easy, so I think we’re gonna start with chicken tacos. You know, we live in California. So we're gonna go and buy some sort of coconut-almond flour tortilla situation, and buy some chicken to marinate, and buy all the makings for salsa, and avocados, and all of that. Then we’re gonna get into a little bit of baking. I have that silly gluten intolerance, so I'm gonna make us some grain-free chocolate chip cookies, and then I'm gonna learn how to make some grain-free bread.I know you have the gluten intolerance, but you can still eat a burger, right?MM: You know, If something's really worth it, I'll stomach the tummy ache for it. Sometimes there's bread you just can't say no to.What kind of bread is that?MM: A big homemade loaf of bread—the simpler and the less the ingredients, the better. I just went away and had my girls weekend up in  Big Sur, and Big Sur Bakery is obviously known for all of their baked goods. We all dove in and devoured their homemade seeded sourdough. Normally something like that would hurt my stomach but I was totally fine, and I think it's because it was like, four ingredients. I think it's the quality and the way that the wheat is processed.What's your favorite breakfast, simple or otherwise?MM: I'm a big smoothie fan. I love going to the farmers market and figuring out \"what's my trajectory?\" I get a bunch of berries, a bunch of apples, a bunch of spinach, and avocado, and I make sure I have my fair share of greens to balance everything out in my smoothie. I love getting fresh produce and then freezing it. You don't have to worry about ice, you just throw your frozen fresh veggies in the blender, then you throw your almond milk and your protein powder and all that good stuff in there and you're ready to go.You're obviously very busy: The Darkest Minds is coming out and This is Us, which I love, but what are you eating on set on any given day?MM:  I think the older I've gotten, the less tempted I am by the craft service people. It's fun sometimes for the quick fix and every now and then, when I'm exhausted and need like a sugar plunge, and that's when the candy will satisfy you, but for the most part, I keep my trailer stocked with nuts. I love salmon jerky.What kind of salmon jerky do you recommend?MM: I love that brand Epic, I love all their stuff. I keep a kettle in my trailer so I can heat up some of their bone broth, but I especially love their salmon jerky. In fact, we just climbed Mount Kilimanjaro, and that was my go-to snack on the mountain, and I got everybody in our whole crew sort of addicted to it as wellYou just climbed Kilimanjaro?MM: Yeah.Mandy, that's a pretty amazing thing just to slip casually in conversation. That's awesome. You're like \"No big deal!\"MM: Yeah! No big deal, but I did have my salmon jerky on the mountain, and it was a life saver.Explore Bon AppétitHealthyishInterviewsRead MorecultureNatalie Portman’s Food Philosophies Mostly Involve Vegan Ice CreamBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-19", "author": ["Condé Nast", "David Walters"]}