{"id": "ff39901b8f518e0d9ac1e1e987ce9a55", "url": "https://www.bonappetit.com/story/kelvin-harrison-jr", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "Kelvin Harrison Jr. Is Ready to Go Inward | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleKelvin Harrison Jr. Is Ready to Go InwardThe star of Waves and The High Note is building his self-care toolbox By Martine ThompsonAugust 12, 2020FacebookTwitterEmailPhoto by Sami DrasinFacebookTwitterEmailIn Here We Are, artist Martine Thompson explores what it means to care for oneself in a world that doesn’t make it so easy. Get familiar with her through her curated playlist, Nice 2 Meet You. First up, a conversation with actor Kelvin Harrison Jr.These days Kelvin Harrison Jr. is focused on the things that nourish him—creative projects that foster growth, connections that welcome his authentic self, and crafting a self-care routine, which includes journaling and attending therapy—that help him continue evolving into the best version of himself. I’ve been curious about the New Orleans–raised actor ever since watching him shape-shift in different roles: the Muslim teen love interest Tahir in Nijla Mu’min’s coming-of-age story Jinn; a former Eritrean child soldier plopped into white suburbia via adoption with a whole lot brewing beneath the surface in Luce; the popular athlete drowning in expectations of Black excellence and toxic masculinity in Waves; and most recently, a charming aspiring musician who flexes his singing chops on smooth Rodney Jerkins–assisted tracks in The High Note (streaming Aug. 11).Kelvin’s work is fueled by a desire to help push the culture forward through art that sparks meaningful dialogues, and that works in service of building a freer, less-oppressive world. The next stage of his career is on the horizon: Catch him next in season 2 of HBO’s Euphoria and as Fred Hampton in Aaron Sorkin’s upcoming The Trial of the Chicago 7.Below, I chat with Kelvin about playing an adult with a healthy sense of self in The High Note, the trauma that often accompanies growing up as one of the only Black children in the room, and what he’s been cooking up during quarantine.Hi Kelvin! How are you holding up in quarantine?Kelvin: I’m good. Ya know, ups and downs, but mostly good. I’m just taking it day by day. I just finished my workout and that’s always nice. My trainer’s back this week. He took a week off and I was, like, shaming him for taking time off. Like, you’ve left me alone.Let’s get into your latest film project, The High Note. You finally got to play a grown man with this character David, a budding musician. And he seemed to be in a way better emotional state than a lot of your past characters, like Luce, or Tyler in Waves. How was playing that role?Kelvin: It was refreshing. I keep saying this, but after I did Waves I was exhausted. It did take an emotional and mental toll on me. When we do these jobs, sometimes we open up a lot of ourselves and put it on the table, but then you have to unpack that. You can do it through a character within the realm of that safe space, but then there’s this residue of emotions that you kind of have to figure out in order to get back to your normal life. So I started going to therapy and stuff like that. I was looking for a fun movie that was uplifting and full of joy, and about happy, healthy love, and people that were in their worth, and trying to find their confidence and actively pursuing a balanced lifestyle. I think that made doing this movie so much more fun. Working on [The High Note’s] set brought me a lot of joy last summer.What have your 20s been like so far? I feel like a huge part of this time involves learning how to treat yourself better, and beginning to understand the meaning of self-love and the work, especially the healing work, that goes into it.Kelvin: It’s been a lot of reprogramming of what I thought I knew and who I thought I was supposed to be, and trying to get to a place where I’m really content with all of the things I’ve worked towards. And understanding that I’ve been actively doing the work of trying to find my most authentic self and inviting people into my space who complement that. I think it’s just standing in that space instead of trying to run away from it or trying to run past it. I think I did a lot of that for a long time, saying, If I pretend I’m there, then maybe I’ll get there faster. But now I’m like, what’s the rush? I’ve been comfortable with the day to day.What’s something 26-year-old Kelvin has in his self-care toolbox that 18-year-old Kelvin definitely didn’t?Kelvin: I’ve learned there are certain things that I love that do feed me and nurture my spiritual growth. It’s six things: art, food, music, family, friends, and working out. Those are things and people I love, and that I need in my life. I used to feel like I needed to people please, and do all the things for everyone and be many different people, but it was taking my joy away from me and ultimately, I wasn’t performing to the best of my ability. Constantly feeling like I wasn’t enough or wasn’t doing enough messed with my psyche. Now I only do what I have to do and things that bring me joy. If it starts to interrupt my peace I’m out.Yeah, that’s so crucial. When you mentioned feeling obligated to please people and performing different versions of yourself that people wanted you to be, that reminded me so much of certain themes in Luce and Waves. I feel like there is a very specific trauma that Black kids who grow up in white suburbia or who attend private schools that are predominately white/non-Black endure, that often isn’t even fully recognized as trauma until looking back, like, woah, that was actually a really fucked-up experience. Do you relate to that?Totally. I went to a private school where I was one of maybe five, at most 10, Black kids in my high school. I stepped into that space and I suddenly felt like I needed to match them, instead of trying to maintain my individuality and understanding how special that was. Especially when you’re a young person, it’s all about trying to fit in. You assimilate to whatever culture is being set, whatever the majority is doing. Fundamentally, it just doesn’t add up. Everyone’s experiences are different. The world we live in is different, and we have to respect and understand that, but I was denying my own reality.Those experiences kind of played into the reason why Luce was so interesting to me. The idea of this young person having the awakening that I never had, and also finding agency and power, and his intelligence, and his experiences, and his voice, and his ability to seem like he is a part of their group. Really [my character’s actions in] Luce, even Waves, are all the things I didn’t do or maybe didn’t really understand, and [I’m] kind of allowing these kids to handle it in a way I wish I could’ve. Well, not necessarily Tyler…Right, but even Tyler—while watching Waves and even after processing his journey after the film—I was like, but he didn’t get the tools and support he needed! There was so much pain he was absorbing alone and didn’t know how to process.Kelvin: Yeah, it’s so tricky too ’cause, you know, I think parents in general of that generation saw their own parents who survived so much while also still dealing with segregation and just racism on a daily basis. I’m actually thinking of my parents being from the South, that’s also kind of how Trey [Edward Shults] and I thought about it. With Tyler’s parents being from South Florida, it’s a different vibe. They’ve been taught to withstand the trauma instead of learning how to end it and communicating that to their children. Tyler is constantly trying to get through the day and just get by. Like, ignore it, figure it out, deal with it as much as you can. But he’s always apologizing, always remorseful, and shameful about who he is. It’s not knowing how to use the shame and shape it into a person who’s confident and in their worth. It’s a person who’s allowed the shame to take over them to a place where it’s made them feel so low. He shrinks himself daily.Whew, yes. On navigating anti-Blackness, how have you been able to rest and recharge while dealing with the uprisings following the George Floyd murder and the many other deaths of Black people that flood the news and social media?Oh, man. The first few weeks of it all, it was really important for me to get off of social media. My friends and I were trying to figure out what truly can we do? What is our place in this moment? How are we most effective? It was a lot of meditation and also a lot of reading. I’m trying to look to the elders, and also to people who’ve maybe had similar experiences of what the protests looked like during the Civil Rights movement, and just trying to find the words to understand. Also trying to find a space where we can still love each other and show love, but communicate in a way that’s actually effective. Once again, I had to challenge myself to figure out what’s my intent, what do I want, and how do I go about getting that, and what’s the most effective way of going about getting that? I think I needed to remove my fear and my anger, and put myself in a position where I was listening more, then applying that to the spaces where I had power. It became more about asking myself, what do I do with my team and the work that I do?On a much lighter note, you mentioned earlier you love food. Have you been doing any cooking during quarantine?I made like a black miso cod. I was doing garlic potatoes. Carbonaras. I made a lot of salmon; that’s basic, though.I love salmon. What kind do you make—like soy sauce salmon, lemony salmon?Kelvin: Lemony salmon, love that. Sometimes I did a soy salmon. I do a lot of garlic stuff. I was trying to figure out a lot of recipes with garlic because everyone was like, “garlic is good for the immune system.” (Laughs)Oh, I haven’t heard that!Kelvin: I was like, I don’t know if this is true, but we’re garlicked up today. We’re gonna figure it all out. I do chicken parm sometimes. Garlicky spinach. And then I did some soul food days, like mac ‘n’ cheese, greens. I did some brisket, had that going for a second. I made my own doughnut recipe...that was bad.Ohhh, soul food sounds so good! Is there anything in particular you crave out here that’s hard to find that makes you homesick?Kelvin: Ooh, my mom just sent me all the things I needed to make gumbo. And that’s what I’m about to do this week, make some gumbo. I’m from New Orleans—I miss it. I miss crab. I’m so excited.Explore Bon AppétitHealthyishCelebritiesHere We AreInterviewsRead MorecultureWhy Indie Rapper Junglepussy Wrote a Song About Trader Joe'sBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-12", "author": ["Condé Nast", "Martine Thompson"]}