{"id": "ff3eb26a3abc02aae252fc40e8266735", "url": "https://www.bonappetit.com/story/cake-carrier-bakers-sto-n-go", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "This Cake Carrier Is a Bon Appetit Test Kitchen Standby  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Test Kitchen Swears By This Cookie and Cake CarrierYou spent 15 hours baking. Don’t screw this up.By MacKenzie Chung FeganDecember 16, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailIf there wasn’t cheesecake at your high school keggers, you didn’t grow up with Rick Martinez. When Rick was sixteen, his mom got him a subscription to Bon Appétit (look at him now!), and he soon became the guy who’d show up at his friends’ parties bearing elaborate, multi-layer desserts. “I was like, ‘This mocha ganache will really complement the flavors of your trash can punch,’” he says. Rick’s always been Rick.On one occasion, he spent all afternoon baking a particularly fussy cheesecake only to realize he didn’t have any way to actually transport it. As he carried it out to the car, carefully balancing it in his hands, his family’s German Shepherd bounded up behind him, jumped, and pushed him with what Rick swears was malicious intent. The cheesecake went flying. The dog feasted.This holiday season, as you’re ferrying your festive baked goods to office parties and cookie swaps, learn from Teen Rick’s mistakes—just like he did—and get the Baker’s Sto N Go.Rick “Sugar Man” Martinez, in all his baking glory.\nThe sturdy, shelved plastic suitcase of this cookie and cake carrier allows you to carry up to four layers of sweets. The sides are grooved, so you can adjust the three shelves like racks in an oven in order to accommodate both thin lace cookies and chunky blondies. The packaging touts that it can fit thirty-two mini cupcakes, up to forty cookies, or a 13-by-9 pan of brownies; remove all the shelves, and you can fit an entire bundt cake or an eight-inch layer cake or pie. Or forgo the baked goods entirely and jump on the plastic purse trend. It’s basically couture!But is it necessary?“Look,” says Rick, “if I’m dealing with a hardier, undecorated cookie, like the Chewy Ginger-Rye, I’ll stack them in a quart container and call it a day.” For cookies that require more care, like the Alfajores with Coconut Dulce de Leche, he’ll pack ‘em in a bakery box, either in a single layer or nestled in between layers of parchment. (A pizza box is an acceptable substitute, so start making friends at your local joint.) But for glamorous, high-maintenance, swap-winning cookies like these Tie-Dye Butter Cookies, Rick takes no chances.“It’s definitely hardcore,” he says, “but, if you’re going to win your cookie swap, this is what you need.”Buy it: Baker’s Sto N Go, $37 on AmazonAll products featured on bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingproductHoliday 2019Holiday CookiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-16", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}