{"id": "ff401e9686de3bec35052aa33a8382c5", "url": "https://www.bonappetit.com/story/tofu-dango", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "These Tofu Dumplings Require Just 2 Ingredients, Silken Tofu and Glutinous Rice Flour | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTwo-Ingredient Chewy, Stretchy, Go-Anywhere DumplingsThe satisfying chew of mochi + tofu’s soft quiver.By Chihiro TomiokaFebruary 10, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'Mytrek BrownFacebookTwitterEmailThis week on Basically, we’re diving deep into one of our favorite ingredients: tofu. To get all of this (and more) way before it hits the web, subscribe to our print magazine.Of all the types of Japanese confections, ranging from elaborate to home-style, perhaps the easiest to make is tofu shiratama dango, which come together in five minutes using only two ingredients.Tofu shiratama dango are part of the larger category of dango, a catchall term for Japanese dumplings that are often (although not always) made with rice flour. Mochi, though very similar, is technically made with grains of the glutinous rice mochigome that are steamed and pounded rather than with flour. Dango are defined by their stretchy, chewy texture; the flavor is mild and therefore incredibly versatile in sweet or savory applications: You can spoon them over ice cream, drizzle them with syrup, or drop them into soup.To make tofu shiratama dango, the rice flour shiratamako is bound by silken tofu to create a round confection that combines the satisfying chew of mochi with tofu’s soft quiver.To make enough tofu shiratama dango for four people (about 16 total), mix 100 grams silken tofu and 100 grams shiratamako until the mixture is as smooth as your ear lobe (think soft, cushiony, pliable). You can use the sweet rice flour mochiko, which is more commonly found in the U.S., to make this recipe, but the texture will be slightly different—they’ll still be chewy but less stretchy, with a slightly grainy mouthfeel. Ordering shiratamako is worth it!Working over a pot of simmering water, tear off a teaspoon-size piece of dough and roll into a marble-size ball. Plop it into water and repeat with remaining dough. Simmer for 2–4 minutes or until dango float, then remove with a slotted spoon into a bowl of ice water. Your dango are now ready for any of the preparations below, but know that they are best as soon as they are made—refrigeration nudges them toward the unpleasant side of gumminess.Maple + Soy = GlazeFor a North American variation on salty-sweet mitarashi dango (which are coated in sweet soy glaze), make a glaze by heating 3 Tbsp. maple syrup and 1 Tbsp. soy sauce for barely a minute, until bubbling and slightly thickened. Pour over the chilled dango.While the glaze for mitarashi dango is traditionally based on a combination of water, soy sauce, white sugar, and potato starch, maple syrup’s viscosity makes it a good replacement for the sugar, starch, and water. Also, when hasn’t maple syrup made a recipe better?If you have toasted soybean powder (kinako) in your cabinet, I would encourage you to sprinkle some on top of your syrup-glazed dango, or you can even go all-American with peanut powder instead.Ice cream!Japanese parfaits are architectural marvels that layer soft-serve swirls with Willy Wonka–esque combinations of (to name a few) cornflakes, dango, azuki (red bean), chiffon cake slices, and candied chestnuts. While your pantry may not be as well stocked as that of a Japanese parfait shop, some dango (and the maple glaze, if I’m ambitious!) are always welcome on my ice cream.Instagram contentThis content can also be viewed on the site it originates from.SoupI could have started the story by discussing ozoni, the Japanese mochi soup, but I always prioritize dessert. Japan is far from the only country to put sticky rice dumplings in its soups (tteokguk and tang yuan come to mind), but even if you were just to consider soups made in Japan, there are so many varieties.The defining characteristic of ozoni is the inclusion of mochi and the fact that it’s traditionally eaten for New Year’s. I find, however, that the concept of mochi in soup is far too delicious to limit to one day of the year. Though ozoni is traditionally made with mochi, as mentioned above, I use the tofu shiratama dango as a shortcut. An easy version I rely on often: Simmer one sliced onion in dashi, add red miso to taste, and then poach an egg in the hot broth and ladle over dango.The rest of the dango you can save for dessert.Chihiro Tomioka buys chocolate chip ice cream for the chocolate chips and has written about all things Japanese at Food52.Explore Bon AppétitIt's That SimpleBasicallyTofuJapaneseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-10", "author": ["Condé Nast", "Chihiro Tomioka"]}