{"id": "ff42e334f694b48b3edae3d8b5f61660", "url": "https://www.bonappetit.com/story/fermented-garlic-honey", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "How to Make Fermented Garlic Honey and How to Use It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBegin Your Own Fermentation Alley with This Funky Garlic HoneyThen put it on pizza, chicken thighs, cheese plates, or eat it straight from the spoon.By Alex BeggsOctober 11, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie TheodorouFacebookTwitterEmailThere’s a corner in the Bon Appétit test kitchen called Fermentation Alley. This is where Brad Leone (who you might know from “It’s Alive”) stores his various experiments. A vat of kombucha bubbles next to a crock of sauerkraut next to a bottle of cherry wine among jars of who-knows-what. One of those jars is Brad’s not-FDA-approved immune system booster, fermented garlic honey. A spoonful, he swears, will prevent you from the cubicle germs circulating at all times.“This was a Brad original,” it’s true, said Andy Baraghani, who wrote the formal recipe we just published with a few other new garlic condiments, like garlic-chile vinegar and confit garlic. The recipe goes like this: peel a ton of garlic, crush it, pour raw honey over ‘em, wait a week.Why crush it? That releases the allicin, the oxygenated sulfur compound that gives garlic its stink, and therefore the honey really takes on that garlic flavor. Everything in the jar bubbles during the process, and when the bubbles stop, fermentation stops, and that’s the best time to eat it, per Brad. This is usually after the week depending on some environmental factors. (“I like to go for two,” said Brad, with the but-that’s-just-me hand gesture.) As the garlic ferments, it softens and mellows, which means it's fair game too—you can easily eat a clove and go back for more.“It’s a safe thing,” Brad said, totally unprompted.“I didn’t say it was ...dangerous,” I replied.“Totally safe,” he repeated. Uhhh okay.We compared two jars from Fermentation Alley. One was close to two years old.“Maybe not so safe,” he noted of the darkened, silky liquid that none of us dared to taste.“Somebody’s gonna die,” said Andy. Instead we tried the fresher garlic honey that Andy had made, which had a nutty molasses note.These chicken thighs could use garlic honey in place of hot honey and be PHENOMENAL.\nThe honey makes a great pizza topping, a funky-sweetener for vinaigrette, drizzled on feta and flatbread, a glaze with lemon and olive oil for chicken thighs, or on the side of a cheese plate. Go crazy and sear some halloumi cheese and then dress it with garlic honey and wonder why you never did this before. Andy likes to thin it with some vinegar, add a ton of black pepper, and toss in bitter greens like radicchio or arugula. Brad...likes it on pizza.“And grilled cheese, HELLO!” He interjected.Get the recipe:Fermented Garlic HoneyYou can drizzle this honey over pepperoni pizza (trust!), serve alongside spicy fried chicken, and more.View Recipe*Please talk to your doctor before ever accepting medical advice from Brad.Explore Bon AppétitGarlicFermentationhoneyBrad LeoneRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-11", "author": ["Condé Nast", "Alex Beggs"]}