{"id": "ff4255d830203ea6762929cf81cf4523", "url": "https://www.bonappetit.com/recipe/tiramisu-layer-cake-with-mascarpone-mousse", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Tiramisù Layer Cake with Mascarpone Mousse Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueTiramisù Layer Cake with Mascarpone MousseBy Natasha PickowiczSeptember 18, 20184.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou and Natasha Pickowicz, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintStrong coffee can replace the espresso, but there’s no substitute for quality sweet Marsala (the kind for drinking not cooking). It gives the cake a boozy, fragrant edge that plays well against the bitterness of the espresso.Ingredients12 servingsSoak¾cup (190 g) sweet Marsala½cup plus 2 Tbsp. (150 g) brewed espresso, cooledFilling1½tsp. unflavored powdered gelatin1cup (224 g) heavy cream4(59 g) large egg yolks, room temperature2Tbsp. (26 g) sweet Marsala2Tbsp. (26 g) granulated sugar1tsp. vanilla extract½tsp. kosher salt8oz. (227 g) mascarponeAssemblyVanilla GenoiseEspresso Swiss Meringue ButtercreamPreparationSoakStep 1Combine Marsala and espresso in a small bowl. Cover and chill.Step 2Do Ahead: Soak can be made 3 days ahead. Keep chilled.FillingStep 3Place ¼ cup cold water in a small bowl and sprinkle gelatin evenly over top; chill until ready to use.Step 4Beat cream in the bowl of a stand mixer fitted with the whisk attachment on medium-high speed until medium peaks form. Scrape whipped cream into a medium bowl; cover and chill. Reserve bowl; you don’t need to clean it.Step 5Whisk egg yolks, Marsala, sugar, vanilla, and salt in a medium heatproof bowl until smooth; set over a saucepan of just barely simmering water (do not let bowl touch water). Heat, whisking constantly, until yolks are lightened in color and doubled in volume, about 5 minutes. Mixture should feel warm to the touch. Remove egg yolk mixture from heat and scrape into reserved bowl. Fit bowl onto mixer.Step 6Remove saucepan from heat and pour out water, then scrape in softened gelatin. Heat over medium-low, swirling pan often, until gelatin is dissolved, about 1 minute. With mixer on medium speed, stream gelatin into egg yolk mixture. Beat until sides of bowl are cool to the touch, about 2 minutes; add mascarpone and beat until smooth.Step 7Remove bowl from mixer and gently fold in chilled whipped cream. You should have about 4 cups mousse. Cover with plastic wrap, pressing directly onto surface; chill until set, at least 4 hours.Step 8Do Ahead: Mousse can be made 3 days ahead. Keep chilled.AssemblyStep 9Line a 9\"-diameter cake pan or springform pan with plastic wrap, pressing into bottom and leaving generous overhang. Fit a 1-piece round of cake into pan, placing bottom side up. Using a pastry brush, dab a quarter of soak across entire surface of cake. Stir chilled mousse to loosen, then scrape a third over cake and smooth into an even layer with a small offset spatula. Place another round of cake, bottom side up, on top of mousse, this time using a 2-piece layer. Repeat soaking and filling process. Top with the remaining 2-piece round of cake, bottom side up, and repeat soaking and filling process one more time. Top with remaining 1-piece round of cake, bottom side up, and brush with remaining soak. You should have 4 layers of soaked cake separated by 3 layers of filling. Wrap plastic overhang up and over cake; chill at least 12 hours and up to 2 days to allow mousse to set and cake to absorb soak.Step 10To frost, remove plastic from top of cake and invert cake onto a cake plate or platter. Remove pan and plastic. Dollop about 1 cup buttercream over top of cake and smooth across top and down sides, creating a very thin base layer. You want to fill in any gaps, adhere any crumbs to the cake, and seal in the fillings (this is called a crumb coat). Chill cake 10 minutes, then scrape remaining frosting on top of cake and spread all over, working down and around sides. Decorate as desired.Step 11Do Ahead: Cake can be made 2 days ahead. Chill until frosting sets, then cover loosely with plastic wrap. Let sit at room temperature 1–1½ hours before slicing.Photo by Alex Lau, food styling by Susie Theodorou and Natasha Pickowicz, prop styling by Rebecca BartosheskyStep 12Highly recommended reading: Layer cake tips, tricks, and common mistakes from Natasha Pickowicz.How would you rate Tiramisù Layer Cake with Mascarpone Mousse?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI don't think I would make this again -- rather flavorless.  The buttercream definitely had little espresso flavor, the cake was kind of rubbery, I was disappointed in both the soak and mascarpone mousse (seemed a little salty?).  The cake was bland, which was surprising.  It was fun to make, but does take a long time. So it was very disappointing that it wasn't really worth eating.  AnonymousChicago, IL1/11/2022This cake was great in theory, but not in execution, at least not without major modifications. The only piece I didn't modify was the mousse filling.\n\nI'm not quite sure what went wrong with the genoise recipe, but my cakes came out rubbery, sticky and flavorless. I ended up finding an alternate recipe for a vanilla sponge and used that. The soak was also very overwhelmingly sweet, so I alternated between the soak and regular strength espresso to balance the flavor. Finally, there was no espresso flavor to the buttercream when made as written. I added a fourth tbsp. of espresso, but with all the liquid my buttercream looked as if it were ready to curdle, so instead I added two instant espresso packets to get enough of that flavor. \n\nUltimately this cake turned out beautiful and delicious, but thanks only to some major substitutions. AnonymousNew York10/5/2020Wow- delicious! This cake is a lot of work but well worth it. It is kind of a weekend project with the amount of time the ingredients need to chill and set, but a little planning and it will come together nicely. \n\nThe next time I make this, I think I’ll make it a rectangle rather than 9 in circles. Instead of cutting out circles, I’d just cut the sheet cake in half- 2 layers per pan, and no scraps or crumbs to deal with. \n\nThe vanilla genoise cake was perfect - spongy and absorbant and not eggy at all. AnonymousWisconsin12/17/2018Explore Bon AppétitCakeDessertLayer CakeItalianEuropeanCoffeeAlcohol & Other DrinksMarsalaMascarponeCheeseBakingEasterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Natasha Pickowicz"]}