{"id": "ff4871018d72641e555aaafc5666a426", "url": "https://www.bonappetit.com/story/spicy-garlic-vinegar", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "This Spicy Garlic Vinegar Belongs In Your Fridge at All Times | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Spicy Garlic Vinegar Belongs In Your Fridge at All TimesGarlic and spice make everything nice. (Is that how it goes?)By Alex BeggsOctober 9, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie TheodorouFacebookTwitterEmail“It’s funky,” Andy Baraghani said as we cracked open a Ball jar of garlic-chile vinegar, which was around two months old at this point. “But also addictive and delicious.” We tasted spoonfuls and coughed the good cough. The Thai chile hits, and then poof! (Andy’s hand mimicked a Genie evaporating into his lamp), it disappears.After recent trips to Vietnam and Thailand—with great flight deals, I might add—Andy knew there was a condiment we needed a recipe for. A universal garlic-chile vinegar like the Vietnamese version, dam toi, that he found on every restaurant table (and the more pickle-like prik nam som in Thailand). Use it to finish fatty cuts of meat, braises, noodle soups, and a thrown-together fried rice dinner with a shot of unapologetic heat, funk, and above all, acid. You can find variations on the ingredients (palm sugar or no sugar here, rice vinegar there), and Andy’s recipe adds some ginger for more heat, of a different style than the straight fire of a Thai chile. “It’s in the background—it rounds everything out.”Immediately drooling. Angela Dimayuga’s roast pork belly with bottle of chile vinegar (top left).\nAlex LauThe assembly takes around five minutes: White vinegar is heated with sugar and salt until dissolved, then poured into a jar with sliced garlic, sliced ginger, and a handful of whole chiles. The recipe calls for Thai chiles, but I made mine with a few habaneros, which bring a tropical and fruity note. After it cools, it can be refrigerated for, let’s say one to two months, at user’s discretion.A view from the top.\nPhoto by Alex Lau“Americans don’t usually use condiments that are this assertive,” Chris Morocco chimed in, watching me and Andy go in for second spoonfuls to really wake ourselves up. “But it completely transforms the flavor of a dish, it brightens everything—it’s a secret weapon.” He pointed out the recipe for Angela Dimayuga’s succulent roast pork belly with chile vinegar, where you make the condiment right in the vinegar bottle itself, stuffing the chiles inside.Chris’ grilled snapper with a blistered bean salad tossed in chile vinegar.\nPeden + Munk“It brings a heat that’s IN YOUR FACE, even though it disappears,” Andy said. Other than as a finishing condiment, he uses a few spoonfuls in dressings for crunchy cucumber salads, or mixed into mayo or yogurt for creamy dressings. Chris makes a version with brown sugar to spoon over this grilled snapper recipe.After he uses up the infused vinegar, Andy likes to chop up the peppers and use them in a relish or salsa. Then it’s time to buy another head of garlic, and get the next batch going.Get the recipe:Garlic-Chile VinegarThis spicy-tangy-funky condiment will become your secret weapon.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-09", "author": ["Condé Nast", "Alex Beggs"]}