{"id": "ff5084ea54a32bbad9b1bf025e8581fb", "url": "https://www.bonappetit.com/story/slow-roasted-salmon-recipe-parchment-packet", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "A Slow-Roasted Salmon Recipe for People Who Suffer From Salmon Fatigue | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Slow-Roasted Salmon Recipe for People Who Suffer From Salmon FatigueCook it in a parchment paper packet and never look back.By Emily SchultzJanuary 18, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailYou know how on say, a Wednesday night, you’re drained from the work week (ALREADY) and when you come home, you’re basically on autopilot while cooking dinner? Preheat the oven, throw some semi-mushy veggies from last week’s grocery trip and a piece of fish on a pan, hope for the best? Well, this salmon recipe is here to revitalize all of your salmon senses–like a more realistic version of those slow-motion splash face wash commercials.The slow-roasted salmon in parchment paper is from The Baazar in Miami Beach, Florida, but tasted just as satisfying in my cold Brooklyn apartment. Beneath the salmon, there’s a bed of caramelized onions and universally wonderful castlevetrano olives, which I would write a Rupi Kaur-style poetry book to if that was a normal thing to do. The slight brininess and melt-in-your-mouth texture of the olives paired with the subtle sweetness of the caramelized onions and the perfectly cooked fish is chef kiss.The first step in this recipe is to caramelize some onions which will take about 25 minutes (see the video above for guidance). You should stay close to your stove for this part, but luckily for you, the fridge where they keep the wine is pretty close. Pour yourself a glass, turn on your next Black Mirror episode and get to caramelizing.While you're multitasking with all of the above, tear up some olives (for snacking and for your pan). Once the onions are lightly browned and softened, add the olives, capers, raisins (FYI, I used golden raisins here because I prefer them–do what feels right!), and a splash of water to the skillet until the olives have softened.Here is the part about the recipe that intimidated me, but in kind of a thrilling way: You add in about 6 ounces of rum to this olivey-onion mixture. My preferred method of adding high proof liquor to a hot pan is to measure out as much as I need in a smaller vessel (Like these small measuring cups), bring the pan away from the flame, pour in the liquor quickly, and then return to the flame. Taking it away from the pan won’t make it flame up, but there will be steam! Measuring out the rum ensures your entire bottle of rum doesn’t catch on fire, and it’s more precise! Phew! You just did that thing, go you.Once your liquid is evaporated, stir in some lime juice and water so your finished result is an olivey-onion sauce. (Think wet, not drenched). Your oven should be LOW (like...275 degrees low) because we want to create steam in the parchment paper, evenly cooking the salmon all of the way through without drying it out.My favorite part of this whole recipe is making the parchment packets, which feels like an elementary school Valentine’s Day project. Take a large sheet of parchment paper and place a good amount of the saucy mixture in the center with some torn cilantro, if you’re not one of those people who despises cilantro. Add 1 fillet on top of the mixture and drizzle some olive oil over the entire thing. Fold the paper around the edges like you would when making a galette. The recipe says to tie it with kitchen twine, but I sealed them by folding the best I could and everything was fine. Pop the salmon in the oven for about 20 minutes, click the “still watching” button on Netflix, and patiently wait for your salmon to finish its olivey sauna. When it’s out of the oven, wait two whole minutes to let it keep bonus steaming in the packet before you open up your prize. The saltiness of the olives, the acidity from the lime juice, and the subtle sweetness of the onions and raisins made this dish the most balanced part of my week.This recipe would be amazing with some jasmine or brown rice, which could be made in the time you’re waiting for the salmon in the oven! Double win!Get the recipe:Slow-Roasted Salmon in Parchment PaperA totally hands-off recipe that can be assembled ahead of time.View RecipeExplore Bon AppétitSalmonWeeknightFishOliveRead MoreKombu-Cured Salmon with Fresh Yuzu KoshoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-18", "author": ["Condé Nast", "Emily Schultz"]}