{"id": "ff578fbd02e0d9d46d317f456d0135c3", "url": "https://www.bonappetit.com/story/digital-masthead", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "Bon Appétit Masthead | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoppromotionsBon Appétit MastheadBy Bon AppétitFebruary 23, 2022FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailWant to pitch Bonappetit.com? Read our guidelines here.Editor in Chief DAWN DAVISExecutive Editor SONIA CHOPRAFood Director CHRIS MOROCCODeputy Editor MERYL ROTHSTEINCreative Director ARSH RAZIUDDINDirector of Editorial Operations NICK TRAVERSEEDITORIALDigital Director SASHA LEVINESenior Editor, Cooking SARAH JAMPELCulture Editor HILARY CADIGANLifestyle Editor KAREN YUANRestaurant Editor ELAZAR SONTAGAssociate Editors ALI FRANCIS, BETTINA MAKALINTALAssociate Editor, Cooking ANTARA SINHAAssistant Editor CHALA TYSON TSHITUNDUDigital Operations Associate NICO AVALLEEditorial Operations Associate KATE KASSINRecipe Production Assistant MEHREEN KARIMAssistant to the Editor in Chief JENNA ADRIAN-DIAZEntertainment Director CAITLIN BRODYContributing Editors JENNIFER HOPE CHOI, AMANDA SHAPIRO, AMIEL STANEKGlobal Commerce Category Director, Food & Home ELAHEH NOZARISenior Commerce Editor MACKENZIE CHUNG FEGANAssociate Commerce Editor MEGAN WAHNCommerce Writer TIFFANY HOPKINSTEST KITCHENSenior Food Editor CHRISTINA CHAEYFood Editor SHILPA USKOKOVIC Associate Food Editors RACHEL GURJAR, ZAYNAB ISSA, KENDRA VACULINAssistant Food Editor JESSIE YUCHENTest Kitchen Coordinator INES ANGUIANORecipe Editors LIESEL DAVIS, JONATHAN MILDERDESIGNDesign Director CAROLINE NEWTONArt Director HAZEL ZAVALA Art Assistant JULIA DUARTE PHOTOGRAPHYVisuals Director JOSE GINARTEVisuals Editor GRAYLEN GATEWOODContributing Visuals Editor ELIZABETH JAIMEContributing Digital Visuals Editor LYN HORST Contributing Assistant Visuals Editor DONDRE STUETLEYStaff Photographer EMMA FISHMANAssociate Staff Photographer ISA ZAPATAPRODUCTION, COPY & RESEARCHProduction Managers MATT CARSON, KATE FENOGLIO Copy Director GREG ROBERTSONCopy Manager BRIAN CARROLLResearch Director RYAN HARRINGTON Contributing Research Editor MARISSA WOLKENBERGSOCIAL & AUDIENCE DEVELOPMENTGlobal Director of Audience Development, Analytics, & Social Media MATT DOMINO Associate Director, Social Media URMILA RAMAKRISHNANSenior Manager, Social Media ESRA EROLAssociate Manager, Social Media OLIVIA QUINTANAAssociate Analytics Director CLARA CHENSenior Manager of Audience Development ALEX PASTRONAssociate Manager of Audience Development JESSIE FORSTMANNVIDEOHead of Programming JUNE KIMDirectors, Creative Development DAN SIEGEL, MARIA PAZ MENDEZ HODES Associate Director of Creative Development, Social & Visuals ADAM MOUSSADirector of Content ALI INGLESESenior Culinary Director RHODA BOONECulinary Producer KELLY JANKEProgramming Manager HOLLY PATTONDirectors CORY CAVIN, MATT HUNZIKER, CHRIS PRINCIPEDirectors of Photography BEN DEWEY, KEVIN DYNIA Producers BLAKE JESSE, NESS KLEINO, PARISA KOSARI, TYRE NOBLES, TOMMY WERNERContributing Editor MARCUS SAMUELSSONChief Business Officer JENNIFER MORMILEVP, Brand Revenue BROOKE BRENNERHead of Marketing DEBRA HARRISVP, Finance SYLVIA CHANSenior Business Director JENNIFER CRESCITELLIDirector, Brand Marketing LESLIE YEHAssociate, Brand Marketing OYETUNDE OLUBOWALEHEADS OF SALESFashion & Luxury ELIZABETH LUNNYCPG & Vice JEFF BARISHAuto & Media/Entertainment BILL MULVIHILLBusiness/Finance/Technology DOUG GRINSPANHealth & Beauty CARRIE MOOREHome & Travel BETH LUSKO-GUNDERMANVP, Revenue-Midwest PAMELA QUANDTVP, Revenue-San Francisco DEVON ROTHWELLVP, Enterprise Sales-Los Angeles - DAN WEINERCREATIVESenior Art Director PHUONG NGUYENArt Director STEPHANIE OLSEN RABINOWITZAssociate Art Director MIRIAM ROSSExecutive Producer LLOYD D'SOUZASenior Producer JULIE SULLIVANDirector of Creative Content Production DANA KRAVISPUBLIC RELATIONSExecutive Director, Communications ERIN KAPLANSenior Manager, Communications SAVANNAH JACKSONPUBLISHED BY CONDÉ NASTChief Executive Officer ROGER LYNCHChairman of the Board JONATHAN NEWHOUSEGlobal Chief Revenue Officer & President, U.S. Revenue PAMELA DRUCKER MANNChief Content Officer ANNA WINTOURPresident, Condé Nast Entertainment AGNES CHUChief Financial Officer JACKIE MARKSChief Marketing Officer DEIRDRE FINDLAYChief People Officer STAN DUNCANChief Communications Officer DANIELLE CARRIGChief of Staff ELIZABETH MINSHAWChief Product & Technology Officer SANJAY BHAKTAChief Client Officer JAMIE JOUNINGChief Content Operations Officer CHRISTIANE MACKIN THE UNITED STATESChief Business Officer, U.S. Advertising Revenue and Global Video Sales CRAIG KOSTELICRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-05-15", "author": ["Condé Nast", "Bon Appétit"]}