{"id": "ff69f3f6239ce51c850956aed5db8da4", "url": "https://www.bonappetit.com/story/aioli-recipe-immersion-blender", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "I Made This Garlicky Grand Aioli in 5 Minutes with My Trusty Immersion Blender | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Made This Garlicky Grand Aioli in 5 Minutes with My Trusty Immersion BlenderThen use it as a crudités dip, sandwich spread, or a sauce for crispy smashed potatoes.By Alyse WhitneyJune 14, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Chris MoroccoFacebookTwitterEmailI am a Hellmann’s loyalist and always have a jar of it in the door of my fridge for artichoke dip, Magic Crispy Chicken with honey mustard, and every sandwich (especially tuna). Mayonnaise is always there, and I’ve never switched brands or thought to make my own until I saw this new recipe for grand aioli. Grand, you say? I had to know more.Aioli and mayonnaise are kind of the same thing. Traditional aioli is made by emulsifying olive oil and garlic, so the name is used colloquially to mean “mayo, plus something else.” I know aioli as the thing I get with steak frites at a French restaurant, or what they call the spread on a slightly fancier sandwich shop. In this recipe, we use it as a dip for crudités, shrimp, and anything else you want to mingle with something creamy and garlicky.The only thing I find stressful about making aioli is that you have to be incredibly careful when making an emulsion of egg yolks and oil, because those ingredients don’t want to go together. You have to force them by introducing them slowly, like when I bring my dog to the dog park. If you go too fast, the mixture will break, and it’s very difficult to get them to intermingle again into a fluffy, spreadable mixture.You can also make smoothies, milkshakes, creamy dips and soups, and crepe batter with an immersion blender.\nI had success making hollandaise in my immersion blender a few months ago, so I thought, why whisk it and risk it when a spinning blade can do all the work for me? I have a blue KitchenAid hand blender that I bought many years ago on Black Friday for $10, but it’s still affordable at $30 on Amazon. It comes with a cup sized for the mixer head, so even a small amount of ingredients makes constant contact with the blade. (You could also do it in a mason jar.) This is ideal, because you need the ingredients to be constantly mixed as you stream in oil.First went in two egg yolks, 1 tsp. Dijon mustard, 1 clove grated garlic, and a pinch of salt. I measured out ½ cup olive oil in a pourable measuring cup and started running the motor. I added a little bit at first, and it immediately emulsified into a creamy, fluffy mixture, starting to double in size. Success! I added a splash or two of oil at a time in case it decided to break, but once I realized the immersion blender technique was impossible to mess up, I dumped the rest in, moved around the blender, and voila! A  squeeze of approximately 2 Tbsp. lemon juice and a little more salt was all it needed. My grand aioli was finished in less than five minutes from start to finish.Level up to smashed potatoes with chorizo aioli.\nPhoto by Alex LauIt was tangy, thick, and super creamy. Garlicky enough to make you pop a mint if you eat it on avocado toast for breakfast (which I definitely did). The amount of oil required doesn’t make it cost effective to replace my beloved Hellmann’s, but in many ways, it’s an entirely different product: garlicky, homemade, near silky. I could also replace half the olive oil with a neutral oil like canola or sunflower to make a more classic mayo that costs less. And since I didn’t totally exhaust my arm whisking aioli, I used that energy to change the sheets on my bed and wash my kitchen counters. Side effects of immersion blender aioli may include increased productivity and better sandwiches.Learn how to make aioli by hand here:Grand AioliDip everything–all of the things—into this garlicky mayonnaise.View RecipeOr buy a KitchenAid immersion blender for $30 on Amazon and make it my way.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitAioliMayonnaiseShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-14", "author": ["Condé Nast", "Alyse Whitney"]}