{"id": "ff870597fd8ac5b6c5f63d5131ed9223", "url": "https://www.bonappetit.com/recipe/spicy-grilled-chicken-with-crunchy-fennel-salad", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Spicy Grilled Chicken with Crunchy Fennel Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueSpicy Grilled Chicken with Crunchy Fennel SaladBy Andy BaraghaniMay 22, 20184.7(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThis chicken recipe packs some heat, which is why we paired it with a superclean and cooling crisp fennel salad. If fennel is not your thing, any shaved crunchy veg will do. Try radishes, carrots, or cucumbers instead.Ingredients4 servings Chicken1½lb. skinless, boneless chicken thighsKosher salt2garlic cloves3oil-packed anchovy fillets (optional)1red chile (such as Fresno or Holland), seeds removed, coarsely chopped2Tbsp. tomato paste2tsp. finely chopped oregano3Tbsp. extra-virgin olive oil, plus more for grilling2lemons, halvedFennel Salad and Assembly2medium fennel bulbs, tough outer layers removed, halved lengthwise, thinly sliced crosswise1small white onion, very thinly sliced into rounds2Tbsp. unseasoned rice vinegar2Tbsp. extra-virgin olive oilKosher salt1Tbsp. toasted white and/or black sesame seedsPreparationChickenStep 1Pat chicken dry and season with salt. Set aside on a plate.Step 2Smash garlic under the flat side of a chef’s knife on your cutting board. Add anchovies, if using, chile, and a couple of pinches of salt and continue smashing with the side of your knife until a paste forms. (You can also do this with a mortar and pestle.) Transfer paste to a large bowl and stir in tomato paste, oregano, and 3 Tbsp. oil. Add chicken and toss to coat. Let sit at room temperature 1 hour.Step 3Meanwhile, prepare a grill for medium heat. Clean and oil grate. Grill chicken, turning once, until lightly charred and cooked through, about 4 minutes per side.Step 4While the chicken is cooking, grill lemons, cut side down, until lightly charred and starting to caramelize, about 4 minutes. Transfer to a platter.Step 5Transfer chicken to platter with lemons and let rest 5 minutes.Fennel Salad and AssemblyStep 6While the chicken is resting, toss fennel, onion, and vinegar in a medium bowl; drizzle with oil and season with a big pinch of salt. Toss once more.Step 7Mound fennel salad next to chicken and sprinkle sesame seeds over both. Squeeze grilled lemons over chicken and fennel salad.How would you rate Spicy Grilled Chicken with Crunchy Fennel Salad?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI didn't make the chicken, I only made the fennel salad as a side dish and I loved it! Crunchy, fresh and flavorful. I ended up going with a Korean-style marinade for my chicken and served over rice and it was great along with this salad. I replaced red onion for the white one.NayaraChicago, IL8/24/2021Simple and tasty - perfect for mid-weekAnonymousMiami, FL5/22/2020My favorite go to for a fast impressive dinner.  The combination of the citrus and the brightness of the fennel salad with the salty spicy chicken is fantastic. AnonymousBrooklyn 6/2/2019Yum! This was great. I actually thought the chicken was not that spicy even though the peppers burned my fingers during preparation, but it tasted amazing. The fennel salad was a great side for this and other barbecue.soapnanaChicago7/5/2018My wife doesn't do a lot of heat so I swapped a fire roasted poblano for the fresno and added 1/8 tsp. of smoked paprika to add the smoky finish that a ripe fresno has. The sweetness of the paprika helped with the heat. Wife enjoyed it and said it's a keeper.RE TI RE DMA5/29/2018Explore Bon AppétitChicken ThighChickenPoultryChileVegetableFennelOnionSummerFallEasyWeeknight MealsMainDairy-FreeGluten-FreeKetoHealthyishGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Andy Baraghani"]}