{"id": "ff889e4f7db27fc39cecbad5ce8ddda1", "url": "https://www.bonappetit.com/story/fiori-di-sicilia", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "Fiori di Sicilia Is So Bewitching That I Wear It as Perfume | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Italian Baking Extract Is So Bewitching That I Wear It as PerfumeAdd it to brioche dough and olive oil cakes and you’re halfway to Sicily.By Heather EddyJune 15, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Do you remember your first perfume? In that brief twilight after Love’s Baby Soft but before CK One, mine was McCormick’s Vanilla Extract. Sneaked from the spice cupboard and dabbed on furtively before school, it left me smelling like a cupcake—just the right level of alluring for tweenage me. Though I’ve since traded vanilla for more sophisticated and exotic scents, I still on occasion adorn my pulse points with another staple of my baking shelf: King Arthur’s Fiori di Sicilia extract.While Fiori di Sicilia may be common in Italy, called for in traditional recipes for panettone or colomba d’oro, this potent blend of citrus and vanilla is relatively unknown in the States, except among fellow King Arthur Baking Store obsessives. The specific ingredients are a secret, but the extract captures the essence of Sicily in a bottle. There’s an up-front explosion of sweet citrus, bright and fresh with the snap of an orange twisted right from the branch. At its heart is a musky, lush vanilla, like a Palermo window box bursting with fragrant plumeria. The base note is bracing and sharp thanks to the zesty pith of the cedro, a lemon variety that’s up to three times the size of a normal fruit and 70% skin, which makes it ideal for candied peel and marmalade. Earl Grey fans will also recognize the sophisticated bitter orange aroma of bergamot.If you’d rather cook with it than wear it, a few drops of Fiori di Sicilia will glow up any babka or brioche dough. Incorporate it into the batter and glaze of a teacake recipe or consider a play on Sicilian cassata, adding some extract to the sponge cake base, layering on the tangy ricotta filling you’d use for cannoli, and decorating with jewels of candied fruits. Try it in an olive oil cake to highlight the lively green flavors.Because Fiori di Sicilia is a blend of essential oils rather than a distilled extract, it’s super-concentrated and best used with restraint. King Arthur recommends adding just a half teaspoon to standard recipes. (K.A. also advises keeping it in the fridge.) However you use it, Fiori di Sicilia is the perfect accessory, sure to turn heads and garner compliments from strangers—whether in your baked goods or on your wrists.Fiori di Sicilia$10 at King Arthur BakingExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-15", "author": ["Condé Nast", "Heather Eddy"]}