{"id": "ffacb6abbb7b845ec2a41044e80f4419", "url": "https://www.bonappetit.com/recipe/jamaican-beef-patties", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "Jamaican Beef Patties Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2020 IssueJamaican Beef PattiesBy Shani JonesJanuary 7, 20204.0(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Yekaterina BoystovaEmailPinterestPrintEmailPinterestPrintThese delectable flaky pastries from can be found at street vendors and restaurants in Jamaica and throughout the Caribbean, but they’re fun to make at home as a crowd-pleasing snack or appetizer. This version comes from Shani Jones of Peaches Patties in San Francisco, named in honor of her mother’s signature recipe. Adding turmeric to the dough gives it its distinctive yellow color. Let the patties sit for a while after baking for maximum flavor, and serve them with hot sauce (Jones suggests the classic: Pickapeppa) alongside. This recipe is one of our favorites from We Are La Cocina: Recipes in Pursuit of the American Dream, our BA Cookbook Club January 2020 pick. Reprinted from We Are La Cocina by Leticia Landa and Caleb Zigas with permission by Chronicle Books, 2019.IngredientsMakes 18Dough3cups (420 g) all-purpose flour2tsp. kosher salt1tsp. ground turmeric1cup (2 sticks) unsalted butter, cut into 1\" pieces, frozen1large egg, lightly beaten1tsp. distilled white vinegarFilling and Assembly2Tbsp. vegetable oil1lb. ground beef chuck (20% fat)1small onion, finely chopped1medium Scotch bonnet or habanero chile, stemmed, finely chopped6garlic cloves, finely chopped1Tbsp. ground allspice1½tsp. freshly ground black pepper½tsp. smoked paprika2cups homemade beef stock or low-sodium beef brothKosher salt4scallions, light green and whites parts finely chopped1Tbsp. thyme, finely choppedAll-purpose flour (for dusting)1large eggSpecial EquipmentA 5\"-diameter round pastry cutterPreparationDoughStep 1Pulse flour, salt, and turmeric in a food processor to combine. Add butter and pulse until mixture is crumbly and pieces of butter are evenly distributed.Step 2Whisk egg, vinegar, and ¾ cup ice-cold water in a small bowl to combine. Add to flour mixture and pulse until a smooth ball of dough forms. Wrap dough and chill until cold, about 1 hour.Filling and AssemblyStep 3Heat oil in a large saucepan over medium until hot. Cook beef, breaking up into pieces, until nearly cooked through, about 5 minutes. Transfer to a plate using a slotted spoon, leaving fat behind. Add onion, chile, and garlic to pan and cook, stirring often, until vegetables are softened, about 3 minutes.Step 4Add allspice, pepper, and paprika. Stir to combine, reduce heat to low, and return beef to pan. Add stock and use a wooden spoon to scrape up any browned bits on bottom of pan. Bring to a simmer and cook, stirring occasionally, until about half of the liquid has evaporated, 5–8 minutes. Season with salt and remove from heat. Add scallions and thyme. Taste and adjust seasoning. Let cool slightly.Step 5Place a rack in lower third of oven; preheat to 375°. Lightly flour a rolling pin. Cut dough in half on a lightly floured work surface. Working with one half at a time, roll dough to ⅛\" thick. Cut dough with 5\" round pastry cutter. Place 2 Tbsp. meat filling on one-half of each round, leaving a ½\" border. Brush edges of dough with water. Fold dough over filling to make a half-moon shape. Press edges with the tines of a fork to seal. Repeat process with remaining dough and filling, rerolling scraps as needed. Transfer patties to a parchment-lined baking sheet.Step 6Whisk egg and 2 Tbsp. water in a small bowl to combine. Brush top of each patty with egg wash.Step 7Bake patties until golden brown and cooked through, 20–25 minutes. Let sit 5 minutes before serving.Step 8Do Ahead: Patties can be baked up to 5 days ahead. Cover and chill, or freeze up to 1 month. Reheat in a 375° oven.How would you rate Jamaican Beef Patties?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleThis was a really great recipe! Also this is the first time I’ve made pastry encrusted meat pie always found the idea quite intimidating. I cooked the filling one day and made the pastry the next to take some of the anxiety out of it.   I looked at the comments and followed some of the suggestions and also from the patties I’ve previously enjoyed. I agree with the commentor that the pre-fried ground beef would be a bit crumbly and not traditional even with the gravy the texture would be wrong it’s more like paste style ground beef that’s boiled. So I cooked the onions to soft, added the spices to toast then added stock (1 cup as suggested in comments )then the Beef, and cooked it down to a thick gravy. Also I used 1 tablespoon of Scotch bonnet pepper sauce (the brand Grace from Jamaica)  as I couldn’t find fresh scotch bonnets I got 10 large patties out of this recipe and  they were awesome! They will be part of our regular rotation, just fantastic! This is a great recipe to try meat type pies! AnonymousVANCOUVER Canada 3/23/2021Absolutely thought these were delicious! Will make again!Anonymous9/4/2020So I've been eyeing this recipe for awhile, and finally made it last night! It was a lot easier than I expected. I don't  have a food processor so I made the dough by hand. When rolling it out, I folded it over several times so it would be light and not too heavy. Turned out good...just wish the dough had more flavor.. I saw another reviewer say they used vodka. I will try that next time instead of vinegar. \nAs for the filling...it was okay as well.. granted, I couldn't find a habanero (#quarantine) so I used a jalapeño and added some chili powder and crushed red pepper (loveeee spice). And still it was just okay. I think I will play around with the filling a bit more. Maybe try adding a bit of curry next time to see if the flavor is more authentic. \nAll in all, easy to follow and turned out good. I will make this again for company (when we can do that again). AnonymousChicago8/4/2020I’ve made these twice now during Quarantine Times™ ;) I follow the dough recipe as written. The first time I had to cut in the butter with knives (because I forgot our blender had a food processor attachment!) and I think that time the dough was better because the butter chunks were bigger. Then I sort of freestyle the inside, using the recipe as framework since you don’t always have every ingredient on hand anymore. Last night had the addition of some leftover potatoes which ended up disappearing into the beef but making the juices into a thick sauce. It’s a great way to stretch a pound of ground beef into a meal. missmatlockLos Angeles5/20/2020Made these tonight, big hit.  Made them with ground chicken because that was what we had in the fridge.  Adjusted the spices to be able to share with friends  that prefer things a little less spicy.  The pastry is super easy, super flaky.  Will definitely make again.  AnonymousMontreal4/22/2020Love the shell of this patty. I added one habanero without seeding it and it turned out a little too spicy for me. When rolling out the dough, I found portioning the dough into 18 balls before rolling it out to be easier and more consistent than the method stated in the recipe. camelEau Claire, WI4/13/2020Excellent recipe, filling flavorful, slight spice, and delicious.  Actually better than the more generic beef patties found in stores or sold at Carribean themed events/food trucks.  Will definitely be making this one again.AnonymousMinneapolis, MN1/25/2020The dough has excellent flavor.  I used vodka instead of vinegar.  Despite all the seasoning I was surprised at how bland the filling was.  I would recommend only 1 not 2 cups of broth as the filling can’t be juicy or it will run all over.  Make the filling in advance and let it cool To at least room temp so it won’t cause the crust to melt and fall apart around it.  AnonymousMinneapolis1/14/2020Not bad but not too authentic.  How about a recipie for Stamp & Go? The real version.quilty_luca1/13/2020I can't leave a bad review as the recipe is in itself tasty, but i do want to say that this is an empanada style rendition of a patty. Jamaican beef patty's use lard or suet in the crust and is folded in to create a much more flaky texture. Furthermore the meat is typically of a more blended consistency and will not fall out in large chunks as seen in the image above. Finally the crust of the patty will stick to the meat inside, and the flakes will be considerably more moist, a result of the heavier suet/lard used in the cooking process. Again this recipe is tasty as is, but i feel it is important to make the distinction that a jamaican beef patty bought from a bakery on the streets of jamaica will not come out the same as this due to the nuances listed above. Finally i give my respect to the creator of this recipe and bless up.McfarquharpJamaican American1/9/2020The dough/pastry was great.  Really nice and flaky with good flavour.  I would have liked the filling a little spicier, so would probably add another habanero next time, but that's completely dependent on the peppers you can get.  I'm not sure how you can simmer off a full cup of liquid in 5-8 minutes. I ended up at probably twice that, but may have erred on the dry side to avoid a soggy filling.\nOverall, a great dinner that I'll make again.AnonymousNewfoundland, Canada1/9/2020Explore Bon AppétitJamaicanCaribbeanGround BeefBeefMeatTurmericHerbs & SpicesScotch BonnetChileVegetableSnackStarterNut-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-07", "author": ["Condé Nast", "Shani Jones"]}