{"id": "ffc1f6bb001464a31f287fd597fddfd3", "url": "https://www.bonappetit.com/recipe/scallion-oil-noodles", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Scallion-Oil Noodles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueScallion-Oil NoodlesBy Lisa Cheng SmithNovember 19, 20194.6(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Lillian Chou, prop styling by Beatrice ChastkaEmailPinterestPrintEmailPinterestPrintIt’s astonishing how much scallion flavor you get in these noodles from the infused scallion oil. (Save the flavorful oil left over from cooking the scallions to use in dressings and for drizzling over dumplings or poached fish.) Then take it over the top with a garnish of crunchy fried scallion slices. This recipe is from Taiwanese-American cook Lisa Cheng Smith’s spectacular Lunar New Year feast. Find the rest of her menu here.Ingredients8 regular or 16 small servings10scallions¾cup grapeseed or vegetable oil1lb. fresh Shanghai or lo mein noodles or dried lo mein noodles¼cup soy paste (such as Yu Ding Xing)2Tbsp. soy saucePreparationStep 1Cut scallions crosswise into thirds, separating dark green parts from white and pale green parts. Slice lengthwise into very thin strips, keeping dark green and white parts separate.Step 2Pour oil into a cold large wok or high-sided skillet. Add white parts of scallions to oil and set over medium-low. Cook until oil starts to bubble, about 5 minutes. Add dark green parts of scallions and stir to combine. Cook, stirring occasionally, until scallions are crisped and deep golden brown, 20–30 minutes. Do not rush this; slow, gradual browning as the liquid in the scallions evaporates will yield the best flavor.Step 3Using a spider or slotted spoon, transfer scallions to paper towels to drain. Let scallions and oil cool. Pour oil through a fine-mesh sieve into an airtight container; discard solids. Cover and chill scallion oil until ready to use.Step 4Cook noodles in a large pot of boiling water according to manufacturer’s directions, adding 1 Tbsp. reserved scallion oil to the cooking water when you add the noodles. Drain noodles, reserving ½ cup cooking liquid, and return to pot. Add ½ cup scallion oil and toss to coat. Add soy paste and toss to combine. Add soy sauce and toss again, adding cooking liquid as needed to loosen sauce.Step 5Transfer noodles to a bowl or platter and top with three-fourths of crispy scallions. Serve with remaining scallions in a small bowl alongside.Step 6Do Ahead: Scallions can be fried 1 day ahead. Keep scallion oil chilled; store scallions between layers of paper towels in an airtight container at room temperature.How would you rate Scallion-Oil Noodles?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleDelicious! Slicing the scallions isn't a quick process, but worth it! Cooked the scallions in a wok and they browned and crisped nicely in 25 minutes. Didn't have soy paste so used Gochujang, which led to a spicier end product, but the flavor of the scallion oil was still prominent. Looking forward to trying this again with soy paste. LaurenPhiladelphia, PA3/18/2022I'm a big fan of Bon Appetit recipes but this was really boring and not worth the effort. The scallions take a long time to chop and quite a while to fry. The soy paste is not easy to find (and we live in NYC) and basically seems like soy sauce with the texture of oyster sauce. What was the end of product? Really salty (didn't even use the full amount of soy paste) and not very interesting. I can think of many other noodle recipes that are simpler, easier and tastier. 2 stars.Daniel CNYC, NY4/17/2021These are amazing. I've made them four or five times since learning the recipe. Fantastic on their own - perfect comfort food - or a delicious foundation for anything you want to add on top: grilled chicken, soft egg, veggies, pickles or any of hot sauce. Don't miss; get the soy paste.AnonymousPhiladelphia, PA6/8/2020Excellent method.  I thought I had scallions, but turns out I had green garlic, which worked just as well.  I did not discard the green garlic and just ate it with the noodles.  AnonymousPhilly6/1/2020This dish was completely worth the effort, which included a trip to the Asian market for soybean paste.  Extraordinarily delicious!  AnonymousCincinnati 4/20/2020I added a few whole garlic cloves and a red Thai chili pepper to the scallions as they fried, then discarded them. It gave a nice kick to the dish and I had rave reviews!AnonymousOakville, Ontario4/13/2020These were awesome. Fair amount of knife work to cut all the scallions, and the cook time for the oil was closer to 45 min for me but worth it. Once you have the oil the final dish comes together really quickly! Excited to play more with the soy pastebenjamingodfrey47@gmail.comChicago4/11/2020Taiwanese here, haven't made this one but \"soy paste\" is actually a really common ingredient in any taiwanese kitchen. (The one that's recommended in this article is really bougie lol). For alternative Taiwanese soy paste brands, try \"Kimlan\", \"Kim Ve Wong\", or \"Wan Jia Shan\", I believe you can find them in your local Asian supermarket.cwhuSan Francisco, California3/5/2020Too much salt, esp in the paste, and the tastiness of the dish isn't great enough to compensate. The big plus for me was learning to slowly cook the scallion strips. I will use that knowledge in something else.AnonymousGardena, CA  BA subscriber2/29/2020Haven't tried it yet b/c I, too, need an alternative to the out-of-stock soy paste. (Although the fried scallions and resulting scallion oil is sometheing worth trying.)Madeleine Kamman RocksBoston a1/25/2020Can you provide examples of other brands of Taiwan Soy Paste. Pretty sure it's different from Korean style as well as Miso substitute. I'm looking at picking up some Kimlan for now. The version you suggest is out of stock and their miso/soy paste alternate is out of stock as well. I know I can sub in Dochuchang or Miso, but want to stay to the recipe for now.\nAnonymousPennsylvania1/5/2020It’s just okay. Preparing the scallions takes a really long time, and they add mostly crunch, no flavor. The noodles have a salty soy taste with no kick make it even a little interesting. AnonymousNew York City12/20/2019Just made these! They were delicious! sarahmc94Richmond, VA11/25/2019Explore Bon AppétitChineseEast AsianAsianTaiwaneseScallionOnionVegetableRamen NoodleNoodlePasta & NoodlesQuickEasySideMainVegetarianNut-FreeDairy-FreeLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Lisa Cheng Smith"]}