{"id": "ffcd8522f4cd4b49d8876dede99eb3f6", "url": "https://www.bonappetit.com/story/chefs-table-pastry-christina-tosi-cake", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Watch Christina Tosi’s ‘Chef's Table’ Birthday Cake Scene  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Scene from the New Season of ‘Chef’s Table’Christina Tosi‘s mesmerizing building of Milk Bar‘s signature birthday cake—and the story behind it—is our favorite part of the Netflix series‘ new season.By Alyse WhitneyApril 16, 2018FacebookTwitterEmailNetflixFacebookTwitterEmailIf it has been more than 48 hours since you watched Christina Tosi’s episode of Chef‘s Table: Pastry and you’re still thinking about birthday cake, please consult your doctor. Okay, maybe that’s a bit drastic, but the sweet season four premiere of the popular Netflix documentary series has been replaying in my head all weekend. And I don’t even really like cake.Turns out, neither does Tosi. “Cake is the thing you’re raised as a child in America to be the most exciting, celebratory dessert you can have, and… it was just okay,” she reveals on Chef’s Table. “It’s spongy, there’s not that much flavor, it’s usually a little dry, there’s not a lot of texture. Just a world of missed opportunities.”That lukewarm feeling about cake is what inspired her to redefine her relationship with the dessert and create Milk Bar’s iconic layered birthday cake. It is intricately stacked with layers of confetti cake, crunchy cake crumbs, frosting, and extra sprinkles, but has one major difference from the cakes you probably grew up eating.More layers than Shrek’s personality.\nNetflix“From being in culinary school around all these insane masters of beauty and perfection when it comes to finishing a cake, they had tired me out completely to the point where I was like, ‘I don’t think cake should be frosted,’” Tosi explains in the clip below. “I’ve seen how obsessed you can get with frosting a cake, and that time should be spent elsewhere ... we’re not in pottery class.”ContentThis content can also be viewed on the site it originates from.Ultimately, it’s what’s inside that counts, and giving customers that “dollhouse moment of looking in and seeing the world of amazing things happening inside.”  Tosi wants everyone to see the little intricacies of how she‘s thinking about your perfect layer cake. “So we don’t frost the sides of cake. That’s my diatribe on cake,” she concludes.Slice, slice, baby.\nNetflixElsewhere in Tosi’s Chef’s Table episode, she explains the “underground” origins of Crack Pie (which you can find the recipe for here), how cereal milk ice cream was conceived in the back of a 24-hour bodega, and more desserts that make her a “uniquely American chef” (in the words of Bon Appétit’s own editor at large Christine Muhlke). “She’s not trying to be French, she’s not running off to Japan. She is America, and America’s delicious.”Now, excuse me—is it anyone’s birthday out there? I could use an excuse to eat this cake, candles optional.Get the recipe:Momofuku Milk Bar’s Birthday Layer CakeView RecipeExplore Bon AppétitChristina TosiMomofuku Milk BarNetflixCakeDessertRead MorepromotionsCookies, Cake Balls, and Puppies! Celebrating Momofuku Milk Bar's Newest StoreGallery12 SlidesBy Joanna SciarrinoPhotography by Alex LauMilk Bar PieMomofuku Milk Bar’s Birthday Layer CakeBlueberry and Cream CookiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-16", "author": ["Condé Nast", "Alyse Whitney"]}