{"id": "ffe016f6a73c8fc7b21d0be7af700aba", "url": "https://www.bonappetit.com/story/pichet-ong-brothers-and-sisters-cake", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "Pichet Ong: The Chef Behind the Best Cakes We Ate This Year  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Chef Behind the Best Cakes We Ate This YearPichet Ong’s cakes at Brothers and Sisters in D.C. are wildly imaginative and equally delicious. We can’t stop thinking about them.By Elyse InamineAugust 16, 2018FacebookTwitterEmailPhoto by Scott SuchmanFacebookTwitterEmailPichet Ong grew up eating a breakfast spread that would impress anyone with a sweet tooth: oatmeal-raisin cookies, coffee cake, coconut sticky rice, strawberry ice cream, and sweet tapioca dumplings. “My dad was big on desserts,” Ong tells me over the phone, with a chuckle. “Ironically, I still do that now.”At Brothers and Sisters, an Asian-American-ish restaurant inside The Line hotel in Washington, D.C., and one of our Top 50 nominees, Ong begins each day with a slice of whatever cake there is (maybe it’s the caramelized-strawberry mousse one or the ethereal three-cheese cheesecake) and an iced coffee diluted with chocolate milk. It’s a deeply ingrained morning ritual he follows before he digs into his pastry director duties for the hotel: checking on proofing breads, doughs for tarts and crostatas, and all the cakes in progress. “Eating sweets makes me feel alive,” Ong says.Pichet Ong, always a dessert guy\nMelissa HomBack in the early 2000s, he shook up New York City’s pastry scene with his desserts at Jean-Georges Vongerichten’s 66 and Spice Market, weaving the Asian ingredients he grew up with in Bangkong, Hong Kong, and a small town in Singapore with fine-dining technique. Lime and coconut in panna cotta? White miso in ice cream sandwiches? Green tea in flourless chocolate cake? Sure, it may seem par for the course now, but during that time, it wasn’t.Eventually Ong left Vongerichten’s restaurants to try his own thing, like opening his own standalone pastry shop P*Ong, which he later closed, and consulting with brands like Nestle to develop the now coveted cherry blossom Kit Kats. As he went further down the consulting path and a growing craving for matcha everything took over the city, Ong disappeared from the restaurant scene.Then, last year he quietly resurfaced in Washington, D.C. working at Maketto, a restaurant that sells Taiwanese and Cambodian food and clothing from A.P.C. and Raised by Wolves, alongside Erik Bruner-Yang, the chef behind Brothers and Sisters. “I wanted to escape routine,” Ong says. “I wanted to start from zero, not to reinvent but to explore again.” That meant putting down roots in D.C., where he has no reputation (his pastry cooks don’t know even know about his career in New York City), and making giant, intricate cakes, which he’s never really tackled before in restaurants.“Every day, we have a new cake and each slice is like a plated dessert,” Ong says, getting excited.Behold the beauty of Ong's cake: The Copenhagen with pistachio nougat and honey\nScott SuchmanHis fantastic display of cakes at Brothers and Sisters has been the talk of the town since the restaurant opened in late 2017. Critics love them. Even our editor at large (and self-dubbed-not-a-dessert-guy) Andrew Knowlton saved room for them. You’ll understand why once you’ve spent a few minutes ogling at the seven cakes proudly arranged by the host stand. One day, you’ll find a blueberry pie and cheesecake hybrid, crowned with a dollop of torched meringue so it looks like a cartoonish beehive. Another day, a towering yet delicate crêpe cake, layered with Earl Grey cream and sprinkled with matcha.Just as he did in New York City, Ong has introduced his new home to his matcha-dusted, yuzu-infused creations. He tells me about a new addition to tomorrow’s cake menu: a cherry, matcha, and red bean one. He’s cooking down the cherry pits to make a bitter, almond-y paste that he’ll balance out with layers of marzipan, matcha, and red bean.“It’s come full circle,” he says. “I’m still fascinated with Asian food and French style, and here in D.C., I’m getting noticed again for what I do.”Read more about the 25 restaurant trends we saw in 2018Time to make some blackberry icebox cakeExplore Bon AppétitHot 10 2018The Hot 10Read MorecookingThe Long-Anticipated New Cookbook from a Teeny Bakery in North CarolinaBy Sarah JampelrestaurantsThe Mysterious and Magical World of Burrow, a Japanese Bakery Hiding In an Office LobbyBy Elyse InaminerestaurantsTechnicolor Croissants and More Glimpses Into the Future of PastriesBy Leah MenniesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Elyse Inamine"]}