{"id": "fff647ff010528c46cd154280acbaaed", "url": "https://www.bonappetit.com/story/pantry-staples-online", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Where to Buy Your Favorite Pantry Staples Online | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusWhere to Order Your Favorite Pantry Staples OnlineYour local grocery store is out of flour. The internet isn’t.By MacKenzie Chung FeganApril 8, 2020FacebookTwitterEmailFacebookTwitterEmailThis post is updated regularly as new options become available.For most of us, grocery shopping looks radically different these days. This is not the moment to pop to the store for that one specific thing you need or to plan leisurely visits to the artisan cheesemonger and the specialty butcher and that one tiny market that sells the labne that you like. And with many grocery stores running low on products like flour, beans, and yeast, chances are you’re working with some limitations.Here’s your reminder that some of our favorite food products, from duck fat tortillas to briny oysters, can be found online and shipped nationwide, either directly from the producers or through specialty stores. We’ve rounded up some of our favorites below:All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Flour & GrainsCentral MillingAlma SemilleraBluebird Grain FarmsMaine GrainsAnson MillsJanie’s MillGeechie BoyRancho Llano SecoHayden Flour MillsJovialBeans & LentilsMaine GrainsRancho GordoAlma SemilleraSuraj Spices & TeasGeechie BoyRancho Llano SecoNoodles & PastaUmi OrganicSfogliniGustiamoTortillasCaramelo TortillasVermont Tortilla CompanySpicesDiaspora CoPiment d’VilleRumi SpiceSpice Tree OrganicsBurlap & BarrelSuraj Spices & TeasThe Spice HouseCheesemongersSaxelby CheesemongersCheesemonger BoxMurray’s CheeseStinky BklynMozzarella CompanyCheesemakersCherry Grove FarmCowgirl CreameryGreen Dirt FarmRogue CreameryBeecher’s CheeseCypress GroveJacobs and Brichford Farmstead CheeseJasper Hill FarmNorthbay CreameriesPoint Reyes Farmstead Cheese CoShelburne FarmsSweet Grass DairyCrown Finish CavesProduceFrog Hollow FarmEckerton Hill FarmChelan Fresh FarmsThe Peach TruckJosh Pond BlueberriesImperfect FoodsThe Chef’s GardenFarm Fresh To YouSpecialty GrocersDi Bruno BrosZingerman’sKalamalaStonewall Kitchen99 Ranch MarketFormaggio KitchenMiracle PlumiShopIndianMouthmyPanierHashemsCuredSFMartMarket Hall FoodsSnuk FoodsGustiamoMexGrocerBourbon Barrel FoodsPersian BasketMongers' ProvisionsPublic GoodsPure Indian FoodsOilsWonder Valley Olive OilBondolio Olive OilCalivirgin Olive OilDurant Olive OilEnzo Olive OilBrightland Olive OilFrantoio Grove Olive OilCobram Estate Olive OilGrove 45 Extra Virgin Olive OilPineapple CollaborativeOlivaia’s OLA Olive OilOliver Farm Artisan OilsSalute Santé Grapeseed OilOrder meat online here!Buy fish online here!And charcuterie and cured meats, too!Explore Bon AppétitCoronavirusproductShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-08", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}